{"summary":"London mayoral candidate wants to give every person in the city £100 worth of a new crypto token, called London coin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287775\/london-mayoral-candidate-wants-to-give-100-in-crypto-to-every-resident","publishDate":"2024-04-11T07:43:43","id":1,"type":null,"title":"London mayoral candidate wants to give £100 in crypto to every resident","category":["PEOPLE"],"content":["Mayoral candidate Brian Rose wants to give every person in London £100 worth of a new crypto token under plans revealed on Thursday.","Going under the working title of the LONDON token, Rose’s plan would see a £1 billion liquidity pool created via a one-off tax on the profits made by the city's financial institutions.","According to Rose's campaign team, the plan is to make the new cryptocurrency accepted across London's transport network and usable for paying council bills, parking charges and other expenses.","The campaign team argued that the proposed 1% Tradfi tax on profits from London's large financial institutions for the new token would enable the intervention necessary to accelerate the city's adoption and growth in the cryptocurrency sphere.","\"The LONDON coin will give Londoners a real relationship with their money.&nbsp; They will be able to hold it, earn interest on it, save it, trade it, stake it, all with decentralized finance protocols directly from their phones,\" Rose told The Block.","\"Imagine every one of our nine million citizens, from the young to the old, from the rich to the poor, from the educated to the not, all being able to understand money for the very first time in their lives,\" Rose added.","Rose said that, if elected, the LONDON token would be available through popular exchanges — with a full cryptocurrency financial education platform also planned to help the city’s citizens learn how to manage their digital wallets, invest their tokens and get involved in the blockchain economy.","\"As an entrepreneur and former banker of 15 years, I realize that the number one problem Londoners are facing is a total lack of financial education.&nbsp; Strangely enough our schools don't teach it, yet this ignorance has devastating consequences because it cuts across all aspects of life: money is needed for business, for family, for retirement, for entertainment, for everything,\" Rose said.","Rose added that the LONDON token, equipped with inherent utility and a substantial liquidity pool, could serve as an ideal means to offer essential financial education to every individual in Greater London.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Greater London","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Rose","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LONDON","content":"LOCATION"},{"type":"Brian Rose","content":"PERSON"}],"hashtag":["UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}