{"summary":"In a public comment letter, Consensys has urged the SEC to consider Ethereum’s positive qualities that — in some cases — are better than Bitcoin’s.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285746\/consensys-sec-ethereum-etf-comment-letter","publishDate":"2024-03-30T04:12:16","id":1,"type":null,"title":"Consensys urges SEC to recognize Ethereum&#x27;s better-than-Bitcoin qualities","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Consensys responded to the United States Securities and Exchange Commission's request for information on whether <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +3.32%\n    <\/span><\/a> <!----><\/span><\/span>'s proof-of-stake consensus mechanism raises \"unique concerns\" of fraud and manipulation worth considering regarding applications for spot ether exchange-traded funds.<\/span>","In <a href=\"https:\/\/publuu.com\/flip-book\/449401\/1013485\" data-v-f87c67ca=\"\">a comment letter<\/a> filed to the regulatory agency, the blockchain and web3 software development company behind the well-known MetaMask wallet said such concerns are, in Consensys' own summary, \"wholly without merit.\"","\"In fact, Ethereum’s PoS implementation meets and even exceeds the security of Bitcoin’s Proof of Work (PoW), which underlies bitcoin-based ETFs that have already been approved for trading by the SEC,\" Consensys explained in <a href=\"https:\/\/consensys.io\/blog\/comment-letter-to-sec-on-eth-etf-approval-pos\" data-v-f87c67ca=\"\">a blog post<\/a>.","Consensys also noted that Ethereum features faster block finality than the Bitcoin network and a segregation of duties between proposers and attesters that helps prevent large stakeholder control, costs more to attack than Bitcoin, penalizes validators for violating protocol rules, and is more environmentally friendly than Bitcoin. (As The Block reported earlier this week, the 13,900 nodes supporting the Ethereum network are now running <a href=\"https:\/\/www.theblock.co\/post\/285262\/ethereum-one-million-validators\" data-v-f87c67ca=\"\">more than 1 million validators<\/a>.)","It also noted that Ethereum's active developer community is larger than Bitcoin's, and that the blockchain is also fully public and transparent.","\"We urge the SEC to recognize the advanced safeguards inherent in Ethereum’s design,\" Consensys wrote, \"which not only meet but exceed the exemplary security and resilience safeguards underlying Bitcoin-based ETPs that have previously been approved by the SEC.\"","While spot bitcoin ETFs have proven to be exceptionally popular, whether or not a spot ether ETF will be approved in May of this year remains up for debate. Bloomberg ETF analysts recently <a href=\"https:\/\/www.theblock.co\/post\/285512\/bitwise-files-for-spot-ethereum-etf-amid-sec-approval-uncertainty\" data-v-f87c67ca=\"\">estimated<\/a> the chances of a spot <span data-v-f87c67ca=\"\">Ethereum exchange-traded fund<\/span> gaining approval in May to be about 30%."],"hashtag":["SEC","SPOT ETHEREUM ETF","WALLET MAKERS"]}