{"summary":"Bitcoin&#x27;s price gained on Thursday after the ECB voted to keep interest rates on hold for the fifth consecutive meeting.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287824\/bitcoin-price-gains-despite-a-pullback-in-global-markets-as-ecb-holds-rates-steady","publishDate":"2024-04-11T11:39:47","id":10,"type":null,"title":"Bitcoin price gains despite a pullback in global markets as ECB holds rates steady","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\" data-v-03de5780=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.41%\n    <\/span><\/a> <!----><\/span><\/span><\/span><\/span><span data-v-f87c67ca=\"\" data-v-03de5780=\"\">'<\/span>s price gained on Thursday after the European Central Bank (ECB) voted to keep interest rates on hold for the fifth consecutive meeting.&nbsp;","The largest digital asset by market capitalization increased by around 1.5% in the past 24 hours and was changing hands for $69,607 at 11:16 a.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.","Although bitcoin typically closely tracks risk-on assets like major equity indices, the cryptocurrency's upward trajectory came as global markets inched down. The Dow Jones Industrial Average fell for a fourth day in a row, the S&amp;P 500 declined 1% and the Nasdaq Composite dropped 0.1%. In Europe, the regional Stoxx 600 index fell 0.7%, and London's FTSE fell 0.67%.","Bitcoin moved higher on Thursday despite a pullback in global markets. Image: The Block.","The eurozone’s key interest rate remained unchanged at 4%, the main refinancing rate at 4.5% and the marginal lending facility at 4.75%.","Today's decision means that interest rates across the eurozone will stay at their highest level in over two decades.","The <a href=\"https:\/\/www.ecb.europa.eu\/press\/pr\/date\/2024\/html\/ecb.mp240411~1345644915.en.html\" data-v-f87c67ca=\"\">ECB said<\/a> it would only be appropriate to reduce the current level of monetary policy restriction if the central bank receives further evidence that inflation is converging to the target in a sustained manner.","PIMCO Portfolio Manager Konstantin Veit suggested that if incoming data, particularly concerning wages and profits, aligns with the scenario outlined in the March projections, the ECB will likely implement rate cuts in June.","In an email sent to The Block, Veit anticipated that once the ECB begins reducing rates, it will do so cautiously, opting for conventional 25 basis point steps.","The analyst observed that market expectations have adjusted to reflect a significant reduction in anticipated rate cuts and highlighted that market risks now lean towards fewer cuts. \"Risks are probably towards less cuts, mainly on the back of sticky services inflation, a resilient labour market, loose financial conditions and ECB risk management considerations,\" Veit said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4.5%","content":"PERCENT"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Veit","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"0.7%","content":"PERCENT"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"0.1%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"4.75%","content":"PERCENT"},{"type":"London","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"0.67%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"+1.41%","content":"PERCENT"},{"type":"11:16 a.m. ET","content":"TIME"},{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"$69,607","content":"MONEY"},{"type":"Nasdaq Composite","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Konstantin Veit","content":"PERSON"}],"hashtag":["CRYPTO MOVERS","ECB"],"authors":["Brian McGleenon","The Block"]}