{"summary":"According to security researchers PeckShield, $120.3 million in a variety of tokens was stolen from users of the protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126072\/defi-protocol-badgerdao-exploited-for-120-million-in-front-end-attack","publishDate":"2021-12-02T05:41:58","id":10001,"type":null,"title":"DeFi protocol BadgerDAO exploited for $120 million in front-end attack","category":["HACKS"],"content":["DeFi protocol BadgerDAO has fallen victim to a large hack. According to security researchers PeckShield, $120.3 million was stolen from users of the protocol.","BadgerDAO is a DeFi protocol focused on providing yield for bitcoin. The idea is that you bridge your bitcoin over onto a smart contract platform like Ethereum, as wrapped bitcoin, which you can then use within DeFi applications. BadgerDAO provides a variety of vaults where users can park their wrapped bitcoin and earn yields depending on the yield generation strategies used by the vaults.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Badger has received reports of unauthorized withdrawals of user funds. As Badger engineers investigate this, all smart contracts have been paused to prevent further withdrawals,\" BadgerDAO tweeted today, confirming the exploit.<\/span>","PeckShield documented the variety of assets stolen in the hack, which range from tokens like wrapped bitcoin (WBTC) and convex finance (CVX) to more complicated tokens like \"<span data-sheets-formula-bar-text-style=\"font-size:13px;color:#000000;font-weight:normal;text-decoration:none;font-family:'Arial';font-style:normal;text-decoration-skip-ink:none;\" data-v-f87c67ca=\"\">ibbtc\/sbtcCRV-f<\/span>.\" Many of the tokens represent assets held in a vault, meaning they can be redeemed for multiple tokens with varying values — making it harder to total the amount of funds stolen.","One user had around 900 bitcoin ($50.8 million) worth of tokens stolen in a <a href=\"https:\/\/etherscan.io\/tx\/0x951babdddbfbbba81bbbb7991a959d9815e80cc5d9418d10e692f41541029869\" data-v-f87c67ca=\"\">single transaction<\/a>. Another lost $5 million worth of tokens <a href=\"https:\/\/etherscan.io\/tx\/0x951babdddbfbbba81bbbb7991a959d9815e80cc5d9418d10e692f41541029869\" data-v-f87c67ca=\"\">in one go<\/a>.","The front end to the BadgerDAO website was reportedly acccessed, according to comments in the project's Discord channel, and used to intercept transactions. One admin said it appears that an API key for Cloudflare was compromised.","While protocols like BadgerDAO are decentralized and can be interacted with directly, it requires specialized knowledge to do so. Most users will use a front end like the BadgerDAO website (although alternative front ends can be used). But this does have an element of risk: if the front end gets comprised, as in this case, then it can lead to loss of funds.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$120.3 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$50.8 million","content":"MONEY"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}