{"summary":"WhaleFin represents the next generation digital asset platform that grows in lockstep with investors, as they embark on their digital wealth journey in a decentralised future","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127903\/amber-group-reimagines-digital-wealth-management-in-the-metaverse-with-launch-of-whalefin","publishDate":"2021-12-20T09:00:49","id":10004,"type":null,"title":"Amber Group Reimagines Digital Wealth Management In The Metaverse With Launch Of WhaleFin","category":["SPONSORED"],"content":["<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">WhaleFin represents the next generation digital asset platform that grows in lockstep with investors, as they embark on their digital wealth journey in a decentralized future<\/span><\/em>","Amber Group, a global leader in digital assets, today announced the launch of WhaleFin, its flagship digital asset platform that is uniquely positioned to empower mainstream investors to build wealth in the digital era and further democratize access to the world of crypto finance. Built with the deep expertise that Amber Group has developed serving both institutional and retail markets, WhaleFin is an all-in-one platform that bridges the demands from both markets, serving as the preferred gateway to crypto for users, regardless of their experience.","The launch of WhaleFin marks an important milestone for Amber Group, delivering on its mission to unlock the value of crypto finance for individuals and organizations, at a time when digital assets are gaining mainstream acceptance and adoption across global financial ecosystems. Designed with universality in mind, the WhaleFin combines institutional-grade features of the Amber Pro, launched in 2019, with the intuitive user interface and features of the Amber App, launched in 2020.","“The concept of wealth has changed radically over the last few years and there is an urgent need for investors to rethink the way they build wealth in a future that is increasingly digital and decentralized”, said Michael Wu, CEO and Co-founder of Amber Group. “WhaleFin represents the gateway into the new world of finance, one that will be underpinned by the growth of the metaverse and the rising prominence of digital assets. At Amber Group, we are incredibly excited to help shape this decentralized future, as we onboard investors at all levels into the world of crypto finance.”","With WhaleFin, all users can now access institutional-grade digital asset trading tools through a seamless interface on both web browser and mobile app. The platform comes in two versions to cover the full spectrum of investing needs - the ‘pro’ version lends comprehensive trading features for diversified investing activities, while the ‘lite’ version enables crypto beginners to buy, earn and swap digital assets simply and securely.","Beyond empowering users with the best tools to make sound investment decisions, WhaleFin also empowers users with the opportunity to invest in a sustainable future. WhaleFin plans to harness resources from across the industry to support public education campaigns on the climate crisis as well as to mobilise communities to take action for our planet.","For more information about WhaleFin, please <a href=\"https:\/\/www.whalefin.com\" data-v-f87c67ca=\"\">click here<\/a>. Due to regulatory reasons, WhaleFin does not currently support or provide services to customers from some jurisdictions.","<strong data-v-f87c67ca=\"\">About Amber Group<\/strong>","Amber Group is a leading digital asset platform operating globally with offices in Asia, Europe, and the Americas. The firm provides a full range of digital asset services spanning investing, financing, and trading. Amber is backed by prominent investors including Paradigm, Dragonfly, Pantera, Polychain, Sequoia, and Tiger Global.<br data-v-f87c67ca=\"\">\nFor more information, please visit www.ambergroup.io, or contact them at <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"50202210313d32352237223f25207e393f\">[email&nbsp;protected]<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"WhaleFin marks","content":"MONEY"},{"type":"Polychain","content":"LOCATION"},{"type":"Michael Wu","content":"PERSON"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Americas","content":"LOCATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Amber App","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Sequoia","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}