{"summary":"The attacker introduced a reentrancy bug to steal funds using a flash loan exploit.\nThe projects lost a combined $11 million in the attack, hours after a similar incident involving Deus Finance.\n","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137932\/defi-protocols-agave-and-hundred-finance-exploited-on-gnosis-chain-for-11-million","publishDate":"2022-03-15T13:46:02","id":1000,"type":null,"title":"DeFi protocols Agave and Hundred Finance exploited on Gnosis Chain for $11 million","category":["DeFi"],"content":["An attacker has siphoned over $11 million from Agave and Hundred Finance in what appears to be a flash loan reentrancy attack on both DeFi protocols on the Gnosis chain.","The DeFi platforms each confirmed the hacks in <a href=\"https:\/\/twitter.com\/Agave_lending\/status\/1503725275917565954\" data-v-f87c67ca=\"\">Twitter posts<\/a> on Tuesday, stating that their contracts have been <a href=\"https:\/\/twitter.com\/HundredFinance\/status\/1503754916300476420\" data-v-f87c67ca=\"\">paused<\/a> to forestall further damage.&nbsp;The attack marks the second <a href=\"https:\/\/www.theblockcrypto.com\/daily\/108081\/flash-loans-a-blessing-or-a-curse\" data-v-f87c67ca=\"\">flash loan exploit<\/a> recorded today as Deus Finance DAO also <a href=\"https:\/\/www.theblockcrypto.com\/post\/137817\/deus-finance-dao-suffers-3-million-flash-loan-attack\" data-v-f87c67ca=\"\">lost<\/a> $3 million.","Examining the transaction <a href=\"https:\/\/dashboard.tenderly.co\/tx\/xdai\/0x534b84f657883ddc1b66a314e8b392feb35024afdec61dfe8e7c510cfac1a098\" data-v-f87c67ca=\"\">breakdown<\/a> data for both exploits on <a href=\"https:\/\/dashboard.tenderly.co\/tx\/xdai\/0xa262141abcf7c127b88b4042aee8bf601f4f3372c9471dbd75cb54e76524f18e\" data-v-f87c67ca=\"\">Tenderly<\/a>, the attacker exploited a reentrancy vulnerability in both protocols. Reentrancy is a Solidity programming language vulnerability that allows an attacker to trick a protocol’s contract into making an external call to an untrusted contract. Once this happens, the hacker can then use this untrusted contract to make repeated calls to the protocol to drain its funds.","In the case of Agave and Hundred Finance, the attacker introduced a reentrancy bug on both protocols paving the way for a flash loan exploit. The reentrancy vulnerability appears centered on the “callAfterTransfer” function, allowing the hackers to continue borrowing from the protocols — siphoning off massive swathes of liquidity.","In essence, the attacker was making recursive calls to siphon off user funds without having to put up additional collateral. Then the attacker terminated the exploit with a “liquidationCall,” paying back their initial flash loan while still holding significant liquidity from both projects.","The attacker has begun to <a href=\"https:\/\/etherscan.io\/address\/0x0a16a85be44627c10cee75db06b169c7bc76de2c#tokentxns\" data-v-f87c67ca=\"\">launder<\/a> the funds via Tornado Cash, but <a href=\"https:\/\/etherscan.io\/address\/0xd041ad9aae5cf96b21c3ffcb303a0cb80779e358#tokentxns\" data-v-f87c67ca=\"\">Etherscan<\/a> hasn't labeled their address as associated with a DeFi exploit as of the time of writing.","Agave is a lending protocol on the Gnosis chain and is a fork of the popular Aave protocol. Hundred Finance is a multi-chain lending project and is a fork of Compound.","Cream Finance, a DeFi lending protocol that shares a similar codebase to Compound, also suffered a flash loan reentrancy <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116055\/creamfinance-exploited-in-18-8-million-flash-loan-attack\" data-v-f87c67ca=\"\">attack last summer<\/a>. The exploit led to the loss of $19 million in crypto tokens from the project."],"hashtag":[]}