{"summary":"Coinbase said Thursday that it will go live with nano ether (ETH) futures on its derivatives exchange on August 29.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165862\/coinbase-to-list-nano-eth-futures-next-week","publishDate":"2022-08-25T16:37:55","id":10000,"type":null,"title":"Coinbase to list nano ETH futures next week","category":["EXCHANGES"],"content":["Coinbase is set to go live with its second derivatives product next week.","\"Coinbase Derivatives Exchange will be launching a Nano Ether futures contract (ET) on August 29th as we continue to build an accessible futures market for the retail trader,\" the firm said in a <a href=\"https:\/\/blog.coinbase.com\/coinbase-derivatives-exchange-to-add-nano-ether-futures-contract-1bb88ef51b3e\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">blog post<\/a> published Thursday.","Likes its nano bitcoin (BTC) futures, each contract will represent a fraction of an ETH token — in this case, 1\/10th of a unit. The product \"will be accessible for trading via several leading third-party retail brokers and clearing firms upon its launch,\" Coinbase said.","Coinbase kicked off its derivatives market push earlier this year with the acquisition of FairX, a derivatives market regulated by the Commodity Futures Trading Commission. As previously reported, Coinbase is looking to make <a href=\"https:\/\/www.theblock.co\/post\/137953\/coinbase-outlines-the-path-ahead-for-its-planned-derivatives-offering\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">significant inroads<\/a> into the US crypto derivatives market. Its broader market ambitions are subject to approval from US authorities, a state of affairs Coinbase pointed to in its Thursday blog post.&nbsp;","\"Coinbase Financial Markets is awaiting approval for its license to operate a futures commission merchant (“FCM”) to offer futures directly to our clients as we take another step in creating an accessible and regulated US crypto derivatives market,\" the firm said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase Derivatives Exchange","content":"ORGANIZATION"},{"type":"August 29th","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Coinbase Financial Markets","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Michael McSweeney","The Block"]}