{"summary":"Billionaire investor Mark Cuban argues that politicians need to get behind the crypto world, or the U.S. will miss out on a big opportunity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108313\/mark-cuban-defi-could-be-the-next-great-growth-engine-for-the-us","publishDate":"2021-06-14T08:33:47","id":10019,"type":null,"title":"Mark Cuban: DeFi could be the ‘next great growth engine’ for the US","category":["DEFI"],"content":["Mark Cuban, billionaire investor and owner of the National Basketball Association’s Dallas Mavericks, said yesterday that the U.S. government and regulators need to start getting behind crypto innovations, such as the decentralized finance (DeFi) industry. Otherwise, he argued, the U.S. will “lose the next great growth engine that this country needs.”","His thoughts came in a <a href=\"https:\/\/blogmaverick.com\/2021\/06\/13\/the-brilliance-of-yield-farming-liquidity-providing-and-valuing-crypto-projects\/\" data-v-f87c67ca=\"\">blog post<\/a> entitled “The Brilliance of Yield Farming, Liquidity Providing and Valuing Crypto Projects.”&nbsp;","At the end of the post, Cuban discussed the broader potential of the DeFi industry. He noted that DeFi projects are, by their very nature, decentralized and not located in the U.S. The entrepreneur then partly put the blame on regulators for pushing innovation out of the country.","“This is not only because of the ethos of Decentralized Autonomous Organizations (DAOS), but also because of the ABSOLUTE STUPIDITY of our regulators forcing some of the most impactful and innovative entrepreneurs of this generation to foreign countries to run their businesses,” he said.","Cuban predicted that in 10 to 20 years we will look back at this period of time and observe that world-changing companies were built. “Among those companies, [it’s] already a certainty that De-Fi and other crypto organizations will be at or near the top of the list,” he said, before warning that if politicians choose to continue to dampen innovation, this growth potential could be wasted.","The post also went more deeply into his recent thoughts about DeFi, particularly focusing on certain projects he has invested in, including Ethereum scaling solution <a href=\"https:\/\/www.theblockresearch.com\/polygon-a-technical-overview-105799\" data-v-f87c67ca=\"\">Polygon<\/a> and lending protocol <a href=\"https:\/\/www.theblockcrypto.com\/linked\/75003\/aave-becomes-second-defi-protocol-to-hit-1-billion-in-total-value-locked\" data-v-f87c67ca=\"\">Aave<\/a>.","Cuban said that the main differences between traditional businesses and decentralized ones is that the DeFi firms don’t need to raise as much money to begin with — or focus on maximizing profits.","“That is not to say that every crypto blockchain or DeFi project will work. They won’t,” Cuban said, adding, “Crypto is brutally competitive. But in crypto vs traditional, centralized businesses, all other things being equal, I’m taking crypto every time.”","When it comes to choosing which tokens to invest in, Cuban said that he looks at factors including current revenue, growth rates, how likely projects will keep a competitive advantage and the strength of the community behind the project — the latter presumably explaining his fondness for Dogecoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Valuing Crypto Projects","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"National Basketball Association’s Dallas Mavericks","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"“Crypto","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}