{"summary":"Dfinity Foundation will invest in an accelerator program that supports development of web3 tech across multiple ecosystems","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287084\/internet-computer-contributor-dfinity-commits-15-million-to-accelerator-platform","publishDate":"2024-04-09T09:00:04","id":10016,"type":null,"title":"Internet Computer contributor Dfinity investing $15 million in accelerator platform","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Dfinity Foundation, a major contributor to the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Internet Computer <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248379\/internet-computer-icp-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Internet_Computer_logo.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ICP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.089%\n    <\/span><\/a> <!----><\/span><\/span> blockchain, said it is investing $15 million in an accelerator platform called Olympus.&nbsp;<\/span>","\"Olympus supports the development and adoption of web3 technology across multiple ecosystems,\" Dfinity said in a statement. \"The acceleration platform is a first of its kind platform and will be used by teams around the world to organize and launch their own accelerator programs.\"","Dfinity, based in Zurich, said that by the end of this year, Olympus will transition into a decentralized autonomous organization, or DAO.","\"The $15 million in funding will be used to support development and maintenance of the Olympus platform and will also be used to fund the first few cohorts of accelerators,\" the organization told The Block. \"These accelerators will support projects building on Internet Computer, but with [its] multichain support for Bitcoin, Ethereum ... projects will not just be limited to the Internet Computer blockchain.\"","In the future, Dfinity said cohorts will gain funding through a native token generation event, or TGE. Olympus will provide a \"consolidated platform for open and sustainable project acceleration by providing access to grants, crowdfunding, VC investments, and referrals all in one place and on-chain,\" Dfinity said in its statement.","Last month, in an <a href=\"https:\/\/medium.com\/dfinity\/the-history-of-the-internet-computer-in-10-steps-1fe956475625\" data-v-f87c67ca=\"\">online post<\/a>, Dfinity founder and Chief Scientist Dominic Williams called Internet Computer \"the only blockchain to run with fully-automated DAO governance and true autonomy.\" Williams is also the founder of the Internet Computer blockchain.","\"Traditional accelerator programs are permissioned and operate as silos, many are also not sustainable and rely on grants. Olympus is a new model,\" Williams also said in the statement.","Hong Kong-based Web3Labs will provide additional support to the Olympus platform.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Olympus","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Williams","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"-0.089%","content":"PERCENT"},{"type":"Dfinity Foundation","content":"ORGANIZATION"},{"type":"Zurich","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"TGE","content":"ORGANIZATION"},{"type":"Dominic Williams","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Dfinity","content":"ORGANIZATION"},{"type":"ICP","content":"LOCATION"},{"type":"Dfinity","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}