{"summary":"As of this past summer, the fund had $200 million of assets under management.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186306\/crypto-hedge-fund-galois-capital-says-half-of-funds-stuck-on-ftx-ft","publishDate":"2022-11-12T05:00:11","id":10018,"type":null,"title":"Crypto hedge fund Galois Capital says half of funds stuck on FTX: FT","category":["COMPANIES"],"content":["Crypto hedge fund Galois Capital has told its investors that almost half of its funds are stuck on the failed crypto exchange FTX, according to a report in the Financial Times.&nbsp;","Kevin Zhou, co-founder of Galois, wrote to investors in recent days, saying that it had been able to pull some money from the exchange, but that about half of the funds were still stuck, the <a href=\"https:\/\/www.ft.com\/content\/726277bb-35a1-4d35-9df9-3e1cca587b77\" data-v-f87c67ca=\"\">FT report<\/a> said.","“We will work tirelessly to maximise our chances of recovering stuck capital by any means,\" wrote Zhou, adding that if the exchange did file for bankruptcy protection, the firm would become a creditor. FTX filed for Chapter 11 bankruptcy protection on Friday.","Galois, one of the biggest crypto quant hedge funds, had <a href=\"https:\/\/twitter.com\/Galois_Capital\/status\/1591204008672497664\" data-v-f87c67ca=\"\">tweeted<\/a> last night that \"significant funds\" were stuck on the exchange and it had not used \"any Bahamian method to move funds out.\"","\"I’m sorry guys. Seriously, I didn’t see this coming. Didn’t see the 3AC situation either. Lessons learned. Will try to do better,\" the company <a href=\"https:\/\/twitter.com\/Galois_Capital\/status\/1590888426114494465\" data-v-f87c67ca=\"\">said<\/a>.","As of this past summer, Galois was managing more than $200 million worth of assets, the FT report said.","The Block contacted Galois for comment but did not immediately hear back.&nbsp;","<strong data-v-f87c67ca=\"\">Read more: <\/strong><a class=\"\" href=\"https:\/\/www.theblock.co\/post\/186132\/ftx-collapse-timeline-six-days-that-rocked-the-crypto-industry\" data-v-3d3dc97c=\"\" data-v-f87c67ca=\"\"><span data-v-3d3dc97c=\"\" data-v-f87c67ca=\"\">FTX collapse timeline: Six days that rocked the crypto industry<\/span><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last night","content":"TIME"},{"type":"Kevin Zhou","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Galois Capital","content":"ORGANIZATION"},{"type":"Galois","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}