{"summary":"BinanceUS leads the way in the decline in spot trading pairs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238519\/spot-trading-pairs-decline-across-exchanges","publishDate":"2023-07-08T17:48:16","id":10013,"type":null,"title":"Spot trading pairs decline across exchanges","category":["COMPANIES"],"content":["Cryptocurrency traders have fewer pairs to punt.","The number of spot pairs across major cryptocurrency exchanges has declined over the course of the year, according to data compiled by The Block Research.&nbsp;","Monthly spot pairs on Binance, the largest exchange by global volume, declined from 1,420 in January to 1,380 in July, according to The Block's data dashboard. Its sister company, BinanceUS, saw monthly spot pairs decline from 337 in June to 184 in July.","The crypto market has seen exchanges end support for trading pairs in the wake of the U.S. Securities and Exchange Commission's suits against Coinbase and Binance earlier in June. The agency alleges that the exchanges traded unregistered securities.&nbsp;","Monthly spot trading pairs supported by Coinbase declined from 557 in March to 524 in July.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/monthly-spot-pairs-for-exchanges\/embed\" title=\"Monthly Spot Pairs for Exchanges\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The number of spot pairs has also declined at Kraken, with the number of pairs declining from a high of 668 in February to 651 in July.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"June","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"July","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}