{"summary":"Ex BitFlyer CEO Yuzu Kano is seeking to take back his old position and lead the company to an initial public offering, according to Bloomberg.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215276\/bitflyers-ex-ceo-vies-for-former-role-bloomberg","publishDate":"2023-02-26T19:53:28","id":10020,"type":null,"title":"BitFlyer&#x27;s ex-CEO vies for former role: Bloomberg","category":["EXCHANGES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The former CEO of BitFlyer, Yuzu Kano, has a plan to take back his old position and lead the company to an initial public offering, according to Bloomberg.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kano’s proposal is set to go before shareholders in a scheduled meeting next month.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Yuzu Kano, the co-founder of Japanese crypto exchange BitFlyer, is reportedly planning to retake his old position as chief executive officer of the firm, according to a&nbsp;<a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-26\/japan-s-bitflyer-founder-seeks-comeback-to-calm-crypto-turmoil\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Bloomberg<\/span><\/a> report.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kano’s proposal to reassume the CEO role and pursue an initial public offering will be presented to shareholders next month in a bid to put to rest a dispute between shareholders and the company’s management, said Bloomberg.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kano, who stepped aside from the role of CEO in 2019, owns 40% of the company, according to Bloomberg. Currently, he serves as the CEO of a BitFlyer subsidiary, BitFlyer Blockchain Inc.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">An earlier bid to sell BitFlyer last year was <a href=\"https:\/\/www.theblock.co\/post\/174231\/aca-group-decides-to-give-up-on-bitflyer-holdings-acquisition-nikkei\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">defeated<\/span><\/a> by Kano, who reportedly said that the Singapore-based fund ACA Partners “wanted to get rid of me, both as a shareholder as well as the representative of a subsidiary.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Issues involving BitFlyer shareholders will be addressed at the forthcoming meeting according to BitFlyer's current CEO, Hideki Hayashi, who Bloomberg said declined to address Kano’s statements.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hideki Hayashi","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"BitFlyer Blockchain Inc.","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuzu Kano","content":"LOCATION"},{"type":"Kano","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}