{"summary":"Bloomberg Senior ETF Analyst Eric Balchunas said that the current bitcoin ETF action is reminding him of a mania-like event.\nHe cautioned that volumes may not be able to remain at current levels and that the price is at a risk of a correction.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279930\/upward-spiral-for-bitcoin-due-to-huge-etf-volumes-and-low-supply-predicts-analyst","publishDate":"2024-02-29T13:02:44","id":1002,"type":null,"title":"‘Upward spiral’ for bitcoin due to huge ETF volumes and low supply, predicts analyst","category":["Markets"],"content":["The surge in demand for bitcoin from the newly launched exchange-traded funds in the U.S., coupled with the decreasing available supply, could trigger a short-term hype cycle for the digital asset, said Bloomberg Senior ETF Analyst Eric Balchunas.","“Because it's a scarce asset and there's not a ton of people trading it — a lot of people just hold — the float on it is pretty small. The more demand from ETFs, the more the float is affected. And the more the float’s affected, the price goes up, which would create more demand,” said Balchunas in an interview. “You could have an upward spiral that goes a little while.”","Balchunas, who has been very closely tracking the launch of the bitcoin spot ETFs, had estimated the ETFs would see an upper band of inflows of $10-15 billion. So far, these ETFs are already at $7 billion and it’s only been a month.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-aum-ex-gbtc-daily\/embed\" title=\"Spot Bitcoin ETF AUM ex-GBTC (Daily)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","“If the price cooperates, they're probably going to do multitudes of my estimate,” he said, noting that the ETF action is starting to remind him of a mania, likening it to Ark Invest, which was hot for a period of around a year.&nbsp;","“The way people are talking and the sort of volume increase matched with the price increase, it's all feeding on in on itself,” he added.","Balchunas was cautious, however, regarding the ETFs' ability to sustain recent inflow levels. Were the ETFs to continue at this current pace, it would be around $150 billion of inflows over the year, tenfold what he predicts. “That would be crazy,” he said.","He also warned that rising bitcoin prices might be unsustainable, and wondered aloud as to whether there will be a correction period that could sober people up.","The analyst said it wouldn’t count for much if a big company put a large amount of funds into the ETFs in one shot. The result would show a sudden growth, which would then go flat.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/bitcoin-spot-etf-volumes\/embed\" title=\"Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Balchunas added that over the years he’s observed that volume is the leading indicator for ETFs. If there’s high volume, it tends to lead to higher asset flows over time, he said.&nbsp;","“Volume is not man made. It has to grow naturally. It's very coveted,” he said."],"hashtag":["SPOT BITCOIN ETF"]}