{"summary":"Neutron became the first Cosmos blockchain to launch using replicated security, leaning on the Cosmos Hub for its security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230581\/cosmos-blockchain-neutron-goes-live-on-mainnet-with-replicated-security","publishDate":"2023-05-12T08:52:10","id":10025,"type":null,"title":"Neutron, first Cosmos blockchain leveraging replicated security, went live","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Neutron became the first Cosmos blockchain to launch using <a href=\"https:\/\/www.theblock.co\/post\/219219\/cosmos-hub-releases-replicated-security\" data-v-f87c67ca=\"\">replicated security<\/a> on Thursday. <\/span>","Replicated security enables blockchains in the Cosmos ecosystem to rely on the validator set of the Cosmos Hub for their security. This is instead of the blockchain maintaining its own security through a network of validators. By leaning on Cosmos Hub, blockchains in the Cosmos ecosystem are able to exist and fulfil their goals — typically focusing on providing one type of service or application — in a cost-effective way.","<span data-v-f87c67ca=\"\">Neutron serves as a platform for issuing smart contracts using <a href=\"https:\/\/cosmwasm.com\/\" data-v-f87c67ca=\"\">CosmWasm<\/a>, a computational environment within the Cosmos ecosystem. By aligning closely with the Cosmos Hub and benefiting from its high security, Neutron aims to provide cross-chain smart contract applications for the <a href=\"https:\/\/www.theblock.co\/post\/185784\/making-the-cosmos-hub-more-relevant-with-cosmos-co-founder-ethan-buchman\" data-v-f87c67ca=\"\">Cosmos ecosystem<\/a>.<\/span>","<span data-v-f87c67ca=\"\">\"By closely aligning the chain with the Cosmos Hub, the first and central Cosmos chain and benefiting from its high security, we have been able to focus on resolving the cross-chain limitations that smart contract applications were facing in Cosmos,\" said Avril Dutheil, general manager at Neutron.<\/span>","<span data-v-f87c67ca=\"\">The Neutron team said that replicated security will bring more value to the <a href=\"https:\/\/www.theblock.co\/post\/212030\/cosmos-hub-to-undergo-rho-network-upgrade-today\" data-v-f87c67ca=\"\">Cosmos Hub<\/a> and enable the development of complex and diverse applications for ATOM, the native asset of the Hub. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">\"[Replicated security] should help foster an ecosystem of closely aligned chains around the Hub, sometimes referred to as the ATOM Economic Zone (AEZ), and strengthen collaboration among appchains,\" Dutheil added.<\/span>","<span data-v-f87c67ca=\"\">Neutron was launched after the Cosmos community approved a governance <a href=\"https:\/\/www.mintscan.io\/cosmos\/proposals\/792\" data-v-f87c67ca=\"\">proposal 792<\/a> on May 6 voted in by ATOM holders. Currently chains wishing to use replicated security need to apply to the Cosmos Hub for permission.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Avril Dutheil","content":"PERSON"},{"type":"Dutheil","content":"PERSON"},{"type":"Neutron","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"May 6","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"ATOM","content":"ORGANIZATION"},{"type":"ATOM Economic Zone","content":"ORGANIZATION"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}