{"summary":"DeFi can redefine finance as we know it today, but how will that future become a reality?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144430\/decentralized-finances-essential-role-in-the-future-of-finance","publishDate":"2022-05-02T09:00:00","id":1002,"type":null,"title":"Decentralized Finance’s Essential Role in the Future of Finance","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DeFi can redefine finance as we know it today, but how will that future become a reality?<\/span><\/i>","<span data-v-f87c67ca=\"\">Decentralized finance (DeFi) evolved more rapidly than anyone could’ve imagined – <\/span><a href=\"https:\/\/defillama.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">growing<\/span><\/a><span data-v-f87c67ca=\"\"> from 700 million in 2019 to more than 200 billion today. Financial institutions have taken notice of this meteoric rise, but there’s a long way to go before they can harness the full capabilities of DeFi.<\/span>","<b data-v-f87c67ca=\"\">The complex demands of conventional finance&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Institutions operate in a highly regulated industry that’s full of stringent reporting requirements. On the other hand, DeFi was initially created to provide a permissionless solution that requires no more than an internet connection and funds to freely lend, borrow and save currencies.<\/span>","<span data-v-f87c67ca=\"\">Financial institutions have primarily stayed on the sidelines of DeFi because of this distinction. While the benefits are undoubtedly exciting, there is no room to compromise the permissioned requirements that are an important pillar of finance transactions today.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Institutional DeFi solutions have come onto the market in recent years, but there’s still understandable hesitancy to adopt new technology in such uncharted territory.<\/span>","<b data-v-f87c67ca=\"\">Building a bridge between two worlds<\/b>","<span data-v-f87c67ca=\"\">For financial institutions to embrace DeFi, it’s imperative that platforms continue to demonstrate the compliance, security, and market integrity that exists when it’s done correctly. At the same time, institutions must understand DeFi’s risks, which aren’t all that dissimilar to the capital markets.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Security must be the top priority when it comes to institutional-grade DeFi products. DeFi applications should follow the strict security, testing, and deployment standards that are required for traditional financial products. This includes thorough research of all protocols used, a gradual roll-out strategy, and routine security audits. This will lead to battle-tested offerings institutions can trust.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Today, technical know-how is required to harness the financial tools that DeFi offers. This needs to change. Building a user interface and experience akin to traditional finance is an important element that must materialize before DeFi can offer its full value to institutions and their clients. Eliminating the steep learning curve by abstracting out DeFi’s complexity will remove numerous barriers.<\/span>","<span data-v-f87c67ca=\"\">Bridging these two worlds sounds challenging, but it’s possible, and it enables everyone to win.<\/span>","<b data-v-f87c67ca=\"\">Redefining the future of financial services<\/b>","<span data-v-f87c67ca=\"\">As the financial system evolves, there will no longer be a distinction between DeFi and conventional finance. Multiple services will live in parallel, ultimately empowering individuals and institutions to choose the solutions that suit their unique circumstances and goals.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">DeFi technologies <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">and<\/span><\/i><span data-v-f87c67ca=\"\"> financial services are needed for this future to become a reality. Conventional institutions will become the critical customer service layer of finance, with a decentralized model – and the technology that drives it – at the center of all transactions. For example, institutions will enable customers to interface with DeFi through a financial advisor.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thoughtful steps toward a future that fuses conventional finance and DeFi will result in impacts that offer greater value to institutions, individuals, and society as a whole. But first, we must embrace that careful evolution – instead of a rapid revolution – is the most effective catalyst for innovation.&nbsp;&nbsp;<\/span>","<a href=\"http:\/\/vesper.finance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Vesper Finance<\/span><\/a><span data-v-f87c67ca=\"\"> was created to deliver a professionalized, secure, and simple-to-use DeFi experience for individuals and institutions. With multiple products across three chains – and more in the pipeline – Vesper combines conventional finance’s rigor with DeFi’s promise and innovation.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Vesper<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vesper","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Vesper Finance","content":"ORGANIZATION"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}