{"summary":"Two crypto individuals with high ranking channels on the app weigh in on whether it will remain popular.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252072\/friend-tech-users-have-earned-12-million-in-fees-but-is-it-sustainable","publishDate":"2023-09-20T11:30:21","id":10028,"type":null,"title":"Friend.Tech users have earned $12 million in fees — but is it sustainable?","category":["CRYPTO ECOSYSTEMS"],"content":["Social networking app Friend.Tech has brought in $12 million in fees for its more than 160,000 users since inception.","Anyone who joins the app gets their own channel where users have to own at least one of their keys to access the channel. When a key is bought or sold, a 5% fee goes to the app, and a 5% fee goes to the channel's owner. The value of buying a key decreases or increases on a bonding curve, which means it gets increasingly more expensive to get into someone's channel the more people that are already there.&nbsp;","There's been a lot of revenue, particularly for popular crypto influencers, some of whom have seen more than $50,000 in fees gained, according to a <a href=\"https:\/\/dune.com\/tk-research\/friendtech\" data-v-f87c67ca=\"\">Dune dashboard<\/a> created by TK Research. Yet those buying keys are losing 10% of the cost of joining or leaving a channel, while also taking on the volatility of the value of the key. While influencers have profited from the fees, it's unclear whether the whole system is sustainable in the long run.","\"The bonding curve is definitely a bit rough and it would've been better if you could select a specific bonding curve for your audience,\" said the pseudonymous crypto influencer and NFT collector known as Dingaling, who has the 13th most expensive channel on the app.","\"The fees are actually pretty insane as well. I don't think they expected such large volumes right off the bat,\" he said. \"It should remain successful until the first airdrop and token launch. Not sure about afterwards since realistically I don't think it makes much sense to pay 10k as an entry fee to someone's secret chat room.\"","The lure of a potential airdrop has been one carrot to keep people trading keys and burning their money on fees. Some are speculating that the points given out on a weekly basis could end up converting into tokens if an airdrop is to take place, although one has not yet been announced.&nbsp;","Dingaling added that its ongoing success depends on how the project structures the tokenomics of a potential airdrop and token. If it continues to incentivize activity on the app or adds revenue sharing, users could stay engaged. Without those features, it might struggle.","The app has so far had three waves of activity in its brief history. The latest surge saw daily fees going out to channel owners rising as high as $2 million per day. That said, the app still hasn't surpassed its peak of 85,700 transactions per day seen during its second wave of activity. Between the waves, transactions and fees have dropped quite significantly, showing that activity on the app can decline pretty rapidly when users lose motivation.","<span data-v-f87c67ca=\"\">Friend.Tech has seen three big waves of activity since inception. Image: TK Research\/Dune.<\/span>","\"I think Friend.Tech builds on top of the previous social token concept and further improves it by incorporating some DeFi elements such as the bonding curve which provide natural liquidity to all social tokens,\" said DeFiance Capital founder Arthur Cheong, who has the 19th most expensive channel on Friend.Tech.","Cheong added that the app works because it is a hybrid of multiple crypto elements including yield farming, bonding curves, paid groups, the monetization of egos\/pride and cult-like communities.","He noted that the current design is optimized for serving superfans, and a benefit of the bonding curve is that it keeps the room size small so room owners are still able to interact with their key holders.","He said, however, that the team needs to maintain the app's momentum and keep its retention rate while removing some of the drawbacks, like people farming their own keys. Otherwise, it might struggle to find an equilibrium.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TK Research","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"TK Research\/Dune","content":"ORGANIZATION"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$50,000","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Dingaling","content":"LOCATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}