{"summary":"The SKALE Network, an Ethereum scaling project supported by SKALE Labs and the Liechtenstein-based NODE Foundation, has raised $17.1 million in fresh","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41638\/ethereum-scaling-network-skale-raises-17-1m-in-new-funding-to-speed-up-its-mainnet-launch","publishDate":"2019-10-01T09:59:53","id":10031,"type":null,"title":"Ethereum scaling network SKALE raises $17.1M in new funding to speed up its mainnet launch","category":["INVESTMENTS"],"content":["The SKALE Network, an Ethereum scaling project supported by SKALE Labs and the Liechtenstein-based NODE Foundation, has raised $17.1 million in fresh funding, according to an announcement Tuesday.","The investment is contributed by SKALE Labs as well as global venture firms, including Winklevoss Capital, Arrington XRP Capital, Blockchange, ConsenSys Labs and Multicoin Capital from the U.S., and from Asia - Hashed (Korea), HashKey (Hong Kong), and Recruit Holdings (Japan), which is an owner of job sites Indeed and Glassdoor.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSKALE Labs CEO Jack O’Holleran told The Block that the funding was once again via a Simple Agreement for Future Tokens (SAFT) sale. Last October the firm raised nearly $10 million in a SAFT sale. In such sales, no tokens are issued by a company to investors, instead an investment contract is signed to provide them access to a project at launch.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSKALE has been working to launch its mainnet and the new capital will help speed it up. O’Holleran told The Block that the mainnet will be ready for launch in late Q4 and will be released at the time or early Q1. Specific details will be announced later this month or early November, he added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe majority of the funding will go towards engineering efforts and building a strong developer community, O’Holleran said, adding that it will also be utilized to drive awareness of the network and increase its security.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTo that end, SKALE is hiring a solutions engineer in Korea as it is “very excited” about the growth of the dApp (decentralized applications) gaming market in Korea. “There are already a good number of Korean dApps signed up in the SKALE Innovator Program and we expect more to come on board in the coming months leading up to MainNet launch,” O’Holleran told The Block. SKALE Labs currently has 25 full-time employees, out of which 20 are in engineering and another 5 are spread across product, marketing, and executive functions.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen asked how <a href=\"https:\/\/www.theblockcrypto.com\/daily\/11435\/ethereum-sidechain-solution-skale-labs-releases-devnet\" data-v-f87c67ca=\"\">SKALE<\/a> is different from other Ethereum scaling solutions in the market, O’Holleran told The Block that other projects such as “Plasma and Statechannels aim to not custody any assets but do so at a significant cost of User Experience [UX]. Elastic Sidechains [e.g. SKALE Network] aim to bring the best of both worlds together.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHe explained further: “The goal [of SKALE Network] is to bring the UX and performance values of traditional sidechains, but without the security holes of traditional sidechains. The security approach is similar to sharding where each SKALE Chain is supported by the security of the greater pool of validators due to Randomness, Rotation, and Incentive mechanics of the network.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLooking ahead, SKALE is not planning any more fundraises via private sales, O’Holleran told The Block, adding that a public sale will be launched “later this year with the goal of getting greater reach and decentralization of tokens to more individuals who can contribute, delegate, and use the network.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$17.1 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Rotation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Blockchange","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"Liechtenstein","content":"LOCATION"},{"type":"NODE Foundation","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jack O’Holleran","content":"PERSON"},{"type":"Recruit Holdings (Japan)","content":"ORGANIZATION"},{"type":"Winklevoss Capital","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"ConsenSys Labs","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":["HASHKEY"],"authors":["Yogita Khatri","The Block"]}