{"summary":"Binance, the world’s largest cryptocurrency exchange by trading volumes, is  launching its native stablecoin. The upcoming stablecoin, dubbed Binance USD","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38607\/binance-launching-its-own-usd-pegged-stablecoin-busd-with-paxos-as-custodian","publishDate":"2019-09-05T09:48:36","id":10037,"type":null,"title":"Binance launching its own USD-pegged stablecoin ‘BUSD,’ with Paxos as custodian","category":["STABLECOINS"],"content":["Binance, the world’s largest cryptocurrency exchange by trading volumes, is&nbsp; launching its native stablecoin.","The upcoming stablecoin, dubbed Binance USD (BUSD), will be pegged 1:1 to the U.S. dollar, according to an announcement Thursday. A Binance spokesperson told The Block that BUSD will be built on the Ethereum blockchain, but notes that it may \"migrate to Binance Chain in the future.\"","BUSD is being built in association with stablecoin issuer Paxos, which will serve as its issuer as well as custodian of fiat reserves. “Paxos is leading the digital trusts space and we are excited to work with them in developing our native stablecoin,” said Binance CEO, Changpeng “CZ” Zhao.","The stablecoin will be up for direct purchase and redemption on the Paxos platform, as well as for trading on Binance.com later this month. The firms did not provide a specific date.","Initially, BUSD will trade against three cryptocurrencies - bitcoin (BTC), Binance coin (BNB) and XRP - on the cryptocurrency exchange.","Binance and Paxos said they have also received approval from the New York State Department of Financial Services (NYDFS) for the BUSD stablecoin, meaning it could be available to residents of New York at launch.","“We hope to unlock more financial services for the greater blockchain ecosystem through the issuance of BUSD, including more use cases and utility through the power of stable digital assets,” said CZ.","Binance did not respond to further queries by press time.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBack in July, Huobi Capital-backed startup Stable Universal also launched a dollar-pegged stablecoin called <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/17\/huobi-backs-new-stablecoin-under-paxos-custody-eyeing-on-the-gap-in-regulated-stablecoin-market-left-by-tether\/\" data-v-f87c67ca=\"\">HUSD<\/a> in an association with Paxos. The stablecoin is listed on crypto exchange Huobi Global and is also expected to list on other exchanges, trading desks, and wallets in the near future.","Binance has been increasingly focusing on the stablecoin space. Back in July, it <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/binance-launched-british-pound-backed-stablecoin-the-first-of-many-fiat-pegged-stablecoins-to-come-on-binance-chain\/\" data-v-f87c67ca=\"\">listed BGBP<\/a> stablecoin, which is pegged 1:1 to the British pound, but is built on the Binance Chain blockchain network. At the time, Binance said it would launch a collection of stablecoins pegged to different fiat currencies.","Binance is also preparing to launch <a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/19\/binance-planning-to-launch-venus-similar-to-facebooks-upcoming-cryptocurrency-libra\/\" data-v-f87c67ca=\"\">Venus<\/a>, similar to Facebook’s upcoming stablecoin Libra. Yi He, the co-founder of Binance, told The Block at the time: “We believe that in the near and long term, stablecoins will progressively replace traditional fiat currencies in countries around the world, and bring a new and balanced standard of the digital economy.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Binance Chain","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Huobi Global","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Paxos","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Venus","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"Huobi Capital","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","BUSD"],"authors":["Yogita Khatri","The Block"]}