{"summary":"Digital asset data is one of the sub-sectors specific to the broader crypto space that is well poised to produce its own unicorns as within other","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63689\/research-report-the-state-of-the-digital-asset-data-and-infrastructure-commissioned-by-blockset","publishDate":"2020-05-14T18:42:05","id":10030,"type":null,"title":"Research report: The State of the Digital Asset Data and Infrastructure commissioned by Blockset","category":["THE BLOCK"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research was commissioned by Blockset to create “The State of the Digital Asset Data and Infrastructure”. To access the full report in PDF format, please fill out the form below:&nbsp;<\/b>","Digital asset data is one of the sub-sectors specific to the broader crypto space that is well poised to produce its own unicorns as within other ecosystems. To date, only exchanges, token development studios, and mining chip manufacturers have built profitable companies and boast unicorn-like valuations. Data and infrastructure companies would be a logical sector to follow.","The State of the Digital Asset Data and Infrastructure report, which was commissioned by <a href=\"https:\/\/blockset.com\/\" data-v-f87c67ca=\"\">Blockset<\/a>, a leading enterprise provider of blockchain data, examines the growth of the sector.","By the end of 2017, there had been a 1,183% year-over-year increase in venture funding. Between 2017 and 2019, the data and infrastructure space saw a 33% compound annual growth rate (CAGR). In aggregate, from 2014 to 2019, firms in the sector raised over $286mm in venture funding, with 44 deals completed—averaging $47.8mm per year and $6.5mm per deal.","","","In total, the companies have hired 850 employees at an average of 17 employees per firm. The largest employers in this industry are Blockset, CryptoCompare, and Santiment with 50, 35, and 34 employees respectively.","","","The Digital Asset Data and Infrastructure firms have been segmented into three primary verticals - Infrastructure providers, On-chain metrics providers, and Market data providers. On-chain and markets data firms make up nearly two-thirds of the data service providers in our sample set. One reason for the dominance of these two verticals is the broad reach of their customer base. While infrastructure providers primarily focus on engineering teams, the market and on-chain data providers have a wider client base with retail consumers, financial institutions, and engineering teams.","","","Infrastructure providers offer blockchain node infrastructure services and developer tools. Their prospective customers are those looking to outsource the more resource-intense aspects of running a digital asset and blockchain business that require access to blockchain node data. Companies that require a constant stream of node data include decentralized applications (dApps) and on-chain data and analytics providers.","","","While the data produced by blockchains are publicly accessible, procuring actionable insights from the data requires additional work. Blockchain nodes need to be maintained and the raw data must be extracted, parsed, and cleaned. On-chain metrics providers offer services that change raw and unorganized blockchain data into user-friendly and digestible data. Many of these firm deploy a wide array of algorithmic strategies to digest and synthesize into metrics such as transaction counts, exchange flows, and value settled.","","","Unlike equity markets, where spot trading data comes exclusively from NASDAQ and NYSE and the majority of derivatives data comes from handful of financial markets companies (CME Group, Intercontinental Exchange or CBOE), available market data in the digital asset ecosystem is scattered across many different digital asset exchanges. There are at least 20 legitimate digital asset exchanges9 – some global and some regional – that have real volume and sufficient liquidity to make them worth tracking. Each digital asset exchange has its own API with different degrees of documentation, which means that the data needs to be normalized and pre-processed for the data to be comparable across different exchanges.","Market participants seek digital asset market data providers for a couple of main reasons. One reason is to aggregate all of the APIs into one comprehensive API. The second reason is for access to sets of pre-processed historical data (order book and OHLCV). Both are not possible through the digital asset exchange APIs and, as a result, are valuable for quantitative or algorithmic traders, hedge funds, investment management firms, and investment banks.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/post\/63689\/new-diagram\" rel=\"attachment wp-att-65339\" data-v-f87c67ca=\"\"><img class=\"alignnone wp-image-65339 size-full\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2020\/05\/New-diagram.png\" alt=\"\" width=\"2496\" height=\"1080\" data-v-f87c67ca=\"\"><\/a>","Similar to the consolidation seen in financial market data vendors, the digital asset data vendors will see consolidation as the market matures. Healthy competition in the sector combined with COVID-19 related pressures could lead to an acceleration of this maturation, where we’ll see data and infrastructure companies without differentiated product suites get acquired or burnout. Nonetheless, with strong tailwinds from greater interest from financial institutions and fintech companies, the future looks bright for the digital asset data and infrastructure space.","The full report can be viewed below and is available for <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2020\/05\/The-State-of-the-Digital-Asset-Data-and-Infrastructure-Landscape-1.pdf\" data-v-f87c67ca=\"\">download here.<\/a>","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Digital Asset Data","content":"ORGANIZATION"},{"type":"$47.8","content":"MONEY"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"fintech","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$6.5","content":"MONEY"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"CBOE","content":"ORGANIZATION"},{"type":"end of 2017","content":"DATE"},{"type":"$286","content":"MONEY"},{"type":"1,183%","content":"PERCENT"}],"hashtag":[],"authors":["The Block","The Block"]}