{"summary":"Fractional NFT project Tessera and its sister project Escher are set to shut down over the coming weeks amid tough market conditions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230623\/fractional-nft-project-tessera","publishDate":"2023-05-12T11:49:44","id":10045,"type":null,"title":"Fractional NFT project Tessera to shut down amid tough crypto market","category":["METAVERSE & NFT"],"content":["Fractional <a href=\"https:\/\/www.theblock.co\/post\/164001\/paradigm-leads-20-million-round-for-fractional-as-it-rebrands-to-tessera\" data-v-f87c67ca=\"\">NFT project Tessera<\/a> and its sister project Escher will shut down over the coming weeks, after the Paradigm-backed company said its financial situation and economic model would make it hard to become profitable.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"We spent a long time carefully analyzing possible market scenarios, our company structure, and our financial situation, and decided that this was the best choice for our team and investors,\" co-founder Andy Chorlian <a href=\"https:\/\/twitter.com\/andy8052\/status\/1657031015066394630\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>. \"As we really dug into the economic model for Escher, we saw that the targets we needed to hit to attain profitability – compared to the time and resource costs to scale there –just didn’t add up or make good business sense.\"<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","Tessera, originally known as Fractional, lets users buy and sell tokens that represent fractions of NFTs. The project sought to make it possible for anyone to own part of even the most expensive NFTs.","Escher was a platform for aggregating artwork in the form of virtual showrooms, where anyone could drop in and be able to virtually explore the artist's work.","The company had raised $20 million in a Series A round led by Paradigm in August 2022. Other investors included Uniswap Labs, E Girl Capital and Focus Labs.","\"We wanted to make this decision while we’re still in a financial position to do this responsibly, and ensure employees are supported during this hard transition,\" <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Chorlian said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Escher","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Paradigm","content":"LOCATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"August 2022","content":"DATE"},{"type":"Andy Chorlian","content":"PERSON"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Chorlian","content":"PERSON"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}