{"summary":"Binance has added a former Brazilian central banker and economy minister to its board, local newspaper O Globo reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167857\/binance-taps-ex-central-bank-head-economy-minister-of-brazil-as-advisor","publishDate":"2022-09-05T13:47:15","id":10049,"type":null,"title":"Binance taps ex-central bank head, economy minister of Brazil as advisor","category":["EXCHANGES"],"content":["Binance has added a former Brazilian central banker and economy minister to its board, local newspaper <a href=\"https:\/\/oglobo.globo.com\/blogs\/lauro-jardim\/post\/2022\/09\/henrique-mereilles-de-volta-a-iniciativa-privada.ghtml\" data-v-f87c67ca=\"\">O Globo<\/a> reported.","Henrique Meirelles, who most recently served as the finance minister of the state of Sao Paulo, spent eight years heading up the central bank under President Luiz Inacio Lula da Silva through 2011. He later worked as the country’s finance minister for two years under Michel Temer whose Brazilian Democratic Movement party broke with Lula’s Workers’ Party in 2016. Meirelles is nonetheless likely to be part of Lula’s presidency, should the latter win the election next month.","Brazil has been actively working toward implementing regulations and legislation to promote the cryptocurrency market.","The central bank in Latin America’s largest economy has proved to be open to innovation in the financial markets, most recently announcing a proposal for a <a href=\"https:\/\/www.theblock.co\/post\/166375\/brazils-central-bank-picks-itau-defi-project-among-new-innovation-proposals\" data-v-f87c67ca=\"\">decentralized finance (DeFi) liquidity pool<\/a> from Itaú Unibanco, the country's largest bank, among several new projects aimed at new financial solutions.","Binance didn’t immediately respond to a request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michel Temer","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"2011","content":"DATE"},{"type":"Sao Paulo","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"Lula’s Workers’ Party","content":"ORGANIZATION"},{"type":"Luiz Inacio Lula da Silva","content":"PERSON"},{"type":"Unibanco","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Christiana Loureiro","The Block"]}