{"summary":"Boston-based pension and endowment consulting firm Cambridge Associates believes &quot;it is worthwhile for investors to begin exploring the cryptoasset area","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12221\/cambridge-associates-believes-institutional-investors-should-explore-crypto","publishDate":"2019-02-18T16:45:40","id":10040,"type":null,"title":"Cambridge Associates believes institutional investors should explore crypto","category":["INSTITUTIONAL INVESTORS"],"content":["Boston-based pension and endowment consulting firm Cambridge Associates believes \"it is worthwhile for investors to begin exploring the cryptoasset area today, with an eye toward the long term,\" written in an investment note to clients. Even amidst current challenges and a record long bear market, the firm sees \"booming\" investment activity and structural developments as key reasons to view the space as developing, rather than faltering.","The report (attached below) reviews recent developments in the industry, highlights investments strategies, and comments on the expectation for future institutional exposure. Highlights include:","<strong data-v-f87c67ca=\"\">Booming investment activity:&nbsp;<\/strong>According to NY Digital Investment Group, the number of blockchain-related software projects on Github has risen by a factor of 10 in the last 3 years, while VC funding for blockchain startups saw ~$3 billion in investments from January through October of 2018.","<strong data-v-f87c67ca=\"\">Views three categories of investment opportunities:&nbsp;<\/strong>1) <em data-v-f87c67ca=\"\">mainstream investing<\/em> which includes trading or gaining exposure to the most liquid \"majors\" (BTC, ETH, etc.), 2) <em data-v-f87c67ca=\"\">Pre-sale token investing<\/em> which grant optionality to receiving future tokens at steep discounts often times through SAFT agreements (simple agreements for future token) mirroring investments in early-stage tech, and 3) <em data-v-f87c67ca=\"\">Equity investments<\/em> which include direct investments into companies that are levered to the growth and success of the broader crypto and blockchain industries.","<strong data-v-f87c67ca=\"\">Profiles three core investment strategies:&nbsp;<\/strong>1)&nbsp;<em data-v-f87c67ca=\"\">public index approach&nbsp;<\/em>uses indexes to gain exposure to mainstream cryptoassets, offering the most liquid and \"hands-off\" approach to crypto investing, 2)&nbsp;<em data-v-f87c67ca=\"\">Public active approach<\/em> targets market inefficiencies in hopes of outperforming public index approaches involving both fundamental and technical long\/short strategies, and 3)&nbsp;<em data-v-f87c67ca=\"\">private approach<\/em>&nbsp;which matches typical&nbsp;venture capital style strategies that aim to align LP and GP incentives with fund structures that limit the taking of business risk in order to promote a longer-term investment focus.","<strong data-v-f87c67ca=\"\">Estimates institutional exposure growing in the future:&nbsp;<\/strong>Cambridge assumes the majority of institutional investors have little to no cryptoasset exposure, and estimates that those with exposure have around \"20-30 basis points,\" and expect that traditional VCs will increase their exposure going forward. Still, the firm does not believe more than 1 percent portfolio allocation \"appear[s] prudent\" at this time.","<iframe src=\"https:\/\/www.docdroid.net\/0ZpsVwu\/cryptocurrencies-venture-into-the-unknown-v2.pdf\" width=\"800\" height=\"600\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"1 percent","content":"PERCENT"},{"type":"Cambridge","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Boston","content":"LOCATION"},{"type":"Cambridge Associates","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"NY Digital Investment Group","content":"ORGANIZATION"},{"type":"Github","content":"ORGANIZATION"},{"type":"October of 2018","content":"DATE"}],"hashtag":[],"authors":["Ryan Todd","The Block"]}