{"summary":"Holders of “Masked Singer Stars” NFTs will be able to watch exclusive content.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212233\/fox-entertainments-masked-singer-show-launches-token-gated-fan-experience","publishDate":"2023-02-15T15:40:09","id":10043,"type":null,"title":"Fox Entertainment’s &#x27;Masked Singer&#x27; show launches token-gated fan experience","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Fox Entertainment and its web3 arm Blockchain Creative Labs are unveiling a new token-gated fan experience for the network's hit singing competition show “The Masked Singer.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Holders of a non-fungible token, or NFT, called “Masked Singer Stars,” will be able to “watch exclusive content featuring behind-the-scenes and confessionals from this season’s contestants.” The NFTs will cost about $50 and there will be a limited supply of 1,050, Fox said in a statement. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Fans will need to win a chance to purchase the NFTs by scanning a QR code and then participating in interactive initiatives like voting on the contestants they think will advance. By participating, fans will be able to \"level up their Loyalty Pass\" and become eligible to buy the NFTs which will unlock additional exclusive content. The fan voting will not influence the outcome of the show, the media company said.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Fox and Blockchain Creative Labs’ move is one of the strongest examples of a Hollywood media company combining the popularity of an existing brand, blockchain technology and gamification in order to engage with fans. Fox’s strategy is to increase both fan engagement and the monetization of one of its top intellectual properties.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">The Masked Singer” airs its season premiere Wednesday night. Now in its ninth season, the show has been a hit for Fox in the U.S., ranking as the nation's top unscripted TV show four years running with each episode scoring an average of more than 7 million “<\/span><span data-v-f87c67ca=\"\">multi-platform viewers,” the company said in a statement. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Fox's Blockchain Creative Labs partnered with c<\/span><span data-v-f87c67ca=\"\">rypto infrastructure firm<\/span><span data-v-f87c67ca=\"\"> MoonPay to help launch the new token-gated fan experience.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Updated with correct day of \"The Masked Singer\" season nine premiere. Previous version said Thursday when it is Wednesday.<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$50","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Blockchain Creative Labs","content":"ORGANIZATION"},{"type":"Masked Singer Stars","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Fox","content":"ORGANIZATION"},{"type":"Fox Entertainment","content":"ORGANIZATION"},{"type":"night","content":"TIME"}],"hashtag":[],"authors":["RT Watson","The Block"]}