{"summary":"Blockchain-like network provider Hedera Hashgraph has come up with a proposal for existing investors to help recover the price of its plunging token HBAR. HBAR token’s price has plunged by over 90% since it started trading in September.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51490\/hedera-hashgraph-has-come-up-a-proposal-to-help-fix-price-of-its-plunging-token-hbar","publishDate":"2019-12-26T05:55:11","id":10041,"type":null,"title":"Hedera Hashgraph has proposal to help fix price of its plunging token HBAR","category":["LAYER 1S"],"content":["Blockchain-like network provider Hedera Hashgraph has come up with a proposal for existing investors to help recover the price of its plunging token HBAR.","Hedera, which raised a whopping $124 million in three token sales last year, is asking existing SAFT (simple agreement for future tokens) holders to wait for their tokens to get unlocked in exchange for additional coins.","“Participating SAFT holders would receive additional allocations of coins, made on an annual basis, the cumulative sum of which, over time, would equal the value of their original principal investment, in exchange for stretching out the release schedule for their remaining coins,” said Mance Harmon, co-founder and CEO of Hedera, in a <a href=\"https:\/\/www.hedera.com\/blog\/2019-message-from-the-founders\" data-v-f87c67ca=\"\">blog post<\/a> on Monday.","Put simply, Hedera is proposing that investors wait to get their tokens unlocked until the price of HBAR stabilizes. HBAR has plunged by over 90% since it started trading in September this year.","“The rate of adoption and demand for [HBAR tokens] to use on the network has not been what we originally expected,” admitted Harmon. He added that the proposal to SAFT holders could help grow the network, and in turn, its price.","In October, Harmon had <a href=\"https:\/\/www.hedera.com\/blog\/hederas-token-economics\" data-v-f87c67ca=\"\">said<\/a> that Hedera would reassess the token’s economic model and potentially change HBAR’s distribution schedule. While the specifics of the proposal are not yet detailed, Harmon, in Monday’s blog post, said the release of additional HBAR tokens would be based on the pace of network adoption.","“On an annual basis, Hedera would calculate the total revenue from the sale of coins received as network transaction fees and from treasury sales. A pool of coins equal to 10% of these sales would be released to the participating SAFT holders,” he said.","The proposal won’t affect SAFT holders who don’t want to participate, per the blog post.&nbsp;","Hedera has provided the following summary of the proposal, which is not the definitive offer yet. The company is expected to come up with further details in early 2020, said Harmon.","","","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Hedera","content":"ORGANIZATION"},{"type":"Hedera","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Hedera Hashgraph","content":"PERSON"},{"type":"SAFT","content":"ORGANIZATION"},{"type":"September this year","content":"DATE"},{"type":"Harmon","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"$124 million","content":"MONEY"},{"type":"Mance Harmon","content":"PERSON"}],"hashtag":["TOKENS"],"authors":["Yogita Khatri","The Block"]}