{"summary":"Former FTX CEO Sam Bankman-Fried’s legal woes could go from bad to worse. After his crypto empire filed for bankruptcy protection, Bankman-Fried could face criminal charges — with his own tweets supplementing the evidence — legal experts say. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186175\/criminal-charges-against-sbf-on-the-table-after-ftxs-epic-collapse","publishDate":"2022-11-11T18:40:37","id":10042,"type":null,"title":"Criminal charges against SBF ‘on the table’ after FTX&#x27;s epic collapse","category":["POLICY"],"content":["Former FTX CEO Sam Bankman-Fried’s legal woes could go from bad to worse. After his crypto empire filed for bankruptcy protection, Bankman-Fried could face criminal charges — with his own tweets supplementing the evidence — legal experts say.&nbsp;","FTX and more than 100 of its corporate affiliates filed for bankruptcy on Friday, the finale of a shocking collapse for the world’s second-largest crypto exchange. At the same time, Bankman-Fried resigned as CEO of the company he founded three years ago, which was worth $32 billion at its peak in January. By Friday his remaining $16 billion fortune was <a href=\"https:\/\/www.theblock.co\/post\/186044\/sbfs-fortune-is-wiped-out-with-100-decline-bloombergs-billionaires-index-shows\" data-v-f87c67ca=\"\">wiped out<\/a>.&nbsp;","In a <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1590709199067295749\" data-v-f87c67ca=\"\">tweet thread<\/a> yesterday, Bankman-Fried apologized for the collapse and disclosed new details about disparities between his “sense” of the exchange’s liquidity and user margin and the actual numbers.&nbsp;","“Criminal charges are on the table. It's possible,” said Teresa Goody Guillén, a partner in BakerHostetler’s white collar and securities enforcement group. “In his series of tweets, he makes numerous admissions which could be used against him.”","Multiple FTX spokespeople did not respond to inquiries.","Bankman-Fried has not yet been charged with any criminal wrongdoing, and bankruptcy proceedings could take years to complete. But&nbsp;the Justice Department could bring criminal charges against Bankman-Fried, according to a former deputy attorney general.&nbsp;","“They have to be looking at it,” said Consensys attorney Bill Hughes, who served as a deputy U.S. attorney general.&nbsp;The DoJ has reportedly <a href=\"https:\/\/www.theblock.co\/post\/185129\/justice-department-joins-sec-in-ftx-probe-wsj\" data-v-f87c67ca=\"\">opened an investigation into the matter<\/a>.","<strong data-v-f87c67ca=\"\">Tweeting through it<\/strong>","In an unusual move for the chief executive of a troubled company, Bankman-Fried posted lengthy comments on Twitter over the last week weighing in on the turmoil at FTX. First, Bankman-Fried insisted his company was “fine,” and later apologized to customers for the “shitshow” and said he accepted blame for the exchange’s collapse. In a criminal court, his statements might be considered an admission of guilt.&nbsp;","“He gets into definitive disclosures of what the margin was and liquidity was,” said Goody Guillén, who previously served as litigation counsel for the Securities and Exchange Commission. “It’s not only about admissions of potential wrongdoing, but he also made statements on which people relied that will be scrutinized for their truth.”&nbsp;","Bankman-Fried’s claims of lack of knowledge of the exchange’s financial status and activities probably won’t help him either.","“He’s about to hear his lawyer tell him about a standard called ‘knew or should have known,’” said John Roe, president of Roe Capital Management and a board member of the National Introducing Brokers Association, a commodities industry trade association. “How do you not know what your leverage was? That’s insane.”","Government lawyers will also scrutinize the former FTX CEO’s tweets to see if he misled in order to prop up market prices.","“There's an issue of whether or not the statements in his tweets were accurate. And there's also an issue as to his intent in making the tweets, because they appear to have had market moving consequences,” Goody Guillén added. “If it were determined, based on the facts and circumstances, for example, that those tweets were made with the intent to have market moving impact, that could be market manipulation and fraud.\"","<strong data-v-f87c67ca=\"\">More legal complications<\/strong>","Allegations of commingling customer assets to fund proprietary trading will also garner significant scrutiny from prosecutors and regulators.","“That is commingling of customer assets with funds, and I don’t think most people thought they were betting on a proprietary bet,” said Roe, who co-led a coalition of MF Global investors in litigation after that commodity brokerage went bankrupt in 2011. “And if they were, that’s jail.”","The MF Global bankruptcy may serve as reference point for FTX and its affiliated firms. The company's CEO, Jon Corzine, a former U.S. senator and governor of New Jersey, faced civil penalties and was banned from the futures industry after the firm collapsed due to over-leveraged bets and poor risk management. But alleged mixing of customer assets with other pools of money controlled by the firm, <a href=\"https:\/\/www.theblock.co\/post\/164553\/fdic-issues-cease-and-desist-letters-to-ftx-us-other-crypto-firms-over-deposit-insurance\" data-v-f87c67ca=\"\">false claims that accounts were FDIC-insured<\/a>, and certain public statements about the health of FTX US will likely receive a long look for potential prosecution.","“Just being stupid and reckless with money is not a crime, but fraud is. Intentionally lying about the use of FTX customer assets is fraud,” said Jim Angel, an associate professor at Georgetown University’s McDonough School of Business.","The tangled nature of FTX’s corporate structure, much of it intentionally left out of U.S. and spread across different jurisdictions, could further complicate any investigation. FTX’s global reach also means that a wide range of authorities could be involved.","“Building the evidence, building the facts, often takes time,” SEC Chair Gary Gensler <a href=\"https:\/\/www.theblock.co\/post\/185310\/gensler-pressed-on-ftx-failure-warns-investors-to-be-careful-beware\" data-v-f87c67ca=\"\">said<\/a> during a recent TV appearance, acknowledging an ongoing investigation into the company.","<em data-v-f87c67ca=\"\">With additional reporting by Colin Wilhelm.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"three years ago","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2011","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$16 billion","content":"MONEY"},{"type":"MF Global","content":"ORGANIZATION"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Jim Angel","content":"PERSON"},{"type":"Roe Capital Management","content":"ORGANIZATION"},{"type":"Georgetown University’s McDonough School of Business","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Goody Guillén","content":"PERSON"},{"type":"John Roe","content":"PERSON"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"Jon Corzine","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Teresa Goody Guillén","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Roe","content":"PERSON"},{"type":"National Introducing Brokers Association","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Bill Hughes","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"DoJ","content":"ORGANIZATION"}],"hashtag":["FDIC","FTX","GARY GENSLER","SAM BANKMAN-FRIED"],"authors":["Stephanie Murray","Kollen Post","The Block"]}