{"summary":"&quot;U.S. regulators can exert some control on Tether&#x27;s offshore usage via OFAC,&quot; according to JPMorgan analysts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277655\/jpmorgan-tether-ofac-comments","publishDate":"2024-02-15T11:51:39","id":10053,"type":null,"title":"JPMorgan says US regulators can &#x27;exert some control&#x27; over Tether via OFAC","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">While <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Tether <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248350\/tether-usdt-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Tether.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">USDT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.040%\n    <\/span><\/a> <!----><\/span><\/span> may not be a U.S. entity, American authorities can still exert a certain degree of control over the stablecoin issuer through the Office of Foreign Assets Control (OFAC), according to JPMorgan.<\/span>","\"U.S. regulators can exert some control on Tether's offshore usage via OFAC,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Thursday. \"Tether's association with Tornado Cash, a privacy enhancement platform on the Ethereum network, is an example.\"","OFAC, a unit of the U.S. Treasury Department, <a href=\"https:\/\/www.theblock.co\/post\/162817\/treasury-sanctions-on-tornado-cash-extend-far-beyond-the-us\" data-v-f87c67ca=\"\">sanctioned<\/a> Tornado Cash in 2022, alleging it to be a key tool used by malicious actors for money laundering. At that time, Tether said it wouldn't bar Tornado Cash addresses as the company had not yet received any such requests from U.S. authorities. However, last December, Tether <a href=\"https:\/\/www.theblock.co\/post\/266872\/tether-freezes-all-ofac-sanctioned-wallets-in-proactive-security-measure\" data-v-f87c67ca=\"\">announced<\/a> it had frozen its stablecoins held in crypto wallets sanctioned by OFAC as a \"proactive\" security measure, ultimately bending to OFAC.","When reached for comment, Tether CEO Paolo Ardoino highlighted the company's same December announcement and suggested that JPMorgan appears jealous of Tether's dominating position in the crypto market.","\"JPMorgan's current concerns seem more related to the jealousy towards the evolution of financial and payment services, which they have been ignoring for a decade and now they're upset because it got a lot of traction,\" Ardoino said. \"If I were them, I would be more concerned about their $39 billion total fines.\"","Earlier this month, Ardoino labeled JPMorgan \"hypocritical\" when the bank <a href=\"https:\/\/www.theblock.co\/post\/275643\/jpmorgan-tether-negative-crypto\" data-v-f87c67ca=\"\">said<\/a> that Tether's increasing concentration is negative for the crypto markets.","Upcoming stablecoin regulations in the U.S. and Europe will impact <a href=\"https:\/\/www.theblock.co\/learn\/251864\/what-is-usdt-and-how-does-it-work-a-guide-to-tethers-stablecoin\" data-v-f87c67ca=\"\">Tether<\/a>'s usage, according to JPMorgan analysts. These regulations would \"likely put indirect pressure on Tether as its attractiveness would diminish relative to stablecoins with more transparency and greater compliance with new regulatory\/KYC\/AML standards,\" the analysts said. \"This challenge for Tether would also apply to the DeFi space where Tether is widely used as a source of collateral and liquidity.\"","The analysts also expressed dissatisfaction with Tether's current disclosures, stating that they aren't enough to alleviate concerns.","\"Tether's reports are still lacking a full and detailed asset breakdown and independent audits (instead of auditor's assurances),\" they said.","Additionally, the analysts highlighted S&amp;P Global's weak rating for Tether's ability to maintain its peg to the U.S. dollar at 4 (with 5 being weak and 1 being strong). While Tether <a href=\"https:\/\/www.theblock.co\/post\/275388\/tether-q4-attestation-report-excess-reserves\" data-v-f87c67ca=\"\">reported<\/a> billions of dollars worth of profit last year due to high-interest rates and underlying assets' price appreciation, \"there are significant price risks associated with assets other than U.S. T-bills,\" the analysts said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"+0.040%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$39 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"Tether","content":"ORGANIZATION"},{"type":"Ardoino","content":"PERSON"},{"type":"S&amp;P Global","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS","TETHER","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}