{"summary":"Jack Butcher explains how he created the latest hot collection in NFTs, Checks VV, inspired by Twitter blue ticks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221547\/how-twitter-blue-checks-became-nft-zeitgeist","publishDate":"2023-03-21T15:02:40","id":10058,"type":null,"title":"How Twitter blue checks became NFT zeitgeist","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">If you’ve logged into Twitter in the last four months, you might have noticed a heightened preoccupation with its ubiquitous blue checks.<\/span>","<span data-v-f87c67ca=\"\">Scrolling through feeds of NFT collectors and digital art curators in the last two months might have revealed a similar preoccupation with this symbol, but for a different reason.<\/span>","<span data-v-f87c67ca=\"\">In November, newly anointed Twitter chief Elon Musk launched a bid to bring in cash following the social media company’s $44 billion buyout. In its original form, the blue tick, first put into play in 2009, was a marker to signal a true identity – a seal of authenticity that someone was indeed who they claimed to be. Late last year, Musk lowered the bar, allowing people to buy verification for $8. Accounts which were verified through the old system now bear a warning to the viewer: “This account may or may not be notable.”<\/span>","<span data-v-f87c67ca=\"\">By riffing on this theme, Checks VV, an NFT art project created by visual artist Jack Butcher and his design shop Visualize Value, has captured crypto Twitter and the digital art world’s imaginations.<\/span>","","","<span data-v-f87c67ca=\"\">“The acquisition of Twitter was a catalyst for this; a moment in time where people were asking what it means to be verified,” Butcher said in an interview with The Block. Butcher originally used the check mark in his work to differentiate a JPEG from an NFT.<\/span>","<span data-v-f87c67ca=\"\">First sold for $8 in an open mint, the 8x10 grids featuring multicolored check marks have since seen a parabolic price spike, more than $124 million in<\/span><a href=\"https:\/\/checks.art\/stats\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> secondary sales<\/span><\/a>, <span data-v-f87c67ca=\"\">and a host of copycat collections. <\/span>","<span data-v-f87c67ca=\"\">With an inbuilt burning mechanism, the potential for a diminishing supply has led to some saying it could be one of the most valuable NFT collections of all time. <\/span>But while the price has spiked, others feel Checks may be susceptible to the same hype cycles that have plagued the biggest collections on the scene, especially in a prolonged bear market.&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">\"When things move that fast I get cautious – it's the type of movement we’ve been conditioned to fade,\" said Sasha Fleyshman, portfolio manager at crypto fund Arca.&nbsp;<\/span>","While Fleyshman believes Butler's project is evidence of the crypto space coalescing around an idea, there is a caveat emptor for people looking to capitalize on it. <span data-contrast=\"none\" data-v-f87c67ca=\"\">\"The thing to watch here is how he executes his plan,\" he added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Butcher, like many others in the digital art market, came to the world of NFTs as a marketing professional. After growing up and going to university in the UK, the artist got his first job at a small design agency in New York through sending a barrage of applications via Craigslist ads.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After years of working for other people, he founded his own company and became embedded into the NFT scene, which felt like a natural transition from corporate marketing to digital art. Through this work, he said, he wanted to ask why it is important to enable ownership in an economy which is increasingly digital; and why digital authorship is important. <\/span>","<span data-v-f87c67ca=\"\">This also played out on Twitter, as the popularity of the collection, and his own profile, grew.<\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\">Through treating verification as a cultural symbol via a mark that has no copyright of its own, Checks has also inspired a host of <\/span><a href=\"https:\/\/checks.art\/feed\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">derivative works<\/span><\/a><span data-v-f87c67ca=\"\">. NFT stalwart Beeple dedicated one of his works to it, <\/span><a href=\"https:\/\/twitter.com\/beeple\/status\/1622459994376388610\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">dubbed<\/span><\/a><span data-v-f87c67ca=\"\"> \"DAWN OF CHECK.\" Visual artist Max Decimal also created a website called <\/span><a href=\"https:\/\/www.checkable.art\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Checkable<\/span><\/a><span data-v-f87c67ca=\"\"> where you can create your own personalized grid. Meanwhile, big brands such as <\/span><a href=\"https:\/\/twitter.com\/budweiserusa\/status\/1620892046390366208\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Budweiser<\/span><\/a><span data-v-f87c67ca=\"\"> have muscled in on the game with their own branded offerings.&nbsp;<\/span>","&nbsp;","DAWN OF CHECK <a href=\"https:\/\/t.co\/2h9ogj5a6S\" data-v-f87c67ca=\"\">pic.twitter.com\/2h9ogj5a6S<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","<span data-v-f87c67ca=\"\">“It showed me how you can tap into something that people are already interested in and care about. And put your perspective onto that thing or apply your skill set to it,” said Butcher. “Just by adding that symbol, you're tapping into this bigger meme.”<\/span>","<span data-v-f87c67ca=\"\">Some copycat projects even outstripped the value of the originals. Anon NFT artist Vince Van Dough’s Notable <\/span><a href=\"https:\/\/app.manifold.xyz\/c\/pepechecks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pepe<\/span><\/a><span data-v-f87c67ca=\"\">s open edition brought in more than $1.6 million in primary sales.&nbsp;<\/span>","\"<span class=\"TextRun SCXW130981985 BCX0\" lang=\"EN-GB\" xml:lang=\"EN-GB\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW130981985 BCX0\" data-v-f87c67ca=\"\">What people don’t realize is that the picture on the front-end of the NFT is not the <\/span><span class=\"NormalTextRun SCXW130981985 BCX0\" data-v-f87c67ca=\"\">important<\/span><span class=\"NormalTextRun SCXW130981985 BCX0\" data-v-f87c67ca=\"\"> part,\" explained Fleyshman. \"You're not just buying the check mark.\"<\/span><\/span>","<span data-v-f87c67ca=\"\">The success of Checks is also down to its resonance with crypto culture, said Butcher.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">“<\/b><span data-v-f87c67ca=\"\">I think, with the speed at which the Internet moves and the speed at which crypto and NFT culture moves more specifically, it's really, really difficult to detach yourself from that and make relevant things,” he said. “This just took the way that I've worked in everything I've done in the last couple of years and just applied it to this world.”<\/span>","<span data-v-f87c67ca=\"\">Ultimately Butcher describes verification via a blockchain such as Ethereum, as a “bottom up” way to verify your work.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Claiming that symbol as something that represents your ability as a participant in this network, Ethereum specifically, and being able to assign your work and create a network effect around your work, that's indisputable.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Butler","content":"PERSON"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Jack Butcher","content":"PERSON"},{"type":"2009","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$44 billion","content":"MONEY"},{"type":"Butcher","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"$8","content":"MONEY"},{"type":"Max Decimal","content":"PERSON"},{"type":"Sasha Fleyshman","content":"PERSON"},{"type":"Vince Van Dough’s Notable <\/span><a href=\"https:\/\/app.manifold.xyz\/c\/pepechecks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pepe","content":"ORGANIZATION"},{"type":"Visualize Value","content":"ORGANIZATION"},{"type":"$124 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}