{"summary":"MakerDAO’s revenue was impacted by the bear market of 2022 as the stablecoin issuer’s earnings fell 42% from the previous year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208498\/makerdao-revenue-fell-42-in-2022-amid-shrinking-crypto-lending-market","publishDate":"2023-02-03T10:30:45","id":10060,"type":null,"title":"MakerDAO revenue fell 42% in 2022 amid shrinking crypto lending market","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO, which builds the platform that issues the DAI stablecoin, saw a marked decline in 2022 revenue, as the DeFi protocol launched a significant pivot from crypto-native lending to the real-world asset market, according to a financial report issued by Steakhouse Financial.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTotal revenue decreased 42% to 65 million DAI ($65 million) in 2022 from 112 million DAI in 2021, the <a href=\"https:\/\/forum.makerdao.com\/t\/makerdao-2022-financial-results-and-retrospective\/19636\" data-v-f87c67ca=\"\">report<\/a>&nbsp;said. This led to an 80% drop in the protocol’s net operating earnings to 19 million DAI last year from 90 million DAI in 2021. Operating expenses rose to 46 million DAI in 2022, more than double the figure reported the previous year.","MakerDAO’s decreased earnings followed the general crypto downturn of 2022 in which the market experienced a massive deleveraging cycle triggered by collapses of the Terra ecosystem and the FTX exchange — events that occurred amid a significant slowdown in the global financial markets and impacted both centralized and decentralized participants in crypto lending.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/cryptocurrency-lending\/dai-outstanding-daily\/embed\" title=\"DAI Outstanding\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Maker's total balance shrunk to 5 billion DAI at the end of 2022, a 43% decline from the 9 billion at the end of the previous year, according to Steakhouse.","MakerDAO engineered a significant shift in DAI economics last year that saw a pivot to real-world asset backing. The Maker protocol issues the DAI stablecoin, which users mint in exchange for approved collateral assets that are supplied in excess of the amount of DAI being minted.","The volume of Maker’s real-world asset vault balance grew to 640 million DAI at the end of 2022. This figure marks a 37-fold increase from the end of 2021, with a large portion of the growth occurring in the last half of 2022 including a <a href=\"https:\/\/www.theblock.co\/post\/175311\/makerdao-initiates-500-million-investment-in-us-treasuries-corporate-bonds\" data-v-f87c67ca=\"\">500 million DAI vault<\/a> for Monetalis Clydesdale and a <a href=\"https:\/\/www.theblock.co\/post\/156301\/makerdao-approves-100-million-stablecoin-loan-vault-for-151-year-old-us-bank\" data-v-f87c67ca=\"\">100 million DAI vault<\/a> allocation for Huntingdon Valley Bank.","The impact of Maker’s real-world asset push can also be seen in its revenue-generation matrix, with the vaults accounting for 70% of MakerDAO’s gross revenue in December, according to the report. That's despite the fact that the vaults only accounted for a tenth of the DAI minted over the period.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Steakhouse","content":"ORGANIZATION"},{"type":"9 billion","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"$65 million","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"last half of 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Steakhouse Financial","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"42%","content":"PERCENT"},{"type":"Huntingdon Valley Bank","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Monetalis Clydesdale","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"5 billion","content":"MONEY"},{"type":"90 million","content":"MONEY"}],"hashtag":["DAI"],"authors":["Osato Avan-Nomayo","The Block"]}