{"summary":"The collaboration aims to offer seamless cryptocurrency purchases directly from the web3 wallet using bank cards, Apple Pay and Google Pay.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210608\/metamask-adds-mercuryo-crypto-purchases","publishDate":"2023-02-17T04:53:14","id":10061,"type":null,"title":"MetaMask adds Mercuryo to streamline crypto purchases","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">MetaMask developer ConsenSys has teamed up with the global payments platform Mercuryo to streamline the process of purchasing cryptocurrencies directly from the web3 wallet using bank cards, Apple Pay and Google Pay.<\/span>","<span data-v-f87c67ca=\"\">The integration offers support for 19 fiat currencies and 18 cryptocurrencies, including ether, dai, tether and USDC. The partnership was announced in a statement on Thursday.<\/span>","<span data-v-f87c67ca=\"\">“Collaborations with market leaders like MetaMask are an exciting opportunity for Mercuryo to help more people experience cryptocurrencies in the easiest way possible,” Mercuryo CEO Petr Kozyakov said in the statement. “Instead of opening yet another new account at one of the exchanges, the users can manage their digital assets on a single platform.”<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrency purchases can be complex, often requiring time-consuming know-your-customer (KYC) and anti-money laundering (AML) checks. The Mercuryo integration aims to simplify the procedure with an instant checkout and easier onboarding process, enabling MetaMask users to purchase up to €699 ($750) without needing full identity verification.<\/span>","<span data-v-f87c67ca=\"\">\"Our integration with Mercuryo helps streamline onboarding and the process of acquiring digital assets,\" said MetaMask product manager Lorenzo Santos. \"This enables our users to seamlessly explore the web3 ecosystem, including NFT marketplaces, play-and-earn games, decentralized autonomous organizations (DAOs), decentralized finance (DeFi) applications and metaverse worlds.”<\/span>","<span data-v-f87c67ca=\"\">The move is the latest in a series of integrations aiming to improve and diversify available payment options for MetaMask users. Last week, MetaMask also <\/span><a href=\"https:\/\/www.theblock.co\/post\/210067\/metamask-adds-onramp-money-to-streamline-crypto-purchases-in-india\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">integrated<\/span><\/a><span data-v-f87c67ca=\"\"> with Onramp.money, allowing Indian users to purchase cryptocurrency directly from the web3 wallet.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Mercuryo","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Petr Kozyakov","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"$750","content":"MONEY"},{"type":"Lorenzo Santos","content":"PERSON"}],"hashtag":["ASSETS","DECENTRALIZED INFRASTRUCTURE","DEXS","IDENTITY","WALLET MAKERS","WALLETS"],"authors":["James Hunt","The Block"]}