{"summary":"This participation from one of the largest names in traditional gaming could get more eyes on the crypto gaming sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206895\/fortnite-player-mongraal-claims-top-score-on-bored-ape-yacht-clubs-viral-nft-game-dookey-dash","publishDate":"2023-01-30T18:32:15","id":10072,"type":null,"title":"Fortnite player Mongraal claims top score on Bored Ape Yacht Club&#x27;s viral NFT game Dookey Dash","category":["NFT COLLECTIONS"],"content":["A professional Fortnite player Mongraal set a new high score on Bored Ape Yacht Club's game Dookey Dash yesterday.&nbsp;","Mongraal <a href=\"https:\/\/twitter.com\/Mongraal\/status\/1619726874770546688?s=20&amp;t=wLdNksCep6oOWcR9y5LE3Q\" data-v-f87c67ca=\"\">tweeted<\/a> a screenshot of his high score, which could introduce the Fortnite community to NFTs and crypto gaming. Mongraal commands a huge gaming audience from his Fortnite career with over 2 million followers on Twitter and 4.6 million subscribers on YouTube.&nbsp;","Some on crypto Twitter <a href=\"https:\/\/twitter.com\/ashrobinqt\/status\/1619735877747638272?s=20&amp;t=cMIzgXaCsbJg0xU-LffbwQ\" data-v-f87c67ca=\"\">think<\/a> this could direct attention to Yuga Labs, the creator of Bored Ape Yacht Club, and the crypto gaming sector in general.","Blockchain-based gaming has been a major focus in the crypto VC space but has yet to see any sustained traction. Blockchain gaming was one of the most heavily invested sectors in the past year, <a href=\"https:\/\/www.theblock.pro\/research\/q422-blockchain-venture-funding-and-ma-recap-202857\" data-v-f87c67ca=\"\">according<\/a> to The Block Research.","Yuga Labs' latest Sewer Pass NFT drop is the reason why many are attempting to get high scores in Dookey Dash. The score is tied to the NFT, and the highest scores will receive some reward. Yuga Labs has <a href=\"https:\/\/www.theblock.co\/post\/206337\/a-load-of-crap-bored-ape-nft-game-attracts-pros-angling-for-a-piece-of-the-dookey\" data-v-f87c67ca=\"\">not disclosed<\/a> how valuable the reward will be, but this has not stopped market participants and gamers from playing.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Twitter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}