{"summary":"Concordium founder Lars Seier Christensen said some level of identity verification is needed to prevent crypto scams.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254879\/concordium-founder-identity-verification-needed-to-prevent-crypto-scams","publishDate":"2023-10-05T07:30:26","id":10070,"type":null,"title":"Concordium founder says some level of identity verification needed to prevent crypto scams","category":["PEOPLE"],"content":["In the wake of high-profile figures like Mark Cuban falling prey to crypto scams, the key to prevention lies in choosing wallets and platforms that prioritize security and compliance, Concordium founder Lars Seier Christensen told The Block in a recent interview.&nbsp;","One of Mark Cuban’s crypto wallets was <a href=\"https:\/\/www.theblock.co\/post\/251343\/mark-cuban-loses-860000-of-crypto-to-phishing-attack\" data-v-f87c67ca=\"\">drained of over $860,000<\/a> in tokens and NFTs following a phishing attack involving his MetaMask web3 wallet last month.","Prevalent social engineering threats like such phishing scams can trick even the most experienced crypto users into handing over access to their digital assets. “To prevent scams, there has to be some level of identity verification, a means to verify that the parties involved in any given transactions are actually who they claim to be,” Christensen said.","Concordium’s “regulatory-compliant” Layer 1 blockchain, which integrates an ID component, can mitigate these risks and increase the chances of a positive resolution, Christensen added. Ethereum-compatible tokens can be transferred to Concordium's network via the Arabella bridge.","That said, even such measures may not be enough to prevent phishing attacks where the victim downloads a malicious version of the application, as was the case for Cuban.","The Concordium Foundation founder and chairman <a href=\"https:\/\/www.prnewswire.com\/news-releases\/concordiums-founder-lars-seier-christensen-takes-an-expanded-role-in-concordium-301755559.html\" data-v-f87c67ca=\"\">expanded his role<\/a> after Lone Fønss Schrøder stepped down as CEO in February. Christensen is also the founder and owner of the investment family office Seier Capital.","Previously, Christensen founded Denmark’s Saxo Bank and ran it as CEO for 20 years. Saxo offers access to crypto through exchange-traded products and foreign exchange pairs like BTCUSD, according to its <a href=\"https:\/\/www.home.saxo\/products\/crypto\" data-v-f87c67ca=\"\">website<\/a>. But the bank was ordered to <a href=\"https:\/\/www.theblock.co\/post\/237806\/saxo-bank-crypto-danish-regulator\" data-v-f87c67ca=\"\">liquidate its crypto holdings<\/a> by the Danish financial regulator in July.","Concordium recently launched its <a href=\"https:\/\/www.prnewswire.co.uk\/news-releases\/concordium-enables-a-new-standard-of-age-verification-amidst-growing-privacy-concerns-301928353.html\" data-v-f87c67ca=\"\">Web3 ID platform<\/a>, a zero-knowledge-based identity infrastructure that leverages the Concordium identity layer, drawing <a href=\"https:\/\/www.concordium.com\/article\/learning-series-1-a-closer-look-at-concordium-and-worldcoin\" data-v-f87c67ca=\"\">comparisons<\/a> to the controversial <a href=\"https:\/\/www.theblock.co\/post\/241871\/worldcoins-plan-to-decentralize-orb-production-sparks-illicit-data-harvesting-concerns\" data-v-f87c67ca=\"\">Worldcoin<\/a> project but without the need for eyeball-scanning Orbs.","Web3 ID enables secure and private identity verification for individuals and organizations on-chain — meaning that users can prove their identities and verify others before they interact with them, Christensen said. “Because all data is securely hosted on the blockchain, impersonation, identity falsification and, in turn, scams of this nature become close to impossible,” he added.","It may seem antithetical to the crypto ethos. However, by combining zero-knowledge proof technology and Concordium’s self-sovereign identity layer, Web3 ID enables users to verify their identity without sacrificing privacy, Christensen said.","Through ZK proofs and programmable ID solutions, there isn’t a need to sacrifice privacy for security, according to Christensen, enabling information to remain outside of centralized hubs like exchanges — which are also prime hacking targets. “Only the information necessary to validate the transaction is shared with the other party,” he said. “The data is never housed outside of the entities’ digital wallets, so individuals can engage in transactions with increased levels of trust and security without having to publicly share any information not directly relevant.”","Concordium's Web3 ID platform is designed to heighten security while maintaining the core principles of blockchain technology, Christensen said — from decentralization to trustlessness and personal data ownership. Users share only relevant information with dapps to verify their identity, putting them in control of their data and what they share, securely hosted in a decentralized wallet, he added.","However, user credentials can be accessed in the event of legal requests from authorities. Concordium’s anonymity revokers have legal rights in specific jurisdictions. There is a publicly visible registry of anonymity revokers that is curated by the Concordium Foundation. Anonymity revokers can initiate the manual process of decrypting credential data in cooperation with identity issuers — trusted entities on-boarded by the foundation and delegated with the task of validating and issuing ID credentials to users. Each on their own cannot reveal the identity of the owner of the credential, requiring a court order or some law enforcement request in their jurisdiction to initiate the unlocking process.","When asked about security and censorship concerns surrounding this process, Christensen said the platform is designed to validate and verify the data provided but not store it. “Personal data can be accessed, albeit only during the validation of transactions, it is never stored in a centralized database which protects users against any potential data exploit.”","Christensen concluded that digital identity is central to almost everything in crypto and verifiable and secure digital identity solutions were needed to prevent interacting with fraudulent peers and falling victim to scams.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Christensen","content":"PERSON"},{"type":"Lars Seier Christensen","content":"PERSON"},{"type":"Saxo Bank","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Denmark","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Concordium","content":"ORGANIZATION"},{"type":"$860,000","content":"MONEY"},{"type":"Concordium Foundation","content":"ORGANIZATION"},{"type":"Seier Capital","content":"ORGANIZATION"},{"type":"July","content":"DATE"}],"hashtag":["IDENTITY"],"authors":["James Hunt","The Block"]}