{"summary":"Citi’s researchers believe bitcoin could evolve into an international trade currency, helping to simplify global trade\nBut a number of issues – including concerns over scalability and potential regulatory backlashes – stand in the way","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/96599\/bitcoin-international-trade-currency-citi","publishDate":"2021-03-01T06:37:25","id":1007,"type":null,"title":"Bitcoin could become the “currency of choice for international trade”, says Citi","category":["Bitcoin"],"content":["US banking giant Citi has authored a new report which suggests bitcoin could become “an international trade currency” as it evolves.","The report, entitled <a href=\"https:\/\/ir.citi.com\/_tpHpW8MfaZ1QXwGmP1JGMGXXI95qXm3IMJzUJScLMb6XIjtOls6EbDehXMR3B_o9Opi7mdc5tQ%3D\" data-v-f87c67ca=\"\">“Bitcoin: At the Tipping Point”<\/a>, charts the evolution of bitcoin from a form of payment to its current status as a store of value. The authors forecast that bitcoin’s core properties combined with its global reach and neutrality could see it morph into the “currency of choice” for international trade in around seven years.","“Perceptions about what makes bitcoin important continue to evolve and create new opportunities while increasing its perception towards becoming mainstream,” the report states.","“A focus on global reach and neutrality could see bitcoin become an international trade currency. This would take advantage of bitcoin’s decentralized and borderless design, its lack of foreign exchange exposure, its speed and cost advantage in moving money, the security of its payments, and its traceability.”","Citi’s report explain that bitcoin, in the role of a global trade currency, could be used by importers and exporters to pay for goods and services directly – simplifying the process of international trade. A decentralized cryptocurrency may be preferred to a Central Bank Digital Currency, it argues, because “no government or outside entity can take steps that might affect the supply of the trade currency, helping to decouple trade from political considerations.”","Citi’s researchers noted, however, that a number of potential barriers stand in the way of this vision coming to fruition.","The report highlighted bitcoin’s scalability issues, pointing to 2020 analysis which suggests that bitcoin can handle on average 5 transactions per second – which is some 4,800 times slower than the Visa network’s capacity.","Increased adoption by institutional investors has been a big tailwind for bitcoin in the past year, the report states, but a range of potential risks could derail uptake.","“The entrance of institutional investors has sparked confidence in cryptocurrency but there are still persistent issues that could limit widespread adoption,” the report states.","“For institutional investors, these include concerns over capital efficiency, insurance and custody, security, and ESG considerations from bitcoin mining.”&nbsp;","The report concludes by stating that bitcoin is as “the tipping point of its existence”, noting that its evolution will have wide-ranging repercussions."],"hashtag":[]}