{"summary":"Coin98 Super Wallet is excited to announce its partnership with Jambo, the visionary creator of the JamboPhone and a leader in developing Web3 infrastructure for emerging markets. This partnership is dedicated to driving the adoption of Web3 technologies in developing areas, starting with Coin98’s home market in Asia. The key part of this initiative, Coin98 Super Wallet will be pre-installed on JamboPhone, the first “earn phone” for emerging markets, enabling instant and convenient access to Web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281478\/coin98-super-wallet-pre-installed-on-jambophone-fostering-web3-adoption-across-asia","publishDate":"2024-03-11T09:01:05","id":10076,"type":null,"title":"Coin98 super wallet pre-installed on JamboPhone, fostering Web3 adoption across Asia","category":["SPONSORED"],"content":["<a href=\"https:\/\/twitter.com\/coin98_wallet\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coin98 Super Wallet<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> is excited to announce its partnership with Jambo, the visionary creator of the JamboPhone and a leader in developing Web3 infrastructure for emerging markets. This partnership is dedicated to driving the adoption of Web3 technologies in developing areas, starting with Coin98’s home market in Asia. The key part of this initiative, Coin98 Super Wallet will be pre-installed on JamboPhone, the first “earn phone” for emerging markets, enabling instant and convenient access to Web3.<\/span><\/i><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><\/i>","<span data-v-f87c67ca=\"\">The partnership between Coin98 and <\/span><a href=\"https:\/\/twitter.com\/JamboTechnology\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Jambo<\/span><\/a><span data-v-f87c67ca=\"\"> is driven by a shared vision of making Web3 accessible to everyone, regardless of their geographical location or background. The JamboPhone, preloaded with the JamboApp and Jambo Ecosystem of partnered applications, is specifically designed for emerging markets and has opened doors to the digital economy that was previously out of reach for many. By pre-installing the <\/span><a href=\"https:\/\/coin98.com\/wallet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coin98 Super Wallet<\/span><\/a><span data-v-f87c67ca=\"\"> on every JamboPhone, more users across Asia will be able to engage seamlessly with cryptocurrencies and decentralized applications (dApps) at their fingertips.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This collaboration represents a significant milestone in our journey toward a more open and decentralized future. The partnership of the Coin98 Super Wallet’s extensive compatibility with over 90 blockchains and powerful features from the affordable and accessible <\/span><a href=\"https:\/\/www.jambo.technology\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">JamboPhone<\/span><\/a><span data-v-f87c67ca=\"\"> priced at only $99 with global reach is the strategic move to empower individuals to participate in the global digital economy like never before.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"At Coin98, we believe that Web3 technologies have the potential to transform lives and foster financial inclusion on a global scale. By partnering with Jambo, we are driving the adoption of these technologies in underserved markets where access to traditional financial services may be limited,\"<\/span><\/i><span data-v-f87c67ca=\"\"> said <\/span><a href=\"https:\/\/twitter.com\/imlethanh98\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Thanh Le<\/span><\/a><span data-v-f87c67ca=\"\">, co-founder of <\/span><a href=\"https:\/\/ninetyeight.world\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ninety Eight<\/span><\/a><span data-v-f87c67ca=\"\">, the builder of Coin98 Super Wallet.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;“The JamboPhone is not just a product, it’s a movement towards financial freedom for emerging markets.\" <\/span><\/i><span data-v-f87c67ca=\"\">said James Zhang, Co-founder, Jambo.<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> “We believe talent is equally distributed, but opportunity is not”.<\/span><\/i>","<span data-v-f87c67ca=\"\">This collaboration goes beyond Coin98 and Jambo; it is about empowering individuals, fostering financial inclusion, and bridging the digital gap. By making Web3 accessible in underserved markets, we are unlocking new opportunities for economic growth, innovation, and participation in the global digital economy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is the very first step to embrace Web3 adoption; we invite you to stay tuned as we embark on this transformative journey together. Exciting developments and solutions lie ahead.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This post is commissioned by Coin98 and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em><br data-v-f87c67ca=\"\">\n<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Jambo","content":"LOCATION"},{"type":"Jambo","content":"PERSON"},{"type":"Thanh Le","content":"PERSON"},{"type":"$99","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"James Zhang","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}