{"summary":"Gotchichain, a Layer 3 rollup dedicated to the Aavegotchi on-chain game, will use Base as its settlement layer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283264\/aavegotchi-base","publishDate":"2024-03-19T04:35:17","id":10080,"type":null,"title":"Aavegotchi to launch Layer 3 rollup using Base for settlement in Q2 2024","category":["CRYPTO ECOSYSTEMS"],"content":["Gotchichain, a Layer 3 rollup dedicated to the Aavegotchi on-chain game, will use Base as its settlement layer.","Originally <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">developed using<\/a> Polygon’s software package, Gotchichain is set to launch in the second quarter of 2024 and focus on blockchain gaming.","Base is an EVM-compatible Layer 2 chain incubated by Coinbase. The team at Aavegotchi will leverage Base to offer an on-chain gaming platform called “Gaming Console.”","Aavegotchi may also explore the use of the Optimism stack with Gotchichain to further widen and scale its ecosystem.","Aavegotchi, a trading game inspired by 1990s Tamagotchi toys, features non-fungible tokens that function as tradable digital characters. Launched in January 2021, it was initially deployed on the Polygon sidechain. Now, it will have its own dedicated Layer 3 chain.","“The Aavegotchi Gaming Console, powered by Gotchichain and Base’s infrastructure, is set to offer open-source, onchain gaming like never before. We are delighted to deliver a powerful gaming experience to our users, powered by fast and scalable L2 technology,” said Coderdan, CEO of Pixelcraft Studios, the firm that developed the game.","After the proliferation of rollups, developers can now spin up <a href=\"https:\/\/www.theblock.co\/post\/235980\/offchain-labs-unveils-tool-to-build-layer-3-orbit-chains-on-arbitrum?utm_source=linkedin&amp;utm_medium=social\" data-v-f87c67ca=\"\">Layer 3 chains<\/a> that settle transactions on Layer 2s including Optimism, Base, Arbitrum and others. Layer 3 chains offer lower transaction fees and block space dedicated to specific applications.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Gotchichain","content":"PERSON"},{"type":"Base","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"The Aavegotchi Gaming Console","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"second quarter of 2024","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Aavegotchi","content":"ORGANIZATION"},{"type":"Coderdan","content":"PERSON"}],"hashtag":["BASE","DEVELOPER TOOLS","OPTIMISM"],"authors":["Vishal Chawla","The Block"]}