{"summary":"After Buterin’s X account was taken over, the perpetrators pushed out a message promoting a fake NFT drop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250047\/vitalik-buterins-x-account-hacked-to-carry-out-phishing-attack-that-stole-700000-in-crypto-nfts","publishDate":"2023-09-10T05:55:24","id":10084,"type":null,"title":"Vitalik Buterin’s X account hacked to carry out phishing attack that stole $700,000 in crypto, NFTs","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Last night, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.71%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Vitalik Buterin’s X (formerly Twitter) account was taken over and used to steal $700,000 in crypto and NFTs.&nbsp;<\/span>","When the account was taken over, it was used to advertise a fake commemorative NFT mint that supposedly had a time limit, encouraging users to mint them quickly. Yet the link was to a phishing website that would drain cryptocurrencies and NFTs from wallets that interacted with it.&nbsp;","Through this phishing attack, around $700,000 in crypto and NFTs were lost, according to estimates from crypto sleuth ZachXBT and on-chain data. This included one CryptoPunk NFT worth 153 ETH ($250,000) and hundreds of ether from multiple individuals. Most of the NFTs have been sold, with many of the proceeds from the attack remaining in the hacker’s <a href=\"https:\/\/app.zerion.io\/0x4ef6f0d3f94ff609acef88068b1fc66a1184b3f3\/overview\" data-v-f87c67ca=\"\">wallet<\/a>.","It seems that the hacker used the popular Pink drainer software to carry out the attack, according to on-chain interactions between the attacker’s wallet and a wallet <a href=\"https:\/\/zapper.xyz\/account\/0x9fa7bb759641fcd37fe4ae41f725e0f653f2c726\" data-v-f87c67ca=\"\">labeled<\/a> by crypto wallet explorer Zapper as belonging to Pink. As The Block reported, there is an underworld of bad actors who <a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\">create and sell NFT draining software<\/a> to those that want to carry out phishing attacks. Typically, those that buy the software give a portion of rewards back to the creator of the drainer. In some cases, the creator will carry out attacks using their own software.","While a relatively new drainer, Pink has been widely used for multiple big phishing attacks throughout this year. This includes attacks on the Discords of Orbiter Finance, LiFi, Flare and Evmos, as well as Steve Aoki’s X account and others.","Those carrying out the attacks often pose as journalists, pretending to be associated with crypto media organizations. One tactic they use is encouraging the target to bookmark a document in their browser, <a href=\"https:\/\/drops.scamsniffer.io\/post\/pink-drainer-steals-3m-from-multiple-hack-events-including-openai-cto-orbiter-finance\/\" data-v-f87c67ca=\"\">according to ScamSniffer<\/a>, which enables the malicious code to gain a foothold.&nbsp;","One way to fight such attacks is by keeping valuable NFTs and large amounts of crypto in cold storage, as opposed to in hot wallets. Emerging tools like <a href=\"https:\/\/www.theblock.co\/post\/207581\/delegate-cash-hits-400-million-milestone-as-lesser-known-project-finds-real-adoption\" data-v-f87c67ca=\"\">Delegate Cash<\/a> are also letting NFT owners delegate rights from their NFTs to other wallets, enabling them to access gated NFT community areas — like Discord servers — without signing in regularly with the wallet actually holding the NFT.","Buterin’s account takeover is the latest in a string of phishing attacks that have been carried out on X over the last few years. Multiple big name crypto individuals and company accounts have been targeted, from NFT project <a href=\"https:\/\/www.theblock.co\/post\/206378\/azuki-says-twitter-account-compromised-after-posts-promote-virtual-land-scam\" data-v-f87c67ca=\"\">Azuki<\/a> to the <a href=\"https:\/\/www.theblock.co\/post\/238214\/aptos-foundation-twitter-account-hacked-to-promote-fake-airdrop\" data-v-f87c67ca=\"\">Aptos Foundation<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"-0.71%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Orbiter Finance","content":"ORGANIZATION"},{"type":"Aptos Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pink","content":"ORGANIZATION"},{"type":"Steve Aoki","content":"PERSON"},{"type":"$700,000","content":"MONEY"},{"type":"CryptoPunk NFT","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["Tim Copeland","The Block"]}