{"summary":"Australia-based blockchain gaming studio Illuvium will release an alpha version Illuvium: Zero tomorrow, it&#x27;s third game.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199387\/illuvium-release-third-blockchain-game","publishDate":"2023-01-05T06:46:57","id":10093,"type":null,"title":"Illuvium kicks off 2023 with release of third blockchain game","category":["METAVERSE & NFT"],"content":["Australia-based blockchain gaming studio Illuvium will release an alpha version of Illuvium: Zero tomorrow.","Open to the roughly 6,500 holders of Illuvium land NFTs on mobile and PC, Zero joins the team’s two existing games. Monster battler Illuvium: Arena and open world Illuvium: Overworld, the latter of which <a href=\"https:\/\/www.theblock.co\/post\/194026\/illuvium-releases-overworld-as-it-attempts-to-bring-aaa-quality-to-web3-gaming\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">launched in December<\/a>, are both in the beta testing phase. While access to all three is currently limited, the company expects to open its universe up fully to the public midway through 2023.","Zero is a building game where players can develop and manage their \"digital industrial complex.\" Among the features, land NFT holders will be able to earn from their NFTs by extracting fuel and selling it on the game’s marketplace.","Built using Unreal Engine 5 on ImmutableX’s blockchain, Australia-based Illuvium wants to build a product capable of competing with non-blockchain games.&nbsp;","Web3 gaming has struggled to compete with mainstream gaming titles. Some top triple AAA games attract millions of players a day, while even the most popular blockchain games often struggle to reach that number in a month.","A lack of interest in the game’s content, dislike of crypto and difficult onboarding processes have all been cited as reasons for the lack of uptake. Among the top games currently available, some still have very limited gameplay, attracting web3 gaming enthusiasts due to financial products embedded in the games such as opportunities to earn yield and cash-out tokens.","More ambitious gaming studios, which have announced plans for full MMORPGs (massively multiplayer online role player games), may take years to deliver a complete product.&nbsp;&nbsp;","And while some top gaming studios such as Square Enix have embraced web3 gaming, most remain wary. Mojang Studios and Rockstar Games, makers of Minecraft and Grand Theft Auto respectively, have both banned creators from using NFTs on their games' servers.","Top figures at the likes of Steam creators Valve and Microsoft have also been critical of NFT and blockchain usage in gaming.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enix","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"December","content":"DATE"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}