{"summary":"The agreements would resolve customer claims over fraud allegations by raising recoveries 5%, the WSJ said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241028\/celsius-network-reaches-settlements-wsj","publishDate":"2023-07-21T18:42:11","id":10104,"type":null,"title":"Celsius Network reaches settlements that could clear path to return customer funds: WSJ","category":["COMPANIES"],"content":["Bankrupt crypto lender Celsius Network reached settlements that could clear the path to obtain court approval to return customer assets, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/celsius-network-reaches-key-settlements-to-resolve-litigation-2be99035\" data-v-f87c67ca=\"\">reported<\/a> on Friday, citing court documents.","The agreements would resolve customer claims over fraud allegations by raising recoveries 5%, the WSJ said, adding that a total of 30,000 claims seeking $78 billion could be settled.&nbsp;","Celsius will see court approval for the settlements on Aug. 10 at a hearing, according to the report.&nbsp;","A confirmation hearing on Celsius' reorganization plan is set for October, and customers could start to see disbursements of crypto and other assets before the end of the year, the WSJ added. While Celsius lawyers have argued that customers are owed no more than that they had deposited, some users filed claims seeking damages for alleged misconduct by former management.&nbsp;","The Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/239407\/sec-files-lawsuit-against-celsius-and-ex-ceo-alex-mashinsky\" data-v-f87c67ca=\"\">earlier this month<\/a> filed a lawsuit against Celsius and its former CEO Alex Mashinsky in federal court, accusing them of raising billions through fraudulent and unregistered sales, lying to investors and manipulating the price of a native token.","Celsius filed for bankruptcy about a year ago in one of the highest profile crypto implosions ever. At one point the crypto lender held $30 billion in assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$78 billion","content":"MONEY"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Aug. 10","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}