{"summary":"Coinbase has resigned from cryptocurrency and blockchain advocacy group the Blockchain Association following the admittance of Binance.US.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74436\/coinbase-exits-trade-group-following-entry-of-upstart-rival-binance-us","publishDate":"2020-08-11T13:53:01","id":10100,"type":null,"title":"Coinbase exits trade group following admittance of Binance.US","category":["THE BLOCK"],"content":["Exchange-operator Coinbase has resigned from cryptocurrency and blockchain advocacy group the Blockchain Association following the admittance of an upstart rival, The Block has learned.&nbsp;","In a letter penned to the association on August 11, Coinbase said it was resigning from the DC-based lobbying group, led by former congressional staffer Kristin Smith, effective immediately.&nbsp;","<span data-v-f87c67ca=\"\">\"It is with considerable disappointment that I am tendering my resignation from the Board of the Blockchain Association, effective immediately,\" wrote Coinbase's Hermine Wong. \"My resignation also serves as notice of Coinbase’s withdrawal from the Blockchain Association, including all working groups and any ongoing initiatives.\"<\/span>","The note went on to say that the decision was made based on actions by the association in \"recent weeks.\" Although the letter does not call out Binance.US by name, insiders suspect that the resignation was tied to the admittance of the exchange into the association, which was <a href=\"https:\/\/support.binance.us\/hc\/en-us\/articles\/360052800473-Binance-US-Joins-the-Blockchain-Association\" data-v-f87c67ca=\"\">announced Monday.<\/a>","<span data-v-f87c67ca=\"\">\"And while we hope the Blockchain Association remains committed to those values, unfortunately, recent weeks have demonstrated to us that the Blockchain Association is not interested in the membership criteria we had worked to establish to underpin the mission of this organization,\" the letter said. <\/span>","<span data-v-f87c67ca=\"\">\"Certainly the Board and the association may choose to make that shift. But that shift in organizational goals is not in line with why Coinbase had joined this particular organization, nor is it in line with achieving the objectives of the association.\"<\/span>","In a statement, a Coinbase spokesperson added that \"decisions made now have the potential to irreparably impair the credibility of the association and make it increasingly difficult for it to achieve its goals and those of its members.\"","\"Coinbase will continue to work on behalf of the space and we look forward to finding ways to meaningfully collaborate with others in the ecosystem — including other advocacy groups — to help crypto reach its game-changing potential,\" the statement said.&nbsp;","On its website, the association says its members — which span exchange operators, investors and projects within the crypto market — \"have a substantial U.S. presence and a track record of regulatory compliance.\" The Blockchain Association also <a href=\"https:\/\/twitter.com\/BlockchainAssn\/status\/1293256281353060353?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> that it's disappointed Coinbase, a founding member, chose leave at a \"critical time for the industry.\"","\"However, we believe that it is important to abide by our established neutral membership criteria and honor majority Board opinion,\" said the tweet.&nbsp;","The association said its members remain active and looks forward to welcoming other pro-crypto voices.","As for Binance.US, the firm operates in the U.S., having <a href=\"https:\/\/www.fincen.gov\/msb-registrant-search\" data-v-f87c67ca=\"\">registered<\/a> with the Financial Crimes Enforcement Network (FinCEN) as a money services business. Its partner firm, Binance, is known for operating in a regulatory gray zone, frequently moving domiciles to evade certain regulations. Binance.US declined to comment on Coinbase's departure.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"Board of the Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kristin Smith","content":"PERSON"},{"type":"Hermine Wong","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"August 11","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"},{"type":"Board","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}