{"summary":"First Digital is introducing a new stablecoin that will be pegged to the U.S. dollar but regulated in Asia.\nThe announcement comes as Hong Kong introduces new regulatory framework for digital assets. ","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232791\/hong-kong-based-first-digital-introduces-usd-stablecoin","publishDate":"2023-05-31T22:11:44","id":1010,"type":null,"title":"Hong Kong-based First Digital introduces USD stablecoin","category":["Stablecoins"],"content":["Hong Kong-based qualified custodian and trust company First Digital is introducing a new stablecoin that will be pegged to the U.S. dollar but regulated in Asia.","Dubbed \"First Digital USD,\" or FDUSD, the coin is intended to be backed on a one-to-one basis by one U.S. dollar or asset of equivalent fair value, the company said in a statement, adding that the reserves would be held in segregated accounts at institutions in Asia.&nbsp;","The stablecoin is programmable and capable of enabling the execution of financial contracts, escrow services and insurance without intermediaries, First Digital said.&nbsp;","\"First Digital Labs will work closely with local and overseas regulatory authorities to ensure full compliance with current and future applicable laws and regulations, and First Digital Labs will participate in the shaping of their evolution, including the shaping of any regulatory regimes that FDUSD and\/or First Digital may fall under in the foreseeable future,\" the company said in a statement.&nbsp;","\"Stablecoins provide increased stability, a form of remittance, a hedge against central bank policymakers who seek to influence their domestic currencies,\" it added.","The announcement is notable, particularly with new Hong Kong \"Guidelines for Virtual Asset Trading Platform Operators\" that are becoming <a href=\"https:\/\/www.theblock.co\/post\/232027\/binance-cz-says-china-is-buzzing-after-bitcoin-tv-segment\" data-v-f87c67ca=\"\">effective<\/a> on June 1.","The rules set out the safe custody of assets, segregation of client assets, avoidance of conflicts of interest and cybersecurity standards, <a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/news-and-announcements\/news\/doc?refNo=23PR53\" data-v-f87c67ca=\"\">according<\/a> to the country's Securities and Futures Commission.","Regulatory uncertainty in the U.S., meanwhile, is pushing some industry players to warn U.S. lawmakers that the country could lose a leadership position in the sector as it's offshored to friendlier jurisdictions. Coinbase CEO Brian Armstrong said on <a href=\"https:\/\/www.theblock.co\/post\/232604\/coinbase-ceo-cites-rising-threat-from-china-in-fresh-plea-to-us-officials\" data-v-f87c67ca=\"\">Tuesday<\/a> that it was \"no surprise\" that Hong Kong has been positioning itself as a new crypto hub."],"hashtag":[]}