{"summary":"Vitalik Buterin has been active on Farcaster, a crypto-centric Twitter-esque social media platform, instead of Elon Musk&#x27;s X.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284367\/elon-musk-vitalik-buterin-twitter","publishDate":"2024-03-25T04:47:25","id":10116,"type":null,"title":"Elon Musk asks why Ethereum co-creator Vitalik Buterin left X","category":["PEOPLE"],"content":["Elon Musk asked today why Ethereum co-founder Vitalik Buterin left X, the platform he acquired and renamed from Twitter.","Musk's question came as <a href=\"https:\/\/twitter.com\/elonmusk\/status\/1772172698195526057\" data-v-f87c67ca=\"\">a reply<\/a> to X account Autism Capital, who shared their opinion that \"Vitalik needs to get back on X.\"","Buterin has been active on Farcaster, a crypto-centric Twitter-esque social media platform. \"Farcaster feels like it's gotten to the point where it's quite usable as a Twitter alternative for lots of people,\" he <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1758305569180660020\" data-v-f87c67ca=\"\">wrote<\/a> in February, adding: \"The channels thing actually makes it *better* in many ways in my opinion.\"","Farcaster garnered significant attention last month. The launch of Frames — embeds that effectively turn Farcaster-based posts into interactive mini-apps — <a href=\"https:\/\/www.theblock.co\/post\/275971\/farcaster-daily-active-users-surge-frames-launch\" data-v-f87c67ca=\"\">helped launch<\/a> the platform's daily active users to new highs. This, in turn, saw an increase in revenue. It also shipped <a href=\"https:\/\/www.theblock.co\/post\/278797\/farcaster-solana\" data-v-f87c67ca=\"\">support for Solana addresses<\/a> last month.","\"Farcaster isn’t going to win the culture war,\" Autism Capital opined. \"If he wants Ethereum to shine he should engage more on [X], not sequester himself with his chosen peers on an island. He will have far more impact if he engages the bigger community here.\"","Buterin has nearly <a href=\"https:\/\/warpcast.com\/vitalik.eth\" data-v-f87c67ca=\"\">180,000 followers<\/a> on Farcaster, where his account is tied to his Ethereum Name Service address, vitalik.eth. For comparison, he has 5.2 million followers on his X account — where he still posts, though somewhat infrequently.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/social-decentralized-finance\/farcaster-daily-activity\/embed\" title=\"Farcaster Daily Activity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Farcaster","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":["ELON MUSK","TWITTER","VITALIK BUTERIN"],"authors":["Adam James","The Block"]}