{"summary":"Friktion is sunsetting its user platform, moving all volts to withdraw-only mode as the Solana DeFi project has seen its TVL tank 97%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206095\/solana-based-defi-project-friktion-shuts-down-its-front-end","publishDate":"2023-01-27T05:22:09","id":10118,"type":null,"title":"Solana-based DeFi project Friktion shuts down its front end","category":["CRYPTO ECOSYSTEMS"],"content":["Solana DeFi yield platform Friktion is shutting down its front end website, with customers urged to withdraw their assets, the company <a href=\"https:\/\/friktionlabs.medium.com\/friktion-sunset-part-1-8c60691cb657\" data-v-f87c67ca=\"\">stated<\/a> on Friday. This means the front end website will no longer provide the same services, but the underlying protocol remains accessible on the blockchain.","The platform has taken the first step in this process, moving all volts into withdrawal-only mode. Volts are Friktion’s structured product for DeFi investments. Volt owners earn a share of the revenue from investment pools. The platform is also no longer accepting deposits from users.","The Solana DeFi platform said its decision to shut down was a difficult one but noted it had come up against numerous challenges. Friktion listed the FTX and Terra ecosystem collapses, as well as the several Solana outages as some of the challenges faced during its run.","Friktion’s total value locked peaked at $164 million in April last year, according to DeFiLlama. This value has dropped to $5 million, a decline of about 97%. The platform traded $3 billion and had over 20,000 user wallets during its run. Friktion even <a href=\"https:\/\/www.theblock.co\/post\/183510\/friktion-offers-under-collateralized-crypto-lending-for-institutional-clients\" data-v-f87c67ca=\"\">launched under-collateralized lending<\/a> for institutional clients in November last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"April last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"97%","content":"PERCENT"},{"type":"November last year","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Solana DeFi platform","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"$164 million","content":"MONEY"}],"hashtag":["LENDING","SOLANA"],"authors":["Osato Avan-Nomayo","The Block"]}