{"summary":"The Astra Upgrade for Avalanche subnets should improve the independent operation of application-specific chains in the ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260139\/ava-labs-proposes-astra-upgrade-to-bolster-subnet-architecture-on-avalanche","publishDate":"2023-10-31T11:05:05","id":10117,"type":null,"title":"Ava Labs proposes Astra upgrade to bolster subnet architecture on Avalanche","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ava Labs has proposed architectural changes to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Avalanche <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248368\/avalanche-avax-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avalanche_Circle_RedWhite_Trans.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AVAX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.51%\n    <\/span><\/a> <!----><\/span><\/span> subnets in a phased upgrade named Astra, with the aim of enhancing the way application-specific subnets operate independently from the primary network.<\/span>","If approved and implemented in the coming months, this upgrade aims to enhance the operation of subnets within the Avalanche network.","Written by Patrick O’Grady, head of engineering at Ava Labs, the <a href=\"https:\/\/github.com\/avalanche-foundation\/ACPs\/blob\/main\/ACPs\/13-subnet-only-validators.md\" data-v-f87c67ca=\"\">proposal<\/a> details a phased approach to refining subnet functionality. The first phase of the proposed Astra upgrade revamps the relationship between the primary Avalanche network and its subnets. Prior to this upgrade, subnet validators were required to validate not only the primary network — comprising the Exchange Chain (X-Chain)​, Platform Chain (P-Chain) and Contract Chain (C-Chain)​ — but also any additional subnets of interest.","With the upgrade in place, subnet validators will focus exclusively on running a subnet and synchronizing its P-Chain. This narrowed focus results in reduced computational and hardware demands, thereby lowering entry costs. The upgrade essentially eliminates the need for subnet validators to also serve as primary network validators. The P-Chain's function is to allow validators to stake AVAX and receive rewards.","“Without the requirement to validate the Primary Network, the need for Subnet Validators to initialize and synchronize the C-Chain and X-Chain can be relaxed. Subnet Validators will only be required to sync the P-Chain to track any validator set changes in their subnet and to support Cross-Subnet communication,” O’Grady stated.","The Avalanche network boasts multiple subnets designed for a range of applications. For instance, <a href=\"https:\/\/www.theblock.co\/post\/164497\/defi-kingdoms-to-leave-harmony-for-metaverse-focused-blockchain\" data-v-f87c67ca=\"\">DeFi Kingdom<\/a> and Shrapnel subnets cater to the play-to-earn gaming space. Projects like Dexalot and <a href=\"https:\/\/www.avax.network\/blog\/meld-leverages-avalanches-subnet-technology-to-enhance-its-defi-offerings\" data-v-f87c67ca=\"\">Meld<\/a> operate subnets that focus on decentralized finance. There are also specialized <a href=\"https:\/\/www.theblock.co\/post\/225210\/avalanche-unveils-evergreen-subnets-targeted-at-enterprise-clients\" data-v-f87c67ca=\"\">Evergreen subnets<\/a> targeted at enterprise clients in the financial services industry.","A subsequent phase will transition the subnet validation model from one based on staking to a rent-based system. Instead of the previous 2,000 AVAX ($22,000) staking requirement, a new “pay-as-you-go” validation fee in AVAX will be imposed. This fee is adjustable, varying depending on the number of validators in a specific subnet. This change introduces a dynamically priced, continuously charged mechanism, eliminating the need to lock or stake large sums of AVAX upfront.","The Astra upgrade is not the first initiative by Ava Labs to enhance its subnets’ capabilities. Last year’s <a href=\"https:\/\/www.theblock.co\/post\/197476\/avalanche-upgrade-banff-5\" data-v-f87c67ca=\"\">Banff upgrade<\/a> introduced features like Elastic Subnets and Avalanche Warp Messaging. The Astra Upgrade aims to build on these earlier advancements, further refining the network’s adaptability and functionality.","Avalanche’s Astra upgrade, according to Ava Labs, may help bring subnets to an broader market of both crypto native and traditional businesses building on-chain products and services into its ecosystem.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Evergreen","content":"ORGANIZATION"},{"type":"Ava Labs","content":"PERSON"},{"type":"$22,000","content":"MONEY"},{"type":"-0.51%","content":"PERCENT"},{"type":"Patrick O’Grady","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Astra Upgrade","content":"ORGANIZATION"},{"type":"DeFi Kingdom","content":"LOCATION"},{"type":"Astra","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Primary Network","content":"ORGANIZATION"}],"hashtag":["AVALANCHE"],"authors":["Vishal Chawla","The Block"]}