{"summary":"Kronos paused trading activity following the attack, which in turn led to problems on the Woo X exchange where it serves as a market maker.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263638\/taiwanese-trading-firm-kronos-research-hacked-for-estimated-25-million-zachxbt","publishDate":"2023-11-19T04:32:34","id":10119,"type":null,"title":"Taiwanese trading firm Kronos Research hacked for estimated $25 million: ZachXBT","category":["EXCHANGES"],"content":["Kronos Research, a trading, market making, and venture capital firm based in Taipei, experienced unauthorized access of its API keys on Saturday, the company said in a <a href=\"https:\/\/x.com\/ResearchKronos\/status\/1726013733888041376?s=20\" data-v-f87c67ca=\"\">post<\/a> on X, describing potential losses as \"not a significant portion of our equity.\"&nbsp;","Blockchain researcher ZachXBT <a href=\"https:\/\/x.com\/zachxbt\/status\/1726016901770367372?s=20\" data-v-f87c67ca=\"\">mapped<\/a> recent rapid outflows from a wallet that summed to over $25 million worth of ether in a reply to Kronos's post, saying it looks like $25 million was stolen.&nbsp;","Kronos paused all trading following the event, which led to <a href=\"https:\/\/x.com\/NewsInSmol\/status\/1726006833624613332?s=20\" data-v-f87c67ca=\"\">problems<\/a> on Woo X, the exchange that was incubated by Kronos and on which Kronos serves as a key market maker. In a <a href=\"https:\/\/x.com\/_WOO_X\/status\/1726016400894898232?s=20\" data-v-f87c67ca=\"\">statement<\/a>, Woo X reiterated that client funds are safe before announcing a temporary pause on certain asset pairs due to the loss of liquidity from Kronos's pause. Spot and perpetual trading and withdrawals have now resumed.","Kronos, in its post, said it aims to resume trading as soon as possible, and did not immediately respond to a request for comment from The Block.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kronos","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"Taipei","content":"LOCATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Zack Abrams","The Block"]}