{"summary":"Binance CEO Changpeng Zhao said he&#x27;s &quot;reasonably sure&quot; there were &quot;wide spread API key leaks&quot; from trading-bot platform 3Commas after speculation on social media emerged on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198295\/binance-warns-about-3commas-api-leak-says-users-should-disable-keys","publishDate":"2022-12-28T16:04:26","id":10113,"type":null,"title":"Binance warns about 3Commas API leak, says users should disable keys","category":["CRYPTO ECOSYSTEMS"],"content":["Binance CEO Changpeng Zhao said he's \"reasonably sure\" there were \"wide spread API key leaks\" from trading-bot platform 3Commas after fresh speculation about an October incident emerged on social media on Wednesday.","A 3Commas spokesperson confirmed the leak in a statement to The Block.&nbsp;","\"I strongly believe @tier10k is correct here,\" he <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1608182790540902407\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter, referring to a post from a user that said an API leak had been published. \"If you have ever put an API key in 3Commas (from any exchange), please disable it immediately.\"&nbsp;","An investigation conducted by 3Commas and the now-collapsed FTX crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/179237\/ftx-api-keys-3commas-exploited\" data-v-f87c67ca=\"\">in October<\/a> revealed that API keys had been used to conduct unauthorized trades for DMG trading pairs. The 3Commas team was alerted to the incident on Oct. 20, when FTX API keys connected to the platform were used to perform unauthorized trades.","3Commas said at the time that the API keys were not taken from the company and had probably been obtained from a third-party phishing attack or hack.","<a href=\"https:\/\/twitter.com\/cz_binance\/status\/1608187914009059331\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><img class=\"wp-image-198299 size-full\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/12\/binancetweet.jpg\" alt=\"\" width=\"586\" height=\"678\" data-v-f87c67ca=\"\"><\/a>","A 3Commas spokesperson on Wednesday said the company had seen a message from the hacker and confirmed the data in the posted files was real.","\"As an immediate action, we have asked that Binance, Kucoin and other supported exchanges revoke all of the keys that were connected to 3Commas,\" the spokesperson said in an emailed response to questions from The Block. \"We are sorry that this has gotten so far and will continue to be transparent in our communications around the situation.\"","The company said that it has not found proof of an \"inside job.\"","\"Only a small number of technical employees had access to the infrastructure and we have taken action since November 16 to remove their access,\" the spokesperson said. \"Since then, we have implemented new security measures and will not stop there; we are launching a full investigation involving law enforcement.\"","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kucoin","content":"PERSON"},{"type":"Oct. 20","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"DMG","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"November 16","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["Nathan Crooks","The Block"]}