{"summary":"The feature allows users to take self-custody of bitcoin, ether, USDT and USDC and share inheritance access to their Casa vaults.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285090\/casa-expands-self-custody-inheritance-solution-globally-bitcoin-ether-stablecoins","publishDate":"2024-03-27T11:00:03","id":10126,"type":null,"title":"Casa expands self-custody inheritance solution globally for bitcoin, ether and stablecoins","category":["CRYPTO INFRASTRUCTURE"],"content":["Self-custodial digital asset solutions provider Casa is expanding its inheritance product to global customers.","The “Casa Inheritance” feature is designed to simplify self-custodial crypto inheritance, which the firm describes as “the largest problem in self-custody today.” It enables users to secure their estate of digital assets, including bitcoin, ether and the stablecoins USDT and USDC, according to a statement.","Casa Inheritance is pitched as an alternative to passing on assets via custodial providers or non-custodial hardware wallets, which the firm argues are “notoriously susceptible” to loss — with an <a href=\"https:\/\/www.nytimes.com\/2021\/01\/12\/technology\/bitcoin-passwords-wallets-fortunes.html\" data-v-f87c67ca=\"\">estimated<\/a> $140 billion in bitcoin lost in part due to misplaced keys.","The company’s inheritance product was previously limited to U.S.-based investors with substantial bitcoin holdings. The expanded product builds on Casa’s core multi-key vault technology, allowing its members to grant secure, conditional vault access to a recipient of their choice from $250 per year. That could be a loved one, trustee or estate executor.&nbsp;","Casa’s multi-key vaults provide enhanced security by enabling an easy way for users to hold crypto assets in their own digital vault with up to five keys. The vaults offer more distributed security compared to single-key hardware wallets, browser extensions or third-party custodians like crypto exchanges and were expanded to offer <a href=\"https:\/\/www.theblock.co\/post\/235789\/casa-ether-vault-bitcoin\" data-v-f87c67ca=\"\">self-custody of ether<\/a> and stablecoins in addition to bitcoin last year.","Despite <a href=\"https:\/\/www.theblock.co\/post\/241945\/jameson-lopp-casa-bitcoin-lightning-network\" data-v-f87c67ca=\"\">criticism<\/a><span data-v-f87c67ca=\"\"> from <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.36%\n    <\/span><\/a> <!----><\/span><\/span> maximalists, Casa made the move in response to clients. “In recent years, it has become technically sound to implement <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.84%\n    <\/span><\/a> <!----><\/span><\/span> support, which has dovetailed with market demand,” the company said at the time.<\/span>","By requiring signatures from multiple devices for transactions, a system known as a multisig, Casa helps keep funds protected even if a key is lost or compromised, reducing concerns over theft, loss or exchange mismanagement. The devices can be spread out for safekeeping, including an emergency recovery service — where Casa holds a backup key on a user's behalf.","To set up the self-custodial inheritance feature, members grant conditional vault access and share locked, encrypted keys with a designated recipient within the Casa app. If that member becomes incapacitated, the recipient can then request a transfer, subject to a six-month waiting period, during which Casa notifies the member of the pending transfer. Only when that period has elapsed is the vault access unlocked for the recipient.","Commenting on the recently launched U.S. spot Bitcoin exchange-traded funds, the Casa team said that while Bitcoin ETFs are useful to gain exposure in retirement accounts or other regulated vehicles, they “miss bitcoin’s largest value proposition as truly ownable digital money — which can only be realized through self-custody.”&nbsp;","Casa also argued that spot Bitcoin ETFs suffer from significant centralization risk, with the <a href=\"https:\/\/www.theblock.co\/post\/279434\/kraken-challenging-coinbases-reign-as-chief-custodian-of-spot-bitcoin-etfs\" data-v-f87c67ca=\"\">majority<\/a> of products entrusting custody of bitcoin to a single custodian: Coinbase.","“A surprising second-order effect of the new ETFs is just how much they’re motivating sophisticated investors to choose self-custody for their generational wealth,” Casa co-founder and CEO Nick Neuman claimed. “If you view bitcoin as a long-term hedge against the financial system, holding it inside that system is a non-starter.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nick Neuman","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Casa","content":"ORGANIZATION"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"-0.84%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$140 billion","content":"MONEY"},{"type":"-0.36%","content":"PERCENT"},{"type":"Casa app","content":"ORGANIZATION"},{"type":"$250","content":"MONEY"}],"hashtag":["BITCOIN","ETHEREUM","SECURITY FIRMS","SPOT BITCOIN ETF","TETHER","USDC"],"authors":["James Hunt","The Block"]}