{"summary":"Here&#x27;s how crypto investment vehicles performed in Europe on Wednesday, June 15.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152272\/european-crypto-etn-and-etp-report-wednesday-june-15","publishDate":"2022-06-15T16:57:26","id":10121,"type":null,"title":"European crypto ETN and ETP report: Wednesday, June 15","category":["MARKETS"],"content":["ETNs and ETPs tracked daily by The Block had a mixed day of trading on Wednesday.&nbsp;","ETC Group's bitcoin (BTC) ETP had the best returns, up 6.20%, on a day when bitcoin threatened to cross below the $20,000 threshold. The next best was 21Shares Solana ETP, gaining 2.87% during trading in Europe.&nbsp;","21Shares also had its share of underperforming ETPs on Wednesday as both its Ethereum and Polygon ETPs lost over 4% throughout the day. The company released a research note on Wednesday stating its belief that both BTC and ether (ETH) are bottoming out.&nbsp;","\"Bitcoin and Ethereum are close to the bottom. Even though the price of Bitcoin and Ethereum have dropped 67% and 75% from all-time highs, they will be here to stay given the strong fundamentals and increasing use cases,\" the note read.&nbsp;","<em data-v-f87c67ca=\"\">Here's how some of the major European crypto investment vehicles performed on Wednesday, June 15:<\/em>","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2.87%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"ETC Group","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"75%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"6.20%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana ETP","content":"ORGANIZATION"},{"type":"Wednesday, June 15","content":"DATE"}],"hashtag":["BITCOIN","ETHEREUM","POLYGON","SOLANA"],"authors":["Adam Morgan McCarthy","The Block"]}