{"summary":"Crypto brought to its knees by Terra: Industry examines lessons to be learned from catastrophic event.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230590\/terra-death-spiral-turns-one-searching-for-silver-linings-among-the-wreckage","publishDate":"2023-05-12T14:30:10","id":10128,"type":null,"title":"Terra death spiral turns one: Searching for silver linings among the wreckage.","category":["COMPANIES"],"content":["One year ago the Terra blockchain, its algorithmic stablecoin TerraUSD and native token luna were in the midst of a free fall that quickly resulted in a crypto catastrophe that decimated nearly $45 billion of market capitalization.","Upon reflection, for many, Terra’s epic fall now doesn’t seem as shocking as it once was. “Entirely based on faith and speculation, luna was a prime beneficiary of bull market hysteria and one of the first casualties of a return to reality,” said Rich Rines, an initial contributor to Core DAO.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTerra-luna’s gargantuan crash not only evaporated billions of dollars and caused traders of all sizes to lose their money, it also quickly spread into a contagion which, in the frenzied months to follow, infected and ultimately toppled a gaggle of once-celebrated industry titans.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“When luna collapsed, the leverage in the system triggered a massive knock-on effect that ultimately shook the foundations of Celsius, Blockfi and FTX,” said Markus Levin co-founder of XYO Network, a blockchain-powered geospatial data company. “The collapse of Terra led to the collapse of the cryptocurrency industry, one domino after another, and it will never be the same,” added Gartner web3 analyst Avivah Litan.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","&nbsp;","Although FTX was arguably the last and most surprising domino to fall in the wake of Terra’s demise, the contagion also claimed, in addition to Celsius and BlockFi, major crypto industry players like Three Arrows Capital and Voyager Digital.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCrypto lender <a href=\"https:\/\/www.theblock.co\/post\/211865\/celsius-sale-plan-novawulf\" data-v-f87c67ca=\"\">Celsius<\/a>, hedge fund <a href=\"https:\/\/www.theblock.co\/post\/195611\/failed-hedge-fund-three-arrows-capital-estimated-assets-at-1-billion-in-july\" data-v-f87c67ca=\"\">Three Arrows Capital<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/228240\/binance-voyager-deal-bankruptcy\" data-v-f87c67ca=\"\">Voyager Digital<\/a> all filed for bankruptcy in July. Trading platforms <a href=\"https:\/\/www.theblock.co\/post\/214165\/blockfi-bankruptcy-drama-customer-wallets\" data-v-f87c67ca=\"\">BlockFi <\/a>and <a href=\"https:\/\/www.theblock.co\/post\/214165\/blockfi-bankruptcy-drama-customer-wallets\" data-v-f87c67ca=\"\">FTX<\/a> did the same in November.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBut the shockwaves are still being felt inside companies like Genesis, Gemini and Digital Currency Group, which are all still entangled in a mess triggered by the fallout.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAs Levin pointed out, one of the biggest problems exposed by Terra were issues related to leverage, or insane overleveraging.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLessons learned around leverage should, however, prove valuable in the future, said The Block Research Analyst Kevin Peng. “Flushing out all that leverage and accelerating the downfall of bad actors in the space was ultimately a good thing,” he said. “Without all those dramatic collapses it would’ve taken a lot longer for the overall market to recognize all the ways that risk can be built up quietly and interwoven in the crypto ecosystem.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","The crisis also made the distinctions between regular stablecoins and algorithmic stablecoins like TerraUSD — also known as UST —abundantly clear, said Jane Ma, co-founder of zkLend, a layer 2 money-market protocol. “One major misconception is that all stablecoins are created equal,” said Ma. “Unlike asset-backed stablecoins such as USDT and USDC, which are pegged to the US dollar, Terra's UST is algorithmically stabilized using a system of incentives and penalties … UST's stability depends on the proper functioning of the Terra ecosystem, including the luna token.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlthough luna was only valuable as long as people believed it to be so, as it is with all of crypto, its codependent relationship with UST was especially problematic. And once the confidence in luna disappeared and people decided to dump the token, everything crumbled, including the perceived stability and price of UST.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMany crypto executives are hoping now projects that have better built-in protections will attract more attention from investors.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The importance of risk management in Web3 projects has become even more evident. Projects embedded with insurance coverage are poised to gain traction as they offer an additional layer of protection against unforeseen events.,” said managing director of the web3 ecosystem builder Tz Apac, <a href=\"https:\/\/www.linkedin.com\/in\/katherinenglipei\/?originalSubdomain=sg\" data-v-f87c67ca=\"\">Katherine Ng<\/a>. “By integrating insurance mechanisms, these projects can mitigate potential risks and instill confidence in investors.”","The Terra-luna disaster and its ensuing damage continues to weigh on the minds of both the once-crypto-keen traditional financial institutions who experimented with digital assets during the bull run and the regulatory arena which failed to better oversee the market.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Trust in cryptocurrency has significantly eroded, which is so ironic since it was intended to be a trustless currency, i.e. it didn’t need to be trusted as there was no central authority,” said Litan. “Gartner clients in financial services have mainly all backed down from engaging in public cryptocurrency projects and protocols, for good reason … they are waiting for clear rules and regulations to start dipping their toes back in. But for now the cryptocurrency industry seems like a pariah to most of them.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe United States is seeking to bring both Terraform Labs co-founder Do Kwon — main architect of Terra-luna mess — and FTX co-founder Sam Bankman-Fried to justice, beneficiaries of a “cult of personality,” according to Rines. “One of the key lessons learned throughout 2022 is to cautiously evaluate each charismatic influencer who bursts onto the crypto scene,” he said. “Even decentralization-focused crypto-natives can fall prey to the halo effect.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","While authorities appear eager to hold Bankman-Fried and Do Kwon accountable, the American regulatory picture —&nbsp; an ineffectual system that failed to protect consumers in those cases — remains murky. U.S. regulators <a href=\"https:\/\/www.theblock.co\/post\/230304\/consensus-building-congress-crypto\" data-v-f87c67ca=\"\">have yet<\/a> to clearly agree on if cryptocurrencies are a security or a commodity while simultaneously sending a message that the future of digital assets could be in jeopardy.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEurope appears to be clearly ahead of the U.S. in terms of establishing guardrails that could make investing in or using crypto safer. Last month, the European Union officially <a href=\"https:\/\/www.theblock.co\/post\/227596\/binances-cz-gemini-crypto-sec-eu-mica\" data-v-f87c67ca=\"\">passed<\/a> its Markets in Crypto Assets (MiCA) regulation which focuses on the centralized points of the crypto industry while providing clarity over the scope and definitions of crypto regulation.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Many U.S. based crypto firms are moving or considering moving abroad, especially to Europe where regulation is clearer,” said Litan. “The SEC is cracking down on crypto but … the agency seems to be going after easy benign targets, many of which have not caused any notable damage to investors.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNot to be forgotten, aside from the corporate and governmental calamity the many investors and holders of cryptocurrency who lost money have been forced to reckon with some harsh realities.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPeng said whoever survived the Terra disaster is at least, likely wiser for it. “Anyone who witnessed the entire cycle from Terra’s rise to its downfall and the contagion that followed,” he said. “If they managed to survive through all that and stay interested in crypto, they definitely learned some really important lessons about how things work and how easy it can be to fool the market into a false sense of security.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“It’s important to step back and remember that we are still in the early innings of the blockchain movement,” added Levin. “And failures of projects are to be expected. After all, look at the dot-com bubble and how so many ventures back then also failed.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Markus Levin","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Litan","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Kevin Peng","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"XYO Network","content":"ORGANIZATION"},{"type":"Rich Rines","content":"PERSON"},{"type":"Levin","content":"PERSON"},{"type":"Katherine Ng","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Terra","content":"LOCATION"},{"type":"Avivah Litan","content":"PERSON"},{"type":"Terra blockchain","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Rines","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"Terra’s","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Apac","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Blockfi","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Flushing","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Gartner","content":"ORGANIZATION"},{"type":"Jane Ma","content":"PERSON"},{"type":"$45 billion","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}