{"summary":"The statement comes months after criticism of a public partial accounting report of Binance&#x27;s books, which led to an accounting firm pulling the report from its site and ceasing work with crypto clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241845\/sec-official-warns-accounting-firms-about-legal-liability-for-crypto-audits","publishDate":"2023-07-27T22:20:55","id":10138,"type":null,"title":"SEC official warns accounting firms about legal liability for crypto &#x27;audits&#x27;","category":["POLICY"],"content":["A senior Securities and Exchange Commission official warned accounting firms that they could be held legally liable for statements made by crypto companies that tout partial reviews of their finances as “audits.”","“Following the recent waves of scandal and insolvency in the crypto industry, there has been a renewed focus on the firms, including accounting firms, that have been retained by companies in the crypto-asset space—in particular, crypto asset trading platforms,” said SEC Chief Accountant Paul Munter in a <a href=\"https:\/\/t.co\/fsuxUGPrrb\" data-v-f87c67ca=\"\">prepared statement<\/a> on Thursday. “Certain crypto asset trading platforms, with others in the crypto industry, have marketed to investors their retention of third parties, sometimes accounting firms, to perform some sort of review of certain parts of their business, often presented as a purported ‘audit.’”","Accounting firm Mazars <a href=\"https:\/\/www.theblock.co\/post\/195623\/mazars-pauses-crypto-audits\" data-v-f87c67ca=\"\">ceased work<\/a> with crypto clients after public criticism around a partial review of Binance’s books late last year, which Binance owner and CEO Changpeng ‘CZ’ Zhao touted as an “audited proof” of reserves. The report came in the wake of FTX’s collapse following revelations that it did not have enough reserves to support the company’s FTT native token. Mazars also pulled the partial financial report that Zhao touted from <a href=\"https:\/\/veritas.mazars.com\/binance\/\" data-v-f87c67ca=\"\">its website<\/a>.","Included in the SEC’s lengthy <a href=\"https:\/\/www.theblock.co\/post\/233652\/sec-binance-and-us-affiliate-redirected-billions-in-customer-assets-to-zhaos-funds\" data-v-f87c67ca=\"\">enforcement filings<\/a> from last month against Zhao, Binance, and Binance US is an allegation that an auditor found Binance US did not have enough assets to cover customer redemptions. The non-public report suggested they were held with Binance as of Dec. 1, 2022, shortly before Zhao touted the Mazars non-audit on <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1600567141887000580?s=20\" data-v-f87c67ca=\"\">Twitter<\/a>, and despite claims that Binance US operates independently of Binance.","In his remarks on Thursday Munter elaborated that accounting firms could be legally liable under antifraud laws for statements made by their clients, if the clients mislead about the extent of a financial review or the “scope of work” done by the accounting firm.","“In addition, any person that knowingly or recklessly provides substantial assistance to another person in violation of a provision of the Securities Act or the Exchange Act, or of any rule or regulation issued thereunder, shall be deemed to be in violation of such provision to the same extent as the person to whom such assistance is provided,” Munter continued.","SEC Commissioner Hester Peirce questioned the statement on Twitter.","“Crypto platforms &amp; their accountants should be clear about what proof of reserves is and isn't &amp; customers should understand the limitations, but why would we want to discourage good-faith efforts to provide more transparency?,” she <a href=\"https:\/\/twitter.com\/HesterPeirce\/status\/1684689141789798400?s=20\" data-v-f87c67ca=\"\">posted<\/a>, with a link to Munter’s statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mazars","content":"ORGANIZATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Paul Munter","content":"PERSON"},{"type":"Dec. 1, 2022","content":"DATE"},{"type":"Munter","content":"PERSON"},{"type":"FTT","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Thursday Munter","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance US","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","BUSD","CZ","SEC"],"authors":["Colin Wilhelm","The Block"]}