{"summary":"Binance Labs has invested an undisclosed sum in StakeStone, a liquidity infrastructure startup that currently supports Ethereum restaking.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284388\/binance-labs-invests-stakestone","publishDate":"2024-03-25T06:02:12","id":10130,"type":null,"title":"Binance Labs invests in StakeStone as it continues to bet big on restaking sector","category":["DEALS"],"content":["Binance Labs has invested an undisclosed sum in StakeStone — a liquidity infrastructure startup that also supports restaking — as it continues to bet big on the staking and restaking sectors.","StakeStone calls itself an \"omnichain liquidity distribution network\" capable of integrating various yield sources — including Ethereum staking, restaking, real-world assets, as well as artificial intelligence and decentralized physical infrastructure network assets — Charles K, co-founder of StakeStone, told The Block.","Singapore-based StakeStone currently supports Ethereum restaking on its platform. Users staking ether with StakeStone receive STONE, a \"yield-bearing ETH\" token, which can be further utilized for additional rewards, Charles said. StakeStone is also exploring opportunities within the Bitcoin restaking ecosystem to introduce \"yield-bearing BTC (STONE BTC),\" he added.","Charles noted that StakeStone is not merely a liquid restaking protocol, as restaking serves as one of the platform's underlying strategies, with plans to support bitcoin and other assets in the future.","In recent months, Binance Labs has increased its support for startups in the restaking space. This year, it invested in the Bitcoin staking protocol <a href=\"https:\/\/mta-sts.theblock.co\/post\/279344\/binance-labs-bitcoin-staking-protocol-babylon\" data-v-f87c67ca=\"\">Babylon<\/a> and Ethereum restaking protocols <a href=\"https:\/\/www.theblock.co\/post\/278564\/binance-labs-renzo-ethereum-restaking\" data-v-f87c67ca=\"\">Renzo<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/275102\/binance-labs-puffer-investment\" data-v-f87c67ca=\"\">Puffer Finance<\/a>. Additionally, earlier this month, Binance Labs <a href=\"https:\/\/www.theblock.co\/post\/281299\/binance-labs-incubation-season-6-ethena-derivio-others?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">invested<\/a> in seven more startups, including synthetic dollar protocol developer Ethena Labs and zkSync-based decentralized derivatives exchange Derivio.","Binance Labs, the $10 billion venture capital and incubation arm of crypto exchange Binance, <a href=\"https:\/\/www.theblock.co\/post\/282756\/binance-spun-off-10-billion-venture-arm-binance-labs?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">quietly spun off<\/a> from Binance earlier this year. Binance Labs staff contracts are now separate from employees of the crypto exchange, similar to the structure of the Binance-backed BNB Chain project, with few operational changes.","Last year, Binance Labs accepted its first external capital when it closed a $500 million fund. However, over the summer, it <a href=\"https:\/\/www.theblock.co\/post\/264198\/binance-labs-repaid-external-investors-capital-over-summer\" data-v-f87c67ca=\"\">began<\/a> returning undeployed capital to limited partners.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Binance Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Charles","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Ethena Labs","content":"ORGANIZATION"},{"type":"earlier this year","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Charles K","content":"PERSON"},{"type":"Puffer Finance","content":"ORGANIZATION"}],"hashtag":["BINANCE","RESTAKING","STAKING","TOKENS"],"authors":["Yogita Khatri","The Block"]}