{"summary":"The HKMA today launched the sandbox following its recently concluded public consultation for a potential stablecoin licensing regime.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281914\/hong-kong-sandbox-stablecoin-issuers-communicate-supervisory-expectations","publishDate":"2024-03-12T05:54:24","id":10133,"type":null,"title":"Hong Kong launches sandbox for stablecoin issuers to &#x27;communicate supervisory expectations&#x27;","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Hong Kong launched a “sandbox” arrangement for stablecoin issuers to pave the way for future relevant regulations as the government continues its drive to become a regional crypto hub.<\/span>","<span data-v-f87c67ca=\"\">The Hong Kong Monetary Authority, the de facto central bank, <\/span><a href=\"https:\/\/www.hkma.gov.hk\/eng\/news-and-media\/press-releases\/2024\/03\/20240312-4\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> that the launch of the <\/span><a href=\"https:\/\/www.hkma.gov.hk\/eng\/key-functions\/international-financial-centre\/stablecoin-issuers\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sandbox<\/span><\/a><span data-v-f87c67ca=\"\"> could help the government deliver supervisory expectations to industry players interested in issuing fiat-referenced stablecoins in Hong Kong.<\/span>","<span data-v-f87c67ca=\"\">The sandbox launch comes after the authorities concluded a consultation on Feb. 29 on regulating stablecoin issuers. In December, the HKMA and the Financial Services and the Treasury Bureau <\/span><span data-v-f87c67ca=\"\">jointly <\/span><a href=\"https:\/\/www.theblock.co\/post\/269292\/hong-kong-proposes-licenses-should-be-required-for-stablecoin-issuers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched a consultation<\/span><\/a><span data-v-f87c67ca=\"\"> and proposed that all fiat-referenced stablecoin issuers should obtain a license from the HKMA.<\/span>","<span data-v-f87c67ca=\"\">“The sandbox arrangement serves as an effective channel for the HKMA and the industry to exchange views on the proposed regulatory regime, and will facilitate the formulation of fit-for-purpose and risk-based regulatory requirements, which is key to promoting the sustainable and responsible development of the stablecoin issuance business,” Eddie Yue, chief executive of the HKMA, said today in the statement.<\/span>","<span data-v-f87c67ca=\"\">The HKMA noted that sandbox applicants should come up with reasonable business plans and that their proposed operations under the sandbox arrangement will be conducted within a limited scope and in a risk-controllable manner.<\/span>","<span data-v-f87c67ca=\"\">“We see there's a very good demand. It is still a very, very small market — lots of room to grow for not only us — but I think there are a lot of new stablecoins that will be coming on the market fairly soon,” Vincent Chok, chief executive officer of First Digital, the issuer of <a href=\"https:\/\/www.theblock.co\/post\/277220\/fdusd-stablecoin-trading-pairs-hit-highest-ever-share-of-spot-trading-volume-on-binance\" data-v-f87c67ca=\"\">FDUSD stablecoin<\/a>, told The Block today. “We know that there are a lot of people that are lining up to apply for this Hong Kong stablecoin licensing as well.”<\/span>","<span data-v-f87c67ca=\"\">Chok said that the firm plans to participate in the sandbox as it is getting ready to issue a Hong Kong dollar-denominated stablecoin in the hope of launching it later this year.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"First Digital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Feb. 29","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Eddie Yue","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"Vincent Chok","content":"PERSON"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}