{"summary":"Ethereum is preparing to launch the &quot;Shapella Upgrade&quot; in April to provide participants in ETH staking, the first chance to unstake their assets since December 2020.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223428\/bifrost-finance-the-gateway-to-cross-chain-liquid-staking-on-polkadot","publishDate":"2023-03-29T08:55:00","id":10132,"type":null,"title":"Bifrost Finance, the gateway to cross-chain liquid staking on Polkadot.","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Ethereum is preparing to launch the “Shapella Upgrade” in April to provide participants in <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ETH<\/span><\/i><span data-v-f87c67ca=\"\"> staking, the first chance to unstake their assets since December 2020. The upgrade could increase staking participation by over $100 billion – a crucial development that promises to strengthen Ethereum’s network strength.<\/span>","<span data-v-f87c67ca=\"\">Along with increasing capital efficiency, asset liquidity and improving network security, Liquid Staking has rapidly gained traction as one of the preferred stakers’ choice. Unlike traditional staking methods that restrict users from accessing their tokens for extended periods, Liquid Staking provides immediate receipt and token verification with effortless and rapid fund accessibility, allowing for transfer, trading, and utilization in Decentralized Finance (DeFi) activities.<\/span>","<span data-v-f87c67ca=\"\">Most Liquid Staking protocols are built on the original chain. For example, Lido's <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ETH<\/span><\/i><span data-v-f87c67ca=\"\"> liquid staking protocol is an Ethereum contract implemented in Solidity, the language of Ethereum, and its <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stETH<\/span><\/i><span data-v-f87c67ca=\"\"> token is available only in the ERC-20 format. Using the <\/span><a href=\"https:\/\/bifrost.app\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bifrost DApp<\/span><\/a><span data-v-f87c67ca=\"\">, users no longer need to worry about managing multiple PoS chains as they can easily stake their assets and receive standardized LST in return.<\/span>","<a href=\"http:\/\/bifrost.finance\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bifrost Finance<\/span><\/a><span data-v-f87c67ca=\"\"> differentiates itself from other liquid staking protocols using Polkadot's heterogenous cross-chain messaging system, XCM. Leveraging XCM enables Liquid Staking Tokens (LSTs) minting on their origin and Bifrost's chain, resulting in standardized, omni-chain, cross-chain liquid staking tokens via XCM.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">vTokens are<\/span><a href=\"https:\/\/bifrost-finance.medium.com\/what-are-the-advantages-of-the-polkadot-xcm-based-liquid-staking-design-24ad51fc8f19\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> yield-bearing assets <\/span><span data-v-f87c67ca=\"\">based on a cross-chain infrastructure<\/span><\/a><span data-v-f87c67ca=\"\"> with auto-compounded staking rewards and represent staked tokens in PoS blockchains. By issuing vTokens for staked assets, the liquidity of these tokens can be retained. vToken minting can be performed on both the original and Bifrost chains, and circulates across multiple chains.<\/span>","<span data-v-f87c67ca=\"\">All vTokens offered by Bifrost, such as vETH, vDOT, vKSM, vGMLR, vMOVR, vBNC &amp; vFIL, have native versions on the Bifrost chain with a unified format, making vTokens easier to integrate between chains and leverage cross-chain composability.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">vTokens help maintain a healthy and composable relationship between protocol security, protocol staking, and DeFi ecosystems. Cross-chain interoperability is crucial to fully leverage the benefits of Liquid Staking. As the multi-chain landscape evolves, Bifrost's advantage in Liquid Staking will continue to grow, becoming more and more significant.<\/span>","<span data-v-f87c67ca=\"\">Liquid Staking solutions are likely to become the foundation of a new era in DeFi as they increase the capital efficiency of assets which leads to better yield-generating opportunities. Liquid staking will be a key tenant in ensuring a healthy and composable dynamic between protocol security, staking and the DeFi ecosystems built on top of protocols.<\/span>","<span data-v-f87c67ca=\"\">If you want to stay up to date and not miss any announcements or product releases, feel free to join <\/span><a href=\"https:\/\/discord.gg\/bifrost-finance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bifrost Discord Server<\/span><\/a><span data-v-f87c67ca=\"\"> and follow the <\/span><a href=\"https:\/\/twitter.com\/BifrostFinance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Official Twitter Page<\/span><\/a><span data-v-f87c67ca=\"\">, to get in touch with a growing community of users and crypto enthusiasts, who experience first-hand the features of the Polkadot ecosystem and its parachains.<\/span>","<em data-v-f87c67ca=\"\">This post is commissioned by Bifrost Finance and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"XCM","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"December 2020","content":"DATE"},{"type":"Bifrost Discord Server","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Bifrost Finance","content":"ORGANIZATION"},{"type":"Bifrost","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Solidity","content":"LOCATION"},{"type":"Bifrost","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}