{"summary":"Maverick Protocol, a project focused on DeFi infrastructure, raised $9 million in a round led by Founders Fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234187\/defi-maverick-protocol-raise","publishDate":"2023-06-21T09:00:04","id":10145,"type":null,"title":"DeFi infrastructure startup Maverick Protocol bags $9 million raise","category":["VENTURE CAPITAL"],"content":["Maverick Protocol, a project focused on DeFi infrastructure, raised $9 million in a round led by Founders Fund.","A bevy of top crypto investors also participated, including Pantera Capital, Binance Labs, Coinbase Ventures and Apollo Crypto.","According to an announcement today, the firm will focus on building more-efficient liquid staking token infrastructure to tackle cross-chain liquidity breakdowns. It will use the fresh injection to grow the protocol, incorporate new chains, and attract new developers and projects to its ecosystem.","Maverick raised a seed round in 2021, followed by another $8 million strategic round last year.","“We founded Maverick to provide the critical market infrastructure required to eliminate inefficiencies from DeFi and help the industry grow to new highs,” said Alvin Xu, founding member of Maverick Protocol, in a written statement, adding:&nbsp;“In a very short period of time, we’ve delivered consistently strong levels of capital efficiency to liquidity providers, and equipped token projects with new incentivization tools to build liquidity using precisely targeted rewards.”","Maverick <a href=\"https:\/\/www.theblock.co\/post\/217919\/maverick-protocol-dex-launches-with-lido-integration-to-compete-with-uniswap\" data-v-f87c67ca=\"\">launched<\/a> its own decentralized exchange in March — which, so far, has amassed $37 million in total value locked, according to today’s announcement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$9 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Alvin Xu","content":"PERSON"},{"type":"Maverick Protocol","content":"ORGANIZATION"},{"type":"$37 million","content":"MONEY"},{"type":"$8 million","content":"MONEY"},{"type":"Maverick","content":"ORGANIZATION"}],"hashtag":["STRATEGIC INVESTMENTS"],"authors":["Ryan Weeks","The Block"]}