{"summary":"TrueUSD (TUSD), a leading stablecoin, has announced its partnership with Moore CPA Limited (MooreHK), an esteemed accounting firm. Beginning in late","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268928\/tusd-engages-leading-accounting-firm-moorehk-to-provide-attestation-service-on-its-fiat-reserve","publishDate":"2023-12-27T09:44:46","id":10148,"type":null,"title":"TUSD Engages Leading Accounting Firm MooreHK to Provide Attestation Service on its Fiat Reserve","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">TrueUSD (TUSD), a leading stablecoin, has announced its partnership with Moore CPA Limited (MooreHK), an esteemed accounting firm. Beginning in late January 2024, MooreHK will start providing daily attestation services to TUSD, along with daily attestation reports for its stakeholders and TUSD token holders. This collaboration is a significant step in TUSD's globalization efforts, introducing daily auditing services and reserve attestation reports, thereby enhancing the transparency and reliability of TUSD’s reserve auditing system.<\/span>","<span data-v-f87c67ca=\"\">Established in 1975 and part of the Moore Global network, MooreHK brings a wealth of experience in auditing, assurance, accounting, tax, and consulting services. This partnership plays a crucial role in strengthening TUSD's reputation as a transparent and trustworthy stablecoin, aligning with its offshore migration strategy earlier this year.<\/span>","<span data-v-f87c67ca=\"\">Complementing this partnership, TUSD maintains its collaboration with The Network Firm LLP. This collaboration leverages technical support from The Network Firm Tech &amp; Services LLC, enhancing the auditing capabilities provided by MooreHK. This synergy showcases TUSD's dedication to innovation in blockchain technology, including advanced reserve auditing and on-chain Proof of Reserve.<\/span>","<span data-v-f87c67ca=\"\">TUSD remains focused on enhancing its development and user experience, maintaining a commitment to secure, stable, and transparent operations. For more information and to access reserve attestation reports, please visit the TUSD official website at tusd.io.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by TRON <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Moore","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Proof of Reserve","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"The Network Firm Tech &amp; Services LLC","content":"ORGANIZATION"},{"type":"1975","content":"DATE"},{"type":"Moore Global","content":"ORGANIZATION"},{"type":"TUSD","content":"ORGANIZATION"},{"type":"The Network Firm LLP","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}