{"summary":"Canadian police have issued a public warning following an emerging trend of home invasion-style robberies targeting large crypto investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240729\/crypto-investors-being-robbed-canada","publishDate":"2023-07-20T07:37:03","id":10143,"type":null,"title":"Crypto investors are being robbed in their own homes, Canadian police say","category":["POLICY"],"content":["Canadian police have issued a public warning following what appears to be an emerging trend of home invasion-style robberies in the country targeting large crypto investors.","\"The suspects appear to know the victims are heavily invested in cryptocurrency, know where they live and are robbing them in their own homes,\" Jill Long, staff sergeant of Delta Police Investigative Services, said in a release <a href=\"https:\/\/bc-cb.rcmp-grc.gc.ca\/ViewPage.action?languageId=4&amp;siteNodeId=2122&amp;contentId=80507\" data-v-f87c67ca=\"\">published<\/a> Wednesday by Delta Police and Richmond Royal Canadian Mounted Police (RCMP). Over the past year, several incidents have been reported in Delta and Richmond, where victims were holding \"large amounts\" of crypto, the police agencies said, without disclosing specific details.","In one case, an arrest has been made, and charges are being recommended. As for suspects' modus operandi, in each case, they gain entry into victims' homes by posing as delivery persons or people of authority. Once inside the homes, they seize crucial information that grants access to the victims' crypto accounts, the police said.","They have asked crypto investors to remain vigilant and take necessary precautions to safeguard themselves and their assets.","Canada is one of the popular nations for growing crypto adoption. The country <a href=\"https:\/\/blog.chainalysis.com\/reports\/western-canada\/#:~:text=Crypto%20crime%20in%20Canada,2021%20and%2024th%20in%202020.\" data-v-f87c67ca=\"\">ranked<\/a> 22nd in the Global Crypto Adoption Index by Chainalysis in 2022, up from 26th position in 2021 and 24th in 2020.","Canada's regulatory approach to the crypto industry, however, has been strict, leading to the shutdown of several exchanges like <a href=\"https:\/\/www.theblock.co\/post\/230689\/bitcoin-binance-pulling-out-of-canada\" data-v-f87c67ca=\"\">Binance<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/232602\/bybit-follows-binance-in-departure-from-canadian-market\" data-v-f87c67ca=\"\">Bybit<\/a> in the country in recent months. Canada introduced new guidance in February, mandating crypto companies to seek approval from the Canadian Securities Administrators, subjecting them to rigorous due diligence checks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Delta","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Richmond","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Richmond Royal Canadian Mounted Police (RCMP","content":"ORGANIZATION"},{"type":"Canadian Securities Administrators","content":"ORGANIZATION"},{"type":"Delta Police Investigative Services","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Jill Long","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Delta Police","content":"ORGANIZATION"}],"hashtag":["CRIME"],"authors":["Yogita Khatri","The Block"]}