{"summary":"Binance has begun to allow its larger traders to hold their assets with independent banks rather than on the exchange, according to the FT.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275128\/binance-larger-traders-hold-funds-sygnum-bank-flowbank","publishDate":"2024-01-30T08:39:29","id":10158,"type":null,"title":"Binance allowing larger traders to hold funds at Sygnum Bank and FlowBank: FT","category":["EXCHANGES"],"content":["Crypto exchange Binance has reportedly begun allowing its larger traders to hold their assets at independent banks.","The banks include Switzerland’s Sygnum Bank and FlowBank, the Financial Times <a href=\"https:\/\/www.ft.com\/content\/54438320-3bef-4830-b5c6-630639b300e0\" data-v-f87c67ca=\"\">reported<\/a> on Tuesday, citing three people with knowledge of the matter.","In November, Binance <a href=\"https:\/\/www.prnewswire.com\/news-releases\/binance-pilots-banking-triparty-agreement-to-help-institutional-investors-to-manage-counterparty-exposure-302002179.html\" data-v-f87c67ca=\"\">announced<\/a> a pilot banking triparty agreement with a third-party banking partner without naming the bank. That followed an earlier <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-05-30\/binance-may-let-some-clients-keep-trading-collateral-in-bank-accounts\" data-v-f87c67ca=\"\">report<\/a> from Bloomberg in May that the Swiss-based FlowBank and Liechtenstein-based Bank Frick were being explored as potential intermediaries for such a service.","It works by enabling users to hold collateral at the custodians in the form of fiat equivalents such as U.S Treasuries, where they can also earn around 4% in interest, Binance said at the time.","Binance traders have previously been restricted to keeping their assets on the exchange or via Binance’s custody partner Ceffu, which the Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/251760\/cz-says-binance-us-did-not-use-entity-at-center-of-recent-sec-allegations\" data-v-f87c67ca=\"\">described<\/a> as a \"newly rebranded Binance entity\" last year.","“I’d much rather park my money with a Swiss bank than Binance,” the head of a crypto trading firm told the FT, adding that “in theory you’re safer” depositing money at a custodian with regulatory oversight.","“Our relationships with existing or potential banking partners are founded on a significant level of trust,” a Binance spokesperson told The Block. “We are actively engaging with a host of banking partners and institutional investors who have shown interest, and we are committed to exploring and establishing new partnership opportunities, all within a framework of confidentiality and trust that institutional participants expect.”","“Sygnum is in the process of finalising the design of a product that would allow its largest institutional clients to segregate their custody and trading counterparties,” a Sygnum spokesperson told The Block. “This product should be launched shortly. Once live, it will be targeted solely at Sygnum clients representing the digital asset industry’s largest institutional market participants.\"","FlowBank did not respond to a request for comment.","The move enabling traders to hold their assets at the banks follows growing concerns on the risks of crypto exchange custody in the wake of <a href=\"https:\/\/www.theblock.co\/post\/186132\/ftx-collapse-timeline-six-days-that-rocked-the-crypto-industry\" data-v-f87c67ca=\"\">FTX’s collapse<\/a> in 2022 and Binance’s $4.3 billion <a href=\"https:\/\/www.theblock.co\/post\/263851\/us-justice-department-seeks-4-billion-from-binance-to-end-criminal-case-bloomberg\" data-v-f87c67ca=\"\">settlement<\/a> with U.S. authorities in November.","Binance had a disastrous 2023 on the legal and regulatory front, including the settlement with the Department of Justice, Department of the Treasury and the Commodity Futures Trading Commission, concluding a criminal investigation into allegations of money laundering and sanctions violations — marking one of the largest corporate settlements in U.S. history.","Binance’s former CEO Changpeng Zhao also agreed to <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">step down<\/a> as part of a plea deal, and the crypto exchange also faced a lawsuit from the SEC and numerous <a href=\"https:\/\/www.theblock.co\/post\/235084\/binance-exits-the-netherlands\" data-v-f87c67ca=\"\">regulatory<\/a> issues in Europe.","As a result, Binance's market share among non-USD exchanges slipped from over 70% at the start of 2023 to a low of 44% around the time of the settlement, according to The Block’s data dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/no-usd-support-exchange-volume-market-share\/embed\" title=\"No USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Data from Kaiko, comparing Binance’s trading volume to 23 other centralized exchanges, suggests that its market share remained relatively flat immediately following the settlement but subsequently regained the 50% level — demonstrating resilience post-settlement. Kaiko attributed this to a combination of zero-fee promotions on the platform and spot bitcoin ETF hype in December and January.","<span data-v-f87c67ca=\"\">Market share of trade volume. Image: <a href=\"https:\/\/research.kaiko.com\/insights\/bitcoin-rebounds-as-gbtc-outflows-slow\" data-v-f87c67ca=\"\">Kaiko<\/a>.<\/span>","The Block’s data, comparing Binance against 21 other exchanges, reflects a lower market share of around 46%, still down considerably from a peak of 71% in December 2022.","<em data-v-f87c67ca=\"\">Updated with comment from Binance and Sygnum Bank.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Department of the Treasury","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kaiko","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"44%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Liechtenstein","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Bank Frick","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Sygnum Bank","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"FT","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"71%","content":"PERCENT"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S Treasuries","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"46%","content":"PERCENT"},{"type":"December 2022","content":"DATE"},{"type":"$4.3 billion","content":"MONEY"},{"type":"FlowBank","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["James Hunt","The Block"]}