{"summary":"The crypto industry is staunchly fighting back against proposed rules that would expand who would have to report certain crypto transactions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262893\/crypto-industry-protests-against-treasurys-proposed-tax-reporting-regulation","publishDate":"2023-11-13T14:56:50","id":10159,"type":null,"title":"Crypto industry protests against Treasury&#x27;s proposed tax reporting regulation","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The crypto industry is staunchly fighting back against proposed regulation that would expand who would have to report certain cryptocurrency transactions with some calling it an impediment on decentralized finance citing constitutional concerns.&nbsp;&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The Treasury, alongside the Internal Revenue Service, released a set of proposed <a href=\"https:\/\/public-inspection.federalregister.gov\/2023-17565.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">regulations<\/span><\/a> in August that would require crypto brokers to be treated similarly to brokers for more traditional investments like stocks and bonds. Since then, over 124,000 letters have flooded in — with 2,000 being filed in just the past two days. Some argue that the proposed rules stretch the definition of a broker too far.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The IRS also held a hearing on Monday morning where the crypto sector and at one point, a tax preparer at a small tax firm, laid out the impacts of the proposed rules.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The proposal is overly broad, specifically for decentralized finance and should be limited to centralized entities, said the Blockchain Association's senior counsel Marisa Copel on Monday. Developers of DeFi protocols and non-custodial wallets are incapable of complying with the proposed rule, as the software allows users to connect with each other and does not \"effectuate transactions\" like a broker so those developers don't have access to the information that would be required for reporting, Copel said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"This proposal sweeps in parties whose only means of compliance would be to abandon the decentralized technology that makes them unique,\" Copel said. \"This construction will drive all U.S. based decentralized projects abroad or out of existence, full stop.\"&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The proposal also raises \"several constitutional concerns,\" including vague definitions and privacy concerns, Copel said. For its next steps, the Treasury should adopt the rules in a more staged approach, first focused on centralized trading platforms, before working with DeFi participants to figure out solutions.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Lawrence Zlatkin, vice president of taxes at Coinbase, said the rule proposal, if finalized, would lead to burdensome and duplicative reporting during Monday's hearing. The exchange had previously projected in a letter that the IRS would receive billions of annual filings if broker reporting expands to include stablecoins and other digital asset activities.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"The proposed expansion of the digital asset reporting regime will distract from the ability of the IRS and taxpayers to focus on relevant and appropriate compliance where genuine tax liability is created,\" Zlatkin said on Monday.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"First of all, I feel a little bit out of place testifying here because I'm really just a taxpayer and also a tax preparer at a small tax firm,\" said Ryan Leverett during Monday's hearing. Leverett said the firm primarily focuses on individual and small business taxpayers and noted that his firm often receives inaccurate or incomplete information from taxpayers.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The proposed regulation needs to go forward, Leverett said, pointing to bad actors in the crypto industry.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"As it stands now, the crypto space has seen too many instances of dishonest or shady companies, most famously FTX, that have taken advantage of reduced regulations around the space, to con their clients and investors out of their money and digital assets,\" Leverett said. \"This proposed rulemaking would be a good step in the direction of reining in the Wild West of digital assets as it exists now.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The Defi Education Fund said earlier this month in its letter that the proposal stretches the definition of a broker beyond its constitutional limits and that the Treasury is essentially creating a new kind of broker called a \"digital asset middleman.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">That middleman term could \"treat every participant in the blockchain technology stack as a broker,\" the fund wrote in its letter.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"The bottom line is that this proposal is confusing, self-refuting, and misguided. It attempts to ossify the antiquated structure of financial services by forcing businesses to fundamentally change their operations to become intermediating brokers, an idea that flouts Congressional intent and Constitutional protections,\" said Miller Whitehouse-Levine, CEO of the fund in a statement.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Many letters were filed anonymously or by individuals. One person argued that Treasury needed to \"<\/span><span class=\"s4\" data-v-f87c67ca=\"\">strike a balance that respects individuals' privacy rights,\" and another called for enhanced cybersecurity protections.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"While the proposed regulations aimed at aiding in the determination of amount realized and basis for certain digital asset transactions are commendable, it is imperative that privacy and safety be given due weight,\" they said. \"Balancing the need for transparent reporting with protecting the personal information of citizens is a delicate task but one essential to preserving the rights and liberties that define our great nation.\"<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Copel","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Marisa Copel","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Defi Education Fund","content":"ORGANIZATION"},{"type":"Ryan Leverett","content":"PERSON"},{"type":"Leverett","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Zlatkin","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Lawrence Zlatkin","content":"PERSON"},{"type":"Levine","content":"PERSON"},{"type":"Miller Whitehouse","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}