{"summary":"A request to keep the list secret has been challenged by an outlet covering the case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239696\/bankman-fried-asks-for-pre-approval-of-secret-list-of-visitors","publishDate":"2023-07-14T13:21:58","id":1015,"type":null,"title":"Bankman-Fried asks for pre-approval of secret list of visitors","category":["POLICY"],"content":["FTX founder and former CEO <a href=\"https:\/\/www.theblock.co\/post\/236507\/latest-ftx-bankruptcy-report-provides-lurid-details-into-alleged-fraud\" data-v-f87c67ca=\"\">Sam Bankman-Fried<\/a>, through his attorney, asked a federal judge to allow a sealed list of people to visit his parents’ house, where the criminally indicted crypto mogul remains under house arrest.","On July 13, lawyers for Bankman-Fried requested pre-approval of a sealed list of visitors that would not require the normal court-ordered security procedures for visitors to the household, part of an effort to ensure Bankman-Fried does not shift assets or attempt to contact potential witnesses.","Bankman-Fried’s attorney, Christian Everdell, told the court that the list “includes close friends and colleagues of Mr. Bankman-Fried’s parents and household help that regularly visit the house.” The request sought to keep the list out of public record.","“Here, even assuming that the list of people can be considered a ‘judicial document,’ the individuals’ privacy and safety interests greatly outweigh any presumption of access to the list and justify protecting their identities from public disclosure,” Everdell continued.","Under current terms of Bankman-Fried’s house arrest, a security guard must be present to screen visitors for any electronic devices, and visitors have to sign an electronic log.","If granted by the judge presiding over the case, Judge Lewis Kaplan of the District Court for the Southern District of New York, people on the list filed by Everdell on Bankman-Fried’s behalf would not be subject to those rules, though he said they have agreed to abide by the bail conditions, including a prohibition on sharing electronic devices with the disgraced FTX and Alameda Research owner.","Everdell added that prosecutors in the case reviewed the list and had no objection to pre-approving people on it, though they did not take a position on his request to keep the list of proposed visitors secret.","Inner City Press, a <a href=\"https:\/\/www.innercitypress.com\/\" data-v-f87c67ca=\"\">small digital media outlet<\/a> that covers the district court, challenged the request to keep those names sealed on Friday. Matthew Lee, ICP’s executive director, cited the fact that Bankman-Fried has violated terms of his bail before in using a <a href=\"https:\/\/www.theblock.co\/post\/211681\/bankman-fried-banned-from-using-vpn-bail-arguments-set-for-thursday\" data-v-f87c67ca=\"\">virtual private network and encrypted messaging apps<\/a> to contact former FTX colleagues.","Lee also noted that the people who helped pay Bankman-Fried’s bond were unveiled over the objections of Bankman-Fried and his defense attorneys.","“As with Bankman-Fried's suretors, the defense makes vague claim about privacy and even safety. This Court requested those arguments as to the suretors, and the defense never appealed as it had implied it would,” Lee wrote. “They can be seen entering the house. It is no burden to sign the log; the burden on them of the security guard is unclear. Their main interest seems in wanting to not be named. But this is a judicial document and should be unsealed.”","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Inner City Press","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July 13","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Everdell","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Christian Everdell","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"the District Court","content":"ORGANIZATION"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Matthew Lee","content":"PERSON"},{"type":"ICP","content":"LOCATION"}],"hashtag":["CRIME","FTX","SAM BANKMAN-FRIED"],"authors":["Colin Wilhelm","The Block"]}