{"summary":"ZenGo proposed a solution to the problem of offline signature exploits, which have led to the theft of NFTs and funds over the last few years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208030\/zengo-proposes-solution-to-tackle-offline-signature-exploits-with-eip-6384","publishDate":"2023-02-02T09:00:18","id":10150,"type":null,"title":"ZenGo proposes solution to tackle offline signature exploits with EIP-6384","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">ZenGo, a crypto security and wallet provider, has introduced a solution to tackle the rising problem of offline signature exploits. Such exploits have led to attackers deceiving users into signing hard-to-read wallet messages to steal crypto assets and NFTs.<\/span>","<span data-v-f87c67ca=\"\">Over the last few years, several crypto users have fallen victim to these malicious signatures, particularly on NFT marketplaces such as OpenSea where offline signatures are extensively used to trade NFTs without paying fees upfront.<\/span>","In January, NFT entrepreneur Kevin Rose was <a href=\"https:\/\/www.theblock.co\/post\/205606\/moonbirds-creator-kevin-rose-hacked-at-least-1-million-in-nfts-stolen\" data-v-f87c67ca=\"\">hacked<\/a> for NFTs totaling $1.5 million, after he was tricked into signing a malicious offline signature in what appeared to be a genuine feature on OpenSea.","<span data-v-f87c67ca=\"\">To address this prevalent security issue, ZenGo has released its <a href=\"https:\/\/zengo.com\/offline-signatures-can-drain-your-wallet-eip-6384-can-save-it-part-3-4\/\" data-v-f87c67ca=\"\">proposed solution<\/a> as an official Ethereum improvement proposal, known as <\/span><a href=\"https:\/\/github.com\/ethereum\/EIPs\/pull\/6384\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">EIP-6384<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span><span data-v-f87c67ca=\"\">The proposal seeks to make offline signatures both secure and easily readable for users. <\/span><span data-v-f87c67ca=\"\">By building upon the existing offline signature standard EIP-712, ZenGo has added a view-only function to smart contracts that translates the message into a human-readable form. <\/span>","<span data-v-f87c67ca=\"\">By implementing EIP-6384, all Ethereum smart contracts would assume the responsibility of providing a clear explanation of the message, preserving the fee-less transaction experience of decentralized apps. <\/span><span data-v-f87c67ca=\"\">This change would allow wallet users to receive a clear and understandable description of the message they are being asked to sign, allowing them to make an informed decision while signing transactions. <\/span>","<span data-v-f87c67ca=\"\">While there are certain third-party services already available to help users understand what they are signing, those may not always be reliable. <\/span><span data-v-f87c67ca=\"\">If wallets and decentralized apps adopt this proposal, users will no longer have to depend on such third-party tools to read information on offline signatures, ZenGo noted.<\/span>","<span data-v-f87c67ca=\"\">\"The EIP relies solely on existing system participants, such as wallets and smart contracts, to display the necessary information. This eliminates the need for additional participants like third-party services or browser extensions, which can introduce additional layers of potential vulnerabilities and trust issues,\" said Tal Be'ery, chief technology officer at ZenGo.<\/span>","<span data-v-f87c67ca=\"\">The proposed solution may mark a step toward creating more secure apps and alleviating users and projects from the fear of losing assets to hackers while using offline signatures, the ZenGo team added.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"6384","content":"DATE"},{"type":"Kevin Rose","content":"PERSON"}],"hashtag":["HACKS","WALLETS"],"authors":["Vishal Chawla","The Block"]}