{"summary":"One could argue that Bitcoin, the decentralized monetary network, relies heavily on an asset that is relatively illiquid and inaccessible to secure its infrastructure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228356\/hashpower-the-most-illiquid-asset-in-crypto","publishDate":"2023-04-28T09:00:39","id":10169,"type":null,"title":"Hashpower, the Most Illiquid Asset in Crypto","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">One could argue that Bitcoin, the decentralized monetary network, relies heavily on an asset that is relatively illiquid and inaccessible to secure its infrastructure.<\/span>","<span data-v-f87c67ca=\"\">While bitcoin is quite easy to trade, its security layer—mining hashpower—is far less-liquid, and that’s <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">not<\/span><\/i><span data-v-f87c67ca=\"\"> including the capex realities of running physical infrastructure. There are, of course, marketplaces for hashpower, but their generally centralized nature means that there is great potential for intermediaries determining “winners and losers.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The advent of smart contracts has proven that many aspects of finance — loans, insurance, exchange, and more — can be replicated on permissionless networks. The crypto ecosystem has come to call this “Decentralized Finance” or “DeFi.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a decentralized network, it's also possible to trade mining hashpower itself. This isn’t just more “...this, but more token-y” marketing. Hashpower traded, peer-to-peer, will be vital for the global health of mining moving forward.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Hashpower is a critical aspect for the security and performance of Bitcoin and other proof-of-work blockchains. It is the security root of the world’s most resilient network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As these networks grow into a financial system supporting thousands of people and businesses; hashpower gains importance as a fundamental piece of infrastructure of the global economy.<\/span>","<span data-v-f87c67ca=\"\">Consider this: Oil and steel became the backbone of modern infrastructure after the Second Industrial Revolution. They fueled and supported transportation and industries worldwide. We shaped and designed our cities based on them, but only because they became <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">liquid<\/span><\/i><span data-v-f87c67ca=\"\">—easily accessible and trade-able at a global scale.<\/span>","<span data-v-f87c67ca=\"\">In the case of Bitcoin, hashpower is what secures the financial revolution, much like how oil and steel secure industrial revolutions.<\/span>","<span data-v-f87c67ca=\"\">There are many industries that need oil and steel, but do not have the time, resources, or means to produce them themselves. Instead, they acquire them via marketplaces. Similarly, whether it is for creating their own blocks, pushing through their transactions, or simply participating in the network’s governance, we believe many organizations will demand a significant amount of hashpower.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That’s why we want to make hashpower a liquid asset and lay the groundwork to enable its accessible, global trading.<\/span>","<span data-v-f87c67ca=\"\">To unlock true hashpower liquidity, it will be necessary to provide a decentralized, peer-to-peer hashpower marketplace platform for buyers and sellers to transact freely and frictionlessly.<\/span>","<span data-v-f87c67ca=\"\">Lumerin is an open source protocol building precisely that platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By combining several technological resources—including distributed ledgers, smart contracts, tokenization, and data stream routing—the Lumerin Hashpower Marketplace can effectively enable peer-to-peer hashpower trading between users.<\/span>","<span data-v-f87c67ca=\"\">To ensure the marketplace's hashpower contracts are secure and reliable, the launch will be conducted in phases. Initially, <\/span><span data-v-f87c67ca=\"\">only buyers<\/span><span data-v-f87c67ca=\"\"> are able to connect to the marketplace using the Lumerin wallet to acquire real hashpower and point it to a mining pool via a simple smart contract call. Users can exchange Lumerin testnet tokens for real Bitcoin mining hashpower provided by the Lumerin team. Once this has been fully tested, <\/span><span data-v-f87c67ca=\"\">sellers<\/span><span data-v-f87c67ca=\"\"> will be onboarded.<\/span>","<span data-v-f87c67ca=\"\">Within the marketplace, buyers can generate contracts to purchase hashpower —- specifying the price, speed, and duration of the contract as needed. This opens up valuable possibilities for effective capacity planning and risk management tactics. Additionally, individuals can join in without possessing mining equipment by trading hashpower contracts similarly to professional miners.<\/span>","<span data-v-f87c67ca=\"\">The Lumerin Hashpower Marketplace aims to act as an escrow, with the smart contracts keeping custody of the funds until the terms agreed upon in the contract have been fulfilled, mitigating counterparty risk and enforcing completion.<\/span>","<span data-v-f87c67ca=\"\">This technology has the potential to unlock hashpower liquidity at a global scale, lowering the entry barriers to Bitcoin mining, and granting everyone the opportunity to participate in the mining process.<\/span>","<span data-v-f87c67ca=\"\">Ultimately, the Lumerin Hashpower Marketplace is an open-source protocol that aims to provide a decentralized, peer-to-peer marketplace for hashpower trading between buyers and sellers. With the advent of smart contracts and permissionless networks, the platform can revolutionize the way we trade and view hashpower, ultimately making it a more liquid asset accessible to everyone.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By providing a secure and accessible way for businesses, organizations, and governments to acquire hashpower, Lumerin is laying the groundwork for a more decentralized financial future. With the phased launch of the platform, Lumerin is committed to ensuring the integrity and security of the marketplace's hashpower contracts, and we can expect to see the potential of this technology unfold as more and more participants join in.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Lumerin<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Second Industrial Revolution","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lumerin Hashpower Marketplace","content":"ORGANIZATION"},{"type":"Lumerin","content":"PERSON"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}