{"summary":"Sam Bankman-Fried&#x27;s legal defense could cost millions of dollars.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201323\/unemployed-and-under-house-arrest-sam-bankman-fried-faces-enormous-legal-bills","publishDate":"2023-01-12T05:30:27","id":10164,"type":null,"title":"Unemployed and under house arrest, Sam Bankman-Fried faces enormous legal bills","category":["LEGAL"],"content":["Sam Bankman-Fried could rack up millions in legal bills as he faces a criminal trial, the wide-ranging FTX bankruptcy and civil enforcement cases from regulators.","The disgraced FTX founder, whose approximately $450 million in Robinhood shares were seized by the government, is likely to lean on friends and family to fund his defense.","Disgraced FTX founder Sam Bankman-Fried has an expensive year ahead of him. Unemployed, under house arrest and stripped of his Robinhood shares, his options for funding his defense are limited.","The former crypto mogul is staring down a criminal trial for what officials have deemed “one of the biggest financial frauds in American history.” Then there’s the wide-ranging bankruptcy playing out in two countries and three civil complaints that federal and state regulators filed against him. In order to deal with it, Bankman-Fried hired five lawyers, and he has his own spokesperson.","It’s not clear how the former billionaire will pay for it all.","“There's no way to know how much it's going to cost,” said attorney Ira Sorkin, who represented infamous Ponzi schemer Bernie Madoff more than a decade ago. “If he chooses to plead guilty, his legal fees will be certainly less, far less, than if he chooses to go to trial. Going to trial, that’s going to be a very expensive proposition.”","Bankman-Fried pleaded not guilty to fraud charges during a court appearance in New York earlier this month. The 30-year-old could face 115 years in jail if he is convicted on all counts. His criminal trial is set to begin in October.","The former FTX boss could be on the hook for millions of dollars in legal bills, according to lawyers and crypto watchers, and his on-paper fortune has evaporated over the last three months. Bankman-Fried claimed he had less than $100,000 left in his bank account in December, not long after Forbes pegged his net worth at $17.2 billion just weeks before his $32 billion crypto exchange collapsed.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We are all on the edge of our seats,” said Alex More, a partner at Carrington, Coleman, Sloman &amp; Blumenthal who focuses on digital assets. “SBF has already retained several criminal defense lawyers — a pretty formidable legal defense team — and so there's this question of how is he going to be able to pay them?”","Bankman-Fried was dealt a nine-figure blow this week when the Department of Justice <a href=\"https:\/\/www.theblock.co\/post\/200100\/robinhood-shares-seized-ftx\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">seized<\/span><\/a> his $450 million in shares of the online brokerage firm Robinhood. Bankman-Fried had said he needed the shares to fund his legal bills.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The withholding of costs necessary to an adequate criminal defense can constitute irreparable harm,” Bankman-Fried’s lawyers <a href=\"https:\/\/www.theblock.co\/post\/199697\/sam-bankman-fried-ftx-debtors-robinhood-shares\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">wrote<\/span><\/a> in a court filing last week, arguing he should have access to the shares.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The new leadership brought on to steer the FTX group of companies through bankruptcy and defunct crypto lender BlockFi have both tried to claim the Robinhood shares, which will be subject to future forfeiture proceedings. The shares belong to an entity that is 90% owned by Bankman-Fried and one of more than 100 companies tied up in Delaware bankruptcy court proceedings.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Even worse for Bankman-Fried, his top lieutenants at FTX have turned on him. FTX co-founder Gary Wang and former Alameda Research CEO Caroline Ellison have pleaded guilty to criminal charges and are cooperating with investigators, likely strengthening the Justice Department’s case against him.","“He’s now constricted to his parents’ Palo Alto home. He’s got a monitoring bracelet. His passport has been forfeited. He’s got no real prospects of employment.” said Richard Mico, the CEO and chief legal officer of the fintech platform Banxa. “He’s now at the mercy of receiving funds from his family and friends.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Many expect Bankman-Fried’s friends and family will chip in to cover his ballooning legal bills. His parents, Stanford Law School professors Joseph Bankman and Barbara Fried, already have put their California home on the line for his $250 million bond. Bankman did not respond to a request for comment. A pair of cosigners whose identities Bankman-Fried's lawyers successfully kept secret in court, at least so far, also helped.&nbsp;&nbsp;","Although his Robinhood shares were seized, Bankman-Fried could have a way to access them. His lawyers could ask the court to allow him to use the seized shares to fund his legal bills. Seized assets, or at least a portion of them, have been used to fund legal bills in some cases.","“It’s entirely up to the judge,” Sorkin said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried recently retained a separate legal team specifically for his effort to reclaim the Robinhood shares. He is represented by Edward Schnitzer, Gregory Donilon and David Banker of Montgomery McCracken Walker &amp; Rhoads. His criminal defense team includes Mark Cohen, who represented Ghislaine Maxwell during the child sex trafficking case she recently lost, and Christian Everdell,<span class=\"s2\" data-v-f87c67ca=\"\">&nbsp;<\/span>partners at the New York law firm Cohen &amp; Gresser.&nbsp;","The former FTX boss also has a spokesperson, Mark Botnick, who declined to comment on how Bankman-Fried is paying for his legal defense.","Aside from friends and family or the seized shares, funding could come from director and officer liability insurance if FTX purchased such protection before it imploded. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Most companies are going to have D&amp;O insurance for their officers,” said David Maria, general counsel for crypto exchange Bittrex. “It just depends what FTX was doing with their insurers. But that's routine. Executives are indicted, it’s not an uncommon thing.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried resigned as CEO of FTX when the firm filed for bankruptcy. An FTX lawyer did not respond to a request for comment about whether the company had insurance that Bankman-Fried might use for his legal defense, or whether he might still be covered by it.&nbsp;","Whatever happens in court, there's one certainty from extended legal battles: The high price tag for a criminal defense team, along with the bankruptcy and civil enforcement cases, would cost Bankman-Fried millions over the next several years.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“If you were to fully litigate against all of these entities, the SEC, the CFTC, your stake in bankruptcy and the criminal side, just keep writing checks,” Maria said.","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"90%","content":"PERCENT"},{"type":"Carrington","content":"LOCATION"},{"type":"Cohen &amp; Gresser","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$250 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Sloman &amp; Blumenthal","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Alex More","content":"PERSON"},{"type":"Palo Alto","content":"LOCATION"},{"type":"Mark Botnick","content":"PERSON"},{"type":"Maria","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Barbara Fried","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"$17.2 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Christian Everdell","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Ghislaine Maxwell","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"$450 million","content":"MONEY"},{"type":"Delaware","content":"LOCATION"},{"type":"David Banker of Montgomery McCracken Walker &amp; Rhoads","content":"ORGANIZATION"},{"type":"fintech platform Banxa","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"David Maria","content":"PERSON"},{"type":"Ira Sorkin","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Coleman","content":"PERSON"},{"type":"Sorkin","content":"PERSON"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"Gregory Donilon","content":"PERSON"},{"type":"Stanford Law School","content":"ORGANIZATION"},{"type":"Edward Schnitzer","content":"PERSON"},{"type":"Forbes","content":"PERSON"},{"type":"Richard Mico","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}