{"summary":"Who is Jessalyn Dean? Allie Grace Garnett: Who the heck are you? Tell me about Jessalyn Dean. Jessalyn Dean: I&#x27;m an accountant who doesn&#x27;t do accounting.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232570\/tax-information-reporting-for-crypto-enterprises-a-chat-with-ledgibles-jessalyn-dean","publishDate":"2023-06-05T09:00:20","id":10172,"type":null,"title":"Tax information reporting for crypto enterprises – a chat with Ledgible’s Jessalyn Dean","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">What transpires when Ledgible’s Head of Tax Information Reporting gets to riff on the current state of tax reporting for digital assets? A lot. But we keep it snappy—behold the recap of a recent conversation between Jessalyn Dean and yours truly, Allie Grace Garnett, Crypto Author for Ledgible.<\/span>","<b data-v-f87c67ca=\"\">Allie Grace Garnett:<\/b><span data-v-f87c67ca=\"\"> Who the heck are you? Tell me about Jessalyn Dean.<\/span>","<b data-v-f87c67ca=\"\">Jessalyn Dean:<\/b><span data-v-f87c67ca=\"\"> I'm an accountant who doesn't do accounting. I'm a tax expert who doesn't do taxes. I like to think of myself as a strategist, weaving my technical tax expertise with my compliance operations grit. I oversee <\/span><a href=\"https:\/\/ledgible.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ledgible<\/span><\/a><span data-v-f87c67ca=\"\">’s tax information reporting <\/span><a href=\"https:\/\/ledgible.io\/solutions\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">solutions<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<b data-v-f87c67ca=\"\">AGG:<\/b><span data-v-f87c67ca=\"\"> And why is that so exciting to you?<\/span>","<b data-v-f87c67ca=\"\">JD:<\/b><span data-v-f87c67ca=\"\"> I get to solve really important problems in blockchain- and crypto-related tax reporting, which has a direct effect on everyday average people. We all need to pay taxes on crypto and aren't really sure how to do it. Getting tax reports can make or break our user experience with crypto providers.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">AGG:<\/b><span data-v-f87c67ca=\"\"> Which crypto regulations are needed to clarify the requirements for tax reporting and compliance?<\/span>","<b data-v-f87c67ca=\"\">JD:<\/b><span data-v-f87c67ca=\"\"> A lot. But I will pick two. The first regulation that’s needed is for the tax treatment of staking rewards, which is luckily on the IRS priority guidance plan. That guidance needs to be nuanced, as operating your own staking node is different from delegated staking, which is further different than staking-as-a-service.<\/span>","<span data-v-f87c67ca=\"\">The second regulation that’s needed is for the tracking of the <\/span><a href=\"https:\/\/ledgible.io\/the-top-5-crypto-tax-mistakes-to-avoid\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cost basis<\/span><\/a><span data-v-f87c67ca=\"\"> of a crypto asset through time, as it moves on exchange, off exchange, into a self-hosted wallet and out of that wallet. Regulations must heavily consider operational challenges, otherwise taxpayers and the IRS will be worse off if cost basis gets “lost” in the chain.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">AGG: <\/b><span data-v-f87c67ca=\"\">Now let’s get creative—What is your dream use case for blockchain in regulation?<\/span>","<b data-v-f87c67ca=\"\">JD:<\/b><span data-v-f87c67ca=\"\"> Sovereign <\/span><a href=\"https:\/\/ledgible.io\/news\/ledgible-and-ledger-partner-to-provide-digital-asset-accounting-tools-to-enterprises\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">identity<\/span><\/a><span data-v-f87c67ca=\"\"> of taxpayers on the blockchain. Today, if you open an account at any financial institution, you have to fill out what we call a tax profile like an IRS Form W-9. In an ideal world, each of us taxpayers would have our own sovereign tax profile that we can share with institutions, rather than constantly repeating the process at every account opening. But this is a dream right now because regulation would first need to allow for that.<\/span>","<b data-v-f87c67ca=\"\">AGG:<\/b><span data-v-f87c67ca=\"\"> We’re discussing some of the requirements and limitations for consumers. How do you think that unclear crypto regulations create risk for enterprises?<\/span>","<b data-v-f87c67ca=\"\">JD:<\/b><span data-v-f87c67ca=\"\"> There's two risk categories—the first one is financial risk. The second is reputational risk.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Companies can face financial risk from unclear regulations that lead to under-reporting to customers, something that’s penalized in an IRS audit. That's clear. There are also less obvious financial risks from over-reporting, which may happen if a company is hedging in the other direction due to uncertainty.<\/span>","<span data-v-f87c67ca=\"\">Reputational risk happens when you end up in the news for over-reporting when no one else is doing it, because you shared data with the government unnecessarily. And on the other side, under-reporting when everyone else is doing it can still attract the attention of regulators—and may cause customers to leave your platform for one that gives them tax reports.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">AGG:<\/b><span data-v-f87c67ca=\"\"> Let's wrap it up by explaining—what is Ledgible is exactly?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JD:<\/b> <a href=\"https:\/\/www.accountingtoday.com\/news\/vendor-spotlight-presents-ledgible\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ledgible<\/span><\/a><span data-v-f87c67ca=\"\"> is a sub-ledger platform for crypto tax and accounting data.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">We heard from our clients that they need a blockchain solution to track cost basis data for their customers, in addition to tracking their own internal assets. Ledgible enables our clients to track customer-level cost basis data without sharing customers’ personal data with us—that data can be leveraged to generate or file tax reports such as the <\/span><a href=\"https:\/\/ledgible.io\/understanding-form-1099-da-why-its-necessary-and-how-its-used\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Form 1099<\/span><\/a><span data-v-f87c67ca=\"\"> with the IRS.<\/span>","<b data-v-f87c67ca=\"\">AGG:<\/b><span data-v-f87c67ca=\"\"> Awesome. Now let's really wrap it up by you saying something crazy—in the context of tax information reporting.<\/span>","<b data-v-f87c67ca=\"\">JD:<\/b><span data-v-f87c67ca=\"\"> Crypto tax aggregator software was built on the basis that there was no Form 1099 reporting. And so taxpayers needed to pay for software. Once customers are getting Forms 1099 from the exchanges, some may have less need for crypto tax aggregation software—including Ledgible.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Taxpayers who hold all of their crypto on exchanges will be better off by saving money on tax software. This is why Ledgible is focusing on solving today's digital asset taxation challenges, and also solving the tax information reporting needs of the future.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">This interview has been lightly edited for length and clarity.<\/span><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9","content":"DATE"},{"type":"Allie Grace Garnett","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ledgible’s Head of Tax Information Reporting","content":"ORGANIZATION"},{"type":"Crypto Author for Ledgible","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}