{"summary":"Paradigm co-founder Matt Huang is curious about artificial intelligence. He also said the venture capital firm has &quot;never been more dedicated to crypto.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236801\/paradigms-matt-huang-says-ai-cant-be-ignored-still-excited-about-crypto","publishDate":"2023-06-27T17:21:12","id":10185,"type":null,"title":"Paradigm&#x27;s Matt Huang says AI can&#x27;t be ignored, still excited about crypto","category":["COMPANIES"],"content":["Paradigm co-founder Matt Huang is curious about artificial intelligence. He also said the venture capital firm has \"never been more dedicated to crypto.\"","\"We’ve never been more excited about crypto and we continue to invest across all stages,\" he <a href=\"https:\/\/twitter.com\/matthuang\/status\/1673786399252955137\" data-v-f87c67ca=\"\">said<\/a> Tuesday on Twitter. \"We’re also a group of curious nerds and the developments in AI are too interesting to ignore.\"","His comments came just over a month after The Block <a href=\"https:\/\/www.theblock.co\/post\/232247\/crypto-vc-paradigm-ai\" data-v-f87c67ca=\"\">reported<\/a> that the company was moving beyond a pure blockchain focus to work on a broader array of \"frontier tech\" that included artificial intelligence. The move was subtlety visible on the firm's <a href=\"https:\/\/www.paradigm.xyz\/\" data-v-f87c67ca=\"\">website<\/a>, with the company calling itself a \"research-driven technology investment firm\" as opposed to one that specifically invested in “disruptive crypto\/Web3 companies and protocols.”","\"It seems trendy to frame crypto vs AI as a zero-sum competition. But we don’t buy it,\" he said Tuesday. \"Both are interesting and will have plenty of overlap. We’re excited to continue exploring.\"","Indeed, many participants in the crypto space are already augmenting products with AI, including the natural language processor ChatGPT. The Ethereum blockchain explorer <a href=\"https:\/\/www.theblock.co\/post\/235459\/etherscan-unveils-ai-fueled-code-reader-tool-to-analyze-smart-contract-code\" data-v-f87c67ca=\"\">Etherscan<\/a> rolled out an AI-based tool that scans smart contract codes to let users more deeply understand the code's functionalities.","The Solana Foundation, the team building the Solana blockchain, has also implemented an <a href=\"https:\/\/www.theblock.co\/post\/231905\/solana-blockchain-integrates-chatgpt-plugin-launches-ai-accelerator\" data-v-f87c67ca=\"\">AI chatbot<\/a> that allows users to better understand Solana's data, computing infrastructure, protocols and other technical aspects.","Outlier Venture founder and CEO Jamie Burke, meanwhile, said on <a href=\"https:\/\/www.theblock.co\/post\/233096\/web3-scaling-ai\" data-v-f87c67ca=\"\">The Scoop<\/a> this month that \"AI has always been integral to our vision for web3 since 2018.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana blockchain","content":"PERSON"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jamie Burke","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Matt Huang","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}