{"summary":"This article explores the largest crypto hacks of 2022 and went wrong leading up to each attack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196941\/the-biggest-crypto-hacks-of-2022","publishDate":"2022-12-29T07:00:08","id":10183,"type":null,"title":"The biggest crypto hacks of 2022","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">In 2022, cryptocurrency-based projects experienced a series of devastating hacks and exploits in what’s considered the worst year ever when it comes to securing digital assets.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Overall, the frequency of crypto hacks accelerated rapidly this year, topping at $3 billion in total funds lost, <\/span><a href=\"https:\/\/go.chainalysis.com\/2022-Crypto-Crime-Report.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to<\/span><\/a><span data-v-f87c67ca=\"\"> a <\/span><span data-v-f87c67ca=\"\">Chainalysis <\/span><span data-v-f87c67ca=\"\">report.<\/span>","<span data-v-f87c67ca=\"\">The year showed us how blackhat or malicious hackers are using increasingly advanced tactics to exploit weaknesses in decentralized apps that may have bugs, like every other piece of software. <\/span>","<span data-v-f87c67ca=\"\">Among the major crypto heists of 2022, security incidents involving <\/span><a href=\"https:\/\/www.theblockresearch.com\/understanding-cross-chain-bridges-148589\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cross-chain bridges<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;and decentralized finance protocols stood out for suffering damages to the tune of hundreds of millions of dollars in individual exploits. During such exploits, hackers accessed and stole crypto assets without authorization by taking advantage of vulnerabilities in smart contracts. <\/span>","<span data-v-f87c67ca=\"\">This exclusive article from The Block explores the largest crypto hacks of 2022 and went wrong leading up to each attack.<\/span>","<span data-v-f87c67ca=\"\">On Mar. 29, Ronin, a sidechain that hosts Sky Mavis’ Axie Infinity game was <\/span><a href=\"https:\/\/www.theblock.co\/post\/140165\/ronin-replaces-compromised-validators-and-plans-to-bolster-security-after-600-million-hack\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">exploited for<\/span><\/a><span data-v-f87c67ca=\"\"> $625 million in various crypto assets, making it the largest crypto heist to date. <\/span><span data-v-f87c67ca=\"\">Sky Mavis developed Ronin to host its popular blockchain game Axie Infinity. But things took a turn for the worst when the team failed to secure the Ronin network from perpetrators, later <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/techcrunch.com\/2022\/04\/15\/us-officials-link-north-korean-lazarus-hackers-to-625m-axie-infinity-crypto-theft\/\" data-v-f87c67ca=\"\">identified<\/a> to be North Korea's Lazarus hacking group.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Through an <\/span><a href=\"https:\/\/www.theblock.co\/post\/156038\/how-a-fake-job-offer-took-down-the-worlds-most-popular-crypto-game\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">email-based phishing attack<\/span><\/a><span data-v-f87c67ca=\"\"> on a former employee, the hacking group gained access to Sky Mavis’ IT infrastructure. There, the hackers located and stole private keys to Ronin blockchain validator nodes, which the firm stored on its internal servers. When the hackers had access to validator keys, they took control over the entire Ronin network and transferred more than 173,600 ether (ETH) and 25.5 million USDC stablecoin, totaling over $625 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Fortunately for users who had their funds taken during this incident, most were fully reimbursed, the firm claimed. A week after the hack, SkyMavis <\/span><a href=\"https:\/\/www.theblock.co\/post\/140800\/sky-mavis-raises-150-million-from-binance-to-reimburse-ronin-hack-victims\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised<\/span><\/a><span data-v-f87c67ca=\"\"> $150 million in a funding round led by Binance and combined this with its own assets to <\/span><span data-v-f87c67ca=\"\">pay back everyone who was affected by the exploit.<\/span>","<span data-v-f87c67ca=\"\">Unlike other major security heists during the year — such as those affecting decentralized blockchain apps operating on smart contracts — the now-collapsed centralized exchange FTX fell for one of the largest hacks of 2022. <\/span><span data-v-f87c67ca=\"\">Taking place in November, the FTX hack came to light after the exchange’s official Telegram admins<\/span> <a href=\"https:\/\/www.theblock.co\/post\/186289\/ftx-claims-it-has-been-hacked-of-all-of-its-funds-website-and-mobile-app-compromised\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a> <span data-v-f87c67ca=\"\">“unauthorized access.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Onchain data showed that the exchange's <\/span><span data-v-f87c67ca=\"\">wallets lost funds anywhere between $370 million to <\/span><a href=\"https:\/\/www.theblock.co\/post\/186279\/over-400m-worth-of-tokens-ftx-funds-drained-from-company-accounts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$400 million<\/span><\/a><span data-v-f87c67ca=\"\"> shortly after its <\/span><span data-v-f87c67ca=\"\">former CEO Sam Bankman-Fried filed for Chapter 11 bankruptcy protection.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A few m<\/span><span data-v-f87c67ca=\"\">edia outlets <\/span><a href=\"https:\/\/www.marketwatch.com\/story\/supposed-477-million-ftx-hack-was-actually-a-bahamian-government-asset-seizure-11668782216\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">conflated<\/span><\/a><span data-v-f87c67ca=\"\"> the hack wit<\/span><span data-v-f87c67ca=\"\">h another suspicious transfer of $400 million made from FTX on the order of the Securities Commission of the Bahamas for safekeeping the assets, which caused confusion. However, the two were separate incidents.<\/span>","<span data-v-f87c67ca=\"\">The new FTX chief John J. Ray III <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=J1JPc9Fjf9k\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">testified<\/span><\/a><span data-v-f87c67ca=\"\"> the hack and another large asset transfer ordered by the Bahamian regulators were separate. This is verified by analytics firm Chainalysis, which is working with FTX to track down the assets.<\/span>","<span data-v-f87c67ca=\"\">“The $400 million stolen and hacked from FTX is completely separate from the $400 million held by the Securities Commission of the Bahamas. It's totally understandable that people were confused by this, though,” a spokesperson from Chainalysis told The Block.<\/span>","<span data-v-f87c67ca=\"\">While the identity of the hacker remains unknown, Bankman-Fried <a href=\"https:\/\/finance.yahoo.com\/finance\/news\/sam-bankman-fried-says-ftx-203431501.html\" data-v-f87c67ca=\"\">spoke<\/a> in an interview of an insider, likely a “ former employee” or bad actor, who may have stolen private keys to FTX's crypto wallets.<\/span>","<span data-v-f87c67ca=\"\">Ray also <\/span><a href=\"https:\/\/www.theblock.co\/post\/194706\/ftx-stored-private-keys-without-encryption-the-exchanges-new-chief-said\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">revealed<\/span><\/a><span data-v-f87c67ca=\"\"> in a prepared testimony <\/span><a href=\"https:\/\/financialservices.house.gov\/uploadedfiles\/hhrg-117-ba00-wstate-rayj-20221213.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">document<\/span><\/a> <span data-v-f87c67ca=\"\">that FTX stored private keys to its wallets in an unencrypted manner, and had adopted very poor security controls — factors that could have easily allowed the hack to have taken place.<\/span>","<span data-v-f87c67ca=\"\">In February, Wormhole, a cross-chain bridge protocol, was hacked in this year’s biggest bridge exploit. Wormhole allows users to lock their ETH and receive a pegged asset called Wormhole ETH (wETH) on the Solana network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Feb. 2, Wormhole fell to a hacker who spoofed certain security signatures on the bridge and minted 120,000 wETH worth <\/span><a href=\"https:\/\/www.theblock.co\/post\/132909\/wormhole-replenishes-its-blockchain-bridge-after-325-million-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$325 million<\/span><\/a><span data-v-f87c67ca=\"\"> out of thin air. The hacker swapped the illicitly minted wETH for actual ETH on the Ethereum network, thereby draining all of the assets held on Wormhole.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The incident halted the bridge operations and for some time it appeared the end for Wormhole was near. It would have been incredibly challenging to recover the losses but to everyone's surprise, a few days after the hack, Wormhole said it <\/span><a href=\"https:\/\/www.theblock.co\/post\/132909\/wormhole-replenishes-its-blockchain-bridge-after-325-million-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">replaced<\/span><\/a><span data-v-f87c67ca=\"\"> all of the stolen ETH and opened the bridge.<\/span>","<span data-v-f87c67ca=\"\">Jump Crypto, a trading and venture capital firm that incubated Wormhole, confirmed that it replenished the stolen 120,000 ETH from its own funds to help sustain the bridge.<\/span>","<span data-v-f87c67ca=\"\">On Aug. 7, Nomad — a bridge connecting Ethereum, Avalanche, Moonbeam and Evmos blockchains — suffered the second largest cross-chain bridge hack of the year with <\/span><a href=\"https:\/\/www.theblock.co\/post\/160851\/nomads-190-million-bridge-exploit-drew-hacking-feeding-frenzy-of-300-addresses\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$190 million<\/span><\/a><span data-v-f87c67ca=\"\"> worth of assets lost. The hack resulted from a faulty update in which Nomad developers erroneously designated <\/span><a href=\"https:\/\/etherscan.io\/address\/0x0000000000000000000000000000000000000000\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">0x00<\/span><\/a><span data-v-f87c67ca=\"\"> (the zero address) as the trusted root.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This function meant that anyone could withdraw funds from the bridge without going through the trust contract check and could easily bypass its security. As the update <\/span><span data-v-f87c67ca=\"\">issue became public, over <\/span><a href=\"https:\/\/www.theblock.co\/post\/160851\/nomads-190-million-bridge-exploit-drew-hacking-feeding-frenzy-of-300-addresses\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">300 addresses<\/span><\/a> <span data-v-f87c67ca=\"\">rushed in to grab money from Nomad in a free-for-all exploit.&nbsp;<\/span><span data-v-f87c67ca=\"\">Luckily, some of the addresses belonged to ethical hackers who later <a href=\"https:\/\/www.theblock.co\/post\/161715\/nomad-has-recovered-22-4-million-after-hackers-drained-190-million?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">returned<\/a> $22 million back to Nomad.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Beanstalk Farms, a stablecoin protocol, was <\/span><a href=\"https:\/\/www.theblock.co\/linked\/142272\/ethereum-based-stablecoin-protocol-beanstalk-loses-more-than-80-million-to-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">attacked<\/span><\/a><span data-v-f87c67ca=\"\"> in April of 2022 in the year’s largest governance hack.<\/span>","<span data-v-f87c67ca=\"\">An unknown hacker took advantage of a security loophole in Beanstalk's decentralized autonomous organization (DAO), which oversees the decision-making for the stablecoin project. <\/span><span data-v-f87c67ca=\"\">On Beanstalk, anyone could submit a proposal and get it passed in a day if it received the majority votes from holders of Beanstalk’s native governance called bean.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A malicious actor submitted a proposal asking the community to send crypto assets from Beanstalk treasury to the hacker’s crypto address. When the vote passed, the transfer was automatically made.<\/span>","<span data-v-f87c67ca=\"\">The attacker took a <a href=\"https:\/\/www.theblockcrypto.com\/news+\/108081\/flash-loans-a-blessing-or-a-curse\" data-v-f87c67ca=\"\">flash loan<\/a>, a loan that can be taken without any collateral, if it’s returned within the same transaction. With this, the hacker <\/span><a href=\"https:\/\/etherscan.io\/tx\/0xcd314668aaa9bbfebaf1a0bd2b6553d01dd58899c508d4729fa7311dc5d33ad7\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">purchased<\/span><\/a><span data-v-f87c67ca=\"\"> millions of dollars in bean tokens to ensure they had enough tokens to get the vote approved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With this trick, the hacker was able to funnel some $80 million in bean tokens from the project’s treasury unbeknownst to Beanstalk core developers. <\/span><span data-v-f87c67ca=\"\">After this, the hacker <\/span><span data-v-f87c67ca=\"\">sold off those bean tokens on the platform, the final loss ended up being significantly higher for Beanstalk. Security firm PeckShield <\/span><a href=\"https:\/\/twitter.com\/peckshield\/status\/1515713013868814336\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">estimated<\/span><\/a><span data-v-f87c67ca=\"\"> the incident cost Beanstalk $182 million in protocol losses.<\/span>","Though not technically a hack, Solana-based lending platform suffered a massive market manipulation exploit in October.","The attacker — later alleged to be a DeFi trader Avraham Eisenberg — led a team to attack Mango Markets to funnel <a href=\"https:\/\/www.theblock.co\/post\/177736\/mango-markets-proposes-plan-to-pay-back-victims-after-114-million-hack\" data-v-f87c67ca=\"\">$114 million<\/a> in customer deposits from the platform. He later admitted his involvement.","The attack was twofold. First, Eisenberg allegedly bought tens of millions of illiquid Mango tokens — which he deposited into the protocol as lending collateral.","Second, with about $5 million in the USDC stablecoin, he allegedly drove up the price of Mango tokens several times — thereby artificially growing the dollar value of his lending collateral deposits on Mango. He was able to do this because Mango tokens have very thin liquidity across many exchanges.","The increased market value of Mango tokens spoofed data oracles into thinking the assets deposited by Eisenberg were worth more than $400 million.","With the pumped-up collateral value, he borrowed $114 million in crypto assets with the intention of not paying it back — netting himself a giant profit. A day later, he forced Mango's governance to <a href=\"https:\/\/www.theblock.co\/post\/177736\/mango-markets-proposes-plan-to-pay-back-victims-after-114-million-hack\" data-v-f87c67ca=\"\">pass a vote<\/a>, agreeing to return $47 million as a white hat negotiation deal. By this time, the identity of the attacker was unknown.","On-chain sleuths traced the attack to Eisenberg. He <a href=\"https:\/\/www.theblock.co\/post\/177424\/mango-markets-exploiter-comes-clean-claims-all-actions-were-legal\" data-v-f87c67ca=\"\">admitted<\/a> his involvement but he refuted doing anything illegal, arguing he was \"using the protocol as designed.\" Clearly the authorities didn't buy the “code is law” argument made by Eisenberg.&nbsp;","In December, Eisenberg was <a href=\"https:\/\/www.theblock.co\/post\/198172\/mango-markets-exploiter-arrested-in-puerto-rico-for-alleged-market-manipulation\" data-v-f87c67ca=\"\">taken into custody<\/a> and charged with crimes related to market manipulation by the United States Department of Justice. The DoJ arrested him on charges of commodities fraud and commodities manipulation in Puerto Rico.","<span data-v-f87c67ca=\"\">On Oct. 6, an unknown entity carried out a large-scale <a href=\"https:\/\/www.theblock.co\/post\/175437\/biance-bnb-chain-is-back-up-after-bridge-exploit\" data-v-f87c67ca=\"\">attack<\/a> on BNB Token Hub, a bridge service that runs between BNB Chain — a blockchain founded by crypto exchange Binance — and Ethereum.<\/span>","<span data-v-f87c67ca=\"\">Exploiting a bug in the bridge’s cryptographic proof system, a hacker was able to take control over 2 million BNB tokens locked on the bridge and valued at $550 million at the time.<\/span>","<span data-v-f87c67ca=\"\">The hacker only managed to transfer anywhere between $120 million-$130 million worth off BNB Chain to <\/span><span data-v-f87c67ca=\"\">other chains before the network was halted. <\/span><span data-v-f87c67ca=\"\">As soon as the attack was detected, BNB Chain validators agreed to freeze the network to take over $430 million held in the hacker's address. The network was down for several hours but was back up and running a day later.<\/span>","<span data-v-f87c67ca=\"\">Another protocol that fell victim to a massive hack was Horizon, a bridge that connects Ethereum to the Harmony blockchain. In June, an attacker <\/span><a href=\"https:\/\/www.theblock.co\/post\/154029\/harmonys-100-million-hacker-took-control-of-its-multi-signature-wallet-analysts-say\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stole $100 million<\/span><\/a><span data-v-f87c67ca=\"\"> locked on Horizon after compromising a couple of private keys owned by security admin accounts that controlled the bridge.<\/span>","<span data-v-f87c67ca=\"\">The process of transferring assets from Horizon’s deployer contract to Ethereum involved a multi-signature scheme that needed approval from only two of the five admin accounts. This meant a malicious actor had to steal two private keys to approve unauthorized transfers, which is precisely what happened, as <\/span><a href=\"https:\/\/halborn.com\/explained-the-harmony-horizon-bridge-hack\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\"> by security firm Halborn.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After gaining access to two of the bridge’s admin private keys, possibly via phishing attacks on the admins. Then the hacker was able to approve a transaction that extracted $100 million into their control.<\/span>","<span data-v-f87c67ca=\"\">Qubit, a BNB Chain lending and bridge protocol, was the target of the first large scale crypto hack of the year in January. <\/span><span data-v-f87c67ca=\"\">On Qubit, users could deposit ether (ETH) from Ethereum and the bridge issued a pegged asset “xETH” on BNC Chain. xETH could be used as collateral on Qubit’s lending platform.<\/span>","<span data-v-f87c67ca=\"\">On Jan. 27, a hacker <\/span><a href=\"https:\/\/cryptobriefing.com\/binance-smart-chain-protocol-qubit-finance-hacked-for-80m\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">exploited<\/span><\/a><span data-v-f87c67ca=\"\"> a software logic vulnerability in Qubit which made xETH available for use on BNB Chain without having deposited ETH on Ethereum. The nature of the vulnerability was such that it allowed the attacker to mint a large amount of xETH without depositing any real assets.<\/span>","<span data-v-f87c67ca=\"\">After the hacker was able to mint lots of xETH, they took several loans from Qubit with those tokens as collateral. In the end, the attacker drained all of the 206,000 BNB staked on Qubit Finance by taking loans in a loop, worth about $80 million at the time.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/largest-defi-exploits\/embed\" title=\"Largest DeFi exploits\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"$190 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"North Korea","content":"LOCATION"},{"type":"Halborn","content":"PERSON"},{"type":"$130 million","content":"MONEY"},{"type":"$325 million","content":"MONEY"},{"type":"Wormhole","content":"PERSON"},{"type":"$22 million","content":"MONEY"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"$370 million","content":"MONEY"},{"type":"$430 million","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"$182 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Nomad","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Ronin","content":"LOCATION"},{"type":"$120 million","content":"MONEY"},{"type":"Ethereum","content":"PERSON"},{"type":"BNB Token Hub","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Qubit Finance","content":"ORGANIZATION"},{"type":"$47 million","content":"MONEY"},{"type":"Mavis","content":"PERSON"},{"type":"Nomad","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Oct. 6","content":"DATE"},{"type":"$114 million","content":"MONEY"},{"type":"Aug. 7","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Beanstalk","content":"LOCATION"},{"type":"Wormhole","content":"LOCATION"},{"type":"April of 2022","content":"DATE"},{"type":"Jan. 27","content":"DATE"},{"type":"Moonbeam","content":"PERSON"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"Securities Commission","content":"ORGANIZATION"},{"type":"United States Department of Justice","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Feb. 2","content":"DATE"},{"type":"$625 million","content":"MONEY"},{"type":"$80 million","content":"MONEY"},{"type":"$550 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Mar. 29","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Eisenberg","content":"PERSON"},{"type":"Mavis’","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"DoJ","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$150 million","content":"MONEY"}],"hashtag":["HACKS"],"authors":["Vishal Chawla","The Block"]}