{"summary":"Open Finance startup Compound is officially moving to decentralize the nature of its governance by going live with a token-based model on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62126\/defi-compound-decentralized-governance-token-coinbase-live","publishDate":"2020-04-16T12:00:10","id":10184,"type":null,"title":"DeFi platform Compound launches decentralized governance token with support from Coinbase Custody","category":["DEFI"],"content":["Open Finance money market protocol, Compound, is officially moving to decentralize the nature of its governance by going live with a token-based model on Thursday.","That token-based approach was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/57044\/defi-compound-governance-token-decentralization-lending-protocol\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">first unveiled in late February<\/a>, as The Block previously reported, following <a href=\"https:\/\/www.theblockcrypto.com\/post\/47158\/a16z-paradigm-back-compounds-25m-series-a-to-integrate-with-crypto-exchanges-and-brokers\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a $25 million Series A funding round<\/a> last November. According to <a href=\"http:\/\/loanscan.io\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Loanscan<\/a>, which tracks lending activity across the Open Finance ecosystem, Compound is the second most prominent DeFi lending protocol, with over $24 million in outstanding debt.","As CEO Robert Leshner said in February, the decentralization process will be a gradual one, with the ability to weigh in on governance being spread among stakeholders over time.","Leshner told The Block in an interview on Wednesday that \"tomorrow is when we're going to switch from having a centralized administrator that runs the protocol to having decentralized community governance as a protocol, run by the COMP token owners.\"","\"Tomorrow's the actual day that it's mainnet-live, when we actually switch over to decentralization. That's quite a large day for us,\" he added. The system <a href=\"https:\/\/twitter.com\/compoundfinance\/status\/1250815524251951105\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">is now live<\/a>, according to the Compound team.","In a practical sense, this move constitutes \"a single contract call that switches the admin from being an address controlled by our team to being the COMP token holder contract,\" according to Leshner.","Thursday's launch also includes a notable level of support coming from Coinbase Custody. The digital asset custodian is launching support for the COMP token as well as several other Compound-tied tokens.&nbsp;","Coinbase Custody wrote in <a href=\"https:\/\/blog.coinbase.com\/coinbase-custody-rolls-out-support-for-compound-governance-2e8984721e61\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a blog post<\/a> shared with The Block:","\"Coinbase Custody will offer a fully integrated solution in our existing web app, allowing our clients to view and vote on Compound Governance Proposals, as well as delegate governance rights to third parties. In addition to supporting COMP and Compound Governance, starting today, we are excited to announce that clients can also deposit and withdraw their Compound balances (cETH, cZRX, cUSDC, cBAT, cDAI).\"","\"Governance will take many forms, all enabled by the COMP token (Note that Coinbase does not yet support COMP on its trading platforms),\" the company further explained. \"Coinbase Custody clients will have the option of manual voting, where they can vote directly on proposals, or delegate voting, where they can delegate their votes to a third party.\"","Coinbase is an investor of Compound's by way of <a href=\"https:\/\/techcrunch.com\/2018\/05\/16\/cryptocurrency-compound-interest\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">its venture arm<\/a>.&nbsp;","And as Leshner put it, the reasoning behind having a secure custody component is to help protect the process of governance: \"It decreases the risk of losing governance tokens.\"","From the beginning, Compound has said that its shift to decentralization would be conducted over a period of time that will see it cede control in stages.","Thursday begins the “sandbox” period <a href=\"https:\/\/medium.com\/compound-finance\/compound-governance-5531f524cf68\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">first outlined in February<\/a>, during which time \"a portion of the governance tokens will be distributed amongst our company's shareholders, who can delegate voting weight to themselves or the public as they see fit.\"","A portion of the governance tokens is being allocated to the Compound team on a four-year vesting basis, according to Leshner. What's more, the plan is to begin distributing such tokens to users of the protocol in the coming months, though details of that process aren't yet being made public.","\"[The governance process is] not going to have the sort of wild unpredictability of full decentralization because the participants early on are going to be people with the strongest alignment of incentives to see Compound succeed. And the Compound token won't be listed on exchanges and it won't be in the hands of the public yet,\" Leshner told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compound","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Compound Governance Proposals","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Loanscan","content":"LOCATION"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Compound Governance","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"$24 million","content":"MONEY"},{"type":"Robert Leshner","content":"PERSON"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}