{"summary":"While the settlement ends her case with the government, it may complicate a class action lawsuit that seeks damages from Kardashian, fellow celebrity endorsers, and executives of the company that created the project, EthereumMax.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175426\/kim-kardashians-sec-settlement-could-complicate-her-other-crypto-case","publishDate":"2022-10-07T08:00:26","id":10181,"type":null,"title":"Kim Kardashian’s SEC settlement could complicate her other crypto case","category":["LEGAL"],"content":["<strong data-v-f87c67ca=\"\">&nbsp;<\/strong>Kim Kardashian <a href=\"https:\/\/www.theblock.co\/post\/174416\/sec-charges-kim-kardashian-for-unlawfully-promoting-ethereummax\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"0\" data-v-f87c67ca=\"\">made headlines this week<\/a> when the Securities and Exchange Commission publicized a fine and settlement with her for allegedly failing to disclose earnings related to her promotion of the EMAX token.","While the settlement ends her case with the government, it may complicate a class action lawsuit that seeks damages from Kardashian, fellow celebrity endorsers, and executives of the company that created the project, EthereumMax.","In January of this year, Ryan Huegrich <a href=\"https:\/\/www.theblock.co\/linked\/129948\/class-action-against-ethereummax-names-kim-kardashian-floyd-mayweather-jr-as-defendants\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"1\" data-v-f87c67ca=\"\">brought a suit<\/a> on behalf of all investors who purchased EMAX tokens between May 14 and June 17 of 2021, claiming executives and promoters made false or misleading statements through social media and other promotions. Among those promoters are boxer Floyd Mayweather Jr., former NBA player Paul Pierce and Kardashian, all of whom have filed motions to dismiss the case against them.","The complaint accuses EthereumMax executives of using celebrities to \"dupe potential investors into trusting the financial opportunities available with EMAX Tokens.\" Huegrich claims executives pumped the price of the token with these celebrity endorsements to sell their own holdings at a profit.","In her $1.26 million settlement with the SEC, Kardashian neither accepted nor denied wrongdoing, a standard arrangement for civil settlements. That means the charges can’t be used as clear evidence of wrongdoing in the class action case.","Still, it could undercut attempts to dismiss the case from Kardashian and her co-defendants according to Curtis Miner, a litigation attorney at the firm Colson Hicks Eidson who defended musician and record producer DJ Khaled in a class action lawsuit over an initial coin offering for CentraTech. &nbsp;","“It gives instant credibility,” said Curtis Miner, an attorney at Colson Hicks Eidson, who defended DJ Khaled in a similar class action. “If a government agency has brought a suit against her and she settled it, it gives instant credibility to the plaintiff’s claims.”","Other attorneys agreed, though they declined to go on-record regarding the case.","The Federal Trade Commission, which makes rules around truth and transparency in advertising, published <a href=\"https:\/\/www.ftc.gov\/system\/files\/documents\/plain-language\/1001a-influencer-guide-508_1.pdf\" data-v-f87c67ca=\"\">guidance<\/a> in 2019 for social media influencers to label their postings if they’re paid for them. Though the SEC has its own rules, they largely parallel the FTC’s in terms of advertising and endorsements. The securities regulator posted <a href=\"https:\/\/twitter.com\/GaryGensler\/status\/1576897535427448832?s=20&amp;t=1p_MrlmtYTIo2-4h51D89g\" data-v-f87c67ca=\"\">a video<\/a> featuring Chair Gary Gensler and an actor playing an influencer, down to the ‘making it rain’ motion on-camera, to highlight its position earlier this week. &nbsp;","Reza Izad,<strong data-v-f87c67ca=\"\">&nbsp;<\/strong>co-founder and partner of Underscore Talent, an L.A. firm that represents a bevy of top YouTube and TikTok influencers with large followings, said he and his firm advise their clients to closely follow those guidelines. “","“The guidelines clearly state that the content creator must disclose if they are being paid by a brand including crypto,” he told The Block.","Social media posts need to reflect whether there’s a material connection – like payment – between the person making an online endorsement and what they’re posting about. That distinction has to be considered clear to an average person, which can come down to granular details like whether the disclosure is above or below the ‘More’ button on Instagram. Celebrity endorsements on TV ads, like those that cropped up around this year’s Super Bowl, are widely understood to be for pay, but videos on YouTube or TikTok may need accompanying text on-screen to avoid potential legal trouble.","Kardashian’s legal defense team in the class action has pointed to her use of “#ad” in one of the posts in question, indicating a promotional nature for the posts, for which she received $250,000. Pierce, the former NBA all-star, tweeted about the coin a handful of times, telling followers “I’m n for the long haul” while Mayweather fought an exhibition match against YouTuber turned boxer Logan Paul that sold tickets for EMAX. In court Pierce’s defense claims his tweets were too vague to be considered misleading, while Mayweather contends that his role in the boxing match doesn’t constitute promotion of the token, and he didn’t individually make any statements related to the token.","This isn’t Mayweather’s first bout with a class action related to an alleged token scam, and that history could inform how the class action unfolds.&nbsp;","Khaled and Mayweather both similarly <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2018-268\" data-v-f87c67ca=\"\">settled with the SEC<\/a> over CentraTech, a landmark case as the first enforcement action against touters of an ICO. But a judge dismissed the class action lawsuit from CentraTech investors, which sought damages from the record producer and boxer, among others, because investors were ultimately unable to prove that Mayweather and DJ Khaled’s promotion directly led to their investment and subsequent harm.","The settlement might complicate ongoing attempts to quash the EMAX case, but as Miner, a veteran of the CentraTech case put it, it isn’t “an automatic win card” for those seeking damages from the celebrities in the case either. &nbsp;","Still, plaintiffs in the case are likely to attempt to amend their case to include the recent Kardashian settlement.","<em data-v-f87c67ca=\"\">With additional reporting from Colin Wilhelm and RT Watson.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Paul Pierce","content":"PERSON"},{"type":"L.A.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Miner","content":"ORGANIZATION"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"EMAX Tokens","content":"ORGANIZATION"},{"type":"TikTok","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"EthereumMax","content":"ORGANIZATION"},{"type":"Federal Trade Commission","content":"ORGANIZATION"},{"type":"Ryan Huegrich","content":"PERSON"},{"type":"Kardashian","content":"PERSON"},{"type":"$1.26 million","content":"MONEY"},{"type":"Colson Hicks Eidson","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"May 14","content":"DATE"},{"type":"Mayweather","content":"PERSON"},{"type":"Pierce","content":"PERSON"},{"type":"NBA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Logan Paul","content":"LOCATION"},{"type":"Curtis Miner","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Floyd Mayweather Jr.","content":"PERSON"},{"type":"FTC","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"June 17 of 2021","content":"DATE"},{"type":"RT Watson","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Aislinn Keely","The Block"]}