{"summary":"Tether has released an assurance report delivered by accounting firm Moore Cayman that shows that its stablecoins were fully backed as of last month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99806\/tether-assurance-report-stablecoins-usdt-fully-backed","publishDate":"2021-03-30T08:00:05","id":10186,"type":null,"title":"Tether releases an assurance report that shows its stablecoins were fully backed as of February","category":["TETHER"],"content":["Tether has released an assurance report delivered by accounting firm Moore Cayman that shows that its stablecoins were fully backed as of last month.","<a href=\"https:\/\/tether.to\/wp-content\/uploads\/2021\/03\/tether-assurance-feb-2021.pdf\" data-v-f87c67ca=\"\">The report<\/a>, shared with The Block by Tether on Tuesday, is dated February 28 and has an assurance opinion by Moore Cayman that Tether's consolidated assets exceeded its consolidated liabilities as of the date.","Specifically, Tether's consolidated total assets amounted to nearly $35.3 billion as of February 28, and its consolidated total liabilities amounted to $35.2 billion, of which $35.1 billion were related to stablecoins issued. That means Tether's reserves exceeded the amount required to redeem the stablecoins issued, per the report.","To be sure, the report doesn't describe how Tether's reserves are held, a concern which Tether critics have raised in the past. Tether rival Centre's monthly attestation reports, for instance, mention that U.S. dollars are held in custody accounts for its USDC stablecoin.","When reached for comments, Tether's general counsel Stuart Hoegner told The Block: \"All Tether tokens are fully backed by Tether's reserves, as this opinion demonstrates.\"","Hoegner further told The Block that Tether holds its reserves in cash and cash equivalents and that the firm has been \"clear about that for years.\" USDC, for instance, also <a href=\"https:\/\/support.usdc.circle.com\/hc\/en-us\/articles\/360001233386-Circle-USDC-User-Agreement\" data-v-f87c67ca=\"\">holds its reserves<\/a> in cash and cash equivalents.&nbsp;","Moore Cayman, part of London-headquartered accounting firm Moore Global, has prepared the assurance report based on a consolidated reserves report (CRR) that Tether provided to them.","\"We believe that the evidence we have obtained is sufficient and appropriate to provide a reasonable basis for our assurance opinion,\" said Moore Cayman. \"Tether Holdings Limited's management is responsible for its assertions in its CRR that relate to Tether Holding Limited's consolidated assets to back its consolidated liabilities issued.\"","The procedure appears to be similar to what other stablecoin issuers follow.","Hoegner told The Block that Moore Caymen has followed established and recognized procedures for the assurance engagement. \"This includes independent examination of, among other things, extensive bank and fund statements, blockchain data, gold counts, contracts, and financial and other working papers obtained from third parties,\" said Hoegner.","Tether's USDT stablecoin is the largest in the world, with over $42 billion in total circulating supply, and it is the first time the firm has produced an attestation since 2018. In January 2018, Tether <a href=\"https:\/\/www.theblockcrypto.com\/linked\/1759\/is-a-tether-bank-run-underway\" data-v-f87c67ca=\"\">dissolved<\/a> its relationship with audit firm Friedman LLP. In July of that year, Tether released a report by law firm Freeh, Sporkin &amp; Sullivan LLP attesting to USD reserves held on just a single day.","Tether has \"always been fully backed,\" Hoegner told The Block.","<iframe title=\"Total Stablecoin Supply\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","The assurance report comes a month after Tether and its sister company Bitfinex <a href=\"https:\/\/www.theblockcrypto.com\/post\/95207\/bitfinex-tether-new-york-ag-settlement-lawsuit\" data-v-f87c67ca=\"\">settled with the New York Attorney General's (NYAG's) Office<\/a> over a multi-year investigation centered on claims that Tether's USDT stablecoin was not fully backed. The two companies paid the NYAG's Office $18.5 million in a penalty to settle the inquiry and admitted no wrongdoing.","As part of the settlement, Tether <a href=\"https:\/\/www.theblockcrypto.com\/post\/95207\/bitfinex-tether-new-york-ag-settlement-lawsuit\" data-v-f87c67ca=\"\">will provide<\/a> quarterly reports on Tether's reserves to the Office and the public for the next two years. Tether plans to issue another attestation report for March after the month ends and quarterly attestations after that.&nbsp;","<em data-v-f87c67ca=\"\">Update: This story and its headline have been updated for clarity.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Moore Caymen","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Centre","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Moore Cayman","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"$18.5 million","content":"MONEY"},{"type":"Freeh, Sporkin &amp; Sullivan LLP","content":"ORGANIZATION"},{"type":"Tether","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$35.3 billion","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"$35.1 billion","content":"MONEY"},{"type":"$35.2 billion","content":"MONEY"},{"type":"Moore Global","content":"ORGANIZATION"},{"type":"Friedman LLP","content":"ORGANIZATION"},{"type":"February 28","content":"DATE"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"$42 billion","content":"MONEY"},{"type":"Stuart Hoegner","content":"PERSON"},{"type":"Tether Holdings Limited","content":"ORGANIZATION"},{"type":"January 2018","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Hoegner","content":"PERSON"}],"hashtag":["TETHER"],"authors":["Yogita Khatri","The Block"]}