{"summary":"Algorand’s Algo was the worst-performing token on Binance during July with a monthly return of -61.8%\nAt launch, the company was hailed as one of the most promising blockchain projects, with a Turing award winner as its founder\nThe steep price drop is possibly because its valuation is higher than what the retail market can absorb, several sources told The Block","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35227\/algorands-token-price-tanked-61-8-as-turing-award-union-square-ventures-backing-fail-to-justify-valuation","publishDate":"2019-08-08T18:05:20","id":1019,"type":null,"title":"Algorand&#x27;s token price plummeted 62% in July despite Turing Award winning founder and Union Square Ventures backing","category":["Cryptocurrency"],"content":["Count this as yet another disillusioning token sale, but this time even a Turing Award winning founder, the backing of famed VC Union Square Ventures, and strong pre-sale momentum wasn't enough to sustain the offering price.","<span data-v-f87c67ca=\"\">Algorand, the project that concluded its first public token sale in June with much fanfare and a handsome amount of $60 million raised, was the worst performer of July on Binance, having <a href=\"https:\/\/info.binance.com\/en\/research\/selections\/Binance-Research-Global-Markets-July-2019-Overview.pdf\" data-v-f87c67ca=\"\">the a negative monthly return of -61.8%<\/a>. The significant price decline occurred despite Algorand's great pedigree. The project was founded by MIT professor and Turing Award winner Silvio Micali and backed by well known venture capital firms like Union Square Ventures.<\/span>","<span data-v-f87c67ca=\"\">As staggering as the drop is, however, it's hardly a surprise to some traders and investors that The Block spoke with. Some experts predict that the price has more room to fall. The main reason cited is the rapidly increasing circulating supply as well as the early investors that opted to participate as validators who are still seeing returns of more than 800%.<br data-v-f87c67ca=\"\">\n<\/span>","","","<span data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/messari.io\/asset\/algorand#profile\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Messari<\/a><\/span>","<b data-v-f87c67ca=\"\">Too many tokens<\/b>","<span data-v-f87c67ca=\"\">The project’s long term plan is to have a maximum circulating supply of <a href=\"https:\/\/info.binance.com\/en\/research\/ALGO-2019-06-21.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">10 billion Algo<\/a>. 3 billion of that supply will be released in public auctions over the next five years, with a yearly cap of 600 million tokens sold. Although this figure for circulating Algo sounds enormous, there is a catch - public investors can receive a 90% refund by returning Algo after a year long lock-up period. <\/span>","<span data-v-f87c67ca=\"\">This means that for investors who purchase at auction, the downside of buying Algo is somewhat protected. In the worst case, they can always return the majority of their purchased Algo after a year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">That's when <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84174\/algorand-team-funding-blockchain-connectivity\" data-v-f87c67ca=\"\">Algorand<\/a> started to create a lot of buzz, especially among Asian investors,” said cryptocurrency market maker Altonomy co-founder Ricky Li.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This intense buzz led to a skyrocketing valuation for Algo tokens. As it closed its first public sale at $2.40 per token, investors were reportedly valuing the company at <\/span><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/algorand-raises-over-60m-in-token-sale-at-an-implied-valuation-of-24b\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a fully diluted market cap of $24 billion<\/span><\/a><span data-v-f87c67ca=\"\">: $2.40 per token multiplied by the 10 billion total token supply.<\/span>","<span data-v-f87c67ca=\"\">Algorand itself disputed the $24 billion valuation figure, according to a person familiar with the matter. Although it does not yet seem like the company <\/span><span data-v-f87c67ca=\"\">has made any public clarification.<\/span>","<span data-v-f87c67ca=\"\">“This is simply just too many tokens for this specific project,” said Li. “It’s basically betting on it reaching Ethereum-level hype, at least close to that, to be able to justify this amount of volume in retail interest.” For comparison, Ethereum <\/span><a href=\"https:\/\/ethereumprice.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">is valued at $23.8 billion<\/span><\/a><span data-v-f87c67ca=\"\"> at the time of writing with a multi-year head start and significant activity on top of the blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a result, the high valuation and the large number of tokens were too much for the retail market to absorb, even given the intense market interest in this protocol and strong pedigree, several market observers told The Block.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Early investors creating selling pressure?<\/b>","<span data-v-f87c67ca=\"\">When Algorand conducted its first auction, the company defined “Circulating Supply” as “the quantity of Algo available to transact freely,” and its total amount was 10 billion. However, some investors, who spoke with The Block under the condition of anonymity, raised doubts at this definition, questioning whether there are tokens from undisclosed sales that will eventually enter the market as well.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Algorand did not conduct a private token sale; rather the project completed two rounds of equity fundraising for a total of $66 million. However, e<\/span>arly investors that opted to participate as an 'early node runner' to validate transaction receive tokens for l<span data-v-f87c67ca=\"\">ess than $0.09<\/span> (rumored to be as low as $0.05) with vesting over 2 years. <span data-v-f87c67ca=\"\">Li, whose company specializes in trading crypto including Algo, said he has seen a steady flow of Algo coming across the trading desk every week recently, with nearly all traders looking to sell. The <a href=\"https:\/\/algorand.foundation\/wallet-addresses\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">balance of these rewards is around 2.5 billion<\/a> with more than 3.4 million Algo unlocked daily (~$2.67 million at current prices). Considering that some early investors received these tokens for less than $0.09, they are still seeing returns of more than 800% if they decide to sell immediately. This is likely creating the selling pressure that Li is referencing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition, a letter allegedly sent from the Algorand Foundation to “early backers who participated in the original Algorand Foundation auction” <\/span><a href=\"https:\/\/www.theblockbeats.com\/news\/2650\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was also disclosed recently<\/span><\/a><span data-v-f87c67ca=\"\">, warning these \"early backers\" to not participate in an <\/span><a href=\"https:\/\/algorand.foundation\/early-redemption\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">early redemption program<\/span><\/a><span data-v-f87c67ca=\"\"> that the foundation recently launched to reduce the circulating supply of Algo.<\/span>","","","<span data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/www.theblockbeats.com\/news\/2650\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">BlockBeats<\/a>&nbsp;<\/span>","When a premium project such as Alogrand faces a steep price decline, Li pointed out that it is also harmful to the general altcoin market. \"Overall in the altcoin space, volatility and liquidity have been dropping,” said Li.&nbsp;","<span data-v-f87c67ca=\"\">Algorand did not respond to The Block’s request for comment before publication. <\/span>"],"hashtag":["BINANCE"]}