{"summary":"The Floki Inu cryptocurrency team has ceased Floki&#x27;s staking programs in Hong Kong after the local regulator marked them as “suspicious.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275037\/memecoin-floki-blocks-hong-kong-users-from-staking-programs","publishDate":"2024-01-30T04:11:57","id":10204,"type":null,"title":"Memecoin Floki blocks Hong Kong users from staking programs amid regulatory warnings","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The Floki Inu cryptocurrency team has ceased Floki and TokenFi staking programs in Hong Kong after the local regulator listed them as “suspicious investment products,” according to its statement.<\/span>","<span data-v-f87c67ca=\"\">In a blog <\/span><a href=\"https:\/\/floki.medium.com\/statement-responding-to-hk-sfc-warning-da148338cea0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> published today, Floki said it has taken measures to block users from Hong Kong from accessing the staking programs, and it has placed warnings on its website to notify Hong Kong users of their ineligibility to join the programs. Floki added that it halted its offline marketing campaign in the city before the scheduled launch in December 2023.<\/span>","<span data-v-f87c67ca=\"\">Floki’s comment comes in response to the Securities and Futures Commission’s warning released on Friday. The SFC <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/news-and-announcements\/news\/doc?refNo=24PR12\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">warned<\/span><\/a><span data-v-f87c67ca=\"\"> the public of Floki Staking Program and TokenFi Staking Program — both of which claim to offer annual returns of 30% to over 100%, according to the notice.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The two products have not been authorized by the SFC for offering to the Hong Kong public,” the SFC added.<\/span>","<span data-v-f87c67ca=\"\">In response to the regulator’s concerns, the Floki team appears to stand by its high-yield staking programs. “If, as it appears, a decision to single out the staking programs was made solely because of the high APY of our staking programs stated in social media posts and as moved by market forces, as explained above, then we will have to respectfully disagree.”<\/span>","<span data-v-f87c67ca=\"\">The Floki team noted that the programs in question could yield high returns mainly because they were not funded by venture capital firms or large presales, which would require allocating substantial portions of the supply to sponsors. Instead, most of the token supply was given to users who staked Floki.<\/span>","<span data-v-f87c67ca=\"\">Floki also explained that the volatility in user rewards occurs as they are subject to the market price of TOKEN, the utility token of Floki’s sister project TokenFi. The price depends on market forces outside their control, the team said, adding that Floki’s staking program rewards stakers with TOKEN instead of minting new supplies.<\/span>","<span data-v-f87c67ca=\"\">“We do not believe there is any confusion amongst users as to how the staking program works,” the team continued, saying that it has no control over the staked assets, staking contracts or the rewards.<\/span>","<span data-v-f87c67ca=\"\">The Floki team did not provide further comments at The Block’s request.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Floki Inu cryptocurrency","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"December 2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Floki","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","STAKING","STAKING FIRMS"],"authors":["Danny Park","The Block"]}