{"summary":"It&#x27;s PayPal earnings day, and the firm has released new details about its cryptocurrency plans.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93668\/paypal-crypto-business-unit-earnings-2021","publishDate":"2021-02-03T17:23:36","id":10200,"type":null,"title":"PayPal is investing in a new business unit focused on crypto and digital currencies","category":["THE BLOCK"],"content":["It's PayPal earnings day, and the firm has released new details about its cryptocurrency plans.","These plans include a new dedicated business unit for PayPal's crypto ambitions, according to CEO Daniel Schulman, who spoke during PayPal's earnings call on Wednesday.","As he remarked:","\"We all know the current financial system is antiquated, and we can envision a future where transactions are completed in seconds, not days; a future where transactions should be less expensive to complete; and a future that enables all people to be part of the digital economy, not just the affluent. We are significantly investing in our new crypto, blockchain, and digital currencies business unit in order to help shape this more inclusive future.\"","A source with knowledge of the plans described the business unit plan as PayPal \"going all in\" on such services.","Schulman also said that PayPal is \"excited to build upon this early success by allowing customers to use their crypto balance as a funding source whenever they shop at our 29 million merchants.\"","\"We anticipate the rollout of that capability to begin late this quarter, and we hope to launch our first international market in the next several months,\" he went on to explain. A Venmo integration with crypto is expected \"in the coming months.\"","Schulman described such steps as \"just the beginning of an extensive roadmap around crypto, blockchain, and digital currencies.\"","Among other factoids: per Schulman, \"everyone who signed up for crypto is opening up their app two times as much as they previously did.\"","PayPal made its <a href=\"https:\/\/www.theblockcrypto.com\/post\/81794\/paypal-to-enable-crypto-purchases-with-the-help-of-paxos\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">crypto services<\/a> official last October with the launch of a partnership with industry startup Paxos, as reported at the time. The services officially went live in the days following that announcement, opening it up to eligible U.S.-based users on November 12.&nbsp;","The payments giant struck a bullish tone at the time, with Schulman noting at the time: \"This is just the beginning of the opportunities we see as we work hand-in-hand with regulators to accept new forms of digital currencies.\" He also suggested that PayPal might one day integrate central bank digital currencies should those gather steam in the future.&nbsp;","<em data-v-f87c67ca=\"\">Ryan Todd, Frank Chaparro and Aislinn Keely contributed reporting.<\/em>","<em data-v-f87c67ca=\"\">This story is developing and will be updated as more information becomes available.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ryan Todd","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Schulman","content":"PERSON"},{"type":"this quarter","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Daniel Schulman","content":"PERSON"},{"type":"November 12","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Aislinn Keely","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Michael McSweeney","The Block"]}