{"summary":"US and UK officials discussed stablecoins and central bank digital currencies at a recent meeting of a financial partnership.\nThe countries will hold another meeting this month when a financial regulatory working group huddles in July.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155463\/uk-us-eye-central-bank-digital-currencies-and-stablecoins-in-london-meeting","publishDate":"2022-07-01T11:45:27","id":1021,"type":null,"title":"UK, US eye central bank digital currencies and stablecoins in London meeting","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">The United Kingdom and the United States huddled in London this week to discuss crypto and digital asset regulation, ahead of a financial working group meeting between the two nations later this month.<\/span>","<span data-v-f87c67ca=\"\">The US-UK Financial Innovation Partnership held its third meeting on Wednesday, where participants discussed “crypto-asset regulation and market developments,\" <\/span><a href=\"https:\/\/www.gov.uk\/government\/publications\/joint-statement-on-the-us-uk-financial-innovation-partnership-meeting-29th-june-2022\/joint-statement-on-the-us-uk-financial-innovation-partnership-meeting-29th-june-2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to a release<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The partnership meeting also addressed stablecoins and central bank digital currencies. The group was created in 2019 to foster engagement between the U.S. and the U.K. on “financial innovation issues.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The US-UK Financial Regulatory Working Group is set to meet later in July.<\/span>","<span data-v-f87c67ca=\"\">Participants in Wednesday’s meeting included staff from the Bank of England and the Financial Conduct Authority. <\/span>","<span data-v-f87c67ca=\"\">On the US side, participants included staff from major agencies like the Board of Governors of the Federal Reserve System, the Commodity Futures Trading Commission and the Securities and Exchange Commission, among others.&nbsp;<\/span>"],"hashtag":["CBDCS","CFTC"]}