{"summary":"Details of how Sam Bankman-Fried tried to unlock funds frozen on Asian crypto exchanges Huobi and FTX emerged today in court.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256063\/sbf-tried-thai-sex-worker-wallets-to-unlock-frozen-funds-before-bribing-official-witness-claims","publishDate":"2023-10-11T22:22:24","id":1021,"type":null,"title":"SBF tried Thai sex worker wallets to unlock frozen funds before bribing Chinese official, witness claims","category":["COMPANIES"],"content":["Details of how Sam Bankman-Fried, the former CEO of FTX who is currently on trial for seven charges of fraud, tried to unlock funds frozen on Asian crypto exchanges Huobi and OKX emerged today in court.","Caroline Ellison, the former head of FTX-linked trading firm Alameda Research, who was simultaneously in an on-again-off-again romantic relationship with her boss, Bankman-Fried, gave testimony on the episode today.","Alameda’s accounts on Huobi and OKX — containing around $1 billion — were frozen in 2021 as part of a Chinese government money laundering probe focused on an Alameda counterparty, Ellison said. At that time, Bankman-Fried was Alameda’s CEO.","To try to unfreeze them, Alameda first tried to hire a lawyer in China to negotiate with the government, but that proved futile. The firm then turned to what Ellison described as various trading strategies.","Asked to give an example, Ellison said, “On OKX we made several accounts using the IDs of different people who I believe were Thai prostitutes, and we tried to basically have our main account lose money and have those other accounts make money, so do very imbalanced trades between the two accounts so those other accounts would be able to make money and withdraw it.”","Another Alameda employee had mooted the idea of bribing a Chinese official to unlock the accounts. Bankman-Fried was initially against the idea, but eventually he warmed to it.","Asked how the accounts were eventually unfrozen, Ellison said, “My impression was that they were unfrozen by Alameda paying a bribe to Chinese government officials.”","Bankman-Fried faces seven charges of fraud in this trial, but even if he’s found innocent, he must then face a second trial — with five additional counts — <a href=\"https:\/\/www.reuters.com\/legal\/what-charges-does-sam-bankman-fried-face-over-ftxs-collapse-2023-10-03\/#:~:text=Bankman%2DFried%20once%20faced%20as,trial%20scheduled%20for%20March%202024.\" data-v-f87c67ca=\"\">currently scheduled for March<\/a>. Those charges include bank fraud and foreign bribery conspiracy charges. Prosecutors claim the alleged bribe paid to a Chinese official constitutes a violation of the Foreign Corrupt Practices Act. Bankman-Fried has pleaded not guilty.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Alameda counterparty","content":"ORGANIZATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["FTX","SBF TRIAL"],"authors":["Ryan Weeks","The Block"]}