{"summary":"Nuclear power plants in Ukraine may start mining bitcoin and other cryptocurrencies if a government proposal goes through.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64189\/ukraines-nuclear-power-plants-may-start-mining-cryptocurrencies","publishDate":"2020-05-06T08:00:33","id":10210,"type":null,"title":"Ukraine&#x27;s nuclear power plants may start mining cryptocurrencies","category":["CRYPTOCURRENCY"],"content":["Nuclear power plants in Ukraine may start mining bitcoin and other cryptocurrencies if a government proposal goes through.","Ukraine's acting energy minister Olha Buslavets has sent a letter to Energoatom, the country’s state-owned operator of nuclear power plants, to consider using excess electricity for mining cryptocurrencies.","“To work out, together with Energoatom and the Energoatom Trading division, the regulatory and technical issues of the possible implementation of cryptocurrency mining projects in order to provide additional markets for the electricity generated by nuclear power plants,” the <a href=\"https:\/\/www.facebook.com\/photo.php?fbid=2908955042474939&amp;set=a.263540757016394&amp;type=3&amp;theater\" data-v-f87c67ca=\"\">letter<\/a> reads, which was published by Geo Leros, a Member of Parliament (Servant of the People Party faction), on his Facebook account.","Energoatom has until May 8 to explore potential ways to mine cryptocurrencies, per the letter.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">‘Fundamentally new economy’<\/strong><\/span>","In a separate post on its Facebook account, Ukraine's energy ministry today <a href=\"https:\/\/www.facebook.com\/minecoenergy\/posts\/3014648588591397\" data-v-f87c67ca=\"\">said<\/a> nuclear power plants in the country have had excess electricity due to the effects of the coronavirus lockdown.&nbsp;","The ministry went on to say that President Volodymyr Zelensky’s vision is to digitize Ukraine and applying innovative solutions to avoid wasting electricity is the best way forward.","“One of the modern approaches for using excess electricity is to devote it to cryptocurrency mining. That would not only allow to maintain the guaranteed load on the nuclear power plants, but also ensure that companies can attract extra funds. Therefore, it would open the way to a fundamentally new economy, new approaches, a new market model,” said the ministry.","Ukraine has been optimistic about the crypto mining sector. Earlier this year, the country's Ministry of Digital Transformation <a href=\"https:\/\/www.coindesk.com\/ukraine-wont-regulate-crypto-mining-government-ministry-says\" data-v-f87c67ca=\"\">said<\/a> it won't regulate the industry because it is already self-governed by blockchain consensus rules.","“We remain loyal to mining activities that form part of open decentralized networks. Mining does not require regulatory activity from governmental oversight bodies or other third-party regulations, this activity is regulated by the protocol itself and network members,\" the digital transformation ministry said at the time.","It remains to be seen whether Energoatom goes ahead with Buslavets’s proposal. The Block has reached out to the company for more details and will update this story should we hear back.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Geo Leros","content":"PERSON"},{"type":"Energoatom Trading","content":"ORGANIZATION"},{"type":"Energoatom","content":"PERSON"},{"type":"Volodymyr Zelensky","content":"PERSON"},{"type":"Parliament (Servant of the People Party","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"May 8","content":"DATE"},{"type":"Ministry of Digital Transformation","content":"ORGANIZATION"},{"type":"Olha Buslavets","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["MINING"],"authors":["Yogita Khatri","The Block"]}