{"summary":"Ethereum-based Layer 2 scaling protocols Optimism and Arbitrum have seen a significant divergence in transaction activity, with Optimism outperforming Arbitrum since mid-December.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203122\/ethereum-layer-2-protocol-optimism-surpasses-arbitrum-in-transaction-volume","publishDate":"2023-01-17T18:59:20","id":10217,"type":null,"title":"Ethereum Layer 2 protocol Optimism surpasses Arbitrum in transaction volume","category":["LAYER 2S AND SCALING"],"content":["Ethereum-based Layer 2 scaling protocols Optimism and Arbitrum have seen a sharp divergence in transaction activity over the past month, with Optimism outpacing Arbitrum since December.","Both protocols had been on a steady upward trend since the beginning of 2022, but this is the first time Optimism has significantly outperformed Arbitrum, <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\" data-v-f87c67ca=\"\">according to The Block data.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The increased transactions on Optimism have occurred as its token has been one of the top performers across Layer 1 and Layer 2 protocols. Arbitrum doesn’t have its own token, and market participants may be looking for new ways to gain exposure to Ethereum as liquid staking derivatives such as Lido and Rocket Pool have also been preforming well.","Other tokens in the Optimism ecosystem, such as Velo and Sonne, have seen gains of over 200% since the beginning of the year.","The Optimism transaction gains have also occurred as the decentralized perpetual futures exchange GMX, which is built on Arbitrum, saw a 30% drop in use since Dec. 10. Synthetix, a separate perpetual exchange built on Optimism, saw an increase in volume starting around Dec. 20.","Protocols such as Kwenta that are built using Synthetix on Optimism also had notable increases in volume, <a href=\"https:\/\/dune.com\/synthquest\/synthetix-perps-v2\" data-v-f87c67ca=\"\">according to Dune Analytics.&nbsp;<\/a>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 10","content":"DATE"},{"type":"Dec. 20","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"Sonne","content":"PERSON"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Kwenta","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Arbitrum","content":"PERSON"},{"type":"200%","content":"PERCENT"},{"type":"30%","content":"PERCENT"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}