{"summary":"Next month&#x27;s Dencun upgrade has caused ether&#x27;s price to increase, argues Grayscale in a new research report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278886\/ethereum-price-increase-driven-by-anticipation-of-dencun-upgrade-grayscale","publishDate":"2024-02-23T13:06:36","id":10219,"type":null,"title":"Ethereum price increase driven by anticipation of Dencun upgrade: Grayscale","category":["MARKETS"],"content":["While many market watchers might be attributing Ethereum's recent price increase to optimism stemming from the possible approval of a spot ether ETF, asset manager Grayscale Investments has suggested that the cryptocurrency rose in value because of Ethereum's upcoming Dencun upgrade, which will increase the throughput and reduce the cost of some transactions on the network.","\"We believe that recent price performance reflects the market’s anticipation of this upgrade,\" Grayscale Research Analyst <span data-v-f87c67ca=\"\">William Ogden Moore <\/span>wrote in a <a href=\"https:\/\/www.grayscale.com\/research\/reports\/ethereums-coming-of-age-dencun-and-eth-2.0\" data-v-f87c67ca=\"\">new report<\/a> published on Friday. \"Ethereum’s Dencun upgrade, scheduled for March 13th, 2024, represents a major step forward and could help Ethereum compete in terms of scalability with faster chains in the Smart Contract Platforms Crypto Sector, such as Solana.\"","In the new report, Grayscale's analyst laid out a fairly bullish case for Ethereum, the second most popular cryptocurrency by market cap. The price of ether is currently up about 25% since the beginning of the year, according to The Block's <a href=\"https:\/\/www.theblock.co\/price\/248349\/ethereum-eth-usd\" data-v-f87c67ca=\"\">Price Page<\/a>. However, the report notes, in 2023 the price of ether underperformed compared to its sector and especially compared to competitors like Solana, which saw over 900% growth last year.&nbsp;","&nbsp;","<span data-v-f87c67ca=\"\">Ethereum price YTD. Image: The Block Price Page.<\/span>","Taking a bullish stance on Ethereum will not likely come as a surprise as Grayscale is currently attempting to have its Ethereum trust converted into a spot ether ETF. Some believe that the Securities and Exchange commission is <a href=\"https:\/\/www.theblock.co\/post\/278508\/coinbase-urges-sec-to-approve-listing-of-grayscales-proposed-spot-ether-etf\" data-v-f87c67ca=\"\">likely to approve<\/a> the new financial instrument by May, especially given the agency approved spot bitcoin ETFs, which began trading last month.","Ranked by assets under management, Grayscale has the largest spot bitcoin ETF on the market.","Besides the upcoming Dencun upgrade, and the potential for spot ether ETFs gaining approval, the Grayscale report pinpointed \"net deflationary supply\" and \"network revenue generation\" as other reasons for optimism.&nbsp;","Grayscale also said that Ethereum can become more competitive it stands to capture more smart contract business. \"If Ethereum can simply become more competitive in throughput and cost, it could position itself to capture smart contract applications that demand high levels of security and censorship-resistance like stablecoins or tokenized financial assets,\" wrote Moore.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Moore","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Smart Contract Platforms Crypto Sector","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"900%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"Grayscale Research","content":"ORGANIZATION"},{"type":"William Ogden Moore","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"March 13th, 2024","content":"DATE"},{"type":"Securities and Exchange","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["RT Watson","The Block"]}