{"summary":"Curio, the premier NFT platform for the biggest names in entertainment, announced today the release of officially licensed NFTs (non-fungible tokens) from Heavy Metal Magazine.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116435\/heavy-metal-releases-first-collection-of-magazine-covers-as-nfts-on-curio","publishDate":"2021-09-02T08:16:37","id":10215,"type":null,"title":"Heavy Metal Releases First Collection of Magazine Covers as NFTs on Curio","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">LOS ANGELES – August 30, 2021 --<\/b> <a href=\"https:\/\/hubs.la\/H0W3G1z0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Curio<\/span><\/a><span data-v-f87c67ca=\"\">, the premier NFT platform for the biggest names in entertainment, announced today the release of officially licensed NFTs (non-fungible tokens) from Heavy Metal Magazine. Dropping September 2nd, the <\/span><a href=\"https:\/\/hubs.ly\/H0W3H6R0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">collection<\/span><\/a><span data-v-f87c67ca=\"\"> will consist of 3,600 NFTs representing elements of four Heavy Metal Magazine covers that will be released in blind packs costing 0.02 ETH. The latest drop marks the first time the magazine is releasing its covers as NFTs and is the second partnership with Curio following the launch of its successful <\/span><a href=\"https:\/\/hubs.la\/H0W3J3h0\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Women of Heavy Metal<\/span><\/i><span data-v-f87c67ca=\"\"> NFT collection<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The latest collection marks a series of firsts for Curio and its customer base. The <\/span><a href=\"https:\/\/hubs.ly\/H0W3H6R0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Heavy Metal: Covers - Series I<\/span><\/a><span data-v-f87c67ca=\"\"> collection will be the first time that Curio releases NFTs that can be fused together to unlock a new, more valuable Legendary bonus NFT. Each NFT purchased in a blind pack represents one of three elements of a complete cover. Starting September 24th, a collector who has all three elements of the same cover can fuse them together to unlock the full cover. Four different covers are available in this collection.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">“After our groundbreaking first collection with Heavy Metal Magazine we’re excited to partner again on this brand new release that gives Curio collectors and fans of the magazine new ways to interact with their favorite content,” said Ben Arnon, CRO, Curio. “The Curio team grew up reading the magazine and seeing the demand for its NFTs has proven we’re a perfect match.”<\/span>","<span data-v-f87c67ca=\"\">“Heavy Metal prides itself on pushing boundaries in the entertainment space and our first foray into the NFT marketplace proved our readers are interested in taking this journey with us,” said Heavy Metal CEO Matthew Medney. “Collaborating with the like-minded talent at Curio that is passionate about connecting fans through new platforms has paid off in dividends. We’re excited to see what we can do with our new collection and explore new ways to engage with fans and continue to adapt to the new ways that our customers and beyond are interacting with media.”<\/span>","<span data-v-f87c67ca=\"\">Collectors who purchased NFTs from the first Heavy Metal collection can redeem their <\/span><a href=\"https:\/\/hubs.la\/H0Wq91c0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Heavy Metal Rewards Points<\/span><\/a><span data-v-f87c67ca=\"\"> for raffle tickets to win up to 25 NFTs. Plus, collectors holding Curio’s Genesis Card will get early access to this drop and five NFTs will be randomly distributed.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/hubs.ly\/H0W3H6R0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Heavy Metal: Covers - Series I collection<\/span><\/a><span data-v-f87c67ca=\"\"> will launch officially on Sept. 2, 2021 at 10 AM PDT on <\/span><a href=\"https:\/\/hubs.la\/H0W3G1z0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">www.oncurio.com<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">-----------------<\/span>","<b data-v-f87c67ca=\"\">ABOUT CURIO<\/b>","<span data-v-f87c67ca=\"\">Curio delivers a new universe to serve fans through digital collectibles, driven by state-of-the-art non-fungible token (NFT) technology. Working with the biggest names in the entertainment industry, Curio brings innovative, cutting-edge engagement opportunities to delight fans and provide new ways to enhance their relationship with brands. To learn more, please visit:<\/span><a href=\"https:\/\/hubs.la\/H0W3G1z0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> https:\/\/oncurio.com\/<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp; &nbsp; &nbsp; <\/span>","<b data-v-f87c67ca=\"\">ABOUT<\/b> <b data-v-f87c67ca=\"\">HEAVY METAL ENTERTAINMENT<\/b>","<span data-v-f87c67ca=\"\">First published in 1977, <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Heavy Metal Magazine<\/span><\/i><span data-v-f87c67ca=\"\">, the world's foremost illustrated fantasy magazine, explores fantastic and surrealistic worlds, alternate realities, science fiction and thrillers, in the past, present, and future. Writers and illustrators from around the world take you to places you never dreamed existed. <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Heavy Metal Magazine<\/span><\/i><span data-v-f87c67ca=\"\"> was the first magazine to bring European legends like Moebius, Enki Bilal, and Pepe Moreno to the U.S. while showcasing American superstars like Richard Corben, Jim Steranko and Bernie Wrightson. The magazine continues to showcase amazing new talent and established creators. Now published monthly, <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Heavy Metal Magazine <\/span><\/i><span data-v-f87c67ca=\"\">features serialized and standalone stories, artist galleries, and interviews. Heavy Metal Entertainment is home not only to its iconic magazine, but also an incredible slate of comics and prose novels, a podcast network, and television and film projects. With CEO Matthew Medney now at the helm, Heavy Metal promises to boldly go where no one has gone before. Explore ancient secrets, forgotten worlds and savage futures...experience Heavy Metal. Join us at <\/span><a href=\"http:\/\/www.heavymetal.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">www.heavymetal.com<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">&nbsp;<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 24th","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Heavy Metal","content":"ORGANIZATION"},{"type":"Enki Bilal","content":"PERSON"},{"type":"Pepe Moreno","content":"PERSON"},{"type":"Jim Steranko","content":"PERSON"},{"type":"1977","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Heavy Metal<\/span><\/i><span data-v-f87c67ca=\"\"> NFT","content":"ORGANIZATION"},{"type":"Sept. 2, 2021","content":"DATE"},{"type":"Bernie Wrightson","content":"PERSON"},{"type":"Heavy Metal Magazine","content":"ORGANIZATION"},{"type":"Richard Corben","content":"PERSON"},{"type":"Heavy Metal Rewards Points","content":"ORGANIZATION"},{"type":"September 2nd","content":"DATE"},{"type":"Ben Arnon","content":"PERSON"},{"type":"August 30, 2021","content":"DATE"},{"type":"Matthew Medney","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}