{"summary":"Members of Congress are taking another crack at creating a new stablecoin legal framework in the U.S. The new draft bill is part of a multiyear effort to create a comprehensive legal framework around stablecoins like USDC and Tether.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226575\/new-stablecoins-bill-draft-introduced-house-of-representatives","publishDate":"2023-04-15T14:58:02","id":10228,"type":null,"title":"New stablecoin bill draft introduced in US House of Representatives","category":["COMPANIES"],"content":["Members of the U.S. House of Representatives are taking another crack at creating a comprehensive regulatory framework for stablecoins, like USDC and Tether, digital assets intended for payments whose price is supposed to remain the same at all times.&nbsp;","The House Financial Services Committee released a new <a href=\"https:\/\/docs.house.gov\/meetings\/BA\/BA21\/20230419\/115753\/BILLS-118pih-Toproviderequirementsforpaymentstablecoinissuersresearchonadigitaldollarandforotherpurposes.pdf\" data-v-f87c67ca=\"\">discussion draft bill<\/a> with no official notice on Saturday, in apparent anticipation of a <a href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=408691\" data-v-f87c67ca=\"\">hearing<\/a> on the topic on Wednesday by the committee's new panel focused on digital assets and financial technology.&nbsp;","The draft may not be the final version of the bill as debate and talks will continue in Washington over coming weeks and months. Negotiations picked back up after&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/176803\/senior-house-republican-biden-administration-holding-up-stablecoin-bill\" data-v-f87c67ca=\"\">stalling<\/a> shortly before midterm elections — and the FTX collapse — last year due to differences between congressional Republicans, Democrats and the Biden administration. There was <a href=\"https:\/\/www.theblock.co\/post\/225152\/gensler-sec-crypto-stablecoin-congress\" data-v-f87c67ca=\"\">additional finger-pointing<\/a> at the Securities and Exchange Commission, which provided technical advice on the topic and recently began investigating <a href=\"https:\/\/www.theblock.co\/post\/210919\/sec-to-sue-paxos-for-listing-binance-usd-stablecoin-wsj\" data-v-f87c67ca=\"\">stablecoins as securities offerings<\/a>.&nbsp;","Here are highlights of what the draft bill would do if it becomes law:&nbsp;","The U.S. central bank would approve and regulate non-bank companies like Circle and Tether that currently issue or want to issue their own stablecoins in the U.S. Credit unions and banks that want to issue their own stablecoins could do so with approval from the main financial regulator they fall under, the National Credit Union Administration, Federal Deposit Insurance Corp. or Office of the Comptroller of the Currency. Failure to register would be punishable by up to five years in prison and a $1 million fine. Any issuer that wants to do business in the U.S., regardless of where the company is based, would need to register.&nbsp;","The new draft bill includes a two-year ban on stablecoins that aren't backed by a hard asset, and it directs the Treasury Department to lead a study on the topic of such \"endogenously backed\" stablecoins. Tokens already in existence before the bill passes into law would be grandfathered in.","Banking regulators and the National Institute of Standards and Technology would have the ability to set standards for interoperability between stablecoins to allow for ease of use, including mandatory technical and legal specifications to allow users to clear and settle across different payment systems without buying native stablecoins for each.&nbsp;","If the bill becomes law, Congress and the president would direct the Federal Reserve to study the effects of a digital dollar issued by the central bank. The Fed has already begun studying whether to issue a digital dollar, but the bill would mandate certain areas of focus, like the potential impacts on monetary policy, financial stability and privacy for individuals. Fed leaders have expressed <a href=\"https:\/\/www.theblock.co\/post\/173111\/the-fed-has-not-decided-to-proceed-with-a-digital-dollar-says-powell\" data-v-f87c67ca=\"\">mixed<\/a> <a href=\"https:\/\/www.theblock.co\/post\/177299\/fed-governor-says-the-u-s-doesnt-need-a-digital-dollar\" data-v-f87c67ca=\"\">views<\/a> on a digital dollar, with the long-awaited <a href=\"https:\/\/www.federalreserve.gov\/paymentsystems\/fednow_faq.htm\" data-v-f87c67ca=\"\">FedNow real-time payments system<\/a> due to launch in July and provide similar faster payments to a digital currency, but using more traditional financial infrastructure than a central bank digital currency.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"National Credit Union Administration","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.S. House of Representatives","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"National Institute of Standards and Technology","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BUSD","CBDCS","CONGRESS","FDIC","FEDERAL RESERVE","HOUSE FINANCIAL SERVICES COMMITTEE","OCC","SEC","TETHER","TREASURY DEPARTMENT","USDC"],"authors":["Colin Wilhelm","The Block"]}