{"summary":"Venture capital firm, Fundamental Labs launched its Fundamental Labs Fund V – the fifth in its  series of funds that kicked off in 2016. It was constituted within one month with a medium size of  $50M. Fundamental Labs’ investment philosophy is anchored around being a long-term, strategic,  value investor. Short-term speculation is not its approach so remains phase agnostic.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131739\/fundamental-labs-empowering-web-3-0-mass-adoption-and-looking-beyond-2022","publishDate":"2022-02-04T09:00:39","id":10225,"type":null,"title":"Fundamental Labs: Empowering Web 3.0 mass adoption and looking beyond 2022","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Venture capital firm<\/span><span data-v-f87c67ca=\"\">,<a href=\"https:\/\/www.cth.group\/what_we_do\/fundamental_labs\/\" data-v-f87c67ca=\"\"> Fundamental Labs<\/a><\/span> <span data-v-f87c67ca=\"\">launched its Fundamental Labs Fund V – the fifth in its&nbsp; series of funds that kicked off in 2016. It was constituted within one month with a medium size of&nbsp; $50M. Fundamental Labs’ investment philosophy is anchored around being a long-term, strategic,&nbsp; value investor. Short-term speculation is not its approach so remains phase agnostic.&nbsp;&nbsp;<\/span>","<a href=\"https:\/\/fundamental-labs.medium.com\/empowering-web-3-0-mass-adoption-and-looking-beyond-2022-2da9d5908122\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Looking ahead into 2022<\/span><\/a><span data-v-f87c67ca=\"\">, it plans to launch another new fund with a decent sized $200M AUM to&nbsp; encompass more of the exciting Web3.0 application and infrastructure project it sees as prime&nbsp; investable sectors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With 2021 being a landmark year for the global digital asset market and Web 3.0 ecosystem, the&nbsp; Fundamental Labs team has seen an incredible combination of talent and capital flow into this&nbsp; space. While all-time highs (ATHs) were printed across crypto markets there were several trends&nbsp; that commanded even more attention.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Digital assets emerged as one of the hottest alternative investments in recent times. <\/span><b data-v-f87c67ca=\"\">Coinbase<\/b><span data-v-f87c67ca=\"\">,&nbsp; the largest US cryptocurrency exchange and one of Fundamental Labs’ portfolio companies, made its public market debut on the Nasdaq in April. It was a breakthrough moment for digital&nbsp; assets investors, adding to a sense that the asset class has become “mainstream”.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The emergence of NFTs, the Metaverse, and GameFi set off a massive wave of innovation (and&nbsp; investment) in the underlying decentralized technology stack and “Web 3.0” rose from being an&nbsp; ambiguous buzz word to become an inevitable trend that promises to substantially change to our&nbsp; work and daily lives.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With more investment comes more innovation, and with more innovation the entire ecosystem&nbsp; will only grow, exponentially, as we move headlong into the future. This change is exciting and&nbsp; rich with opportunities, and Fundamental Labs will be continuing its mission to help&nbsp; entrepreneurs accelerate their fundamental innovation and mass adoption and will be riding&nbsp; some key themes in 2022:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Web 3.0 is the next phase of the evolution of the internet. It aims to be a decentralized version of&nbsp; the virtual world, where users can interact and collaborate intelligently without worrying about&nbsp; the central Web 2.0 servers. To make the web evolution more inclusive and less biased,&nbsp; blockchain technology will be a foundational resource to focus on.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“NFT” was ranked as the top trending Google search in 2021. NFTs, or <\/span><a href=\"https:\/\/www.cth.group\/insights\/page\/tsocn\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Non-Fungible Tokens<\/span><\/a><span data-v-f87c67ca=\"\">, took&nbsp; the world by storm in 2021. The trading volume of non-fungible tokens (NFTs) surpassed $13&nbsp; billion, according to The Block Research. That figure is a massive 42,988% increase compared to&nbsp; 2020 NFT trading volumes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs are not limited to showing ownership of a unique PFP, or digitization and tokenization of&nbsp; artworks like Beeble’s <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"Everydays: The First 5,000 Days.\"<\/span><\/i><span data-v-f87c67ca=\"\">, the scope of NFTs has expanded to&nbsp; include music, games, sports and any digital or real-world asset — that can be tokenized while&nbsp; still holding their value and providing unique ownership into the metaverse.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The rise of metaverses has kept NFTs firmly in the spotlight having spawned a new breed of real&nbsp; estate investors looking to grab a piece of digital land through non-fungible tokens. One NFT&nbsp; blue chip is <\/span><b data-v-f87c67ca=\"\">Decentraland <\/b><span data-v-f87c67ca=\"\">($MANA), an investment made by <\/span><b data-v-f87c67ca=\"\">Fundamental Labs <\/b><span data-v-f87c67ca=\"\">in 2017, which&nbsp; continues to hold its first-mover advantage from NFT to thriving metaverse. To kick off 2022,&nbsp; electronics giant Samsung opened 837X, a virtual replica of its flagship 837 store, in the heart of&nbsp; Decentraland.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The demand for NFTs insatiable and offering creatives and rights holders new avenues to protect&nbsp; their intellectual property and create value. Initially the NFT space has been the domain&nbsp; dominated by Ethereum, powering much of the development. However, as NFTs prosper, they are no longer limited to the Ethereum chain for success, as we have witnessed a number of our&nbsp; portfolio companies with diversified protocols built on other Layer1 chains thriving:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The prime watershed moment for NFTs that followed the metaverse narrative is through GameFi&nbsp; protocols.&nbsp;<\/span>","<a href=\"https:\/\/www.cth.group\/insights\/page\/gamefi\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">GameFi<\/span><\/a> <span data-v-f87c67ca=\"\">is the intersection of DeFi and Play-to-Earn (P2E) blockchain gaming inside the Metaverse.&nbsp; GameFi encompasses the economies that become possible by passing ownership of assets to&nbsp; players and incentivizing greater loyalty, engagement, and positive stewardship of these gaming&nbsp; communities - thus changing the types and rules of games.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Axie Infinity’s Play-to-Earn (P2E) model — coupled with Guilds’ is the real game changer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The traditional games market in 2021 generated total revenues of $180.3 billion, so even 10% of&nbsp; the traditional \"pay-to-play\" or \"play-to-win\" model shifting to \"play-to-earn\" will bring&nbsp; handsome profits to Web 3.0 users. We are super bullish to see traditional gaming players joining&nbsp; the GameFi craze. Below are a few recent investments supported by Fundamental Labs that we&nbsp; see following this trend:<\/span>","<span data-v-f87c67ca=\"\">The advent of GameFi has led to the Metaverse taking off in 2021, which is a great credit of&nbsp; Web3.0 infrastructure readiness. If we compare the state we are in with Web 3.0 with the days of&nbsp; DApps (circa 2018) - most of the DApps failed. With the benefit of hindsight, this failure was a&nbsp; result of the difficulties to build something of value when the ideas were so far ahead of the&nbsp; supporting infrastructure. But it’s the natural course.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The “multi-chain” narrative was strong in 2021 and could extend to the whole year of 2022, as&nbsp; various Layer 1 blockchains and Layer 2 scaling solutions emerged to address the scalability&nbsp; problems that have historically plagued Ethereum.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Fundamental Labs is an advocate for multi-chain to increase the blockchain scalability as a whole,&nbsp; the portfolio of Layer 1 is comprehensive, including <\/span><b data-v-f87c67ca=\"\">NEAR, Avalanche, Polkadot, Kusama, Stacks,&nbsp; Nervos, Conflux, PlatON<\/b><span data-v-f87c67ca=\"\">,<\/span><b data-v-f87c67ca=\"\">Binance Coin<\/b><span data-v-f87c67ca=\"\">, etc.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Decentralized storage is a niche Web3.0 infra at the intersection of Metaverse and Web 3.0. The&nbsp; current main decentralized storage solutions are the I<\/span><b data-v-f87c67ca=\"\">PFS\/Filecoin <\/b><span data-v-f87c67ca=\"\">and Arweave.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Looking beyond 2022&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Despite the turbulent markets to start 2022 and the prospects that the Fed will remove stimulus,&nbsp; Fundamental Labs maintains an active and positive outlook on the market and continued growth&nbsp; across the above trends. There is no perfect time, and as such Fundamental Labs is quick to make&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">investments when opportunities arise. Within the first week of the New Year, it has already&nbsp; closed a few new deals. Some additional that the partners are watching most closely for further&nbsp; investment in the near future, include:&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Web Social <\/b><span data-v-f87c67ca=\"\">recent investments in <\/span><b data-v-f87c67ca=\"\">RSS3 and SOCOL <\/b><span data-v-f87c67ca=\"\">have great synergy with its existing Web 3.0 portfolio ecosystem: <\/span><b data-v-f87c67ca=\"\">Steem, Theta, Brave(BAT), Dora Factory(DORA), Status (SNT)<\/b><span data-v-f87c67ca=\"\">, as well as <\/span><b data-v-f87c67ca=\"\">Mask Network(MASK)<\/b><span data-v-f87c67ca=\"\">.<\/span>","<b data-v-f87c67ca=\"\">DeFi&nbsp;&nbsp;<\/b>","<span data-v-f87c67ca=\"\">2021 boasted a few interesting DeFi2.0 projects like Abracadabra, Convex, Olympus, and Tokemak.&nbsp; Compared with DeFi 1.0, the total value locked in DeFi 2.0 is still small but with better funding&nbsp; models linked t protocol goals (Protocol Control Value) this dynamic should change.&nbsp; Fundamental Labs started 2022 with investments in <\/span><b data-v-f87c67ca=\"\">Treehouse, Neptune Mutual, <\/b><span data-v-f87c67ca=\"\">and <\/span><b data-v-f87c67ca=\"\">Zecrey&nbsp;&nbsp;<\/b>","<b data-v-f87c67ca=\"\">DAO&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Over the course of 2021 we saw DAOs become more mature and mainstream. DAOs are a new&nbsp; coordination layer which will eventually replace the traditional model. A DAO is an&nbsp; internet-native organization with core functions that are automated by smart contracts, and with&nbsp; people who do the things that automation cannot (e.g., marketing, software development).&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Future of Work is Not Corporate — It’s DAOs and Web3.0 Networks&nbsp;<\/span><\/i>","<span data-v-f87c67ca=\"\">One of Fundmental Labs’ portfolio companies, <\/span><b data-v-f87c67ca=\"\">SuperDAO, <\/b><span data-v-f87c67ca=\"\">is an operating system for DAOs.&nbsp; SuperDao OS maintains the real-time status of DAO ownership, including tokens, NFTs, promises&nbsp; of future equity, allocation plan, governance structure, and custom roles.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Wrap-up&nbsp;<\/b>","<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">“The future is already here, it just isn’t evenly distributed” <\/i><\/b><b data-v-f87c67ca=\"\">.&nbsp;&nbsp;<\/b>","<span data-v-f87c67ca=\"\">The promise of Web 3.0 is an infinite game. New technology such as crypto assets, Web Social,&nbsp; DeFi, NFTs, Metaverse and the DAOs support the free flow of users, identity, data, and value which is facilitating collaboration and constituting an open digital economy - and ultimately a&nbsp; fairer, more stable and sustainable society.&nbsp;&nbsp;<\/span>","<a href=\"https:\/\/twitter.com\/FundamentalLabs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Fundamental Labs<\/span><\/a> <span data-v-f87c67ca=\"\">remains an active and willing partner to back the boldest entrepreneurs. You&nbsp; can read more about its outlook and portfolio companies in the full note <\/span><a href=\"https:\/\/fundamental-labs.medium.com\/empowering-web-3-0-mass-adoption-and-looking-beyond-2022-2da9d5908122\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Olympus","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Kusama","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Theta","content":"ORGANIZATION"},{"type":"$MANA","content":"MONEY"},{"type":"Convex","content":"ORGANIZATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$13&nbsp; billion","content":"MONEY"},{"type":"Conflux","content":"LOCATION"},{"type":"Zecrey","content":"LOCATION"},{"type":"$200M","content":"MONEY"},{"type":"Polkadot","content":"LOCATION"},{"type":"Stacks","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Neptune Mutual","content":"ORGANIZATION"},{"type":"Fundamental Labs","content":"ORGANIZATION"},{"type":"Dora Factory(DORA)","content":"PERSON"},{"type":"Tokemak","content":"ORGANIZATION"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"Nervos","content":"LOCATION"},{"type":"42,988%","content":"PERCENT"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$50M","content":"MONEY"},{"type":"Non-Fungible Tokens","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Binance Coin","content":"ORGANIZATION"},{"type":"Treehouse","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$180.3 billion","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}