{"summary":"DAO network Panvala has secured corporate sponsorships from Helium, MythX, and Unstoppable Domains as it looks to announce its fifth round of grants by","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52517\/dao-network-panvala-set-to-fund-more-eth2-0-projects-with-newly-secured-sponsorships","publishDate":"2020-01-09T16:05:06","id":10229,"type":null,"title":"DAO network Panvala set to fund more ETH2.0 projects with newly secured sponsorships","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">DAO network Panvala has secured corporate sponsorships from Helium, MythX, and Unstoppable Domains as it looks to announce its fifth round of grants by the end of January.<\/span>","<span data-v-f87c67ca=\"\">Founded in 2018, <a href=\"https:\/\/panvala.com\/\" data-v-f87c67ca=\"\">Panvala<\/a> issues grants in its native token, Pan, to award projects strengthening Ethereum’s infrastructure. Every three months, the foundation's advisory group makes grant suggestions for the upcoming quarter. Token holders then decide for themselves whether to accept or reject these recommendations.<\/span>","<span data-v-f87c67ca=\"\">The new sponsorships, obligation-free and ranging from $7,500 to $15,000 per year, will help Panvala continue its grant deployment.<\/span>","<b data-v-f87c67ca=\"\"><\/b>\"These companies are funding work that has the Ethereum community as their audience,\" <span data-v-f87c67ca=\"\">Panvala founder Niran Babalola told The Block. \"<\/span><b data-v-f87c67ca=\"\"><\/b>They're going to get more attention and more loyalty from the Ethereum ecosystem because they're directly funding the work that we depend on.\"","<span data-v-f87c67ca=\"\">Up to now, Panvala has put out 34 grants totaling over $90,000, mainly to teams working on Ethereum 2.0, the next major update to the blockchain, according to its website.<\/span>","<span data-v-f87c67ca=\"\">Noticeable grant recipients include Sigma Prime, the firm behind ETH2.0 client Lighthouse, Prysmatic Labs, the client implementation team responsible for the Sapphire testnet, and Quilt, the team working on ETH 2.0 phase 2, according to Babalola.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Babalola revealed that Panvala’s latest batch of grants, set to go out on Jan. 31, will fund the development of a tool called <a href=\"https:\/\/disputes.panvala.com\/proposals\/17\" data-v-f87c67ca=\"\">Universal Login<\/a>. Created by Alexandre Van de Sande, one of the early Ethereum contributors and former UX Designer at the Ethereum Foundation, Universal Login will make it easier for new users to log into Ethereum applications.<\/span>","<strong data-v-f87c67ca=\"\">Economic incentives in DAOs<\/strong>","<span data-v-f87c67ca=\"\">At present, DAOs like <\/span><a href=\"https:\/\/molochdao.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Moloch DAO<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.metacartel.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MetaCartel<\/span><\/a><span data-v-f87c67ca=\"\"> run similar grant-making platforms. Panvala’s pitch is to add the element of economic incentives into the current system.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a traditional DAO network, Babalola explained, participants receive votes corresponding to the amount of money they put in, but their votes get diluted over time and there is little incentive for them to grow the network. Panvala attempts to solve this issue by running the DAO on its own currency Pan.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“When you increase the flow of donations into Penvala, you increase the demand for the Pan that you hold,” he said. “Now you have a signific<span data-v-f87c67ca=\"\">ant incentive to grow the DAO.”<\/span><\/span>","<span data-v-f87c67ca=\"\">Babalola believes digital currencies could help build communities in the long term.<b data-v-f87c67ca=\"\"><\/b><\/span>","<span data-v-f87c67ca=\"\">\"What we haven't figured out in the decentralized space is how to create a currency that helps communities cooperate,\" he said. \"When we succeed, this can be something beyond the funding of blockchain technology [and] helps people organize and a much better way.\"<\/span>","<strong data-v-f87c67ca=\"\">Decentralized funding is the future<\/strong>","<span data-v-f87c67ca=\"\">According to Babalola, decentralized funding is where the future of the ecosystem is heading. <\/span>","<span data-v-f87c67ca=\"\">Right now, a considerable proportion of the Ethereum infrastructure is funded by either the Ethereum Foundation or early participants like ConsenSys, he said, which creates a number of challenges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“One problem is not everyone agrees with the decisions that are made,” he said. “By just having a pool of funds controlled by one foundation, the community doesn't really have a say in what gets funded.”<\/span>","<span data-v-f87c67ca=\"\">Decentralized funding will also build the community’s resilience to Ether’s price fluctuations, he said.<\/span>","<span data-v-f87c67ca=\"\">“The more we rely on a central pot of fund, the more subject we are to fluctuations in Ether’s price,” he said. “If instead, we can coordinate sustainable funding, we wouldn't have to rely on just the price of Ether to fund the work. We could rely on people who are contributing and making donations.”<\/span>","<span data-v-f87c67ca=\"\">ETH2.0 recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/49563\/ethereum-2-0-phase-0-reaches-final-stage-of-testing-as-developer-launches-public-multi-client-testnest\" data-v-f87c67ca=\"\">underwent<\/a> its first public multi-client test network and is entering its final stage of testing. And Babalola feels optimistic about the prospect of ETH2.0’s mainnet launch in 2020.<\/span>","<span data-v-f87c67ca=\"\">“There're enough teams building separate implementations of the new system to be able ensure that the new network will be resilient and reliable,” he said. “Rebuilding a blockchain is a very complicated endeavor. And I think this is the year that it actually gets done.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$90,000","content":"MONEY"},{"type":"Niran Babalola","content":"PERSON"},{"type":"Alexandre Van de Sande","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Penvala","content":"LOCATION"},{"type":"Babalola","content":"LOCATION"},{"type":"Jan. 31","content":"DATE"},{"type":"Sigma Prime","content":"ORGANIZATION"},{"type":"Babalola","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$15,000","content":"MONEY"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Lighthouse","content":"ORGANIZATION"},{"type":"Moloch DAO","content":"ORGANIZATION"},{"type":"$7,500","content":"MONEY"},{"type":"Panvala","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Universal Login","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Panvala","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}