{"summary":"Stablecoins should be “appropriately regulated” to play a role in the financial system, Federal Reserve Board Chair Jerome Powell said on Thursday. “We","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168615\/powell-we-need-legislation-on-stablecoins","publishDate":"2022-09-08T10:14:37","id":10234,"type":null,"title":"Powell: ‘We need legislation’ on stablecoins","category":["REGULATION"],"content":["Stablecoins should be “appropriately regulated” to play a role in the financial system, Federal Reserve Board Chair Jerome Powell said on Thursday.","“We need legislation on this,” Powell said. “There isn't a regulatory framework that really gets after payment stable coins, you know, and so I think that's what's needed.”","Powell made the comments during a livestream appearance at a Cato Institute conference on Thursday, during which Cato President and CEO Peter Goettler interviewed the Fed chair.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We don’t want to stand in the way of appropriate innovation … But we think that something like that which is purporting to be money would need to be appropriately regulated,” Powell said. “I think you need regulation. If people are going to think something is money it needs to have the qualities of money. I don’t think you want to take money and make it into just another consumer product.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Stablecoins should provide consumers with clarity, transparency and “full reserves of very liquid high-quality assets,” Powell said.","Washington lawmakers have been working behind closed doors on a stablecoin bill for months. House Financial Services Committee chair Maxine Waters and ranking Republican Rep. Patrick McHenry pushed to release draft text of stablecoin legislation in July, but they <a href=\"https:\/\/www.theblock.co\/post\/159946\/fate-of-stable-coin-bill-in-doubt-as-house-financial-services-committee-misses-key-deadline\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">were unsuccessful<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Powell also addressed the possibility of a digital dollar during his 40-minute interview. The Fed is evaluating whether to issue a central bank digital currency, and weighing issues like privacy.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We do not intend to proceed with the issuance of a CBDC without clear support from both the executive branch and Congress, ideally in the form of a specific authorizing law,” Powell said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fed","content":"ORGANIZATION"},{"type":"Federal Reserve Board Chair Jerome Powell","content":"ORGANIZATION"},{"type":"Maxine Waters","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Powell","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Cato Institute","content":"ORGANIZATION"},{"type":"Peter Goettler","content":"PERSON"}],"hashtag":["CONGRESS","JEROME POWELL","MAXINE WATERS","PATRICK MCHENRY"],"authors":["Stephanie Murray","The Block"]}