{"summary":"Shiba inu declined amid the launch of Shibarium at this week&#x27;s Blockchain Futurist Conference in Canada.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245667\/shiba-inu-memecoin-declines-as-shibarium-mainnet-goes-live","publishDate":"2023-08-16T17:54:51","id":10242,"type":null,"title":"Shiba Inu memecoin declines as Shibarium mainnet goes live","category":["CRYPTO ECOSYSTEMS"],"content":["Shiba inu declined Wednesday amid the launch of Shibarium at this week's Blockchain Futurist Conference in Canada. <a href=\"https:\/\/www.theblock.co\/post\/202516\/shiba-inu-about-to-launch-ethereum-layer-2-network-shibarium-in-beta\" data-v-f87c67ca=\"\">Shibarium<\/a> is a layer 2 memecoin ecosystem built on Ethereum and touted as the fulfillment of founder Ryoshi's vision.","<span data-v-f87c67ca=\"\">\"The Shibarium mainnet is now ready to on-board millions who are interested in shaping a new future that honors the principles of decentralization,\" developers said in a statement. The launch follows a successful testnet phase that generated a community of over 21 million user wallets. <\/span>","Shiba inu, or SHIB, dropped 7.8% over the past 24 hours, changing hands for $0.00000920 at 5:48 p.m. ET. Other memecoins also declined over the same period, with pepe falling 9.5% and <a href=\"https:\/\/www.theblock.co\/post\/244646\/harrypotterobamasonic10inu-leads-latest-memecoin-rally-surging-30\" data-v-f87c67ca=\"\">HarryPotterObamaSonic10Inu<\/a> (HPOS10I) declining 10.6%, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinGecko.<\/a>","<span data-v-f87c67ca=\"\">Lead developer Shytoshi Kusama stated the new layer 2 combines community and decentralization in a way that sets it apart from other blockchains.<\/span>","<span data-v-f87c67ca=\"\">“Many in the tech world, inside and outside blockchain, are promising 'everything apps' and full user interactivity in the world of ideas, goods, services, and other opportunities, however, any such promise absolutely must start at a place of both community and decentralization,\" Kusama added.<\/span>","<span data-v-f87c67ca=\"\">The lead developer told The Block that Shibarium is inviting all tokens to build and launch on the mainnet.<\/span>","<span data-v-f87c67ca=\"\">\"We are launching a layer 2 to power the world's first decentralized digital nation state, this is kinda a big deal,\" he added.<\/span>","<span data-v-f87c67ca=\"\">Now that it is live, Shibarium will be used to support existing Shiba Inu ecosystem tokens, including SHIB and LEASH. The layer 2's validators will be rewarded with a governance token called BONE, which has a total supply of 250,000,000.<\/span>","Detailing the specs behind the new layer 2, the developers said it offers rapid transactions and low fees, on a proof of stake consensus mechanism. It also enables \"enhanced security\" through Self-Sovereign Identity.","The launch of Shibarium has awoken an arch rival of Shiba Inu, called DogeBonk. The \"anti-memecoin\" has decided to follow HPOS10I and relaunch on Ethereum this week to coincide with the Shibarium mainnet launch.","At the height of the last bull-market, an intensive grass-roots advertising campaign saw Dogebonk launch a meme into space and position itself as \"a social response to the madness incited by <a href=\"https:\/\/www.theblock.co\/post\/203216\/shiba-inu-jumps-15-as-ether-trades-around-1600-following-ppi-release\" data-v-f87c67ca=\"\">Shiba Inu<\/a>.\"","\"We have a growing, passionate community of people who have stuck with us through a slow crypto market and are willing to put in the work to make Dogebonk on Ehereum something that rivals Shiba Inu,\" Dogebonk developer Ross Curry told The Block.","Whilst blue-chip cryptocurrencies are stuck in the doldrums, awaiting a wind that promises institutional adoption, memecoins operate under \"a completely uncorrelated animal spirit,\" head of trading at Genesis Gordon Grant told The Block.","Describing them as \"effervescent,\" he said they represent an upside capacity \"and are their own asset class, that is a perfection of the moral bankruptcy of the speculative spirit.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"7.8%","content":"PERCENT"},{"type":"9.5%","content":"PERCENT"},{"type":"Kusama","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Blockchain Futurist Conference","content":"ORGANIZATION"},{"type":"10.6%","content":"PERCENT"},{"type":"$0.00000920","content":"MONEY"},{"type":"Genesis Gordon Grant","content":"ORGANIZATION"},{"type":"Ross Curry","content":"PERSON"},{"type":"Shibarium","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Sovereign Identity","content":"ORGANIZATION"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"5:48 p.m. ET","content":"TIME"},{"type":"Shytoshi Kusama","content":"PERSON"},{"type":"Ryoshi","content":"PERSON"}],"hashtag":["BITCOIN","DECENTRALIZED INFRASTRUCTURE","DEXS","DOGECOIN","ETHEREUM","POLYGON","SHIBA INU","SMART CONTRACTS","UNISWAP"],"authors":["Brian McGleenon","The Block"]}