{"summary":"Fuel Labs, a startup that aims to quicken crypto transactions, has announced an $80 million raise from some of the sector’s heavyweights.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167763\/fuel-labs-scaling-startup-fundraise","publishDate":"2022-09-06T12:30:26","id":10246,"type":null,"title":"Fuel Labs raises $80 million for modular execution layer, touting superior speed","category":["LAYER 2S AND SCALING"],"content":["Fuel Labs, a startup that aims to speed up crypto transactions, has announced an $80 million funding round from some of the sector’s biggest investors.","Blockchain Capital and Stratos Technologies led the investment, according to an announcement on Tuesday, with Sam Bankman-Fried’s Alameda Research, CoinFund, Bain Capital Crypto, TRGC, Maven 11 Capital, Blockwall, Spartan, Dialectic and ZMT all participating. Ekram Ahmed, head of communications at blockchain developer Celestia Labs, is a strategic advisor.","The startup did not disclose further details of the raise, such as what valuation it placed on the project, or how the deal was structured. A spokesperson for the firm said it has no headquarters. Fuel last raised capital in a $1.5 million round led by CoinFund in September last year.","The latest raise comes with competition for supporting crypto projects heating up. New Layer 1 blockchains — challengers to the likes of Ethereum — are attracting significant investment, promising greater efficiency and reliability. Aptos Labs and its largely untested blockchain has <a href=\"https:\/\/www.theblock.co\/post\/159439\/aptos-closes-150-million-round-led-by-ftx-ventures-jump-crypto\" data-v-f87c67ca=\"\">drawn in $350 million<\/a> in two funding rounds this year alone.","Fuel offers a different take on tackling blockchain’s perceived problems. It was conceived as a Layer 2 scaling technology, and it became the first optimistic rollup launched on Ethereum in late 2020, per today’s announcement.","Now, with more than 60 engineers working on the project, Fuel styles itself as a “modular execution layer” (MEL) — comparable with but subtly different from Layer 2 protocols like Polygon. It hopes to offer slicker execution without sacrificing the security and decentralization benefits of Ethereum.","The project marked its transition to MEL in <a href=\"https:\/\/fuel-labs.ghost.io\/introducing-fuel-the-fastest-modular-execution-layer\/\" data-v-f87c67ca=\"\">a blog post<\/a> published in April this year. In that, it defined an MEL as “a verifiable computation system designed for the modular blockchain stack.” The post criticized Ethereum scaling tools like optimistic and zero knowledge (ZK) rollups on the basis that, although they have delivered some cost savings for crypto users, “throughput increase has been modest at best.” &nbsp;","“The main difference between a 'Layer 2' and a 'modular execution layer' is mostly contextual,” according to Arnold Toh, an analyst at The Block Research. “In the current state of blockchain development, almost all Layer 2s are modular execution layers. However, not all modular execution layers may be termed as 'layer 2s.'” He pointed to the example of StarkNet’s vision for <a href=\"https:\/\/medium.com\/starkware\/fractal-scaling-from-l2-to-l3-7fe238ecfb4f\" data-v-f87c67ca=\"\">so-called Layer 3s<\/a>, in which StarkNet would serve as a settlement layer for a MEL built on top.","“This is also why I perceive layer numbers as arbitrary. It would bring more clarity to define a layer by their responsibilities and stakeholders,” Toh added. &nbsp;","Fuel highlighted three key aspects of its technology in its announcement: the capacity to execute parallel transactions; its own Fuel Virtual Machine; and a developer experience structured around a purpose-built coding language named Sway.","“The core premise is that we keep seeing new chains pop up all the time, but people are not trying to retain the security and decentralization of the existing systems that we have,” Nick Dodson, co-founder at Fuel Labs, told The Block in an interview.","Fuel, Dodson added, wants to deliver “the maximum amount of security possible, but also the highest possible flexible throughput.”","As to how a newcomer like Fuel can compete in an increasingly crowded field of Layer 1 blockchains and scaling apparatus, Dodson said the startup aims to work with “focused [DeFi] projects that really believe in what we’re doing.”","“We’ll just aim to have the absolute best developer experience out there,” he added. “I think it will set a new standard for how blockchain development will happen.”","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-scaling-solutions\/embed\" title=\"Value Locked in Ethereum Scaling Solutions by Type\" width=\"100%\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"$350 million","content":"MONEY"},{"type":"$80 million","content":"MONEY"},{"type":"April this year","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fried’s Alameda Research","content":"ORGANIZATION"},{"type":"Arnold Toh","content":"PERSON"},{"type":"September last year","content":"DATE"},{"type":"Stratos Technologies","content":"ORGANIZATION"},{"type":"Celestia Labs","content":"ORGANIZATION"},{"type":"CoinFund","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"MEL","content":"ORGANIZATION"},{"type":"Dodson","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Nick Dodson","content":"PERSON"},{"type":"Blockwall","content":"PERSON"}],"hashtag":["ETHEREUM","FUNDRAISING"],"authors":["Ryan Weeks","The Block"]}