{"summary":"Crypto exchange Bybit said in December it could widen the scope of its customer identification rules.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227943\/bybit-moves-to-impose-mandatory-kyc-rules-for-all-services","publishDate":"2023-04-24T11:31:21","id":10250,"type":null,"title":"Bybit moves to impose mandatory KYC rules for all services","category":["COMPANIES"],"content":["Crypto exchange Bybit will require know-your-customer checks on all its services starting next month.","\"Starting from 8 May, 2023, Identity Verification of at least Lv.1 will be mandatory for all Bybit products and services,\" the company said in a Monday announcement. \"Existing users who have not completed Identity Verification as of 8 May, 2023 will only be allowed to close existing open positions or orders, return loans, or withdraw.\"","Word of the policy shift appeared to circulate on social media in recent days. Bybit itself suggested such a move was possible in December, when it <a href=\"https:\/\/www.theblock.co\/post\/193594\/bybit-new-kyc-nft\" data-v-f87c67ca=\"\">rolled out KYC requirements<\/a> for peer-to-peer trading and some NFT services. The exchange said at the time that it \"may further expand KYC requirements in the near future.\"","Bybit didn't offer an explanation for the policy shift, but regulators worldwide have more closely scrutinized crypto exchanges in recent months, particularly in the U.S.&nbsp;","The exchange is one of a number of crypto firms headquartered in Dubai. Bybit moved its headquarters from Singapore to Dubai last year, as <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-03-29\/crypto-com-bybit-announce-plans-to-set-up-operations-in-dubai\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Bloomberg<\/a> previously reported.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Identity Verification","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"May, 2023","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}