{"summary":"In recent years Andreessen Horowitz, or a16z, has established itself as one of the biggest investors in web3 developers and platforms.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203342\/andreessen-horowitz-gaming-partner-james-gwertzman-exiting-vc-firm","publishDate":"2023-01-18T10:46:15","id":10258,"type":null,"title":"Andreessen Horowitz gaming partner James Gwertzman exiting VC firm","category":["GAMING"],"content":["After a little more than a year as a general partner at Andreessen Horowitz, one of the most prolific investors in web3 technologies, James Gwertzman announced he is stepping down at the end of the month.","“I've made the decision to step back from my role as [general partner] at a16z in order to go back to being a full-time builder,” he said in a LinkedIn post. “I'm proud of helping launch Games Fund One, and I've loved learning the VC ropes, but I miss being an entrepreneur.”","In recent years Andreessen Horowitz, or a16z, has established itself as one of the biggest investors in web3 developers and platforms, including blockchain-powered gaming projects such as Sky Mavis, which is responsible for the once highly popular play-to-earn game Axie Infinity, and Mythical Games, which is also releasing web3 titles.","Gwertzman’s departure comes at what could turn out to be an inflection point in web3 gaming as a new wave of titles developed by veteran gaming executives begin to compete with an initial phase of easier-to-build, 2D games.","In May of last year a16z announced its <a href=\"https:\/\/www.theblock.co\/post\/147591\/a16z-launches-600-million-fund-to-invest-in-gaming-industry\" data-v-f87c67ca=\"\">$600 million Games Fund One<\/a>. At the time of the announcement, a16z said Gwertzman would help lead the fund focused on web3 gaming.","A16z did not immediately respond to an email request for comment.","Before joining a16z, Gwertzman spent several years working for Microsoft, where he also specialized in gaming, according to his LinkedIn profile.","“I haven't decided yet what to focus on next and I'm looking forward to taking some time before I jump back in,” Gwertzman also said in his post. “As a VC I saw many gaps in the market where I would have liked to invest, and am now considering building.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Infinity","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"May of last year","content":"DATE"},{"type":"Gwertzman","content":"PERSON"},{"type":"James Gwertzman","content":"PERSON"},{"type":"Sky Mavis","content":"LOCATION"},{"type":"$600 million","content":"MONEY"}],"hashtag":["PLAY2EARN"],"authors":["RT Watson","The Block"]}