{"summary":"The likely next chairman of the House Financial Services Committee says that Binance’s role in the collapse of FTX is expected to be one of the focuses of a recently announced hearing on the topic. \nIt remains unclear whether former FTX CEO Sam Bankman-Fried will participate in next month’s congressional hearing.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187692\/binance-role-in-ftx-collapse-crypto-meltdown-under-congressional-scrutiny","publishDate":"2022-11-16T13:17:12","id":1025,"type":null,"title":"Binance role in FTX collapse under congressional scrutiny","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Binance’s role in the sudden collapse of FTX, an event that sent reverberations around crypto markets, has come under congressional scrutiny, a senior House Republican confirmed to The Block.<\/span>","<span data-v-f87c67ca=\"\">“This is serious. I think that this is a major event,” Rep. Patrick McHenry, R-N.C., told The Block while acknowledging that Binance’s role in the sudden meltdown will be one of the focuses of a December hearing announced this morning.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The North Carolina Republican — the likely next chairman of the House Financial Services Committee — referred to a widely circulated internet meme that used footage from television show \"The Office\" to highlight the role public comments made by Binance CEO Changpeng \"CZ\" Zhao played in FTX’s sharp decline.&nbsp;<\/span>","FTX filed for Chapter 11 bankruptcy protection on Nov. 11.","<span data-v-f87c67ca=\"\">In separate remarks to reporters, McHenry demurred as to whether former FTX CEO Sam Bankman-Fried has agreed to appear at the hearing, or if the embattled crypto mogul would be subpoenaed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The first step is a bipartisan call for a hearing,” the current ranking member of the House Financial Services Committee said. “We’re certainly going to prioritize this next Congress.”<\/span>","<span data-v-f87c67ca=\"\">McHenry told reporters that Committee Chair Maxine Waters, D-Calif., has similar concerns to his over the crypto meltdown. “It’s a bipartisan call. We’re going to work together on who those witnesses are in the process forward.”<\/span>","<span data-v-f87c67ca=\"\">Asked if the FTX situation added urgency to negotiations around stablecoin legislation for a possible lame duck passage before the end of the current Congress in early January, McHenry said that was up to Waters as chair.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Chairwoman Waters and I have had fruitful conversation and have worked significantly to come to terms there, and I think we understand each other a lot better,” said McHenry. “The issue of what a stablecoin is, we’re clearly aligned,” as well as on other major issues within the legislation, he continued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But he added that the FTX collapse lent urgency to additional legislation around defining digital assets and regulate centralized exchanges.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We’ve had these conversations about what I think are the second-, third-, and fourth-order decisions that we have to make as a committee to bring clarity,” McHenry said. “So I believe the first step here is you have to have clarity around what is a digital asset. And that means making a clear legal distinction here.”<\/span>","Binance has denied any direct role in FTX's downfall. The company argued that the cause of FTX's failure were financial irregularities and possible fraud in written comments to a UK parliamentary committee that asked for details of the crypto exchange's role in their rival's collapse.&nbsp;","<em data-v-f87c67ca=\"\">With additional reporting by Benjamin Robertson<\/em>"],"hashtag":["CONGRESS","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","PATRICK MCHENRY","SAM BANKMAN-FRIED"]}