{"summary":"Teneo has taken control of some of the fund&#x27;s assets, including Starkware tokens, according to a presentation deck dated today obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191790\/three-arrows-capital-liquidators-begin-taking-control-of-failed-hedge-funds-assets","publishDate":"2022-12-02T13:02:43","id":10256,"type":null,"title":"Three Arrows Capital liquidators begin taking control of failed hedge fund&#x27;s assets","category":["LEGAL"],"content":["Teneo, the advisory firm overseeing the liquidation of crypto hedge fund Three Arrows Capital (3AC), has taken control of some of its assets, according to a presentation deck obtained by The Block.","The deck, presented by Teneo at a court hearing today in the New York Southern Bankruptcy Court, states that the liquidators have made some progress in the 3AC case in terms of assets realization.","\"Liquidators have taken control of fiat currencies totaling USD $35.6 million, which were held by Singapore banks and\/or held by the Company’s pre-appointment lawyers,\" reads the deck. \"Proceeds from forced redemptions of investments of USD $2.751 million\" have also been realized.","As part of the process, Teneo has taken control of 3AC's Starkware tokens, with liquidators purchasing the tokens on original deal terms. 3AC<a href=\"https:\/\/www.theblock.co\/post\/124479\/ethereum-layer-2-developer-starkware-raises-50-million-now-valued-at-2-billion\" data-v-f87c67ca=\"\"> invested<\/a> in Starkware's $75 million Series B round and $50 million Series C round.","Teneo is now in control of 3AC's exchange accounts. The firm has also received transactional history and identified more than 60 types of tokens, according to the presentation. Teneo is holding recovered tokens in a crypto custody account under its control and converted to USD as necessary. Ether holdings were converted at an average price of $1,810.","Teneo has identified around 180 simple agreements for future equity (SAFE), simple agreements for future tokens (SAFT) and equity investments of 3AC \"which are understood to be illiquid and may be subject to lock up and\/or vesting periods, automatic rights of redemption, right of first refusal, etc.\"&nbsp; The firm said it continues to explore options for extracting value from these investments.","3AC founders Su Zhu and Kyle Davies have repeatedly failed to engage with Teneo, the presentation alleged. \"Founders’ limited cooperation has led to only cursory disclosures of assets and certain agreements. Founders appear to be in Bali, Indonesia and\/or UAE – jurisdictions known for difficulties in enforcing foreign court orders.\"","Teneo declined to comment to The Block when reached. Davies did not immediately respond to a request for comment.&nbsp;","In October, Teneo sought court approval to serve the founders with subpoenas via their Twitter and email accounts due to their alleged failure to cooperate with requests for information. According to a source with direct knowledge of the matter, Chief Judge Martin Glenn today approved a motion to subpoena 3AC's founders as well as subpoenas requiring them to turn over communications. However, the judge did not rule on a motion to serve those subpoenas via Twitter.","3AC, once one of the largest and best-known crypto hedge funds, collapsed amid liquidity troubles in mid-June. The fund filed for Chapter 15 bankruptcy in New York on July 1.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"$1,810","content":"MONEY"},{"type":"$2.751 million","content":"MONEY"},{"type":"Kyle Davies","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Indonesia","content":"LOCATION"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"$75 million","content":"MONEY"},{"type":"Bali","content":"LOCATION"},{"type":"$35.6 million","content":"MONEY"},{"type":"Starkware","content":"LOCATION"},{"type":"mid-June","content":"DATE"},{"type":"Davies","content":"PERSON"},{"type":"July 1","content":"DATE"},{"type":"October","content":"DATE"},{"type":"New York Southern Bankruptcy Court","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS","SU ZHU","THREE ARROWS CAPITAL"],"authors":["Yogita Khatri","The Block"]}