{"summary":"Moonbirds #2642, one of the rarest members of the Moonbirds NFT collection, sold for a record over $1 million on OpenSea on Saturday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143249\/moonbirds-nft-record-sale-1m-kevin-rose-project","publishDate":"2022-04-25T08:27:18","id":10274,"type":null,"title":"Moonbirds NFT sells for record $1 million within week of launch  ","category":["NFTS"],"content":["Moonbird #2642, one of the rarest members of the Moonbirds NFT collection, sold for a record 350 ETH (over $1 million) on the NFT marketplace OpenSea on Saturday.","<a href=\"https:\/\/opensea.io\/assets\/0x23581767a106ae21c074b2276d25e5c3e136a68b\/2642\" data-v-f87c67ca=\"\">The buyer<\/a> of the piece was The Sandbox, a blockchain-based gaming firm that is a subsidiary of Hong Kong-based Animoca Brands. The seller goes by \"oscuranft\" on OpenSea, who booked a profit of about $600,000 having bought the NFT a week ago for 100 ETH.","Moonbirds is an NFT collection of 10,000 owl avatars. It is one of the fastest collections to reach bluechip status in terms of floor price. Moonbirds was launched on April 16 by Proof, a media startup founded by renowned venture capitalist Kevin Rose.&nbsp;","Rose is currently a partner at the technology-focused venture capital firm True Ventures. He was previously a general partner at Google Ventures and has over 1.5 million Twitter followers.","Rose hosts an NFT-focused podcast via Proof. Moonbirds is his second big NFT project after Proof Collective — a private group of 1,000 NFT collectors and artists, including Beeple, who hold a Proof Collective NFT and get certain exclusive benefits.","These benefits include access to Proof’s private Discord, early access to the Proof podcast and in-person events.","Moonbirds are \"the official Proof PFP\" (picture for proof or profile pic) of the Proof Collective, according to the Moonbirds website.&nbsp;","Moonbirds NFTs have clocked in a total sales volume of nearly $360 million in just over a week, according to The Block Research, citing data from Dune Analytics. Its top 10 highest sales range between $397,000 and $1 million.","","","The <a href=\"https:\/\/opensea.io\/collection\/proof-moonbirds\" data-v-f87c67ca=\"\">current floor price<\/a> of Moonbirds is 33.3 ETH, according to OpenSea. Proof <a href=\"https:\/\/moonbirds.xyz\/\" data-v-f87c67ca=\"\">minted<\/a> each NFT at 2.5 ETH apiece. That means holders are sitting on gains of over 12 times in just over a week.&nbsp;","According to The Block Research's NFT analyst, Thomas Bialek, Moonbirds' quick success has been driven by several factors: backing from Rose; the success of his previous Proof Collective project; and collectors currently opting for NFT projects with a successful track record.","Proof Collective NFT holders are also sitting on bigs gains. These NFTs were minted last December starting at a price of 5 ETH via a Dutch auction. The current <a href=\"https:\/\/opensea.io\/collection\/proof-collective\" data-v-f87c67ca=\"\">floor price<\/a> of these NFTs is 109 ETH, according to OpenSea.&nbsp;","Proof Collective NFTs have clocked in a total sales volume of over $39 million to date, according to The Block Research, citing data from Dune Analytics.&nbsp;","As for Moonbirds, Rose appears to have bigger plans. Moonbirds is launching a new feature called \"nesting,\" where holders can stake their NFTs in a non-custodial way and earn additional benefits.&nbsp;","Depending on how long holders lock up their NFTs, they will achieve different status levels, Rose <a href=\"https:\/\/www.youtube.com\/watch?v=MskiNZUScqk\" data-v-f87c67ca=\"\">explained<\/a> in a recent video.","\"As you achieve different nest status levels, that allows us to deliver different benefits to you as Moonbirds holders,\" he said. \"That will mean in-real-life meetups and events and there's gonna be some crazy airdrops that we have planned.\"","Rose went on to say that this is the \"very beginning\" of Proof and that he plans \"a multi-decade journey to build a new media company.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Google Ventures","content":"ORGANIZATION"},{"type":"True Ventures","content":"ORGANIZATION"},{"type":"$600,000","content":"MONEY"},{"type":"$360 million","content":"MONEY"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Moonbirds","content":"PERSON"},{"type":"Moonbirds NFT","content":"ORGANIZATION"},{"type":"$397,000","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Proof Collective NFT","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"$39 million","content":"MONEY"},{"type":"2642","content":"DATE"},{"type":"Thomas Bialek","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Beeple","content":"PERSON"},{"type":"Moonbirds","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Kevin Rose","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"April 16","content":"DATE"}],"hashtag":["PROOF COLLECTIVE"],"authors":["Yogita Khatri","The Block"]}