{"summary":"Ether derivatives soared ahead of Ethereum’s move to proof-of-stake. \nSince The Merge, derivatives have continued to outpace bitcoin, although volatility is down.\nThe ether options profile is tilted towards the buy-side, according to LedgerPrime.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172380\/ether-options-buy-side-ethereum-merge","publishDate":"2022-09-27T16:07:59","id":1027,"type":null,"title":"ETH options leaning towards the buy-side, despite sell-off following The Merge","category":["Markets"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Ether derivatives soared leading up to The Merge and following the upgrade, with some metrics still up on bitcoin while traders appear to be optimistic.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Ahead of The Merge, ether derivatives <\/span><a href=\"https:\/\/www.theblock.co\/post\/167454\/ether-derivatives-smash-milestones-left-and-right-as-the-merge-looms\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">set milestones left and right<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> as traders bet on Ethereum’s network upgrade. <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">Open interest in ether options surpassed bitcoin open interest for the first time in August, as ether hurtled past $8 billion to an <\/span><a href=\"https:\/\/www.theblock.co\/post\/163418\/aggregate-open-interest-of-ether-options-hits-all-time-high\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">all-time high<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/aggregated-open-interest-of-ethereum-options\/embed\" title=\"Aggregated Open Interest of Ethereum Options\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The surge was linked to the emergence of new, more complex strategies among traders positioning themselves ahead of Ethereum's transition to proof-of-stake, according to LedgePrime, a digital asset trading firm and a subsidiary arm of crypto exchange FTX.&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Meanwhile, the volume of ether futures eclipsed bitcoin futures during August. The Block's Lars Hoffman attributed this to the carry play ahead of The Merge.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The volume of ether traded notionally on Deribit between Sept. 1 and Sept. 14 was a little more than $5 billion<\/span>, LedgerPrime's Laura Vidiella told The Block. Moreover, a significant portion of this volume came from institutions.","Block trades, a privately negotiated purchase or sale of large blocks of digital assets settled over the counter (OTC), are typically made by institutions as they're useful for buying or selling vast amounts of cryptocurrencies without slippage affecting an asset’s market price.","As institutions tend to use block trades, these are a useful indicator of institutional activity, which accounted for a significant portion of the trading volume leading up to The Merge.","While the price of ether has fallen since The Merge, the majority of derivatives volume trading occurred directly after the upgrade.&nbsp;","Block trades made up about 40% of v<span data-contrast=\"auto\" data-v-f87c67ca=\"\">olume post-Merge,<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> which was expected given that volatility fell Vidiella told The Block last week. Deribit's volatility index fell from 116 on Sept. 14 to 95 on Sept. 17, while it's currently at 95 according to The Block's <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\" data-v-f87c67ca=\"\">Data Dashboard<\/a>.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/eth-dvol-index-vs-spot\/embed\" title=\"ETH DVol Index vs Spot\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Funding rates, or payments made between traders based on the difference between perpetual contract prices and spot prices, are a good indicator of investor sentiment.","Depending on open positions, long or short, traders pay for or receive funding — negative indicates traders are short, and positive implies traders are long.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/eth-funding-rates\/embed\" title=\"ETH Funding Rates (7DMA, APY)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Ether funding rates went negative in August, plunging to a range of around -21% on Binance to -24% on Huobi following The Merge.","Rates appear to be trending towards neutral, with rates around -5% on Huobi and -1.49% on Binance today, according to The Block's Data Dashboard.","Furthermore, ether options open interest remains above bitcoin's, $6.8 billion to $5.8 billion, at the time of writing.","While the volume of ether options, $11 billion, was marginally behind that of bitcoin's, $11.6 billion, this month-to-date.&nbsp;"],"hashtag":["BITCOIN","DERIVATIVES","ETHEREUM"]}