{"summary":"Notebook Labs, a crypto identity startup, has raised a $3.3 million seed round led by Bain Capital Crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180715\/stanford-undergrads-raise-3-3-million-for-their-notebook-labs-protocol","publishDate":"2022-10-27T19:15:40","id":10278,"type":null,"title":"Stanford undergrads raise $3.3 million for their Notebook Labs protocol","category":["INVESTMENTS"],"content":["Notebook Labs, a crypto identity startup, has raised a $3.3 million seed round led by Bain Capital Crypto.","Notebook was one of 240 startups that received funding out of Y Combinator’s latest summer cohort. Other notable investors include: Y Combinator itself, Soma Capital, Abstract Ventures, Pioneer Fund and NFX.","Notebook Labs originated from a group of Stanford undergraduates during Stanford’s TreeHacks hackathon event earlier this year. The goal of Notebook is to allow users to preserve their private data, information and online identity, while still being able to use crypto applications that would require disclosing and trusting a centralized party with important and sensitive information.","Amid concerns of regulation and privacy concerns which was spurred by Tornado Cash a few months back, Notebook aims to solve this issue by using zero-knowledge proofs.","Zero-knowledge proofs allow anyone to prove to another person that something is true, without actually revealing the specific information.","To better conceptualize this, take for example ordering a drink from a bar. For someone to prove they are over the age of 21, the bartender has to look at an ID, which discloses private information, such as an address and full name. Now imagine that there’s a technology that doesn’t show any of that information, but still can prove someone is legally allowed to drink.","This, at a high level, is what Notebook is attempting to enable for crypto applications using zero-knowledge proofs.","Blockchain protocols could use Notebook’s login technology for users to verify specific information about themselves, without them having to take custody or hold their actual data. Another key issue for protocols themselves is susceptibility to sybil attacks, which is when someone tries to game a token airdrop incentive program with multiple wallets. It could act as a safeguard against situations like these.&nbsp;","Notebook could also enable novel on-chain functions like “credit scoring systems that offer lower-collateralized loans by allowing DAOs to check the identity of their users in a privacy preserving way,” said Notebook Labs co-founder Nathaniel Masfen-Yan.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"Soma Capital","content":"ORGANIZATION"},{"type":"Notebook Labs","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"NFX","content":"ORGANIZATION"},{"type":"Nathaniel Masfen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Stanford","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}