{"summary":"The year is coming to an end and the team at Lisk would like to take this opportunity to summarize the most important accomplishments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129011\/lisk-2021-year-in-review","publishDate":"2022-01-03T13:42:34","id":10287,"type":null,"title":"Lisk 2021 - Year in Review","category":["SPONSORED"],"content":["In 2021, despite the current pandemic situation, Lisk accomplished a multitude of achievements and other incredibly important milestones. From the successful and largest network migration to the hosting of a brand new blockchain event, ​​this blog post covers the highlights of the past twelve months.","<strong data-v-f87c67ca=\"\">Lisk’s Biggest Achievements in 2021<\/strong>","Last year, the Lisk project has witnessed the successful completion of a few of the most crucial milestones since its inception. In August 2021, the Emerald roadmap phase was completed and the Sapphire stage started. This will finally lead the project to the official launch of its blockchain application platform.","The completion of the Emerald phase was possible thanks to the <a href=\"https:\/\/lisk.com\/blog\/development\/meet-new-lisk-mainnet\" data-v-f87c67ca=\"\">successful migration to the Lisk Mainnet v3<\/a>, the most significant protocol change to ever occur on the Lisk blockchain and arguably the biggest update to a running production blockchain ever.","In addition to this, Lisk has completed the research for the Lisk Interoperability solution and published 25 Lisk Improvement Proposals (LIPs), establishing a new standard for the whole blockchain industry.","<strong data-v-f87c67ca=\"\">Other Remarkable Achievements in 2021<\/strong>","In 2021, Lisk has also:","<strong data-v-f87c67ca=\"\">Lisk Marketing in 2021<\/strong>","2021 was also a breakthrough year for Marketing at Lisk. For the first time, the team organized an online hackathon for the Lisk ecosystem – <a href=\"https:\/\/lisk.com\/blog\/announcement\/announcing-hackonlisk\" data-v-f87c67ca=\"\">HackOnLisk<\/a>. They have conducted not one but two editions of the event. In total, Lisk has received over 300 registrations and awarded developers from all around the world with over $80,000 ($33,000 in the 1st edition, $48,000 in the 2nd edition). The entire list of nominees can be found on Lisk’s official YouTube channel:","Click here for <a href=\"https:\/\/www.youtube.com\/playlist?list=PLixm1arf_lExcWpFMcUceIOWkqZcBM0TO\" data-v-f87c67ca=\"\">HackOnLisk<\/a><br data-v-f87c67ca=\"\">\nClick here for<a href=\"https:\/\/www.youtube.com\/playlist?list=PLixm1arf_lExWI8IGo_qSAg75TN46IXIz\" data-v-f87c67ca=\"\"> HackOnLisk2<\/a>","In addition, this last year Lisk has also introduced the <a href=\"https:\/\/lisk.com\/blog\/announcement\/introducing-lisk-grant-program\" data-v-f87c67ca=\"\">Lisk Grant Program<\/a> – another initiative created to attract entrepreneurs and developers into the Lisk ecosystem. Each of the selected applicants will receive 60,000CHF funding paid in LSK tokens and technical support to develop their Lisk-based blockchain applications. In 2021, Lisk has already awarded four very prospective projects:","<a href=\"https:\/\/colecti.com\/\" data-v-f87c67ca=\"\">Colecti<\/a> - an NFT marketplace <br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/kalipo.io\/\" data-v-f87c67ca=\"\">Kalipo<\/a> - a platform to support DAOs<br data-v-f87c67ca=\"\">\n<a href=\"https:\/\/enevti.com\/\" data-v-f87c67ca=\"\">Enevti<\/a> - a decentralized social media NFT platform<br data-v-f87c67ca=\"\">\n<a href=\"http:\/\/www.doedu.me\/\" data-v-f87c67ca=\"\">DoEdu<\/a> - a blockchain-based educational platform","As aforementioned, both initiatives (HackOnLisk and Lisk Grant Program) were announced during our main 2021 events – Lisk.js and AmpliFire. The former is very much focused on developers and the main technological breakthroughs. Last<a href=\"https:\/\/lisk.com\/blog\/events\/lisk.js-2021-recap\" data-v-f87c67ca=\"\"> year’s edition of Lisk.j<\/a>s was all about the Lisk Interoperability. 12 speakers provided a deep dive into Lisk’s solution, announcing the four new research goals:","<a href=\"https:\/\/lisk.com\/blog\/events\/amplifire-2021-event-highlights\" data-v-f87c67ca=\"\">AmpliFire,<\/a> on the other hand, was designed to attract everyone to the Lisk ecosystem. In December, Lisk gathered community members and newcomers in Berlin (and on the <a href=\"https:\/\/www.youtube.com\/watch?v=31XPRrrBBX4\" data-v-f87c67ca=\"\">YouTube livestream<\/a>) to talk about the most significant achievements of 2021 and announcements for 2022. Over 2900 guests had a chance to listen to 8 speakers who provided some essential information about the Lisk project’s development.","","","This event also allowed the team to finally present The Ultimate Vision for the project: making Lisk the most accessible blockchain application in the world. Therefore, in the upcoming years, the focus will be on the following topics:","Additionally, it is also worth mentioning that in 2021 Lisk project reached 200,000 followers on Twitter and published over 70 blog posts. This is an important achievement for the project and its community of both developers and users.","<strong data-v-f87c67ca=\"\">Lisk in 2022 – The Best Is Yet To Come!<\/strong>","Although 2021 was very successful not only for Lisk, but also for the blockchain industry as a whole, the team believes that the best is yet to come. During this year’s events, Lisk announced their bold and loud plans for 2022, with the primary goal of implementing the Lisk Interoperability solution and finally launching the Lisk Platform next year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lisk Marketing","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$33,000","content":"MONEY"},{"type":"$48,000","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"$80,000","content":"MONEY"},{"type":"last year Lisk","content":"DATE"},{"type":"Enevti","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Berlin","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Lisk Interoperability","content":"ORGANIZATION"},{"type":"Lisk","content":"ORGANIZATION"},{"type":"HackOnLisk<\/a><br data-v-f87c67ca=\"\">\nClick","content":"ORGANIZATION"},{"type":"Lisk Grant Program","content":"ORGANIZATION"},{"type":"Lisk","content":"PERSON"},{"type":"Kalipo","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}