{"summary":"Around $580 million in phony trades were executed on the top six NFT marketplaces in February, a figure that rose nearly 126% from the previous month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221344\/why-nft-wash-trading-was-up-126-in-february","publishDate":"2023-03-20T19:30:22","id":10284,"type":null,"title":"Why NFT wash trading was up 126% in February","category":["COMPANIES"],"content":["As the volume of NFT trading has continued to rise over the last four months, so has the rate of wash trading, according to a <a href=\"https:\/\/www.coingecko.com\/research\/publications\/nft-wash-trading-marketplaces?utm_campaign=PR%2BData%2BCampaigns&amp;utm_medium=social\" data-v-f87c67ca=\"\">new CoinGecko study<\/a>. The company reported that $580 million in phony trades were executed on the top six marketplaces in February, a 126% rise from the previous month.","NFT wash trading made up about 23% of unadjusted trading volume out of a total of $1.89 billion traded across the six biggest marketplaces, which the report said, \"can be attributed to the activity of users incentivized to increase their trading volumes\" by marketplaces \"that offered rewards for transactions.\"&nbsp;&nbsp;","The largest offenders were X2Y2, Blur and LooksRare, which contributed $280 million (49.7%), $150 million (27.7%) and $80 million (15.1%), respectively.","<a href=\"https:\/\/www.coingecko.com\/research\/publications\/nft-wash-trading-marketplaces?utm_campaign=PR%2BData%2BCampaigns&amp;utm_medium=social\" data-v-f87c67ca=\"\">Source: CoinGecko<\/a>","A form of market manipulation, wash trading is essentially when an individual or a firm trades with itself to artificially inflate prices, generate the illusion of liquidity or make money from the incentives offered on a given platform.","A trader can buy and sell the same asset multiple times to make it appear that there's higher demand than there really is.","Wash trading made up around 70% of all transactions on noncompliant crypto exchanges, including Binance, according to a <a href=\"https:\/\/www.nber.org\/system\/files\/working_papers\/w30783\/w30783.pdf\" data-v-f87c67ca=\"\">study<\/a> published by the National Bureau of Economic Research in December. Investor Mark Cuban told <a href=\"https:\/\/www.thestreet.com\/investing\/cryptocurrency\/billionaire-mark-cuban-warns-of-potential-new-crypto-scandal-fraud\" data-v-f87c67ca=\"\">TheStreet<\/a>&nbsp;he thinks the next \"possible implosion\" in crypto could be the discovery of wash trades on central exchanges.","In the world of NFTs, the practice is commonplace. A study published by a data analyst at Dune in December <a href=\"https:\/\/dune.com\/blog\/nft-wash-trading-on-ethereum\" data-v-f87c67ca=\"\">said<\/a>&nbsp;that in January 2022, more than 80% of NFT trading volume was wash trading.&nbsp;","Although the figures have declined since, the problem still is significant. As the CoinGecko study indicates, token incentives are partly responsible for the recent increase in wash trading.","Blur saw wash trading triple in February after it introduced its native token <a href=\"https:\/\/www.coingecko.com\/en\/coins\/blur\" data-v-f87c67ca=\"\">$BLUR<\/a> and began to run airdrop campaigns, which reward users for their transaction activity, according to CoinGecko.&nbsp;","With low transaction fees and token incentives, Blur has become an ideal venue for wash trading. As long as the rewards and incentives offered for increased trading activity exceed the gas fees paid for executing a trade, users could in theory continue to earn money by simply passing assets from one wallet to another.","In the first week of March, Blur captured <a href=\"https:\/\/www.theblock.co\/post\/217458\/blur-captures-84-of-eth-based-nft-transactions-in-first-week-of-march\" data-v-f87c67ca=\"\">84%<\/a> of all Ethereum-based NFT transactions, doubling its market share in less than two months.","It's a practice that has become common on other NFT marketplaces, such as X2Y2 and LooksRare, where a user's trading volume from the previous day is used to calculate token rewards. In the CoinGecko study, it's estimated that wash trading represented 85% and 81% on these marketplaces, respectively. In February, <a href=\"https:\/\/blog.chainalysis.com\/reports\/2022-crypto-crime-report-preview-nft-wash-trading-money-laundering\/\" data-v-f87c67ca=\"\">Chainalysis reported<\/a> that a group of 110 addresses had earned more than $8.9 million executing this strategy.&nbsp;","As Blur becomes the biggest force in the NFT market, wash trading is poised to continue increasing.&nbsp;","As The Block <a href=\"https:\/\/www.theblock.co\/post\/217961\/blur-bid-incentives-skew-market-lead-to-offers-on-nfts-above-buy-now-prices\" data-v-f87c67ca=\"\">previously reported<\/a>, the bidding-incentive model used on Blur has created an environment where buyers are regularly offered more than the asking price for items in collections.","While the fees tacked onto a transaction set against the rewards for listing and bidding, the incentives set up a context where reverse arbitrage can turn a profit.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"National Bureau of Economic Research","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"January 2022","content":"DATE"},{"type":"126%","content":"PERCENT"},{"type":"84%","content":"PERCENT"},{"type":"$BLUR","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"27.7%","content":"PERCENT"},{"type":"Binance","content":"PERSON"},{"type":"$8.9 million","content":"MONEY"},{"type":"$280 million","content":"MONEY"},{"type":"Dune","content":"ORGANIZATION"},{"type":"81%","content":"PERCENT"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"first week of March","content":"DATE"},{"type":"$1.89 billion","content":"MONEY"},{"type":"last four months","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$580 million","content":"MONEY"},{"type":"85%","content":"PERCENT"},{"type":"15.1%","content":"PERCENT"},{"type":"Chainalysis","content":"PERSON"},{"type":"49.7%","content":"PERCENT"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Sam Venis","The Block"]}