{"summary":"For the first time since the latter half of 2018, crypto venture funding has continued to fall for two consecutive quarters.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176531\/blockchain-venture-funding-falls-for-second-consecutive-quarter","publishDate":"2022-10-12T11:38:32","id":10288,"type":null,"title":"Blockchain venture funding falls for second consecutive quarter","category":["VENTURE CAPITAL"],"content":["For the first time since 2018, crypto venture funding has fallen for its second consecutive quarter.&nbsp;","This quarter, venture funding for crypto startups dropped by roughly 35% to $6.2 billion, following&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/157648\/blockchain-venture-funding-declined-in-q2-the-block-research\" data-v-f87c67ca=\"\">a 22% decline<\/a>&nbsp;in Q2 — according to <a href=\"https:\/\/www.theblockresearch.com\/q322-blockchain-venture-funding-and-ma-recap-176212?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">a new report<\/a> released today by The Block Research.","Prior to this period, venture capitalists continued to heap cash on the sector — recording seven consecutive quarters of growth. This quarter-on-quarter drop in funding confirms that funding for the sector has receded, and investors weary of the downturn are no longer as loose with their pursestrings as in the heady bull market days of 2021.&nbsp;","","","The last time this type of drop happened was in the latter half of 2018, during a previous bear market when the price of BTC — a key metric of the healthiness of the crypto market as a whole — hit a low&nbsp;<a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\" data-v-f87c67ca=\"\">below $4,000<\/a>&nbsp;after reaching an all-time high of more than $19,000 at the end of 2017.","Along with the amount of funding, the number of VC deals also took a sharp turn — declining by 22% quarter-on-quarter. Previously, the number of deals in the sector had increased for three consecutive quarters.&nbsp;","The mid to late-stage deal flow appears to be particularly hard hit by current market conditions. There was only one late-stage deal last quarter, compared to 13 in Q2 — a 92% drop. Startups granted mid-stage deals were also similarly hard to come by, with funding dropping by approximately 63%, and with only 11 deals compared to Q2's 30.&nbsp;","","","Still, while every subsector saw seed-stage deals decline, infrastructure startups raising seed rounds increased by approximately 24%.&nbsp;Today, two infrastructure firms — <a href=\"https:\/\/www.theblock.co\/post\/176510\/web3-developer-platform-settlemint-raises-e16-million-as-it-expands-to-japan\" data-v-f87c67ca=\"\">SettleMint<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/176555\/circle-backs-blockchain-developer-platform-tatum-in-42-million-raise\" data-v-f87c67ca=\"\">Tatum<\/a> — raised €16 million and $42 million rounds, respectively.&nbsp;","Compared to previous bear markets, we are yet to see the amount of cash injected into the crypto sector plumb to pre-2021 levels. As the report points out, nearly $15.8 billion has been invested over the past two quarters. That's more than all of the venture funding from 2017 to 2020, combined — when $15.3 billion was raised by the sector.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"92%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$19,000","content":"MONEY"},{"type":"22%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"63%","content":"PERCENT"},{"type":"latter half of 2018","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"24%","content":"PERCENT"},{"type":"$4,000","content":"MONEY"},{"type":"$15.3 billion","content":"MONEY"},{"type":"$15.8 billion","content":"MONEY"},{"type":"last quarter","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"$42 million","content":"MONEY"},{"type":"$6.2 billion","content":"MONEY"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}