{"summary":"Coinbase implemented another round of layoffs today, bringing the total number of cuts at the exchange to over 2,000 since June.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200383\/coinbase-to-cut-20-of-staff-in-latest-round-of-layoffs","publishDate":"2023-01-10T07:02:30","id":10293,"type":null,"title":"Coinbase to cut 20% of staff in latest round of layoffs","category":["COMPANIES"],"content":["Coinbase has implemented another round of layoffs, affecting 950 employees and reducing its operating expenses by 25%.","After examining the firm's prospects for 2023, Coinbase CEO Brian Armstrong <a href=\"https:\/\/www.coinbase.com\/blog\/a-message-from-ceo-and-co-founder-brian-armstrong-to-coinbase-employees\" data-v-f87c67ca=\"\">said<\/a>, \"It became clear that we would need to reduce expenses to increase our chances of doing well in every scenario.\" Armstrong added that, while the decision to cut staff was difficult, \"there was no way to reduce our expenses significantly enough, without considering changes to headcount.\"","Coinbase cut 1,100 jobs, or 18% of its workforce, in June 2022 and 60 employees in November 2022.","The exchange estimates its plan will cost between $149 million and $163 million in restructuring expenses relating to these actions, <a href=\"https:\/\/d18rn0p25nwr6d.cloudfront.net\/CIK-0001679788\/2f0eb2cd-0f3c-4a4c-a23a-e715caf96394.pdf\" data-v-f87c67ca=\"\">according<\/a> to its 8K filing. Around $58 to $68 million of this will consist of cash charges related to employee severance and other termination benefits. Stock-based compensation expenses related to the layoffs will be between $91 million and $95 million.&nbsp;","Coinbase expects to recognise these expenses in the first quarter of this year.&nbsp;","Armstrong also noted that crypto trended downward throughout 2022, along with a turbulent macroeconomic backdrop — as the U.S. Federal Reserve brought interest rates to 14-year highs to tackle red-hot inflation.","Furthermore, there was a fallout from unscrupulous actors in the crypto industry, and Armstrong said there's a chance of further contagion.&nbsp;","Coinbase is just the latest firm to announce layoffs. Last week Genesis Trading <a href=\"https:\/\/www.theblock.co\/post\/199576\/genesis-cuts-30-of-staff-in-latest-round-of-layoffs\" data-v-f87c67ca=\"\">announced<\/a> a fresh round of layoffs, reducing its workforce by 30%.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"$95 million","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$58","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"18%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$68 million","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"$91 million","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"$149 million","content":"MONEY"},{"type":"$163 million","content":"MONEY"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Adam Morgan McCarthy","The Block"]}