{"summary":"Lido integrated support for wrapped staked ETH on Layer 2 networks with a monthly rewards program to incentivize users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175594\/lido-launches-support-for-staked-eth-on-layer-2-integrations","publishDate":"2022-10-07T13:53:10","id":10296,"type":null,"title":"Lido launches support for staked ETH on Layer 2 integrations","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">The staking protocol will incentivize users to transact with wstETH with a monthly 150,000 LDO token reward pool that will be allocated across partnered DeFi networks.<\/span>","<br data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<span data-v-f87c67ca=\"\">Leading staking service provider Lido will now support the bridging of assets to Layer 2 protocols, it&nbsp; <a href=\"https:\/\/twitter.com\/LidoFinance\/status\/1578085157768134659?s=20&amp;t=3Z32EBykwrKYFahee6MSvw\" data-v-f87c67ca=\"\">announced<\/a> on Twitter.<\/span>","<span data-v-f87c67ca=\"\">Lido allows users to stake ETH and receive staked ETH (stETH) in return. The new changes to Lido introduced wrapped staked ETH (wstETH), a token that can be bridged to Layer 2 networks Arbitrum One and Optimism, and that will accommodate ease of integration across DeFi partners while preserving the unique properties of stETH, according to Lido. <a href=\"https:\/\/help.lido.fi\/en\/collections\/3641672-lido-on-l2\" data-v-f87c67ca=\"\">Guides<\/a> are offered to users, with instructions on how to wrap stETH for wstETH.<\/span>","<span data-v-f87c67ca=\"\">To incentivize participation, on Oct. 7, 150,000 LDO tokens will be allocated on a monthly basis to fuel wsETH rewards across partner networks, beginning with mining liquidity incentives across DeFi platforms including Beethoven X, Balancer, Curve Finance, Kyber Network and Velodrome.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Layer 2 networks Arbirtum and Optimism have seen a surge in transaction volume since they launched in 2021, with both recently peaking above 200,000 daily transactions, data from The Block Research show. <\/span>","<span data-v-f87c67ca=\"\">By integrating with Layer 2 networks, Lido users can avoid congestion, and high gas prices on the Ethereum network, and can instead process them on adjacent networks designed to operate alongside Ethereum. This will help manage transaction volume from the blockchain.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"Kyber Network","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 7","content":"DATE"},{"type":"Balancer","content":"LOCATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}