{"summary":"Kiln has closed a $17 million funding round led by 1kx, with participation from Crypto.com, IOSG, Wintermute Ventures, KXVC and LBank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273329\/kiln-staking-funding-round","publishDate":"2024-01-18T07:01:31","id":10291,"type":null,"title":"Kiln raises $17 million in latest funding round to expand crypto staking platform","category":["VENTURE CAPITAL"],"content":["Institutional crypto staking platform Kiln has closed a $17 million funding round led by 1kx, with participation from Crypto.com, IOSG, Wintermute Ventures, KXVC and LBank.","The round also included further contributions from all its existing investors, such as Kraken Ventures, GSR and Avon Ventures — a venture capital fund affiliated with FMR LLC, the parent company of Fidelity Investments, a spokesperson for Kiln told The Block.","This latest investment brings Kiln’s total funding to $35 million, having previously <a href=\"https:\/\/www.theblock.co\/post\/190196\/kraken-and-consensys-back-staking-platform-kiln-in-17-million-round\" data-v-f87c67ca=\"\">raised<\/a> $17.6 million in 2022 from Illuminate Financial, LeadBlock Partners, Sparkle Ventures, Alven and Blue Yard Capital, among others.","Kiln would not disclose a valuation for the round. However, the platform has increased its staked assets under management by more than five times in 2023 to reach $4.2 billion, the spokesperson said, having integrated with multiple custody solutions, wallets and exchanges over the past year.","Kiln plans to use the capital to fund its global expansion plans, including growing its APAC division following the opening of its regional headquarters in Singapore in Q1, according to a statement.","“Our mission is to democratize value creation in the digital assets ecosystem, providing millions of users with easy access to rewards through our platform. We have an exciting lineup of products and upcoming expansion plans, including the establishment of an office in Singapore,\" Kiln co-founder and CEO Laszlo Szabo said.","The funding will also be used to further product development by encompassing additional reward mechanisms in DeFi. “We are currently developing a product in the DeFi space, enabling our integrator customers (wallets, exchanges, custodians) to monetize stablecoin rewards opportunities,” Kiln’s spokesperson explained.","Kiln’s staking platform enables institutional clients to stake assets and offer white-label solutions to their own customers. Though it supports multiple proof-of-stake blockchains, the majority of Kiln’s staked assets are on Ethereum, worth over $3.1 billion, according to its Dune Analytics <a href=\"https:\/\/dune.com\/kiln\/summary\" data-v-f87c67ca=\"\">dashboard<\/a>.","\"Financial institutions will become a dominant force in crypto, leveraging the immense market opportunity as they stake on behalf of their customers,” 1kx Founding Partner Christopher Heymann said.","Kiln is also now the largest operator of Ethereum validator nodes, according to <a href=\"https:\/\/www.rated.network\/?network=mainnet&amp;view=nodeOperator&amp;timeWindow=all&amp;page=1\" data-v-f87c67ca=\"\">Rated<\/a> — representing some 4% of the Ethereum network.","In September, Coinbase Cloud <a href=\"https:\/\/www.theblock.co\/post\/250170\/coinbase-cloud-staking\" data-v-f87c67ca=\"\">integrated<\/a> Kiln’s on-chain staking protocol to offer native ether staking below the 32 ETH minimum. Conventionally, native ether staking requires a minimum of 32 ETH ($81,000 at current prices) to establish a single network validator — a prohibitive barrier to entry for many potential participants.","Utilizing specialized smart contracts, Kiln enables crypto users to stake smaller amounts. It permits pooling stakes to collectively reach the 32 ETH minimum, offering an alternative to similar flexible staking options from liquid staking protocols like Lido and Rocket Pool.","Kiln also collaborated with Ledger Live and Crypto.com for similar integrations later last year.","“As we looked to launch our pooled staking feature within our DeFi wallet, Kiln was the ideal partner for us to work with,” Crypto.Com President and COO Eric Anziani said.","<em data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"April 2023","content":"DATE"},{"type":"Illuminate Financial","content":"ORGANIZATION"},{"type":"LeadBlock Partners","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"$4.2 billion","content":"MONEY"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Fidelity Investments","content":"ORGANIZATION"},{"type":"Eric Anziani","content":"PERSON"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wintermute Ventures","content":"ORGANIZATION"},{"type":"$81,000","content":"MONEY"},{"type":"Blue Yard Capital","content":"ORGANIZATION"},{"type":"Laszlo Szabo","content":"PERSON"},{"type":"Alven","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"Christopher Heymann","content":"PERSON"},{"type":"$17.6 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Avon Ventures","content":"ORGANIZATION"},{"type":"Sparkle Ventures","content":"ORGANIZATION"},{"type":"$17 million","content":"MONEY"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"Coinbase Cloud","content":"ORGANIZATION"},{"type":"FMR LLC","content":"ORGANIZATION"}],"hashtag":["COINBASE","ETHEREUM","STAKING FIRMS"],"authors":["James Hunt","The Block"]}