{"summary":"A digital pound platform would give authorities visibility into banks and not users, a treasury minister said in a Parliament meeting.\nA consultation paper on a UK central bank digital currency will be published by the government in the coming weeks, in cooperation with the Bank of England.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200397\/digital-pound-track-transactions","publishDate":"2023-01-10T07:40:15","id":1029,"type":null,"title":"Digital pound won&#x27;t track retail transactions, UK minister says","category":["International Policymaking"],"content":["<span data-v-f87c67ca=\"\">A UK minister moved to quell concerns that a digital pound issued by the Bank of England could be used to create a<\/span><span data-v-f87c67ca=\"\"> “surveillance state” where the government can track all citizens' spending.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If the UK decides to move forward with a retail-focused central bank digital currency [CBDC], it will be “a platform model that wouldn't allow the government to know individual transaction data,” Andrew Griffith, Economic Secretary to the Treasury, said in evidence to a Parliamentary select committee.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Intermediaries like banks will issue a wallet that individuals would use, he assured members of Parliament. The government wouldn't have visibility on the end user's actions, except under existing measures to protect against money laundering or fraud.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The government takes these concerns very seriously and will proceed on a design basis that fully accommodates those concerns about privacy,” Griffith said.<\/span>","<span data-v-f87c67ca=\"\">A consultation on CBDCs from the UK government and the Bank of England will be published in the coming weeks, the minister said, as well as an additional consultation on crypto regulation more generally.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Aside from the user-facing retail function, a wholesale CBDC for payment settlements is also in consideration.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“A <\/span><span data-v-f87c67ca=\"\">central bank settlement system through sovereign digital coin is likely to be one of the first use cases,” Griffith said. However, he noted that stablecoins will be able to provide that function far before a digital pound comes along.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Financial Services and Markets Bill, which is scheduled for a second reading in the House of Lords later today, covers the regulation of stablecoins in the UK and increases crypto asset supervision under regulators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Griffith set the intention to build out a regime for crypto assets and stablecoins “that foster growth and innovation” in 2023, though suggested that no new legislation is likely to come out this year.<\/span>","<em data-v-f87c67ca=\"\">Benjamin Robertson assisted with reporting.<\/em>"],"hashtag":["FCA","UK PARLIAMENT"]}