{"summary":"New questions emerge for the whole crypto lending industry, which is likely to face new reporting requirements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117140\/secs-handling-of-coinbase-lend-signals-sea-change-for-us-crypto-lending","publishDate":"2021-09-09T13:17:10","id":10290,"type":null,"title":"SEC&#x27;s handling of Coinbase Lend signals sea change for US crypto lending","category":["REGULATION"],"content":["Crypto lenders may be facing the same fate as ICO issuers.","Brian Armstrong, the CEO of leading crypto exchange Coinbase, took to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/116888\/coinbase-sec-crypto-yield-product\" data-v-f87c67ca=\"\">Twitter<\/a> on Tuesday night to criticize the Securities and Exchange Commission’s handling of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/110032\/coinbase-rolls-out-high-yield-usdc-product-taking-aim-at-fintech-offerings\" data-v-f87c67ca=\"\">Coinbase’s proposed <\/a>Lend product.","Coinbase Lend is, in principle, a high-interest savings account for USDC, the USD-pegged stablecoin administered by the Centre consortium, backed by Coinbase as well as crypto startup Circle.","Similar products already exist on the market. Gemini Lend is another that already exists at a competing U.S. exchange. Crypto neobank BlockFi has seen a range of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/113124\/kentucky-regulator-blockfi-interest-security\" data-v-f87c67ca=\"\">state securities regulators<\/a> train their sights on its interest account offering. However, federal authorities in the U.S. have not yet entered the public field to this extent.","According to Armstrong, Coinbase sought to get the SEC’s approval before launching in a few weeks. “They responded by telling us this lend feature is a security. Ok - seems strange, how can lending be a security?” said Armstrong.","A subsequent <a href=\"https:\/\/blog.coinbase.com\/the-sec-has-told-us-it-wants-to-sue-us-over-lend-we-have-no-idea-why-a3a1b6507009\" data-v-f87c67ca=\"\">blog post<\/a> from Paul Grewal, the firm’s chief legal officer, provided more legal details.The SEC had sent the firm a notice that it intends to sue them if they launch their new yield product.","As Grewal wrote:","“Coinbase’s Lend program doesn’t qualify as a security — or to use more specific legal terms, it’s not an investment contract or a note. Customers won’t be ‘investing’ in the program, but rather lending the USDC they hold on Coinbase’s platform in connection with their existing relationship.“","He continued to criticize the SEC for responding to their requests by directing the firm to <i data-v-f87c67ca=\"\">SEC v. Howey <\/i>and <i data-v-f87c67ca=\"\">Reves v. Ernst &amp; Young<\/i>. Those Supreme Court decisions respectively fleshed out the terms “investment contract” and “note,” which the opening of the 1933 Securities Act defined as securities.","The Howey test became famous among the crypto community as the SEC’s justification for intervening in the initial coin offering boom.","The Reves test is both newer, and newer in crypto, and spells potential trouble for lending products. Outside of a narrow list of exceptions, it classifies all notes as securities, with the burden of proof of exemption on the party offering the note","Coinbase seems to be looking for crypto-specific guidance, operating on the belief that the new technology justifies new guidance. The SEC, meanwhile, maintains resolute technological neutrality — its guiding documents date to 1933 and 1934.","Some are seeing Coinbase’s feud with the SEC as naive. Philip Moustakis, an attorney with Seward &amp; Kissel and formerly of the SEC’s enforcement division, told The Block:","“There’s plenty of case law on what kinds of notes constitute securities and what kind do not. That analysis does not change simply because a new technology is utilized in the issuance of a note. In existing law, notes are presumed to be securities.”","Similarly, Anderson Kill attorney Preston Byrne <a href=\"https:\/\/twitter.com\/prestonjbyrne\/status\/1435452184607576066\" data-v-f87c67ca=\"\">tweeted<\/a> that “‘Yield’ products are securities. They differ in no material respect from an unsecured bond. They just don’t use the name.”","Attorney and frequent crypto critic Frances Coppola noted: “Oddly enough, because of its history, the US doesn't like high-yield deposits to be unregulated, especially when the marketing target is naive retail investors, the interest payments rely on extremely risky speculative investment, and the FDIC is not involved.”","If the SEC has decided to treat crypto interest accounts and lending products as non-exempt notes or corporate bonds, those classifications would incur a whole different level of disclosure.","Cease and desist letters from state authorities to BlockFi already had the industry worried. The SEC, which has federal authority, bringing Coinbase, a publicly traded firm, to heel is a new expansion.","Indeed, Armstrong lamented that Coinbase had been unfairly singled out for being proactive with regulators. Moustakis disagreed with Armstrong’s argument that uneven enforcement was a sort of injustice, telling The Block:","“The SEC does not have unlimited resources. It has to bring enforcement actions that have a programmatic impact. That is, enforcement actions that will grab the attention of the public in such a way that will change the behavior of the public going forward.”","The move, however, was not totally unpredictable. SEC chair Gary Gensler has been clearly <a href=\"https:\/\/www.theblockcrypto.com\/post\/113416\/gensler-speech-crypto-defi-lending-sec\" data-v-f87c67ca=\"\">centering crypto lending<\/a> platforms in his speeches, alongside decentralized finance. The nature of DeFi makes it tougher to scrutinize — <a href=\"https:\/\/www.theblockcrypto.com\/post\/116633\/how-the-secs-reported-uniswap-labs-investigation-could-signal-a-new-era-of-enforcement\" data-v-f87c67ca=\"\">not that the SEC isn’t trying<\/a>.","A representative for Gemini declined to comment on the significance of Coinbase’s saga for Gemini Earn. The new developments could also prove significant for Celcius and Nexo, two international competitors to BlockFi.","On a longer horizon, the SEC’s stated focus on DeFi could encompass lending protocols as well.","Alex Christian, founder and CEO of lending platform Data Mynt, told The Block: “I've reached out to US regulators for years to no avail. Some regulators are keen on optics. The optics — absent legal action or guidance — lend arguably to market manipulation and scare tactics.”","A representative for Coinbase declined to go on the record with The Block.","When reached for comment, Byrne said that “if the issues BlockFi and Coinbase are having with regulators are any indication, I think it is likely we're going to see more activity in this area with the passage of time.” He further noted that Congress needs to step in to protect crypto lending in a fashion akin to bank lending.","Moustakis went even further, ominously referencing the SEC’s pursuit of ICO issuers.","“I think that what we’re going to see unfold in the context of notes is what we saw unfold in the context of investment contracts,” he remarked.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Data Mynt","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Alex Christian","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Centre consortium","content":"ORGANIZATION"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"SEC v. Howey <\/i>and <i data-v-f87c67ca=\"\">Reves v. Ernst &amp; Young","content":"ORGANIZATION"},{"type":"Philip Moustakis","content":"PERSON"},{"type":"Those Supreme Court","content":"ORGANIZATION"},{"type":"Anderson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"1934","content":"DATE"},{"type":"Preston Byrne","content":"PERSON"},{"type":"Byrne","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Gemini Earn","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"Frances Coppola","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"1933","content":"DATE"},{"type":"Seward &amp; Kissel","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["BLOCKFI","COINBASE","SEC","TRADFI BANKS"],"authors":["Kollen Post","The Block"]}