{"summary":"&quot;Tether is mostly at risk given its lack of regulatory compliance and transparency,&quot; JPMorgan analysts said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275643\/jpmorgan-tether-negative-crypto","publishDate":"2024-02-01T12:47:47","id":10295,"type":null,"title":"JPMorgan says Tether&#x27;s increasing dominance is negative for crypto","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">While the recent growth of the stablecoin market capitalization is encouraging, the increasing dominance of <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Tether <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248350\/tether-usdt-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Tether.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">USDT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.032%\n    <\/span><\/a> <!----><\/span><\/span> raises concerns, according to JPMorgan.<\/span>","\"Tether is mostly at risk given its lack of regulatory compliance and transparency,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Thursday. \"We therefore view the increasing concentration in Tether over the past year as a negative for the stablecoin universe and the crypto ecosystem more broadly.\"","Stablecoin issuers face regulatory risk around the world, the analysts said. In the U.S., the approval of <a href=\"https:\/\/www.theblock.co\/post\/272831\/usa-stablecoin-laws-2024-circle-ceo\" data-v-f87c67ca=\"\">the Clarity for Payment Stablecoins Act<\/a> is awaiting approval from Congress. Meanwhile, in Europe, there is an expectation of partial implementation of the Markets in Crypto Assets (MiCA) regulation in June of this year. Therefore, according to the analysts, stablecoin issuers who closely adhere to existing regulations stand to benefit from the impending regulatory scrutiny and potentially gain market share.","\"I'm happy to read that JPMorgan acknowledges the importance of Tether and the stablecoin technology created by our company,\" Tether CEO Paolo Ardoino told The Block. \"But it seems to me a bit hypocritical the talk about concentration coming from JPMorgan, the biggest bank in the world.\"","\"The success of Tether USDT is driven by its financial reliability, strong reserves and its commitment towards emerging markets and developing countries, in which entire communities are using USDT as a lifeline to defend their families from high inflation and the devaluation of their national currency,\" Ardoino added.","<span data-v-f87c67ca=\"\">Circle, the issuer of the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248353\/usd-coin-usdc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/usdc.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">USDC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.16%\n    <\/span><\/a> <!----><\/span> stablecoin, recently confidentially <\/span><a href=\"https:\/\/www.theblock.co\/post\/271907\/usdc-stablecoin-circle-ipo\" data-v-f87c67ca=\"\">filed for public listing<\/a> in the U.S. This move suggests Circle's intention to expand internationally and proactively prepare for the upcoming stablecoin regulations, according to the JPMorgan analysts.","Stablecoins act as a link between traditional finance and the crypto world, functioning like \"cash\" in crypto, the analysts said. Their expansion means more money entering crypto from traditional finance, more cash circulating in the crypto space, and a boost in collateral, making the crypto financial system more stable, they added.","However, <a href=\"https:\/\/www.theblock.co\/post\/275388\/tether-q4-attestation-report-excess-reserves?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Tether<\/a>'s increasing market share and regulatory uncertainties pose a downside for the market, according to the analysts.&nbsp;","Tether said <a href=\"https:\/\/www.theblock.co\/post\/275388\/tether-q4-attestation-report-excess-reserves\" data-v-f87c67ca=\"\">on Wednesday<\/a> that it reached a record $2.9 billion net profit in the fourth quarter and set an all-time high increase in excess reserves backing its USDT tokens in circulation.","","","Besides stablecoins, the analysts said venture capital funding is the other major source of capital for the crypto ecosystem. However, <a href=\"https:\/\/www.theblock.co\/post\/268094\/coinbase-galaxy-polygon-multicoin-other-crypto-vc-funding-outlook-2024\" data-v-f87c67ca=\"\">crypto funding<\/a> has subsided again in December 2023 and January 2024 after showing improvement last November. \"This likely reflects the capital constraints experienced by VC firms over the past two years as interest rates increased and as project valuations declined, making exits more difficult,\" the analysts said.","Crypto VC firms are now more careful in allocating capital, preferring mature projects and those focused on web3 infrastructure, the analysts said. They also noted that the increasing demand for AI has drawn investment away from blockchain and crypto projects.","<em data-v-f87c67ca=\"\">(Updates with comment from Tether CEO Paolo Ardoino).<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"+0.032%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Tether USDT","content":"ORGANIZATION"},{"type":"$2.9 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"December 2023","content":"DATE"},{"type":"fourth quarter","content":"DATE"},{"type":"U.S","content":"LOCATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"-0.16%","content":"PERCENT"}],"hashtag":["INVESTMENT FIRMS","TETHER","TRADFI BANKS","USDC"],"authors":["Yogita Khatri","The Block"]}