{"summary":"TRON now says it has overcollateralized USDD, which began life only one month ago as an algorithmic stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150006\/terra-fiasco-triggers-bigger-backstop-for-trons-stablecoin","publishDate":"2022-06-05T06:00:14","id":1030,"type":null,"title":"Terra fiasco triggers bigger backstop for TRON’s stablecoin","category":["STABLECOINS"],"content":["Following the total collapse of Terra’s algorithmic stablecoin in May, TRON this morning announced a plan to significantly increase the amount of capital backing up its own stablecoin.","USDD — at first a near-carbon copy of Terra’s algorithmic stablecoin UST — <a href=\"https:\/\/www.theblockcrypto.com\/post\/145231\/trons-new-stablecoin-usdd-goes-live\" data-v-f87c67ca=\"\">arrived on the TRON blockchain<\/a> on May 5. Initially designed to maintain its peg to the US dollar algorithmically, albeit with some backing, USDD&nbsp;will now be overcollateralized, according to TRON founder Justin Sun.","A reserve comprised of cryptocurrencies and other stablecoins has been amassed and will be maintained at a minimum of 130% of the total amount of USDD in issuance, he said. In a news release, TRON described that collateral ratio as “guaranteed,” and said that it would begin publishing real-time updates on the collateral ratio on <a href=\"https:\/\/tdr.org\/#\/\" data-v-f87c67ca=\"\">TRON DAO Reserve’s website<\/a> from June 5.&nbsp;","As things stand, according to a TRON spokesperson, the reserve contains 10,500 bitcoin (around $330 million), 240 million USDT, and 1.9 billion TRX, as well as 8.29 billion TRX in a burning contract.&nbsp;","“We want to upgrade USDD to a hybrid model,” said Sun. “So on the one side we have an algorithmic stablecoin — an algorithm to make the stablecoin stable — on the other hand we have TRON DAO Reserve.”","USDD was designed to incentivize arbitrageurs to keep its price pegged to that of the US dollar through trading between TRX, TRON’s token, and USDD — following the algorithmic stability blueprint. Like Terra, TRON had also signaled its intent to establish a reserve of billions of dollars’ worth of bitcoin and other cryptocurrencies to support USDD in extreme market conditions.","Still, that combination of safeguards proved spectacularly ineffective for Terra’s UST. The stablecoin, which was the third largest by issuance prior to its collapse, veered sharply away from its dollar peg in mid-May, taking down Terra’s LUNA with it and <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiuu_3Fm5D4AhXWxDgGHU5wCe0QFnoECAgQAQ&amp;url=https%3A%2F%2Fwww.ft.com%2Fcontent%2Fd459f435-edff-412c-85a5-0961d50aba69&amp;usg=AOvVaw2WzM8FthrYfYVm5ZJo-UiD\" data-v-f87c67ca=\"\">wiping out some $40 billion in value<\/a> in a matter of days.&nbsp;Billions of dollars in bitcoin were sold and unprecedented volumes of Terra’s native token LUNA issued in a frantic attempt to restore the peg, but to no avail.","Sun, however, contends that hope remains for USDD — which has already reached $667 million in total circulating supply — if it can be suitably backstopped.","“The reserve backing we’re using right now is highly diversified. It includes bitcoin and all different kinds of stablecoin. USDC [Circle’s stablecoin] will be a part of our reserve, but it will only be a small part of our reserve,” he said.&nbsp;","In its news release, TRON provided a full list of the assets in the reserve, which are bitcoin, TRX, USDC, USDT, TUSD and USDJ.&nbsp;","“All the Bitcoin addresses will be signed by signature so everybody will know those bitcoins belong to us,” Sun added.","In <a href=\"https:\/\/www.theblockcrypto.com\/news+\/144858\/very-stable-geniuses-the-race-to-build-regulation-proof-stablecoins\" data-v-f87c67ca=\"\">a previous interview<\/a>, Sun told The Block that building so-called \"decentralized\" stablecoins that cannot be interfered with by regulators is a pressing need for the crypto industry. &nbsp;","Asked whether he was tempted to simply abandon the USDD project in the aftermath of UST’s collapse, Sun said the Luna Foundation Guard — a Singapore-based non-profit that had raised billions of dollars in cryptocurrency to buttress UST — mismanaged the situation by trying to sell to panicked investors.","“We need to be one step before the market,” he said. “We want to basically participate in a role to stabilize the market — to decrease the volatility in the first place.”","Currently, the bulk of the reserve has been financed by TRON directly, but the company hopes to add external capital from investors soon, according to Sun.&nbsp;","Prior to its demise, holders of UST were able to park the stablecoin in Terra’s lending platform Anchor Protocol to earn interest rates of 20%, which many had flagged as unsustainable. TRON has a similar platform named JustLend. Currently, it offers annual interest rates of 17.67%, but Sun said he hopes to drive that higher — to “around 30%.”","<em data-v-f87c67ca=\"\">Correction: story updated to adjust TRON's holdings of bitcoin and USDT as outlined in the fourth paragraph.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"billions of dollars","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"TRON DAO Reserve","content":"ORGANIZATION"},{"type":"$667 million","content":"MONEY"},{"type":"June 5","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"130%","content":"PERCENT"},{"type":"Terra’s UST","content":"ORGANIZATION"},{"type":"Terra","content":"LOCATION"},{"type":"8.29 billion","content":"MONEY"},{"type":"17.67%","content":"PERCENT"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"May 5","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Justin Sun","content":"PERSON"},{"type":"TRON","content":"LOCATION"},{"type":"USDJ","content":"ORGANIZATION"},{"type":"USDD","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"mid-May","content":"DATE"},{"type":"TRON","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$330 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["JUSTIN SUN"],"authors":["Ryan Weeks","The Block"]}