{"summary":"Coinbase’s chief financial officer, Alesia Haas, spoke during a Citi event on Monday.\nHaas notably highlighted Coinbase’s interest in providing its users with broader access to decentralized finance (DeFi) apps.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124396\/coinbase-is-looking-at-support-for-third-party-defi-apps-on-its-platform-says-cfo","publishDate":"2021-11-15T14:50:53","id":1030,"type":null,"title":"Coinbase is looking at support for third-party DeFi apps on its platform, says CFO","category":["DeFi"],"content":["Coinbase's interest in decentralized finance has long been known, but new comments from the publicly traded crypto exchange's chief financial officer suggest that the company is eyeing a broader scope.","Alesia Haas spoke during a fintech-focused event hosted by Citi on Monday. Early in that appearance, Haas provided insight into the exchange's overall strategy, dividing it into three \"pillars.\" The third one, she said, centers around the Coinbase platform as one that users can access an array of applications and uses within.","\"The third pillar for us is crypto as an app platform, and here's where we serve the broader crypto ecosystem,\" Haas explained, going on to say:","Haas later spoke to the overarching relationship between Coinbase, a centralized platform run by a company, and DeFi, the composition of which is defined by ecosystems run by smaller development teams or token-holding governance stakeholders.","Still, Coinbase aims to become \"a bridge to DeFi,\" according to Haas:","Ultimately, the company thinks it \"can bring billions of users to DeFi by making it easy to use\" according to Haas.","Such an approach is perhaps unsurprising, given the exchange's support to DeFi protocol tokens and its participation in groups like the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101203\/coinbase-defi-alliance-membership\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">DeFi Alliance<\/a>. From a practical sense, it appears that Coinbase sees DeFi as an avenue for future business.&nbsp;","As Haas put it at one point: \"[W]e believe that Coinbase and DeFi can and will successfully grow and coexist.\""],"hashtag":["COINBASE"]}