{"summary":"The OECD&#x27;s latest report analyzed ‘crypto winter’ and found that more rules and international collaboration to prevent regulatory arbitrage are urgently needed. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195024\/oecd-calls-for-urgent-policy-action-following-series-of-crypto-firm-implosions","publishDate":"2022-12-14T14:31:34","id":10301,"type":null,"title":"OECD calls for ‘urgent policy action’ following series of crypto firm implosions","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">As the crypto industry becomes more closely linked to traditional finance, the next crypto collapse could cause broader financial instability, according to a new <a href=\"https:\/\/www.oecd-ilibrary.org\/finance-and-investment\/lessons-from-the-crypto-winter_199edf4f-en\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> from the Organisation for Economic Co-operation and Development.<\/span>","OECD researchers also added themselves to a growing chorus of experts arguing that the industry centered around decentralized technology is itself heavily concentrated among a small group of players.&nbsp;","Researchers behind the report assert that the failures of these firms exposed the interconnectivity between businesses in crypto. OECD experts write that “this increases risks of wide-scale disruption and contagion within the crypto-asset markets if any of these dominant players faces difficulties in the future.”","Decentralized finance is also more connected to exchanges than some advocates say, the report argues, calling centralized trading firms, \"<span data-v-f87c67ca=\"\">in many ways the lifeline of DeFi” <\/span><span data-v-f87c67ca=\"\">as they provide a source of funds and collateral for DeFi protocols.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For example, centralized exchanges are “in many ways the lifeline of DeFi.” <\/span><span data-v-f87c67ca=\"\">The report centers around the falls of crypto lending firm Celsius, hedge fund Three Arrows Capital, trading firm FTX and stablecoin issuer TerraUSD, incidents that left scars on the crypto industry this year. By mid-June, the crypto market value lost $ 1.7 trillion compared to its peak, according to OECD statistics.<\/span>","<span data-v-f87c67ca=\"\">The OECD is made up of representatives from 38 countries streamlines global economic standards. Its <\/span>framework on reporting on crypto taxation <a href=\"https:\/\/www.theblock.co\/post\/192150\/eu-crypto-taxation-leaked-proposal\" data-v-f87c67ca=\"\">influenced<\/a> European Union legislation this month.&nbsp;","<span data-v-f87c67ca=\"\">The new report, which takes lessons from the longer “crypto winter” that started before FTX's implosion, comes the day after FTX founder Sam Bankman-Fried was criminally <a href=\"https:\/\/www.theblock.co\/post\/194667\/disgraced-former-ftx-ceo-sam-bankman-fried-criminally-indicted\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">indicted<\/a>, the latest turn in a saga that has rocked the entire industry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Traditional finance has not been significantly affected by the turbulence in crypto markets since they are too small in comparison and not deeply linked — for now.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Should conditions change, a future instance of similar turmoil in a larger crypto-asset market could have implications for financial stability,” the report said. The OECD’s claims an “urgent need for policy action,” especially to protect retail investors due to the “disproportionate impact” on them. That call echoes <a href=\"https:\/\/www.theblock.co\/post\/176025\/g20-central-bankers-warn-stablecoins-arent-stable-recommend-action-around-crypto-assets\" data-v-f87c67ca=\"\">similar recommendations<\/a> from other international institutions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The OECD calls for international collaboration on crypto policy to avoid regulatory arbitrage opportunities and avoid fragmentation in regulation around the world.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Organisation for Economic Co-operation and Development","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$ 1.7 trillion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"OECD","content":"ORGANIZATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Inbar Preiss","The Block"]}