{"summary":"Matter Labs, the company behind zkSync, has raised $200 million in a Series C round led by Dragonfly and Blockchain Capital. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187503\/matter-labs-raises-200-million-to-boost-zksync-adoption-and-grow-its-team","publishDate":"2022-11-16T09:00:15","id":10302,"type":null,"title":"Matter Labs raises $200 million to boost zkSync adoption and grow its team","category":["CRYPTO ECOSYSTEMS"],"content":["Matter Labs, the parent company of Ethereum scaling protocol zkSync, has raised $200 million in a Series C round.&nbsp;","Blockchain Capital and Dragonfly led the investment, with participation from LightSpeed Venture Partners, Variant, and Andreessen Horowitz — who had led the previous $50 million Series B round — according to a statement.&nbsp;Matter Labs did not disclose the valuation.","The funds from its Series C round will be used to launch first-party projects built by Matter Labs itself, grow the Matter Labs team and fund projects built by external parties. It will also be used to start Matter University, which will act as its onboarding and education platform for users and builders.","This raise comes amidst a time of uncertainty in the crypto markets, as the fallout of FTX and Alameda continues to wreck havoc on the crypto markets.","“No matter how bad this bear market gets, we are well positioned to grow our team, ship our protocol, and ship our mission,” zkSync’s chief product officer Steve Newcomb told The Block.","The raise brings Matter Labs' total funding to $458 million. Matter Labs claims this latest funding round will give it enough runway to ensure capital is not a constraint as it focuses on developing its ecosystem and new early-stage product developments. &nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matter University","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"LightSpeed Venture Partners","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"Steve Newcomb","content":"PERSON"},{"type":"$458 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["ZKEVM","ZKSYNC"],"authors":["Mike Truppa","The Block"]}