{"summary":"The co-founders of Opyn, the DeFi options protocol that was sued by the Commodity Futures Trading Commission in September, are stepping down.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262952\/opyn-co-founders-to-step-down-citing-recent-cftc-action","publishDate":"2023-11-13T23:40:15","id":10318,"type":null,"title":"Opyn co-founders to step down citing recent CFTC action","category":["POLICY"],"content":["The co-founders of Opyn are stepping down after the DeFi options protocol was charged by the Commodity Futures Trading Commission in September.","CEO Zubin Koticha <a href=\"https:\/\/x.com\/snarkyzk\/status\/1724243580737499401?s=20\" data-v-f87c67ca=\"\">said in a post on X today<\/a> that he and co-founder Alexis Gauba had decided to leave crypto, citing the recent regulatory action against Opyn.","The CFTC said in September that <a href=\"https:\/\/www.theblock.co\/post\/249865\/cftc-settles-charges-against-defi-protocols-opyn-zeroex-and-deridex\" data-v-f87c67ca=\"\">it had filed and settled charges against Opyn and two other DeFi players<\/a>. Opyn was charged with several registration failures, failing to adopt a customer identification program and illegally offering leveraged and margined retail commodity transactions in digital assets. Opyn was ordered to pay a $250,000 penalty and to cease and desist from violating the Commodity Exchange Act and CFTC regulations.","“We spent the last six years working on incredible stuff that would’ve never been possible in TradFi — cutting edge work on the forefront of structured products and derivatives,” said Koticha in the post today. “We thought we were going to be in crypto for the rest of our lives. But, unfortunately and unexpectedly, this is the end of the road.”","He added that Andrew Leone, head of research at the firm, will take over as Opyn’s CEO. Leone previously spent six years as a vice president at Nomura, the Japanese bank, where he headed up VIX and structured volatility trading, according to his LinkedIn profile. &nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Koticha","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Alexis Gauba","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Andrew Leone","content":"PERSON"},{"type":"Zubin Koticha","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}