{"summary":"Polybase, a crypto startup developing a privacy-focused decentralized database, raised $2 million in a pre-seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213913\/polybase-web3-database-pre-seed-funding","publishDate":"2023-02-22T09:01:59","id":10319,"type":null,"title":"Web3 database developer Polybase raises $2 million in pre-seed funding","category":["DEALS"],"content":["Polybase, a crypto startup developing a privacy-focused decentralized database, raised $2 million in a pre-seed funding round.","6th Man Ventures led the round, with Filecoin developer Protocol Labs, Orange DAO, Alumni Ventures, NGC Ventures, CMT Digital and others participating, Polybase said Wednesday. The startup aims to build a web3 alternative to legacy platforms such as Google-owned Firebase and open-source databases such as Supabase and Postgres.","Polybase began raising for the pre-seed round last May and closed it in September, co-founder and CEO Sid Gandhi told The Block. It was a SAFE (simple agreement for future equity) round with a token side letter, he said, declining to comment on valuation.","Polybase was founded last year by Gandhi and Calum Moore. It is developing a decentralized database using zero-knowledge technology. Gandhi said web3 developers today mostly use centralized or web2 databases for storing structured data, defeating their purpose. \"Our vision is to become the default database for web3, enabling developers to build decentralized applications with trustless automation at 1000x lower cost than on-chain storage,\" he added.","Decentralized applications can use databases to store various data types, including user profiles and transaction history. For example, a web3 gaming application could use a decentralized database to store data such as player statistics, game preferences, and in-game assets while preserving the player's privacy and security.","Polybase uses zero-knowledge technology based on \"multiple implementations,\" said Gandhi, meaning it does not rely on a single partner. One of its partners includes <a href=\"https:\/\/www.theblock.co\/post\/126991\/polygon-acquires-mir-protocol-400-million-zk-rollups\" data-v-f87c67ca=\"\">Polygon<\/a> for the potential use of its Miden technology, a STARK-based, Ethereum-compatible ZK-rollup. \"However, we are not tied to the Polygon ecosystem in any way and our architecture is multi-chain,\" Gandhi clarified.","Polybase is currently live on testnet and its mainnet is expected to launch in the coming weeks. To that end, the startup is also looking to expand its current team of five people by hiring a few people in the engineering and marketing functions, said Gandhi.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sid Gandhi","content":"PERSON"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"Polybase","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Alumni Ventures","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"Gandhi","content":"PERSON"},{"type":"Orange DAO","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Calum Moore","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DATA PROVIDERS","DECENTRALIZED INFRASTRUCTURE","DEVELOPER TOOLS","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}