{"summary":"Investors who have staked their Luna tokens won&#x27;t be able to sell for 21 days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146279\/as-luna-holders-watch-the-token-slide-many-wont-be-able-to-cash-out-for-weeks","publishDate":"2022-05-11T07:58:33","id":10314,"type":null,"title":"As Luna holders watch the token slide, many won’t be able to cash out for weeks","category":["MARKETS"],"content":["After the stablecoin TerraUSD (UST) lost its peg to the US dollar this week, many investors in the related token Luna (LUNA) have been left unable to sell.&nbsp;","Stuck on the sidelines are those who own Luna tokens and have them staked. These holders are watching the value of their tokens sink and aren’t able to do anything about it.","According to <a href=\"https:\/\/terra.smartstake.io\/history\" data-v-f87c67ca=\"\">Terra Analytics<\/a>, around 152 million LUNA is being staked on the network — excluding liquid staking through Lido, where tokens aren’t as tied up . That represents 30% of the circulating supply of LUNA.&nbsp;","When coins are staked, they are locked up indefinitely and the holder receives tokens as rewards. When the holder chooses to unstake them, they are able to get their tokens back after a period of time and then no longer receive rewards. Staking periods can range between different cryptocurrencies, but for Luna, it’s 21 days that you have to wait to get your tokens back.","Normally this isn’t a big problem. While crypto prices are volatile, stakers typically accept this and are used to day-to-day fluctuations. If the market starts declining, worried holders can unstake their tokens and cash out within a few weeks.","Yet the collapse of Luna and UST has happened incredibly quickly and with painful results. As UST has lost its peg to the dollar, a lot of investors have tried to cash out in case the stablecoin’s price drops even further. While some have sold on the open market, others have swapped 1 UST for $1 of Luna (the key mechanism designed to keep the stablecoin, well, stable).","Yet this process mints a lot of Luna. In the last two days, more than 145 million LUNA has been minted to enable stablecoin holders to cash out. This has worsened the price drop of Luna as more tokens have flooded the market, alongside normal traders selling the token based on the current negative sentiment.","Today alone, the price of Luna has dropped from $31 to $2 — down 93%. The token has lost 97% of its value in the past week. This price crash has happened faster than Luna stakers have been able to blink, let alone unstake their coins and cash out.&nbsp;","“My Luna, though, which is still staked and will take days before being removed, will stay there forever, I guess,” Artem Sinyakin, co-founder of crypto media company Oak Invest, told The Block.&nbsp;","Sinyakin added that he was disappointed this collapse might cause people to leave crypto and dissuade other people from getting involved with it. He also said it puts stablecoins under the light for regulators — something we saw yesterday with US Treasury Secretary Janet Yellen using UST as an example to ask for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/146048\/us-treasury-secretary-yellen-points-to-ust-slip-asks-for-new-stablecoin-legislation-by-the-end-of-2022\" data-v-f87c67ca=\"\">greater stablecoin regulation<\/a>.","“Just feeling numb,” 0xKowloon, a pseudonymous developer at CoinGecko, told The Block. “Already wanted to sell a few weeks ago but didn't end up doing it precisely because of the amount of time it takes to unstake.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$31","content":"MONEY"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"Oak Invest","content":"ORGANIZATION"},{"type":"last two days","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"97%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"Terra Analytics","content":"ORGANIZATION"},{"type":"$2","content":"MONEY"},{"type":"93%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"Luna","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Artem Sinyakin","content":"PERSON"}],"hashtag":["DO KWON"],"authors":["Tim Copeland","The Block"]}