{"summary":"Kyle Davies is arguing that his citizenship status means he is no longer subject to a U.S. court&#x27;s jurisdiction.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242675\/3ac-co-founder-says-us-court-can-no-longer-tell-him-what-to-do","publishDate":"2023-08-01T17:57:03","id":10312,"type":null,"title":"3AC co-founder says US court can no longer tell him what to do","category":["COMPANIES"],"content":["Three Arrows Capital co-founder <a href=\"https:\/\/www.theblock.co\/post\/237613\/kyle-davies-evokes-karma-says-hell-donate-some-opnx-earnings-to-3ac-creditors\" data-v-f87c67ca=\"\">Kyle Davies<\/a> is attempting to fight a motion to hold him in contempt of court by arguing that U.S. laws no longer apply to him.","The U.S.-born and raised Davies told a judge in U.S. Bankruptcy Court for the Southern District of New York on Tuesday that he renounced his U.S. citizenship in late 2020 and no longer views himself as under the jurisdiction of U.S. courts.","“For the avoidance of doubt, I am not subjecting myself to, or accepting the jurisdiction of, the Courts in the United States,” Davies wrote.","The move comes after months of attempts to force Davies and 3AC co-founder Su Zhu to cooperate with the effort to liquidate their failed hedge fund and repay billions to investors. Liquidators in the British Virgin Islands put the company, which has assets in the British Virgin Islands, into Chapter 15 bankruptcy protection in the U.S., in order to benefit from the legal shields against creditors provided by U.S. bankruptcy.","Davies and Zhu claim to have cooperated with the bankruptcy process, but the liquidators overseeing the wind-down of their fund say they’ve withheld crucial documents for months.","Despite the federal judge presiding over the case going to the unusual length of approving subpoenas of Zhu and Davies in December, this is the first time Davies has cited his renounced citizenship as cause for his lack of response. After failing to respond to the subpoena, lawyers for 3AC’s liquidators asked for Davies to be held in contempt of court, possibly subjecting him to a $10,000 per day fine until he responds, as well as paying legal fees for the liquidators related to his refusal to reply.","The June effort to hold him in contempt came a few days after a <a href=\"https:\/\/www.nytimes.com\/2023\/06\/09\/technology\/three-arrows-cryto-bali.html\" data-v-f87c67ca=\"\">New York Times profile<\/a> of the 3AC founders, featuring their retreat to Bali after costing investors billions with the implosion of their investment fund. The contempt motion also notes Davies frequently makes himself available to discuss the situation with Twitter users, despite allegedly not cooperating with those charged with unwinding his firms’ debts.","But on Tuesday, Davies and his lawyers argued that the court cannot enforce a subpoena against him because he is no longer a citizen, and a specific rule around subpoenas in bankruptcy cases “does not allow for service of persons outside the United States who are not U.S. nationals or residents.”","Lawyers representing Davies also argue that he was not properly served the subpoena, because it went to his Singaporean lawyer, not directly to him.","Where that leaves the ongoing U.S. portion of the bankruptcy remains unclear. A hearing on the motion is scheduled for Aug. 8.","U.S. financial regulators and criminal prosecutors can still issue enforcement actions or pursue indictment of foreign nationals believed to have committed crimes in the U.S., or involving U.S. citizens or entities. 3AC was reportedly under investigation by regulators late last year. The fund's failure was a precursor to even larger crypto collapses, like FTX's implosion.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Aug. 8","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$10,000","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Bali","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Davies","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BANKRUPTCY FILINGS","CFTC","COURT HEARINGS","FTX","GOLDMAN SACHS","SAM BANKMAN-FRIED","SEC"],"authors":["Colin Wilhelm","The Block"]}