{"summary":"Developers of Bitcoin&#x27;s Lightning Network have issued an emergency fix for a critical bug that led to downtime for some nodes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182145\/lightning-network-developers-critical-bug-node-downtime","publishDate":"2022-11-02T10:22:14","id":10317,"type":null,"title":"Lightning Network developers fix critical bug that caused node downtime","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Developers of Bitcoin's Lightning Network have issued a fix for a critical bug that led to downtime for some nodes.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The fix came after a user, identified as <span data-v-64237c43=\"\" data-v-f87c67ca=\"\">Bitmatrix founder Burak Keceli<\/span>, made a large 998-of-999 multi-signature Taproot transaction — one that required 998 private key signatures to send the bitcoin. This was an abnormally large number of signers, and Lightning nodes failed to support the multisig transaction of that size.<\/span>","Lightning Labs <a href=\"https:\/\/twitter.com\/lightning\/status\/1587443868617818113\" data-v-f87c67ca=\"\">said<\/a>&nbsp;the transaction triggered a series of events that completely disrupted the ability for nodes on the network to sync with each other, though it did not result in a loss of funds. As soon as the transaction was made, the network’s nodes rejected the specific block that included it, as well as subsequent blocks that came after it.","<span data-v-64237c43=\"\" data-v-f87c67ca=\"\">Keceli<\/span> made the same kind of transaction last month, <a href=\"https:\/\/www.theblock.co\/post\/176085\/large-bitcoin-transaction-briefly-took-down-bulk-of-lightning-network\" data-v-f87c67ca=\"\">causing<\/a> similar issues for the network — although due to a slightly different bug.","<span data-v-f87c67ca=\"\"><span data-v-64237c43=\"\" data-v-f87c67ca=\"\">Keceli<\/span> knew in advance their transaction would disrupt the network. Rather than disclosing the security bug in a responsible disclosure practice called CVE, short for Common Vulnerabilities and Exposures, <span data-v-64237c43=\"\" data-v-f87c67ca=\"\">Keceli<\/span> proceeded to make the transaction anyway. He&nbsp;<\/span><span data-v-f87c67ca=\"\">defended his actions, claiming the act was for the “ultimate good.” <\/span>","<span data-v-f87c67ca=\"\">\"As a Bitcoin wizard, I summoned chaos theory in the name of darkness for the latter good,\" <a href=\"https:\/\/twitter.com\/brqgoo\/status\/1587804339590119424\" data-v-f87c67ca=\"\">said<\/a> <span data-v-64237c43=\"\" data-v-f87c67ca=\"\">Keceli in a tweet.<\/span>&nbsp;\"Responsible CVE is weaker magic,<span data-v-64237c43=\"\" data-v-f87c67ca=\"\">\" he added.<\/span><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The Lightning Network is a Layer 2 network designed to get around Bitcoin’s slow transaction speeds and high fees. Users can port bitcoin to Lightning and transact with each other via payment channels at a significantly cheaper price than on the main network. Currently, there is 5,000 bitcoin ($100 million) locked in payment channels, per<\/span> <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data<\/span><\/a><span data-v-f87c67ca=\"\"> from The Block.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Keceli","content":"PERSON"},{"type":"Burak Keceli","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Vishal Chawla","The Block"]}