{"summary":"Gaming project Aavegotchi revealed plans to launch its own blockchain called Gotchichain in the third quarter of this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets","publishDate":"2023-03-22T09:00:51","id":10322,"type":null,"title":"Gaming project Aavegotchi to release own blockchain with Polygon Supernets","category":["CRYPTO ECOSYSTEMS"],"content":["Gaming project Aavegotchi revealed plans to launch its own blockchain called Gotchichain. The network will leverage Polygon Supernets, which is Polygon's service that allows projects to create their application-specific chains.","Aavegotchi is a trading game that resembles the Tamagotchi line of toys from the 1990s. Unlike their real-world counterparts, Aavegotchis carry value in the form of staked tokens and wearables, and they can be traded like any other blockchain token.","The team said in a blog on Wednesday that this release allow developers to create Aavegotchi-themed, gaming-based decentralized apps on its dedicated network.","\"This partnership will allow us to utilize Polygon's Supernets technology to create a blockchain optimized for gaming, with faster transaction times, lower gas fees, and superior scalability,\" the team <a href=\"https:\/\/blog.aavegotchi.com\/introducing-gotchichain-aavegotchi-x-polygon-supernets\/\" data-v-f87c67ca=\"\">noted<\/a>.","Supernets (previously Polygon Edge) is a Polygon platform that lets teams to create their blockchain networks using a software development kit (SDK).","All Aavegotchi assets will continue to be minted on the Polygon sidechain but can be bridged over to Gotchichain to be used in gaming apps, the team added. Aavegotchi’s governance token aavegotchi (GHST) will serve as the gas token for all transactions.","The team added that it is targeting an early third quarter of 2023 release for Gotchichain. Aaavegotchi’s team originally launched on the Polygon sidechain in January 2021.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SDK","content":"ORGANIZATION"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Aavegotchi","content":"PERSON"},{"type":"January 2021","content":"DATE"},{"type":"1990s","content":"DATE"}],"hashtag":["POLYGON"],"authors":["Vishal Chawla","The Block"]}