{"summary":"Through a partnership with Bitfy, a startup that was funded by the bank&#x27;s VC arm, clients can use the app to instantly convert crypto in their account into reais to pay and settle a tax bill.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210837\/brazils-oldest-bank-says-you-can-now-pay-your-taxes-with-crypto","publishDate":"2023-02-11T19:42:19","id":10328,"type":null,"title":"Brazil&#x27;s oldest bank says you can now pay your taxes with crypto","category":["COMPANIES"],"content":["Banco do Brasil, the South American country's oldest bank, says it's now possible to do what many blockchain enthusiasts have long wanted — the ability to pay the taxman in crypto.","Through a partnership with Bitfy, a startup that was funded by the bank's VC arm, clients can use the app to instantly convert crypto in their account into the local currency to pay and settle a tax bill.","\"This partnership makes it possible to expand the use and access to the ecosystem of digital assets with national coverage,\" Bitfy CEO Lucas Schoch said Friday in a <a href=\"https:\/\/www.bb.com.br\/pbb\/pagina-inicial\/imprensa\/n\/67243\/bb-oferece-solucao-de-pagamento-de-tributos-com-criptomoedas#\/\" data-v-f87c67ca=\"\">statement<\/a> from Banco do Brasil, which is partially owned by the state.&nbsp;","Brazil has <a href=\"https:\/\/www.theblock.co\/post\/197036\/brazils-cryptocurrency-regulation-set-to-become-law-at-midnight\" data-v-f87c67ca=\"\">been a leader<\/a> in digital payment innovations with its PIX system and passed new crypto-friendly legislation last year. The central bank is currently testing a digital currency it plans to issue next year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitfy","content":"PERSON"},{"type":"Banco do Brasil","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Lucas Schoch","content":"PERSON"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}