{"summary":"Binance, one of the largest crypto exchanges by volume, suffered a massive hack this week\nThe hack was the sixth-largest in crypto history, with around 7,000 bitcoins ($41 million) stolen\nThe exchange has said its SAFU insurance fund will cover its losses and that user funds won’t be affected","author":["Eric Meltzer","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/22716\/proof-of-work-binance-gets-hacked","publishDate":"2019-05-09T14:31:01","id":1033,"type":null,"title":"Proof of Work: Binance gets hacked","category":["Bitcoin"],"content":["So for now, this has been a koan-like lesson on the nature of Nakamoto consensus and its lack of transaction finality, but we didn’t get to see how Bitcoin would behave in a particularly extreme scenario.","More next week, as always thanks for reading!","<strong data-v-f87c67ca=\"\"><a href=\"https:\/\/bitcoinops.org\/en\/newsletters\/\" data-v-f87c67ca=\"\">Optech<\/a>&nbsp;on Bitcoin<\/strong>","<strong data-v-f87c67ca=\"\">James from Summa<\/strong>","<em data-v-f87c67ca=\"\">Summa builds tools to exchange crypto in a convenient and trustless fashion.<\/em>","<strong data-v-f87c67ca=\"\">Tony from Kadena<\/strong>","<em data-v-f87c67ca=\"\">Kadena is building Pact, a formally verifiable smart-contracting language for financial applications, and Chainweb, a PoW blockchain that uses multiple chains in parallel to increase throughput.<\/em>","<strong data-v-f87c67ca=\"\">Aviv from Spacemesh<\/strong>","<em data-v-f87c67ca=\"\">Spacemesh is a programmable cryptocurrency powered by a novel proof-of-space-time consensus protocol.<\/em>","<strong data-v-f87c67ca=\"\">JZ from Decred<\/strong>","<em data-v-f87c67ca=\"\">Decred&nbsp;is an autonomous digital currency with a hybrid consensus system. It is built to be a self-ruling currency where everyone can vote on the rules and project-level decision making proportionately to their stake.<\/em>","<strong data-v-f87c67ca=\"\">Johnny from Stellar<\/strong>","<em data-v-f87c67ca=\"\">Stellar is an open network for sending and exchanging value of any kind. Its global network enables digitization of assets - from carbon credits to currencies - and enables movement around the internet with ease. <\/em>","<strong data-v-f87c67ca=\"\">Izaak from Coda<\/strong>","<em data-v-f87c67ca=\"\">Coda is the first cryptocurrency protocol with a constant-sized blockchain. Coda compresses the entire blockchain into a tiny snapshot the size of a few tweets using recursive zk-SNARKs.<\/em>","<strong data-v-f87c67ca=\"\">Paige &amp; Zooko from Zcash<\/strong>","<em data-v-f87c67ca=\"\">Zcash is a&nbsp;digital currency utilizing zk-SNARKs to enable its privacy-protecting properties.<\/em>","<strong data-v-f87c67ca=\"\">Mitchell from Monero<\/strong>","<em data-v-f87c67ca=\"\">Monero is a open-source, privacy-focused cryptocurrency using the ASIC-resistant CryptoNote PoW algorithm. It enforces all privacy features at the protocol level to ensure that all transactions create a single fungible anonymity pool.<\/em>","<strong data-v-f87c67ca=\"\">Daniel from Grin<\/strong>","<em data-v-f87c67ca=\"\">Grin is a community-driven implementation of the Mimblewimble protocol that aims to be privacy preserving, scalable, fair, and minimal.<\/em>","<strong data-v-f87c67ca=\"\">Beni from Beam<\/strong>","<em data-v-f87c67ca=\"\">Beam is a confidential and scalable cryptocurrency based on Mimblewimble.<\/em>","<strong data-v-f87c67ca=\"\">Arnaud from AZTEC Protocol<\/strong>","<em data-v-f87c67ca=\"\">AZTEC Protocol is an efficient zero-knowledge protocol built on top of Ethereum, making plug-and-play value transmission and asset governance privacy tools for developers and companies.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Evan from <a href=\"https:\/\/weekinethereumnews.com\/\" data-v-f87c67ca=\"\">Ethereum<\/a><\/strong>","<em data-v-f87c67ca=\"\">Ethereum&nbsp;is a decentralized platform for applications that aims to resist fraud, censorship or third-party interference.<\/em>","<strong data-v-f87c67ca=\"\">Jing from Plasma<\/strong>","<em data-v-f87c67ca=\"\">Plasma Group is building \"Generalized Plasma\", a layer 2 scaling infrastructure for Ethereum that allows for general state transitions on layer 2.<\/em>","<strong data-v-f87c67ca=\"\">Erik from NEAR<\/strong>","<em data-v-f87c67ca=\"\">NEAR is a sharded proof-of-stake blockchain.<\/em>","<strong data-v-f87c67ca=\"\">AJ from Tezos<\/strong>","<em data-v-f87c67ca=\"\">Tezos is a self-amending blockchain that features formally verified smart contracts, on-chain governance, and a proof-of-stake consensus algorithm which enables all token holders to participate in the network.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Topper from Quorum Control<\/strong>","<em data-v-f87c67ca=\"\">Quorum Control makes Tupelo, a permissionless proof of stake DLT platform purpose-built to model individual objects that enables flexible public or private data models.<\/em>","<strong data-v-f87c67ca=\"\">Michael from Loom<\/strong>","<em data-v-f87c67ca=\"\">Loom Network is a platform for building highly scalable DPoS sidechains to Ethereum, with a focus on large-scale games and social apps.<\/em>","<strong data-v-f87c67ca=\"\">Myles from EOS<\/strong>","<em data-v-f87c67ca=\"\">EOS is a new blockchain architecture designed to enable vertical and horizontal scaling of decentralized applications.<\/em>","<strong data-v-f87c67ca=\"\">Zaki from Cosmos<\/strong>","<em data-v-f87c67ca=\"\">The&nbsp;Cosmos&nbsp;Network is a decentralized network of independent, scalable, and interoperable blockchains.<\/em>","<strong data-v-f87c67ca=\"\">Kate and Dean from Agoric<\/strong>","<em data-v-f87c67ca=\"\">Founded by pioneers in secure development and distributed systems, Agoric uses a secure subset of JavaScript to enable object capabilities and smart contracts.<\/em>","<strong data-v-f87c67ca=\"\">Antonio from dYdX<\/strong>","<em data-v-f87c67ca=\"\">dYdX is a decentralized exchange for margin trading, borrowing, lending, and eventually derivatives. dYdX allows traders to trustlessly short and get leverage on crypto assets.<\/em>","<strong data-v-f87c67ca=\"\">Coulter from MakerDAO<\/strong>","<em data-v-f87c67ca=\"\">Maker is comprised of a decentralized stablecoin, collateral loans, and community governance.<\/em>","<strong data-v-f87c67ca=\"\">Lazar from MARKET Protocol<\/strong>","<em data-v-f87c67ca=\"\">MARKET Protocol is a framework for creating tokens that track prices of traditional or digital assets.<\/em>","<strong data-v-f87c67ca=\"\">Robert from Compound<\/strong>","<em data-v-f87c67ca=\"\">Compound is a money market protocol on the Ethereum blockchain — allowing individuals, institutions, and applications to frictionlessly earn interest on or borrow cryptographic assets without having to negotiate with a counterparty or peer.<\/em>","<strong data-v-f87c67ca=\"\">Rahul from 0x<\/strong>","<em data-v-f87c67ca=\"\">0x<\/em>&nbsp;is an open protocol that enables the peer-to-peer exchange of assets on the Ethereum blockchain.","<strong data-v-f87c67ca=\"\">Tony from Liquidity.Network<\/strong>","<em data-v-f87c67ca=\"\">Liquidity Network is a transfer and swap platform for any token<\/em>","<strong data-v-f87c67ca=\"\">Dong Mo from Celer<\/strong>","<em data-v-f87c67ca=\"\">Celer Network is a layer-2 scaling platform that enables fast, easy and secure off-chain transactions for not only payment transactions, but also generalized off-chain smart contracts.<\/em>","<strong data-v-f87c67ca=\"\">Alexandra from Parity Technologies<\/strong>","<em data-v-f87c67ca=\"\">Parity&nbsp;Technologies builds core blockchain infrastructure, from&nbsp;Parity Ethereum, an Ethereum client, to Polkadot, an interoperable blockchain network.<\/em>","<strong data-v-f87c67ca=\"\">Wes from Theta<\/strong>","<em data-v-f87c67ca=\"\">Theta is an end-to-end infrastructure for decentralized video streaming.<\/em>","<strong data-v-f87c67ca=\"\">Doug from Livepeer<\/strong>","<em data-v-f87c67ca=\"\">Livepeer is a decentralized video infrastructure network, dramatically reducing prices for developers and businesses building video streaming applications at scale.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Ryan from FOAM<\/strong>","<em data-v-f87c67ca=\"\">FOAM&nbsp;is building spatial applications and proof of location that bring geospatial data to blockchains and empower a consensus driven map of the world.<\/em>","<strong data-v-f87c67ca=\"\">Bowen from Hydro\/DDEX.io<\/strong>","<em data-v-f87c67ca=\"\">Hydro&nbsp;Protocol is an open source framework for building Decentralized Exchanges. DDEX&nbsp;is the first decentralized exchange for Ethereum and ERC-20 tokens built on the&nbsp;Hydro Protocol. <\/em>","<strong data-v-f87c67ca=\"\">Sam from OpenBazaar<\/strong>","<em data-v-f87c67ca=\"\">OpenBazaar is an open source project developing a protocol for e-commerce transactions in a fully decentralized marketplace.<\/em>","<strong data-v-f87c67ca=\"\">Mining ?<\/strong>","<strong data-v-f87c67ca=\"\">Trading\/Exchanges ?<\/strong>","<strong data-v-f87c67ca=\"\">Regulation<\/strong> <strong data-v-f87c67ca=\"\">?<\/strong>"],"hashtag":[]}