{"summary":"ConsenSys has raised $450 million in a Series D funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137740\/consensys-raises-450-million-series-d-at-7-billion-valuation","publishDate":"2022-03-15T10:43:03","id":10339,"type":null,"title":"ConsenSys raises $450 million Series D at $7 billion valuation","category":["VENTURE CAPITAL"],"content":["ConsenSys, one of the most well-known Ethereum-focused companies, has raised a new $450 million funding round.","The Series D funding round, led by ParaFi Capital, values the firm at $7 billion — representing a doubling of its valuation since the firm's November 2021 Series C round, when it <a href=\"https:\/\/www.theblockcrypto.com\/post\/124615\/consensys-raise\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised<\/a> $200 million. The Block had <a href=\"https:\/\/www.theblockcrypto.com\/post\/131445\/ethereum-developer-consensys-poised-to-double-its-valuation-in-pending-fundraise\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">previously reported<\/a> on the then-pending round in January.","New investors in the Series D round include Temasek, SoftBank Vision Fund 2, Microsoft, Anthos Capital, Sound Ventures, and C Ventures. Participants from the Series C funding round, including Third Point, Marshall Wace, True Capital Management, and United Talent Agency’s venture fund UTA VC, also took part in the new round.","Notably, ConsenSys intends to convert the funding it received into ether (ETH), the native cryptocurrency of the Ethereum network.","“All proceeds from the round will be converted to ETH to further build ConsenSys’s 'ultra sound money' position as a rebalance to its ETH to fiat ratio in line with ConsenSys’ treasury strategy,” said a company statement.","In a separate statement, founder and CEO Joe Lubin indicated that this approach will inform ConsenSys's future funding initiatives.","\"This round takes in digital assets as well as fiat and concerts all immediately to ETH,\" Lubin was quoted as saying. \"Next round will be our 'Series ETH' where we will assist investors in getting fully crypto native and contributing ETH as a symbol of and commitment to the ongoing paradigm shift.”","The funding round is one of the most notable for 2022 thus far and represents a significant development for ConsenSys, which at the start of 2020 moved to <a href=\"https:\/\/www.theblockcrypto.com\/post\/54898\/ethereum-consensys-software-investment-200-million-raise-layoffs\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reorganize<\/a> its operation and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/62449\/ethereum-consensys-layoffs-coronavirus\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">trim<\/a> its global staff.&nbsp;","In a sign of the times, ConsenSys will be using the money to fuel an array of growth initiatives, including the hiring of more than 600 people.&nbsp;","Funding will support a major redesign of MetaMask for a release later in 2022, as well as the integration with a wide range of blockchain protocols and account security schemes. &nbsp;This effort will build on the company’s recent acquisition of MyCrypto.","The new resources will also encourage the adoption of Infura, the blockchain node infrastructure provider.&nbsp;","ConsenSys said that it would also use the money to support the \"continued reinvestment in development and tooling for the extended Ethereum ecosystem.\"","“I think of ConsenSys as a broad and deep capabilities machine for the decentralized protocols ecosystem, able to rapidly capitalize at scale on fundamental new constructs that emerge, such as developer tooling, wallets, security audits, DeFi, NFTs, Layer-2 scaling, DAOs, and more,\" said Lubin. \"This view has resonated with our crypto native and growth investors in a Series D that will enable us to execute exciting growth strategies.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$450 million","content":"MONEY"},{"type":"Infura","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"Lubin","content":"PERSON"},{"type":"Marshall Wace","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"True Capital Management","content":"ORGANIZATION"},{"type":"Sound Ventures","content":"ORGANIZATION"},{"type":"Joe Lubin","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"United Talent Agency","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"November 2021","content":"DATE"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}