{"summary":"Disclaimer: This post is provided for educational purposes only. It is not legal advice.  It is my opinion only and isn&#x27;t authorized by any past, present,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/4313\/sec-fines-boxer-and-dj-for-undisclosed-paid-promotion-of-icos","publishDate":"2018-12-01T11:12:43","id":10332,"type":null,"title":"The SEC knocks Floyd Mayweather Jr. and DJ Khaled out of the ICO promotion game","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: This post is provided for educational purposes only. It is not legal advice. &nbsp;It is my opinion only and isn't authorized by any past, present, or future client or employer. Also I might change my mind. I contain multitudes.<\/em>","You can’t promote a security in the United States in exchange for money without disclosing that you’ve been paid. Does this include sending out a tweet singing the praises of an ICO token? Yep, it sure does. If you do that, you’ve just violated Section 17(b) of the Securities Act of 1933. This is just as true if you’re a famous boxer or rapper as it is if you’re someone who is totally unknown.","What’s the big deal about paid promotions of securities? It’s not too hard to understand. The anti-touting provision of the Securities Act has a pretty straightforward consumer protection purpose. If someone’s intent in hawking a security is based on the fact that they’re being paid to do so, the public has a right to know that money lies behind the interest, not a real belief in the security’s inherent value. [related id=1]","In this vein, and in news that may have been shocking to a certain boxer and rapper, but to few others who have been paying attention, this law also applies to celebrity endorsements of ICO involving tokens that are securities. (In fact, the SEC even said so in a special release on November 1, 2017 called, with evident foreshadowing, “<a href=\"https:\/\/www.sec.gov\/news\/public-statement\/statement-potentially-unlawful-promotion-icos\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">SEC Statement Urging Caution Around Celebrity Backed ICOs<\/a>”).","What’s the tl;dr? Boxer Floyd Mayweather Jr. and rapper DJ Khaled were apparently not very good listeners, or had really poor legal advice. As a consequence, they both accepted money for touting a number of ICOs. As a result, they both entered into consent cease-and-desist orders with the SEC on November 29, 2019. The Orders lay out all of the facts, with the key ones summarized here.","Mayweather has a huge social following: “21 million Instagram followers, 7.8 million Twitter followers, and 13.4 million Facebook followers.” Between July and September 2017, he accepted $300,000 to promote three ICOs on those accounts. One of those ICOs was Centra Tech, against whose founders the SEC has filed a civil enforcement action and the U.S. Attorney in Manhattan has filed criminal charges. According to the cease and desist <a href=\"https:\/\/www.sec.gov\/litigation\/admin\/2018\/33-10578.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">order<\/a> “On September 14, 2017, Mayweather’s Instagram and Facebook accounts posted a picture of Mayweather holding a Centra Card at a shoe store with the caption: 'Spending bitcoins ethereum and other types of cryptocurrency in Beverly Hills with my Titanium Centra Card. Join Centra’s ICO on Sept. 19th.'” He made similar posts, and he didn’t disclose that he was paid. (Further, it turns out that those cards didn’t actually work – though the fact that this statement was false doesn’t get mentioned in this Order).","The Khaled cease and desist <a href=\"https:\/\/www.sec.gov\/litigation\/admin\/2018\/33-10579.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">order<\/a> is similar to Mayweather’s, though the rapper has a smaller social media following (12.4 million Instagram followers and 3.9 million Twitter followers. Khaled only touted one offering (also Centra), posting on social media “I just received my titanium centra debit card. The Centra Card &amp; Centra Wallet app is the ultimate winner in Cryptocurrency debit cards powered by CTR tokens! Use your bitcoins, ethereum, and more cryptocurrencies in real time across the globe. This is a Game changer here. Get your CTR tokens now!” Khaled got paid $50,000 without disclosing the payment to the public.","Also of note -- both Orders state that posts were made by Khaled and Mayweather after the SEC’s July 25, 2017 DAO Report, in which it stated that “virtual tokens or coins sold in ICOs may be securities, and those who offer and sell securities in the United States must comply with the federal securities laws.” Perhaps this is the SEC’s way of saying “you can’t claim it was such new technology that you didn’t understand how securities laws might apply; we made our position clear.”","The law in question is pretty clear. Section 17(b) say it’s unlawful to “publish, give publicity to, or circulate any notice, circular, advertisement, newspaper, article, letter, investment service, or communication which, though not purporting to offer a security for sale, describes such security for a consideration received or to be received, directly or indirectly, from an issuer, underwriter, or dealer, without fully disclosing the receipt, whether past or prospective, of such consideration and the amount thereof.”","While the statute doesn’t say “tweet”, a tweet is a “communication” and neither of these fellows disclosed that they had been paid, which means (and they didn’t dispute this) that they violated this laws. Mayweather and Khaled received similar sanctions. They have to disgorge money they received for the promotions to the SEC plus added interest and pay penalties ($100,000 for Khaled, $300,000 for Mayweather). They’re also each barred from receiving consideration of any kind for communicating anything securities related for several years.","While these two gentlemen are among the most famous token sale promoters out there, the industry was full of paid touters this time last year. There is nothing about the statute nor these orders that suggests that the same logic wouldn’t apply to a someone running paid promotions on YouTube channels or touting a coin that was actually a security on Telegram. Whether any of the smaller fish will fall within a broader SEC sweep remains of token sale promoters remains to be seen. What is clear, however, is that the SEC views this part of the Securities Act as fully applicable to token sales it deems securities.","The SEC has had a busy couple of months in the ICO space. This latest volley follows cease and desist orders involving token sales, a decentralized exchange and broker-dealer registration. Based on the pace and variety of enforcement actions, it seems very likely that there is more to come.","<i data-v-f87c67ca=\"\">Stephen D. Palley is a trial lawyer based in Washington, D.C. with whose practice focuses in part on cryptocurrency and blockchain<\/i><em data-v-f87c67ca=\"\">. His \"Crypto Caselaw Minute\" is re-published weekly on The Block. Palley can be found on <a href=\"https:\/\/www.linkedin.com\/in\/stephendpalley\/\" data-v-f87c67ca=\"\">LinkedIn<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Twitter<\/a>.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$50,000","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Centra","content":"ORGANIZATION"},{"type":"Sept. 19th","content":"DATE"},{"type":"centra","content":"ORGANIZATION"},{"type":"Mayweather)","content":"ORGANIZATION"},{"type":"Stephen D. Palley","content":"PERSON"},{"type":"Twitter","content":"DATE"},{"type":"Crypto Caselaw Minute\"","content":"ORGANIZATION"},{"type":"July 25, 2017","content":"DATE"},{"type":"Manhattan","content":"LOCATION"},{"type":"Titanium Centra Card","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"September 14, 2017","content":"DATE"},{"type":"SEC Statement Urging Caution Around Celebrity Backed ICOs","content":"ORGANIZATION"},{"type":"September 2017","content":"DATE"},{"type":"Beverly Hills","content":"LOCATION"},{"type":"Mayweather","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"November 1, 2017","content":"DATE"},{"type":"Centra Card &amp; Centra","content":"ORGANIZATION"},{"type":"Centra Card","content":"ORGANIZATION"},{"type":"1933","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"November 29, 2019","content":"DATE"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"CTR","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Boxer Floyd Mayweather Jr.","content":"PERSON"},{"type":"Centra Tech","content":"ORGANIZATION"},{"type":"Mayweather’s","content":"PERSON"}],"hashtag":["TOKENS"],"authors":["Stephen D. Palley","The Block"]}