{"summary":"Compared to Optimistic Rollups, ZK-Rollups offer the following advantages:","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248199\/the-zk-op-debate-in-raas-why-zk-raas","publishDate":"2023-08-31T09:01:03","id":10335,"type":null,"title":"The ZK\/OP Debate in RaaS: Why ZK-RaaS?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Compared to Optimistic Rollups, ZK-Rollups offer the following advantages:<\/span>","<span data-v-f87c67ca=\"\">In addition to these benefits, ZK-RaaS has advantages through network effects:<\/span>","<span data-v-f87c67ca=\"\">Thanks to the faster transaction finality of ZK-Rollups (in the order of minutes),<\/span><a href=\"https:\/\/ethresear.ch\/t\/opsides-ncrc-a-trustless-native-cross-rollup-communication-protocol\/16441\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">native Cross-Rollup Communication (NCRC)<\/span><\/a><span data-v-f87c67ca=\"\"> is possible among ZK-Rollups. This resolves the issue of fragmented liquidity.<\/span>","<a href=\"https:\/\/ethresear.ch\/t\/rollup-as-a-service-opportunities-and-challenges\/13051\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rollups-as-a-Service (RaaS)<\/span><\/a><span data-v-f87c67ca=\"\"> provides an abstraction layer on top of the Rollup framework and SDK, making it easy to deploy, maintain, and build on customized, production-grade specific application Rollups (AppRollups). Similar to SaaS(Software-as-a-Servic) products, RaaS allows developers to focus on building the application layer, transforming what used to be a process requiring multiple engineers and dozens of hours into a 10-minute no-code deployment.<\/span>","<span data-v-f87c67ca=\"\">There are two main types of Rollups:<\/span><a href=\"https:\/\/coinmarketcap.com\/alexandria\/glossary\/optimistic-rollup\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Optimistic rollups<\/span><\/a><span data-v-f87c67ca=\"\"> and<\/span><a href=\"https:\/\/coinmarketcap.com\/alexandria\/glossary\/zero-knowledge-rollups\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">ZK-Rollups<\/span><\/a><span data-v-f87c67ca=\"\">. They differ in transaction verification and dispute resolution, with distinct advantages and disadvantages. Based on the type of Rollup offered, this article divides RaaS into <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Op-RaaS<\/span><\/i><span data-v-f87c67ca=\"\"> and <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ZK-RaaS<\/span><\/i><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">One of the primary objectives of Rollup solutions is to increase the transaction throughput on L1 and reduce users' gas fees. Both Optimistic rollups and ZK-Rollups achieve this goal by batching transactions and periodically submitting them to the L1. Consequently, they both incur gas fees for submitting data to L1.<\/span>","<span data-v-f87c67ca=\"\">Therefore, ZK-Rollups can save more L1 Gas compared to optimistic rollups.<\/span>","<span data-v-f87c67ca=\"\">However, ZK-Rollups entail additional computation costs for generating zero-knowledge proofs, which is exactly what ZK-RaaS aims to address.<\/span>","<span data-v-f87c67ca=\"\">As ZK-Rollups are being adopted on a large scale, generating ZKPs requires significant computational power from hardware and mining machines, including CPUs, GPUs, and FPGAs.<\/span><a href=\"https:\/\/opsi.de\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Opside<\/span><\/a> <span data-v-f87c67ca=\"\">has also introduced the concept of<\/span><a href=\"https:\/\/ethresear.ch\/t\/opside-zk-pow-v2-0-a-multi-chain-and-multi-rollup-decentralized-prover-network\/16034\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">ZK-PoW<\/span><\/a><span data-v-f87c67ca=\"\">, involving miners in maintaining zkEVM nodes and performing ZKP calculations. The Opside ZK-PoW protocol is deployed across multiple chains, including but not limited to Ethereum, BNB Chain, Polygon PoS, and Opside Chain itself.<\/span>","<span data-v-f87c67ca=\"\">To encourage more miners to participate in ZKP computation tasks, Opside has introduced<\/span><a href=\"https:\/\/mirror.xyz\/opsidezk.eth\/4jhRCB5jJeEfiiEnzmFv--ayrDh9ZXqVblFl8u9qbQ8\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">ZKP's Two-Step Submission Algorithm<\/span><\/a><span data-v-f87c67ca=\"\">. The PoW reward share corresponding to a ZKP is distributed to the submitter of valid ZKPs, which are the miners, following specific rules.<\/span>","","","<span data-v-f87c67ca=\"\">In Opside, the Two-Step Submission Algorithm for ZKP achieves <\/span><b data-v-f87c67ca=\"\">parallel computation and sequential submission of ZKPs<\/b><span data-v-f87c67ca=\"\">, enabling mining machines to execute multiple ZKP generation tasks simultaneously. This significantly accelerates the efficiency of ZKP generation.<\/span>","<span data-v-f87c67ca=\"\">Due to the challenge period in optimistic rollups, users cannot withdraw funds before its expiration, causing inconvenience. In contrast, ZK-Rollups lack a challenge period, offering users superior fund\/liquidity efficiency, allowing them to withdraw funds at any time.<\/span>","<span data-v-f87c67ca=\"\">It's worth noting that <\/span><b data-v-f87c67ca=\"\">due to the swift confirmation of transactions in ZK-Rollups, it's possible to achieve trustless communication between ZK-Rollups, allowing all Rollups to share asset liquidity<\/b><span data-v-f87c67ca=\"\">. However, due to the presence of a 7-day challenge period and fraud proofs, achieving trustless native communication between optimistic rollups is impractical.<\/span>","<span data-v-f87c67ca=\"\">Opside's ZK-RaaS platform introduces the<\/span><a href=\"https:\/\/ethresear.ch\/t\/opsides-ncrc-a-trustless-native-cross-rollup-communication-protocol\/16441\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">NCRC (Native Cross Rollup Communication)<\/span><\/a><span data-v-f87c67ca=\"\"> protocol, providing a trustless Rollup interoperability solution. The NCRC protocol doesn't involve adding an additional third-party bridge to each Rollup; instead, it transforms the native bridge of ZK-Rollups at the system level. This enables direct utilization of the native bridges of various ZK-Rollups for cross-Rollup communication. This approach is not only more concise and comprehensive but also inherits the absolute security of native bridges while avoiding the complexity and trust costs associated with third-party bridges.<\/span>","Opside has successfully implemented NCRC on the Testnet. Anyone can now experience it at https:\/\/pre-alpha-assetshub.opside.network\/.","<b data-v-f87c67ca=\"\">Optimistic Rollups: <\/b><span data-v-f87c67ca=\"\">Fraud proofs in optimistic rollups protect the blockchain network by relying on honest validators to ensure the validity of transactions. If there are no honest nodes to challenge invalid transactions, malicious actors could exploit this vulnerability and steal funds, rendering these optimistic rollups insecure<\/span>","<b data-v-f87c67ca=\"\">ZK-Rollups: <\/b><span data-v-f87c67ca=\"\">ZK-Rollups don't rely on honest validators; instead, they use zero-knowledge proofs to verify transactions. The advantage is that ZKPs provide security assurances through mathematical proofs rather than human participants, making ZK-Rollups trustless.<\/span>","<span data-v-f87c67ca=\"\">While fraud proofs in optimistic rollups are theoretically viable and a handful of rollups are currently operational, the risks of this security model are exposed over time as the number of optimistic rollups increases. This risk could become a \"grey rhino\" or even a \"black swan\".&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Running an honest validator incurs costs and is mostly unprofitable. When Op-RaaS creates numerous optimistic rollups, <\/span><b data-v-f87c67ca=\"\">beyond a few leading rollups, ensuring honest nodes for each rollup becomes challenging, particularly for those with less attention<\/b><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">On the other hand, the security of ZK-Rollups is trustless, as they don't rely on users or validators to challenge fraudulent transactions. Instead, they provide security guarantees through mathematical proofs.<\/span>","<span data-v-f87c67ca=\"\">Whether it's ZK-RaaS or Op-RaaS, developers can have their own Rollup application chains without the need to manage complex software and hardware.<\/span>","<span data-v-f87c67ca=\"\">ZK-RaaS platforms like<\/span><a href=\"https:\/\/opsi.de\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Opside<\/span><\/a><span data-v-f87c67ca=\"\"> , representing ZK-RaaS, have introduced features such as ZK-PoW and the NCRC protocol, which further highlight the advantages of ZK-Rollups.<\/span>","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SDK","content":"ORGANIZATION"},{"type":"ZK","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Opside Chain","content":"ORGANIZATION"},{"type":"NCRC (Native Cross Rollup Communication","content":"ORGANIZATION"},{"type":"NCRC","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}