{"summary":"Satsuma was founded in March last year and closed the round in May, co-founder and CEO Jonathan Kau told The Block in an interview. The startup waited to announce the equity round as it was focused on building the platform, Kau said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224834\/satsuma-seed-funding","publishDate":"2023-04-04T14:00:52","id":10349,"type":null,"title":"Satsuma raises $5 million for blockchain data indexing platform","category":["DEALS"],"content":["Satsuma, a blockchain data indexing platform, announced that it raised $5 million in a seed funding round co-led by Initialized Capital and Archetype.","Other investors included OpenSea, Y Combinator, Homebrew and South Park Commons.","Satsuma was founded in March last year and closed the round in May, co-founder and CEO Jonathan Kau told The Block in an interview. The startup waited to announce the equity round as it was focused on building the platform, Kau said.","Satsuma makes it easier to search and analyze data stored on a blockchain, helping developers gain deeper insights into the data such as the total value locked of a DeFi protocol.","\"TVL is a pretty complex calculation to make,\" he said. \"You can't just directly call some function on a blockchain and immediately get this answer. You have to do some processing to get this data.\"","Satsuma uses open-source technology from <a href=\"https:\/\/www.theblock.co\/post\/110864\/users-of-the-graph-can-now-earn-money-curating-blockchain-data\" data-v-f87c67ca=\"\">The Graph<\/a>, a pioneering decentralized protocol for querying and indexing data from blockchain networks. Satsuma, however, is a business entity with a software-as-a-service model and is not a decentralized protocol.","Satsuma gets specifics from its clients on what blockchain data they need and it then processes the data in the form of custom APIs. Its clients include Decentraland, Aragon, and Syndicate.","Kau said Satsuma's revenue has grown around 80% month-on-month over the last six months despite the current challenging market conditions because developer interest in the crypto remains strong and there is a demand for better infrastructure.","There are currently five people working for Satsuma, and it plans to stay lean in the near term and build for the long term.","\"We want to make our tooling as easy and fast as possible so that web3 developers can move much faster and create web2-like consumer experiences,\" Kau said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Satsuma","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kau","content":"PERSON"},{"type":"Aragon","content":"LOCATION"},{"type":"Jonathan Kau","content":"PERSON"},{"type":"Decentraland","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"South Park Commons","content":"LOCATION"},{"type":"March last year","content":"DATE"}],"hashtag":["DATA PROVIDERS","DECENTRALIZED INFRASTRUCTURE","DEVELOPER TOOLS","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}