{"summary":"CFTC Commissioner Christy Goldsmith Romero compares recent market chaos to the conditions that brought about the 2008 financial crisis. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180618\/cftc-commissioner-warns-of-parallel-themes-to-2008-financial-crisis-in-crypto-market","publishDate":"2022-10-27T16:08:59","id":10348,"type":null,"title":"CFTC commissioner warns of &#x27;parallel themes&#x27; to 2008 financial crisis in crypto market","category":["POLICY"],"content":["Another leader at the Commodity Futures Trading Commission is urging for more regulatory power over crypto markets.&nbsp;","Christy Goldsmith Romero, a CFTC commissioner, warned of increasing \"contagion risk\" in crypto markets in a <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/oparomero3\" data-v-f87c67ca=\"\">speech<\/a> in New York yesterday.&nbsp;","\"The vulnerabilities seen during this beginning of what some call the 'crypto winter' warn of growing intra-market risks, with parallel themes seen in 2008,\" she said. Her comments referred to the financial crisis caused in part by opaque swaps markets, while pointing to calamitous market events like the collapse of stablecoin TerraUSD and private fund Three Arrows.","\"Just as regulators could not see the true exposures or risk in 2008 due to unregulated companies and products, we cannot see that today with unregulated crypto markets,\" Goldsmith Romero said.&nbsp;&nbsp;","The commissioner noted that the crypto market today remains \"relatively small\" but foresaw growing links between crypto and tradfi increasing the risks posed to the overall financial system.","Goldsmith Romero's remarks come amid a push by the CFTC to get more regulatory authority over cryptocurrency markets. Like Chairman <a href=\"https:\/\/www.theblock.co\/post\/179494\/behnam-just-a-matter-of-time-before-crypto-returns-to-conditions-of-spring-crash\" data-v-f87c67ca=\"\">Rostin Behnam's last week<\/a>, her recent comments noted conflicts of interest among crypto companies that \"serve multiple functions that are separated into different entities in traditional finance. An exchange may also be a market maker, clearinghouse, lender, and\/or custodian.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Goldsmith Romero","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"2008","content":"DATE"}],"hashtag":["CFTC"],"authors":["Kollen Post","The Block"]}