{"summary":"After Shanghai, the government of another Chinese city - Shenzhen - is now investigating cryptocurrency exchanges. The finance bureau of Shenzhen","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48070\/after-shanghai-now-shenzhen-government-investigating-crypto-exchanges","publishDate":"2019-11-22T04:30:13","id":10359,"type":null,"title":"After Shanghai, now Shenzhen government investigating crypto exchanges","category":["CHINA"],"content":["After Shanghai, the government of another Chinese city - Shenzhen - is now investigating cryptocurrency exchanges.","The finance bureau of Shenzhen municipality has <a href=\"https:\/\/sztqb.sznews.com\/PC\/content\/201911\/22\/content_774085.html\" data-v-f87c67ca=\"\">identified<\/a> 39 undisclosed cryptocurrency exchanges for inspection, the Shenzhen Special Zone Daily, affiliated with the Communist Party of China (CPC) Shenzhen Committee, reported Friday.","The Shenzhen branch of the People's Bank of China (PBoC), the country’s central bank, will also join the finance bureau for investigation, among other local authorities, per the report.","The authorities will inspect cryptocurrency exchanges for illegal activities, such as money laundering, as cryptocurrency speculation has risen in China among the recent <a href=\"https:\/\/www.theblockcrypto.com\/post\/44646\/xi-jinping-says-to-let-china-take-the-leading-position-in-blockchain\" data-v-f87c67ca=\"\">promotion<\/a> of blockchain tech by the country’s president Xi Jinping.","“The operation will focus on three activities: first, providing virtual currency trading services or opening virtual currency trading places in China; second, providing service channels for overseas virtual currency trading places, including services such as drainage and agency trading; In the name of the sale of tokens, raise funds for investors or virtual currency such as Bitcoin and Ethereum,” per the report (a rough translation from Chinese).","The authorities have been asked to complete the inspection by Nov. 25. If any exchanges are found to be violating rules, they will be required to shut down their businesses.","Just last week, the Shanghai government<a href=\"https:\/\/www.theblockcrypto.com\/linked\/47273\/report-chinas-central-bank-orders-probe-of-cryptocurrency-activities-in-shanghai\" data-v-f87c67ca=\"\"> inspected<\/a> cryptocurrency exchanges in the city. The target of this investigation was businesses that conduct cryptocurrency trading, token sales, and distributions of tokens from overseas initial coin offerings.","China appears to be taking fresh steps to crack down on the cryptocurrency sector. Earlier this month, Chinese social media site Weibo <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47243\/binances-weibo-account-has-been-blocked-due-to-violations-of-laws\" data-v-f87c67ca=\"\">banned<\/a> the official accounts of cryptocurrency exchange Binance and blockchain project Tron Foundation, citing \"violations of laws and regulations and the relevant provisions of the Weibo Community Convention.\" However, the Weibo accounts of cryptocurrency exchanges Huobi and OKEx are still intact.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"People's Bank of China (PBoC","content":"ORGANIZATION"},{"type":"Weibo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"Shenzhen Special Zone Daily","content":"ORGANIZATION"},{"type":"Weibo Community Convention","content":"ORGANIZATION"},{"type":"Communist Party of China (CPC) Shenzhen Committee","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Tron Foundation","content":"ORGANIZATION"},{"type":"Nov. 25","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}