{"summary":"Elon Musk has filed to stay Twitter&#x27;s case against him on the grounds that he has agreed to renew his offer to buy the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175373\/musk-files-to-stay-twitters-case-against-him-nyt","publishDate":"2022-10-06T16:52:07","id":10353,"type":null,"title":"Musk files to stay Twitter&#x27;s case against him: NYT","category":["LEGAL"],"content":["Elon Musk filed to stop the upcoming trial in his ongoing legal squabble with Twitter and indicated that his high-profile deal to buy the platform could close by Oct. 28, according to a report by the <a href=\"https:\/\/www.nytimes.com\/2022\/10\/06\/technology\/elon-musk-twitter-trial.html\" data-v-f87c67ca=\"\">New York Times<\/a>.&nbsp;","Musk's legal team lodged a new motion to delay a trial in the lawsuit brought against him by the social media company for his alleged failure to adhere to a purchase agreement. Musk now also argues that Twitter must drop the lawsuit in order for a purchase to move forward.&nbsp;","A trial on the matter is still slated for Oct. 17, and has led to the release of text messages from Musk, Twitter executives, and other major figures in tech regarding the deal.","Now Musk says he will <a href=\"https:\/\/www.theblock.co\/post\/174828\/musk-renews-bid-for-twitter-as-he-looks-to-avoid-trial\" data-v-f87c67ca=\"\">see the transaction through<\/a>, contingent upon <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1418091\/000110465922105787\/tm2227435d1_ex99-s.htm\" data-v-f87c67ca=\"\">debt financing<\/a>, which was not part of the original agreement. Using the rationale that he expects to move forward on the deal, he now argues that <a href=\"https:\/\/www.theblock.co\/post\/174828\/musk-renews-bid-for-twitter-as-he-looks-to-avoid-trial\" data-v-f87c67ca=\"\">trial is unnecessary<\/a>, as he seeks&nbsp;to close the transaction at the originally agreed upon price of $54.20 per share.&nbsp;","Twitter board members continue to weigh the situation, and may try to stay in court until Musk is able to provide financing to close the deal, or resist the new financial structuring Musk wants to use to reach the price he offered.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Times","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 28","content":"DATE"},{"type":"Oct. 17","content":"DATE"},{"type":"$54.20","content":"MONEY"}],"hashtag":["ELON MUSK","TWITTER"],"authors":["Aislinn Keely","The Block"]}