{"summary":"Fixed rate contracts may become a thing of the past, the firm said in its 2022 mining report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205313\/more-turbulent-times-ahead-for-bitcoin-miners-galaxy-digital-says","publishDate":"2023-01-25T08:00:37","id":10364,"type":null,"title":"More turbulent times ahead for bitcoin miners, Galaxy Digital says","category":["THE BLOCK"],"content":["Fixed-rate contracts from hosting providers could be a thing of the past as the bitcoin mining hosting landscape transforms in 2023, Galaxy Digital said in a recent report.","Hosting providers proved to be the hardest hit in the space, offering fixed costs and taking on real-time power prices. Two of the largest, Core Scientific and Compute North, have filed for bankruptcy.","“We may see hosting providers push for pass through power contracts plus a spread, while also offering clients certain revenue curtailment benefits,” Galaxy said.","Notably, Core Scientific and Celsius Mining were in dispute over the terms of their agreements relating to power cost surges, with the former ultimately getting the green light to turn off 37,000 Celsius mining rigs.","Network hash rate also will end the year up 23% at 325 EH\/s, the firm said in its year-end report on mining.","Miners have been forced to sell assets and turn to bankruptcy amid a drop in bitcoin prices and a surge in energy costs, which have squeezed margins.","“The bitcoin mining industry is currently going through a purge of all of the excess and misallocations of capital that supported weak business models during the bull market of 2021,” the bank said. “Miners ended 2022 in survival mode, setting the stage for more turbulent times ahead in 2023.”","While over $1.1 billion in distressed mining funds has been announced, miners will still struggle to have the same access to funding that was available in 2021 and 2022. The structure of machine-backed loans is bound to change and going forward those loans will have to “include a better mechanism for determining monthly payment amounts based on market conditions.”","In 2022, miners defaulted on $277mm of ASIC-backed loans, handing back over 11.59 EH of machines to lenders, Galaxy estimated.","“Going forward, it is essential that miners develop a treasury management strategy that aligns with their future cash needs,” Galaxy said. However, it added, “In 2023, we do not anticipate the same level of sell pressure coming from miners.”","The firm notes that more than 1 GW of hosting capacity entered bankruptcy in 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compute North","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"GW","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"$1.1 billion","content":"MONEY"},{"type":"$277","content":"MONEY"},{"type":"” Galaxy","content":"ORGANIZATION"},{"type":"ASIC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","Catarina Moura","The Block"]}