{"summary":"It was a packed week in the crypto news cycle that included multiple hacks, a huge bounty and the SEC probing a major NFT company.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177430\/mango-hack-drama-and-other-major-crypto-stories-this-past-week","publishDate":"2022-10-15T10:46:21","id":10366,"type":null,"title":"Mango hack drama and other major crypto stories of the past week","category":["CRYPTOCURRENCY"],"content":["This past week saw five crypto hacks and exploits happen in one 24-hour period, the largest of which was Mango Markets, where over $100 million was stolen. Those five hacks made it 11 such incidents in October, which is something of a record.","This past week wasn’t only about hacks and thefts. Ethereum became deflationary for the first since The Merge. Also, it is now possible to search for Ethereum wallet addresses on Google.","For these and more, here are the top stories in the crypto space that caught the eye this past week.","The attacker responsible for the Mango Markets exploit will get to keep over 40% of the siphoned funds. This is based on a deal between the exploiter and the protocol’s community. The Mango DAO voted to let the attacker <a href=\"https:\/\/www.theblock.co\/post\/177262\/mango-markets-community-set-to-approve-47-million-deal-with-hacker\" data-v-f87c67ca=\"\">keep $47 million<\/a> out of the <a href=\"https:\/\/www.theblock.co\/post\/176445\/hacker-steals-over-100-million-from-mango-markets\" data-v-f87c67ca=\"\">$114 million drained<\/a> from the DeFi platform, while returning $67 million to the project.","This deal comes after the hacker initially <a href=\"https:\/\/www.theblock.co\/post\/176468\/mango-markets-attacker-puts-forward-proposal-that-would-pay-them-70-million-bounty\" data-v-f87c67ca=\"\">proposed keeping $70 million<\/a> from the stolen funds. The attacker created a governance vote to push this through and voted on it with 33 million stolen mango coins. However, the team created a second proposal and the DAO was able to agree on it. This marks the largest-ever bounty given to someone who stole from a crypto project. Previous bounties have been limited to a small percentage, usually 10% of the stolen funds","The Mango exploit is the sixth-largest exploit of a DeFi protocol. It is about $16 million shy of the $130 million Cream Finance exploit that happened in October last year.","Four other hacks also happened on the day of the Mango Market exploit. QANplatform, a Layer 1 blockchain that describes itself as being “quantum-resistant” saw <a href=\"https:\/\/www.theblock.co\/post\/176118\/hacker-drains-1-million-from-qanplatform-bridge-token-slumps-94\" data-v-f87c67ca=\"\">$2 million stolen<\/a> from its cross-chain bridge. The project’s token fell 94% following the hack. Hackers also <a href=\"https:\/\/www.theblock.co\/post\/176299\/hacker-steals-2-3-million-from-templedao\" data-v-f87c67ca=\"\">stole $2.3 million<\/a> from the staking platform TempleDAO. Rabby Swap, another DeFi project also suffered a malicious exploit with $200,000 drained the process. The fourth incident concerned ParaSwap, a decentralized exchange aggregator. However, the ParaSwap team stated that its funds were not affected by the incident.","October has previously been the month associated with the most crypto hacks, and this year hasn’t proved different. Data from blockchain forensics outfit Chainalysis shows that DeFi projects have <a href=\"https:\/\/www.theblock.co\/post\/176824\/hacktober-surprise-worst-month-in-worst-year-of-hacks-chainalysis-says\" data-v-f87c67ca=\"\">lost about $718 million<\/a> to hacks and exploits this month. This figure also includes the <a href=\"https:\/\/www.theblock.co\/post\/175403\/bnb-smart-chain-halted-amid-potential-bridge-exploit\" data-v-f87c67ca=\"\">$100 million BNB cross-chain bridge heist<\/a>.","This past week, <a href=\"https:\/\/www.theblock.co\/post\/176102\/ethereums-weekly-supply-growth-turns-deflationary-for-first-time-since-merge\" data-v-f87c67ca=\"\">Ethereum became deflationary<\/a> for the first time since The Merge. Ethereum’s new supply fell by 0.12%. This decline in the issuance of new tokens happened due to transaction fees spiking during the week. Fees spiked because of a new crypto project called XEN that recently began its token staking.","Ethereum also saw another milestone event this past week as wallet addresses are now <a href=\"https:\/\/www.theblock.co\/post\/176153\/google-now-showing-ethereum-wallet-balances\" data-v-f87c67ca=\"\">searchable on Google<\/a>. It is now possible to search for an Ethereum address on Google and see the balance in the address. The search engine giant is getting its data from blockchain explorer Etherscan. This is the latest Ethereum interaction from Google, as the site previously provided a countdown timer in the run-up to The Merge.","Yuga Labs became the latest company in the crypto space to face a probe by the U.S. Securities and Exchange Commission. The Bored Ape Yacht Club NFT creator is <a href=\"https:\/\/www.theblock.co\/post\/176301\/bayc-creator-yuga-labs-faces-sec-probe-bloomberg\" data-v-f87c67ca=\"\">being investigated<\/a> for possibly breaking federal securities law.","The SEC investigation into Yuga Labs reportedly concerns the company’s ApeCoin tokens launched in March. The U.S. securities watchdog is said to be looking at whether the tokens can be classified as securities.","Some favorable news came out for Bitcoin miners in the area of financing this past week. First was Binance announcing a <a href=\"https:\/\/www.theblock.co\/post\/177170\/binance-launches-500-million-fund-to-provide-loans-to-bitcoin-miners\" data-v-f87c67ca=\"\">$500 million fund<\/a> to provide loans to Bitcoin miners. TeraWulf, a Bitcoin mining outfit, <a href=\"https:\/\/www.theblock.co\/post\/175922\/bitcoin-miner-terawulf-raises-17-million-as-it-ramps-up-infrastructure-build-out\" data-v-f87c67ca=\"\">announced a $17 million raise<\/a> at the start of the week. The company said it will use the funds to expand its infrastructure.","Luxor, another Bitcoin mining firm, <a href=\"https:\/\/www.theblock.co\/post\/175588\/luxor-launches-derivatives-product-based-on-bitcoin-mining-revenue\" data-v-f87c67ca=\"\">announced the launch<\/a> of a derivatives product based on revenue from Bitcoin mining. The product will track the Bitcoin mining hash rate — the term used to describe the amount of computing power utilized per second to secure the Bitcoin network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"0.12%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$114 million","content":"MONEY"},{"type":"$70 million","content":"MONEY"},{"type":"94%","content":"PERCENT"},{"type":"$130 million","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"$200,000","content":"MONEY"},{"type":"Cream Finance","content":"ORGANIZATION"},{"type":"$2.3 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"$718 million","content":"MONEY"},{"type":"Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"October last year","content":"DATE"},{"type":"$67 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$17 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$47 million","content":"MONEY"},{"type":"$16 million","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["ETHEREUM","SEC","YUGA LABS"],"authors":["Osato Avan-Nomayo","The Block"]}