{"summary":"This free preview of The Block Genesis is offered to our loyal readers as a representation of the highly valuable journalism our Genesis members receive","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12955\/so-is-binance-coin-actually-worth-anything","publishDate":"2019-02-21T13:11:32","id":10365,"type":null,"title":"So, is Binance Coin actually worth anything?","category":["EXCHANGES"],"content":["<em data-v-f87c67ca=\"\">This free preview of The Block Genesis is offered to our loyal readers as a representation of the highly valuable journalism our Genesis members receive daily. If you’d like to receive all Genesis content on our site and via daily newsletter, <a href=\"https:\/\/www.theblockcrypto.com\/genesis-purchase\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">join here<\/a>!<\/em>","Binance is an interesting company—maybe even the<a href=\"https:\/\/medium.com\/digital-alchemy-holdings\/binance-the-fastest-profitable-unicorn-in-history-d71dc659dc44\" data-v-f87c67ca=\"\"> \"fastest profitable unicorn in history\"<\/a>—but to this day, there are still major questions around the value of their issued token.","The token was an innovative move when launched and was lauded by many for serving as an ingenious financing mechanism for Binance, with many investors and cryptocurrency enthusiasts (formerly including yours truly) going so far as to describe it as a \"proto-equity\" or \"the first actual tokenized security\" (ugh).","It was issued in 2017 via ICO from the Binance team. It was a fund-raising mechanism on the basis of a relatively experienced team and a vague whitepaper. At the risk of looking foolish, CZ managed to set the stage to pull off his greatest trick: issue a token (fake money) which could then trade (for real money!) and use the real money to grow while treating the fake money like real currency. If your users buy into the fact that your token is actually worth real money, you just materially lowered your cost of capital.","The questions remain: what are investors actually buying? Are they buying a security, where they have some claim on future cash flows or liquidation value? Are they buying a utility token? In that case, are there real people who are deriving utility from the token today? Is it possible to derive any sense of a \"fair\" price from this?","A good discussion was sparked<a href=\"https:\/\/twitter.com\/mdudas\/status\/1096440597408292864\" data-v-f87c67ca=\"\"> a<\/a><a href=\"https:\/\/twitter.com\/twobitidiot\/status\/1098237899622006785\" data-v-f87c67ca=\"\"> few<\/a><a href=\"https:\/\/twitter.com\/Rewkang\/status\/1096966635993341954\" data-v-f87c67ca=\"\"> places<\/a> online this week in an attempt to answer this question, culminating in Multicoin Capital sharing<a href=\"https:\/\/multicoin.capital\/2019\/02\/19\/binance-coin-analysis-and-valuation\/\" data-v-f87c67ca=\"\"> their bullish thesis<\/a>.","<strong data-v-f87c67ca=\"\">Binance itself has historically<a href=\"https:\/\/medium.com\/binanceexchange\/10-ways-to-use-bnb-binance-coin-15fe2fbae1ab\" data-v-f87c67ca=\"\"> offered answers<\/a> on what the token is for:<\/strong>","The last reason, \"HODLing for later use on Binance Decentralized Cryptocurrency Exchange (DEX) and Binance Chain\" perhaps best describes precisely what Binance Coin is <i data-v-f87c67ca=\"\">actually<\/i> useful for: holding it at some (presumably) low price, waiting for it to be useful in the future when Binance<a href=\"https:\/\/support.binance.com\/hc\/en-us\/articles\/360001668872-Binance-Chain-Cryptocurrency-Exchange\" data-v-f87c67ca=\"\"> launches their own public blockchain<\/a>:","As a public blockchain, Binance Chain will mainly focus on the transfer and trading of blockchain assets, as well as provide new possibilities for the future flow of blockchain assets. Binance Chain will focus on performance, ease-of-use, and liquidity. Binance Coin (BNB) will be upgraded to exist on its own blockchain mainnet, becoming a native coin. At the same time, Binance will transition from being a company to a community.","Even assuming the vague promises of the Binance Chain hold up to scrutiny, if all Binance <i data-v-f87c67ca=\"\">really<\/i> does today is provide holders with a small fee rebate, why do so many people hold it in eager anticipation? What do investors misunderstand about it?","To understand this, the final component of Binance Coin needs to be understood: their much-celebrated<a href=\"https:\/\/medium.com\/binanceexchange\/10-ways-to-use-bnb-binance-coin-15fe2fbae1ab\" data-v-f87c67ca=\"\"> quarterly \"burns\"<\/a>:","Binance has an ongoing commitment to decrease the total supply of BNB in the market. Every quarter since it launched, Binance committed to using 20% of our profit to buy back Binance Coins and burn them permanently. At a time when market sentiments are low, our commitment to increasing BNB’s demand remains solid and backed up by our execution to date.","Despite their commitment to \"increase BNB's demand\" in all “market sentiments,”&nbsp;it remains unclear whether this burned $BNB comes from Binance Coin acquired in the market or whether it's simply burning off its own sizable treasury. With recent speculation, even CZ endorsed analysis clarifying that Binance’s burns are in fact <b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">not<\/i><\/b> open market buys.","At the time of the original offering, founders were allocated 40 million (20 percent) and investors 20 million (10 percent) with the rest sold in the ICO. Today, Binance's $BNB reserves<a href=\"https:\/\/etherscan.io\/token\/0xB8c77482e45F1F44dE1745F52C74426C631bDD52?a=0x4e9ce36e442e55ecd9025b9a6e0d88485d628a67\" data-v-f87c67ca=\"\"> are over<\/a> 95 million deep (collected in fee payments) with commitment to continue burning tokens until the supply is 100 million. The last two quarterly burns have destroyed about 1.6 million tokens apiece ($17 million and $9.4 million notional value).","","","This burn is is commonly misconstrued as a stock buyback, despite only maintaining cosmetic similarities. This is apparent even in Multicoin Capital's<a href=\"https:\/\/www.dropbox.com\/s\/7k5fjsnakjkug5y\/Binance%20Coin%20Analysis%20and%20Valuation.pdf?dl=0\" data-v-f87c67ca=\"\"> full analysis<\/a>:","<b data-v-f87c67ca=\"\">BNB token holders have a claim<\/b> on Binance’s cash flow because the company buys back and burns BNB from the market every quarter with 20% of its profits. Thus far, <b data-v-f87c67ca=\"\">BNB holders have received $125M in buyback-and-burn cash flows<\/b> over the 18 months since Binance’s launch.","However, these assumptions are incorrect. BNB token holders do not have a claim on Binance's cash flow because simply burning tokens (created at zero cost) from your treasury does not offer the same benefits as a stock buyback. It's the equivalent of issuing a gift card (which may or not may not be accepted) and destroying some portion of outstanding gift cards to claim the business is better.","The reason why Buybacks Are Good is because they improve earnings-per-share. That is, the future expected value of cash flows per share goes up as the number of shares outstanding drops.","The same claims that equity holders have don't apply here for a few reasons:","The temptation to retrofit concepts from traditional finance to new age crypto-finance is tempting, but mechanics of a future DEX and other off-chain considerations render the use of <a href=\"https:\/\/en.wikipedia.org\/wiki\/Discounted_cash_flow\" data-v-f87c67ca=\"\">traditional models<\/a> unusable. At best, $BNB is a speculator’s venture bet on a brilliant, scrappy founder building a behemoth in the face of massive competition and regulatory challenges and more importantly—a bet that a commitment to token holders will be maintained as incentives diminish over time.","This is all not to say that Binance's execution hasn't been excellent. Binance Inc. is running a business across multiple jurisdictions and has grown to hundreds of distributed employees, surpassing every global exchange in trading volumes. It's supported the addition of many assets, with little outage, and—perhaps most impressively—without asking for permission. In many ways, the company more closely resembles an advanced biological organism than the well-organized, multi-cellular bacteria rigid American technology companies.","Corporate growth has reflexively and actively promoted a suspension of belief over BNB's value today. It doesn't matter if discounts are nominal. It doesn't matter if every other use case is covered by bitcoin, ether, or dozens of other payment tokens. It doesn't matter if they could be burning tokens they gifted themselves. It doesn't matter if we don't know what the economics of their future DEX or blockchain will look like.","CZ, with world-class execution and a maniacal focus on customer service, has done the previously impossible: used a fake currency to bootstrap the growth of a very-real-and-very-profitable centralized company, using cheap retail capital to compete with venture capital backed businesses.","It remains to be seen whether the bull or bear case will play out, but it's important to see Binance for what it is: a company moving at warp-speed led by an Icarus-like CEO with an ugly duckling of a token, albeit no less useless than the majority of tokens currently trading on the platform.","<i data-v-f87c67ca=\"\">Appreciation to<\/i><a href=\"https:\/\/twitter.com\/CremeDeLaCrypto\" data-v-f87c67ca=\"\"> <i data-v-f87c67ca=\"\">Spencer Bogart<\/i><\/a><i data-v-f87c67ca=\"\">,<\/i><a href=\"https:\/\/twitter.com\/_alekslarsen\" data-v-f87c67ca=\"\"> <i data-v-f87c67ca=\"\">Aleks Larson<\/i><\/a><i data-v-f87c67ca=\"\">, and<\/i><a href=\"https:\/\/twitter.com\/nic__carter\" data-v-f87c67ca=\"\"> <i data-v-f87c67ca=\"\">Nic Carter<\/i><\/a><i data-v-f87c67ca=\"\"> for productive conversations that contributed to my thinking on Binance.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Binance Chain","content":"ORGANIZATION"},{"type":"Carter","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$BNB","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"$9.4 million","content":"MONEY"},{"type":"$125M","content":"MONEY"},{"type":"Binance Decentralized Cryptocurrency Exchange","content":"ORGANIZATION"},{"type":"Aleks Larson","content":"PERSON"},{"type":"The Block Genesis","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"20 percent","content":"PERCENT"},{"type":"Spencer Bogart","content":"PERSON"},{"type":"10 percent","content":"PERCENT"},{"type":"$17 million","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Binance Inc.","content":"ORGANIZATION"}],"hashtag":["BINANCE","BNB"],"authors":["Arjun Balaji","The Block"]}