{"summary":"Crypto wallet provider Exodus has added Bitcoin-backed stablecoin Sovryn Dollar (DLLR) to its balance sheet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236374\/crypto-wallet-exodus-sovryn-dollar-balance-sheet","publishDate":"2023-06-26T09:31:29","id":10373,"type":null,"title":"Exodus adds Bitcoin-backed stablecoin Sovryn Dollar to its balance sheet","category":["COMPANIES"],"content":["Exodus Movement Inc., a crypto wallet provider, has added Bitcoin-backed stablecoin Sovryn Dollar (DLLR) to its balance sheet.","The initial allocation in DLLR represents around 25% of Exodus's quarterly interest income, the company said in an announcement shared with The Block, without specifying a dollar figure.","The addition of DLLR to its corporate treasury will help Exodus access operational funds continuously without depending on banking services, according to JP Richardson, co-founder and CEO of Exodus.","\"Our treasury allocation is a step towards a new era of financial control and self-custody,\" Richardson said in the statement. \"Besides taking its place on our corporate balance sheet, the Sovryn Dollar asset will soon be available to all of Exodus' users across Desktop, Mobile, and our Web3 Wallet.\"","Exodus was founded in 2015 and provides a multi-chain crypto software wallet. It claims to have around 4 million users. As for <a href=\"https:\/\/www.theblock.co\/linked\/87710\/sovryn-bitcoin-powered-trading-lending-platform\" data-v-f87c67ca=\"\">Sovryn<\/a> Dollar, it is issued by the Mynt protocol and backed by bitcoin. \"The Mynt protocol aggregates multiple bitcoin-backed <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\" data-v-f87c67ca=\"\">stablecoins<\/a> to issue an ultra-bitcoin-backed stablecoin,\" <a href=\"https:\/\/sovryn.com\/\" data-v-f87c67ca=\"\">reads<\/a> Sovryn's website. \"You can exchange DLLR for the equivalent USD market value of bitcoin at any time.","Specifically, DLLR is currently backed by ZUSD and Money On Chain DOC, according to Sovryn's website. \"Each individual stablecoin has its own peg mechanism. ZUSD can be redeemed by any holder for the equivalent USD value in BTC. Borrowers can obtain ZUSD for as little as 110% of USD value in BTC. DOC is overcollateralized by BTC, and the system maintains a balance of supply to keep the value at 100% of USD,\" per the website.","DLLR also acts as the default stablecoin of the Sovryn DeFi ecosystem for several use cases, including trading and lending.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Exodus Movement Inc.","content":"ORGANIZATION"},{"type":"JP Richardson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"DLLR","content":"ORGANIZATION"},{"type":"Richardson","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"110%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Sovryn<\/a> Dollar","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"Sovryn","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","WALLET MAKERS"],"authors":["Yogita Khatri","The Block"]}