{"summary":"Recent bitcoin correlation to the S&amp;P500 tend to peak during sharp pullbacks in the crypto&#x27;s price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59482\/rolling-30-day-correlations-between-bitcoin-and-the-sp500-hit-all-time-highs-this-week","publishDate":"2020-03-22T11:32:31","id":10371,"type":null,"title":"Rolling 30-day correlation between bitcoin and the S&amp;P500 hit all time highs this week","category":["MARKETS"],"content":["Rolling 30 day correlation between bitcoin and the S&amp;P500 Index hit all time highs this past week, according data compiled by The Block from Coin Metrics and FactSet.","Since bitcoin's inception, the correlation between bitcoin and the S&amp;P500 has gyrated, switching between negative and positive several times — a sign of a non-significant relationship. Still, recent bitcoin correlation to the S&amp;P500 tends to peak during sharp pullbacks in the price of bitcoin, as shown in the below chart.&nbsp;","","","<span data-v-f87c67ca=\"\">Source: The Block, Coin Metrics, FactSet<\/span>","&nbsp;","U.S. and European equities have taken a beating throughout the month of March, as investors continue to digest the economic impact of the coronavirus. In the past 30 days (21 trading days) the S&amp;P500 is down more than 30% from its peak. This week, however, bitcoin offered a reprieve from the sell-off. By last check, Bitcoin is up nearly 20% since last Sunday versus the S&amp;P500 which closed the week down 7.5%, according to FactSet.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"7.5%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"FactSet","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Ryan Todd","The Block"]}