{"summary":"Facebook’s much-anticipated cryptocurrency project, more than a year in the making, will be unveiled early next week. Facebook and the dozens of partners","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27443\/facebook-to-launch-libra-blockchain-testnet-next-week-backed-by-libra-reserve","publishDate":"2019-06-14T22:58:29","id":10375,"type":null,"title":"Facebook to launch Libra Blockchain testnet next week, backed by Libra Reserve","category":["FACEBOOK"],"content":["<a href=\"https:\/\/www.theblockcrypto.com\/linked\/41231\/ripple-executive-says-facebooks-libra-project-is-a-walled-garden\" data-v-f87c67ca=\"\">Facebook’s<\/a> much-anticipated cryptocurrency project, more than a year in the making, will be unveiled early next week. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/42027\/us-lawmakers-want-facebooks-zuckerberg-to-testify-on-libra-by-january\" data-v-f87c67ca=\"\">Facebook<\/a> and the dozens of partners who <a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/14\/facebooks-cryptocurrency-partners-revealed-we-obtained-the-entire-list-of-inaugural-backers\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The Block identified<\/a> earlier today will introduce the Libra Association, based in Geneva, which will oversee Libra, “a simple global currency and financial infrastructure” meant to reach billions of people.&nbsp;","According to an introductory blog post viewed by The Block, Libra will be built on the Libra Blockchain a “secure, stable, and reliable blockchain” and backed by Libra Reserve, “a reserve of real assets” that will provide the cryptocurrency with “stability, low inflation, global acceptance, and fungibility.”","The Libra Blockchain will be open-sourced under an Apache 2.0 License as of the day of the announcement, expected to occur on Tuesday, June 18, according to the blog post by the social-media giant and as originally reported by <a href=\"https:\/\/techcrunch.com\/2019\/06\/06\/facebook-libra-launch\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">TechCrunch<\/a>. This event will signify the launch of a testnet meant to gather community feedback on the project and inform the future direction.","The blog post, which was sent to major publications over the course of the last week in conjunction with detailed briefings, was sent to The Block by several sources, who requested anonymity for fear of reprisal. It was not shared with The Block, CoinDesk, or any other major cryptocurrency publications under an embargo by Facebook, according to sources who say the firm didn’t want to work with such outlets. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/42658\/bank-of-england-lays-out-terms-of-engagement-for-facebooks-libra\" data-v-f87c67ca=\"\">Facebook<\/a> denies that it wasn't planning on working with such firms.&nbsp;","The release of Libra represents <a href=\"https:\/\/www.theblockcrypto.com\/linked\/6315\/study-finds-the-average-facebook-user-would-take-1000-to-deactivate-their-account\" data-v-f87c67ca=\"\">Facebook’s<\/a> boldest foray into financial services, and the social media giant hopes it will give an opportunity to the “1.7 billion adults globally” who are \"outside of the financial system with no access to a traditional bank.\"","In the post, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/5682\/facebook-is-reportedly-developing-a-stablecoin-for-its-whatsapp-users\" data-v-f87c67ca=\"\">Facebook<\/a> criticizes existing blockchains, which it claims have yet to reach mainstream adoption, making them poor solutions as a store of value and medium of exchange. Facebook believes that its collaborative, compliant and regulated approach will help it overcome hurdles faced by other cryptocurrencies.","As The Block first reported earlier today, the firms involved in the project, as members of its governing consortium, include companies spanning technology, digital assets, and retail. These companies include likes of custodian firm Anchorage, payments firm Visa, cryptocurrency exchange Coinbase, and many others.","","","<a href=\"https:\/\/www.theblockcrypto.com\/post\/225\/facebook-blockchain\" data-v-f87c67ca=\"\">Facebook<\/a> also notes that while some cryptocurrency projects have aimed to “disrupt the existing system and bypass regulations,” the firm believes “collaborating and innovating with the financial sector, including regulators and experts across a variety of industries, is the only way to ensure a sustainable, secure, and trusted framework underpins this new system.”","<a href=\"https:\/\/www.theblockcrypto.com\/post\/27443\/facebook-to-launch-libra-blockchain-testnet-next-week-backed-by-libra-reserve\" data-v-f87c67ca=\"\">Facebook<\/a> and the Libra Association have set a goal of launching the Libra Blockchain and an ecosystem to support it by 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Libra Association","content":"ORGANIZATION"},{"type":"Libra Reserve","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June 18","content":"DATE"},{"type":"Anchorage","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Geneva","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Libra Blockchain","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}