{"summary":"Former IRS Criminal Investigations Chief James Lee will help law enforcement, regulators and agencies build the capacity to fight illicit financial crime.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286787\/chainalysis-hires-former-chief-of-irs-criminal-investigations","publishDate":"2024-04-08T09:01:04","id":1038,"type":null,"title":"Chainalysis hires former chief of IRS Criminal Investigations","category":["COMPANIES"],"content":["Chainalysis, a blockchain forensics company, has appointed James Lee, former chief of the U.S. Internal Revenue Service (IRS) Criminal Investigations, as its Global Head of Capacity Building.","In this role, Lee will help law enforcement, regulators, and other organizations leverage the company's tools to fight illicit financial crime. A company spokesperson told The Block that Lee will report to Chainalysis's SVP of Global Revenue, Bas Lemmens, and work with global teams.","Lee's last day of government service was March 31. He had worked at <a href=\"https:\/\/www.irs.gov\/compliance\/criminal-investigation\" data-v-f87c67ca=\"\">IRS Criminal Investigations<\/a> for nearly 29 years.","\"As Global Head of Capacity Building, I’ll be working to better enable the men and women in law enforcement to thwart many threats in parallel — just like I have been for the last 29 years — and will primarily focus on helping international agencies develop solutions against cryptocurrency-based crime to start,\" Lee said in an official release. \"I’ll also have the chance to help crypto businesses and financial institutions in the private sector build and maintain robust compliance programs.\"","As IRS Criminal Investigations chief, Lee participated in shutting down the dark web marketplace <a href=\"https:\/\/www.theblock.co\/linked\/140739\/us-sanctions-worlds-largest-darknet-market-and-linked-russian-crypto-exchange\" data-v-f87c67ca=\"\">Hydra<\/a>, which helped cash out illicit proceeds from the <a href=\"https:\/\/www.theblock.co\/linked\/104978\/ransomware-victims-have-paid-at-least-81-million-in-crypto-since-start-of-2021-chainalysis\" data-v-f87c67ca=\"\">Colonial Pipeline<\/a> ransomware attack in May 2021. Hackers compromised the energy transportation firm's network, forcing Colonial to pay 75 BTC, worth $5 million at the time, to regain control. The attack caused major fuel shortages on the U.S. east coast. Hydra was eventually <a href=\"https:\/\/www.theblock.co\/post\/140641\/german-authorities-shut-down-hydra-darknet-marketplace-seizing-500-bitcoin\" data-v-f87c67ca=\"\">shut down<\/a> in April 2022.","\"Cryptocurrency is, at least in part, being used for a wide range of nefarious activities, and will only become more so as adoption grows,\" Lee said in a statement. \"But by equipping law enforcement agencies with the best-in-class tools and data to fight this activity, we can ensure that the crypto ecosystem remains as safe as possible, so that people around the world can realize its many benefits without fear of being targeted by criminals.\"","Chainalysis was valued at <a href=\"https:\/\/www.theblock.co\/post\/146274\/chainalysis-doubles-valuation-to-8-6-billion-in-latest-fundraising-round-the-information\" data-v-f87c67ca=\"\">$8.6 billion<\/a> in 2022, The Block previously reported.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"May 2021","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Lee","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"James Lee","content":"PERSON"},{"type":"April 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Chainalysis","content":"PERSON"},{"type":"March 31","content":"DATE"},{"type":"last 29 years —","content":"DATE"},{"type":"SVP of Global Revenue","content":"ORGANIZATION"},{"type":"Hydra","content":"ORGANIZATION"},{"type":"U.S. Internal Revenue Service (IRS) Criminal Investigations","content":"ORGANIZATION"},{"type":"IRS Criminal Investigations","content":"ORGANIZATION"},{"type":"Bas Lemmens","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"$8.6 billion","content":"MONEY"}],"hashtag":["HIRING"],"authors":["MK Manoylov","The Block"]}