{"summary":"The FTX CEO said he did not know exactly what privileges were carved out for Alameda on his exchange and denied he defrauded FTX customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259856\/inside-sbfs-trial-bankman-fried-tells-the-court-he-didnt-know-what-his-team-did","publishDate":"2023-10-27T14:27:42","id":10386,"type":null,"title":"Inside SBF’s trial: Bankman-Fried tells the court he didn’t know what his team did","category":["COMPANIES"],"content":["Sam Bankman-Fried, the CEO of the collapsed crypto exchange FTX, finally took a stand following three weeks of testimonies by his former employees. His account of what happened at FTX seems to differ from that of his subordinates.","First of all, Bankman-Fried firmly denied he defrauded FTX customers or took advantage of their money. He admitted that FTX didn’t turn out to be the innovative entity moving the crypto industry forward that he had hoped; “it turned out the opposite way,” he said.","“I made a number of small and large mistakes,” he explained, adding that for one, FTX did not have a dedicated risk-managing team and “there was a lack of oversight.”&nbsp;","Friday’s hearing started with Bankman-Fried’s direct examination by his main defense lawyer Mark Cohen. SBF answered questions about his background, former job at the trading firm Jane Street, founding Alameda Research and FTX and how those two worked.&nbsp;","With FTX, the original plan was to build a crypto derivatives exchange and sell it to one of the existing spot exchanges, Binance being the most obvious candidate. Binance, however, ended up building its own derivatives platform, while SBF figured out he had a chance at a successful exchange launch himself, he said.","Talking about FTX’s operations, SBF offered an account of how he viewed the privileges Alameda Research had on FTX. At some point, the FTX team realized the algorithm that automatically liquidated leveraged positions underwater could run amok because of the delay in account balance updating function. That could trigger cascading “erroneous” liquidations of positions that should be fine, including ones of Alameda.&nbsp;","As Alameda was the main market maker on FTX, those liquidations by mistake could wipe out its positions and, as a result, leave the exchange’s order book gutted, so that users won’t have a counterparty to trade with and the pricing algorithm would show inadequate figures, SBF said.","“If there were erroneous liquidations for Alameda that would have disastrous consequences for users,” he added.&nbsp;","So SBF went to his top officers, <a href=\"https:\/\/www.theblock.co\/post\/255661\/sbfs-lawyers-want-to-cross-examine-gary-wang-on-300-million-in-alameda-loans\" data-v-f87c67ca=\"\">Gary Wang<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/257840\/inside-sbfs-trial-nishad-singh-said-no-but-not-often-enough\" data-v-f87c67ca=\"\">Nishad Singh<\/a>, both of whom testified in this case earlier. In his own words, Bankman-Fried told Wang and Singh that FTX needs to have some mechanisms in place to prevent erroneous liquidation, like an alert to the affected user or a delay in liquidation. After that, Wang and Singh told their boss they implemented some feature to fix the issue. Bankman-Fried claims he did not know at the time what exactly it was.&nbsp;","Only now, he said, after listening to all testimonies, he figured out it was essentially allowing Alameda to post orders with no collateral and have a negative balance without its positions being liquidated.&nbsp;","Singh, during his own testimony last week, offered a slightly different account. According to him, in 2020, FTX went through a major deleveraging event during which Alameda could not serve as a liquidity provider because it had no available collateral. After discussing the situation, Bankman-Fried asked Singh why should the exchange even care if Alameda had collateral when assigning it to handle liquidations.&nbsp;","“Ultimately, Sam asked me why would it depend at all on free collateral if Alameda is just going to exhaust it all in open orders, and we know that the open orders aren't themselves risky, but not consuming collateral in the same way that having to position does, then why don't we, for Alameda, just remove the condition that we attend to its free collateral when determining if it's an eligible backstop provider for a liquidation,” Singh told the court on Oct. 17.","Bankman-Fried said, again, that he wasn’t aware of Alameda holding FTX users’ funds and borrowing them at liberty.","“At the time, I wasn’t entirely sure what was happening,\" he said, adding that he wished his understanding of the situation was better.","Bankman-Fried told the court he stepped off as Alameda CEO after it “became untenable” for him to run two companies at once. However, he kept a tab on Alameda’s trades, he admitted, and he remained involved in Alameda’s venture capital deals and matters of “risk and hedging,” he said.&nbsp;","He also did not want to leave Alameda’s then new CEO, Caroline Ellison, without help as she “was doing quite well in some areas but needed support in others.” Some aspects of that support would also be “complementary” to what he did at the helm of FTX, Bankman-Fried said.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jane Street","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Wang","content":"PERSON"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"Oct. 17","content":"DATE"},{"type":"Singh","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Anna Baydakova","Zack Abrams","The Block"]}