{"summary":"The hacker claims to have stolen selfies and sensitive personal data belonging to tens of thousands of customers from the U.S. and Brazil.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262726\/hackers-claim-to-have-compromised-bankrupt-bitcoin-atm-firm-coin-cloud-report","publishDate":"2023-11-12T18:41:08","id":10385,"type":null,"title":"Hackers claim to have compromised bankrupt Bitcoin ATM firm Coin Cloud: Report","category":["CRYPTO ECOSYSTEMS"],"content":["An unidentified hacking group claims to have stolen 70,000 customer selfies and sensitive personal information for 300,000 customers of Coin Cloud, a Bitcoin ATM firm which operated over 4,000 machines in the U.S. and Brazil until its bankruptcy filing this February. The hacking group also claims to have stolen the source code to Coin Cloud's backend system, according to a <a href=\"https:\/\/twitter.com\/vxunderground\/status\/1723749038057574425\" data-v-f87c67ca=\"\">post<\/a> on X from cybersecurity expert vx-underground.","The post includes redacted images, purportedly depicting the customer selfies and personal identifying information the group has accessed, which includes the Social Security numbers of customers along with their name, address, date of birth, occupation, phone number, and more, according to the report.&nbsp;","Vx-underground told The Block that the unidentified hacker was sharing the claims in private channels and that the leaked database may be posted online soon. Coin Cloud could not immediately be reached for comment.&nbsp;","Coin Cloud <a href=\"https:\/\/www.wsj.com\/articles\/coin-cloud-a-crypto-atm-operator-files-for-bankruptcy-11675881838\" data-v-f87c67ca=\"\">filed for bankruptcy<\/a> in February following \"business difficulties and legal problems\" resulted in losses of $40 million over the first nine months of 2022, its former CEO told the Wall Street Journal.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"first nine months of 2022","content":"DATE"},{"type":"Coin Cloud","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Brazil","content":"LOCATION"},{"type":"February","content":"DATE"}],"hashtag":["HACKS"],"authors":["Zack Abrams","The Block"]}