{"summary":"After much anticipation, crypto lending startup BlockFi has confirmed the close of a $350 million Series D fundraising round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97974\/blockfi-confirms-series-d-3-billion-valuation","publishDate":"2021-03-11T08:36:45","id":10382,"type":null,"title":"BlockFi confirms $350 million Series D funding round at $3 billion valuation","category":["STARTUPS"],"content":["After much anticipation, crypto lending startup BlockFi has confirmed the closing of a blockbuster Series D round that values the company at $3 billion.&nbsp;","In a media release, the firm said it has raised $350 million from a wide range of investors including Tiger Global and Bain Capital Ventures, confirming <a href=\"https:\/\/www.theblockcrypto.com\/daily\/94632\/blockfi-series-d-round-billion-valuation\" data-v-f87c67ca=\"\">previous reporting<\/a>&nbsp;by The Block.&nbsp;","The firm — which has a business that spans lending, trading, and asset management — now counts a wide-range of crypto native and traditional investors as backers including Valar Ventures, which <a href=\"https:\/\/blockfi.com\/blockfi-raises-series-b-led-by-valar-ventures\" data-v-f87c67ca=\"\">led<\/a> its Series B funding round last year. To date, the firm has raised about $450 million from investors including Anthony Pompliano, Jump Capital, Castle Island Ventures, and CMS Holdings. &nbsp;","The latest capital raise follows a period of rapid growth for the company. The firm has grown its business to cover a retail and institutional client base of more than 225,000. It oversees more than $15 billion and reports monthly revenues of $50 million.&nbsp;","Still, that growth has come with its hiccups, including mounting questions about how BlockFi makes money. Specifically, detractors have raised questions about the ramifications of Grayscale's Bitcoin Trust trading at a discount for the firm. BlockFi profits from the famed GBTC premium trade in which investors can lock up bitcoin into GBTC and collect the spread between the trust shares and the underlying net asset value of the bitcoin held by the trust.&nbsp;","\"In less than six months since we completed our Series C, bitcoin and other digital assets have assumed a central role in many investors' portfolios and in broader financial markets,\" said BlockFi co-founder and CEO Zac Prince.&nbsp;\"Our&nbsp;conviction that digital assets are the future of finance has been vindicated by our client base,&nbsp;which grew 10X YoY in 2020 and has more than doubled since the end of 2020.\"","BlockFi has been building out its team to support its foray into asset management. The firm is looking for a head of trust products to helm its BlockFi Bitcoin Trust, which was first unveiled in February. It is also looking to fill a head of asset management role.&nbsp;","Looking forward, BlockFi said the injection of capital will help with the upcoming launch of its bitcoin credit card. The money will also help BlockFi expand internationally and make strategic acquisitions.","The firm also expects to grow its headcount from 500 to about 1,000 by the end of 2021.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anthony Pompliano","content":"PERSON"},{"type":"$350 million","content":"MONEY"},{"type":"$450 million","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Zac Prince","content":"PERSON"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"BlockFi","content":"PERSON"},{"type":"$15 billion","content":"MONEY"},{"type":"Bain Capital Ventures","content":"ORGANIZATION"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"BlockFi Bitcoin Trust","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Valar Ventures","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BLOCKFI","LENDING"],"authors":["Frank Chaparro","The Block"]}