{"summary":"The crypto exchange cited market challenges and the need to protect Line’s blockchain ecosystem as the reasons for its decision.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190291\/line-owned-crypto-exchange-bitfront-to-shut-down-by-march-2023","publishDate":"2022-11-28T10:16:08","id":10380,"type":null,"title":"Line-owned crypto exchange Bitfront to shut down by March 2023","category":["EXCHANGES"],"content":["Crypto exchange Bitfront will shut down its services in a staggered approach up until the end of March 2023.","Bitfront’s shutdown process begins on Nov. 28, with the suspension of new account signups, the platform said in an <a href=\"https:\/\/www.bitfront.me\/notice\/20208406\" data-v-f87c67ca=\"\">announcement<\/a>. Credit card deposits for existing users have already been stopped. The next step of the process takes place in December when the platform will suspend all crypto and U.S. dollar deposits. At that time, Bitfront will also cancel all open trading orders.","The final closure of withdrawals will happen on March 31, 2023, at 05:00 AM UTC. Bitfront advised customers to ensure they remove all of their funds from the platform on or before that date.","Bitfront cited the challenges of the “rapidly evolving” crypto market as part of the reason for shutting down the platform. The crypto exchange stated that it had tried to overcome these challenges to no avail.","For Bitfront, shuttering the platform is a necessary step to protect Line’s blockchain ecosystem. \"<span data-ogsc=\"rgb(0, 124, 14)\" data-v-f87c67ca=\"\">This decision to close is part of Line Blockchain's choice to focus on the businesses it is currently doing well and can do well,\" a spokesperson for Line told The Block. <\/span>Japanese social media giant <a href=\"https:\/\/www.theblock.co\/post\/57265\/messaging-giant-line-shuts-down-singapore-crypto-exchange-launches-a-global-platform-based-in-the-us\" data-v-f87c67ca=\"\">Line launched Bitfront<\/a> in February 2020 as a U.S.-based exchange. At the time, the company had shut down its Singapore-based crypto exchange Bitbox.","Despite Bitfront shutting down, Line says it is not exiting the crypto space. \"<span data-ogsc=\"rgb(0, 124, 14)\" data-v-f87c67ca=\"\">Line is preparing a new open network so that Link can be used more within various external exchanges and third-party ecosystems, as well as exchanges operated by Line,\" said the Line spokesperson. For context, Link is the native token of the Line blockchain ecosystem.<\/span>","Bitfront is the latest crypto exchange to&nbsp; <a href=\"https:\/\/www.theblock.co\/post\/188635\/ftx-acquired-liquid-pauses-trading-five-days-after-suspending-withdrawals\" data-v-f87c67ca=\"\">shut down<\/a> amid the current crypto market decline.&nbsp;The year-long bear market has also been further exacerbated by the recent collapse of FTX, formerly one of the biggest crypto exchanges. The FTX collapse reportedly triggered a wave of liquidity outflows from exchanges. This has caused some smaller platforms like <a href=\"https:\/\/www.theblock.co\/post\/190260\/aax-crypto-exchange-vp-ben-caselin-resigns-amid-liquidity-crisis?utm_source=cryptopanic&amp;utm_medium=rss\" data-v-f87c67ca=\"\">AAX to experience solvency issues<\/a>. Line, however, told The Block that Bitfront shutting down had nothing to do with the issues affecting other platforms in the crypto space.","<em data-v-f87c67ca=\"\">Update: This article has been updated to clarify that Bitfront shutting down has nothing to do with the <span data-ogsc=\"rgb(0, 124, 14)\" data-v-f87c67ca=\"\">recent exchange related issues in the industry as well additional comments from a Line spokesperson.<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 28","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"March 31, 2023","content":"DATE"},{"type":"05:00 AM UTC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Bitfront","content":"PERSON"},{"type":"February 2020","content":"DATE"},{"type":"Bitfront","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}