{"summary":"France is set to implement stringent new measures for the country&#x27;s cryptocurrency sector, The Block has learned.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/87001\/france-crypto-rules-mandatory-kyc-crypto-to-crypto","publishDate":"2020-12-08T15:09:35","id":10392,"type":null,"title":"France is on the verge of imposing mandatory KYC rules for all crypto transactions, industry sources say","category":["REGULATION"],"content":["France is set to implement stringent new measures for the country's cryptocurrency sector, The Block has learned.","The French Finance Ministry is preparing to not only harden know-your-customer (KYC) rules for crypto firms but also regulate crypto-to-crypto transactions, according to Simon Polrot, president of French crypto association ADAN.","Polrot told The Block in an interview that&nbsp;he had been informed by the ministry of the proposed measures because ADAN is \"a trusted interlocutor\" on crypto-related matters.","Overall, several ministries were involved in crypto discussions, said Polrot, including the Ministry of Internal Affairs and the Prime Minister's Cabinet.","Two additional sources — Nicolas Louvet, CEO of Coinhouse Group, and Pierre-Guy Bareges, CTO of Digital Service Group — confirmed to The Block about the proposed measures. Coinhouse provides crypto trading and custody services in France and is registered by the country's financial markets regulator, the AMF. Digital Service Group is the operator of French crypto exchange Zebitex, and it is currently undergoing a licensing process with the AMF.","Both Louvet and Bareges said in separate interviews that they were informed of the upcoming measures by the French government.","The Finance Ministry did not respond to The Block's request for comment by press time.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Why stricter rules?<\/strong><\/span>","The main reason for the proposed stricter measures are the recent terrorist attacks on France, these sources told The Block.","Two weeks before the attacks, i.e., in September, French police had <a href=\"https:\/\/abcnews.go.com\/Technology\/wireStory\/french-arrest-29-cryptcurrency-scheme-finance-jihadis-73315042\" data-v-f87c67ca=\"\">arrested 29 people<\/a> suspected of funding Islamist extremists in Syria using cryptocurrency.","\"What happened is one of [the] wannabe digital assets services providers (DASP) (or PSAN in French) let some people using the services to send money abroad, especially in Turkey and Syria, and then faced investigation from security services,\" Bareges told The Block. \"Then the police ran an operation arresting those people and said that bitcoin was used to finance terrorism, and then the finance minister declared we need to control crypto much better.\"","In October, France's Finance Minister Bruno Le Maire <a href=\"https:\/\/twitter.com\/DimPolitique\/status\/1317793442181926912\" data-v-f87c67ca=\"\">said<\/a> on national television that the country would make proposals \"to strengthen the control of financial funds\" because \"cryptocurrencies pose a real problem of terrorist financing.\"","Polrot characterized the moves as \"political positioning.\"","\"The government had to react and take a stance and to do something to explain that they are doing something to fight terrorism,\" he told The Block.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">KYC measures<\/strong><\/span>","As for the first proposed measure, the Finance Ministry is set to publish a decree later this week — likely Wednesday or Thursday — which will mandate full KYC for all crypto transactions, including crypto-to-crypto transactions, Polrot, Louvet, and Bareges, all told The Block.","A decree is the rule of law in France, and does not go through any parliamentary approval processes.","The full KYC of all crypto transactions means all crypto exchanges and other firms will have to verify their customers, irrespective of transaction size.","In other words, all crypto transactions worth more than €0 will have to go through full KYC processes and require two forms of government identification (ID). The current limit for KYC checks is €1,000, and at present it applies only to crypto-to-fiat transactions.","Including crypto-to-crypto transactions for the KYC rules is \"harsher than other jurisdictions,\" said Polrot.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLouvet and Bareges echoed these sentiments, adding that this KYC measure would lead to higher compliance costs as well as more friction when it comes to onboarding users.","Currently, the cost of onboarding a user is around €1, said Bareges, and in light of the proposed measures, that cost could shoot up to €5. \"And you're not sure whether that user will make a volume that will cover those costs,\" Bareges said.","Bareges went on to say that the KYC measure is a \"concern for all actors in France\" because customers could go to foreign exchanges where constraints are much less restrictive.","To be sure, any rules announced will apply to crypto firms that are based in France and those firms that actively target residents of France, per the country's laws.&nbsp;","Moreover, the full KYC measure will also remove the benefit of \"occasional\" crypto transactions, or one-off transactions worth €1,000 or less, allowed to carry without KYC.","\"It's a shame,\" Louvet told The Block. \"From a user experience point of view, we won't be able to offer a nice experience to someone to make one small or two small transactions without the full KYC [...] but that's not a gamer changer in terms of business, because if my only customers were people making transactions of €100, I wouldn't do this business.\"","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mandatory registration for crypto-to-crypto exchanges<\/strong><\/span>","The other major proposed rule change is a mandatory registration for crypto-to-crypto exchanges, Louvet, Bareges, and Polrot all told The Block.","Currently, in France, the mandatory registration rule is only for crypto-fiat exchanges and crypto custodians. These two types of firms have <a href=\"https:\/\/fxnewsgroup.com\/forex-news\/cryptocurrency\/french-regulator-reminds-digital-assets-businesses-about-registration-deadline\/#:~:text=France's%20Financial%20Markets%20Authority%20(AMF,to%20comply%20with%20registration%20requirements.\" data-v-f87c67ca=\"\">until December 18<\/a> to get their licenses, as previously reported, or else they face fines and possible imprisonment.","But with only ten days remaining for the deadline, \"a lot of service providers are very anxious,\" said Polrot, referring to whether the firms will get their licenses by the deadline. He claimed that around 30 crypto firms are awaiting results. The situation is similar to the U.K., <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86276\/uk-fca-crypto-registry-backlog-aml\" data-v-f87c67ca=\"\">as The Block reported recently.<\/a>","As for this proposed measure, crypto-to-crypto exchanges could receive a six-month period during which they would have to comply, said Polrot and Louvet.","The scope of this measure is also not clear currently, Polrot said, meaning it remains to be seen whether global crypto exchanges operating in France will also be brought under this rule.","The tangible impact isn't exactly clear, either. According to The Block Research, trade volumes for the country's exchange ecosystem are relatively small compared to their industry peers.&nbsp;","Volume data is publicly available only for two exchanges — Paymium and Zebitex — and these exchanges have a combined volume of about $40 million since the start of 2020.","<br data-v-f87c67ca=\"\">\n","","Coinhouse's Louvet did not reveal specific numbers but he said the firm's revenue had grown 2.5 times from the last year. Still, volumes this year aren't at the same level as those seen during the 2017-2018 crypto market boom, he said.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">A source at the French Finance Ministry confirms<\/strong><\/span>","After the publication of this story, a source at the French Finance Ministry, with knowledge of the development, confirmed to The Block on Wednesday about the forthcoming stricter measures.","They said, \"an ordinance will be presented this week, followed by a decree by the end of this month, and all crypto firms will get six months to comply with rules.\"","Within this timeframe, \"additional measures will be implemented to support and simplify digital identification for crypto-assets users. This will therefore make the double KYC no longer necessary, only one will be required,\" the source continued.","They also confirmed the main reason behind the upcoming measures — i.e., preventing terrorism financing through cryptocurrencies.","\"What we are trying to do in France is to fight against the financing of terrorism through crypto-assets. But our overall goal remains to foster innovation through crypto-assets,\" said the source. \"We'll carry both these messages at the EU level.\"","<em data-v-f87c67ca=\"\">This post has been updated for clarity and with more information.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ministry of Internal Affairs","content":"ORGANIZATION"},{"type":"Coinhouse Group","content":"ORGANIZATION"},{"type":"Turkey","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$40 million","content":"MONEY"},{"type":"EU","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Pierre","content":"PERSON"},{"type":"KYC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"December 18","content":"DATE"},{"type":"AMF","content":"ORGANIZATION"},{"type":"Finance Ministry","content":"ORGANIZATION"},{"type":"Louvet","content":"LOCATION"},{"type":"Digital Service Group","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CTO of Digital Service Group —","content":"ORGANIZATION"},{"type":"Nicolas Louvet","content":"PERSON"},{"type":"Simon Polrot","content":"PERSON"},{"type":"French Finance Ministry","content":"ORGANIZATION"},{"type":"Bruno Le Maire","content":"PERSON"},{"type":"Syria","content":"LOCATION"},{"type":"Polrot","content":"PERSON"},{"type":"Polrot","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Bareges","content":"LOCATION"},{"type":"Bareges","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}