{"summary":"DigiFT says the new RWA tokens offer users direct beneficial ownership of AA+ rated and short-term T-Bills.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284382\/singapore-digift-tbill-rwa","publishDate":"2024-03-25T05:28:00","id":10399,"type":null,"title":"Singapore’s DigiFT launches US T-Bill RWA tokens","category":["INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Singapore’s on-chain real-world asset (RWA) exchange DigiFT announced today the launch of new tokens based on the U.S. Treasury Bills.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new product adopts the structure of depository receipts, which traditionally involves a certificate reflecting shares of a company outside the local stock market. Using this structure, DigiFT <\/span><a href=\"https:\/\/www.digift.sg\/announcements\/first-rwa-depository-receipt-tokens.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> it offers users direct beneficial ownership of AA+ rated and short-term T-Bills, and will provide a legal stream of returns from underlying securities.<\/span>","<span data-v-f87c67ca=\"\">“Presently, the majority of RWA tokens in circulation are wrapped tokens that represent interest in a special purpose vehicle, feeder fund or derivative instrument which holds or mirrors the underlying assets,” the company said in the announcement. “These wrapped tokens are often structured in complex legal arrangements, making it challenging for investors to fully comprehend the legal implications.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company stated that its depository receipt structure addresses this issue by providing a “more straightforward” legal framework that would be easier for investors to understand.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">DigiFT added that its new RWA token will be suited for stablecoin issuers and Web3 product developers that are looking for regulatory-compliant treasury, as well as cash management solutions. Institutional and accredited investors can also access the new product from authorized self-custodial wallets using fiat currency or stablecoins, according to the announcement.<\/span>","<span data-v-f87c67ca=\"\">DigiFT holds a Capital Markets Services License and is a Recognized Market Operator, according to the Monetary Authority of Singapore <\/span><a href=\"https:\/\/eservices.mas.gov.sg\/fid\/institution\/detail\/252967-DIGIFT-TECH-SINGAPORE-PTE-LTD\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The market capitalization for RWA tokens has grown 15.2% in the last 24 hours to $6.5 billion, according to CoinGecko <\/span><a href=\"https:\/\/www.coingecko.com\/en\/categories\/real-world-assets-rwa\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data<\/span><\/a><span data-v-f87c67ca=\"\">, indicating a rising interest in the asset class. Ondo, the RWA token with the largest market cap on CoinGecko, expanded nearly 93% in value over the past seven days.<\/span>","<span data-v-f87c67ca=\"\">Binance Research <\/span><a href=\"https:\/\/www.theblock.co\/post\/272658\/bitcoin-ai-rwa-crypto-adoption-binance-2024\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">identified<\/span><\/a><span data-v-f87c67ca=\"\"> real-world asset tokenization as one of the key themes in crypto in 2024. Bringing off-chain assets onto blockchain networks can offer improved transparency and efficiency, Binance Research said. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monetary Authority of Singapore <\/span><a href=\"https:\/\/eservices.mas.gov.sg\/fid\/institution\/detail\/252967-DIGIFT-TECH-SINGAPORE-PTE-LTD\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website","content":"ORGANIZATION"},{"type":"Capital Markets Services License","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Binance Research","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$6.5 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"15.2%","content":"PERCENT"},{"type":"93%","content":"PERCENT"}],"hashtag":["TOKENIZATION","TOKENS"],"authors":["Danny Park","The Block"]}