{"summary":"Starknet rolled out version 0.13.1 to transition from &quot;calldata&quot; to &quot;blobs&quot; for cheaper transactions after Dencun upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281891\/starknet-implements-code-optimizations-for-cost-savings-after-dencun","publishDate":"2024-03-12T09:00:02","id":10393,"type":null,"title":"Starknet optimizes code for savings following Dencun upgrade tomorrow","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The Starknet Foundation is introducing optimizations that will run parallel to Ethereum’s <a href=\"https:\/\/www.theblock.co\/post\/276747\/dencun-upgrade-expected-on-march-13-to-bring-blobs-to-ethereum-mainnet\" data-v-f87c67ca=\"\">Dencun upgrade<\/a>, aimed at significantly lowering transaction fees on the Layer 2 network.<\/span>","<span data-v-f87c67ca=\"\">The measures include the release of Starknet’s version 0.13.1 today, which will capitalize on EIP-4844 after Dencun goes live on the mainnet tomorrow. This update will transition Starknet from using the costlier \"calldata\" method for data transactions to cost-efficient \"blobs\" transaction type, offering a direct path to fee reduction.<\/span>","<span data-v-f87c67ca=\"\">These blob transactions, also called <a href=\"https:\/\/www.theblock.co\/post\/281258\/base-to-support-eip-4844-from-day-1-following-dencun-upgrade?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">EIP-4844<\/a> (or proto-danksharding), are planned to go live on the Ethereum mainnet with the Dencun upgrade activated at epoch 269568 tomorrow at 13:55 UTC.<\/span>","<span data-v-f87c67ca=\"\">Blobs will be an additive feature on the network, increasing data availability without impacting the existing Ethereum infrastructure, resulting in cheaper transactions across Layer 2 rollups such as Starknet.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“More than users on any other L2, they are expected to see Dencun directly cut fees. This is because Starknet fees have the highest proportion of Data Availability costs, where the savings are being made. But this is just the start,” Diego Oliva, CEO of the Starknet Foundation, said.<\/span>","In addition to integrating EIP-4844, the Starknet Foundation plans to improve its shared prover (SHARP) infrastructure. For the uninitiated, STARK technology scales by producing a single proof for every block of transactions.","Instead of sending every block’s proof to Ethereum, SHARP aggregates many proofs. Then, these are packed together in batches, known as “trains.” From this week and in a separate move, the size of these trains will gradually increase. In other words, the number of Starknet transactions that are jointly verified on Ethereum will rise, according to a statement.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Data Availability","content":"ORGANIZATION"},{"type":"Diego Oliva","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Dencun","content":"PERSON"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ROLLUPS","STARKNET"],"authors":["Vishal Chawla","The Block"]}