{"summary":"Crypto financial services company BCB Group is raising funds via convertible notes that will convert to its future Series B with a pre-money valuation capped at $200 million, sources told The Block.\nBCB Group founder and CEO Oliver von Landsberg-Sadie said the company is raising over $20 million, declining to comment on the structure of the round and valuation.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213972\/bcb-group-targets-valuation-of-200-million-in-new-fundraising-effort","publishDate":"2023-02-22T12:03:35","id":1039,"type":null,"title":"BCB Group targets valuation of $200 million in new fundraising effort","category":["Deals"],"content":["BCB Group, a crypto financial services company based in London, is raising funds via convertible notes.","The notes will convert to BCB Group's future Series B equity round with a pre-money valuation capped at $200 million, two sources with direct knowledge of the matter told The Block.","BCB Group founder and CEO Oliver von Landsberg-Sadie confirmed that the company is raising funds but declined to comment on the structure of the round and valuation. He said BCB is raising more than $20 million and plans to close the round by early March.","\"This year, a raise of $20m+ by early March, backed by a balance of new and existing investors, gives us more firepower for a number of growth initiatives ahead of us,\" said Landsberg-Sadie. \"These include a larger European footprint as well as stronger resourcing for new and existing products.\"","The company appears to have maintained its value through last year’s turbulence that saw some firms raise funds at lower valuations. BCB raised its Series A at a $200 million post-money valuation, and the new round comes at a $200 million pre-money valuation, another person with direct knowledge of the matter told The Block.","BCB Group was founded in 2017 and provides several services to crypto businesses including payments, liquidity and custody. It is regulated in the UK and Switzerland and serves high-profile clients, including Bitstamp, Crypto.com, Fireblocks, Galaxy, Gemini, Huobi and Kraken, according to its <a href=\"https:\/\/www.bcbgroup.com\/about-us\/\" data-v-f87c67ca=\"\">website<\/a>.","Landsberg-Sadie said BCB Group's revenue grew by nearly 50% in 2022. The ongoing fundraise, once completed, will help the company beef up its legal, risk and compliance functions to be scale-ready ahead of a future Series B, he said.","\"We have a unique opportunity right now to empower a much larger share of the global crypto industry at the payments layer where it all ultimately connects,\" Landsberg-Sadie said. \"This raise comes at a time when regulators are introducing more definition and structure to the industry as a whole, reinforcing our mission to connect and bank the industry.\"","The new funding effort comes more than a year after BCB <a href=\"https:\/\/www.theblock.co\/linked\/131385\/bcb-group-raise\" data-v-f87c67ca=\"\">raised<\/a> $60 million in Series A funding, which it said, at the time, was the largest Series A funding round in the UK blockchain industry. BCB's existing investors include Pantera Capital, Blockchain.com Capital, Nexo, Wintermute and Circle."],"hashtag":["SERIES B"]}