{"summary":"Binance CEO Changpeng Zhao explained why the exchange decided to keep Mithril’s deposit, which is now worth $50 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195665\/binance-ceo-explains-why-exchange-wont-refund-mithril-200000-bnb-after-delisting","publishDate":"2022-12-16T06:53:16","id":10390,"type":null,"title":"Binance CEO explains why exchange won&#x27;t refund Mithril 200,000 BNB after delisting","category":["EXCHANGES"],"content":["Binance CEO Changpeng Zhao explained why the exchange chose not to refund the deposit of 200,000 BNB to Mithril after <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-delist-mith-tribe-rep-and-btcst-on-2022-12-22-35a4169422154c838f012331f5f4b425\" data-v-f87c67ca=\"\">delisting<\/a> its token yesterday.","Blockchain project Mithril said it deposited 200,000 BNB to Binance in 2018 — about $1 million at the time — as part of the exchange’s listing process. But the project fell out of favor and was delisted yesterday. The value of these deposited tokens is currently worth more than $50 million, which the team <a href=\"https:\/\/www.theblock.co\/post\/195326\/mithril-binance-delisting-refund?utm_source=cryptopanic&amp;utm_medium=rss\" data-v-f87c67ca=\"\">demanded<\/a> back.","The Binance chief broke down why the exchange decided to keep Mithril’s deposit. Zhao implied the team made the right decision (of not releasing the deposit), claiming it acted within its right. He <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1603649325300453376\" data-v-f87c67ca=\"\">said<\/a> on Twitter that since the website of the project was offline, the Mithril team violated the listing terms.","In his reply to Mithril, Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1603649325300453376\" data-v-f87c67ca=\"\">said<\/a>: “Your token price is way below the trigger levels. Reading the comments. Your website is offline. You haven’t tweeted or updated your community for almost 2 years. I believe our team has made the right decision and acted fully within our right to do so.”","Zhao added the team had the right to take the deposit — made by a crypto project — in two conditions. The first is if the price of the token trades lower below a certain trigger level for more than 15 days and the second is a situation that creates a “material adverse effect” on the project, its token and\/or its users. The team’s defunct communications were cited as the second condition.","“The Insurance Deposit is there to encourage builders to continue to build,” Zhao said, further implying Mithril's team had stopped working on the project.","A Binance spokesperson said that when tokens no longer meet its standards, they go through a review process and may be delisted. \"The insurance deposit was collected as a way to monitor and incentivise project performance, which is in our users’ interests. The deposit amount and terms were mutually agreed in 2018,” they said.","<em data-v-f87c67ca=\"\">With reporting assistance from Lucy Harley-McKeown.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mithril","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"Mithril","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Mithril","content":"LOCATION"},{"type":"Zhao","content":"PERSON"},{"type":"Lucy Harley","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"The Insurance Deposit","content":"ORGANIZATION"},{"type":"McKeown","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BINANCE"],"authors":["Vishal Chawla","The Block"]}