{"summary":"A man is suing Gemini, claiming it was negligent not to notice significant sums of money moved from his money market account to buy cryptocurrency on the exchange over seven days\nWhile the trader was out of reach in the Australian outback, someone allegedly stole money from his CIT account and wired it to Gemini to purchase crypto\nLater, he noticed fraudulent activity on his accounts with other banks, and is suing CIT in addition to Gemini, claiming it violated the Electronic Funds Transfer Act","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/31002\/man-takes-on-gemini-and-cit-in-lawsuit-after-his-263799-28-was-allegedly-stolen-to-purchase-crypto","publishDate":"2019-07-14T09:45:48","id":104,"type":null,"title":"Man takes on Gemini and CIT in lawsuit after his $263,799.28 was allegedly stolen to purchase crypto","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","Imagine stealing money from someone’s money market account and wiring it to Gemini to buy cryptocurrency. Actually, you don’t have to imagine it because that is allegedly what happened in this case.","Plaintiff says that in April 2018 he had over $263,799 in his accounts with CIT. He left the country and traveled to China and Australia and while in Australia says he was in the outback and had no access to his email or or cell service.","While in the outback, Plaintiff alleges that “unknown individuals stole his identity and accessed his bank accounts with CIT. On April 24, 2018, unknown individuals transferred $263,799.28 from Plaintiff's certificate of deposit account with CIT to Plaintiff’s money market account with CIT with account number ending in 9645 (“CIT Money Market Account”).” A few days later, wires in the amounts of $92,500 and $157,000 were made to Gemini. That money was allegedly used to purchase cryptocurrency by “unauthorized individuals” and not plaintiff.","In June 2018 Plaintiff says he discovered fraudulent activity in two other bank accounts and realized he had been locked out of his CIT account. CIT rejected a dispute that he filed with them, and this lawsuit followed, naming both CIT and Gemini. As to CIT, plaintiff says that it was obligated under to refund the wires because they were notified during the statutory notice period under California law. Also, plaintiff says that CIT violated the Electronic Funds Transfer Act.","As to Gemini, Plaintiff says it should have known given the amount of money transferred in seven days “that they were dealing with impostors” and that their failure to do so was an unfair trade practice. The technical term for this particular allegation is “pretty weak tea.” Now I suppose if Plaintiff can show that Gemini has weak AML\/KYC processes and fraud prevention maybe this gets past a motion to dismiss. Gemini will probably argue — assuming that Plaintiffs claim is true — that they were fooled by a sophisticated criminal enterprise and aren’t liable for a crime that took place elsewhere.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":["GEMINI"]}