{"summary":"GSR launches GSR Capital Limited and sees &quot;remarkably high interest&quot; from potential investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161509\/gsr-capital-opens-crypto-funds","publishDate":"2022-08-04T13:13:21","id":10409,"type":null,"title":"GSR Capital opens crypto funds for new investors","category":["CRYPTOCURRENCY"],"content":["GSR Capital is now open for your business.","The digital asset trading company launched GSR Capital Limited yesterday and is building investment products for institutions, family offices and others.","GSR, founded by former Goldman Sachs executives nine years ago, traditionally partners with cryptocurrency projects and provides liquidity in crypto markets, including for Binance, Coinbase and FTX. It started building out GSR Capital last year, hiring research and operations staff and is now offering two funds, one focused on bitcoin exposure and the other on the broader market.","They’ve already seen “remarkably high interest” from family offices and institutional investors who want exposure to digital assets, according to GSR CEO Jakob Palmstierna.","“One of the best ways of getting exposure to a new asset class is via allocating to an investment manager, so we looked around us, saying, ‘Are there any really credible investment alternatives in crypto?’ And we find that the answer was pretty weak,” Palmstierna said. “What we want to create is something that looks and feels like any other line item on an allocated portfolio except that the underlying exposure is to this new asset class.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nGSR Capital is aiming to provide familiarity and credibility to traditional investors interested but cautious about moving into a new asset class. And that asset class has taken a beating this year, with prices plunging, coins like luna collapsing and high-profile bankruptcies like Three Arrows Capital dominating the headlines.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nStill, Palmstierna remains confident. Even if you know nothing about crypto, he said, the potential is more than evident. He cited the opportunities inherent in blockchain technology, the deep talent pool in the industry and more than $36 billion in venture capital invested last year.","“You have promising technology with the greatest talent density with a huge amount of capital behind it,” Palmstierna said. “Do you want to invest one or two percent into that promising technology? It’s almost a no-brainer.”","While the digital assets can be esoteric and mysterious, GSR is counting on its long-term involvement in the crypto space and the creation of an experience that feels familiar to more traditional investors. The aim is to “make the experience as comfortable as possible, especially for institutions moving into what’s a new space for them and obviously that brings a lot of challenges for them both from an investment analysis perspective, but also from a governance, due diligence perspective,” Chief Operating Officer Andrew Moss said.","The funds have a lot in common with traditional investment vehicles, but there are crypto-specific facets to take into account, such as the 24\/7 nature of trading and implementing research framework on day one that can account for that, Moss said.","Palmstierna said two more funds are likely to be launched this year as the company ramps up.","“Investors are desperately looking for new sources of potential returns,” Palmstierna said. “We think we’re creating something that doesn’t exist today which will help investors actually coming into the space.”","<em data-v-f87c67ca=\"\">Editor's note: GSR provided new information regarding its two funds, clarifying a previous version of this story.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jakob Palmstierna","content":"PERSON"},{"type":"GSR","content":"ORGANIZATION"},{"type":"GSR Capital","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"two percent","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Andrew Moss","content":"PERSON"},{"type":"Palmstierna","content":"PERSON"},{"type":"Moss","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$36 billion","content":"MONEY"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}