{"summary":"Bitcoin-focused nonprofit Brink will use the funding to bolster its grant program for Bitcoin developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234580\/brink-gets-5-million-of-funding-for-bitcoin-devs-from-jack-dorseys-fund","publishDate":"2023-06-14T12:09:45","id":10408,"type":null,"title":"Brink gets $5 million of funding for Bitcoin devs from Jack Dorsey’s fund","category":["CRYPTO ECOSYSTEMS"],"content":["Bitcoin nonprofit Brink raised $5 million from Jack Dorsey’s Smart Small funding initiative to continue financing independent Bitcoin developers.","“We plan to put the funding toward our grants program including sustaining our existing Bitcoin developer grantees and potentially adding any qualified new grant applicants as grantees,” said Brink co-founder Mike Schmidt.&nbsp;","The funding will be doled out in increments of $1 million each year over a five year period.&nbsp;","In April 2020, then Twitter CEO Jack Dorsey said he would give $1 billion of his equity in Block (then called Square) to a new fund called <a href=\"https:\/\/startsmall.llc\/\" data-v-f87c67ca=\"\">Smart Small<\/a>. Its original purpose was to support Covid-19 relief, with the plan to expand beyond this after the pandemic.&nbsp;","So far Smart Small, which reached a total of $1.4 billion in funding, has spent $515 million and has $900 million remaining. It has given funding to technology projects focused on privacy, including the Tor project and messaging app Signal.","Brink was founded in 2020 to boost the Bitcoin protocol through research and development, and by supporting the Bitcoin developer community. It has a fellowship program to onboard new software engineers into Bitcoin development and a grants program for existing Bitcoin developers.","In May, Brink said it has started <a href=\"https:\/\/brink.dev\/blog\/2023\/05\/04\/fabian-jahr\/\" data-v-f87c67ca=\"\">supporting<\/a> Bitcoin developer Fabian Jahr, who had previously received funding from crypto exchange Okcoin.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"$1.4 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Fabian Jahr","content":"PERSON"},{"type":"April 2020","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"19","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brink","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$515 million","content":"MONEY"},{"type":"Covid","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"Mike Schmidt","content":"PERSON"},{"type":"Smart Small","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"$5 million","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}