{"summary":"Figure Technologies, the blockchain lending startup founded by former SoFi CEO Mike Cagney, has completed its first asset-backed securitization process on a blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58381\/mike-cagneys-figure-completes-first-securitization-on-blockchain-claiming-to-help-reduce-costs-by-over-100-basis-points","publishDate":"2020-03-11T06:01:18","id":10406,"type":null,"title":"Mike Cagney&#x27;s Figure completes first securitization on blockchain, claiming to help reduce costs by over 100 basis points","category":["LAYER 1S"],"content":["Figure Technologies, the blockchain lending startup founded by former SoFi CEO Mike Cagney, has completed its first asset-backed securitization process on a blockchain.","<a href=\"https:\/\/www.imf.org\/external\/pubs\/ft\/fandd\/2008\/09\/basics.htm\" data-v-f87c67ca=\"\">Securitization<\/a> is the process in which certain types of loans are pooled so that they can be repackaged into interest-bearing securities. Figure announced Wednesday that it has completed one such process, involving $150 million, on its native blockchain Provenance.","\"Provenance enables the automation of manual processes, reducing the cost of back-office functions and traditional intermediaries,\" said Figure.","Calling it a \"breakthrough\" achievement, Figure said the blockchain-based securitization process helped parties involved save over 100 basis points in operational and third-party costs. \"This represents potential savings of over $30 billion to the $3 trillion annual securitization market,\" it added.","Figure acted as the originator in the securitization process; Jefferies Group as a structuring agent, lead underwriter and warehouse provider; Nomura Securities as a lead underwriter; Tilden Park Capital as a loan contributor and subordinate note buyer; and a \"large\" undisclosed asset manager as a senior note buyer.","\"Until now, the industry has been slow to move past white papers and proof of concept projects. But this first-ever production-level blockchain ABS [asset-backed security] achievement importantly underscores that the times are changing,\" said Figure CEO Cagney.","<strong data-v-f87c67ca=\"\">Blockchain Margin Improvement (117 bps)<\/strong>","","","\"The ratings process doesn't require being on Provenance. However, at least one rating agency has explored building a smart contract to provide bespoke securitization ratings on Provenance,\" a Figure spokesperson told The Block. <strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRising loan applications<\/strong>","In a separate <a href=\"https:\/\/www.businesswire.com\/news\/home\/20200310005682\/en\/Figure-Fed-Rate-Cut-Drove-300-Increase\" data-v-f87c67ca=\"\">announcement<\/a> yesterday, Figure said it has seen home equity line of credit (HELOC) applications soar by 300% since the Federal Reserve stimulus rate cut last week, pushing the amount of loans it has funded to over $1 billion. The Fed <a href=\"https:\/\/www.theblockcrypto.com\/post\/57581\/fed-announces-50-bps-emergency-rate-due-to-coronavirus\" data-v-f87c67ca=\"\">cut<\/a> interest rate by 50 basis points in light of coronavirus risks to economic activity.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nHELOC is a type of loan, which allows people to borrow against the value of their homes. When interest rates are lower, the cost to borrow is cheaper and may result in increased demand for such loans.","\"The 300% increase in applications suggests consumers are eager to take advantage of unprecedented lower rates across mortgages, HELOCs and student loan refinancing,\" said Cagney. \"We couldn't have supported this type of growth and innovation - like the 5-minute HELOC – without the platform we built on Provenance.\"","Figure said the average size of loans applied for during the surge in activity is about $50,000 per household.","Founded in early 2018, the San Francisco-based Figure is already a unicorn with a valuation of $1.2 billion. The firm has <a href=\"https:\/\/www.theblockcrypto.com\/post\/48808\/sofi-founders-blockchain-startup-figure-raises-another-59m-aiming-a-total-of-over-100m\" data-v-f87c67ca=\"\">raised<\/a> over $225 million in total funding to date and is backed by notable investors, including Morgan Creek Digital, Ribbit Capital and Digital Currency Group, among others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Jefferies Group","content":"ORGANIZATION"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"300%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Tilden Park Capital","content":"ORGANIZATION"},{"type":"Cagney","content":"PERSON"},{"type":"$3 trillion","content":"MONEY"},{"type":"$225 million","content":"MONEY"},{"type":"Ribbit Capital and Digital Currency Group","content":"ORGANIZATION"},{"type":"Mike Cagney","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Nomura Securities","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"$150 million","content":"MONEY"},{"type":"$30 billion","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}