{"summary":"Oval by Uma targets oracle extractable value, a form of MEV generated during oracle-based price updates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273925\/uma-rolls-out-oval-to-capture-oracle-extractable-value-in-defi-protocols","publishDate":"2024-01-23T10:30:02","id":10400,"type":null,"title":"Uma rolls out Oval to capture oracle extractable value in DeFi protocols","category":["DEFI"],"content":["Blockchain project <a href=\"https:\/\/www.theblock.co\/post\/273532\/uma-token-sees-90-surge-after-hinting-at-mev-focused-solution\" data-v-f87c67ca=\"\">Uma<\/a> has rolled out a solution called Oval, which aims to allow DeFi protocols to capture value that emerges during oracle updates by tapping into what’s known as <a href=\"https:\/\/raw.githubusercontent.com\/api3dao\/oev-litepaper\/main\/oev-litepaper.pdf\" data-v-f87c67ca=\"\">oracle extractable value<\/a> — a type of MEV generated when protocols request price updates from an oracle.","MEV involves extracting value by manipulating transaction order in a block on the Ethereum network, often with the aid of automated bots. This type of MEV arises either from the lack of liquidity across different decentralized exchanges or from their front-running each other under certain market conditions.","Uma notes there is one type of MEV related to oracles. In the decentralized finance niche — and in protocols such as lending or borrowing — oracles are crucial as they provide external data, like price feeds, to smart contracts. When an oracle update occurs, such as a price feed update, it can create MEV opportunities. For instance, if a lending protocol relies on an oracle for the latest asset prices, there may be a brief window post-update where a trader can leverage this information before the market responds.","This is where oracle extractable value (OEV) comes into play.","“MEV is a major issue for Ethereum, with tens of millions of dollars extracted every year. OEV accounts for a big chunk of that because protocols need price updates,” Uma co-founder Hart Lambur said. “Oval addresses a real problem by helping protocols capture OEV. It’s been a privilege to work with Flashbots’ best-in-class team to bring Oval to mainnet.”&nbsp;","Oval's goal is to enable protocols, such as lending, to utilize this solution to retain and profit from this value rather than losing it to bots. In this setup, MEV searchers participate in an auction system, bidding for the right to access data from Chainlink oracles related to a certain protocol. The auction proceeds then benefit the protocol.","The roll-out of Oval is a collaborative effort between Uma and <a href=\"https:\/\/www.theblock.co\/post\/241327\/flashbots-becomes-unicorn-after-completing-60-million-raise\" data-v-f87c67ca=\"\">Flashbots<\/a>, one of the leading MEV research and development firms. “Oval is building on that insight to finally return Oracle Extractable Value (OEV) back to DeFi protocols and their users. We look forward to supporting them on that journey,” said Hasu, Strategy Lead for Flashbots.&nbsp;","Uma began in 2017 as an Ethereum-based DeFi protocol focusing on synthetic assets. Now, it mainly operates a product that enables users to verify data on-chain through economic incentives and dispute resolution. Oval would further add to its existing product stack.","<span data-v-03de5780=\"\" data-v-f87c67ca=\"\">The <a href=\"https:\/\/www.theblock.co\/post\/273532\/uma-token-sees-90-surge-after-hinting-at-mev-focused-solution\" data-v-f87c67ca=\"\">Uma token<\/a> has seen a 230% surge after it hinted at Oval's release last week, rising from $2 to its current price of over $6.60, according to <a href=\"https:\/\/www.theblock.co\/price\/256967\/uma-uma-usd\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">The Block’s Price Page<\/a>. Uma’s market capitalization has reached nearly $510 million, its highest point since 2022.<br data-v-03de5780=\"\" data-v-f87c67ca=\"\">\n<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$6.60","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"$510 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$2","content":"MONEY"},{"type":"Uma","content":"ORGANIZATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"230%","content":"PERCENT"},{"type":"oracle","content":"ORGANIZATION"},{"type":"Hasu","content":"PERSON"},{"type":"The Block’s Price Page","content":"ORGANIZATION"},{"type":"MEV","content":"ORGANIZATION"},{"type":"Hart Lambur","content":"PERSON"},{"type":"Oval","content":"ORGANIZATION"},{"type":"Oracle Extractable Value","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ASSETS","DEXS","MEV","PROTOCOLS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}