{"summary":"Metaverse developer Everyrealm is launching a “home design” game targeting mature gamers; available later this year on Epic Games Store.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177343\/paris-hilton-backed-web3-company-plans-virtual-real-estate-game-for-adults","publishDate":"2022-10-14T16:50:21","id":10415,"type":null,"title":"Paris Hilton-backed web3 company plans virtual real-estate game for adults","category":["GAMING AND METAVERSE"],"content":["<span data-v-f87c67ca=\"\">Everyrealm, a metaverse content developer with high-flying backers like Will Smith, Paris Hilton and venture capital firm Andreessen Horowitz, is launching a “home design” and virtual real estate game aimed at mature gamers.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">After more than three years of development, Everyrealm’s new free-to-play game – called Hometopia – will allow players to build virtual homes and communities “alongside friends,” according to the announcement. Players will also be allowed to own that which they create in-game, Everyrealm also said.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The company’ says that Hometopia will be partly based on some of Roblox’s more “popular home design games” like Bloxburg and Brookhaven, which Everyrealm says have been visited more than five billion times.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Will Smith","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Paris Hilton","content":"LOCATION"},{"type":"Bloxburg","content":"PERSON"},{"type":"Brookhaven","content":"ORGANIZATION"},{"type":"Hometopia","content":"ORGANIZATION"}],"hashtag":["ANDREESSEN HOROWITZ"],"authors":["RT Watson","The Block"]}