{"summary":"Binance CEO Changpeng “CZ” Zhao is planning to set up an association made up of big crypto players to communicate with regulators.\nThe crypto exchange chief also said he’s received interest from funders to support a recovery fund that could help reduce the impact from FTX’s downfall.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186789\/cz-plans-industry-association-to-communicate-with-regulators-worldwide","publishDate":"2022-11-14T14:19:22","id":1041,"type":null,"title":"CZ plans industry association to communicate with regulators worldwide","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Binance CEO Changpeng \"CZ\" Zhao said he wants to set up an association of the largest crypto players to help work with policymakers and regulators worldwide.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The association will try to maintain communication with regulators and also maintain best practices in the industry, including proof of reserves, transparency,” Zhao said on a Twitter Spaces event that hosted over 40,000 listeners.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe association would not be run by Binance, Zhao said, adding that it would be a third-party that “has done this many times for different industries.” The Binance chief said that multiple regulators had requested that he set up such an association.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“We will also try to act as a point of communication on policy, thought leadership, commenting on the pros and cons of certain policies,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier on Monday, Binance <\/span><a href=\"https:\/\/www.theblock.co\/post\/186597\/binance-will-launch-a-new-industry-recovery-fund\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> it would put together a recovery fund that could help to alleviate some of the pain inflicted on the industry after FTX filed for bankruptcy protection last week. Four or five funders already expressed interest, Zhao said.&nbsp;<\/span>","While Zhao said he was optimistic despite the trying times, he acknowledged the role he had played in the market downturn.","<span data-v-f87c67ca=\"\">“As much as people blame me for whistleblowing or poking the bubble or whatever [...] I apologize for any turmoil that I caused, \" he said. \"But if there is a problem, the earlier we reveal it, the better.”<\/span>","<span data-v-f87c67ca=\"\">FTX's troubles took a turn for the worse on Nov. 6, when Zhao first said that Binance would sell its holdings of FTX's native token.<\/span>","<span data-v-f87c67ca=\"\">“We will try to achieve a good balance between whistleblowing, causing panic, causing prices to drop, and building a healthy industry and cleaning out the bad players,” Zhao said.<\/span>"],"hashtag":["BINANCE"]}