{"summary":"Rune Christensen has come under some criticism for influencing a MakerDAO governance vote that will upend the DAO’s structure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180991\/maker-founder-uses-influence-to-pass-vote-that-breaks-up-the-dao","publishDate":"2022-10-28T13:54:12","id":10410,"type":null,"title":"Maker founder uses influence to pass vote that breaks up the DAO","category":["GOVERNANCE"],"content":["Maker founder Rune Christensen was at the heart of a governance vote that aims to shake things up with the way the DAI stablecoin issuer operates, but some critics claim the founder put his thumb on the scale to pass the measure.","The MakerDAO community on Monday <a href=\"https:\/\/vote.makerdao.com\/polling\/QmTmS5Nf#vote-breakdown\" data-v-f87c67ca=\"\">passed<\/a> Christensen’s “Endgame” <a href=\"https:\/\/forum.makerdao.com\/t\/endgame-plan-v3-complete-overview\/17427\" data-v-f87c67ca=\"\">proposal<\/a> and with it set the stage for a new governance architecture for the DAO. Endgame, when implemented, will break up MakerDAO into smaller clusters called “MetaDAOs.” MakerDAO currently operates along a number of strategic core units tasked with different functions. These units are all under the governance of the DAO.","However, things will change under the new paradigm of MetaDAOs once they are implemented. MetaDAOs will function independently from one another and they will have their own parallel governance structure. This governance structure will include separate tokens and decision-making architecture for each MetaDAO. One of these MetaDAOs will even handle <a href=\"https:\/\/www.theblock.co\/post\/154515\/maker-governance-is-voting-to-invest-500-million-in-us-treasury-bills\" data-v-f87c67ca=\"\">Maker’s push<\/a> into <a href=\"https:\/\/www.theblock.co\/post\/175311\/makerdao-initiates-500-million-investment-in-us-treasuries-corporate-bonds\" data-v-f87c67ca=\"\">real-world asset investments<\/a>.","Monday’s poll ended with 80% of the votes cast in favor of the Endgame plan. However, Christensen’s influence was keenly felt in the voting process. More than 70% of the “yes” votes cast by delegates were from voting blocs with ties to the Maker founder. This has raised issues about governance centralization.","Some DAO members in opposition to the vote accused Christensen of “organization capture” — a situation where a special interest takes precedence over the general interest of a group, which can lead to a net loss. “We are first and foremost opposed to the manner, methods, and lengths Rune has used and reached to attempt total personal control of the outcome of this vote and MakerDAO as a whole into the future. For that reason alone, we vote no,” stated ACREinvest on the governance forum, adding, “If there are any merits within this take-it-or-leave-it massive bundle of fundamental organization changes, even these are irreparably tainted when implemented in this manner.”","Monday’s vote only passed the Endgame prelaunch process. There are a few steps that will follow before the vision is implemented on the DAO as a whole. Core units will soon need to begin “clustering” to form their own MetaDAOs while the DAO gets ready to split into smaller groups.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Christensen","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"80%","content":"PERCENT"},{"type":"Rune","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Rune Christensen","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}