{"summary":"The SEC has asked a US bankruptcy court to deny Terraform Labs’ retention of Dentons as its special counsel in a filing submitted Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279755\/sec-terraform-labs-suspicious-payment-to-lawyers","publishDate":"2024-02-29T00:23:38","id":10423,"type":null,"title":"SEC challenges Terraform Labs’ ‘suspicious’ $166 million payment to lawyers in court filing","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The U.S. Securities and Exchange Commission has asked the Delaware bankruptcy court to deny Terraform Labs’ retention of Dentons U.S. LLC as its special counsel in a filing submitted Tuesday, claiming that a “suspicious” amount has been paid to Dentons.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SEC stated in the filing that Terraform Labs transferred a “staggering” $166 million into the Dentons Advance Payment Retainer, with $122 million of that money being transferred within 90 days before the bankruptcy filing. The SEC argued that the move seems to be aimed at removing assets from the company that could be used to pay any judgments resulting from the agency’s enforcement action.<\/span>","<span data-v-f87c67ca=\"\">The agency claimed that the $122 million was transferred to “an opaque slush fund” for lawyers, which Terraform Labs could then use as a “war chest” to continue the legal dispute against the SEC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">More than half of the amount paid to Dentons has already been used to cover litigation expenses, while $81 million remained in the Dentons Advance Payment Retainer, according to the filing. The SEC argued that Dentons should not be authorized to represent Terraform Labs unless it returns the remaining amount.<\/span>","<span data-v-f87c67ca=\"\">The regulator added that the Dentons Advance Payment Retainer appears to be utilized to cover bills for counseling former Terra CEO Kwon Do-hyeong’s criminal action in Montenegro, which is unrelated to his job at Terraform Labs.<\/span>","<span data-v-f87c67ca=\"\">The SEC also requested the court to appoint a fee examiner on the retainer payment which it claimed to be suspicious in timing and amount.<\/span>","<span data-v-f87c67ca=\"\">Terraform Labs did not immediately respond to The Block’s request for comment.<\/span>","<span data-v-f87c67ca=\"\">Terraform Labs filed for <\/span><a href=\"https:\/\/www.theblock.co\/post\/273683\/terraform-labs-files-chapter-11-bankruptcy-in-delaware\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chapter 11 bankruptcy<\/span><\/a><span data-v-f87c67ca=\"\"> in the U.S. Bankruptcy Court for the District of Delaware on Jan. 21, with estimated assets and liabilities between $100 million and $500 million, according to its filing at the time. It <\/span><a href=\"https:\/\/www.theblock.co\/post\/275292\/terraform-labs-says-bankruptcy-helps-afford-appeal-against-secs-fraud-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said in January<\/span><\/a><span data-v-f87c67ca=\"\"> that the bankruptcy protection would allow the company to pursue an appeal against the SEC.<\/span>","<span data-v-f87c67ca=\"\">The company was behind the algorithmic stablecoin TerraUSD and sister cryptocurrency Luna, both of which collapsed in May 2022. The SEC <\/span><a href=\"https:\/\/www.theblock.co\/post\/212695\/sec-charges-terraform-and-do-kwon-post-terra-collapse\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">charged<\/span><\/a><span data-v-f87c67ca=\"\"> the firm and Kwon with fraud in February 2023. Kwon is currently awaiting extradition from Montenegro, where he was arrested in March last year.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"$122 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Delaware","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jan. 21","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"March last year","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"District of Delaware","content":"LOCATION"},{"type":"$166 million","content":"MONEY"},{"type":"Montenegro","content":"LOCATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Dentons U.S. LLC","content":"ORGANIZATION"},{"type":"$81 million","content":"MONEY"}],"hashtag":["BANKRUPTCY FILINGS","COURT HEARINGS","DO KWON","SEC"],"authors":["Danny Park","The Block"]}