{"summary":"Claire Boucher, a musician known professionally as Grimes, earned more from her 2021 NFT collection than her entire music career.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243955\/grimes-says-shes-sad-about-crypto-despite-banking-millions-from-nfts-wired","publishDate":"2023-08-09T11:36:53","id":10424,"type":null,"title":"Grimes says she&#x27;s sad about crypto, despite banking millions from NFTs","category":["METAVERSE & NFT"],"content":["Claire Boucher, the musician known as Grimes and former partner of Elon Musk, has had more success selling digital assets than her tunes. In a recent interview with <a href=\"https:\/\/www.wired.com\/story\/grimes-big-interview\/\" data-v-f87c67ca=\"\">Wired<\/a>, she said the $5.8 million obtained from the 2021 <a href=\"https:\/\/www.theblock.co\/post\/139265\/avalanche-launches-100-million-creator-fund-with-grimes-and-web3-platform-op3n\" data-v-f87c67ca=\"\">sale<\/a> of an NFT collection on the platform Nifty Gateway was more than she's ever made from music.","\"[The NFT collection] was on my brother. He had a real vision, and we wound up doing one of the first big ones,\" Grimes said. \"It did actually change my life.\"","Despite the collection's success, Grimes lamented the state of crypto now.&nbsp;","\"I’m sad about what happened to NFTs and crypto, because it got polluted fast with people trying to make as much money as possible,\" she said. \"But I do want to think about compensating artists, especially digital artists. And I hope when the aggro niche dies down, we can come back.\"","Grimes released her first album \"Geidi Primes\" in 2010 and has since rose to prominence for her high energy electric pop music. In 2018, Grimes began dating billionaire and social network owner Elon Musk, having two children with him before splitting up in 2022.&nbsp;","After the success of her first NFT project, Grimes quietly made a presence for herself in the crypto industry.&nbsp;","Last year, she helped launch a $100 million creator fund with the Avalanche Foundation called the <a href=\"https:\/\/www.theblock.co\/post\/139265\/avalanche-launches-100-million-creator-fund-with-grimes-and-web3-platform-op3n\" data-v-f87c67ca=\"\">Culture Catalyst<\/a>, in which she intended to create an \"intergalactic metaverse children's book.\"","Grimes also collaborated with TikTok when the popular social media app planned to <a href=\"https:\/\/www.theblock.co\/linked\/119181\/tiktok-announces-nft-collection-led-by-top-creators\" data-v-f87c67ca=\"\">launch<\/a> an NFT collection in 2021.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Claire Boucher","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"Avalanche Foundation","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$5.8 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"TikTok","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Grimes","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Elon Musk","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}