{"summary":"A judge was not having it with Sam Bankman-Fried&#x27;s lawyers after they argued against the government&#x27;s use of millions of pages of documents.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248185\/sbf-lawyers-catch-judges-ire-with-trial-postponement-on-the-table","publishDate":"2023-08-30T15:38:51","id":10439,"type":null,"title":"SBF lawyers catch judge&#x27;s ire, with trial postponement on the table","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A New York district court judge was not having it with Sam Bankman-Fried's lawyers on Wednesday, after they argued against the government's use of millions of pages of documents for evidence and asserted that internet access in jail has been weak.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">At issue is what Bankman-Fried's lawyers say are millions of pages that they received over the last few weeks and days, which they say are coming in \"too late in the game.\" This comes as the former billionaire was placed in jail to await trial earlier this month after prosecutors accused him of witness tampering.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried doesn't have the ability to look at the documents in jail the same way he did when he was out, his lawyers said during a hearing.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"So we're faced with the problem of getting documents produced, millions of pages, within four weeks to go until trial and our own client has no means to review them,\" his lawyers said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">There is no evidence that the government didn't act in good faith, said Judge Lewis Kaplan for the U.S. District Court in the Southern District of New York.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The government said that the documents produced in August had just recently been obtained from Google due to a \"production error,\" which Bankman-Fried knew about a long time ago, Kaplan said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Even more to the point, the vast majority of these documents were from the defendant’s own Google accounts,\" Kaplan said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kaplan gave Bankman-Fried's lawyers until Friday to ask for postponing an Oct. 3 trial, but added that he wouldn't necessarily grant it.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Bankman-Fried's lawyers also argued that th<\/span><span class=\"s1\" data-v-f87c67ca=\"\">e laptop Bankman-Fried was given has a limited battery life, that there is no power outlet in the cell block to charge it and that the internet connection has been weak for half of the sessions. His lawyers, too, have <a href=\"https:\/\/www.theblock.co\/post\/247689\/sam-bankman-frieds-lawyers-ask-for-temporary-release-from-jail\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">called<\/span><\/a> for his temporary release ahead of trial.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Kaplan asked why an extension cord couldn’t be used, but prosecutors said that is a security risk. The judge <\/span><span class=\"s1\" data-v-f87c67ca=\"\">wants a joint report by Tuesday morning on the situation at the jail.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The former FTX CEO <a href=\"https:\/\/www.theblock.co\/post\/236735\/judge-denies-motion-to-dismiss-most-charges-against-sam-bankman-fried\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">faces<\/span><\/a> over 100 years in prison if he is convicted on a slew of charges, including fraud, over allegations that he and other FTX executives used billions of customer assets to make their own failed investments. FTX filed for bankruptcy protection late last year.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 3","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["FTX"],"authors":["Sarah Wynn","The Block"]}