{"summary":"Bitget has integrated with Copper&#x27;s ClearLoop network to provide an off-exchange settlement solution for institutional clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246181\/bitget-copper-clearloop","publishDate":"2023-08-18T06:00:17","id":10436,"type":null,"title":"Bitget integrates Copper’s ClearLoop to offer off-exchange crypto trading to institutions","category":["EXCHANGES"],"content":["Crypto exchange Bitget has integrated with custody platform Copper's ClearLoop network to provide an off-exchange trading and settlement solution for institutional clients.","The integration aims to strengthen digital asset security, reduce counterparty risks and improve capital efficiency, according to a statement.","Bitget’s institutional clients can securely store their digital assets in Copper's MPC (multi-party computation) wallet while enabling trading and settlement across different ClearLoop-connected exchanges. MPC is a cryptographic technology that can improve existing multi-sig techniques, effectively allowing wallet keys to be “split” between parties.","\"We noticed the growing demand for enhanced asset security and efficient trading solutions. Institutional clients can now benefit from this solution,” Bitget Managing Director Gracy Chen said in the statement.","\"The partnership with Bitget, alongside our shared focus on asset security and setting industry standards, enhances off-exchange settlement for institutional clients,” Copper CEO Dmitry Tokarev added.","Bitget argues this improves capital efficiency by allowing cross-exchange trading strategies without additional transfer and withdrawal fees and mitigates against risks associated with traditional trading models, such as liquidity and operational risks.","Furthermore, insolvency risk is addressed by securely holding assets in a dedicated ClearLoop omnibus account, governed by English law, ensuring insolvency protection for all ClearLoop participants, Bitget said.","Last month, Bitget <a href=\"https:\/\/www.theblock.co\/post\/237669\/bitget-crypto-loans\" data-v-f87c67ca=\"\">launched<\/a> a cryptocurrency loans product, despite significant setbacks after a tumultuous 2022 for centralized crypto lending services — a year that saw the collapse of firms like <a href=\"https:\/\/www.theblock.co\/post\/157483\/crypto-lender-celsius-to-declare-chapter-11-bankruptcy-cnbc?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Celsius<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">BlockFi<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Voyager Digital<\/a>.&nbsp;","In April, Bitget unveiled a <a href=\"https:\/\/www.theblock.co\/post\/225504\/bitget-venture-fund\" data-v-f87c67ca=\"\">$100 million<\/a> web3 venture fund to invest globally, with a focus on Asia.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gracy Chen","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Dmitry Tokarev","content":"PERSON"},{"type":"Bitget","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Asia","content":"LOCATION"}],"hashtag":[],"authors":["James Hunt","The Block"]}