{"summary":"Galaxy Digital is putting together a $100 million fund that will bankroll as many as 30 companies within the next three years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286378\/galaxy-digital-to-launch-100-million-fund-for-early-stage-crypto-companies-report","publishDate":"2024-04-03T15:51:22","id":10438,"type":null,"title":"Galaxy Digital to launch $100 million fund for early-stage crypto companies","category":["COMPANIES"],"content":["Galaxy Digital Holdings is establishing a $100 million fund for early-stage cryptocurrency startups, <a href=\"https:\/\/www.coindesk.com\/business\/2024\/04\/03\/galaxy-plans-to-raise-100m-for-first-crypto-venture-fund\/\" data-v-f87c67ca=\"\">CoinDesk reported<\/a> today, citing an email to the company's investors.","The Galaxy Ventures Fund I, LP, will funnel upwards of $1 million into each of as many as 30 startups over three years, with a focus on “financial applications, software infrastructure and protocols building in crypto,” according to the report.","Galaxy's move to start up a new fund for early-stage digital asset companies comes amid a resurgence in funding rounds in the cryptocurrency industry. Crypto startups raised roughly $3.1 billion in the fourth quarter of 2023, up from $1.7 billion in the preceding quarter, according to public data cited by Blockworks.","\"We're excited to build on our successful track record of investing in digital asset companies and blockchain infrastructure,\" Mike Wursthorn, Galaxy's head of communications, told The Block in a statement. \"For years, we've been putting our own capital behind these innovators. Now we're launching Galaxy Ventures Fund I LP to partner with outside investors, allowing us to continue fueling the digital asset ecosystem by backing promising early-stage companies.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mike Wursthorn","content":"PERSON"},{"type":"Galaxy Ventures Fund I LP","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"LP","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Galaxy Digital Holdings","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"fourth quarter of 2023","content":"DATE"},{"type":"Galaxy","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}