{"summary":"Stablecoin issuer Paxos is betting that putting gold on the blockchain will lure enthusiasts of the best-known precious metal into the digital asset","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/38553\/paxos-embraces-gold-pegged-crypto-as-sea-change-in-gold-trading","publishDate":"2019-09-05T10:07:45","id":10444,"type":null,"title":"Paxos embraces gold-pegged crypto as &#x27;sea change&#x27; in gold trading","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Stablecoin issuer Paxos is betting that putting gold on the blockchain will lure enthusiasts of the best-known precious metal into the digital asset space, and some noted names in cryptocurrency lending have already bought into this idea.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The New York-based firm announced today the launch of a gold-backed digital asset PAX Gold (PAXG), which will be pegged one-to-one to an ounce of gold. With approval from the New York Department of Financial Services, gold bugs can now trade PAXG against dollars on Paxos’ exchange, itBit, with additional trading pairs to be listed soon, according to Paxos CEO Charles Cascarilla.<\/span>","PAX Gold joins the dollar-pegged stablecoin PAX as part of the company's goal to tokenize commodities and \"all the world's financial assets,\" according to Paxos head of marketing Dorothy Chang.&nbsp;","<span data-v-f87c67ca=\"\">Cascarilla said he regards PAXG as solving one of gold's biggest problems as an asset, immobility. Since it is cumbersome to move gold around, investors who want to speculate on the price usually opt for derivatives rather than trading and holding gold directly.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Either you can make gold very tradable or you can own real gold,” said Cascarilla. “And very tradable gold is not real gold.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By putting gold on the Ethereum blockchain, Paxos is hoping that PAXG can be real gold that is also highly tradable. According to the company, traditional gold investors can buy and sell PAXG instantly with their gold bars stored in a vault in London. Meanwhile, PAXG, being less volatile than many other cryptocurrencies, could diversify crypto investors' portfolios and hedge risks. <\/span>","<span data-v-f87c67ca=\"\">As such, both Cascarilla and Rob Odell, SALT Lending’s vice president of marketing, believe that the convenience of trading and holding gold with PAXG will attract investors of both cryptocurrencies and gold.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Given HODLers often refer to Bitcoin as 'digital gold,' the advent of PAXG will enable investors to own both digital and physical gold, and manage these assets in the same efficient manner,” said Odell.&nbsp;&nbsp;<\/span>","\"This [PAXG] completely changes the way in which you can use gold... And I think it could be a real big sea change in the history of gold,\" Cascarilla told The Block in a recent episode of <a href=\"https:\/\/www.theblockcrypto.com\/2019\/09\/04\/a-conversation-with-charles-cascarilla-ceo-co-founder-at-paxos\/\" data-v-f87c67ca=\"\">The Scoop podcast<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">This new offering has already attracted cryptocurrency lending and credit firms such as Genesis Global Trading, SALT Lending, and Nexo. SALT will list PAXG as a collateral option, while Genesis will start accepting lending deposits in the new cryptocurrency. Nexo will provide PAXG-based credit lines to customers looking to borrow dollars.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We provide liquidity and financing services to institutional investors and we believe gold investors will want to earn yield through their PAX Gold holdings while others will want to borrow cash against their PAX Gold holdings,” said Genesis Global Capital head of business development Matthew Ballensweig.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The appeal of holding gold in a crypto portfolio may be substantiated by not only by its relatively stable price but also its price. Over the past six months, the price of gold has <\/span><a href=\"https:\/\/goldprice.org\/gold-price-chart.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">surged<\/span><\/a><span data-v-f87c67ca=\"\"> by 18% with average daily trading volumes<\/span><span data-v-f87c67ca=\"\"> over $112.5 billion, around five times greater than the entire Dow Jones.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Paxos also just received the green light from the New York Department of Financial Services (NYDFS), which allows New York State residents to buy, hold, and sell PAXG.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum blockchain","content":"PERSON"},{"type":"Rob Odell","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"18%","content":"PERCENT"},{"type":"New York State","content":"ORGANIZATION"},{"type":"PAXG","content":"ORGANIZATION"},{"type":"Cascarilla","content":"PERSON"},{"type":"Dorothy Chang","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Matthew Ballensweig","content":"PERSON"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$112.5 billion","content":"MONEY"},{"type":"Charles Cascarilla","content":"PERSON"},{"type":"Odell","content":"PERSON"},{"type":"Dow Jones","content":"ORGANIZATION"}],"hashtag":["DERIVATIVES"],"authors":["Celia Wan","The Block"]}