{"summary":"The Aave community unanimously voted against a proposal by Gauntlet to freeze Curve DAO (CRV) tokens on version 2.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235422\/aave-community-rejects-gauntlets-proposal-to-freeze-crv-tokens-on-v2","publishDate":"2023-06-19T08:24:55","id":10441,"type":null,"title":"Aave community rejects Gauntlet’s proposal to freeze CRV tokens on V2","category":["CRYPTO ECOSYSTEMS"],"content":["The Aave community has rejected a proposal from Gauntlet designed to address the risk arising from a substantial loan acquired by Curve founder Michael Egorov.","On June 18, the community <a href=\"https:\/\/app.aave.com\/governance\/proposal\/?proposalId=246\" data-v-f87c67ca=\"\">passed<\/a> a vote unanimously, with every single vote opposing the proposal, firmly establishing its stance.","Last week, Gauntlet, a DeFi risk management project, had <a href=\"https:\/\/www.theblock.co\/post\/234648\/gauntlet-advises-aave-to-freeze-crv-tokens-deposited-by-wallet-tied-to-curve-finance-founder\" data-v-f87c67ca=\"\">proposed<\/a> freezing CRV tokens on Aave v2 and <a href=\"https:\/\/governance.aave.com\/t\/gauntlet-recommendation-to-freeze-crv-and-set-crv-ltv-0-on-aave-v2\/13644\" data-v-f87c67ca=\"\">reducing<\/a> the loan-to-value ratio for CRV to zero.","This recommendation came in the wake of a large CRV loan linked to Egorov, who has <a href=\"https:\/\/debank.com\/profile\/0x7a16ff8270133f063aab6c9977183d9e72835428\" data-v-f87c67ca=\"\">borrowed<\/a> approximately $60 million in USDT, providing a collateral of 285 million CRV tokens, valued around $176 million. This substantial loan drew attention due to the size of the collateral, which represents <a href=\"https:\/\/www.theblock.co\/post\/234138\/curve-finance-michael-egorov-aave\" data-v-f87c67ca=\"\">over 30%<\/a> of the total circulating supply of CRV.","Gauntlet argued that the proposed freeze on Aave v2 could incentivize Egorov to decrease his borrowing or diversify his collateral types, thereby safeguarding Aave from the accumulation of bad debt resulting from a potential decline in the liquidity of CRV tokens. The firm added that a CRV freeze would encourage the migration of the aforementioned loan position to Aave version 3, which is designed for better risk management.&nbsp;","Egorov's loan account has maintained a <a href=\"https:\/\/debank.com\/profile\/0x7a16ff8270133f063aab6c9977183d9e72835428\" data-v-f87c67ca=\"\">health factor<\/a> above 1.6, indicating no immediate bad debt risk to Aave.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$176 million","content":"MONEY"},{"type":"Gauntlet","content":"LOCATION"},{"type":"Egorov","content":"PERSON"},{"type":"CRV","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Michael Egorov","content":"PERSON"},{"type":"June 18","content":"DATE"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"30%","content":"PERCENT"}],"hashtag":["LENDING"],"authors":["Vishal Chawla","The Block"]}