{"summary":"FTX has launched crude oil futures that expire to the spot price of WTI crude oil, plus $100\nFTX founder and CEO Sam Bankman-Fried told The Block that there was “a lot of demand” for oil futures\nThe launch comes at a time when oil prices fell below zero for the first time in history earlier this week","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62668\/crypto-derivatives-exchange-ftx-launches-crude-oil-futures","publishDate":"2020-04-22T05:52:52","id":1044,"type":null,"title":"Crypto derivatives exchange FTX launches crude oil futures","category":["Exchanges"],"content":["Crypto derivatives exchange FTX has rolled out crude oil futures, at a time when oil prices for May contract fell below zero for the first time in history earlier this week.&nbsp;","FTX’s <a href=\"https:\/\/ftx.com\/trade\/OIL100-0525\" data-v-f87c67ca=\"\">oil futures<\/a> contracts expire to the spot price of WTI crude oil, plus $100, meaning the exchange adds $100 to each contract in case the spot price goes negative.","Sam Bankman-Fried, founder and CEO of FTX, told The Block that the exchange had “a lot of demand” for oil futures and hence, decided to go for it.","“The demand was all over the place. It was the most requested product from most of our users,” said Bankman-Fried.","Users <a href=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/360042167412-OIL-futures\" data-v-f87c67ca=\"\">need to pass<\/a> FTX’s KYC level 1 to trade oil futures, and they must not be residents of the U.S., the U.K., the EU, the UAE, Canada, Hong Kong, Singapore, Cambodia, Turkey and China, based on their KYC details or IP addresses.","Since most of the countries are restricted from trading, Bankman-Fried said: “We are likely going to see the majority of the interest from Asia.”","The oil futures currently have a monthly expiry, though FTX might change that up depending on demand, said Bankman-Fried. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nLooking ahead, FTX is also planning to “soon” launch tokens based on oil futures, said Bankman-Fried.","Launched in May 2019, FTX appears to be quickly rolling out new products in recent months. Last week, the exchange <a href=\"https:\/\/www.theblockcrypto.com\/linked\/62096\/ftx-bitcoin-volatility-token\" data-v-f87c67ca=\"\">launched<\/a> two new tokens tied to bitcoin's price volatility. In February, FTX <a href=\"https:\/\/www.theblockcrypto.com\/linked\/55357\/following-trump-ftx-adds-futures-contracts-for-five-more-presidential-candidates\" data-v-f87c67ca=\"\">launched<\/a> re-election futures contracts for Donald Trump and other U.S. presidential candidates.","There are currently around 35 people working for FTX and the exchange’s team is growing by around 10% per month, Bankman-Fried told The Block, adding that the target is to double the team to 70 over the next year.","FTX is backed by well-known investors, including Binance and Consensus Lab. The exchange has raised over $8 million to date via a token sale last year. In February, FTX <a href=\"https:\/\/www.theblockcrypto.com\/daily\/56519\/crypto-derivatives-exchange-ftx-15-million-1-billion\" data-v-f87c67ca=\"\">was looking to<\/a> raise $15-$30 million via an equity sale, as The Block reported at the time.","Giving an update, Bankman-Fried today told The Block that the coronavirus pandemic has slowed down the equity sale, but \"we're close to the lower end of the target delivered, and the upper end pledged.\""],"hashtag":["DERIVATIVES","FTX"]}