{"summary":"The vote, which ended on Saturday evening, may motivate workers at its other retail locations to move forward with organizing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152957\/apple-workers-vote-for-companys-first-unionized-us-store-cnbc-says","publishDate":"2022-06-19T08:37:52","id":1044,"type":null,"title":"Apple workers vote for company’s first unionized US store, CNBC says","category":["TECHNOLOGY"],"content":["Employees at an Apple store in Towson, Maryland voted on Saturday to join a union, making it the first unionized Apple store in the US, <a href=\"https:\/\/www.cnbc.com\/2022\/06\/18\/apple-workers-in-maryland-vote-for-companys-first-unionized-store-in-us-.html\" data-v-f87c67ca=\"\">CNBC reported<\/a>.","Apple has opposed efforts to unionize, the report said. The vote, which ended on Saturday evening, may motivate workers at its other retail locations to move forward with organizing.","The Towson store is one of several Apple locations that have announced union drives, and other retail organizers were watching the results closely, CNBC said. Two high-volume stores in New York, the Grand Central Terminal and World Trade Center locations, have signaled that they are unionizing, but have not yet advanced to voting.","About 110 employees were eligible to vote on joining the International Association of Machinists and Aerospace Workers, which ended with 65 in favor and 33 opposed, according to the report.","The National Labor Relations Board still needs to certify the results, which could take a week. Apple will be required to bargain with the union over working conditions after the vote is certified, according to the NLRB.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"International Association of Machinists and Aerospace Workers","content":"ORGANIZATION"},{"type":"Towson","content":"LOCATION"},{"type":"Maryland","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"NLRB","content":"ORGANIZATION"},{"type":"evening","content":"TIME"},{"type":"National Labor Relations Board","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Mike Millard","The Block"]}