{"summary":"Backed by an initial fund of $150,000, the UPA will focus on advocating for privacy technologies and influencing policy decisions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267160\/nym-protocol-labs-oasis-aztec-web3-universal-privacy-alliance","publishDate":"2023-12-12T09:00:03","id":10449,"type":null,"title":"Nym, Protocol Labs, Oasis, Aztec form web3 &#x27;Universal Privacy Alliance&#x27;","category":["LOBBYING"],"content":["A group of web3 projects have formed the “Universal Privacy Alliance,” spearheaded by <a href=\"https:\/\/www.theblock.co\/post\/260369\/nym-privacy-protections-near-ecosystem\" data-v-f87c67ca=\"\">Nym<\/a>, to focus on protecting digital privacy rights. The alliance also includes Protocol Labs, the Filecoin Foundation, Oasis and Aztec, among others. The UPA will focus on influencing policy and regulatory decisions, backed by an initial fund of $150,000, according to a statement.","The member-driven association is incorporated in Switzerland and follows a call to action by computer intelligence consultant and NSA whistleblower Edward Snowden at the ZK-House <a href=\"https:\/\/www.youtube.com\/watch?v=HTT9tuCAjAU\" data-v-f87c67ca=\"\">event<\/a> in Bogota, aligning with the UN's <a href=\"https:\/\/www.ohchr.org\/en\/privacy-in-the-digital-age\/international-standards\" data-v-f87c67ca=\"\">declaration<\/a> of digital privacy as a fundamental human right.","The UPA will advocate for technology that prioritizes user privacy and security by default. This \"privacy by design\" principle aims to ensure that digital interactions are secure and free from undue surveillance or commercial exploitation.&nbsp;","\"Privacy is just as important online as offline, yet many of today's dominant internet platforms prioritize surveillance and data collection over people's basic rights and as the digital landscape expands, the need for accessible and secure privacy technologies becomes imperative,” Nym CEO Harry Halpin said. “The Universal Privacy Alliance gives those of us building privacy-centric technologies a unified voice to advocate for policy reforms that protect security, anonymity and informed consent on the internet.\"","The UPA will initially focus on the EU’s eIDAS (electronic identification, authentication and trust services) regulation and Digital Services Act that challenge the principles of end-to-end encryption. Other plans include appointing a coordinator to lead lobbying efforts, hosting major events at key blockchain conferences like EthDenver and establishing a legal fund to support privacy-centric practices.","The UPA is also exploring the admission of smaller organizations through accessible membership fees, decided by a democratic vote via its general assembly.&nbsp;","“Our formalization as the Unified Privacy Alliance signifies our joint commitment to championing privacy rights in an increasingly digitized world,\" UPA founding member Will Scott added. \"With a united voice, we aim to educate policymakers, empower smaller organizations and advocate for user-centric privacy practices in technology.\"","Each founding member has contributed an initial $15,000 to the UPA, with the combined $150,000 allocated toward its immediate advocacy efforts and additional funding to further support the initiative expected over the coming months.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Edward Snowden","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Filecoin Foundation","content":"ORGANIZATION"},{"type":"$150,000","content":"MONEY"},{"type":"Switzerland","content":"LOCATION"},{"type":"Bogota","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Unified Privacy Alliance","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"UPA","content":"ORGANIZATION"},{"type":"Harry Halpin","content":"PERSON"},{"type":"$15,000","content":"MONEY"},{"type":"House","content":"ORGANIZATION"},{"type":"Scott","content":"PERSON"},{"type":"UN","content":"ORGANIZATION"},{"type":"NSA","content":"ORGANIZATION"},{"type":"Universal Privacy Alliance","content":"ORGANIZATION"}],"hashtag":["EUROZONE REGULATION","IDENTITY"],"authors":["James Hunt","The Block"]}