{"summary":"NFT Property Development is live in Upland! That’s right: in Upland, you’re able to develop and construct your own buildings on your NFT properties that you own.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127894\/how-property-development-works-in-upland","publishDate":"2021-12-17T09:00:50","id":10453,"type":null,"title":"How Property Development Works In Upland","category":["SPONSORED"],"content":["<a href=\"https:\/\/discover.upland.me\/theblock_dec\" data-v-f87c67ca=\"\">Click here to join Upland with a 6,000 UPX bonus to get started on developing your first NFT structure today.<\/a>","NFT Property Development is live in Upland! That’s right: in Upland, you’re able to develop and construct your own buildings on your NFT properties that you own.","Spark (USPK) is the mechanism by which property development is powered. Spark is a new type of resource in Upland, that is unlike any kind of resource currency you may have encountered in other games. Spark is a crypto token that is implemented on the EOS Mainnet, which means that owners enjoy the benefits of True Ownership. Spark is also introducing nuanced and flexible mechanisms that will allow for near infinite types of economic activity within Upland, blowing traditional resource models out of the water.","Using Spark To Develop Structure NFTs<br data-v-f87c67ca=\"\">\nYou can imagine Spark as a unit of output that allows for the building of any inanimate object in Upland (buildings, statues, cars, etc.). This means that you don’t spend Spark: instead, you stake it for the duration required to complete construction or manufacturing. As long as the Spark is staked, construction will progress and when construction is done, you will get your Spark back, ready to be staked against a new project!","Buildings in Upland will be ‘priced’ in a unit we call Spark Hours. So for example — if a building costs 1,000 Spark Hours, it means that if you stake exactly 1 Spark, it will take you 1,000 hours to complete construction. If you stake 2 Spark, the same building will take 500 hours to complete construction, and so on.","&nbsp;","<strong data-v-f87c67ca=\"\">The Structure NFT<\/strong>","","","Spark is what you will need to build a Structure NFT in Upland. This gives the building’s developer True Ownership of the asset as their structures will be implemented as NFTs on the blockchain. Structure NFTs are tethered to the property on which they are built. If the owner of the structure wants to trade their property parcel in the future, their Structure NFT will be included in that sale. This follows real-life logic; if you buy a parcel of land with a building on it, you take ownership of the building as well.","Players in the Upland community have begun developing entire neighborhoods in the metaverse and populating cities with fantastic-looking Structure NFTs.","<a href=\"https:\/\/discover.upland.me\/theblock_dec\" data-v-f87c67ca=\"\">Click here to join Upland with a 6,000 UPX bonus<\/a>. <a href=\"https:\/\/discover.upland.me\/discord\" data-v-f87c67ca=\"\">Make sure you join our Discord<\/a> to learn more about how property development works in Upland!","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Upland","content":"LOCATION"},{"type":"Spark Hours","content":"ORGANIZATION"},{"type":"Upland!","content":"LOCATION"},{"type":"NFT Property Development","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}