{"summary":"Chorus One’s protocol to integrate MEV on Solana is unlike from that of Ethereum, accounting for the two blockchain&#x27;s differing architectures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209422\/chorus-one-brings-mev-protocol-to-solana","publishDate":"2023-02-07T15:01:42","id":10454,"type":null,"title":"Chorus One brings MEV protocol to Solana","category":["CRYPTO ECOSYSTEMS"],"content":["Chorus One’s protocol to integrate maximal extracted value (MEV) on Solana takes a different approach from that of Ethereum MEV, accounting for architectural differences between the two blockchains.","The protocol is intended to be an open-source public good, ready to be adopted by Solana validators en masse and managed via an additional decentralized entity, or run independently, according to Chorus One.","<span data-v-f87c67ca=\"\">The Solana blockchain may see a new open-source approach to maximal extracted value (MEV), according to a white paper produced by blockchain protocol architect, Chorus One.<\/span>","<span data-v-f87c67ca=\"\">The version of MEV for Solana by Chorus One is in the prototype stage, and the company doesn’t intend to deploy it as a competitive platform to other existing models for Solana-based MEV. Instead, Chorus One intends to turn the MEV protocol over to the public for ongoing refinement and integration.<\/span>","<span data-v-f87c67ca=\"\">“The Solana-MEV client is a public good. Chorus One will not explore the model commercially,” Chorus One research analyst Thalita Franklin told The Block.<\/span>","<span data-v-f87c67ca=\"\">The protocol is <\/span><a href=\"https:\/\/chorus.one\/Breaking_Bots.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">detailed<\/span><\/a><span data-v-f87c67ca=\"\"> in a white paper released by Chorus One, and the model was also <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=nTEnpuDHz3w\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">presented<\/span><\/a><span data-v-f87c67ca=\"\"> in Lisbon at the Breakpoint conference last November.<\/span>","<span data-v-f87c67ca=\"\">Differences in the architecture of Ethereum and Solana mean different strategies must be applied to make the most of MEV.<\/span>","<span data-v-f87c67ca=\"\">On the Ethereum network, the practice of MEV sees blocks of transactions rearranged in order to impart the greatest value to validators. This is facilitated by searchers who derive the most valuable order of transactions from Ethereum’s mempool, a sort of holding pool on the network where unconfirmed transactions await validator processing.<\/span>","For Ethereum, MEV has introduced challenges around censorship. In one case, prevailing MEV provider Flashbots opted to censor transactions routed through a sanctioned privacy service known as Tornado Cash.","<span data-v-f87c67ca=\"\">“The block building marketplace is vulnerable to censorship once centralized intermediaries need to be added to the transaction path. The decentralized extraction by validators has the potential to mitigate censorship as it requires no additional layers of participants in the network, besides validators,” Franklin said.<\/span>","<span data-v-f87c67ca=\"\">On Solana, as the blockchain’s network architecture differs significantly from that of Ethereum, a simple plug-and-play version of an Ethereum-based MEV would lack functionality. For instance, Solana lacks any such mempool and, unlike Ethereum, validators are predetermined, so transaction information is passed directly to the next in line to process a block.<\/span>","<span data-v-f87c67ca=\"\">For MEV to work on Solana, Chorus One’s approach adds a step to the validation process where the block processor performs an extra check to see if any MEV opportunities exist. If an opportunity exists, the MEV transaction is added to the transaction block and broadcast to the network, and if none exist the block is sent to the network without modification.<\/span>","","","Flow graph from Chorus One.","<span data-v-f87c67ca=\"\">“For optimal results,” Franklin noted that the model must “be adopted by a majority of validators, and consequently maintained by a decentralized entity,” but that it is also possible for the MEV protocol to be run independently by any validator.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Franklin","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"MEV","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Lisbon","content":"LOCATION"},{"type":"last November","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"Thalita Franklin","content":"PERSON"}],"hashtag":["DEVELOPER TOOLS","ETHEREUM","SOLANA","VALIDATORS"],"authors":["Jeremy Nation","The Block"]}