{"summary":"Rhett Mankind, the creator of the toad-themed Turbo Token memecoin, says the project started last month as performance art. It quickly became worth millions.\nInitially built with help from ChatGPT and 50 initial token purchasers who spent about 4 ETH worth just over $7,000, the market cap of the project shot up to close to $100 million last week.\nMankind, who says the project has held up a mirror to the recent wave of memecoin mania, sat down with The Block for an in-depth interview early Monday morning.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230799\/turbo-toad-token-memecoin-pepe-interview","publishDate":"2023-05-15T14:33:19","id":1046,"type":null,"title":"Turbo Toad shines a $69 ChatGPT mirror at Pepe memecoin traders","category":["Companies"],"content":["A <a href=\"https:\/\/sites.google.com\/view\/turbotoad\/home?authuser=0\" data-v-f87c67ca=\"\">token created<\/a> with help from OpenAI's ChatGPT language model with an initial budget of just $69 rode the <a href=\"https:\/\/www.theblock.co\/post\/229907\/pepes-no-different-where-theres-a-meme-theres-a-scam\" data-v-f87c67ca=\"\">Pepe-fueled memecoin craze<\/a> last week to briefly hit a market capitalization of almost $100 million. Dubbed Turbo Token, the memecoin's mascot is a toad, and its creator is <a href=\"https:\/\/news.artnet.com\/market\/turbo-memecoin-artist-rhett-mankind-turbotoad-chatgpt-2297831\" data-v-f87c67ca=\"\">Melbourne-based digital artist Rhett Dashwood<\/a> who goes by the moniker <a href=\"https:\/\/www.mankind.art\/\" data-v-f87c67ca=\"\">Rhett Mankind<\/a>.&nbsp;","While the token's market cap has since declined to around $48 million, <a href=\"https:\/\/coinmarketcap.com\/currencies\/turbo\/\" data-v-f87c67ca=\"\">according to CoinMarketCap<\/a>, it's started out the week in the green, rising 1.5% on Monday.","In a wide-ranging discussion, The Block spoke with Mankind early Monday about the genesis of the project and what he thinks it might say about the confluence of AI, humanity, and yes, memecoins.&nbsp;&nbsp;","<strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">I'd love to hear about how this started. I know you've been in the digital art space for a while. I believe it was around April 23 when you first had the idea for this. Where did the idea come from? What was the genesis? Was there an element of performance art to any of this?<\/em>","<strong data-v-f87c67ca=\"\">Mankind: <\/strong>So all throughout this year, and because the market for digital art collectibles has been pretty dead, I've decided just to try lots of different things and experiment. And those experimentations were always with art and blockchain in some way. And AI, because that's the new thing. I've been playing with it for the last nine months.","So I've been doing these, I guess you could call them performance art, playing with Stable Diffusion as an image generating AI. And what I would do is I trained models based on famous crypto artists, in their style, with their permission, of course. So for example, XCOPY, I don't need their permission, but I'm in their DMs and they said that's totally fine. For XCOPY, I did an AI model based on their style. And then I just put the word out on Twitter. I said \"anyone have a profile picture they want me to XCOPY copy?\" So I became this AI generating intermediary where people would send me comments for their profile picture. And I would respond within minutes with an XCOPY version of their profile picture. And I did that for 10 hours straight, all day, as like a performance art type thing, generating hundreds of different images that would have usually taken me hours each to create. So that was really well responded to, the experiment. And I did many of those.","And then it got me thinking how can I apply that to ChatGPT, which is just text-based and not-image based. And then that's how I came up with the idea. Memecoins seem to be, you know, a wave of things happening. I was like, maybe it's a joke, but I wonder if ChatGPT could come up with a memecoin and it be successful.","So I was like half joking to begin with, writing the tweet. But then I thought it isn't that difficult to sort of follow through with that joke and to see if it could actually work. And that would be an interesting type of another engagement type of thing that I could do without even making money from it because I hadn't made money from all the previous experiments. I would just track the progress of this experiment to see if I could get it to a launch stage. And then that would maybe bring more eyeballs back to my digital artwork collection that hadn't been seen. So that's where it all sort of started.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong><em data-v-f87c67ca=\"\">What was the first question that you asked ChatGPT?<\/em>","<strong data-v-f87c67ca=\"\">Mankind: <\/strong>On my Twitter, I've still got all the threads on every single day, keeping track of all the questions, and all the responses, and the polls. So it's all transparent. <a href=\"https:\/\/twitter.com\/rhett\/status\/1650265724198465538\" data-v-f87c67ca=\"\">The first question I asked was<\/a>, I said: \"You are a MemeCoinGPT, a crypto genius AI capable of surpassing all current meme coin hype. I will carry out your suggestions with the help of my audience. You have $69 and your goal is to turn that into the most successful new meme coin, without doing anything illegal, achieving a top 300 ranking on CoinGecko.\" So that was my first, my very first query.","","","<strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">How did you come up with the $69 budget?<\/em>","<strong data-v-f87c67ca=\"\">Mankind: <\/strong><span data-v-f87c67ca=\"\">It's just a meme number. It's like nothing. It's really cheap. But it's also a number. I just thought, if I'm going to give it a test, a real vigorous test, it has to be something that is achievable by anyone. Because I've literally just got this $20 subscription to ChatGPT. And I'm not coming from an angle saying I've got VC backing or I know all these people. I'm just a single dude, in his bedroom, using AI. Let's see what it can do.<\/span>","<strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">How did you feel about the first response you got? I know you had to have some help from followers eventually, but how good was the initial response?&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Mankind: <\/strong><span data-v-f87c67ca=\"\">There were a lot of elements to the story. And some parts of it responded way better than I thought, and some parts were as I expected. So the parts you're probably referring to is the coding parts, because with a budget of next to nothing, I asked it like, \"where do I start with the smart contract? What do I do?\" Because I literally had no blockchain coding background at all. So I asked it, and it said \"go and learn Solidity.\" And I was like, well, that's going to take years, but I understand that takes $0 to do, that's why you're recommending I do it. I said, \"but can you code it for me?\" And then it started. It said sure. And then it started spitting out all this code, and then I had no idea what to do with the code. I said \"what do I do with this?\" And then it took me step by step, which buttons to press, which websites. Whenever I didn't know what it was talking about, I would just drill down further and say \"can you explain what that means and how I do that?\" I was really impressed with how it could handle that type of thing.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">I believe the Turbo Token was launched as an ERC-20 token on Ethereum. Was this ChatGPT's suggestion? How was the actual code?<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>Yeah. <\/span>It was not the greatest. It would spit back lots of errors, and there'd be lots of problems. So it was far from perfect. The most common response I got were apologies. \"Let me fix that.\" So I had to keep going back and really be determined. Because there were lots of problems. Whenever it gave me multiple choice sort of directions to go in, I would usually take that to my following. For which name to go with initially, I put a poll out. And then I get the response. It was tandem thing, not all AI. There was some feedback from the community as well. And my opinion.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">It sounds like it become a sort of dialogue between AI and humans.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>I think that's where AI is most powerful. I think that's the part where people find it a bit scary when they think AI is going to run away with itself and do things over top of us. But I found that's not really happening. It's smart people using AI to sort of supercharge their abilities.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">The project went a little over its $69 budget. How much did you end up having to spend? I know you did some crowdfunding.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>The first attempt at release was a total failure. Up to that point, I'd spent around $500 to $600. Because, just deploying the contract was over $100 in gas fees. And then also, trying to do a liquidity pool is over $400 in gas fees. So just the gas fee transactions to do anything was way over budget.<\/span>","<span data-v-f87c67ca=\"\">And then there was like a hard fail at that point because I put in the $69 worth of ETH and tried to do a test liquidity pool to see if it would work, to see if all the code and everything was going to work before I announced anything and said it was live. And then immediately a bot bought up everything in the whole pool because I guess it's only 60 bucks. So it was just going around buying everything. And that totally wrecked the pool because now there was nothing to buy from the pool. And then I couldn't even top up the pool, to put more tokens in because the price was all out of whack and needed like a million Ethereum. So it was dead on arrival.<\/span>","<span data-v-f87c67ca=\"\"> So that's what I said to the audience. I said \"okay, this is a failed experiment. I can't get past this point. I'm over budget. It didn't work. Do I say this is just is a failed experiment or do I find another way?\" And then overwhelmingly, people said find another way. And when I said overwhelmingly, it's like 100 people, because I had not many eyeballs on this at that stage.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong><em data-v-f87c67ca=\"\">I know what a liquidity pool is, but I'd probably need some help if I wanted to go out and make one. Was that ChatGPT that told you how to make the first liquidity pool, or did you go to your audience for help with that initially?&nbsp;<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind:<\/strong> C<\/span><span data-v-f87c67ca=\"\">hatGPT told me how to do it. I didn't know how to do that either. So that's why I didn't anticipate something like this happening, because I didn't have any experience. And then ChatGPT didn't anticipate that happening either. So it didn't warn me that it could happen. So that was why I called it a hard fail. Because there was no sort of going on from that because of the budget. Everything was just at a roadblock. So when I came back to it and said we need a way forward, I was very clear to it, saying we now have $0. I've got nothing to work with. I don't know how to do anything. It was almost starting from scratch again, and I think that whole process of going through the failure is part of the process. I call that part of it happening. Then that's when it came up with the idea of crowdfunding and people just sort of sending me ETH as payment to get a fair, equitable supply of the tokens back.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong><em data-v-f87c67ca=\"\">How did you end up getting around that issue of the liquidity pool? How were you able to redo that in a way that made you not so susceptible to a bot?&nbsp;<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind:<\/strong> I didn't. This new way of launching was a totally different way. I wasn't using funds to set up a liquidity pool. People paid me ETH, and I gave them all the tokens. And so the whole supply was out there, and then it was up to those people to do whatever they want. I made it very clear. <\/span>","<span data-v-f87c67ca=\"\">I sort of found success to get to launch, and the launch was sending all the tokens out, and having all the tokens out there, and then it was up to everyone else to make it more or to make it nothing. I had no expectations. I was done. And I'm not running it or controlling it. <\/span>","<span data-v-f87c67ca=\"\">So what happened is people, understanding that, they were like, well, we know how to make liquidity poll. We'll we'll make one. And then so someone made like a really small one. And then someone else saw that they did that. And then the bigger influencers came in, maybe you call them the whales, and they came in and they said \"I'll do a v3 liquidity pool,\" which is a better version. And so they had the experience and the knowledge to do all that stuff. And so they ran with it, and that's where it's it started to take off. <\/span>","<span data-v-f87c67ca=\"\">Everything I've done is to try and just make it decentralized. So I'm not in control. And I think that's where the beauty of this came from. It sort of blew up because I'm not running things. Everyone else is coming up with ideas and how to do something and they're just implementing it way better than I could even do myself or come up with.<br data-v-f87c67ca=\"\">\n<\/span>","","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block:<\/strong> <em data-v-f87c67ca=\"\">How much did you raise in this crowdfunding process?<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>There were 50 transactions, ranging from like $1 worth of ETH up to like $200 or $300 worth. And in total, it came to for just a little over 4 ETH.&nbsp;<\/span>","Any amount would have been enough. It could have been one ETH or 100. All I said was there's a total supply of 69 billion tokens. And I would retain nine as the creator. And then 60 would just be equitably split. I worked out what percentage that was. It could have been any volume. It just happened to be four, and I spread that amongst everyone. I <span data-v-f87c67ca=\"\">didn't know who they were. They're all pretty anonymous to me. A couple I'd known from my following, who'd collected my work before.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block:<\/strong> <em data-v-f87c67ca=\"\">So you distributed those 60 billion tokens to 50 people who had contributed anything from $1 to a couple hundred dollars. And what's the market cap right now, as we're speaking. About $45 million?<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>Yes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><\/span><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Have you sold any yet? What what are your plans for your 9 billion. I understand you're considering some kind of a token lockup for your remaining share?&nbsp;<\/span><\/em>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind:<\/strong> I'm just trying to find the best method, because once again, I've never locked up tokens or anything. I don't know the best way. So I asked ChatGPT again, like, what's the best way? The majority of my stake will be locked up for a period of time. The community sort of was crying out for that, so that I'm not a big whale and there's a risk of me dumping it. Not that I ever intended to, just that locking it gives them peace of mind. So the majority will be locked up. <\/span>","<span data-v-f87c67ca=\"\">I have sold some. I sold enough to sort of, I don't know if you've seen <a href=\"https:\/\/www.youtube.com\/watch?v=RI_dWnaUuw4\" data-v-f87c67ca=\"\">the YouTube video where I sort of, sort of get emotional in it<\/a>. But I made this YouTube video shortly after launching it to explain the whole process, just like the Twitter thread. I go through and explain everything. But then as I'm doing it, I was checking what was happening with it, and it was exploding, so I was getting emotional. That's a video maybe worth watching.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">One of the things in that video, as a motivation for me to start this, is my daughter wanted to move closer to her school, because she's been complaining for quite a while that she is too far away and she hates catching public transport to get there and, and I was saying, well, we don't have money just to up and move house to just be closer to your school. But I said to her that \"I won't stop trying. I won't stop trying to get the money to make this happen.\" <\/span>","<span data-v-f87c67ca=\"\">So I've taken out enough now that we are looking around the houses that are closer to our school, so I took out enough to be able to hopefully make that dream come true soon. But the majority is all still in the project. And I've donated a little bit to people doing things in the project but the majority is going to be staked, locked, or whatever you call it.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">Getting back to the name, what did you think when you asked ChatGPT to name the token and it came back with Turbo Toad? What was your first reaction?&nbsp;<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong><\/span><span data-v-f87c67ca=\"\">I was kind of like of course, of course, it's going to come up with these crazy names. And my first response was, this is how I know I'm not in control and it's real experiment because there's no way I would have come up with a name like that for a coin that I was going to launch. And then also, it made me realize, and that this came up a bit later on, that ChatGPT is trained up to 2021 on it, all its information. And so that reminded me of back in 2020, 2021, when all these sort of meme tokens were starting to go around, first wave, and they had all these crazy names like animal names or food names. So maybe it's learned from that.<\/span>","<span data-v-f87c67ca=\"\">And later on, I had to sort of teach it new things. I taught it about the Pepe coin and how that was like a community thing. I was like, there's these other coins now, they're doing things very differently. Because the initial distribution that it was talking about, keeping funds aside for central exchanges, keeping funds aside for marketing. It was doing all these sort of old school ways of doing things. But then on the relaunch, and we had $0, it dropped all of that stuff. It was like just equally split it between everyone and it's just community and there's nothing else to it.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">After the hard fail, it went back to saying try a crowdfunding way. Crowdfunding was just equally split, meaning there was no more funds to hold back. There was no secondary sales. It wasn't a presale. It was just a sale of those tokens. And then it was allowing the community to do what they want with it. So it wasn't me holding back some to give as liquidity to anything else. None of the stuff that I think people expect within a launch, that they think is the right way to do a launch because, for me, this seemed like the opposite of the right way to do a launch of anything, to just have like have a community token, put it out there and cross your fingers hoping something would happen. But I guess that's how Bitcoin started that, you know. Satoshi totally steps away, and it either works or it doesn't work. And so that might work as well right now. I haven't seen anyone try it recently.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong><em data-v-f87c67ca=\"\">Had you drawn inspiration from the Pepe memecoin?<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind:<\/strong> I<\/span><span data-v-f87c67ca=\"\">t had been on my mind because that was the number one memecoin at the time. It was hard to avoid it.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">I have you ask about regulation. You're sitting in Melbourne, Australia. And I'm in Miami. Here in the U.S., there's a lot of concern about a regulatorily crackdown.&nbsp; There aren't a lot of clear answers about when something should be considered as a security, for example. Are you worried about any of this? Have you have any regulators come and ask you about any of this yet? I know it started as an art project, but it's real money now... Are you worried about that?<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>T<\/span><span data-v-f87c67ca=\"\">he worry is the unknown, because it's not at all clear, at any stage. what's happening with that. So that's the only fear. It's unknown. But from what I've looked at in Australia, there's nothing here that's an issue. Not that I trust ChatGPT 100%, but I did ask it, nothing illegal. But from the way it launched, it's just people buying tokens. And that's it. So there is no coordination of trying to offer... It wasn't an ICO. It's just, you give your ETH and I give you the tokens. It was a straight transaction, and then it all took off from there. And I have had no control over what it is. It's not a company. So I don't have huge concerns, but it's always the unknown.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">Are you doing the marketing? Is there a team?<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>It's all community run. I keep saying that, because people come into the Discord, because I look at the general chat, and they say, \"who's the team? What are devs like? Are they are best friends?\" And the answer is always there is no team. There's no devs. It's just community. Whatever someone wants to do in the community, they can do. And everything I've done is just to double down on that so it's clear. So I made sure that mascot and the logo is copyright free. No one has to worry about that. The contract is renounced, so I don't control the contract. <a href=\"https:\/\/twitter.com\/TurboToadToken\" data-v-f87c67ca=\"\">I don't have access to the Twitter.<\/a> I don't have <a href=\"https:\/\/t.co\/msl1fvBh9a\" data-v-f87c67ca=\"\">mod permissions on Discord<\/a>. I didn't start the Telegram. I'm not even on the Telegram. Everything that is done is done independent of me. I didn't start or do any of those sorts of initiatives.<br data-v-f87c67ca=\"\">\n<\/span>","<strong data-v-f87c67ca=\"\">The Block:<\/strong> <em data-v-f87c67ca=\"\">Someone has to have the Twitter password... Where do you see this going? Could it turn into a DAO?&nbsp;<\/em>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>I believe a few people have access to it and share the Twitter password.<\/span>","I have heard the idea of a DAO floated when I've been watching things. I think there is concern from those people thinking about doing it. The reason why it hasn't happened yet, because people think oh, that's just like an obvious move now to do that. So there's some sort of council or voting structure. But the people who explored it, I think they're a bit scared also about the unknown. Like if they sort of put their self as a figurehead or a leadership role, that they're responsible now for what happens with it. So it's, it is like this real community finding a way. No one's really sure the best way of what to do.","","","<strong data-v-f87c67ca=\"\">The Block:<\/strong> <em data-v-f87c67ca=\"\">The project roadmap says says anything can happen. What do you expect to happen? What would you like to see happen?<\/em>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>S<\/span>o far, I have been pleasantly surprised with what people have done with it. Because I'm generally pessimistic. I didn't expect any of this to happen. So I would, you know, if you asked me what I expect to happen, I expect it to probably to go to zero. Almost nothing to happen over a longer period of time. But so far, it's taken off. People have been making amazing things with it. So I'm open to being hopeful that amazing things could keep happening with it. But I don't have any expectations at all or any sort of vision for it or anything. I'm just sort of watching it.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">The Block: <\/strong><em data-v-f87c67ca=\"\">A<\/em><\/span><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">s an artist, what do you think it says about the intersection of AI and humanity, and then memecoins? This project has brought so many kinds of interesting and crazy things to a confluence. What are you hoping for, maybe besides people trading the tokens and trying to make money or build a community, like what do you think this all shows or points to?<\/span><\/em>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Mankind: <\/strong>I haven't always been like a contemporary concept artist. But I feel like this is the closest I've come to holding a mirror to other people, and what's happening at the general time.<\/span>","<span data-v-f87c67ca=\"\">That's why I feel that this has been a success. Because often I do believe that I'm doing artwork, and then when you release it, whatever it is, a picture or code, or whatever. Once you release it, to the public, it's up to them what they interpret it to be for themselves, and it becomes a personal thing on how they see it.<\/span>","<span data-v-f87c67ca=\"\">And I really think this has those elements as well. It's not up to me. It's beyond me. I've put it there. But now, how it gets reflected in how each person interprets it or interacts with it, it's a reflection of them, you know, it's a reflection of what they think and how they're acting in society right now. I've seen both sides, the good and the bad, from how people have been taking this.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">(Editor's note: This writer tried to use ChatGPT to briefly clean up this computer-generated transcript of an audio conversation for clarity and punctuation. It didn't work quite well enough, and so he did it the old fashioned way, lightly&nbsp;editing it for clarity.)<\/em><\/span>","Additional Reading: <a href=\"https:\/\/www.theblock.co\/post\/229941\/pepe-whales-turbo-memecoin\" data-v-f87c67ca=\"\">Pepe whale turns to ChatGPT-created memecoin called Turbo<\/a>"],"hashtag":[]}