{"summary":"Celsius, a global cryptocurrency lending startup, could be in hot water over the status of its native token, after it took precautionary measures this week and suspended the asset&#x27;s distribution in the U.S.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28416\/celsius-faces-pressure-over-its-token-suspending-distribution-with-immediate-effect","publishDate":"2019-06-21T09:29:38","id":10460,"type":null,"title":"Celsius suspending distribution with immediate effect","category":["STARTUPS"],"content":["Celsius, a global cryptocurrency lending startup, could be in hot water over the status of its native token, after it took precautionary measures this week and suspended the asset's distribution in the U.S.","The firm, which sold CEL tokens for $50 million in an ICO in March 2018, sent an email (shown below) to its American users explaining that interest payments in the token, CEL, had been paused with immediate effect, saying the move had been prompted following instruction \"from legal counsel.\"","&nbsp;","","","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Picture: The email sent to Celsius members explaining the move<\/em><\/span>","The firm, which launched <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/celsius-heats-up-with-interest-paying-crypto-accounts\/\" data-v-f87c67ca=\"\">in 2018<\/a> and claims to have more than 10,000 accounts, generates funds through its main lending business and then redistributes it as interest. It reportedly pays interest of up to 6.7% on investments, paid in CEL or in the digital asset that was invested. Benefits of being paid in CEL including \"lower interest rates on coin and fiat loans, higher earned interests on non-CEL deposits, [and] a cashback rewards program.\"","Still, by using the token to pay interest, Celsius may have been treading a regulatory fine line says Stephen Palley, a crypto-specialized lawyer at Anderson Kill.","\"On the one hand, it appears they've been advised by lawyers that interest payments may make the token look like a security to US regulators. On the other hand, they surely recognize that by stopping these payments they face some litigation risk as well. This is what lawyers called a Hobson's choice - meaning you're damned if you do and you're damned if you don't,\" he said. He added that stopping payments now would not necessarily remedy any potential previous misstep.","The CEL token <a href=\"https:\/\/www.businesswire.com\/news\/home\/20190611005691\/en\/Celsius-Network-Announces-Listing-CEL-Token-Liquid\" data-v-f87c67ca=\"\">was listed<\/a> on Liquid earlier this month but trades at 26% of its <a href=\"https:\/\/icobench.com\/ico\/celsius\" data-v-f87c67ca=\"\">ICO price<\/a> (where it raised $50M) with virtually no liquidity. Sources also told The Block that the reason CEL is not listed on any large exchanges is because they don't feel comfortable with its regulatory status. Celsius' COO Daniel Leon denied that was the case.","Crypto-secured lending is a nascent lending market that has seen significant uptake in both growth and innovation over the prior 12 months. But it has been plagued with regulatory issues and few successes so far. Newcomer Celsius was pitched to bring new promise to the space, joining fellow token-based lending platforms Nexo and Salt. [related id=\"1\"]","The firm noted they would have an update \"in the next few weeks\" about CEL's fate.","\"CEL cannot be used in the US, period. This is a complete block,\" Celsius' Leon told The Block. \"We will continue to work with a group of esteemed lawyers to come up with a solution while staying fully compliant.\"","Asked about the reaction from customers, Leon said: \"People appreciated it. They said 'you're thinking long term.' We're lucky to have customers who recognise how hard we work.\"","He also confirmed that 40% of the users were from the US, 30% were from Europe and the rest from Asia. Users in the latter two geographies will not be affected by CEL's withdrawal.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6.7%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Liquid earlier this month","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"30%","content":"PERCENT"},{"type":"CEL","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"Anderson Kill","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"March 2018","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"26%","content":"PERCENT"},{"type":"Hobson","content":"ORGANIZATION"},{"type":"$50M","content":"MONEY"},{"type":"Leon","content":"PERSON"},{"type":"Daniel Leon","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}