{"summary":"Historically, VCs have been adept at implementing &quot;counter-cyclical&quot; strategies and discerning shifts in market sentiment. They typically capitalize on opportunities ahead of others: during bear markets, they broaden their investment scope, leveraging their advantages such as market insights and incubation resources, which individual investors may not have access to. This allows them to position themselves ahead of the curve in promising sectors and projects, ultimately benefiting from the early gains of the bull market through the wealth effect of leading tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285033\/as-the-market-regains-momentum-in-the-bull-market-which-exceptional-projects-has-foresight-x-identified","publishDate":"2024-03-27T10:01:02","id":10472,"type":null,"title":"As the market regains momentum in the bull market, which exceptional projects has Foresight X identified?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Whenever the market transitions from a bear market to a bull market, there is a significant surge in market liquidity. For investors, how to seize the opportunity and identify the investments with the highest potential for gains during this period?<\/span>","<span data-v-f87c67ca=\"\">Historically, VCs have been adept at implementing \"counter-cyclical\" strategies and discerning shifts in market sentiment. They typically capitalize on opportunities ahead of others: during bear markets, they broaden their investment scope, leveraging their advantages such as market insights and incubation resources, which individual investors may not have access to. This allows them to position themselves ahead of the curve in promising sectors and projects, ultimately benefiting from the early gains of the bull market through the wealth effect of leading tokens.<\/span>","<span data-v-f87c67ca=\"\">Using the pivotal year of 2023 as a case in point, various concepts such as the Bitcoin Ecosystem, Solana Ecosystem, LSD Protocol, Modularity, and Re-Staking have taken center stage in succession. Whether it's the initial surge of excitement surrounding BTC Layer 2 infrastructure driven by the Ordinals, or the remarkable performance of modular new projects like SEI and TIA, many of these represent early-stage investments that leading VCs had strategically positioned themselves in.<\/span>","<span data-v-f87c67ca=\"\">Therefore, for ordinary users, tracking the project allocation of VCs, particularly prominent ones, undoubtedly offers the most indicative direction. Essentially, the investment landscape of VCs comprises \"premium seed players\" filtered through their investment research and industry judgment—the more exceptional a VC's track record, the greater its reference value.<\/span>","<span data-v-f87c67ca=\"\">Against this backdrop, as a representative of the new generation of crypto VCs that have swiftly emerged during the industry reshuffle of the past two years, Foresight Ventures is renowned for its contrarian large-scale positioning. It spans various sectors such as AI, DePIN, BTC L2, Data, On-Chain ML Models, and LSD, demonstrating a high sensitivity to investments and a keen ability to explore hotspots.<\/span>","<span data-v-f87c67ca=\"\">In this context, this article explores the investment inclinations of prominent VCs regarding the emerging narrative of Web3 in 2024. It does so by scrutinizing the incubation projects of Foresight X, the accelerator under Foresight Ventures, over the past year. The objective is to identify potential \"seed players\" poised to lead the narrative in 2024.<\/span>","<span data-v-f87c67ca=\"\">As of now, in addition to Foresight Ventures, the Foresight ecosystem also comprises Web3 media <\/span><b data-v-f87c67ca=\"\">Foresight News<\/b><span data-v-f87c67ca=\"\">, the accelerator <\/span><b data-v-f87c67ca=\"\">Foresight X<\/b><span data-v-f87c67ca=\"\">, and the Web3 media research institution <\/span><b data-v-f87c67ca=\"\">The Block<\/b><span data-v-f87c67ca=\"\">. Together, they form a comprehensive one-stop service provider offering incubation, investment, and consulting services throughout the project lifecycle.<\/span>","<span data-v-f87c67ca=\"\">As the principal flagship product within the broader Foresight investment ecosystem, Foresight X has launched a total of three cohort accelerators over the past year, with a combined allocation of $30 million dedicated to supporting high-quality projects.<\/span>","<span data-v-f87c67ca=\"\">The first cohort concluded in March 2023, selecting 7 projects. The second selection was completed in October 2023, with 4 projects selected. The third cohort of the accelerator program successfully concluded in March of this year, selecting a total of 6 projects. These selected projects cover various fields such as DePIN, AI, BTC L2, Data, On-Chain ML Models, RGB, ORDI, Taproot Assets, BitVM, BTC Sidechains, BTCFi, Blockchain Game, Creator Economy, SocialFi, DID, ZK dapps, Tokenized real-world assets, Privacy tracks, and other Web3 domains. Many projects integrate multiple narratives such as AI and DePIN.<\/span>","<span data-v-f87c67ca=\"\">Additionally, selected projects not only receive professional one-on-one acceleration services from Foresight X throughout the cycle but also have access to resources in various aspects such as technical support, brand marketing, tokenomics, operations, listing, company management, talent development, legal regulations, etc. This provides \"full-process, full-chain, all-round\" support to assist projects in their development.<\/span>","<b data-v-f87c67ca=\"\">The following introduces the selected projects worth noting in these three cohort accelerators:&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Ion Protocol is a price-agnostic lending platform built to support staked and re-staked assets. It allows users to participate in lending markets of all kinds, ranging from leveraged staking yields to points multiplier pools and more. Ion focuses on bringing staking-based mechanisms to DeFi, creating an enhanced lending and borrowing experience for users to earn more while risking less.<\/span>","<span data-v-f87c67ca=\"\">Website: https:\/\/ionprotocol.io\/<\/span>","<span data-v-f87c67ca=\"\">X:<\/span><a href=\"https:\/\/twitter.com\/ionprotocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> https:\/\/twitter.com\/ionprotocol<\/span><\/a>","<span data-v-f87c67ca=\"\">GoSleep is a HealthFi-focused lifestyle app built on Arbitrum platform that incentivizes players to lead a healthy lifestyle. With personalized sleep advice tailored to their sleeping patterns, GoSleep aims to assist players in developing healthy sleep habits over time.<\/span>","<span data-v-f87c67ca=\"\">Website: https:\/\/gogogosleep.com\/index<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">X: https:\/\/twitter.com\/gosleep01<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Discord: https:\/\/discord.gg\/gosleep<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Opensea OG: <\/span><a href=\"https:\/\/opensea.io\/collection\/gosleep-nightscaper-edition\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/opensea.io\/collection\/gosleep-nightscaper-edition<\/span><\/a>","<span data-v-f87c67ca=\"\">ORA is the verifiable Oracle protocol that brings AI and complex compute onchain. ORA has two main products: AI Oracle (OAO): Brings AI onchain. zkOracle: Brings complex compute and historical data onchain. ORA breaks down the limitations of smart contracts with richer data sources and compute so developers can innovate freely.<\/span>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/twitter.com\/OraProtocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/OraProtocol<\/span><\/a>","<span data-v-f87c67ca=\"\">More: <\/span><a href=\"https:\/\/linktr.ee\/ora.io\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/linktr.ee\/ora.io<\/span><\/a>","<span data-v-f87c67ca=\"\">Space Nation Online, stands as a groundbreaking Web3 Space Opera MMORPG, designed to provide an unparalleled gaming experience for both Massive Web2 Gamers and the diverse community of Web3 users.<\/span>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/twitter.com\/SpaceNationOL\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/SpaceNationOL<\/span><\/a>","<span data-v-f87c67ca=\"\">More: <\/span><a href=\"https:\/\/link3.to\/spacenationol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/link3.to\/spacenationol<\/span><\/a>","<span data-v-f87c67ca=\"\">TonUP is an innovative platform built on the TON Blockchain that aims to revolutionize the way projects are launched and supported in the crypto space. It provides a comprehensive ecosystem for token launches, community participation, and project growth. TonUP is on a mission to discover and nurture the most promising projects out there, bringing exciting opportunities to the wider community. With the unwavering support of TON Foundation and Foresight X, they are dedicated to empowering assets with remarkable potential on the TON Blockchain, fostering the growth of a vibrant TON ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Website: <\/span><a href=\"https:\/\/tonup.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/tonup.io\/<\/span><\/a>","<span data-v-f87c67ca=\"\">More: <\/span><a href=\"https:\/\/linktr.ee\/tonup\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/linktr.ee\/tonup<\/span><\/a>","<span data-v-f87c67ca=\"\">Glacier Network is building a programmable, modular, and scalable data network for large-scale DApps, supercharging DePIN and GenAI. Glacier empowers decentralized apps with Data Availability (DA), enabling them to build on decentralized Database (DB), powered by Data Compatibility (DC). Glacier launched the GlacierDA to solve the demand for off-chain verification and computation of executed states of GenAI and DePIN. It provided a programmable data-centric blockchain to seamlessly and effortlessly handle datasets with GlacierDB and LLM VectorDB on top of Arweave, Filecoin, and BNB Greenfield.<\/span>","<span data-v-f87c67ca=\"\">Website:<\/span><a href=\"https:\/\/www.glacier.io\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/www.glacier.io\/<\/span><\/a>","<span data-v-f87c67ca=\"\">Twitter:<\/span><a href=\"https:\/\/twitter.com\/Glacier_Labs\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/twitter.com\/Glacier_Labs<\/span><\/a>","<span data-v-f87c67ca=\"\">Telegram:<\/span><a href=\"https:\/\/t.me\/glacier_labs\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/t.me\/glacier_labs<\/span><\/a>","<span data-v-f87c67ca=\"\">Discord:<\/span><a href=\"https:\/\/discord.gg\/eYAGGz5W3b\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/discord.gg\/eYAGGz5W3b<\/span><\/a>","<span data-v-f87c67ca=\"\">LSDx is an ultra-liquid protocol for all LSDs. It aims to optimize the financial value of liquid staking derivatives (LSD) assets, addressing the limited liquidity and lack of diverse financial scenarios that hinder their connection with various DeFi protocols.<\/span>","<span data-v-f87c67ca=\"\">ETHx is the first liquidity pool to be launched by LSDx. Users can subscribe to ETHx by staking ETH, stETH, and sfrxETH. This allows for different LSD tokens to be instantly switched with low slippage through ETHx. LSD holders will enjoy higher APR, better liquidity, and more dispersed risk.<\/span>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/twitter.com\/LSDxfinance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/LSDxfinance<\/span><\/a>","<span data-v-f87c67ca=\"\">Discord:<\/span><a href=\"https:\/\/discord.gg\/GnXWfsz8Dm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> https:\/\/discord.gg\/GnXWfsz8Dm<\/span><\/a>","<span data-v-f87c67ca=\"\">XLink, a strategic spinoff from ALEX Lab, positioning itself as a critical Crypto Bridge within the Bitcoin Ecosystem. Our platform enables the smooth transfer of assets across Bitcoin, Bitcoin L2 such as Stacks, and EVM. As a gateway for users venturing into the Bitcoin space, XLink is dedicated to transforming the native DeFi experience. We're actively forging partnerships and integrating with top-tier BTC Layer2s, aiming to enhance liquidity and seamless asset transactions.<\/span>","<span data-v-f87c67ca=\"\">X:<\/span><a href=\"https:\/\/twitter.com\/XLinkbtc\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/twitter.com\/XLinkbtc<\/span><\/a>","<span data-v-f87c67ca=\"\">Unicross is a versatile platform that enables users to inscribe, trade, and bridge BTC assets on Bitcoin Layer 2.&nbsp; Through UniCross, users can mint Layer 1 BRC-20 tokens(including ARC-20, BRC-420, and others) directly on Bitcoin Layer 2. Unicross provides users with the flexibility to make payments using various blockchain assets, such as BRC-20, BTC, and ETH. When users complete the minting of BTC assets, they are granted stTokens, which can be traded on the Unicross Marketplace or swapped for Layer 2 ERC-20 tokens.<\/span>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/twitter.com\/UniCrossGlobal\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/UniCrossGlobal<\/span><\/a>","<span data-v-f87c67ca=\"\">Discord: <\/span><a href=\"https:\/\/discord.gg\/unicross\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">http:\/\/discord.gg\/unicross<\/span><\/a>","<span data-v-f87c67ca=\"\">Medium: <\/span><a href=\"https:\/\/medium.com\/@UniCross\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/medium.com\/@UniCross<\/span><\/a>","<span data-v-f87c67ca=\"\">Shell Finance is a trustless lending protocol operating on the Bitcoin Layer1 network, allowing users to utilize Bitcoin inscription assets (including Ordinals, Runes, Atomicals, Stamps, etc.) as collateral to obtain loans. Loans are disbursed as synthetic Bitcoin assets, $BTCx, issued by Shell Finance. Essentially, Shell Finance empowers users to leverage their assets and unlock liquidity without selling them. Shell Finance will launch an NFT collection called Darkman with its token yield farming this month.<\/span>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/x.com\/shellfinance_\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/x.com\/shellfinance_<\/span><\/a>","<span data-v-f87c67ca=\"\">Telegram: <\/span><a href=\"https:\/\/t.me\/ShellFinance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/t.me\/ShellFinance<\/span><\/a>","<span data-v-f87c67ca=\"\">Docs: <\/span><a href=\"https:\/\/shellfinance.gitbook.io\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/shellfinance.gitbook.io<\/span><\/a>","<span data-v-f87c67ca=\"\">Apus Network is a decentralized AI Agents DePIN project that leverages blockchain technology, Web3, and DePIN computational resources to establish a transparent, secure, and incentive-compatible AI ecosystem. Governed by the community, developers contribute AI agents, and nodes offer computational power, all with the aim of providing trustworthy AI services to users. The overarching objective is to democratize AI, creating a scenario where all parties benefit mutually, resulting in a win-win situation.<\/span>","<span data-v-f87c67ca=\"\">Website:<\/span><a href=\"https:\/\/www.apus.network\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/www.apus.network\/<\/span><\/a>","<span data-v-f87c67ca=\"\">X:<\/span><a href=\"https:\/\/twitter.com\/apus_network\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/twitter.com\/apus_network<\/span><\/a>","<span data-v-f87c67ca=\"\">Originating in California, CUDIS epitomizes the perfect fusion of AI, DePIN, wellness, and fashion. It aims to provide the masses with accessible and rewarding wellness tracking services backed by blockchain encryption, granting health data to their owners and allowing them to monetize through token rewards. Unlike its traditional competitors, namely Oura and Whoop, which charge $72-$360 annually, CUDIS has a minimal barrier of entry while allowing users to profit from the wellness ecosystem. In the next 12-18 months, CUDIS is going to deliver 1M+ wearable DePIN products to both web2 and web3 users.<\/span>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/twitter.com\/CudisWellness\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/CudisWellness<\/span><\/a>","<span data-v-f87c67ca=\"\">Zest is creating a consumer-focused Web3-native brand with the goal of facilitating broader user participation in the Web3 movement through non-financial means. Their inaugural product, the Model323 sneaker, features a built-in Insol smart chip that tracks user exercise data. This data is then used in combination with tokenomics to reward users for their health data feedback, creating a lightweight fitness ecosystem. Zest's long-term vision includes expanding their product line to encompass a range of sports products, fostering a community-centric brand with high user engagement.<\/span>","<span data-v-f87c67ca=\"\">Website:<\/span><a href=\"https:\/\/zestlab.xyz\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/zestlab.xyz\/<\/span><\/a>","<span data-v-f87c67ca=\"\">X:<\/span><a href=\"https:\/\/twitter.com\/zestlabxyz\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">twitter.com\/zestlabxyz<\/span><\/a>","<span data-v-f87c67ca=\"\">Blade Games is an on-chain game studio and infrastructure provider, built around the WebAssembly and zkWASM tech stack. Games built with their zk game engine can run the game logic (c++, go, rust) inside the zkVM, and settle game results as ZKP on L2s in a modular way.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">Website: <\/span><a href=\"https:\/\/www.bladedao.games\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/www.bladedao.games<\/span><\/a>","<span data-v-f87c67ca=\"\">X: <\/span><a href=\"https:\/\/twitter.com\/BladeGamesHQ\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/twitter.com\/BladeGamesHQ<\/span><\/a>","<span data-v-f87c67ca=\"\">Discord: <\/span><a href=\"https:\/\/discord.gg\/BladeDAO\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/discord.gg\/BladeDAO<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For ordinary users, the current market landscape is marked by a gradual resurgence and rapid shifts in hotspots, evoking both optimism and apprehension. Particularly, how to position oneself ahead of the bull market has become the most pressing concern for everyone. After all, achieving timely awareness of potential tokens and quickly entering trending concepts entails significant challenges, both in terms of time and energy.<\/span>","<span data-v-f87c67ca=\"\">Therefore, the strategies employed by VCs, particularly those demonstrated by emerging leaders such as Foresight Ventures, provide valuable insights for ordinary users aiming to navigate the market effectively and capitalize on opportunities. In this regard, closely monitoring seed projects meticulously chosen by prominent VC incubators like Foresight X is crucial. Perhaps, looking back in a year, it's conceivable to find among them pioneering projects that are shaping new narratives within the web3 landscape.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TIA","content":"ORGANIZATION"},{"type":"TON Foundation","content":"ORGANIZATION"},{"type":"RGB","content":"ORGANIZATION"},{"type":"$72","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Atomicals","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Shell Finance","content":"ORGANIZATION"},{"type":"October 2023","content":"DATE"},{"type":"18 months","content":"DATE"},{"type":"Solana Ecosystem","content":"PERSON"},{"type":"$BTCx","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"BNB Greenfield","content":"ORGANIZATION"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"$360","content":"MONEY"},{"type":"Filecoin","content":"LOCATION"},{"type":"Oura","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Data Compatibility (DC)","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Stamps","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"next 12","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"March of this year","content":"DATE"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}