{"summary":"U.S.-based exchange Kraken, which has had its own share of legal concerns, could seen an immediate upside from Binance&#x27;s woes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223716\/binance-collapse-would-help-kraken","publishDate":"2023-03-29T18:46:53","id":10477,"type":null,"title":"Binance&#x27;s bad days could be good for Kraken","category":["COMPANIES"],"content":["Binance is by far the largest crypto exchange by volume, and the <a href=\"https:\/\/www.theblock.co\/post\/223485\/cftc-binance-suit-what-comes-next\" data-v-f87c67ca=\"\">impact of a lawsuit<\/a> filed earlier this week by the Commodity Futures Trading Commission against it will surely spread far and wide across the industry for the foreseeable future. While it still may be premature to ponder a world without Binance, analysts have been quick to point out just who's in line to benefit from the behemoth's legal predicament.&nbsp;","U.S.-based exchange Kraken, which has had its own share of legal concerns, could see an immediate upside from Binance's woes, according to <a href=\"https:\/\/www.linkedin.com\/in\/jeannette-spaulding\/\" data-v-f87c67ca=\"\">Jeannette Spaulding<\/a>, a crypto consultant and co-founder of Tokenwise.&nbsp;","\"At the end of the day, a lot of the crypto industry will find a way to transact,\" she said in an interview in Miami. \"For a lot of people, Binance is their on-ramp because that's the easiest solution for them, and it's the cheapest way for them to access the markets. If they no longer have access to Binance, there are a lot of other centralized exchanges, and a lot of other decentralized exchanges, and it just depends on what are people willing to pay to get access to the market.\"","The <a href=\"https:\/\/www.theblock.co\/post\/223143\/binance-details-from-cftc-complaint\" data-v-f87c67ca=\"\">CFTC suit<\/a> accused Binance and its CEO Changpeng Zhao of unregistered commodities trading in the U.S., but it also alleged the company facilitated transactions by organized crime and terrorist organizations in a move that led many to assume a <a href=\"https:\/\/www.theblock.co\/post\/223485\/cftc-binance-suit-what-comes-next\" data-v-f87c67ca=\"\">broader crackdown<\/a> against the company could be in the works. Binance has called the suit \"unexpected and disappointing,\" <a href=\"https:\/\/www.binance.com\/en\/blog\/from-cz\/czs-response-to-the-cftc-complaint-2408916493005890282\" data-v-f87c67ca=\"\">refuting<\/a> much of it in a statement on its website.&nbsp;","Although the sudden exit of a major exchange like Binance may seem unimaginable, it wouldn't exactly be without precedent — it's only been several months since former heavyweight FTX collapsed in a matter of days, albeit for completely different reasons. In that case, the industry moved on quickly, despite initial fears, and the price of bitcoin has even surged more than 30% from levels seen before FTX's troubles first emerged in November.&nbsp;","\"I<span class=\"TextRun SCXW259763771 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW259763771 BCX0\" data-v-f87c67ca=\"\">f crypto is one thing, <\/span><span class=\"NormalTextRun SCXW259763771 BCX0\" data-v-f87c67ca=\"\">it's<\/span><span class=\"NormalTextRun SCXW259763771 BCX0\" data-v-f87c67ca=\"\"> resilient, and there are a lot of platforms that are waiting in the wings and that are competitors right now to <\/span><span class=\"NormalTextRun SpellingErrorV2Themed SCXW259763771 BCX0\" data-v-f87c67ca=\"\">Binance<\/span> <span class=\"NormalTextRun SCXW259763771 BCX0\" data-v-f87c67ca=\"\">that are going to be able to step up and take on the demand,\" Spaulding said, noting that Binance's troubles could have an immediate impact on trading volume and the derivatives market that the exchange currently supports.&nbsp;<\/span><\/span>","If Binance was forced to scale back, Dubai-based Bybit would benefit the most as the next largest perpetual exchange, according to The Block research director Steven Zheng. Kraken and fellow U.S. exchange Coinbase would be in a position to pick up any remaining scraps, Zheng added, noting that Kraken's futures product could see some increased volume flow into it.","Kraken didn't immediately respond to request for comment on its capacity to handle any increased demand in the wake of the Binance lawsuit.","While alternative sources of liquidity could emerge in the event of a disruption to Binance's operations, Fireblocks Chief Legal and Compliance Officer <a href=\"https:\/\/www.linkedin.com\/in\/jasonallegrante\/\" data-v-f87c67ca=\"\">Jason Allegrante<\/a> pointed out that \"every significant market maker in the world executes trades and sources liquidity\" on the exchange. In the long run, he said that new entrants including traditional financial market participants such as Nasdaq could step in to pick up the slack.&nbsp;","\"Major exchanges such as Binance provide important on-ramps, price discovery, and liquidity, but we do not believe that the existence of any single exchange is critical to crypto’s long-term success, which will be determined by the utility of truly decentralized technologies and the entrepreneurs who build them,” said <span class=\"TextRun SCXW256088989 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW256088989 BCX0\" data-v-f87c67ca=\"\">North Island Ventures co-founder and managing partner <a href=\"https:\/\/www.linkedin.com\/in\/travis-scher-74799420\/\" data-v-f87c67ca=\"\">Travis Scher<\/a>.<\/span><\/span>","<span class=\"NormalTextRun SCXW136300754 BCX0\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.linkedin.com\/in\/jack-mcdonald-2314011\/\" data-v-f87c67ca=\"\">Jack McDonald<\/a>, CEO of custody, trading and administration infrastructure startup <\/span><span class=\"NormalTextRun SpellingErrorV2Themed SCXW136300754 BCX0\" data-v-f87c67ca=\"\">PolySign<\/span>, said that the sudden exit of a larger player from certain jurisdictions would likely create more volatility in the asset class. Opportunities exist, however, for smaller players providing service in spot, futures and derivatives markets.&nbsp;","\"<span class=\"TextRun SCXW180647575 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW180647575 BCX0\" data-v-f87c67ca=\"\">We also expect to see increased opportunities for permissioned DEXs or DeFi platforms, given that many of the systemic failures affecting crypto tend to be centralized players and not platforms managed by code,\" he said.&nbsp;<\/span><\/span>","<span class=\"TextRun SCXW21921385 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.linkedin.com\/in\/hirander-misra-900379\/\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW21921385 BCX0\" data-v-f87c67ca=\"\">Hirander<\/span><\/a><span class=\"NormalTextRun SCXW21921385 BCX0\" data-v-f87c67ca=\"\"> Misra, chairman and CEO of GMEX Group, said the current disruptions in the market will lead to a \"flight to quality,\" pushing investors to seek out offerings with the right governance, control, security and risk management.<\/span><\/span>","\"<span class=\"TextRun SCXW35243798 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW35243798 BCX0\" data-v-f87c67ca=\"\">There will be much more decoupling of functions as exchanges should be exchanges and not have market making, brokering and other such functions coupled within them,\" he said.<\/span><\/span>","The CFTC suit, and broader regulatory uncertainty in the U.S., do present risks to companies operating in the country, even those positioned to expand operations if some actors are pushed out of the market.","\"It is certainly true that rogue corrupt actors need to be penalized and that American customers need protections,\" <span class=\"TextRun SCXW151891431 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW151891431 BCX0\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.linkedin.com\/in\/avivahlitan\/\" data-v-f87c67ca=\"\">Avivah Litan<\/a>, a Gartner web3 analyst, said in an emailed response to questions, adding that the move could stifle blockchain and crypto innovation in the U.S. if clearer and cohesive rules aren't put in place by lawmakers and regulators. \"This latest action continues to validate the fact that the Biden Administration is concertedly trying to squash the cryptocurrency industry in the United States.\"<\/span><\/span>","It's a sentiment that was echoed by Spaulding, who said that jurisdictions including Singapore, the UAE and even some European countries could emerge as the true winners.","<span class=\"TextRun SCXW151891431 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW151891431 BCX0\" data-v-f87c67ca=\"\">\"The world is already not waiting for the U.S., which is sad to say, and I don't want to be saying that, but there are already companies that I've had a lot of conversations with, platforms that are saying 'you know, we'd love to be in the U.S. but it's not feasible right now,'\" she said. \"<span class=\"TextRun SCXW218362898 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW218362898 BCX0\" data-v-f87c67ca=\"\">Regulations <\/span><span class=\"NormalTextRun SCXW218362898 BCX0\" data-v-f87c67ca=\"\">aren't<\/span><span class=\"NormalTextRun SCXW218362898 BCX0\" data-v-f87c67ca=\"\"> inherently bad, but there is a way to enforce them that still can foster innovation. And what <\/span><span class=\"NormalTextRun SCXW218362898 BCX0\" data-v-f87c67ca=\"\">we're<\/span><span class=\"NormalTextRun SCXW218362898 BCX0\" data-v-f87c67ca=\"\"> doing right now is enforcing them in a way that stifles innovation.\"<\/span><\/span><\/span><\/span>","<em data-v-f87c67ca=\"\">With additional reporting from Christiana Loureiro, RT Watson and Jeremy Nation.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jack McDonald","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Hirander<\/span><\/a><span class=\"NormalTextRun SCXW21921385 BCX0\" data-v-f87c67ca=\"\"> Misra","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"Christiana Loureiro","content":"PERSON"},{"type":"Avivah Litan","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"GMEX Group","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"Jeremy Nation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"end of the day","content":"TIME"},{"type":"Jason Allegrante","content":"PERSON"},{"type":"Biden Administration","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Jeannette Spaulding","content":"PERSON"},{"type":"Travis Scher","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"North Island Ventures","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Spaulding","content":"PERSON"},{"type":"Gartner","content":"ORGANIZATION"},{"type":"RT Watson","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["BINANCE","KRAKEN"],"authors":["Nathan Crooks","The Block"]}