{"summary":"A new system for gathering data on malware is live, with the goal of rewarding users with crypto for the information they collect.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164218\/polyswarm-launches-token-rewards-to-crowdsource-cybersecurity-with-crypto","publishDate":"2022-08-18T09:00:47","id":10475,"type":null,"title":"PolySwarm launches token rewards to crowdsource cybersecurity with crypto","category":["SECURITY"],"content":["A new system for gathering data on malware is live, with the goal of rewarding users with crypto for the information they collect.","PolySwarm, a cybersecurity data firm, is taking its crowdsourced reporting system live today. Users can download the NectarNet browser plug-in, which will gather URL and domain data that they encounter malware in the digital wild. The plug-in will reward users with the ERC-20-ready NCT token with greater rewards on new and rare strains.","While plenty of <a href=\"https:\/\/www.theblock.co\/post\/146650\/risk-monitoring-firm-solidus-labs-raises-45-million-in-series-b-funding\" data-v-f87c67ca=\"\">threat intelligence<\/a> services focus on identifying crypto-related malware, the use of a blockchain to incentivize threat data sharing represents a fairly new concept.","“Effectively what we’re trying to do here is Pokemon Go for threat hunting,” CEO Steve Bassi tells The Block.","Roughly four hundred existing users have installed the app already on an invite-only basis. A PolySwarm rep says that those users have been earning roughly $2 per day in NCT rewards. It’s a system similar to how Brave Browser rewards users for ad viewing using their Basic Attention Token.","The user data itself, Bassi says, remains under lock and key: “Only when a user gets rewarded for a sighting does a customer see an impact in their data.”","He compares to what he calls the re-centralization of the internet, by which giant service providers centralize and sell user-gathered domain data without recompensing users.","","","Source: <a href=\"https:\/\/coinmarketcap.com\/currencies\/polyswarm\/\" data-v-f87c67ca=\"\">CoinMarketCap<\/a> [replace on Aug. 18]","The NCT token itself has traded around $0.017 to $0.02 for the past month, with a 22% spike to $0.022 on the eve of the launch. 33% of the reported volume coming from its listing on Coinbase, though this is likely an underestimate given limited confidence in other major market, BTCEX. NCT tokens do not redeem any services with PolySwarm and, the firm says, derives some of its value proposition from the altruism of helping identify threat networks.","The end clients are outside security firms paying five- and six-figure sums for contracts to the security data that NectarNet provides. The new program passes, Bassi estimates, 10-20% of that revenue on to the end users via the plug-in.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.02","content":"MONEY"},{"type":"$0.022","content":"MONEY"},{"type":"NCT","content":"ORGANIZATION"},{"type":"Aug. 18","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Steve Bassi","content":"PERSON"},{"type":"22%","content":"PERCENT"},{"type":"33%","content":"PERCENT"},{"type":"$2","content":"MONEY"},{"type":"Bassi","content":"PERSON"},{"type":"$0.017","content":"MONEY"}],"hashtag":[],"authors":["Kollen Post","The Block"]}