{"summary":"Vauld has until Jan. 20 to explore options to ease its financial troubles, according to an email obtained from The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185858\/vauld-creditor-protection-exntension-january","publishDate":"2022-11-11T07:18:06","id":10471,"type":null,"title":"Vauld gets creditor protection until January as court blocks longer extension","category":["FINANCE FIRMS"],"content":["Troubled Asian crypto lender Vauld has received a further extension to its legal protection from creditors — albeit a shorter delay than requested.&nbsp;","The company now has until Jan. 20 to explore options to ease its financial troubles, according to an email from Vauld to its creditors obtained by The Block. Vauld, however, <a href=\"https:\/\/www.theblock.co\/post\/179034\/vauld-seeks-another-four-months-of-protection-against-creditors\" data-v-f87c67ca=\"\">had sought<\/a> protection through March 7. The firm's previous creditor protection expired on Nov. 7 and on the same day, the latest extension was granted in the Singapore Hight Court at a hearing before Justice Aedit Abdullah, according to the email.","Vauld halted client withdrawals in July and owes over $400 million to creditors. At the time, rival Nexo entered into a 60-day exclusive due diligence agreement with Vauld to potentially acquire it, but it has extended the due diligence period twice. Last month, <a href=\"https:\/\/www.theblock.co\/post\/177233\/nexo-once-again-extends-due-diligence-period-on-potential-vauld-deal\" data-v-f87c67ca=\"\">The Block reported<\/a> that Nexo could take \"as long as needed\" to decide on the potential deal, while it is \"cautiously optimistic\" about it.","Meanwhile, customers' funds remain stuck. If Nexo doesn't acquire Vauld, the latter has said it has other options to explore, including issuing a token and raising capital.","If Vauld were to apply for a further moratorium, a hearing would take place on Jan. 17, subject to the availability of the court, the email said.","In the meantime, the court has ordered Vauld to submit an affidavit by Nov. 25 addressing issues, including the situation faced by its Indian entity, Flipvolt Technologies. In August, India's Enforcement Directorate <a href=\"https:\/\/www.theblock.co\/post\/163329\/indian-authorities-freeze-46-million-worth-of-vaulds-assets\" data-v-f87c67ca=\"\">froze<\/a> assets worth $46 million after it found a Vauld client was involved in a money laundering case.","\"We are committed to alleviating the hardship faced by our creditors, and the company is working towards achieving a restructuring that would be in the interests of the creditors,\" Vauld said in the email.","The firm did not immediately respond to a request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jan. 20","content":"DATE"},{"type":"Nov. 7","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Enforcement Directorate","content":"ORGANIZATION"},{"type":"Flipvolt Technologies","content":"ORGANIZATION"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Jan. 17","content":"DATE"},{"type":"Justice Aedit Abdullah","content":"ORGANIZATION"},{"type":"Singapore Hight Court","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"India","content":"LOCATION"},{"type":"$46 million","content":"MONEY"},{"type":"March 7","content":"DATE"},{"type":"Nov. 25","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["COURT HEARINGS","CRYPTO BANKS AND LENDERS","LAWSUITS"],"authors":["Yogita Khatri","The Block"]}