{"summary":"Metropolitan Commercial Bank is winding down its crypto asset vertical.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200126\/metropolitan-commercial-bank-to-close-crypto-vertical","publishDate":"2023-01-09T09:46:12","id":10473,"type":null,"title":"Metropolitan Commercial Bank to close crypto vertical","category":["POLICY"],"content":["Metropolitan Commercial Bank’s holding company will exit its crypto asset vertical, pointing to the shifting regulatory environment for banks involved in crypto, developments in the industry and business opportunities.","The bank’s shift comes a week after a trio of U.S. banking regulators <a href=\"https:\/\/www.theblock.co\/post\/198984\/u-s-regulators-issue-post-ftx-collapse-crypto-warning-to-banks\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">warned<\/span><\/a>&nbsp;about putting too much leverage in cryptocurrency. The volatile crypto market plunged last year amid the high-profile collapses of several major crypto firms.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Metropolitan Commercial Bank does not hold crypto on its balance sheet, and does not market or sell crypto assets to customers. The bank will have “minimal financial impact” from exiting its crypto vertical, it said in a <a href=\"https:\/\/investors.mcbankny.com\/news-events\/news\/news-details\/2023\/Metropolitan-Bank-Holding-Corp.-to-Exit-Crypto-Asset-Related-Vertical\/default.aspx\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">statement<\/span><\/a>. The firm has four active institutional crypto-related clients, accounting for 1.5% of total revenues and 6% of total deposits.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Crypto-related clients, assets and deposits have never represented a material portion of the company’s business and have never exposed the company to material financial risks,” Metropolitan Commercial Bank President and CEO Mark DeFazio said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The bank provides debit card, payment and account services to its clients and does not have any outstanding loans. The crypto vertical is expected to close relationships with clients during 2023. The move away from crypto will not affect customers’ ability to send or receive funds from crypto companies.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Mark DeFazio","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["TRADFI BANKS"],"authors":["Stephanie Murray","The Block"]}