{"summary":"Crypto hardware wallet Trezor has taken control over silicon chip production for its flagship Model T product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214695\/trezor-takes-the-wheel-of-model-t-chip-production","publishDate":"2023-02-27T04:00:33","id":10474,"type":null,"title":"Trezor takes the wheel of Model T chip production","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crypto hardware wallet Trezor has assumed control over silicon chip production for its flagship Model T product by facilitating the manufacture of its key component, the chip wrapper.<\/span>","<span data-v-f87c67ca=\"\">It said the move optimizes the production of its Model T device by eliminating its reliance on third parties throughout the complex manufacturing supply chain, according to a statement Monday. Trezor pioneered the world’s first bitcoin hardware wallet, the Model One.<\/span>","<span data-v-f87c67ca=\"\">The global chip shortage linked to geopolitical disruption and COVID-19 labor shortages exposed Trezor and other electronic manufacturers to unreliable component availability. Demand for its devices has also fluctuated according to market conditions and consumer interest in self-custody of crypto assets in the wake of the implosions of centralized platforms including FTX, Celsius and BlockFi — a period during which Trezor saw a <\/span><a href=\"https:\/\/www.theblock.co\/post\/191744\/ngrave-looks-to-raise-15-million-series-a-at-60-million-pre-money-valuation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">300%<\/span><\/a><span data-v-f87c67ca=\"\"> increase in hardware wallet sales.<\/span>","<span data-v-f87c67ca=\"\">By taking control of the chip production process, Trezor said it improved device security and reduced lead times to several months from two years. In turn, that helped eliminate shipping delays and protected customers from price swings connected with component supply and demand.<\/span>","<span data-v-f87c67ca=\"\">”The twists and turns in demand for hardware wallets and the silicon supply chain disruption that we’ve seen over the past few years was a problem that we needed to solve,” Trezor CFO Stepan Uherik said in the statement.<\/span>","<span data-v-f87c67ca=\"\">“By unpacking the process, identifying areas where we could take control, and collaborating with our partners in new ways, we’ve managed to make the manufacturing as agile as it can be. This means we can respond quickly as the cryptocurrency market shows signs of recovery. It also adds more design freedom for future products, helping us to sustain our leadership in the increasingly competitive hardware wallet space,” he added.<\/span>","<span data-v-f87c67ca=\"\">Last year, Tropic Square, a startup also backed by Satoshi Labs, the company behind Trezor, launched a secure open-source chip that provides cryptographic key generation, encryption, signing and user authentication called TROPIC01. Earlier this month, Trezor’s new CEO, Matej Zak, outlined <\/span><a href=\"https:\/\/www.theblock.co\/post\/208854\/trezor-ceo-matej-zak-plans\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">plans<\/span><\/a><span data-v-f87c67ca=\"\"> to freshen its wallet lineup, including a software suite for mobile and a new flagship device.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.<\/span><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matej Zak","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stepan Uherik","content":"PERSON"},{"type":"Tropic Square","content":"ORGANIZATION"},{"type":"Trezor","content":"PERSON"},{"type":"300%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Satoshi Labs","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"}],"hashtag":["WALLET MAKERS","WALLETS"],"authors":["James Hunt","The Block"]}