{"summary":"A recent academic journal article concluded that carbon dioxide emissions from bitcoin mining could seriously undermine China’s climate change targets, sparking criticism and questions about the paper’s sources.\nThe report is the latest reminder that accurately measuring bitcoin’s carbon footprint is extremely challenging if not impossible.","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102621\/bitcoin-carbon-footprint-academic-paper","publishDate":"2021-04-22T16:19:38","id":1047,"type":null,"title":"Is it even possible to accurately measure bitcoin&#x27;s carbon footprint?","category":["Bitcoin"],"content":["<span data-v-f87c67ca=\"\">Earlier this month, a peer-reviewed academic journal article drew the conclusion that without a policy intervention, carbon dioxide emissions from bitcoin mining could seriously undermine China’s climate change targets.<\/span>","<span data-v-f87c67ca=\"\">The report, co-authored by researchers from various Chinese universities and <\/span><a href=\"https:\/\/www.nature.com\/articles\/s41467-021-22256-3.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published in Nature Communications<\/span><\/a><span data-v-f87c67ca=\"\">, instantly inspired similar-sounding headlines on a wide range of mainstream media including the <\/span><a href=\"https:\/\/www.bbc.com\/news\/business-56671488\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BBC<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/edition.cnn.com\/2021\/04\/09\/business\/bitcoin-mining-emissions\/index.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CNN<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/www.theguardian.com\/technology\/2021\/apr\/07\/china-bitcoin-mining-climate-targets-nature-study#:~:text=China%20banned%20trading%20in%20cryptocurrencies,laundering%2C%20but%20mining%20is%20permitted.&amp;text=Nasdaq%2Dlisted%20Bitmain%2C%20which%20operates,more%20hydropower%20such%20as%20Yunnan.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Guardian<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/www.economist.com\/finance-and-economics\/2021\/04\/10\/totting-up-bitcoins-environmental-costs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Economist<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/www.cnbc.com\/2021\/04\/08\/chinas-bitcoin-mining-is-threatening-its-climate-change-targets.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">CNBC<\/span><\/a><span data-v-f87c67ca=\"\"> and others.<\/span>","<span data-v-f87c67ca=\"\">The authors wrote that the annual energy consumption of bitcoin mining in China is expected to peak in 2024 at 296.59 terawatt-hours (tWh) and generate 130.50 million metric tons of carbon dioxide emissions. <\/span><span data-v-f87c67ca=\"\">That would exceed the total annual greenhouse gas emission output of the Czech Republic and Qatar, and would pose a threat to China’s long-term ambition to become carbon neutral.<\/span>","<span data-v-f87c67ca=\"\">Crucially, however, the researchers left two fundamental questions unanswered, according to the paper's critics: where exactly are the mining machines located, and what is the energy mix there?<\/span>","<span data-v-f87c67ca=\"\">“I expected most of the paper to be about province-level data covering the energy mix of Chinese miners,” Nic Carter, partner at Castle Island Ventures and co-founder of Coin Metrics, <\/span><a href=\"https:\/\/twitter.com\/nic__carter\/status\/1379779100022345729\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter. “But that's missing. Instead, they claim to have taken this into account... but don't show their work (!) They just assert they've quantified this.”<\/span>","<span data-v-f87c67ca=\"\">In the article, the researchers said they accounted for the carbon dioxide emissions of both hydropower and fossil fuel-based bitcoin mining in China. “As suggested by the actual regional statistics of Bitcoin miners, we assume 40% of miners are located in the coal-based area,” they wrote. <\/span><span data-v-f87c67ca=\"\">But they didn’t elaborate on the origin of those \"regional statistics.\"<\/span>","<span data-v-f87c67ca=\"\">After The Block reached out to the co-authors for clarification on this question, <\/span><span data-v-f87c67ca=\"\">Shouyang Wang, the Chair Professor from the Academy of Mathematics and Systems Science of the Chinese Academy of Sciences, responded:<\/span>","<span data-v-f87c67ca=\"\">In a follow-up message, Wang elaborated on what the authors meant by “broadcast location of each mining pool”:<\/span>","<span data-v-f87c67ca=\"\">From Wang’s statement, it appears that the researchers based this assumption on another: that the location of mining pools corresponds directly to the location of the individual miners. But that would be a misunderstanding of how bitcoin miners and pools function work in practice.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin mining pools aggregate hashing power from any individual miners who want to connect to their service to mine blocks collectively. Although F2Pool is based in Beijing, that doesn’t mean at all the miners connected to the pool are located there, too. In fact, they can come from anywhere in China or anywhere in the world.<\/span>","<span data-v-f87c67ca=\"\">Wang also confirmed that they did not obtain internal statistics from any major mining pool about the exact geolocation of each of their miner customers. Instead, they used the data from Cambridge University, “which showed that 40% of the hash rate are contributed by coal-heavy regions such as Xinjiang and Inner Mongolia as of April 2020,” according to Wang.<\/span>","<span data-v-f87c67ca=\"\">But Cambridge University’s data is outdated by a year, and the makeup of the mining network is constantly changing. For instance, China’s share of the Bitcoin network's total mining capacity <a href=\"https:\/\/www.theblockcrypto.com\/post\/102603\/bitcoin-hash-rate-xinjiang-miner-power\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">has declined significantly<\/a> over the past 12 months.<\/span>","<span data-v-f87c67ca=\"\">Assumptions aside, the debate over the report's methodology does raise a question that is getting difficult to ignore as bitcoin and other cryptocurrencies make their way into the mainstream: how can the energy mix of the bitcoin network be accurately measured?<\/span>","<span data-v-f87c67ca=\"\">The reality is that the decentralized nature of bitcoin and bitcoin mining makes it incredibly difficult to quantify how much of the energy the network uses is sourced from renewables or not — let alone estimate the associated carbon dioxide emissions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Cambridge Center for Alternative Finance made one of the most recent attempts to answer the question with its Cambridge Bitcoin Electricity Consumption Index (CBECI).<\/span>","<span data-v-f87c67ca=\"\">The CBECI estimates bitcoin’s total energy consumption with a theoretical lower and upper bound between 35 and 391 terawatt-hours annually. The lower bound assumes that all miners are using the most energy-efficient hardware available all the time, and the upper bound assumes that all miners are using the least efficient hardware all the time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The researchers behind the CBECI then give a “best guess estimate” — based on the assumption that miners use “a basket of profitable hardware rather than a single model” — that the network consumes 113.88 terawatt-hours annually. That’s around the same amount <\/span><a href=\"https:\/\/www.eia.gov\/international\/data\/world\/electricity\/electricity-consumption?pd=2&amp;p=0000002&amp;u=0&amp;f=A&amp;v=mapbubble&amp;a=-&amp;i=none&amp;vo=value&amp;t=C&amp;g=00000000000000000000000000000000000000000000000001&amp;l=249-ruvvvvvfvtvnvv1vrvvvvfvvvvvvfvvvou20evvvvvvvvvvnvvvs0008&amp;s=315532800000&amp;e=1546300800000&amp;\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">that The Netherlands consumes<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The CBECI also provides a geographic breakdown of bitcoin’s hash rate based on data supplied by three bitcoin mining pools: BTC.com, Viabtc and Poolin. <\/span><span data-v-f87c67ca=\"\">The report’s <\/span><a href=\"https:\/\/cbeci.org\/mining_map\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">mining map<\/span><\/a><span data-v-f87c67ca=\"\"> as of April 2020 showed that miners in China’s Xinjiang and Inner Mongolia — two regions that are fossil fuel-based —&nbsp;accounted for roughly 40% of the global hash rate.&nbsp;<\/span><span data-v-f87c67ca=\"\">Meanwhile, hydropower provinces like Sichuan and Yunnan accounted for roughly 25% as of a year ago, according to CBECI.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But these numbers haven't been updated since April 2020, and the data came from contributed by only three mining pools that combined to account for only 35% of bitcoin’s total hash rate. Further, the CBECI’s mining map only captured the hash rate’s geographic breakdown from September 2019 to April 2020, a period that’s known as the dry season in China.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As the CBECI notes in a disclaimer: “In some countries, and China in particular, mining operations tend to move between locations according to seasonal variance in renewables production. These migration patterns can only be observed when selecting a longer timeframe for the analysis.”<\/span>","<span data-v-f87c67ca=\"\">During the dry season, a significant number of miners in China’s southwestern provinces of Sichuan and Yunnan migrate north to Xinjiang or Inner Mongolia, where the energy mix tends to be coal-based. Upon the return of the rainy season, which spans from May to September, some may return to the south, where there is a lot more hydropower in the mix.<\/span>","<span data-v-f87c67ca=\"\">More accurate accounting would require year-long cooperation from enough major bitcoin mining pools to comprise a large majority of the hash rate. And it would need not only the IP geolocation of each mining machine — whether it’s in Sichuan, Yunnan, Xinjiang or Inner Mongolia — but the exact model of each mining machine.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That’s because bitcoin mining machines have evolved significantly over the past years, and several old models are still in use. For instance, to compute the same amount of hash rate, Bitmain’s five-year-old AntMiner S9 consumes four times the amount of electricity used by the most efficient model on the market today, the AntMiner S19 Pro.<\/span>","<span data-v-f87c67ca=\"\">It’s next to impossible to know the exact composition of the machines in use, particularly during a bull market, when a large number of old models can still be used to turn a profit.<\/span>","<span data-v-f87c67ca=\"\">Another theoretical approach — albeit an even longer shot — would be to convince energy authorities in different countries to identify how many bitcoin mining farms there are locally and how much energy they consume.<\/span>"],"hashtag":[]}