{"summary":"Transaction finality was briefly disrupted on the Ethereum network, according to developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230532\/ethereums-beacon-chain-suffers-brief-finality-issue-cause-still-unknown","publishDate":"2023-05-11T18:20:37","id":10480,"type":null,"title":"Ethereum&#x27;s beacon chain suffers brief finality issue, cause still unknown","category":["THE BLOCK"],"content":["The Ethereum network appears to have suffered a technical issue that, for a temporary period, meant that transaction finality wasn't occurring.","The cause of the issue isn't clear as of press time and Ethereum developers say the situation is being investigated. For now, network data and statements from developers indicate that transaction finality -- referring to the state in which transactions can't be changed -- has returned.","\"Finality has been restored,\" tweeted Prysmatic Labs co-founder Preston van Loon. \"We do not know the root cause yet, but something happened to cause several client implementations to work really hard to keep up with the chain.\"","Data sources for Ethereum network activity show that the issue was experienced by validators. Validators propose attestations as the network processes transactions.","Data provider <a href=\"https:\/\/beaconcha.in\/epochs\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Beaconcha.in<\/a> shows that Ethereum epochs 200,552 thru 200,554 saw a steep drop in the number of attestations received. The first problematic epoch was at 4:13 p.m. ET. The issue was resolved within a half hour, network data shows.","EthereumPools.info <a href=\"https:\/\/twitter.com\/EthereumPools\/status\/1656768563913404424\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweeted<\/a> that \"[f]or a couple of epochs almost every pool\/operator that we monitor went offline.\"","In the wake of the incident, community members pointed to client diversity -- meaning a variety of software clients available for use by validators -- as a reason for why the issue wasn't more widespread or long-lasting.","<em data-v-f87c67ca=\"\">This story is developing.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4:13 p.m. ET","content":"TIME"},{"type":"Preston van Loon","content":"PERSON"},{"type":"2023","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}