{"summary":"HashKey Group today launched a new global exchange called HashKey Global targeting retail users outside Hong Kong, the company announced on X.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286859\/hashkey-launches-global-crypto-exchange-after-bermuda-license","publishDate":"2024-04-08T01:23:02","id":10485,"type":null,"title":"HashKey launches global crypto exchange after Bermuda license","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">HashKey Group, an Asia-based digital asset financial services firm, today launched a global cryptocurrency exchange named HashKey Global after obtaining a relevant license in Bermuda, as part of the company’s international expansion.<\/span>","<span data-v-f87c67ca=\"\">HashKey, which operates a licensed crypto exchange in Hong Kong, said in an X <\/span><a href=\"https:\/\/twitter.com\/HashKey_Global\/status\/1777184536889278506\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on Monday that it will “offer compliant trading services to cryptocurrency enthusiasts across the globe.”<\/span>","The company said in a statement shared with The Block that the <span data-v-f87c67ca=\"\">new global exchange will offer trading pairs for 21 cryptocurrencies for qualified retail investors and plans to roll out futures-related products \"shortly.\"<\/span>","The launch of the new platform comes after HashKey recently obtained a license in Bermuda, allowing it to offer digital asset trading services such as launchpad, futures trading and leveraged trading, according to its statement.&nbsp;","\"HashKey Group aims to establish one of the world's largest clusters of licensed exchanges within the next 5 years, surpassing all current regulated exchanges,\" said Livio Weng, chief operating officer of HashKey Group. \"The Bermuda license marks another license obtained by HashKey Group following those in Japan, Hong Kong, and Singapore, issued by regulatory authorities in yet another jurisdiction, demonstrating global recognition of our past efforts.\"","HashKey Group said in the statement that <span data-v-f87c67ca=\"\">its Hong Kong trading platform is required to comply with stringent know-your-customer requirements to continue focusing on serving local and nearby markets and institutional clients. <\/span>","<span data-v-f87c67ca=\"\">HashKey's new platform, on the other hand, is geared towards global retail customers except for users from the Chinese mainland, Hong Kong, the U.S. and other jurisdictions that do not allow crypto trading.<\/span>","<span data-v-f87c67ca=\"\">In January, HashKey announced that it <\/span><a href=\"https:\/\/www.theblock.co\/post\/272745\/hong-kongs-hashkey-secures-100-million-in-series-a-round-at-1-2-billion-valuation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised nearly $100 million<\/span><\/a><span data-v-f87c67ca=\"\"> in its Series A financing round at a pre-money valuation above $1.2 billion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Weng said in an <\/span><a href=\"https:\/\/www1.hkej.com\/dailynews\/finnews\/article\/3730630\/%E4%BB%8A%E5%B9%B4%E5%86%8D%E5%81%9A%E6%96%B0%E8%9E%8D%E8%B3%87+%E9%87%91%E9%A1%8D%E6%88%96%E8%B6%85%E4%B8%8A%E8%BC%AA\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">interview<\/span><\/a><span data-v-f87c67ca=\"\"> with Hong Kong Economic Journal that the company plans to carry out another funding round later this year, and that it is currently in talks with potential investors. He added that the firm is pouring substantial resources into global expansion this year in the hope of starting to turn profitable next year.<\/span>","<span data-v-f87c67ca=\"\">Last year, HashKey Exchange became one of the first crypto exchanges to <\/span><a href=\"https:\/\/www.theblock.co\/post\/242897\/hashkey-obtains-first-license-in-hong-kong-to-offer-crypto-retail-trading\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">obtain a license<\/span><\/a><span data-v-f87c67ca=\"\"> under Hong Kong’s new licensing regime, which permits crypto trading platforms to offer retail services.<\/span>","<span data-v-f87c67ca=\"\">In February, HashKey OTC, the over-the-counter trading arm of HashKey Group, said it had <\/span><a href=\"https:\/\/www.theblock.co\/post\/279582\/hashkey-otc-receives-in-principle-approval-for-major-payment-institution-license-in-singapore\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">received in-principle approval<\/span><\/a><span data-v-f87c67ca=\"\"> from the Monetary Authority of Singapore for a major payment institution license. The preliminary license approval paves the way for HashKey OTC to provide regulated digital payment token services in Singapore.&nbsp; <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"HashKey OTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"HashKey Global","content":"ORGANIZATION"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Livio Weng","content":"PERSON"},{"type":"HashKey","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Hong Kong Economic Journal","content":"ORGANIZATION"},{"type":"HashKey Group","content":"ORGANIZATION"}],"hashtag":["HASHKEY"],"authors":["Timmy Shen","The Block"]}