{"summary":"Osborne joins other political figures such as former U.S. Secretary of Defense Dr. Mark T. Esper and former U.S. Senator Patrick Toomey.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275324\/coinbase-george-osborne","publishDate":"2024-01-31T07:50:47","id":1048,"type":null,"title":"Coinbase brings in former UK Chancellor George Osborne as an advisor","category":["PEOPLE"],"content":["Former UK Chancellor of the Exchequer George Osborne has joined Coinbase as an advisor.","The ex-Finance Minister brings decades of experience in government and international finance, serving as Chancellor from 2010 to 2016. Osborne is currently a partner at Robey Warshaw LLP, a boutique investment bank, and had a brief stint as the editor-in-chief of London’s Evening Standard newspaper after leaving government. He was also an adviser to the BlackRock Investment Institute from 2017 to 2021.","Osborne joins other political figures — such as former U.S. Secretary of Defense Dr. Mark T. Esper, former U.S. Senator Patrick Toomey, former U.S. representative Stephanie Murphy and former U.S. Congressman Sean Patrick Maloney — on Coinbase’s Global Advisory Council.","“We are pleased to have George join our council at an exciting time for us in the UK and globally,” Coinbase Chief Policy Officer Faryar Shirzad said in a statement. “George brings with him a wealth of experience in business, journalism and government. We look forward to relying on his insights and experiences as we grow Coinbase around the world.”","Coinbase’s Advisory Council was set up to inform its global growth strategy amid a time of regulatory scrutiny. The crypto exchange recently secured licenses in France, Spain, Singapore, and Bermuda and has expanded access to its products to over 20 African nations. However, the California-based company has faced regulatory challenges at home, with the U.S. Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">suing<\/a> Coinbase last year, alleging it had violated securities laws.","In the UK, Prime Minister Rishi Sunak <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">said<\/a> in June he was keen on providing regulatory clarity regarding how crypto firms should register and operate in the country — as part of his ambitions for the UK to become a global hub for web3. However, several crypto firms have decided to suspend services or exit the UK market in recent months amid <a href=\"https:\/\/www.theblock.co\/post\/273763\/fca-crypto-rules-sunak-uk-web3-hub\" data-v-f87c67ca=\"\">strict<\/a> new marketing rules from the country’s financial regulator.","Coinbase <a href=\"https:\/\/www.coinbase.com\/pt\/blog\/an-update-to-coinbases-global-scale-to-go-broad-and-deep\" data-v-f87c67ca=\"\">said<\/a> last year that the UK is one of its fastest-growing markets, with its research showing that 22% of adults in the country own cryptocurrency. Coinbase CEO Brian Armstrong previously spoke alongside Osborne at UK Fintech Week in 2023 about the leadership the UK was showing in creating a welcoming regulatory environment.","“There’s a huge amount of exciting innovation in finance right now,” Osborne said. “Blockchains are transforming financial markets and online transactions. Coinbase is at the frontier of these developments. I look forward to working with the team there as they build a new future in financial services.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"UK Fintech Week","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"George","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Robey Warshaw LLP","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Spain","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"Sean Patrick Maloney","content":"PERSON"},{"type":"Faryar Shirzad","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Stephanie Murphy","content":"PERSON"},{"type":"George Osborne","content":"PERSON"},{"type":"’s Evening Standard","content":"ORGANIZATION"},{"type":"Mark T. Esper","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"Advisory Council","content":"ORGANIZATION"},{"type":"BlackRock Investment Institute","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"Osborne","content":"PERSON"},{"type":"Coinbase’s Global Advisory Council","content":"ORGANIZATION"},{"type":"Patrick Toomey","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["James Hunt","The Block"]}