{"summary":"Cross-chain protocol LayerZero has confirmed that it will launch a token and is targeting the first half of 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266698\/layerzero-says-its-targeting-token-launch-for-first-half-of-2024","publishDate":"2023-12-08T05:05:11","id":10496,"type":null,"title":"LayerZero says it&#x27;s targeting token launch for first half of 2024","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain interoperability protocol LayerZero has clarified it will launch a token after months of ardent speculation.","\"LayerZero has always been built with the ability to have a native token within the protocol, as can be seen in the immutable code launched on day 1. We’ve heard the community discussion over the last few months and the lack of clear communication around this,\" the project <a href=\"https:\/\/twitter.com\/LayerZero_Labs\/status\/1732862812710449466?s=20\" data-v-f87c67ca=\"\">posted on X<\/a>.","\"We’ll state now in no uncertain terms that there will be a LayerZero token. Its distribution is something we’re committed to getting right and expect it to happen within the first half of 2024,\" it added.","This implies that the token will be handed out in the form of an airdrop, a common method of reward early users with tokens. Tokens of previous projects often carry governance rights over the future development of the token and the idea is that the protocol's users will be the best ones to decide how it should develop going forward.","That said, the terms of the airdrop may not yet have been decided and it's possible that the snapshot — the final point at which transactions count for eligibility of the airdrop — has already been taken.","LayerZero allows users to move data and assets across blockchains. In April 2023, its development firm <a href=\"https:\/\/www.theblock.co\/post\/224762\/layerzero-series-b\" data-v-f87c67ca=\"\">raised<\/a> $120 million in a Series B funding round at a valuation of $3 billion.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$120 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"first half of 2024","content":"DATE"}],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY"],"authors":["Tim Copeland","The Block"]}