{"summary":"A fintech company owned by MassMutual is launching a service that lets registered investment advisors (RIAs) and their clients tap into bitcoin investments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119140\/massmutual-owned-fintech-flourish-launches-a-new-service-to-connect-financial-advisory-clients-with-bitcoin","publishDate":"2021-09-30T09:00:22","id":1049,"type":null,"title":"MassMutual-owned fintech Flourish launches a new service to connect financial advisory clients with bitcoin","category":["BITCOIN"],"content":["A fintech company owned by MassMutual is launching a service that lets registered investment advisors (RIAs) and their clients tap into bitcoin investments.","Flourish’s new service, dubbed Flourish Crypto, reflects the growing intersection between traditional finance and the digital asset space, and it’s a bet on what the company says is growing demand among financial advisory clients for bitcoin.","The offering is being launched in partnership with Paxos, which is supporting the execution and custody side of things. The New York-based startup has inked key relationships with payments and financial services firms in recent months, including last year’s landmark deal with PayPal and, more recently, a deal with Interactive Brokers. Paxos announced a <a href=\"https:\/\/www.theblockcrypto.com\/post\/103142\/paxos-raises-300-million-as-it-looks-to-onboard-more-paypal-sized-clients\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$300 million<\/a> funding round this past spring.","Ben Cruikshank, head of Flourish, said that the new service grew out of conversations with its customer base of financial advisors. “We’ve heard from countless advisors that they are fielding questions about crypto on a daily basis — and that they don’t have the right solutions to meet this growing client demand or to compete with offerings from retail trading platforms and wirehouses,” he said.","Cruikshank also told The Block that the company’s work on crypto was enhanced personal interest among the firm’s workforce that stretches back years — an interest that dovetailed with MassMutual following the insurance giant’s <a href=\"https:\/\/www.massmutual.com\/about-us\/news-and-press-releases\/press-releases\/2021\/02\/massmutual-closes-acquisition-of-fintech-platform-flourish\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">acquisition<\/a> of Flourish in February.","Flourish operates independently from MassMutual, but the insurance giant made waves in December when it bought <a href=\"https:\/\/www.theblockcrypto.com\/linked\/87378\/massmutual-bitcoin-insurance-purchase\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$100 million<\/a> in bitcoin through NYDIG. At the time, MassMutual also became an equity investor in NYDIG.","In conjunction with today’s announcement, MassMutual chief investment officer Tim Corbett penned a blog post outlining the insurance company’s views on digital assets and bitcoin in particular.","“We have come to view bitcoin as a potential store of value over the long-term,” Corbett wrote, referring to last year’s $100 million investment. “Bitcoin’s unique characteristics — including digital scarcity, known supply growth, transfer characteristics, and hard cap on the total number of tokens — open the possibility that it may serve as a kind of “digital gold,” with the potential for significant price appreciation.”","“At the same time, the asset class is new and still undergoing price discovery, with significant volatility, uncertainty, and risk,” Corbett continued. “We believe that the volatility will decrease as more institutions take positions in the space, but it will take multiple market cycles before we have robust data to further describe the characteristics of the investment, such as correlations to other asset classes or whether it will serve as an inflation hedge.”","Corbett added: “In our position as a leading mutual life insurance company, we have the ability to take that long view.”","That Flourish is moving to capture a piece of the demand for bitcoin among clients of financial advisors is perhaps unsurprising, given that recent years have seen other financial services firms, including those focused on retirement accounts, making similar forays. Choice by Kingdom Trust, for example, explained recently to The Block’s Ryan Weeks how the company aims to help clients buy bitcoin within their retirement accounts.","Flourish’s approach is to offer a one-stop spot for advisors to help their clients access bitcoin. Though bitcoin has been considered a commodity by U.S. regulators since 2015, tax reporting hurdles and a lack of familiarity among some advisors -- and those fielding calls from prospective clients specifically -- opens the door for firms like Flourish to make those processes simpler.","“We listened to our clients and built Flourish Crypto with the flexibility advisors need around integrations, trading, branding, and compliance,” Cruikshank siad. “Advisors can now keep these assets within their orbit and offer a crypto solution as part of each client’s holistic financial plan.”","Cruikshank added that the firm is watching the broader crypto space closely. He said that Flourish intends to offer support for ether, the native cryptocurrency of Ethereum, in the months ahead, based on the same signs of demand that led to its support for bitcoin.","Corbett’s blog post also suggested that MassMutual is eyeing the proverbial pond for possible services around cryptocurrency and blockchain tech more broadly.","“We believe there will be numerous success stories as the technology matures, and we will continue to explore ways of integrating cryptocurrency into different areas of our business,” he wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Interactive Brokers","content":"ORGANIZATION"},{"type":"Tim Corbett","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"MassMutual","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Cruikshank","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Kingdom Trust","content":"ORGANIZATION"},{"type":"Ben Cruikshank","content":"PERSON"},{"type":"NYDIG","content":"ORGANIZATION"},{"type":"Corbett","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"$300 million","content":"MONEY"},{"type":"spring","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Michael McSweeney","The Block"]}