{"summary":"Head Chef of Sushiswap Jared Grey proposed changing the exchanges tokenomics, with the goal of incentivizing liquidity and redirecting value to token holders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198569\/sushiswap-tries-to-breathe-life-back-into-protocol-with-new-tokenomics-proposal","publishDate":"2022-12-30T15:48:29","id":10491,"type":null,"title":"Sushiswap tries to breathe life back into protocol with new tokenomics proposal","category":["GOVERNANCE"],"content":["Jared Grey, the \"Head Chef\" of decentralized exchange Sushiswap, proposed changing the exchange's tokenomics in the hopes of reviving the protocol after a <a href=\"https:\/\/defillama.com\/protocol\/sushiswap\" data-v-f87c67ca=\"\">tough year.<\/a>","The proposed changes seek to increase liquidity, create more utility for its native token sushi and promote <a href=\"https:\/\/forum.sushi.com\/t\/sushi-tokenomics-redesign\/11621?u=jaredgrey\" data-v-f87c67ca=\"\">maximum value for stakeholders<\/a> – all without diluting current token holders or sacrificing the <a href=\"https:\/\/drive.google.com\/file\/d\/1gpxJ2zPRCZ1Ik7I7HfrwVhiglz89Xhd7\/view\" data-v-f87c67ca=\"\">protocol’s economic health.<\/a> Sushiswap currently has just 1.5 years of runway, <a href=\"https:\/\/www.theblock.co\/post\/179690\/sushiswaps-new-head-chef-describes-himself-as-a-wartime-ceo\" data-v-f87c67ca=\"\">Grey said.<\/a>","“Like the original xSushi model hoped to achieve, the new model’s primary goals are to foster decentralized ownership and reward liquidity growth via a holistic and sustainable reward mechanism that scales with volume and fees,” <a href=\"https:\/\/drive.google.com\/file\/d\/1gpxJ2zPRCZ1Ik7I7HfrwVhiglz89Xhd7\/view\" data-v-f87c67ca=\"\">a formal proposal said<\/a>.","The proposal outlines four key changes to the protocol's tokenomics.","One of the biggest proposed changes is that staked sushi (xSushi) would no longer receive trading fee revenue rewards and instead receive emission-based rewards paid out in sushi. Liquidity providers of trading pools that produce the most volume will receive the majority of swap fees, in addition to boosted rewards based on a new time-lock implementation they could opt into. A variable percentage of trading fees would also be used to buy-back and burn sushi from the open market and to lock liquidity for added price support.","A final change would switch the emissions to 1-3% APY for the sushi token in an effort to reduce inflation and balance the overall emissions with the buy-backs, burns, and <a href=\"https:\/\/forum.sushi.com\/t\/sushi-tokenomics-redesign\/11621?u=jaredgrey\" data-v-f87c67ca=\"\">locked liquidity<\/a> used for price support from trading fees.","“We aim to incentivize long-term participation in the Sushi ecosystem while reducing the number of extractive participants,” the proposal said.","Its current model promotes non-sticky liquidity, where users can stake sushi, receive rewards and get an optimal ROI, even though they’re not LPs. From historical data, Sushi found that its current xSushi model allows xSushi stakers to receive a disproportionate rate of rewards compared to liquidity providers.","Some of the main concerns Grey said are <a href=\"https:\/\/twitter.com\/jaredgrey\/status\/1608886166111285255?s=20&amp;t=pYu6gBFWMUV8SvzDbgKt7w\" data-v-f87c67ca=\"\">“good points” in a discussion on Twitter<\/a> are that the emissions are greater than the <a href=\"https:\/\/twitter.com\/curvethots\/status\/1608884902363287553?s=20&amp;t=pYu6gBFWMUV8SvzDbgKt7w\" data-v-f87c67ca=\"\">fee revenue and burns<\/a>. Another concern is that large positioned LPs could max timelock and receive majority of the rewards.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"3%","content":"PERCENT"},{"type":"Grey","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Jared Grey","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}