{"summary":"DeFi protocol Conic Finance suffered an exploit by a hacker who managed to make off with 1700 ether.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240917\/conic-finance-security-attack","publishDate":"2023-07-21T08:17:23","id":10509,"type":null,"title":"Conic Finance drained of $3.2 million in security attack","category":["SECURITY"],"content":["DeFi protocol Conic Finance suffered an exploit today by a hacker who managed to make off with 1700 ether (over $3.2 million), according to security analysts at BlockSec. Conic is a DeFi protocol designed to allocate funds across the Curve decentralized exchange using the liquidity pools it operates.","The unidentified attacker exploited a reentrancy vulnerability, which subsequently allowed the manipulation of a faulty price oracle that Conic relied on. This enabled them to drain funds, said Matthew Jiang, the director of security services at BlockSec, in an interview with The Block.","Such an attack <a href=\"https:\/\/www.theblock.co\/post\/234102\/lending-protocol-sturdy-finance-drained-of-800000-in-security-attack\" data-v-f87c67ca=\"\">leverages<\/a> the ability to repeatedly call a function within a single transaction before the initial function call completes. This mechanism lets the attacker withdraw more funds than they’re entitled to.","In the incident around 6:35 am ET today, the hacker executed a flash loan, <a href=\"https:\/\/etherscan.io\/tx\/0x8b74995d1d61d3d7547575649136b8765acb22882960f0636941c44ec7bbe146\" data-v-f87c67ca=\"\">borrowing<\/a> 20,000 staked ether, as evidenced by on-chain data. These funds were routed to Conic so its price oracle, which is sourced from a third-party “read-only” smart contract, could be tampered with — facilitating the reentrancy attack — BlockSec explained. “The flash-loaned stETH was utilized to amplify the profit,” Jiang said.","Keeping its community informed, Conic <a href=\"https:\/\/twitter.com\/ConicFinance\/status\/1682346727578255360\" data-v-f87c67ca=\"\">announced<\/a> in a Twitter post that the team was “investigating an exploit involving the ETH Omnipool” and promised to share further updates.","After what appears to be a second attack, Curve Finance <a href=\"https:\/\/twitter.com\/CurveFinance\/status\/1682469750364950528\" data-v-f87c67ca=\"\">urged users<\/a> to remove all funds from Conic Finance Friday afternoon. Conic later shut down all deposits across omnipools.&nbsp;","\"Users are still able to withdraw,\" Conic Finance wrote on <a href=\"https:\/\/twitter.com\/ConicFinance\/status\/1682482876632244224\" data-v-f87c67ca=\"\">Twitter<\/a>. \"We are assessing the situation and will provide updates as soon as we have them.\"","(<em data-v-f87c67ca=\"\">Updates with tweet from Curve Finance, additional comment from Conic.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Conic Finance","content":"ORGANIZATION"},{"type":"Conic","content":"ORGANIZATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"\" Conic Finance","content":"ORGANIZATION"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jiang","content":"PERSON"},{"type":"Matthew Jiang","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"$3.2 million","content":"MONEY"},{"type":"afternoon","content":"TIME"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}