{"summary":"Ripple has raised a whopping $200 million in Series C funding\nThe round was led by investment firm Tetragon, with participation from Japan’s SBI Holdings and Route 66 Ventures","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51237\/ripple-raises-200m-series-c-to-boost-xrp-adoption","publishDate":"2019-12-20T07:15:13","id":1050,"type":null,"title":"Ripple raises $200M Series C to boost XRP adoption","category":["Investments"],"content":["Blockchain payments firm Ripple has raised a whopping $200 million in Series C funding.","The round was led by investment firm Tetragon, with participation from Japan’s SBI Holdings and Route 66 Ventures.","With the fresh capital in place, Ripple looks to boost the adoption of cryptocurrency XRP and its native blockchain network, the XRP Ledger. <span data-v-f87c67ca=\"\">Ripple also plans to hire new talent with the investment to expand globally.<\/span>","“We are in a strong financial position to execute against our vision. As others in the blockchain space have slowed their growth or even shut down, we have accelerated our momentum and industry leadership throughout 2019,” said Brad Garlinghouse, CEO of Ripple.","The Series C round <a href=\"https:\/\/fortune.com\/2019\/12\/20\/ripple-raises-200-million-xrp-cryptocurrency\/\" data-v-f87c67ca=\"\">reportedly<\/a> values the San Francisco-based company at $10 billion. According to a recent list of global unicorns for 2019, published by research firm Hurun, Ripple <a href=\"https:\/\/www.theblockcrypto.com\/post\/44277\/there-are-now-11-blockchain-unicorns-in-the-world-with-over-1b-valuation-including-binance-ripple-and-coinbase\" data-v-f87c67ca=\"\">was valued<\/a> at $5 billion.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nGarlinghouse told Fortune on Friday that Ripple did not need the money, though the funds will provide \"balance sheet flexibility.\"&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIndeed, Ripple has already sold $260 million worth of XRP over the last four quarters, according to The Block's research.","","Out of those 300 RippleNet customers, “more than two dozen” <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46219\/ripple-says-more-than-two-dozen-customers-use-its-payments-solution-that-leverages-xrp\" data-v-f87c67ca=\"\">use<\/a> the firm's On-Demand Liquidity (ODL) solution that leverages XRP, Ripple announced last month.&nbsp;Some of these customers include money transfer firms MoneyGram, Viamericas and FlashFX, and financial services provider Interbank Peru, among others.","ODL currently supports Mexico, the Philippines and Australian markets. Ripple said at the time that the support for Brazil is “coming soon,” as well as additional corridors across Asia-Pacific (APAC), Europe, Middle-East and Africa (EMEA) and Latin America (LatAm) are in progress for 2020.","\"In 2019 we’ve seen continued momentum with customers, growth of RippleNet and adoption of On-Demand Liquidity,” Garlinghouse said at the time.&nbsp;"],"hashtag":["SERIES C &AMP; BEYOND","XRP"]}