{"summary":"Payments company Square made waves on Thursday after its surprise reveal of a $50 million bitcoin purchase. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/80196\/square-bitcoin-purchase-details-paper","publishDate":"2020-10-08T11:59:56","id":10517,"type":null,"title":"Square details how it bought $50 million in bitcoin on the over-the-counter market","category":["THE BLOCK"],"content":["Payments company Square made waves on Thursday after its surprise reveal of a $50 million bitcoin purchase.&nbsp;","The details were included in a white paper <a href=\"https:\/\/images.ctfassets.net\/2d5q1td6cyxq\/5sXNrlEh2mEnTvvhgtYOm2\/737bcfdc15e2a1c3cbd9b9451710ce54\/Square_Inc._Bitcoin_Investment_Whitepaper.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">published<\/a> alongside the news, which provided details on Square's investment thesis, how it approached the buying process and the method by which it's actually keeping those bitcoins safe.","It's a notable disclosure from a company that has made no secret about its bitcoin ambitions. Indeed, as The Block previously reported, Square made $17 million in gross profits on its bitcoin sales during the second quarter of 2020. The company's third-quarter earnings are set to be released on November 5.","In the white paper, Square wrote that \"we believe now is the right time for us to expand our largely USD-denominated balance sheet and make a meaningful investment in bitcoin.\"","\"We view bitcoin as an instrument of global economic empowerment; it is a way for individuals around the world to participate in a global monetary system and secure their own financial future. This investment is an important step in furthering our mission,\" the firm said.","To that end, Square bought approximately 4,709 BTC. It was purchased over-the counter from \"a bitcoin liquidity provider that we currently use as part of Cash App’s bitcoin trading product\"&nbsp;— an approach the company <a href=\"https:\/\/s21.q4cdn.com\/114365585\/files\/doc_financials\/2018\/2018-Q2-10-Q-%E2%80%94-Square.pdf.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">first disclosed<\/a> in August 2018.","Here's how Square explained the process in detail:","\"We negotiated a spread on top of a public bitcoin index and executed trades using a Time-Weighted Average Price (TWAP) over a predetermined 24-hour period with low expected price volatility and high market liquidity, in order to reduce risks associated with cost and pricing. Criteria that we evaluated when selecting our liquidity providers included pricing, annual trade desk volume, and integrations with our existing trading and settlement rails.\"","Square did not disclose the identity of the broker, but it did highlight a list of brokers it said had \"utilized in the past.\" The list includes notables like Cumberland, itBit, Genesis and Circle, among others.&nbsp;","<strong data-v-f87c67ca=\"\">'Subzero' custody solution<\/strong>","Square <a href=\"https:\/\/developer.squareup.com\/blog\/open-sourcing-subzero\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">first unveiled<\/a> its open-source bitcoin custody infrastructure, dubbed Subzero, in the fall of 2018.&nbsp;","Subzero, as explained on Square's GitHub page, is centered around the use of Hardware Security Modules (HSMs). These are physical devices used to store private keys in a tamper-resistant fashion. When someone wants to sign a transaction with the private key contained inside the HSM, they connect it to the computer they're seeking to access — essentially, it's a kind of hand-held passcode for holding bitcoin keys.","Square's <a href=\"https:\/\/github.com\/square\/subzero\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">GitHub<\/a> explains some of the specifics behind Subzero, including how, in order to move funds out of cold storage — that is, offline storage — it requires a signing ceremony involving several different parties.&nbsp;","\"In addition, the offline HSMs are able to enforce business logic rules, for instance we only allow sending funds to Square-owned addresses. Such a scheme is usually called defense in depth or an onion model. We maintain the online\/offline isolation by importing transaction metadata and exporting signatures using QR codes,\" Subzero's developers write.","<em data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/developer.squareup.com\/blog\/open-sourcing-subzero\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Square<\/a><\/em>","Square uses a second tool, dubbed Beancounter, to audit its bitcoin holdings.&nbsp;","And as an extra degree of support, Square said in the white paper that it possesses crime insurance in the event of a theft of its funds.","\"Although this investment is held in cold storage, in order to further protect our bitcoin holdings Square maintains a Crime insurance policy to protect against internal or external theft of bitcoin both in hot wallet and cold storage,\" the firm explained.","While stressing that the information in the white paper isn't for investment advice, Square did note that \"[w]e hope this outline of our decision to allocate a portion of Square’s assets into bitcoin provides useful information to others contemplating a similar strategy.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 5","content":"DATE"},{"type":"Square","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"second quarter of 2020","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Hardware Security Modules","content":"ORGANIZATION"},{"type":"fall of 2018","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"$17 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"August 2018","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Michael McSweeney","The Block"]}