{"summary":"The Bank of Thailand will begin testing retail digital currency in the second quarter of next year, said assistant governor Vachira Arromdee.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100323\/thailand-central-bank-test-retail-digital-currency-2022","publishDate":"2021-04-02T07:50:21","id":10515,"type":null,"title":"Thailand&#x27;s central bank to test retail digital currency next year","category":["CENTRAL BANKS"],"content":["The Bank of Thailand will begin testing retail digital currency in the second quarter of next year, assistant governor Vachira Arromdee has said.&nbsp;","Arromdee <a href=\"https:\/\/www.reuters.com\/article\/thailand-economy-cenbank\/thai-central-bank-to-test-retail-baht-digital-currency-next-year-idUSL4N2LV0WA\" data-v-f87c67ca=\"\">further said<\/a> that the retail digital currency could be fully implemented over the next 3-5 years, Reuters reported Friday. \"It will not affect the Thai financial system,\" said Arromdee.","The Bank of Thailand is seeking public feedback on the development and issuance of retail central bank digital currency (CBDC) by June 15. To that end, the central bank <a href=\"https:\/\/www.bot.or.th\/Thai\/DigitalCurrency\/Documents\/BOT_RetailCBDCPaper.pdf\" data-v-f87c67ca=\"\">has published a 59-page paper<\/a> laying out its approach in considering issuing a retail CBDC.","\"We believe that a retail CBDC would provide a valuable option for citizens to benefit from a digital currency that is accessible, reliable and safe,\" said the central bank. \"It would also lay the groundwork for a safe payment infrastructure, building the foundation for interoperability and collaboration with the private sector to drive financial innovation.\"","But the planned effort won't be without its risks and challenges. Hence, the exploration of retail CBDC \"must take into account policy implications, design decisions and risk mitigation measures,\" said the central bank.","The Bank of Thailand has also been engaged in work on wholesale digital currency through <a href=\"https:\/\/www.theblockcrypto.com\/linked\/68850\/thailands-central-bank-will-prototype-digital-currency-based-payment-system-for-businesses\" data-v-f87c67ca=\"\">Project Inthanon<\/a>, which focuses only on interbank payments. The project has been going on since 2018 and is still in a proof-of-concept stage, <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2020\/08\/The-Block-Research-CBDC-Report-From-Iteration-to-Implementation_v1.04.pdf\" data-v-f87c67ca=\"\">as The Block's CBDC report noted recently.<\/a> The technical, regulatory, operational, and legal considerations of wholesale CBDC are yet to be explored by the project.","In the meanwhile, the Bank of Thailand has expanded its attention to a retail CBDC for the general public in anticipation that \"digital currencies will play a greater role in Thailand's s future financial landscape.\"","\"A retail CBDC could serve as a trusted and safe means of payment accessible by Thai households and business alike, existing alongside cash and other payment instruments,\" said the central bank. \"As a reliable payment infrastructure, it could help safeguard the stability of the Thai financial and monetary system in the new financial landscape.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vachira Arromdee","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Arromdee","content":"PERSON"},{"type":"Thailand","content":"LOCATION"},{"type":"Bank of Thailand","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June 15","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"2018","content":"DATE"}],"hashtag":["CBDCS"],"authors":["Yogita Khatri","The Block"]}