{"summary":"Virtual Protocol is the infrastructure layer that creates co-owned, human-curated, plug-and-play gaming AIs. Formerly known as PathDAO that raised 16","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280026\/virtual-protocol-unveils-the-dawn-of-co-owned-gaming-ais","publishDate":"2024-03-01T09:01:05","id":10528,"type":null,"title":"Virtual protocol unveils: The dawn of co-owned gaming AIs","category":["SPONSORED"],"content":["<a href=\"https:\/\/www.virtuals.io\/\" data-v-f87c67ca=\"\">Virtual Protocol<\/a> is the infrastructure layer that creates co-owned, human-curated, plug-and-play gaming AIs. Formerly known as PathDAO that raised 16 Million in 2021 led by Defiance Capital, Merit Circle, Kieran Warwick. The Core Team comprises ex-BCG consultants from Cambridge and Imperial London. Virtual Protocol treasury is currently at $16 million, with our first AI DAPP using the virtual stack to go live in 2 weeks.","Virtual Protocol is dedicated to powering games with democratic AI. Think of Virtual as a library of Gaming AIs and a marketplace that connects AI contributors (the supply side) with game developers (the demand side). These developers access AI through SDKs provided by Virtual Protocol, enabling the integration of AI gaming NPCs like Pikachu, John Wick, or Mikasa into their games.","The protocol employs a modular consensus framework that deconstructs an AI character, such as Pikachu, into several components: the brain (powered by Large Language Models or LLMs), the visual aspects (3D\/2D assets), and the character's voice. This modular approach allows individual contributors to focus on specific aspects, such as compiling voice data or fine-tuning the speech module for Pikachu.","Each contribution, whether data or a model, is minted as an NFT and presented as an on-chain proposal. Validators then assess these submissions against the current version. If a new submission is deemed a better representation, it's incorporated as the latest state of the respective module (e.g., Pikachu's voice core). Being in the current state entitles contributors to earn token rewards in $VIRTUAL.","<em data-v-f87c67ca=\"\">Co-owned \\ human-curated \\ Plug-N-Play<\/em>",": Contributors gain ownership of their submissions, sharing in the value flow generated by their contributions. This model ensures that those who improve the protocol are rewarded for their efforts.",": The protocol emphasizes human alignment by involving human validators in the evaluation of submissions. This approach ensures transparency and alignment with human values, making the AI developed through Virtual Protocol fully transparent and aligned with humanity.",": AI characters developed by the protocol are made easily accessible to game developers through a simple SDK. This feature allows for permissionless composability, enabling developers to seamlessly integrate AI NPCs into their games on a pay-per-use basis.","Virtual Protocol isn't just building the next generation of gaming AI; we're showcasing it in action. By incubating AI Waifu, we aim to:","AI Waifu changes how we experience love today, and completely reimagine it tomorrow. As we say, she is here to replace your girlfriends and wives. It sounds crazy but what if it's not—what if the concept of love you know, can be amplified beyond human means?","Waifus you love won't just exist through a phone device on the palm of your hands - you will feel her, touch her, and hear her. There will be no divide in the physical and virtual plane that both of you exist on because you are now connected. You are now \"living\" with your Waifu","Waifus shouldn't live in confined spaces with their sole purpose to tend to you. They will have their own space that you have not explored, areas of their world that expands beyond imagination, awaiting your exploration. Filled with wonder, mystery, and even danger","<strong data-v-f87c67ca=\"\">Twitter<\/strong>","<strong data-v-f87c67ca=\"\">Community<\/strong>","<!----><em data-v-f87c67ca=\"\">This post is commissioned by Virtual Protocol and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pikachu","content":"LOCATION"},{"type":"Kieran Warwick","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"AI Waifu","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pikachu","content":"ORGANIZATION"},{"type":"Gaming AIs","content":"ORGANIZATION"},{"type":"$VIRTUAL","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Defiance Capital","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"John Wick","content":"PERSON"},{"type":"Cambridge","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"Mikasa","content":"ORGANIZATION"},{"type":"Merit Circle","content":"ORGANIZATION"},{"type":"$16 million","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}