{"summary":"A project closely tied to OpenAI CEO Sam Altman faces another temporary ban in Europe as Worldcoin attempts to grow signup numbers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284719\/worldcoin-data-collection-portugal","publishDate":"2024-03-26T09:02:38","id":10527,"type":null,"title":"Worldcoin ordered to halt biometric data collection in Portugal: report","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Worldcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248504\/worldcoin-wld-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/worldcoin.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WLD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.45%\n    <\/span><\/a> <!----><\/span><\/span> has encountered another setback in Europe as the \"proof of personhood\" project tries to grow the number of people who sign up by having their eyeballs scanned to prove they are human.<\/span>","A Portugal data regulator has ordered Worldcoin to halt its collection of personal data for 90 days, according to a <a href=\"https:\/\/www.reuters.com\/markets\/currencies\/sam-altmans-worldcoin-ordered-stop-data-collection-portugal-2024-03-26\/\" data-v-f87c67ca=\"\">report<\/a> from Reuters. The project, closely tied to OpenAI CEO Sam Altman, was <a href=\"http:\/\/n\" data-v-f87c67ca=\"\">also banned<\/a> last month for up to three months in Spain.","\"Portugal's data regulator, the CNPD, said there was a high risk to citizens' data protection rights, which justified urgent intervention to prevent serious harm,\" according to the report. \"More than 300,000 people in Portugal have provided Worldcoin with their biometric data,\" the CNPD said.","Tools for Humanity, the l<span data-v-f87c67ca=\"\">ead&nbsp;<\/span><span data-v-f87c67ca=\"\">software contributor&nbsp;<\/span><span data-v-f87c67ca=\"\">behind the Worldcoin project, said by email that the Worldcoin project follows all laws and regulations with regard to collecting and transferring biometric data. <\/span>","<span data-v-f87c67ca=\"\">\"<\/span>The Worldcoin Foundation has the utmost respect for the role and responsibilities of data protection authorities, in the CNPD in Portugal,\" said Jannick Preiwisch, data protection officer at Worldcoin Foundation. \"The report from CNPD is the first time we are hearing from them regarding many of these matters, including reports of underage sign-ups in Portugal, for which we have zero tolerance for and are working to address in all instances.\"","In an effort to augment users' control over their personal data, Worldcoin recently <a href=\"https:\/\/www.theblock.co\/post\/284123\/worldcoin-to-end-storing-users-personal-data\" data-v-f87c67ca=\"\">rolled out<\/a> \"Personal Custody,\" a new process that eliminates the storing and encryption of people's biometric data. Previously, users could opt to let Worldcoin store their personal data.","\"Even though everything was deleted by default before, definitely now the fact that users have control over what to do with their data, definitely does give you that peace of mind, not needing to trust anyone,\" Tools for Humanity executive Tiago Sada said last week.","When people have their eyeballs scanned by Worldcoin, they establish a World ID and receive cryptocurrency, WLD tokens. Worldcoin has signed up more than 4.5 million people in 120 countries, according to its website.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Portugal","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jannick Preiwisch","content":"PERSON"},{"type":"Tiago Sada","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Spain","content":"LOCATION"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"The Worldcoin Foundation","content":"ORGANIZATION"},{"type":"-0.45%","content":"PERCENT"},{"type":"CNPD","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["EUROZONE REGULATION"],"authors":["RT Watson","The Block"]}