{"summary":"Crypto tokens linked to artificial intelligence have seen a surge in interest after reports that Microsoft could invest $10 billion into ChatGPT creator OpenAI.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202637\/chatgpt-says-it-has-bills-to-pay-as-crypto-ai-tokens-rise-in-wake-of-potential-microsoft-deal","publishDate":"2023-01-16T16:04:52","id":10533,"type":null,"title":"ChatGPT says it has bills to pay as crypto AI tokens rise in wake of potential Microsoft deal","category":["DEFI"],"content":["Crypto tokens linked to artificial intelligence have seen a surge in interest after reports that Microsoft could invest <a href=\"https:\/\/www.ft.com\/content\/a6d71785-b994-48d8-8af2-a07d24f661c5\" data-v-f87c67ca=\"\">$10 billion<\/a> into ChatGPT creator OpenAI.","The rally has cooled slightly since news of the deal first broke last week, but nine coins connected to the sector have surged over 50% in the past week, <a href=\"https:\/\/www.coingecko.com\/en\/categories\/artificial-intelligence\" data-v-f87c67ca=\"\">according to CoinGecko<\/a>. Many of the tokens are considered “small cap” with low liquidity, meaning it doesn’t take much to move the price.","ImgnAI, a token linked to an anime-based AI image generator, has been one of the top performers, rising a whopping 718% over the past week. The coin has seen transaction volume of $750,198 in the past 24 hours. <a class=\"c-link\" tabindex=\"-1\" href=\"http:\/\/fetch.ai\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/Fetch.ai\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Fetch.ai<\/a>, a more liquid AI-related coin, saw volume of $77.6 million over the past 24 hours. It's up 65.1% over the past week.","The crypto tokens rising this week have yet to prove if they are viable long-term beyond the typical governance promises common to other utility coins. While the protocols themselves may use AI, how intertwined the tokens are to the technology isn't totally clear.","","","“AI and crypto will be intertwined in a way that will become clearer over the next decade,” he <a href=\"https:\/\/twitter.com\/hosseeb\/status\/1612237750559965186\" data-v-f87c67ca=\"\">tweeted<\/a>. “Is this good? Is it bad? It's hard to say. But you should be prepared for an explosive combination.”","When asked why AI might need to use money, ChatGPT noted the bills that would need to be paid. It didn't want to specify which token it might like best.","\"As for why AI bots may need money for themselves, it could be used for various reasons,\" the chat bot wrote when prompted by The Block. \"To pay for their own maintenance and upgrades, similar to how humans use money to maintain and improve their standard of living.\"","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"718%","content":"PERCENT"},{"type":"65.1%","content":"PERCENT"},{"type":"$77.6 million","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$750,198","content":"MONEY"}],"hashtag":["TOKENS"],"authors":["Mike Truppa","The Block"]}