{"summary":"An early investigation by UniSat Wallet claims 70 transactions were affected out of 383. The extension said it will refund affected users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227844\/bitcoin-ordinals-unisat-wallet-double-spend","publishDate":"2023-04-24T03:56:58","id":10531,"type":null,"title":"Bitcoin Ordinals extension UniSat Wallet hit by double-spend attacks","category":["NFT MARKETPLACES"],"content":["Hours after the open-source Chrome extension for Bitcoin ordinals became inaccessible, UniSat Wallet announced that it was hit by a large number of double-spend attacks resulting from a vulnerability in its codebase.","\"During our testing last week, we simulated different approaches to double-spend attacks and made improvements and enhancements to the code,\" UniSat Wallet <a href=\"https:\/\/twitter.com\/unisat_wallet\/status\/1650349215552536577\" data-v-f87c67ca=\"\">explained<\/a> on Twitter. \"Unfortunately, certain problems were still exposed in the initial public version.\"","A preliminary investigation by the extension's team claims 70 transactions were affected out of 383.&nbsp;","UniSat Wallet claims to be the first BRC-20 wallet and marketplace provider.","UniSat Wallet stated that it will \"compensate users who are determined to be associated with the incident for their losses\" after further investigations over the next few days.","It also asked users who believe they were affected to open a support ticket on its Discord server.","\"Please understand that BRC-20 is still very young and there have been numerous issues identified and resolved in the past 30 days,\" UniSat Wallet tweeted.","\"As the first BRC-20 wallet provider and the first marketplace provider, UniSat is constantly facing numerous issues and moving forward with your full support,\" it added.","The BRC-20 token standard is a relatively new and experimental fungible token standard created using <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals<\/a> and Inscriptions. These are saved on the Bitcoin blockchain.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UniSat Wallet","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Adam James","The Block"]}