{"summary":"Today&#x27;s report from the folks at Breaker is both rather scandalous and yet disappointingly unsurprising. A &quot;sting&quot; of sorts conducted by Breaker found","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2243\/it-should-go-without-saying-but-we-cant-be-bought","publishDate":"2018-10-25T21:27:39","id":10535,"type":null,"title":"The Block&#x27;s editorial manifesto: Of course we can&#x27;t be bought","category":["LAYER 1S"],"content":["Today's report from the folks at&nbsp;<em data-v-f87c67ca=\"\">Breaker&nbsp;<\/em>is both rather scandalous and yet disappointingly unsurprising. A \"sting\" of sorts&nbsp;conducted by <em data-v-f87c67ca=\"\">Breaker&nbsp;<\/em>found that <a href=\"https:\/\/breakermag.com\/we-asked-crypto-news-outlets-if-theyd-take-money-to-cover-a-project-more-than-half-said-yes\/\" data-v-f87c67ca=\"\">out of 22 crypto news outlets they contacted with an offer of \"pay to publish,\" 12 said they would take the money<\/a> and post the requested info. This is hardly new in technology-related media, as <em data-v-f87c67ca=\"\">Breaker<\/em> cited this John Biggs post over at <em data-v-f87c67ca=\"\">TechCrunch,&nbsp;<\/em><a href=\"https:\/\/techcrunch.com\/2018\/09\/18\/inside-the-pay-for-post-ico-industry\/\" data-v-f87c67ca=\"\">outlining the same kind of BS<\/a>.","The proliferation of media outlets in the Web 2.0 era has made this kind of thing both easier to do and ironically less useful at the same time. A generation ago, if your PR team or agency could get the&nbsp;<em data-v-f87c67ca=\"\">New York Times&nbsp;<\/em>to run a story on your company, book or restaurant, the value was hard to measure. Everybody who was anybody read the&nbsp;<em data-v-f87c67ca=\"\">Times&nbsp;<\/em>(and, it's worth noting, many still do). But in this day and age, news is broken or reported on countless sites. There is no magic place to get coverage that ensures wide distribution of your news. And therefore, your \"not really news\" where you convince&nbsp;<em data-v-f87c67ca=\"\">ICOTokenBlockchainReport&nbsp;<\/em>(I think that's a fake name I just made up) to write about your scammy initial coin offering doesn't guarantee anyone will read it, nor does it demonstrate your authenticity to skeptics.","So perhaps, in that sense, it isn't surprising that a dozen crypto sites would take money from&nbsp;<em data-v-f87c67ca=\"\">Breaker's&nbsp;<\/em>phony \"Nikolay Kostarev\" who was asking for coverage of a fictitious ICO. Kostarev would pay for that coverage so long as the post was&nbsp;<em data-v-f87c67ca=\"\">not<\/em> labeled \"sponsored\" and appeared to be legitimate news.","At&nbsp;<em data-v-f87c67ca=\"\">The Block,&nbsp;<\/em>if and when we receive such a request we will, of course, ignore it — except perhaps to expose the requestor as one to avoid. We're still the \"new kid\" in crypto, and we weren't contacted by&nbsp;<em data-v-f87c67ca=\"\">Breaker,&nbsp;<\/em>but I can state with metaphysical certitude that we would never even spend a moment entertaining such a request.","It should be obvious why to anyone even tangentially familiar with journalistic standards. But today seems like as good an opportunity as any — it's around three months since our initial launch of&nbsp;<em data-v-f87c67ca=\"\">The Block's<\/em> newsletter to share with our readers a little insight into how we do things.","While we don't share all the opinions of the estimable NYU Stern Professor Nouriel Roubini — a noted crypto skeptic — we leave you today with one of his thoughts from Twitter about crypto\/blockchain media: \"With the exception of two or three independent outlets like your @TheBlock__ the rest is totally conflicted and captured by the industry,\" <a href=\"https:\/\/twitter.com\/Nouriel\/status\/1055502784148078592\" data-v-f87c67ca=\"\">Roubini wrote<\/a>.&nbsp;","We both appreciate those kind words&nbsp;we have a pretty good idea of who the other \"independent outlets\" that Roubini refers to. We respect what they do, and we hope to be mentioned in the same breath as our strongest competitors for a long time. Someday, if we keep doing what we doing, we hope to be first among equals. In the meantime, we're going to get back to work.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Times","content":"ORGANIZATION"},{"type":"NYU Stern Professor Nouriel Roubini","content":"ORGANIZATION"},{"type":"Roubini","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nikolay Kostarev","content":"PERSON"},{"type":"John Biggs","content":"PERSON"}],"hashtag":[],"authors":["Mark Rogowsky","The Block"]}