{"summary":"Solana DEX aggregator Jupiter confirmed that its JUP token will launch on Jan. 31, accompanied by a retroactive airdrop for users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272800\/jupiter-jup-token-launch-date-memecoin-drop-planned","publishDate":"2024-01-16T05:49:51","id":10532,"type":null,"title":"Solana DEX aggregator Jupiter confirms token release date","category":["CRYPTO ECOSYSTEMS"],"content":["Solana decentralized exchange aggregator Jupiter <a href=\"https:\/\/twitter.com\/weremeow\/status\/1746923653055586716\" data-v-f87c67ca=\"\">confirmed<\/a> that its governance token JUP will launch on Jan. 31 — with the project set to airdrop nearly one million crypto wallets in the first phase.","As part of its launch platform testing, Jupiter’s pseudonymous founder Meow also <a href=\"https:\/\/twitter.com\/weremeow\/status\/1746923653055586716\" data-v-f87c67ca=\"\">said<\/a> yesterday — the project will be conducting a test launch with “mockJUP” today and has plans for a memecoin launch next week conducted on the platform by a third-party. “Yes, it is a real memecoin. No, it is not by Jupiter. No, it is not MEOW. Just wait,” Meow added.","The project also intends to kickstart its working group and “DAO vision” and finish the final Jupiter white paper — ahead of the token launch.","Jupiter first <a href=\"https:\/\/www.theblock.co\/post\/263283\/jupiter-airdrop-solana-wallets\" data-v-f87c67ca=\"\">announced<\/a> its retrospective airdrop plans in November to reward early users, and its <a href=\"https:\/\/www.theblock.co\/post\/265757\/solana-dex-aggregator-jupiter-starts-token-airdrop-with-10-of-supply-set-to-be-allocated\" data-v-f87c67ca=\"\">airdrop allocation<\/a> website went live on Dec. 1.&nbsp;","The project will airdrop four billion tokens, or 40% of Jupiter’s total 10 billion token supply, to users over four phases. According to the project, future airdrop rounds will reward new users.","The first phase will release one billion Jupiter tokens to 955,000 eligible users who have carried out a minimum of $1,000 in swap volume on the protocol by the snapshot date of Nov. 2, featuring various reward tiers based on each user’s volume.&nbsp;","Jupiter is the largest DEX aggregator on Solana by swap volume, generating over <a href=\"https:\/\/station.jup.ag\/stats\/month\" data-v-f87c67ca=\"\">$16 billion<\/a> in trading volume during December, up from around $4 billion in November and $1 billion in October.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"$16 billion","content":"MONEY"},{"type":"Jan. 31","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Dec. 1","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Nov. 2","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":["DEXS","MEMECOINS","SOLANA"],"authors":["James Hunt","The Block"]}