{"summary":"Roblox reported Q2 revenues of $591.2 million on Tuesday in its quarterly earnings report, an increase of 30% year-over-year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162450\/roblox-reports-q2-revenues-of-591-2-million-but-bookings-down-4","publishDate":"2022-08-09T16:37:16","id":10534,"type":null,"title":"Roblox reports Q2 revenues of $591.2 million but bookings down 4%","category":["THE BLOCK"],"content":["Online gaming and game creation platform Roblox reported second-quarter<a href=\"https:\/\/ir.roblox.com\/financials\/quarterly-results\/default.aspx\" data-v-f87c67ca=\"\"> revenues<\/a> of $591.2 million, an increase of 30% year-over-year.","Net cash revenue provided by operating activities totaled $26.5 million, while free cash flow amounted to $57.3 million. Compared with second-quarter 2021, bookings — referring to the platform's virtual currency, \"Robux\" — were down 4% to $639.9 million, making the results posted lower than the $644.4 million expected by analysts, according to Refinitiv data.","Overall however, daily active users (DAU) hit 52.2 million, up 21% year-on-year, while hours engaged were 11.3 billion, an increase of 16%, the company said on Tuesday.","\"We are now at peak numbers globally for users and hours, and in the US\/Canada — the absolute level of users and engagement hours in July exceeded those of any prior month even during the peak lockdown periods of the pandemic. With the exception of December of 2020 and 2021, total global bookings in July were also at monthly high levels,\"&nbsp; the company said in a letter to shareholders.","The results are slightly lower than those of the first quarter of this year, when year-over-year revenue increased 39% to $537.1 million alongside a 28% and 22% growth in DAUs and hours engaged, respectively.","Founded in 2004 by David Baszucki and Erik Cassel, Roblox is headquartered in San Mateo, California. The free-to-play game has been described as a metaverse and has proven particularly popular children and teenagers. However, in a letter to shareholders, the company said that the fastest growing demographic, across both male and female users, was 17- 24 year olds.","It expects male 17-24 year olds to become biggest tracked category in the US and Canada over the coming months.","Personnel costs, excluding stock-based compensation, were also $143.9 million, up 53% year over year, driven by an increase in headcount.","\"We believe that our recruiting brand has never been stronger and believe that we are constrained by the number of talented engineers we can hire. As a result, we continued to hire aggressively in [the second quarter] and expect to do so for the balance of this year and likely into 2023,\" Roblox stated.","The company will hold a webcast to further discuss its second-quarter results on Wednesday morning at 8:30 a.m. EST.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$639.9 million","content":"MONEY"},{"type":"$26.5 million","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"David Baszucki","content":"PERSON"},{"type":"San Mateo","content":"LOCATION"},{"type":"24","content":"DATE"},{"type":"July","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$591.2 million","content":"MONEY"},{"type":"Roblox","content":"PERSON"},{"type":"11.3 billion","content":"MONEY"},{"type":"39%","content":"PERCENT"},{"type":"$644.4 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"quarter 2021","content":"DATE"},{"type":"8:30 a.m. EST","content":"TIME"},{"type":"2004","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$537.1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"53%","content":"PERCENT"},{"type":"Erik Cassel","content":"PERSON"},{"type":"first quarter","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"$57.3 million","content":"MONEY"},{"type":"California","content":"LOCATION"},{"type":"December of 2020","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"16%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"$143.9 million","content":"MONEY"}],"hashtag":["ROBLOX"],"authors":["Callan Quinn","The Block"]}