{"summary":"A California securities regulator issued cease and refrain orders against 11 entities it claims violated state security laws.\nThe companies operated like Ponzi schemes and pyramid schemes, according to the California Department of Financial Protection and Innovation.","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173231\/california-regulator-accuses-11-of-violating-securities-laws-operating-like-ponzi-schemes","publishDate":"2022-09-27T16:26:37","id":1054,"type":null,"title":"California regulator accuses 11 of violating securities laws, operating like Ponzi schemes","category":["Regulation"],"content":["The California Department of Financial Protection and Innovation accused nearly a dozen crypto and decentralized finance entities of operating like Ponzi schemes and violating state securities laws.","The regulator issued desist and refrain orders&nbsp;against 11 entities, it announced in a <a href=\"https:\/\/dfpi.ca.gov\/2022\/09\/27\/dfpi-launches-crackdown-on-crypto-asset-fueled-ponzi-and-pyramid-schemes\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">press release<\/span><\/a> on Tuesday. The move comes a day after the California regulator issued a <a href=\"https:\/\/www.theblock.co\/post\/172900\/california-issues-cease-and-desist-against-crypto-lender-nexo\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">cease and desist<\/span><\/a> against crypto lender Nexo, part of an array of legal actions against the company by multiple states.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The entities in today’s actions are classic examples of high yield investment programs,” the department said, noting the entities had referral programs that were structured like pyramid schemes. “These schemes often target the latest investment vehicle of opportunity and have previously targeted oil and gas investments, cannabis investments and others.”","The department issued desist and refrain orders to Cryptos OTC Trading Platform Limited, Elevate Pass LLC, GreenCorp Investment LLC and Metafiyielders Pty Ltd. Others targeted include Pegasus, Polinur ME Limited, Remabit, Sity Trade and Sytrex Trade. The department also issued orders to Vexam Limited and World Over the Counter Limited.","All 11 entities are accused of offering and selling unqualified securities, while 10 allegedly also made material misrepresentations and omissions to investors.","The department claims nine entities were soliciting funds from investors to purportedly trade crypto assets on their behalf, while one solicited crypto assets to develop metaverse software and another claimed to be a decentralized finance platform."],"hashtag":[]}