{"summary":"The contributors to Uniswap, the largest decentralized exchange, have begun deliberations on the possibility of launching the on Base network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231215\/uniswap-coinbase-layer-2-base","publishDate":"2023-05-17T15:08:19","id":10542,"type":null,"title":"Uniswap contributors propose to launch on Coinbase Layer 2 Base","category":["CRYPTO ECOSYSTEMS"],"content":["Three influential contributors to Uniswap, the leading decentralized exchange, have initiated discussions to explore a potential deployment on Coinbase's Layer 2 blockchain Base.","The proposed integration, which was brought forward today on Uniswap's governance forum by she256, Michigan Blockchain, and GFX Labs, would extend user access to Uniswap's decentralized exchange via Base's Layer 2 network, contingent upon the approval of an on-chain governance vote.","The groups behind the <a href=\"https:\/\/gov.uniswap.org\/t\/deploy-uniswap-v3-on-base\/21249\" data-v-f87c67ca=\"\">proposal<\/a>&nbsp;form part of Uniswap's decentralized autonomous organization. GFX Labs, among the trio, will shoulder the responsibility for the technical implementation of the contracts on Base, subject to the proposal's approval.","Should the proposal go through, it would be a boon for the fledgling Coinbase project. Aimed at offering developers a more accessible, cost-effective platform for building decentralized apps on-chain, the exchange first <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">introduced a testnet version of Base in February<\/a> ahead of an expected mainnet launch later this year. <a href=\"https:\/\/www.theblock.co\/post\/226433\/uniswap-dao-v3-on-polygon-zkevm\" data-v-f87c67ca=\"\">Uniswap v3<\/a> is one of the most widely used decentralized finance applications. Within the last 24 hours, the decentralized exchange protocol that facilitates token swaps&nbsp;handled about half a billion dollars in trading <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/uniswap-v3-ethereum\" data-v-f87c67ca=\"\">volume<\/a> solely on the Ethereum mainnet.","Currently, v3 is available on several EVM-compatible chains, such as Ethereum, Celo, BNB Chain, and additional Layer 2 networks like Arbitrum. Now, the contributors are setting their sights on Base as the next potential launch network.","Shortly after Base's testnet launch, the Uniswap Foundation <a href=\"https:\/\/twitter.com\/UniswapFND\/status\/1628784688629178370\" data-v-f87c67ca=\"\">had hinted<\/a> that the governance process to deploy Uniswap's version 3 on Base would commence, despite Base being in the test phase. <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1628810467689783297\" data-v-f87c67ca=\"\">Uniswap founder Hayden James voiced<\/a> his expectations of deploying the DEX on the network via the native canonical bridge operated by Base's core developers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"last 24 hours","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Celo","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"GFX Labs","content":"ORGANIZATION"},{"type":"Michigan Blockchain","content":"PERSON"},{"type":"Hayden James","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["BASE","DEXS","UNISWAP"],"authors":["Vishal Chawla","The Block"]}