{"summary":"Movement Labs said it plans to use the pre-seed capital to expand Move, a smart contract development language.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250084\/movement-labs-raises-3-4-million-in-pre-seed-to-grow-move","publishDate":"2023-09-13T11:00:03","id":10549,"type":null,"title":"Movement Labs raises $3.4 million in pre-seed to grow &#x27;Move&#x27;","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">Movement Labs, a blockchain infrastructure startup, has raised $3.4 million in its pre-seed funding round to “launch a network of modular Move-based blockchains,” the company said.<\/span>","<span data-v-f87c67ca=\"\">Movement Labs said today in a statement that the funding will allow it to grow the adoption and development of Move, a smart contract development language “with embedded safeguards protecting against attack vectors such as reentrancy that cost the crypto sector around $4 billion annually.”<\/span>","<span data-v-f87c67ca=\"\">The investors of the funding round included dao5, Varys Capital, Blizzard Fund and Borderless Capital. A number of angel investors — including dao5’s George Lampeth, Eigenlayer’s Calvin Liu, Berachain’s Smokey The Bera and Avail’s Anurag Arjun — also participated in the round.<\/span>","<span data-v-f87c67ca=\"\">“Parallel processing, modules, dynamic NFTs, and unparalleled security may blow the roof off the ceiling to Web3 innovation,” Cooper Scanlon, co-founder of Movement Labs, said in the statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rushi Manche, Movement Labs’ co-founder, said the Move programming language benefits smart contract developers, including direct interaction with digital assets through custom resource types, flexibility with transaction script declaration, on-chain verification and bytecode safety privileges.<\/span>","<span data-v-f87c67ca=\"\">“It also solves many of the inherent security and performance flaws of Solidity, including reentrancy attacks, DoS attacks, resource inefficiencies, and bugs introduced during the compiling process,” Manche added.<\/span>","<span data-v-f87c67ca=\"\">The company said that, through the Movement SDK, it has built a framework that combines horizontal interoperability through high-throughput modular Move Virtual Machines.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As the first implementation of this SDK, Movement is unveiling M1: a revolutionary modular Layer 1 designed to combine performance with liquidity and composability,” the company said in the statement. “Addressing the cold-start problem faced by new protocols, M1 natively bootstraps its ecosystem, liquidity, validator set, and EVM-traditional tooling by living within the Avalanche consensus.”<\/span>","<span data-v-f87c67ca=\"\">The company added that it plans to expand its network of blockchains to ecosystems such as Ethereum and Cosmos.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4 billion","content":"MONEY"},{"type":"$3.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Varys Capital","content":"ORGANIZATION"},{"type":"Movement Labs","content":"ORGANIZATION"},{"type":"Berachain’s Smokey The Bera","content":"PERSON"},{"type":"Cooper Scanlon","content":"PERSON"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Movement SDK","content":"ORGANIZATION"},{"type":"Anurag Arjun","content":"PERSON"},{"type":"Move Virtual Machines","content":"ORGANIZATION"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"George Lampeth","content":"PERSON"},{"type":"Calvin Liu","content":"PERSON"}],"hashtag":["DEVELOPER TOOLS","SEED &AMP; PRE-SEED"],"authors":["Timmy Shen","The Block"]}