{"summary":"The platform will disable the OpenSea Operator Filter, which enforces royalties, on Aug. 31 in favor of a optional creator fee model.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246095\/opensea-disables-royalty-enforcement-tool-makes-creator-fees-optional","publishDate":"2023-08-17T16:51:34","id":10544,"type":null,"title":"OpenSea disables royalty enforcement tool, makes creator fees optional","category":["METAVERSE & NFT"],"content":["NFT marketplace OpenSea is changing its creator fee structure.&nbsp;","The platform has opted to make creator fees optional for new collections after Aug. 31. It will also disable the OpenSea Operator Filter, a tool that enforced creator royalties, according to a <a href=\"https:\/\/opensea.io\/blog\/articles\/creator-fees-update\" data-v-f87c67ca=\"\">statement<\/a>.","Collections that used the filter up to that date will have their creator fee royalties enforced on OpenSea through Feb. 29, after which the fees will become optional.&nbsp;","\"To be clear, creator fees aren’t going away – simply the ineffective, unilateral enforcement of them,\" OpenSea wrote.","\"In November 2022, we launched the Operator Filter: a tool designed to give creators more control by restricting the sale of their collections to web3 marketplaces that enforce creator fees in secondary sales. It was meant to empower creators with greater control over their web3 business models, but it required the buy-in of everyone in the web3 ecosystem, and unfortunately that has not happened.\"","Royalties were once touted as among the most utilitarian use cases for NFTs, allowing artists to earn income from perpetual sales of their work. However, after the token-based platform X2Y2 experimented with 0% creator royalty fees in February of 2022, a <a href=\"https:\/\/www.theblock.co\/post\/185497\/nft-royalties-the-story-so-far\" data-v-f87c67ca=\"\">debate<\/a> occurred in the crypto community as to whether they were necessary at all.","OpenSea stood strong with creator royalty enforcement, <a href=\"https:\/\/www.theblock.co\/post\/178603\/why-nft-royalties-are-almost-impossible-to-enforce-on-chain\" data-v-f87c67ca=\"\">implementing<\/a> royalties of up to 10%. However, OpenSea <a href=\"https:\/\/www.theblock.co\/post\/213056\/opensea-makes-changes-to-fees-following-tension-with-blur\" data-v-f87c67ca=\"\">reduced<\/a> royalties in February after tension with the NFT platform Blur, which has a 0.5% creator royalty fee.","By July 5 of this year, NFT royalties had hit the <a href=\"https:\/\/www.theblock.co\/post\/237830\/earnings-from-nft-royalties-hits-two-year-low-nansen\" data-v-f87c67ca=\"\">lowest volumes<\/a> in two years.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"OpenSea Operator Filter","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"July 5 of this year","content":"DATE"},{"type":"Feb. 29","content":"DATE"},{"type":"0.5%","content":"PERCENT"},{"type":"0%","content":"PERCENT"},{"type":"February of 2022","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"Aug. 31","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["MK Manoylov","The Block"]}