{"summary":"Dutch police have arrested a 39-year-old man in connection with a suspected case of laundering bitcoin stolen via a fake Electrum wallet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169860\/bitcoin-money-laundering-suspect-arrested-by-dutch-police","publishDate":"2022-09-14T05:29:29","id":10543,"type":null,"title":"Bitcoin money laundering suspect arrested by Dutch police","category":["HACKS"],"content":["A man arrested by Dutch authorities last week for allegedly laundering stolen bitcoin worth tens of millions of dollars has been released but still remains a suspect, according to a <a href=\"https:\/\/www.politie.nl\/nieuws\/2022\/september\/13\/03-man-opgepakt-witwassen-cryptovaluta.html\" data-v-f87c67ca=\"\">statement<\/a> by Dutch police on Tuesday.","The unidentified man, aged 39, is accused of laundering bitcoin that was stolen via a <a href=\"https:\/\/www.theblock.co\/linked\/80567\/criminals-steal-22-million-through-electrum-phishing-updates\" data-v-f87c67ca=\"\">fake version of Electrum<\/a>, an open-source bitcoin wallet, according to the police.","“Investigation showed that the man converted bitcoin into the privacy coin monero and vice versa, which makes the trail of transactions more difficult to track. His service was provided via the anonymous online network Bisq. It is suspected that the man earned a lot from laundering in this way,” the police said in a statement.","Monero is a <a href=\"https:\/\/www.theblock.co\/linked\/4434\/u-s-government-wants-to-research-ways-to-perform-forensic-analysis-of-monero-and-zcash\" data-v-f87c67ca=\"\">privacy-focused cryptocurrency<\/a>. Unlike bitcoin, monero’s distributed ledger system incorporates features that make it difficult to trace the participants in a transaction. Bisq is a decentralized crypto exchange.","According to the announcement, the police raided the suspect’s home in Veenendaal, a village in the Utrecht province. Dutch police seized the man’s crypto holdings including the profit made from the alleged money laundering.","Despite being released on Tuesday, the police say the man is still a suspect. Both the cybercrime teams of the central and eastern Netherlands are in charge of the investigation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Veenendaal","content":"LOCATION"},{"type":"eastern Netherlands","content":"LOCATION"},{"type":"Utrecht","content":"LOCATION"}],"hashtag":["BITCOIN","CRIME"],"authors":["Osato Avan-Nomayo","The Block"]}