{"summary":"Prithvi Subburaj, a former general manager at Google, has been appointed as the chief operating officer of OP Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248677\/op-labs-hires-former-google-exec-as-chief-operating-officer","publishDate":"2023-09-01T07:42:40","id":10556,"type":null,"title":"OP Labs hires former Google exec as chief operating officer","category":["COMPANIES"],"content":["Prithvi Subburaj, previously a general manager at Google, has taken on the role of chief operating officer at OP Labs — a core developer of the Optimism Collective, which governs the Layer 2 network <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">Optimism<\/a>.","OP Labs is a research and development firm that aims to improve the scalability of Ethereum applications through the use of optimistic rollups.","The appointment of Subburaj follows Optimism co-founder Karl Floersch’s transition to the role of CEO at OP Labs earlier this year. According to the firm, Subburaj is its first executive hire following this change in leadership.","“Prithvi brings the expertise and leadership needed to scale our teams and processes to support this exponential growth and future potential,” said Karl Floersch, CEO of OP Labs.","Subburaj’s <a href=\"https:\/\/www.linkedin.com\/in\/prithvisubburaj\/\" data-v-f87c67ca=\"\">background<\/a> includes leading roles focused on software engineering at Google, where he most recently managed the tech giant's wireless subscription service Google Fi. He was at Google for over 15 years.","He has joined OP Labs at a time when the firm is zeroing in on the development of key technological components such as the recent <a href=\"https:\/\/www.theblock.co\/post\/232158\/coinbase-backed-base-targeting-mainnet-launch-after-optimisms-bedrock-upgrade\" data-v-f87c67ca=\"\">Bedrock<\/a> upgrade and the upcoming <a href=\"https:\/\/blog.oplabs.co\/building-a-fault-proof-system\/\" data-v-f87c67ca=\"\">Fault Proof system<\/a>.","The firm previously developed the OP Stack, a software package that has been utilized in the development of Layer 2 chains such as Coinbase-backed <a href=\"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer\" data-v-f87c67ca=\"\">Base<\/a>, Zora, and others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Google Fi","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"Subburaj","content":"ORGANIZATION"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"Karl Floersch","content":"PERSON"}],"hashtag":["HIRING"],"authors":["Vishal Chawla","The Block"]}