{"summary":"Poolin, one of the world&#x27;s biggest crypto mining pools, said Monday that it would suspend bitcoin and ether withdrawals from its wallet service due to &quot;liquidity problems.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167850\/withdrawals-frozen-at-crypto-mining-firm-poolin-amid-liquidity-problems","publishDate":"2022-09-05T13:03:43","id":10550,"type":null,"title":"Withdrawals frozen at crypto mining firm Poolin amid &#x27;liquidity problems&#x27;","category":["MINING"],"content":["Poolin, one of the world's biggest crypto mining pools, is suspending bitcoin and ether withdrawals from its wallet service due to \"liquidity problems.\"","\"As you may have known, Poolin Wallet is currently facing some liquidity problems due to recent increasing demands on withdrawals. But please be assured, all user assets are safe and the company's net worth is positive,\" the firm said in an <a href=\"https:\/\/help.poolin.me\/hc\/en-us\/articles\/10207618877977-Announcement-on-settlement-adjustment-and-ZERO-fee-promo\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announcement Monday<\/a>.","Poolin said that it would \"make a snapshot of the remaining BTC and ETH balances on pool on September 6th to work out the balances.\"","\"The daily mined coins after September 6th will be normally paid out per day. Other coins are not affected. The details of payout schedule for remaining balances will be released when details are set,\" the post continued.","The Beijing-based company is among the latest industry firms to suspend withdrawals due to liquidity problems amid this year's decline in crypto asset prices. Lenders Voyager Digital and Vauld both halted withdrawals in July. Voyager has since begun restoring some access to customers.","Poolin mined the fourth-highest number of transaction blocks in the past 24 hours, according to <a href=\"https:\/\/btc.com\/stats\/pool\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">BTC.com data.<\/a>","Poolin didn't explicitly explain the source of the liquidity issues, but <a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/05\/poolin-one-of-the-worlds-biggest-bitcoin-mining-pools-acknowledges-liquidity-issues\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinDesk<\/a> noted complaints about withdrawal issues in the service's Telegram channel. Poolin CEO and founder Kevin Pan reportedly floated the idea of taking on debt to support the company's finances in a social media post.","\"Withdrawals from Pool Account will be paused,\" the firm said. \"Time and plans of resume will be released within 2 weeks. Please note: Pool Account is a wallet function embedded on pool. Regular mining and direct payout from mining pool are not affected.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Kevin Pan","content":"PERSON"},{"type":"Time","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Poolin Wallet","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"September 6th","content":"DATE"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"July","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}