{"summary":"Enjin has raised $18.9 million to build a Polkadot-based blockchain network, dubbed Efinity, with a focus on non-fungible tokens or NFTs.\nThe network’s Phase 1 is expected to launch around the end of this year or the beginning of 2022, Enjin CTO Witek Radomski told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99980\/enjin-polkadot-based-blockchain-nft-funding","publishDate":"2021-03-31T11:00:18","id":1056,"type":null,"title":"Enjin raises nearly $19 million to build Polkadot-based NFT blockchain","category":["NFTs"],"content":["Blockchain development firm Enjin has raised $18.9 million to build a Polkadot-based blockchain network, especially for non-fungible tokens (NFTs).","The network, dubbed Efinity, will have its own token called Efinity Token (EFI), Enjin CTO Witek Radomski told The Block. And the funding has been secured via selling EFT tokens, said Radomski.","Crypto.com Capital, DFG Group, and Hashed Ventures led the funding round, with participation from BlockTower, Blockchain.com Ventures, Fenbushi Capital, Arrington XRP Capital, and several others.","Enjin is not new to the NFT space. It created the ERC-1155 standard for NFTs in 2017, and it is used by companies like Microsoft and Nike.","<a href=\"https:\/\/www.microsoft.com\/skills\/azureheroes\" data-v-f87c67ca=\"\">Microsoft uses<\/a> ERC-1155 to reward the Azure developer community with \"provably scarce, unique NFT badges based on their contributions and achievements,\" Enjin's VP of operations Bryana Kortendick told The Block. As for Nike, it has patented a system for tokenizing shoes on Ethereum using the ERC-1155 standard, said Kortendick.","The new Efinity blockchain will be purpose-built for NFTs and is being developed as a parachain on Polkadot, Radomski told The Block.","When asked how Efinity will be different from Ethereum and Dapper Labs' Flow blockchain, Radomski said Efinity aims to resolve the friction points that users and developers hit with the two blockchains.","When interacting with Ethereum-based NFTs, frictions like \"transaction fees, the requirement of ether (ETH), account security, disjointed applications, problematic multisig security\" are present, said Radomski. While Flow is tackling some of these issues, they have built the blockchain from the ground-up, along with their own scripting language, which could pose challenges, according to Radomski.","\"Flow may see challenges if they aren't able to attract enough nodes to become sufficiently decentralized, and they might also face an uphill battle convincing developers to learn their proprietary language,\" he said. \"On Efinity and Polkadot, developers can use Rust which is a well-established language, and every parachain will benefit from the combined security of the entire Polkadot network.\"","\"Finally, each parachain can easily interact with other parachains using XCMP [Cross-chain Message Passing], which creates a powerful network effect,\" Radomski told The Block.","Efinity's Phase 1 is expected to launch around the end of this year or the beginning of 2022, said Radomski.","\"After that point, we will continue our roadmap, adding more planned functionality to the blockchain through upgrades and decentralized governance,\" he said."],"hashtag":[]}