{"summary":"Polygon is launching a public testnet for Ethereum scaling solution Hermez, as the race for a dominant Ethereum Layer 2 solution gets underway.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175972\/polygon-launches-testnet-for-layer-2-network-hermez","publishDate":"2022-10-10T12:40:20","id":10560,"type":null,"title":"Polygon launches testnet for Layer 2 network Hermez","category":["LAYER 2S AND SCALING"],"content":["Polygon is launching a public testnet for Ethereum scaling solution Hermez, as the race for a dominant Ethereum Layer 2 solution gets underway.","Polygon acquired the Ethereum Layer 2 scaling solution Hermez late last year for <a href=\"https:\/\/www.theblock.co\/post\/114479\/polygon-hermez-merger-matic-hez-tokens-ethereum-projects\" data-v-f87c67ca=\"\">$250 million.<\/a> Hermez runs on top of Ethereum and boosts its scalability by allowing it to process more transactions for a cheaper price. This is the first time anyone will be able to test out the new network.","Hermez is a type of Layer 2 scaling solution known as a zkEVM, which offers benefits that other Layer 2s do not, mainly around security and application customization.","“It was widely believed that zkEVM will take several more years to ship, which makes this an even more groundbreaking milestone, not only for Polygon but for the whole Web3 industry,” said Polygon Co-founder Mihailo Bjelic.","ZkEVMs enhance all the benefits of Layer 2s, while allowing developers to create Zero Knowledge (ZK) applications using the industry standard coding language Solidity. What this means is that applications and developers receive all the security and scaling benefits of ZK provides, without having to learn a new coding language.","Upon launch, DeFi protocols such as Aave and Uniswap will be deployed on the testnet. This will allow these protocols and users to experiment with Hermez. It also enables the teams behind Aave and Uniswap to test for bugs that could occur, well ahead of the mainnet launch.","“Ultimately, Polygon zkEVM is the next step in Ethereum’s journey, and we are moving towards giving our users the full benefits of a working zkEVM — scalability without compromise. We have some work to do before we fully achieve those goals, and we’re eager to find out exactly what needs improvement and receive feedback,” said Polygon Hermez Co-founder David Schwartz.","Polygon stated that all applications, tools, and user wallets built on its Polygon proof-of-stake network will work on Hermez.","This announcement comes right before zkSync will be launching its mainnet on Oct. 28.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mihailo Bjelic","content":"PERSON"},{"type":"Hermez","content":"ORGANIZATION"},{"type":"Polygon Hermez","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Oct. 28","content":"DATE"},{"type":"David Schwartz","content":"PERSON"},{"type":"Polygon zkEVM","content":"ORGANIZATION"}],"hashtag":["POLYGON"],"authors":["Mike Truppa","The Block"]}