{"summary":"Mythical Games Buys 3D Gaming Platform Polystream, which allows users to stream real-time 3D content and engage with content without downloading it. Mythical Games Buys 3D Gaming Platform Polystream","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130635\/mythical-games-acquires-3d-gaming-platform-polystream","publishDate":"2022-01-18T18:12:53","id":1056,"type":null,"title":"Mythical Games acquires 3D gaming platform Polystream","category":["GAMING AND METAVERSE"],"content":["Play-to-earn gaming company Mythical Games has acquired interactive streaming platform Polystream.","Polystream allows users to stream real-time 3D content and engage with it without downloading it. The idea is that this approach would enable players on more devices to instantly enjoy the game without needing any additional updates when content changes.","The acquisition of Polystream brings the total number of Mythical employees to over 200. In November 2021, Mythical raised a series C of $150m at a $1.25b valuation, led by Andreessen Horowitz, as The Block previously <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123306\/gaming-startup-mythical-games-raises-150-million-in-series-c-round-led-by-a16z\" data-v-f87c67ca=\"\">reported<\/a>. The terms of the deal were not disclosed.&nbsp;","Polystream, headquartered in Guildford UK, will provide Mythical with a European hub, and Polystream co-founders Bruce Grove and Adam Billyard will be a part of the senior leadership team.","“I believe the combination of the Mythical Platform and Polystream’s revolutionary approach to command streaming fulfills massive components of the web3 ideology referred to as the ‘Metaverse’,” said John Linden, CEO of Mythical Games, in a statement. &nbsp;“Mythical now has not only the economic engine but a proprietary, patented streaming tech stack to deliver these incredible 3D worlds in a matter of seconds across nearly any platform.\"","Interest in NFT games soared last summer after the success of <a href=\"https:\/\/www.theblockcrypto.com\/post\/119521\/axie-infinity-nft-series-b-funding-a16z\" data-v-f87c67ca=\"\">Axie Infinity<\/a>, an NFT-based play-to-earn game. The Block’s data shows $215 million earned in weekly trade volume at its peak in August.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/gaming-nft-trade-volume\/embed\" title=\"Gaming NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Guildford UK","content":"LOCATION"},{"type":"Polystream","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bruce Grove","content":"PERSON"},{"type":"John Linden","content":"PERSON"},{"type":"Adam Billyard","content":"PERSON"},{"type":"$1.25","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$150m","content":"MONEY"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"$215 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}