{"summary":"Former President Donald Trump is back with another set of digital trading cards for sale. The first set sold out quickly.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226941\/donald-trump-digital-trading-cards-collection-nft","publishDate":"2023-04-18T14:24:54","id":10566,"type":null,"title":"Donald Trump releases latest &#x27;Trump Digital Trading Cards&#x27; collection","category":["MARKETS"],"content":["Donald Trump, fresh from his indictment by a New York grand jury, just dropped a second series of his NFT collection.&nbsp;","The first digital trading cards were released in December and sold out in a matter of hours. The collection then<a href=\"https:\/\/www.theblock.co\/post\/224229\/donald-trump-indictment-nft-trading-card-sales\" data-v-f87c67ca=\"\"> spiked more than 500%<\/a> following news that the former president was indicted by a New York grand jury last month. The floor price, the cost of the cheapest NFT in the collection, rose to about 0.58 ether, or $1,000, at the time.&nbsp;","Trump announced the new series on his social media platform, Truth Social. Like the first set, it features stylized images of Trump as a rock star, the King of hearts on a playing card and even George Washington crossing the Delaware River.&nbsp;","\"I am pleased to inform you that, due to the great success of my previously launched DIGITAL TRADING CARDS, we are doing it again,\" Trump wrote, sharing a <a href=\"https:\/\/collecttrumpcards.com\/\" data-v-f87c67ca=\"\">link to the news collection<\/a> and urging followers to \"Have fun!\"","Made up of 45,000 NFT trading cards, it<a href=\"https:\/\/www.theblock.co\/post\/195680\/donald-trump-nft-collection-sells-out-within-hours\" data-v-f87c67ca=\"\"> sold out<\/a> within hours — racking up about&nbsp;648 ether, or $785,000, in trading volume in the first 24 hours, according to OpenSea data.&nbsp;","The initial mint price was also set at $99. Buying anything from the collection automatically entered the owner into a sweepstake. Prizes included a group cocktail party at Mar-A-Lago, a dinner in Miami or a golfing trip with the former president, or even a group Zoom call.&nbsp;","The collection was launched on Polygon, one of the most attractive networks for NFTs. <a href=\"https:\/\/www.theblock.co\/post\/226809\/starbucks-polygon-new-nft-collection\" data-v-f87c67ca=\"\">Starbucks launched<\/a> another NFT collection on Polygon today.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delaware River","content":"LOCATION"},{"type":"$99","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$785,000","content":"MONEY"},{"type":"Miami","content":"LOCATION"},{"type":"$1,000","content":"MONEY"},{"type":"Truth Social","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"500%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"George Washington","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"}],"hashtag":["NFT ARTISTS","TRADING CARD GAMES"],"authors":["Adam Morgan McCarthy","The Block"]}