{"summary":"Decentralized finance (DeFi) lending protocol Warp Finance, which lost $7.7 million last week in a flash loan attack, has recovered 75% of the funds or about $5.85 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88645\/defi-protocol-warp-finance-recovered-funds-flash-loan-attack","publishDate":"2020-12-21T02:45:06","id":10565,"type":null,"title":"DeFi protocol Warp Finance says it has recovered 75% of stolen funds, about $5.85 million","category":["DEFI"],"content":["Decentralized finance (DeFi) lending protocol Warp Finance, which lost $7.7 million last week in a flash loan attack, has recovered 75% of the funds or about $5.85 million.","Announcing the update on Sunday, Warp <a href=\"https:\/\/warpfinance.medium.com\/warp-finance-exploit-summary-recovery-of-funds-5b8fe4a11898\" data-v-f87c67ca=\"\">said<\/a> it regained the funds in the form of ETH\/DAI LP tokens, i.e., Uniswap liquidity provider tokens consisting of ether and DAI deposits. The funds, however, were lost in DAI and USDC stablecoins.","\"The reason we have chosen to return LP tokens instead of stablecoins is that these are the tokens we've been able to recover,\" said Warp. It did not explain how, specifically, the funds were recouped. Last week, Warp did say <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88415\/defi-warp-finance-attacked-lost-7-7-million-stablecoins\" data-v-f87c67ca=\"\">approximately $5.5 million<\/a> are \"still secured in the collateral vault.\" The Block has reached out to Warp to learn more about the recovery and will update this story should we hear back.","According to The Block's research analyst Igor Igamberdiev, Warp could recover the funds because it transferred admin rights of its smart contract to one of its externally-owned addresses. That allowed Warp to use the \"LiquidateAccount\" function and liquidate the attacker's position. Warp couldn't use this function right after the attack because of a two-day timelock on admin updates, said Igamberdiev.","So, if Warp can control and liquidate user funds, how does that make it \"decentralized?\" The situation is indeed \"pretty dangerous,\" said Igamberdiev, adding that Warp still hasn't begun the process for returning admin rights to its smart contract.","That means if any of Warp's developers acts maliciously, they could liquidate funds of users who have open positions in Warp. Currently, the protocol is suspended and is preparing to relaunch.","As for reimbursement of the recovered funds, Warp said it will distribute the amount to affected users within 24 hours, in proportion to the amount of wUSDC and wDAI held at the time of the attack.","Warp said it will also issue \"Portal IOU ['i owe you'] tokens\" to affected users to make them whole, details of which will be shared \"in the coming days.\"","<em data-v-f87c67ca=\"\">Update: This story has been updated with additional information and comments from The Block's research analyst Igor Igamberdiev.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"Warp","content":"ORGANIZATION"},{"type":"$7.7 million","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"},{"type":"$5.85 million","content":"MONEY"},{"type":"DAI LP","content":"ORGANIZATION"},{"type":"Warp","content":"LOCATION"},{"type":"Warp Finance","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$5.5 million","content":"MONEY"},{"type":"Igamberdiev","content":"PERSON"},{"type":"Igor Igamberdiev","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}