{"summary":"“Stablecoins: Bridging the Network Gap Between Traditional Money and Digital Value” aspires to serve as a foundational text, for not only digital asset practitioners and enthusiasts, but financial services professionals and global policymakers as well. Although some progress has been made over the past several years toward linking the traditional financial system and the burgeoning digital assets ecosystem, there is still significant work ahead for all stakeholders. This ten-part research report, commissioned by GMO-Z.com Trust Company (GMO Trust), examines one of the fastest growing digital money innovations of the next Web: stablecoins.   This white paper will be available for download on March 10th. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97550\/stablecoins-bridging-the-network-gap-between-traditional-money-and-digital-value","publishDate":"2021-03-08T21:30:29","id":10577,"type":null,"title":"Stablecoins: Bridging the Network Gap Between Traditional Money and Digital Value | Coming March 10th","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">“Stablecoins: Bridging the Network Gap Between Traditional Money and Digital Value” aspires to serve as a foundational text, for not only digital asset practitioners and enthusiasts, but financial services professionals and global policymakers as well. Although some progress has been made over the past several years toward linking the traditional financial system and the burgeoning digital assets ecosystem, there is still significant work ahead for all stakeholders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block Research believes that independent research and quality content backed by data can help cut through the noise of the Information Age: put simply, the world today is drowning with information, but starving for wisdom. This ten-part research report, commissioned by <strong data-v-f87c67ca=\"\">GMO-Z.com Trust Company (GMO Trust)<\/strong>, examines one of the fastest growing digital money innovations of the next Web: stablecoins.<\/span>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This white paper will be available for download on March 10th.&nbsp;<\/strong><\/em>"],"entity":[{"type":"Network Gap Between Traditional Money and Digital Value","content":"ORGANIZATION"},{"type":"GMO","content":"ORGANIZATION"},{"type":"March 10th","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}