{"summary":"Hoping to deliver on the promise of web3 gaming interoperability, Immutable launches a new tool meant to ease adoption.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268487\/immutable-launches-interoperable-tool-across-multiple-video-games-and-marketplaces","publishDate":"2023-12-19T17:02:16","id":1057,"type":null,"title":"Immutable launches interoperable tool across multiple video games and marketplaces","category":["GAMING"],"content":["Blockchain gaming company Immutable has announced the launch of its \"Passport\" tool geared towards increasing interoperability.","Immutable's Passport tool is designed to simplify \"the sign-up process for players by providing them with a universal profile that enables them to carry their identity, achievements, and digital assets across different online games and marketplaces,\" according to a statement.&nbsp;","Initially, the tool, meant to deliver on the promise of interoperability, is available across five gaming titles and marketplaces with more than 500,000 users, the company also said. Those games and marketplaces include \"<a href=\"https:\/\/www.theblock.co\/post\/235894\/web3-game-gods-unchained-joins-fortnite-league-of-legends-on-epic-games-store\" data-v-f87c67ca=\"\">Gods Unchained<\/a>,\" \"Blocklete Golf,\" \"Bleacher Report Watch2Earn,\" TokenTrove, and AtomicHub, according to the statement.","Although unclear how players will use digital assets between games like \"Gods Unchained\" a digital, trading card game populated by mythical characters, and \"Blocklete Golf,\" a strategy golf game, <a href=\"https:\/\/www.theblock.co\/post\/266840\/imx-token-surges-as-vaneck-says-release-of-new-blockchain-based-video-games-like-illuvium-next-year-could-boost-value\" data-v-f87c67ca=\"\">Immutable<\/a> appears to think that its Passport tool can foster a better gaming experience.","\"Ask any web3 game or marketplace about the biggest barrier to adoption, and they'll talk about user acquisition,\" Immutable President and co-founder Robbie Ferguson said in a statement. \"[Passport] increases user acquisition, optimizes transaction conversion rates, and gives players a smooth, seamless experience that enables them to explore new worlds and participate in new economies.\"","So far the web3 gaming arena remains in a <a href=\"https:\/\/www.theblock.co\/post\/242648\/billion-dollar-crypto-vc-says-defi-style-tokens-and-fun-could-boost-gaming\" data-v-f87c67ca=\"\">developmental stage<\/a>. with various projects aspiring to build robust and engaged communities on par with traditional gaming platforms that host millions, if not tens of millions, of players each month. While most companies focus on crafting popular titles that operate independently of other games, Immutable is attempting to build an interoperable gaming universe.","\"If you want to alienate gamers, ask them to create a wallet every time they sign up and tell them they can't take their assets or achievements with them from game to game,\" Daniel Paez, vice president and executive producer of \"Gods Unchained\" said in the statement. \"This has long been a major obstacle to widespread web3 adoption, not just for gaming but for a range of applications.\"","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Daniel Paez","content":"PERSON"},{"type":"Robbie Ferguson","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["TRADING CARD GAMES"],"authors":["RT Watson","The Block"]}