{"summary":"The proposal calls for the creation of a Uniswap Foundation to be seeded with a $74 million budget and 2.5 million UNI tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161551\/uniswap-labs-alum-propose-creating-uniswap-foundation-to-boost-exchange","publishDate":"2022-08-04T13:32:40","id":10578,"type":null,"title":"Uniswap Labs alum proposes Uniswap Foundation to boost exchange","category":["DEFI"],"content":["Two Uniswap community members have submitted a governance <a href=\"https:\/\/gov.uniswap.org\/t\/temperature-check-create-the-uniswap-foundation\/17358\" data-v-f87c67ca=\"\">proposal<\/a> to create the Uniswap Foundation, an entity tasked with growing the decentralized crypto exchange’s ecosystem.","The Uniswap Foundation will be a Delaware-based corporation founded by Devin Walsh and Ken Ng, according to the proposal <a href=\"https:\/\/gov.uniswap.org\/t\/temperature-check-create-the-uniswap-foundation\/17358\" data-v-f87c67ca=\"\">document<\/a> published on Thursday.&nbsp;Walsh will serve as the executive director while Ng will helm the foundation’s operations.","Uniswap is the largest decentralized exchange (DEX) in the crypto space. The platform accounts for almost two-thirds of the entire DEX market volume, based on figures from <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/dex-non-custodial\/share-of-dex-volume-monthly\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>. The Uniswap DAO also holds the largest treasury of any decentralized autonomous organization in the crypto space with <a href=\"https:\/\/deepdao.io\/organization\/fe6aa70f-4877-4f6d-9c18-9a8cafc1fe28\/organization_data\/finance\" data-v-f87c67ca=\"\">$3.9 billion<\/a> in its reserves, according to DeepDAO.","The Uniswap Foundation will be given a $74 million budget to drive growth, if the proposal is approved. It will award grants to development teams and work to support other ecosystem stakeholders, the proposal document said.","This budget will be split into two: $60 million for an expanded grants program and $14 million to cover operational overheads. The proposal requested that the funds be supplied in two instalments, with the first payment being $20 million and the remaining $54 million delivered later. This budget is expected to provide a three-year runway for the foundation.","Apart from the $74 million, the proposal also calls for the Uniswap Foundation to be given 2.5 million UNI tokens — the minimum number of tokens required to call for an on-chain vote. <a href=\"https:\/\/www.theblock.co\/linked\/77998\/uniswap-goes-live-token-uni\" data-v-f87c67ca=\"\">UNI is Uniswap’s native token<\/a> and this allocation will ensure that the foundation can participate in the platform’s governance process.","<em data-v-f87c67ca=\"\">This article has been updated to reflect that Devin Walsh and Ken Ng are not currently Uniswap Labs executives.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Devin Walsh","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ken Ng","content":"PERSON"},{"type":"$3.9 billion","content":"MONEY"},{"type":"$14 million","content":"MONEY"},{"type":"Walsh","content":"PERSON"},{"type":"Uniswap DAO","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Uniswap Labs","content":"ORGANIZATION"},{"type":"$54 million","content":"MONEY"},{"type":"$74 million","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"}],"hashtag":["UNISWAP"],"authors":["Osato Avan-Nomayo","The Block"]}