{"summary":"Ordinals developers have introduced a way to overcome the 4 MB per block size limitation that the Bitcoin blockchain puts on NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234195\/ordinals-recursive-inscriptions-bitcoin-video-games","publishDate":"2023-06-12T06:56:54","id":10571,"type":null,"title":"Ordinals recursive inscriptions could unlock 3D video games on Bitcoin","category":["PEOPLE"],"content":["Ordinals developers have introduced a method, called recursive inscriptions, to overcome Bitcoin's 4 MB per block size limitation that restricts the size of NFTs.","Previously, inscriptions representing tokens and NFTs on Bitcoin were independent of one another, unaware of other inscriptions. The new feature allows inscriptions to reference the content of other inscriptions using a special syntax. This was <a href=\"https:\/\/github.com\/ordinals\/ord\/pull\/2167\" data-v-f87c67ca=\"\">brought into<\/a> the Ordinals system on June 10.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">This simple change unlocks many powerful use cases,\" <a href=\"https:\/\/twitter.com\/LeonidasNFT\/status\/1668098460766052353\" data-v-f87c67ca=\"\">said<\/a><\/span> pseudonymous developer Leonidas, who's building the Ord.io marketplace for inscriptions.&nbsp;","Focused on on-chain inscriptions on the Bitcoin network, the Ordinals protocol came to prominence <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">earlier<\/a> this year, enabling the creation of BRC-20 tokens and NFTs and causing a <a href=\"https:\/\/www.theblock.co\/post\/232897\/bitcoin-active-users-fees-and-transactions-had-a-wild-ride-in-may-amid-memecoin-mania\" data-v-f87c67ca=\"\">surge<\/a> in Bitcoin transactions and fees on the network.","Recursive inscriptions, however, can enhance efficiency and reduce costs. For example, instead of individually inscribing thousands of JPEG files for a profile picture (PFP) collection, developers can inscribe the collection's traits and programmatically render the images through small amounts of code in subsequent inscriptions.&nbsp;","The approach not only streamlines the storage of artwork on-chain but also presents the opportunity to save on transaction fees. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">The art is just stored on-chain in a much more efficient way, which could have saved over a million dollars in transaction fees in the case of <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\">Bitcoin Apes,\" said Leonidas.<\/span>","Leonidas <a href=\"https:\/\/twitter.com\/LeonidasNFT\/status\/1668098460766052353\" data-v-f87c67ca=\"\">points out<\/a> that recursive inscriptions can also be used to inscribe functioning computer code that anyone can use. NFT project OnChainMonkey has already put code on Bitcoin that it used to create 3D art with less than 1 KB of data. Yet since this code is public, anyone can now use it.","Taking the concept further, combining inscriptions can enable additional functionality beyond the 4 MB Bitcoin block limit. While the size of each inscription wouldn’t exceed this limit, the combined inscription can.","This could lead to use cases including complex 3D video games. Each part of the game's code could be stored in different inscriptions.","Right now there are already very simple games that are stored on Bitcoin and can be interacted with. Some <a href=\"https:\/\/www.ord.io\/?contentType=game\" data-v-f87c67ca=\"\">can be played<\/a> on the Ord.io marketplace.","Beyond this, there could even be an internal internet within Bitcoin. This would effectively transform Ordinal marketplaces and explorers into Bitcoin web browsers, allowing users to surf the blockchain and explore its ecosystem.","Platforms such as the official Ordinals explorer and Ord.io will soon support recursive inscriptions, including any of the various potential use cases.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PFP","content":"ORGANIZATION"},{"type":"Leonidas","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"June 10","content":"DATE"},{"type":"a million dollars","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}