{"summary":"U.S. Financial Industry Regulatory Authority is probing communications of crypto firms following FTX collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188284\/finra-is-investigating-communications-of-crypto-firms","publishDate":"2022-11-18T08:19:13","id":10581,"type":null,"title":"FINRA is investigating communications of crypto firms","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">An American regulatory body has begun an examination of crypto communications practices, following the collapse of the FTX exchange.<\/span>","<span data-v-f87c67ca=\"\">The Financial Industry Regulatory Authority, which regulates member brokerage firms and exchange markets, is asking some companies to “provide all retail communications,” <\/span>according to an announcement <a href=\"https:\/\/www.finra.org\/rules-guidance\/guidance\/targeted-examination-letters\/crypto-asset-communications\" data-v-f87c67ca=\"\">made<\/a> earlier this week.","<span data-v-f87c67ca=\"\">This includes \"video, social media, mobile applications, and websites” within the examination period between the beginning of July and the end of September. Companies will also need to file compliance and training manuals, as well as review and approval processes.&nbsp;<\/span>","The examination includes 20 FINRA member firms, a FINRA spokesperson told The Block.","<span data-v-f87c67ca=\"\">Regulators like FINRA conduct “sweeps,” or targeted examinations like this one, to gather information that is used to “pinpoint a regulatory response to emerging issues,” FINRA’s website says. FINRA’s inquiries are limited to a small number of firms in order to “reduce the regulatory burden on the majority of firms,” the organization added on its website.<\/span>","<span data-v-f87c67ca=\"\">The move toward regulating crypto communication follows a globally watched meltdown of one of the world’s biggest crypto exchanges. FTX and other crypto firms <\/span><a href=\"https:\/\/www.theblock.co\/linked\/134070\/coinbase-ftx-make-super-bowl-debut-commit-to-giving-away-crypto\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">dominated<\/span><\/a><span data-v-f87c67ca=\"\"> advertising at the Super Bowl earlier this year, targeting retail users.<\/span>","<em data-v-f87c67ca=\"\">This story was updated with the number of firms confirmed by FINRA.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}