{"summary":"Transactions of tokens on the Bitcoin network overtook the number of regular bitcoin transactions for two days running.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229190\/memecoins-bitcoin-brc20-transactions-fees","publishDate":"2023-05-03T05:14:09","id":10586,"type":null,"title":"Bitcoin-based token activity overtakes regular transactions on the network","category":["LAYER 1S"],"content":["Transactions of tokens on the Bitcoin network overtook the number of regular bitcoin transactions for two days running.","Bitcoin-based tokens is a largely novel phenomena. First came Ordinals, a project for issuing NFTs on Bitcoin. The principle behind that was then used to create a standard for tokens on Bitcoin called BRC-20. This standard was used to issue tokens like ordi, pepe and meme. Now these tokens are taking off and massively driving up activity on the network.","\"So far, over 8,500 different tokens have been minted,\" <a href=\"https:\/\/twitter.com\/CryptoKoryo\/status\/1653531673768624128\" data-v-f87c67ca=\"\">said<\/a> a pseudonymous crypto trader and analyst known as crypto koryo on Twitter.","\"BRC-20's novelty lies partly in its perceived security on the Bitcoin blockchain,\" they added. \"Communities form around tokens with shared incentives, and everyone has a fair shot at minting. Despite technical flaws, and the meme-centric nature of it, growth continues, for now.\"","The BRC-20 standard lets anyone issue nonfungible (like NFTs) and fungible tokens on Bitcoin by relying on bits of metadata added to individual satoshis, the smallest unit of bitcoin.","Between April 29 and May 2, transactions involving tokens using the BRC-20 token standard — a standard used for tokens built on Bitcoin — accounted for 42%-54% of all transactions on the Bitcoin blockchain. This excludes bitcoin transactions made on the Lightning network.","May 1 saw the largest share of Bitcoin's block space dedicated to BRC-20 tokens at 53.7%, <a href=\"https:\/\/dune.com\/cryptokoryo\/brc20\" data-v-f87c67ca=\"\">according<\/a> to crypto koryo's data.","<span data-v-f87c67ca=\"\">BRC-20 tokens have taken up more block space on the Bitcoin network in recent days. Source: Dune \/ @cryptokoryo<\/span>","Alongside an increased percentage of BRC-20 transactions comes an increase in fees generated by the token standard.","BRC-20 fees over time have gone parabolic since late April, peaking at nearly 27.73 bitcoins yesterday. In total, these tokens have resulted in more than 100 extra bitcoin in fees, some $2.8 million, going to miners, boosting their revenues.","<span data-v-f87c67ca=\"\">BRC-20 fees have increased substantially over recent days. Source: Dune \/ @cryptokoryo<\/span>","The Block previously reported that daily transactions on the Bitcoin blockchain reached a <a href=\"https:\/\/www.theblock.co\/post\/228882\/bitcoin-transactions-inscriptions-record\" data-v-f87c67ca=\"\">new all-time high<\/a> on April 29 when tracked using a seven-day moving average. The on-chain metric reached a record high of over 408,000 transactions at the time. It has since surged even higher to nearly 500,000 on May 1, largely driven by this increase in demand for memecoins.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/transactions-on-the-bitcoin-network-daily\/embed\" title=\"Transactions on the Bitcoin Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While memecoin trading is new to bitcoin, it's an everyday occurance on most — if not all — other blockchains. Recently a token also named pepe took off on Ethereum and rose to a $500 million market cap in just two weeks, begging the question whether memecoin trading is crypto's killer app after all.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 1","content":"DATE"},{"type":"May 2","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"54%","content":"PERCENT"},{"type":"42%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"Dune \/ @cryptokoryo","content":"ORGANIZATION"},{"type":"April 29","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"BRC","content":"ORGANIZATION"},{"type":"53.7%","content":"PERCENT"},{"type":"late April","content":"DATE"},{"type":"$2.8 million","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Adam James","Tim Copeland","The Block"]}