{"summary":"As investors pull money out of the broader crypto sector ahead of expected interest rate hikes, Solana, Algorand and Polygon are bucking the trend.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229132\/solana-algorand-polygon-outflows-crypto","publishDate":"2023-05-02T12:42:02","id":10580,"type":null,"title":"Solana, Algorand and Polygon are bright spots amid crypto outflows","category":["COMPANIES"],"content":["Solana, Algorand and Polygon saw minor inflows last week as money poured out of the broader crypto sector ahead of the <a href=\"https:\/\/www.theblock.co\/post\/229014\/crypto-prices-fed-hikes-grayscale\" data-v-f87c67ca=\"\">U.S. Federal Reserve's Wednesday meeting<\/a> on interest rates.&nbsp;&nbsp;","Overall, digital asset investment products saw outflows of $72 million in the week ending April 28, CoinShares said in an emailed report, adding that it believed it was a reaction to the likelihood of further interest rate hikes. That's the second week in a row of declines.","Bitcoin, the largest cryptocurrency by market share, saw the majority of outflows, which totaled $46 million. Ethereum experienced the largest week of outflows since The Merge in September, with investors pulling out $19 million.&nbsp;","","","\"Volumes remain subdued for the broader crypto market,\" CoinShares said, noting that exchange traded product volume of $1.7 billion is 16% above the year average. Investments short on bitcoin also saw outflows of $7.8 million last week, although they remain the winner in terms of year-to-date inflows that have reached $119 million.","The U.S. central bank is expected to increase rates by 25 basis points tomorrow, although the probability that it might keep rates unchanged has risen since yesterday, according to <a href=\"https:\/\/www.cmegroup.com\/markets\/interest-rates\/cme-fedwatch-tool.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CME's FedWatch tool<\/a>. Grayscale <a href=\"https:\/\/www.theblock.co\/post\/229014\/crypto-prices-fed-hikes-grayscale\" data-v-f87c67ca=\"\">said on Monday<\/a> that crypto prices could still benefit even if the Fed hikes rates, as long as the decision aligns with market expectations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$72 million","content":"MONEY"},{"type":"$7.8 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$19 million","content":"MONEY"},{"type":"$119 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"April 28","content":"DATE"},{"type":"September","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$46 million","content":"MONEY"},{"type":"Algorand","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"CoinShares","content":"ORGANIZATION"},{"type":"CME","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}