{"summary":"Troubled crypto derivatives exchange BitMEX and its founders are facing another lawsuit that alleges racketeering, money laundering, and market manipulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81482\/bitmex-and-founders-face-another-lawsuit-alleging-money-laundering-and-market-manipulation","publishDate":"2020-10-16T13:10:32","id":10592,"type":null,"title":"BitMEX has been hit with another lawsuit alleging market manipulation","category":["LEGAL"],"content":["Troubled crypto derivatives exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/69617\/former-bitmex-coo-joins-board-of-deribit-investor-group\" data-v-f87c67ca=\"\">BitMEX<\/a> and its founders are facing another lawsuit that alleges racketeering, money laundering, and market manipulation.","Dmitry Dolgov, a resident of Moscow, Russia, <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2020\/10\/new_BitMEX_lawsuit-1.pdf\" data-v-f87c67ca=\"\">filed the lawsuit<\/a> in the Northern District of California on Wednesday. He alleges that HDR Global Trading Limited, the parent company of <a href=\"https:\/\/www.theblockresearch.com\/a-look-at-bitmex-futures-volume-41860\" data-v-f87c67ca=\"\">BitMEX<\/a>, the exchange's founders Arthur Hayes, Ben Delo, and Samuel Reed and others, engaged in and facilitated racketeering activities, \"earning Defendants billions of dollars in illicit profits.\"","The complaint comes two weeks after <a href=\"https:\/\/www.theblockcrypto.com\/post\/64901\/bitmex-amended-lawsuit-540-million\" data-v-f87c67ca=\"\">BitMEX<\/a> and its founders <a href=\"https:\/\/www.theblockcrypto.com\/linked\/79483\/cftc-bitmex-charges-lawsuit\" data-v-f87c67ca=\"\">were hit with legal charges by<\/a> the Commodity Futures Trading Commission (CFTC) and the Department of Justice (DOJ). And in a separate lawsuit filed in May, the Puerto Rican company BMA LLC similarly <a href=\"https:\/\/www.theblockcrypto.com\/post\/65618\/bitmex-accused-of-money-laundering-market-manipulation-in-new-lawsuit\" data-v-f87c67ca=\"\">accused<\/a> <a href=\"https:\/\/www.theblockresearch.com\/analysis-bitmexs-insurance-fund-now-holds-over-200-million-23914\" data-v-f87c67ca=\"\">BitMEX<\/a> of engaging in racketeering, money laundering, and market manipulation.","The new 188-page lawsuit claims that the defendants sidestepped know your customer (KYC) or anti-money laundering (AML) requirements and accepted \"unlimited funds from anyone, without a single question asked.\" Due to this lack of oversight, \"hackers, tax evaders, money launderers, smugglers, drug dealers all flocked to BitMEX flooding the platform with hot money,\" the lawsuit claims.","Dolgov's lawsuit also claims that \"BitMEX directly participates in and financially benefits from the market manipulation and money laundering through its internal trading desk and indirectly,\" and describes a specific example of how this occurs:","\"A money launderer (Defendants) would open two exchange accounts – a helper account on one or more exchanges used by BitMEX to calculate its index price (Coinbase Pro, Kraken and BitStamp) and a winner account on BitMEX,\" the lawsuit explains. \"The money launderer (Defendants) would then enter into a large leveraged derivatives position on BitMEX and immediately execute market orders from the helper account with maximum slippage to move the index price in a favorable direction.\"","Dolgov claims that he suffered \"significant damages\" in an amount to be proven at trial. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPavel Pogodin of Consensus Law, the plaintiff's attorney, told The Block: \"We are seeking compensatory damages in the amount to be proven at trial and $50,000,000 in punitive damages.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA <a href=\"https:\/\/www.theblockcrypto.com\/post\/79836\/stephen-palley-gives-an-in-depth-look-at-the-bitmex-charges-and-what-it-could-mean-for-defi-regulation\" data-v-f87c67ca=\"\">BitMEX<\/a> spokesperson told The Block: \"This is yet another 'copy and paste' nuisance filing by Pavel Pogodin of 'Consensus Law' based on rehashed information culled from the internet. As with his other claims against us, we will deal with this through the normal litigation process and remain entirely confident the courts will see his claims for what they are.\"","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Update: This story has been updated to include comments from Pavel Pogodin of Consensus Law, the plaintiff's attorney, and a BitMEX spokesperson.&nbsp;<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Northern District of California","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Defendants billions of dollars","content":"MONEY"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Samuel Reed","content":"PERSON"},{"type":"Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"HDR","content":"ORGANIZATION"},{"type":"Ben Delo","content":"PERSON"},{"type":"Moscow","content":"LOCATION"},{"type":"Dmitry Dolgov","content":"PERSON"},{"type":"Puerto Rican","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"Pavel Pogodin","content":"PERSON"},{"type":"BMA LLC","content":"ORGANIZATION"},{"type":"$50,000,000","content":"MONEY"}],"hashtag":["BITMEX","LAWSUITS"],"authors":["Yogita Khatri","The Block"]}