{"summary":"Bitcoin&#x27;s price is at a standstill, locked in a tight trading range around the $29,000 mark, with volatility at yearly lows.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243705\/bitcoin-price-stagnant-while-smaller-tokens-see-greater-volatility","publishDate":"2023-08-08T11:46:12","id":10590,"type":null,"title":"Bitcoin price stagnant while smaller tokens see greater volatility","category":["MARKETS"],"content":["The crypto market is experiencing \"a volatility migration\" to fringe tokens, such as Livepeer and <a href=\"https:\/\/www.theblock.co\/post\/213460\/nft-project-0n1-force-bought-out\" data-v-f87c67ca=\"\">Yield Guild Games<\/a>, according to one analyst.","\"A volatility migration is afoot as majors stagnate or slide lower, while lesser-known altcoins such as Livepeer (LPT) and Yield Guild Games (YGG) have successive days of geometric gains and, in the case of YGG, a spectacular over 75% sell off in just hours,\" said Gordon Grant, head of trading and sales at Genesis Trading. ","\"It appears the liquidity generated from the surge in large-cap tokens in 2023 is now flowing into fringe markets with explosive impact,\" Grant added.","Livepeer, the native token of a decentralized video streaming platform, saw its price rise 33.9% in the past week, before dropping 3% in the past day to $5.35. Yield Guild Games (YGG) saw a 75% sell off in the past day, after spiking over 94% in the past week, now at $0.35, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/yield-guild-games\" data-v-f87c67ca=\"\">CoinGecko<\/a>. Blockchain sleuths noted that <a href=\"https:\/\/www.theblock.co\/post\/234525\/dwf-labs-and-tron-reach-strategic-partnership-to-strengthen-ecosystem-support\" data-v-f87c67ca=\"\">DWF Labs<\/a> transferred large amounts of YGG tokens to exchanges, suggesting they may have sold some tokens.","While fringe tokens have seen an increase in volatility, Bitcoin has faced the opposite. Bitcoin's price is at a standstill, locked in a tight trading range around the $29,000 mark, with trade volume at a yearly low and volatility metrics showing a multi-year low.&nbsp;","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">In July, centralized crypto exchanges saw a 12% drop in combined spot and derivatives trading volume to $2.36 trillion, marking the year's lowest reading, according to a CCData <a href=\"https:\/\/ccdata.io\/reports\/exchange-review-july-2023\" data-v-f87c67ca=\"\">report<\/a>. <\/span>\"The decrease in trading volumes can be attributed to the lack of volatility in the price action of major crypto assets, with Bitcoin and Ethereum largely trading in a narrow range throughout July,\" the report added.","But this volatility may not last for long. Analysts at Bitfinex claimed that bitcoin \"stands on the brink of an impending supply crunch,\" according to this week's <a href=\"https:\/\/blog.bitfinex.com\/wp-content\/uploads\/2023\/08\/Bitfinex-Alpha-66.pdf\" data-v-f87c67ca=\"\">Bitfinex Alpha<\/a> report.","\"Recent data reveals that a staggering 69.2% of the total Bitcoin supply has remained untouched for over a year. With a significant chunk of Bitcoin's supply remaining inactive, the available supply in the market diminishes. This inherent scarcity, juxtaposed with a burgeoning demand, has the potential to drive prices upward,\" Bitfinex analysts claimed.","Bitcoin has primarily traded in the range of $29,000 to $30,000 since July 24. The digital asset was up a modest 1% in the past 24 hours, changing hands for $29,358 at 10:00 a.m. ET, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Yield Guild Games","content":"ORGANIZATION"},{"type":"Gordon Grant","content":"PERSON"},{"type":"3%","content":"PERCENT"},{"type":"$30,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"33.9%","content":"PERCENT"},{"type":"69.2%","content":"PERCENT"},{"type":"July 24","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"$2.36 trillion","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"94%","content":"PERCENT"},{"type":"$0.35","content":"MONEY"},{"type":"10:00 a.m. ET","content":"TIME"},{"type":"$5.35","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$29,358","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"$29,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","CRYPTO","MEMECOINS"],"authors":["Brian McGleenon","The Block"]}