{"summary":"Cascading liquidations have become a common occurrence. But can the exchanges do something?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126576\/can-exchanges-do-something-about-cascading-liquidations","publishDate":"2021-12-09T14:24:44","id":10598,"type":null,"title":"Can exchanges do something about cascading liquidations?","category":["EXCHANGES"],"content":["It's a cycle that's played out several times in the crypto market: cascading liquidations triggered by an over-heated and over-levered retail market.&nbsp;","That's exactly what unfolded over the weekend. Large institutional selling on Friday kicked off a wave of cascading liquidations that saw a record $1.8 billion in liquidations and more than 375,000 in total liquidations.&nbsp;","Ahead of the crash, open-interest across futures platforms stood close to all-time highs above $23 billion. Investors were bullish too with the long\/short ratio on Binance hitting 5.7 on December 4.","","","Fueling the activity was an over-levered retail market, traders tell The Block. Leverage allows traders to trade with borrowed money, amplifying profits on the upside but also losses on the downside. While crypto exchanges have cut the leverage offered to clients, there's still a lot of leverage in the retail system, according to GSR's co-founder Richard Rosenblum.&nbsp;","The former Goldman Sachs oil trader told The Block that the proportion of retail trader using leverage is higher in crypto than in traditional markets. In a drawdown, crypto futures traders can be liquidated or closed out of their position because of losses in their initial margin.&nbsp;","Those losses can force traders to sell even more crypto, thus amplifying the effect of the liquidations, thereby causing more liquidations.&nbsp;","Traders should expect this to continue to happen in the future thanks to three unique features of crypto, according to Rosenblum.&nbsp;","\"(1) having a much higher volatility (2) lacking circuit breaks (3) and a market that never closes,\" he said.&nbsp;","The 24\/7 nature of the crypto market mixed with the lack of guardrails imposed by exchanges means that traders have less time to digest information in the same way as traditional markets.&nbsp;","US equity markets instituted circuit breakers in the wake of 1987's Black Monday event when the Dow plunged by more than 22.6% — the largest one-day percentage drop in history at the time.&nbsp;","It's unlikely that exchanges off-shore will implement circuit breakers given that it's a contradiction of the ethos of crypto's open nature. Still, some venues have considered certain restrictions to prevent the market from spiraling. Last year, one executive told The Block his firm was exploring possible limits to prevent one actor from driving the market (which market participants suspect happened Friday). Here's a passage from the conversation:","\"You could have a market cool down period. Let's say someone eats up 5% of the order book, then that market participant would have a 5% cool down. We might&nbsp;implement in the future. There are a lot of participants that want to trade&nbsp;aggressively and fast. As&nbsp;soon as you put in cool down periods and circuit&nbsp;breakers, and we become at outlier, it could hurt the business.\"","Another executive, speaking on background, agreed: \"It hurts business. And it is game theory. No exchange wants circuit breaks because business will move elsewhere.\"","Still, some exchanges have taken measures to set up guardrails in their market. Coinbase, for instance, says it may \"at its discretion\" initiate an auction after pausing trading in an asset depending on market conditions to \"ensure a fair and orderly market.\"","There could be some alternative solutions. Paradigm, the crypto derivatives platform, is building off-exchange liquidation auctions that will manage liquidations off of the main order book to dampen their impact on the broader market.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GSR","content":"ORGANIZATION"},{"type":"Richard Rosenblum","content":"PERSON"},{"type":"Rosenblum","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"$23 billion","content":"MONEY"},{"type":"1987","content":"DATE"},{"type":"$1.8 billion","content":"MONEY"},{"type":"December 4","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"22.6%","content":"PERCENT"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}