{"summary":"Carbon has partnered with Wyre to provide the crypto community with robust fiat-to-crypto rails\nThe startup was accepted as a member of Y Combinator’s 2020 batch and is now exploring products outside of the crypto market ","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55090\/y-combinator-backed-carbon-partners-with-wyre-as-the-startup-experiments-with-markets-outside-of-crypto","publishDate":"2020-02-06T15:38:45","id":1059,"type":null,"title":"Y Combinator-backed Carbon partners with Wyre as the startup experiments with markets outside of crypto","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">Crypto startup Carbon has partnered with payments provider Wyre to offer users robust fiat-to-crypto rails.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Carbon aims to help payment companies instantly onboard crypto users via its API or widget. The firm recently launched a beta version of its exchange processing gateway to enable large crypto exchanges to process credit and debit cards for a reduced fee, Carbon CEO Sam Trautwein told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Right now, the firm mainly works with clients within the E.U. With its Wyre partnership, however, Carbon will gain access to Wyre’s core infrastructure and start bringing its product to U.S. users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Trautwein, users expect more options when it comes to crypto payment, and developers should make sure that their applications support as many assets, countries, and rails as possible.<\/span>","<span data-v-f87c67ca=\"\">“Historically, most of the money in crypto is moved by money wire, but most consumers globally have never sent a money wire,” he said. “In terms of building an API and a widget that supports a variety of rails and jurisdictions, there aren’t many groups with a robust offering.”<\/span>","<span data-v-f87c67ca=\"\">Trautwein sees its partnership with Wyre as a stepping stone towards massively reducing the amount of friction and cost for blockchain developers to onboard users. Specifically, he believes that for the sector to keep growing, fees have to come down.<\/span>","<span data-v-f87c67ca=\"\">“If you look at the cost for buying crypto via credit cards, it shouldn’t be anywhere close to 10%,” he said. “Our credit card processing fees are 3% and we guarantee that our price will be within 3% of spot.”<\/span>","<span data-v-f87c67ca=\"\">But Carbon does not plan on limiting its future businesses to the crypto market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Oct. 2019, the startup was accepted as a member of Y Combinator’s 2020 batch and is now building new products alongside non-crypto payment firms like Stripe and Brex. According to Trautwein, Carbon’s next product will leverage the team’s experience and tech stack to target a market outside of crypto.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I don’t think that the company that dominates crypto payments will only be doing crypto in five years,” he said. “We have a lot of respect for Y Combinator’s role in helping build companies like Stripe, Brex, and Plaid. We could benefit from having people around us who have helped scale very large payment companies.”<\/span>"],"hashtag":[]}