{"summary":"Sushi DAO will split its DAO governance and protocol administration among three new entities.\nThese entities will be based in Panama and the Cayman Islands and will act as a new legal structure for the project.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179986\/sushi-dao-agrees-to-implement-a-new-corporate-legal-structure","publishDate":"2022-10-26T09:00:50","id":106,"type":null,"title":"Sushi DAO agrees to implement a new corporate legal structure","category":["Governance"],"content":["Sushi DAO, the community that oversees the decentralized exchange project SushiSwap, has <a href=\"https:\/\/snapshot.org\/#\/sushigov.eth\/proposal\/bafkreibawm6u4tsq4e5lqwz5yo3rg2k4p6upg5eqaeen33ghmuwxttiaqm\" data-v-f87c67ca=\"\">voted<\/a> in favor of a new legal structure that will create three new entities to manage the DAO and the protocol.","Currently, SushiSwap’s administration is split between a DAO made up of community members with voting powers and a project team that maintains the protocol. Under this new arrangement, three new entities will be created: a Cayman Island-based DAO foundation, a Panamanian foundation, and a Panamanian corporation.","The Sushi DAO voted unanimously in favor of the plan. Participants with a total of 11 million voting tokens expressed their support for the new legal structure. Previous comments on the SushiSwap forum stated that the new structure was a way to compartmentalize risk across the three entities since they handle different aspects of the SushiSwap product stack.","SushiSwap’s new DAO foundation will oversee the governance duties usually carried out by a typical DAO. These include administering the treasury, facilitating governance proposals, and on-chain voting, as well as distributing grants to recipients. The DAO foundation may end up being run by <a href=\"https:\/\/www.theblock.co\/post\/178658\/sushiswap-weighs-new-dao-structure-that-uses-non-transferable-shares\" data-v-f87c67ca=\"\">Meiji DAO<\/a>, a new governance architecture under consideration by the community.","The Panamanian entities will oversee the protocol itself. According to a previous governance <a href=\"https:\/\/forum.sushi.com\/t\/recommendation-for-sushi-legal-structure\/11158\/17\" data-v-f87c67ca=\"\">proposal<\/a>, the Panamanian foundation will look after SushiSwap’s smart contracts while the Panamanian corporation will maintain the protocol’s front end. The governance proposal also stated that the Panamanian foundation will act as the parent company of the Panamanian corporation.","Jared Grey, <a href=\"https:\/\/www.theblock.co\/post\/174392\/sushi-dao-votes-jared-grey-as-new-head-chef\" data-v-f87c67ca=\"\">SushiSwap’s new Head Chef<\/a>, told The Block that the project sought advice from Silicon Valley law firm Fenwick &amp; West before crafting this new structure. The move comes at a time when DAOs have fallen under <a href=\"https:\/\/www.theblock.co\/post\/173171\/a-crypto-lawyer-dissects-the-impact-of-the-cftc-targeting-daos\" data-v-f87c67ca=\"\">scrutiny<\/a> from regulators in the U.S. In September, Ooki DAO became the first DAO to be the <a href=\"https:\/\/www.theblock.co\/post\/172274\/cftc-files-lawsuit-against-decentralized-autonomous-organization\" data-v-f87c67ca=\"\">subject of a lawsuit<\/a> from the U.S. Commodity Futures Trading Commission.","With the vote passing, the SushiSwap team now has four weeks to establish the three new entities. All three entities will also enter into service agreements with selected service providers. The Sushi DAO will hold a vote at a future date to select these service providers, the proposal stated."],"hashtag":[]}