{"summary":"Smart contract developers may need to design reset possibilities to allow termination or interruption of transactions, raising concerns for the crypto industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219590\/eu-parliament-passes-smart-contract-regulation-under-data-act","publishDate":"2023-03-14T07:49:30","id":1060,"type":null,"title":"EU Parliament passes smart contract regulation under Data Act","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Smart contracts are one step closer to falling under European Union-wide regulation within a broader strategy on data markets, an issue that continues to raise concerns within the crypto industry. <\/span>","<span data-v-f87c67ca=\"\">The European Parliament adopted legislation under the Data Act on Tuesday, with 500 votes in favor and 23 against.<\/span>","<span data-v-f87c67ca=\"\">The legislation, and its provisions on smart contracts, is not explicitly aimed at the crypto industry, but focuses on data from connected devices, or the Internet of Things. Yet some in the industry worry the Data Act may have far-reaching effects on crypto if the scope isn’t clearly defined, especially as smart contracts — automated executions written into software — underpin the infrastructure of DeFi.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The greatest potential of the legislation, according to Pilar del Castillo Vera, a centrist-right MEP and rapporteur on the Data Act, is to “contribute to optimizing existing business models and processes, boost the development of new ones, and by doing so creating new values and jobs,” she said, opening Tuesday’s plenary in the European Parliament in Strasbourg.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Smart contracts fall under Article 30 of the Data Act, on “essential requirements regarding smart contracts for data sharing.”<\/span>","<span data-v-f87c67ca=\"\">Provisions include “rigorous access control mechanisms” and protection of trade secrets integrated into the design of smart contracts. There would need to be a possibility to terminate or interrupt transaction mechanisms, and lawmakers will need to decide which conditions would make that permissible.<\/span>","The Parliament removed some of the onerous language from the European Commission’s proposal. For example, smart contract developers would have needed to follow cumbersome compliance processes like issuing an EU declaration of conformity, according to documents previously <a class=\"c-link c-link--focus-visible\" href=\"https:\/\/www.theblock.co\/post\/207994\/eu-smart-contract-regulation-deescalates-parliament-draft\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/207994\/eu-smart-contract-regulation-deescalates-parliament-draft\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">seen<\/a> by The Block.","“These changes may limit more or less the possibility to develop harmonized standards for smart contracts,” European Commissioner for Internal Market Thierry Breton said in a press conference after the vote. He also noted that providing interoperability, harmonization standards and legal certainty were the Commission’s main motivations for the smart contract provisions.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe legislation will now travel into trilogue negotiations, where each EU institution will defend its position. This will provide an opportunity for policymakers to negotiate issues on smart contracts, del Castillo added in the press conference.","<span data-v-f87c67ca=\"\">For Natalie Linhart, legal counsel at blockchain software firm ConsenSys, the smart contract provisions don’t seem to be too overbearing for the industry. “We see Article 30 as a marginal provision applicable to smart contracts facilitating data transfers involving IoT products — not those deployed in DeFi applications.”<\/span>","<span data-v-f87c67ca=\"\">But the coast is not yet clear. Linhart hopes to ensure “standards aren't extended to other smart contracts in future legislative proposals touching crypto,” she told The Block in an email. “Setting substantive requirements for blockchain development would restrict innovation and make the EU an unwelcome place for software developers.\"<\/span>","<span data-v-f87c67ca=\"\">For the European Crypto Initiative advocacy group, the Data Act has been a focus of their attention over the past months.<\/span>","<span data-v-f87c67ca=\"\">“It would be really hard, almost impossible, for most smart contracts that we have today to be compliant with this article,” Marina Markezic, head of EUCI, told The Block on a call.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The rules proposed don’t align to the smart contracts that we know today, Markezic said, and may spur the development of a different technology to fit the mold. “It’s saying you will need to use a fruit that is called ‘strawberry’ and it needs to be blue. And basically you need to come up with a strawberry that is blue because all the ones we have are red.”<\/span>","<em data-v-f87c67ca=\"\">Correction: updates to correct details of EU conformity requirements.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Update: story updated to add comments from Thierry Breton.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Strasbourg","content":"LOCATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Castillo","content":"PERSON"},{"type":"Markezic","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"” Marina Markezic","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Thierry Breton","content":"PERSON"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Natalie Linhart","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Pilar del Castillo Vera","content":"PERSON"},{"type":"European Parliament","content":"LOCATION"},{"type":"European Commissioner for Internal Market Thierry Breton","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"European Crypto Initiative","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT","SMART CONTRACTS"],"authors":["Inbar Preiss","The Block"]}