{"summary":"The planned Sei blockchain upgrade will allow developers to port over Ethereum-based contracts to the network and use them on it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265130\/sei-blockchain-to-add-ethereum-virtual-machine-support-in-v2-upgrade","publishDate":"2023-11-29T09:05:07","id":10608,"type":null,"title":"Sei blockchain to add Ethereum Virtual Machine support in V2 upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Trading-focused Layer 1 blockchain <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sei <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248468\/sei-sei-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Sei_Logo_-_Transparent.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">SEI<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.28%\n    <\/span><\/a> <!----><\/span><\/span> will add support for the Ethereum Virtual Machine (EVM) in its upcoming version 2 (V2) upgrade. This will enable developers to port Ethereum-based contracts over to the network and use them on it.<\/span>","To add this feature, Sei V2 will incorporate Geth, a Go implementation of the Ethereum Virtual Machine. Geth is the most widely used Ethereum client software.","Sei Labs told The Block that it has developed a specialized interface to facilitate interaction of Sei's existing smart contracts component (based on CosmWasm technology) with the EVM component. CosmWasm is a custom Cosmos SDK module that allows chains to operate smart contracts in the Cosmos ecosystem. With V2, the team will enable an efficient integration of EVM support into the Sei network.","\"Sei V2 is an additive change. All of the existing components like CosmWasm will continue to exist. Since this is a proposed chain modification, the different virtual machines will also be able to interact with each other, allowing for Sei V2 to be the first network where EVM and Cosmwasm contracts are able to call each other,\" Jay Jog, co-founder at Sei Labs told The Block.","Sei has been <a href=\"https:\/\/www.theblock.co\/post\/244769\/sei-blockchains-native-asset-set-to-go-live-for-trading-tomorrow\" data-v-f87c67ca=\"\">operational<\/a> on the mainnet beta since the V1 launch in August, offering support for Cosmos smart contracts written in Rust. With Sei V2, the team behind it aims to broaden its appeal to a wider range of developers. The development will add a fully parallelized EVM-compatible layer with sub-second finality (the speed at which transactions are confirmed).","In addition to EVM support, Sei V2 introduces SeiDB, a data structure that purports to improve the platform’s storage layer. According to the team, SeiDB will prevent state bloat — where the network becomes excessively data heavy — and simplify the state synchronization process for new nodes. The objective here is to boost the overall performance and scalability of the Sei blockchain.&nbsp;","The Sei V2 upgrade is currently nearing completion from a code development perspective and is undergoing a rigorous audit process to ensure its security. It is scheduled to be released on a public testnet in the first quarter of 2024, with the mainnet deployment expected in the first half of the year.","Sei is a Cosmos SDK-based proof-of-stake blockchain, designed to be optimized for trading with its ability to execute sub-second blocks. In April 2023, Sei Labs, the core developer of the network, raised <a href=\"https:\/\/www.globenewswire.com\/news-release\/2023\/04\/11\/2644459\/0\/en\/Sei-Labs-Raises-30M-to-Build-the-Layer-1-for-Trading.html\" data-v-f87c67ca=\"\">$30 million<\/a> in two strategic funding rounds from venture firms including Jump and Multicoin Capital.","With functionality that supports fast decentralized trading, Sei targets a specific niche where it competes with other Cosmos chains like <a href=\"https:\/\/www.theblock.co\/post\/239121\/cosmos-osmosis-concentrated-liquidity\" data-v-f87c67ca=\"\">Osmosis<\/a>, Kava, Injective, Neutron and Kujira.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter of 2024","content":"DATE"},{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Geth","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Injective","content":"LOCATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Kava","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"+0.28%","content":"PERCENT"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Jay Jog","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Sei Labs","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Kujira","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["COSMOS","DEXS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}