{"summary":"Sen. Pat Toomey is asking about the SEC’s enforcement approach in a new letter sent to the agency’s chair Gary Gensler. \nHe called the agency’s regulation-by-enforcement method “capricious and ineffective” and argued the agency’s failure to act on crypto lenders may have led to their collapse. ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159771\/toomey-calls-for-answers-on-crypto-enforcement-approach-in-letter-to-sec","publishDate":"2022-07-27T05:01:55","id":1060,"type":null,"title":"Toomey calls for answers on crypto enforcement approach in letter to SEC","category":["Regulation"],"content":["US Senator Pat Toomey, R-Pa., is asking Securities and Exchange Commission Chair Gary Gensler for clarity on the way the agency regulates cryptocurrency firms, arguing that the current set of standards has resulted in billions in losses for American investors and is stifling financial innovation.","Toomey, the top Republican on the Senate Banking, Housing and Urban Affairs Committee, in a July 26 letter argued lenders that have recently sought bankruptcy protection — like <a href=\"https:\/\/www.theblock.co\/post\/158339\/celsius-first-day-bankruptcy-proceedings-address-the-interim-before-a-reorganization\" data-v-f87c67ca=\"\">Celsius<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Voyager<\/a> — fell under the SEC's purview. If the SEC had given regulatory clarity to crypto firms, things might have been different, Toomey said in his letter.","\"Companies could have adjusted product offerings accordingly, preventing investor losses today, and the SEC would have been free to focus enforcement efforts on the worst actors,\" the letter said.","The SEC had already taken lender <a href=\"https:\/\/www.theblock.co\/linked\/134165\/with-100-million-settlement-confirmed-blockfi-aims-to-register-yield-with-sec\" data-v-f87c67ca=\"\">BlockFi<\/a> to task three months before any other crypto lender froze accounts. Toomey argued the SEC could have shared its view on how crypto lending products fit into securities laws since it had already made determinations in the BlockFi action. The securities regulator also was reportedly investigating Celsius' and Voyager's compliance and did not act before state regulators began <a href=\"https:\/\/www.theblock.co\/post\/156741\/celsius-voyager-us-state-regulators-increasing-scrutiny-bloomberg\" data-v-f87c67ca=\"\">filing<\/a> enforcement actions against the lenders.&nbsp;","\"Regardless of the merit to any specific SEC or state-based enforcement action, the SEC’s<br data-v-f87c67ca=\"\">\ncontinued refusal to give regulatory clarity to the crypto community, combined with a haphazard<br data-v-f87c67ca=\"\">\nand an apparently sluggish enforcement pace harms not only investors, but also innovation,\" Toomey said in the letter.","Instead, the SEC is choosing to generally regulate by enforcement, Toomey said, citing a recent <a href=\"https:\/\/www.theblock.co\/post\/158973\/sec-lists-nine-crypto-tokens-as-securities-following-coinbase-insider-trading-charges\" data-v-f87c67ca=\"\">insider trading suit<\/a> filed by the SEC that could have <a href=\"https:\/\/www.theblock.co\/post\/159239\/crypto-firms-could-face-fallout-from-sec-insider-trading-case-against-former-coinbase-employee\" data-v-f87c67ca=\"\">unintended consequences<\/a> for token projects. The filing claimed nine tokens constituted digital asset securities, effectively branding them and the exchanges they list on as noncompliant without lodging an enforcement action against them or clarifying the position.&nbsp;","\"In this circumstance and elsewhere, the SEC ostensibly had a clear opinion on why it thinks these digital assets are securities, yet it did not disclose that view publicly before launching an<br data-v-f87c67ca=\"\">\nenforcement action,\" Toomey said. \"There are many reasons to be skeptical of the SEC’s view that most digital assets are securities.\"","To better understand the SEC's thought process, Toomey submitted eight questions to the regulator. They probe at the internal discussions related to crypto lenders, asking if the SEC had determined other lenders were offering securities after the BlockFi action and if there were planned enforcement actions. They also concern the dialogue between crypto firms and the SEC, asking if lenders ever asked the SEC for guidance and how the conversation played out. Toomey also asked about the recent insider trading complaint against a former Coinbase employee and his associates, requesting clarity on what makes the nine assets securities and what guidance the SEC plans to give to the other tokens not named in the complaint.&nbsp;","Toomey pressed Gensler on concerns of regulation-by-enforcement tactics in September of last year during a Senate Banking Committee hearing. At that time, he also asked Gensler to give the public clarity on crypto regulation.&nbsp;"],"hashtag":["BLOCKFI","LENDING","SEC"]}