{"summary":"The foundation behind the Arbitrum blockchain wants to create a robust ecosystem full of new video games.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282651\/arbitrum-eyes-400-million-crypto-gaming-fund-with-proposal-to-dao","publishDate":"2024-03-14T15:10:41","id":10618,"type":null,"title":"Arbitrum eyes $400 million crypto gaming fund with proposal to DAO","category":["GAMING"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arbitrum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.94%\n    <\/span><\/a> <!----><\/span><\/span> Foundation wants to expand into blockchain gaming and is aiming to \"earmark\" about $400 million over the next two years with the aim of convincing publishers and builders to create video games using its blockchain.<\/span>","In <a href=\"https:\/\/forum.arbitrum.foundation\/t\/catalyze-gaming-ecosystem-growth-on-arbitrum\/22368\" data-v-f87c67ca=\"\">a post<\/a>, Arbitrum Foundation outlined its plan for the \"Gaming Catalyst Program.\" The program proposes asking the Arbitrum DAO to approve the earmarking of 200 million ARB (about $400 million at current prices) over a two-year period to incentivize building games on its blockchain.","\"Arbitrum has emerged as a leader in the competitive network race through a dynamic formula of innovation, robust technology, organic builders, and a variety of short and long-term incentives,\" the organization said in its post. \"This dynamic has not occurred within the web3 gaming vertical, but we believe that the same opportunity exists to attract the best builders that will in turn create sticky, quality games that bring and retain new users within Arbitrum.\"","Arbitrum Foundation is the <a href=\"https:\/\/www.theblock.co\/post\/253560\/arbitrum-foundation-fracton-ventures-japan\" data-v-f87c67ca=\"\">organization that supports<\/a> the Ethereum Layer 2 network Arbitrum.","The new proposal suggests allocating the vast majority of funds — 160 million ARB — to incentivize publishers and builders to create new games on Arbitrum. The other 40 million ARB would support infrastructure initiatives such as creating tools \"needed to support gaming within Arbitrum.\"","\"The Gaming Catalyst program has an overarching goal to bring in talented builders, and help the builders accelerate their games through the lifecycle stages,\" Arbitrum Foundation said in its post.","Until now, blockchains popular with gaming projects have included Polygon, Immutable, Avalanche and Solana.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"-1.94%","content":"PERCENT"},{"type":"Immutable","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"The Gaming Catalyst","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"next two years","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}