{"summary":"An Arbitrum airdrop thief wants to intercept 3 million ARB tokens from compromised wallets. The thief could claim 0.26% of the drop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221607\/arbitrum-airdrop-arb-wallet-hijack","publishDate":"2023-03-21T13:17:15","id":10613,"type":null,"title":"Arbitrum airdrop thief lays trap for compromised wallets.","category":["CRYPTO ECOSYSTEMS"],"content":["A would-be thief is laying the groundwork to intercept 3 million ARB tokens from the upcoming Arbitrum airdrop.","The crypto criminal sent ether to around 2,400 wallets in order to approve a contract that allows recipients to claim the airdrop, which is set for Thursday. Normally this wouldn’t be a problem, but this person also appears to have access to the wallets' private keys.","The approved contract will automatically claim the airdrop on behalf of the thief, bypassing any bots that might be set up to sweep funds that land in the wallets.&nbsp;","Word of the scheme was first <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1637759733737177091\" data-v-f87c67ca=\"\">brought to light<\/a>&nbsp;by Arkham Intelligence and a <a href=\"https:\/\/github.com\/ArbitrumFoundation\/sybil-detection\/issues\/3\" data-v-f87c67ca=\"\">post<\/a> on GitHub. The ARB token will control the governance of the Arbitrum One and Nova networks through a DAO.","Since the bad actor knows the private keys for the wallets, wallet owners can’t necessarily block them. What they can do is revoke the contract that has been set up — but even then they would still need to manually claim the airdrop before the hacker does.","In a world often rife with exploits, this attempt to hijack an airdrop is unique.&nbsp;&nbsp;If successful, it means the thief would end up claiming 0.26% of the user airdrop by siphoning them from wallets that aren't their own. Such a move would undermine the goal of handing over governance to the most dedicated Arbitrum community members while at the same time depriving these wallets of their rightful claim.","The fact that the drop is happening on Arbitrum, a layer2 scaling project, complicates matters for the wallets in question. If the airdrop was on the Ethereum blockchain, then it might be possible to use Flashbots to gain an edge in claiming the airdrop first — but that’s <a href=\"https:\/\/twitter.com\/officer_cia\/status\/1637983015186976768\" data-v-f87c67ca=\"\">not possible<\/a>&nbsp;on Arbitrum.","Some in the community have <a href=\"https:\/\/twitter.com\/ihardlychase\/status\/1637807050917855233\" data-v-f87c67ca=\"\">called<\/a> on Offchain Labs to blacklist these wallets so that the bad actor doesn’t end up with all of the tokens. Yet this could stop legitimate users from having a chance to claim them.","At the time of the <a href=\"https:\/\/www.theblock.co\/post\/220486\/arbitrums-long-awaited-airdrop-to-go-live-next-week-with-self-executing-dao\" data-v-f87c67ca=\"\">airdrop announcement<\/a>, Offchain Labs CEO Steven Goldfeder told The Block there will be no changes to the airdrop allocation. The company has not addressed this specific issue.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"0.26%","content":"PERCENT"},{"type":"GitHub","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","ETHEREUM","HACKS"],"authors":["Tim Copeland","The Block"]}