{"summary":"The protocol raised $7.2 million to &quot;build decentralized capital markets for blockspace&quot; in a round led by 1kx and Castle Island Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201230\/alkimiya-raises-7-2-million-to-build-decentralized-capital-markets-for-blockspace","publishDate":"2023-01-12T03:00:05","id":10616,"type":null,"title":"Alkimiya raises $7.2 million to build &#x27;decentralized capital markets for blockspace&#x27;","category":["DEALS"],"content":["Alkimiya raised $7.2 million to \"build decentralized capital markets for blockspace\" in a round led by 1kx and Castle Island Ventures.","The round for the protocol, which closed in November, featured participation from Dragonfly, Circle Ventures and Coinbase Ventures among others. Founder Leo Zhang declined to share the valuation in an interview with The Block.&nbsp;","Founded by ex-Itaú Unibanco engineer Ricardo Grobel and former Morgan Stanley employee Zhang, Alkimiya aims to provide hedging solutions for blockspace producers such as miners and staking validators.&nbsp;","Zhang equates such entities as similar to traditional commodity producers in that they have a set of costs they bear to produce a good, or in the case of blockspace producers, coins. Yet with fluctuating yields and cryptocurrency prices, blockspace producers take on the risk of producing an inherently volatile and variable good but without the financial instruments to manage them.&nbsp;","\"Traditional commodity companies like oil or gold companies use futures and options to hedge against their production risk,\" said Zhang. \"The problem with blockspace producers is that they can hedge against the price of bitcoin or ETH but they don't actually know how much bitcoin or ETH to hedge.\"&nbsp;","Currently, the vast majority of DeFi yields rely on the liquidity of crypto coins that are vulnerable to volatility. But Alkimiya promises yields directly linked to blockspace production by enabling blockchain producers to lock in an upfront fixed return for their future production. This hedging solution enables them to manage risk and in turn, DeFi users can tap into the value accrued by blockchain producers.&nbsp;","\"If we look at the crypto space across the board, we need to identify naturally recurring cash flow that is sustainable and that's relatively independent of all of these liquidity-driven activities that happening here,\" Zhang said.&nbsp;","Alkimiya initially launched on Layer 1 blockchain Avalanche in March last year as a public beta to test out the protocol on-chain and iron out any possible loopholes.&nbsp;","The funding will primarily be used to expand its team as it gears up to launch a full product suite, including a Vault product and ETH staking contracts on the Ethereum mainnet in the first quarter of this year.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter","content":"DATE"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$7.2 million","content":"MONEY"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"March last year","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Ricardo Grobel","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Leo Zhang","content":"PERSON"},{"type":"Zhang","content":"PERSON"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Unibanco","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES","STAKING FIRMS"],"authors":["Tom Matsuda","The Block"]}