{"summary":"While EOS uses the C++ programming language, the EOS EVM runs dapps written in Ethereum&#x27;s programming language, Solidity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225895\/eos-ethereum-evm-mainnet","publishDate":"2023-04-13T18:00:35","id":10629,"type":null,"title":"EOS adds Ethereum compatibility after more than a year of development","category":["LAYER 1S"],"content":["EOS is becoming interoperable with Ethereum.","After more than a year of development, the EOS Network Foundation is launching the beta version of the EOS EVM Virtual Machine — an emulation of the Ethereum Virtual Machine — on its mainnet. It will be deployed today as a smart contract.","The beta launch <a href=\"https:\/\/eosnetwork.com\/blog\/eos-evm-testnet-live\/\" data-v-f87c67ca=\"\">followed<\/a> a testnet rollout late last month.","While EOS uses the C++ programming language, the EOS EVM runs decentralized applications written in Ethereum's programming language, Solidity.","Because Solidity is used by most web3 developers and supported by open-source code libraries and tools, the interoperability opens up more opportunities to attract developers skilled in the programming language.&nbsp;Meanwhile, Ethereum developers may leverage EOS' performance and throughput.","“Our goal is to create an interoperable future where the gaps between blockchains, developers and end users are bridged,\" Yves La Rose, founder and CEO of the EOS Network Foundation, said.","“With EOS EVM, it is now significantly easier for Ethereum developers and end users to take advantage of the low fees, ulta-fast speeds, and reliability of the EOS Network. EOS EVM is a significant milestone and represents our commitment to a multi-chain future,” they added.","EOS EVM Virtual Machine aims to be the industry's most performant and compatible EVM — predicting one-second block intervals, low fees and more than 800 swaps per second.","It has some support.&nbsp;EOS Network Ventures recently announced a public commitment of $20 million to invest in GameFi and EOS EVM projects.","EOS has also worked for so long to incorporate Ethereum interoperability because — for all intents and purposes — it had to.","EOS has struggled to gain traction after its hyped launch, and development activity has failed to excite — or attract fresh talent. In January, the EOS Network Foundation <a href=\"https:\/\/medium.com\/eos-network-foundation\/evm-bringing-the-ethereum-virtual-machine-to-eos-f26b88466d99\" data-v-f87c67ca=\"\">wrote<\/a> that most developers who left the EOS ecosystem did so because Ethereum \"is where the action is.\"&nbsp;","\"That’s why work involving the Ethereum Virtual Machine is so important,\" it explained, writing: \"EVM compatibility is essential to the potential of EOS, not just technically but also from a business perspective. Ultimately, it is essential that we welcome more Solidity developers and users to EOS.\"","The project's key architect, Dan Larimer, moved on from the project in January 2021, and the community had to wrestle back control from the official development team, Block.One, in an attempt to revive it.","<span data-v-f87c67ca=\"\">The price of EOS' native coin has stagnated since its inception nearly half a decade ago. Source: TradingView<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"EOS","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"EOS Network Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"EOS Network","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine —","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"Dan Larimer","content":"PERSON"},{"type":"EVM Virtual Machine","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"ulta","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}