{"summary":"Tron Foundation’s China partner Raybo Technology first filed its requests to trademark “TRON,” “TRONNETWORK,” and “TRONIX in February 2018. Disney pushed back with formal filings in August, Raybo Technology failed to respond, and the USPTO found in favor of Disney.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51273\/tron-foundation-partner-sought-u-s-trademarks-but-disney-pushed-back-and-won","publishDate":"2019-12-20T16:07:48","id":10628,"type":null,"title":"Tron Foundation partner sought U.S. trademarks; Disney pushed back and won","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The U.S. Patent and Trademark Office last month rejected three trademark applications sought in connection with the cryptocurrency platform Tron after American media giant Disney filed notices of opposition and argued that approval would lead to brand confusion.<\/span>","<span data-v-f87c67ca=\"\">Tron Foundation’s China partner Raybo Technology first filed its requests to trademark “<\/span><a href=\"http:\/\/tsdr.uspto.gov\/#caseNumber=87810335&amp;caseType=SERIAL_NO&amp;searchType=statusSearch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRON<\/span><\/a><span data-v-f87c67ca=\"\">,” “<\/span><a href=\"http:\/\/tsdr.uspto.gov\/#caseNumber=87810436&amp;caseType=SERIAL_NO&amp;searchType=statusSearch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRONNETWORK<\/span><\/a><span data-v-f87c67ca=\"\">,” and “<\/span><a href=\"http:\/\/tsdr.uspto.gov\/#caseNumber=87810348&amp;caseSearchType=US_APPLICATION&amp;caseType=SERIAL_NO&amp;searchType=statusSearch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRONIX<\/span><\/a><span data-v-f87c67ca=\"\"> in February 2018. When Disney pushed back with formal filings in August, Raybo Technology failed to respond, and the USPTO found in favor of Disney. <\/span>","<span data-v-f87c67ca=\"\">Thus, Raybo's applications were rendered abandoned in the first weeks of November. Crypto outlet Decrypt <a href=\"https:\/\/decrypt.co\/15378\/disney-halts-justin-suns-attempt-to-trademark-tron\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">first reported<\/a> the news Friday.<\/span>","<span data-v-f87c67ca=\"\">In its notices of opposition, Disney contended that the proposed trademarks would infringe on the corporation’s long history of using and licensing its film series of the same name.&nbsp;<\/span><span data-v-f87c67ca=\"\">Indeed, Disney has built a whole franchise around its 1982 film <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">TRON<\/span><\/i><span data-v-f87c67ca=\"\">, including a sequel movie, an animated TV series, video games, musical recordings as well as a line of merchandise. <\/span>","<span data-v-f87c67ca=\"\">Disney highlights the fact that the Tron Foundation has chosen to present its name in all capital letters, which is highly similar to Disney’s own TRON marks. This move shows “bad faith” on Tron Foundation’s part, the notice says, and will likely confuse Disney’s long-standing customer base.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tron Foundation did not issue any response to Disney’s notice in the following nine months. As a result, the patent office rejected all three of its trademark applications by default, according to filings from November.<\/span>","<a href=\"http:\/\/wzj.saic.gov.cn\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Records<\/span><\/a><span data-v-f87c67ca=\"\"> show that Raybo Technology already owns nine trademarks in China, including the words “Tron,” “TRX,” and “Tronix,” with more pending approval.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Tron clearly didn't take the trademark registration process seriously,” Jake Chervinsky, general counsel for Compound,&nbsp;<\/span><span data-v-f87c67ca=\"\">told<\/span><span data-v-f87c67ca=\"\"> Decrypt. “They never hired U.S. counsel to represent them, even though the USPTO explicitly ordered them to do so. They also didn't respond to the USPTO's notice of default, meaning they gave up on their trademark attempt completely.”<\/span>","<span data-v-f87c67ca=\"\">“There's nothing wrong with deciding to abandon a trademark application when confronted with a vigorous defense like the one Disney was clearly prepared to mount,” Chervinsky continued. “But the respectful way to handle this situation is to withdraw the application, not to simply ignore the USPTO.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1982","content":"DATE"},{"type":"U.S. Patent and Trademark Office","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Raybo Technology","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jake Chervinsky","content":"PERSON"},{"type":"February 2018","content":"DATE"},{"type":"Raybo","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"USPTO","content":"ORGANIZATION"},{"type":"Chervinsky","content":"PERSON"},{"type":"TRON marks","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Tron Foundation","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Disney","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}