{"summary":"Opening up crypto to the RIA world could be a big game changer, according to Coinbase&#x27;s Greg Tusar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133907\/one-river-teams-up-with-coinbase-to-offer-crypto-accounts-for-investment-advisors","publishDate":"2022-02-11T09:00:10","id":10620,"type":null,"title":"One River teams up with Coinbase to offer crypto accounts for investment advisors","category":["THE BLOCK"],"content":["One River—the crypto investment firm backed by Alan Howard—is teaming up with Coinbase to offer a platform that would allow wealth managers to offer crypto exposure to their clients.&nbsp;","As per a press release shared Friday, One River will offer wealth managers access to One Digital SMA. An SMA allows a wealth manager to offer strategies from an outside investment firm through individual client accounts. The idea is to make it easier for registered investment advisors to offer crypto exposure to their clients in the same way they offer exposure in bonds, stocks, and mutual funds via a portfolio.&nbsp;","\"The ability to offer Separately Managed Accounts' through&nbsp; RIA channels is a critical way for a broader cross-section of the investing public to gain exposure to crypto investing,\" commented Greg Tusar, head of institutional products at Coinbase. Coinbase's institutional unit powers the new platform.&nbsp;","Wealth and financial advisors are becoming increasingly interested in the digital asset space, with the number of financial advisors allocating to crypto in client portfolios increasing from 6.3% in 2020 to 9.4% last year, according to Bitwise.&nbsp;","\"Registered investment advisors and private wealth platforms have been asking for best-in-class digital market access, research perspectives, and investment opportunities,\" One River noted in a press release.&nbsp;","This isn't Coinbase's first big push into crypto asset management. The exchange <a href=\"https:\/\/markets.businessinsider.com\/news\/currencies\/coinbase-cryptocurrency-index-fund-2018-3\" data-v-f87c67ca=\"\">launched<\/a> an index fund that would give institutional investors exposure to the largest cryptocurrencies by market capitalization in 2018. It ultimately <a href=\"https:\/\/www.theblockcrypto.com\/news+\/1562\/coinbase-is-shutting-down-its-fund-aimed-at-big-investors-as-it-pivots-to-a-new-retail-product\" data-v-f87c67ca=\"\">shut down<\/a> the product.","Coinbase and One River are not be the only firms operating in the burgeoning sub-section of the market. Grayscale, one of the largest asset managers in the space, offers a number of trust products that trade over-the-counter and are offered to retail clients through platforms like Fidelity and Wealthfront.&nbsp;","At the end of last year, Onramp and WisdomTree <a href=\"https:\/\/www.yahoo.com\/now\/ritholtz-wealth-management-wisdomtree-collaborate-140000658.html\" data-v-f87c67ca=\"\">partnered<\/a> with Ritholtz Wealth Management on a diversified crypto product offered to retail clients through financial advisors. Wealth management firm Betterment, meanwhile, announced its own acquisition of crypto robo-advisory platform Makara, which the firm could use to help its financial advisor clients offer crypto exposure to their end customers.&nbsp;","As for One River, the firm gatecrashed the crypto space in September 2021 when it <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-09-21\/goldman-coinbase-back-crypto-fund-manager-one-river-digital\" data-v-f87c67ca=\"\">announced<\/a> it had raised $41 million from investors including Howard, Coinbase, and Goldman Sachs. Founded in 2013, the Greenwich-based firm <a href=\"https:\/\/www.oneriveram.com\/digital-strategies\" data-v-f87c67ca=\"\">manages<\/a>&nbsp;a bitcoin and Ethereum fund that is designed to offer passive exposure for investors.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"Greg Tusar","content":"PERSON"},{"type":"Makara","content":"ORGANIZATION"},{"type":"Howard","content":"PERSON"},{"type":"6.3%","content":"PERCENT"},{"type":"9.4%","content":"PERCENT"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Alan Howard—","content":"PERSON"},{"type":"SMA","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Greenwich","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Ritholtz Wealth Management","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}