{"summary":"Microsoft and Axelar, a crypto interoperability project, have entered into a partnership to offer blockchain interoperability solutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238668\/microsoft-partners-with-axelar-on-blockchain-interoperability-solutions","publishDate":"2023-07-11T08:59:22","id":10625,"type":null,"title":"Microsoft partners with Axelar on blockchain interoperability solutions","category":["COMPANIES"],"content":["Microsoft and Axelar, a crypto interoperability project, have entered into a partnership to offer blockchain interoperability solutions.","As part of the deal, Axelar’s blockchain interoperability solutions will be made available to Microsoft’s customers through the Azure cloud marketplace. The move is intended to make blockchain onramps more accessible for both web3 and enterprise developers.","Specifically, Microsoft Azure Marketplace will offer Axelar’s General Message Passing cross-chain software stack that can enable developers to integrate apps on different blockchains. Included in the offering are developer tools such as AxelarJS software development kit, which automates multi-chain deployments.","<a href=\"https:\/\/www.theblock.co\/post\/229061\/axelar-enables-sommelier-defi-vaults-to-connect-to-arbitrum\" data-v-f87c67ca=\"\">Axelar<\/a> is a blockchain project that promises to enable secure communication across various chains. It accomplishes this through a programmable interoperability layer on the <a href=\"https:\/\/www.theblock.co\/post\/231317\/osmosis-axelar-and-akash-fund-mesh-security-model-for-cosmos-ecosystem\" data-v-f87c67ca=\"\">Cosmos network<\/a>, which serves as a bridge connecting apps on different blockchains.","“We are excited to collaborate with Axelar to accelerate blockchain integration and deliver valuable solutions to our customers,” <a href=\"https:\/\/www.linkedin.com\/in\/andaniel\/\" data-v-f87c67ca=\"\">Daniel An<\/a>, director of business development at Microsoft's Web3 &amp; AI division, said in a statement. “By leveraging our strengths and expertise, we can empower organizations to embrace blockchain technology and transform their operations.”","The two companies have agreed to explore the development of solutions that include connecting private and public blockchains, and leveraging and integrating with Microsoft-offered OpenAI services on Azure.","“The shared vision inspired us to partner with Microsoft to provide an extensible interoperability layer for the Azure community, from fast-growing Web3 startups to global enterprises,” said Axelar co-founder Sergey Gorbunov. “With Microsoft, we are now also able to explore new frontiers in Web3, such as blockchain-enabled OpenAI services and the integration of AI in future Web3 applications.”","It’s not uncommon for Microsoft to partner with crypto projects to offer their services on its cloud platform. In February, the tech giant <a href=\"https:\/\/www.theblock.co\/post\/213554\/microsoft-and-ankr-partner-blockchain-node-infrastructure-service\" data-v-f87c67ca=\"\">collaborated<\/a> with Ankr to offer enterprise users blockchain remote call procedure solutions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Axelar","content":"ORGANIZATION"},{"type":"Microsoft's Web3 &amp; AI","content":"ORGANIZATION"},{"type":"Sergey Gorbunov","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Microsoft Azure Marketplace","content":"ORGANIZATION"},{"type":"Daniel An","content":"PERSON"}],"hashtag":["COSMOS","CROSS-CHAIN SWAPS","INTEROPERABILITY"],"authors":["Vishal Chawla","The Block"]}