{"summary":"These changes will see the introduction of vote locking and DAO-to-DAO interactions to the Serum DAO governance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180942\/solana-based-dex-serum-is-considering-changes-to-its-dao-governance","publishDate":"2022-10-28T12:01:49","id":10621,"type":null,"title":"Solana-based DEX Serum is considering changes to its DAO governance","category":["GOVERNANCE"],"content":["Serum, a <a href=\"https:\/\/www.theblock.co\/linked\/76409\/ftx-serum-dex-august\" data-v-f87c67ca=\"\">decentralized exchange<\/a> on the Solana network, is currently mulling a proposal that will change the governance structure for the project.","Solana and Serum developers TDM Blockchain developed the <a href=\"https:\/\/medium.com\/@tdmblockchain\/new-serum-governance-system-proposal-34ebaec0da7e\" data-v-f87c67ca=\"\">proposal<\/a> and filed its recommendations to the Serum DAO forum on Thursday. If passed, this will result in the creation of a new community token for the Serum DAO. Serum already has a native token called SRM. This new community token will be a locked version of SRM called gSRM. Both tokens will have a 1-to-1 relationship meaning that users get an equivalent number of gSRM for every SRM token locked.","If the proposal goes through, Serum's new locked tokens will confer voting rights to holders. Community members will have to lock their SRM to obtain gSRM to be able to vote on governance proposals in the DAO. Users may also choose to unlock their tokens at any time. Locking or unlocking tokens will take seven days, according to the proposal but TDM stated that the DAO may choose to adjust this timeframe if it so wishes.","The main difference is that instead of all token holders getting a say in the voting process, it will only be those who have locked up their tokens for this reason.","Apart from voting privileges, these locked tokens will also have another function. Serum DAO will be able to issue vested grants to individuals or other DAOs from the treasury. The recipients of these grants will then be able to participate in the DAO governance process as well.","TDM’s proposal also includes a provision for how to handle matters relating to grants from the DAO treasury. Voting on Serum treasury governance proposals will require a quorum of 50,000 votes in favor of such motions. These votes must also be greater than half of the total votes cast during the polls.","The Serum DAO community may also soon play host to other DAOs. TDM’s proposal called for DAO-to-DAO interaction within Realms, a Solana-based DAO tooling platform. Realms allows users to create and manage DAOs. This part of TDM’s proposal will enable DAOs registered on the Realms platform to join the Serum DAO.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Serum DAO","content":"ORGANIZATION"},{"type":"TDM","content":"ORGANIZATION"},{"type":"SRM","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["SOLANA"],"authors":["Osato Avan-Nomayo","The Block"]}