{"summary":"Grayscale is gearing up for an SEC decision on the conversion of its Grayscale Bitcoin Trust to a spot bitcoin ETF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154375\/grayscale-preps-for-all-possible-ruling-scenarios-on-gbtc-conversion","publishDate":"2022-06-27T15:15:05","id":10631,"type":null,"title":"Grayscale preps for &#x27;all possible ruling scenarios&#x27; on GBTC conversion","category":["BITCOIN"],"content":["Issuer Grayscale is preparing for a decision on the conversion of its Grayscale Bitcoin Trust (GBTC) to an exchange-traded fund (ETF) next week, and CEO Michael Sonnenshein says the firm is&nbsp; \"unequivocally committed\" to the conversion.","The Securities and Exchange Commission (SEC) has repeatedly delayed a decision on the conversion of GBTC, which would mark the first available spot-based bitcoin ETF in the US. A decision must come by July 6.","The SEC has <a href=\"https:\/\/www.theblock.co\/linked\/132039\/sec-rejects-fidelitys-proposed-spot-bitcoin-etf\" data-v-f87c67ca=\"\">rejected<\/a> similar <a href=\"https:\/\/www.theblock.co\/linked\/124192\/sec-rejects-vanecks-spot-bitcoin-etf\" data-v-f87c67ca=\"\">proposals<\/a> from a number of <a href=\"https:\/\/www.theblock.co\/linked\/148988\/ark-and-21shares-make-another-attempt-at-a-bitcoin-etf-approval\" data-v-f87c67ca=\"\">issuers<\/a>, most commonly citing concerns of market manipulation and a lack of surveillance sharing agreements in the underlying market. Those pushing for approval have argued that the SEC's willingness to green-light a bitcoin futures ETF is inconsistent with this position since futures are priced based on the underlying spot market. Grayscale, for its part, argued in a <a href=\"https:\/\/www.theblock.co\/post\/125817\/grayscale-argues-the-secs-bitcoin-etf-treatment-could-violate-the-apa\" data-v-f87c67ca=\"\">letter<\/a> to the SEC that the difference in treatment between spot and futures products could constitute a violation of the Administrative Procedures Act.&nbsp;","Grayscale has long been angling to convert its GBTC to an ETF, saying that was always the plan for the life-cycle of the product. The SEC has continued to <a href=\"https:\/\/www.theblock.co\/linked\/133101\/sec-again-delays-decision-on-grayscales-bitcoin-etf-conversion-proposal\" data-v-f87c67ca=\"\">delay<\/a> the decision.&nbsp;","In an investor <a href=\"https:\/\/grayscale.com\/pending-gbtc-decision-investor-letter\/\" data-v-f87c67ca=\"\">letter<\/a> published today, Grayscale CEO Michael Sonnenshein said that while the firm is encouraged by the SEC's actions over the past eight months, it's preparing for \"all possible post-ruling scenarios.\"","\"Most important, GBTC is operationally ready to convert to an ETF the moment we are given the appropriate regulatory approvals,\" said the letter.","Indeed, Grayscale announced a deal today with Wall Street firms Jane Street and Virtu Financial to close the discount on GBTC when it's converted to an ETF. The deal will only take effect if the product gains approval.","In the event that it doesn't, Grayscale is exploring its options. The firm has already put forth arguments for the product with its in-house legal team and attorneys at Davis Polk, in addition to retaining former U.S. Solicitor General Donald B. Verrilli, Jr., as a senior legal strategist.","\"We have created the strongest possible legal team to help us articulate the importance of this issue,\" said the letter.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"July 6","content":"DATE"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jane Street","content":"PERSON"},{"type":"Davis Polk","content":"ORGANIZATION"},{"type":"Donald B. Verrilli, Jr.","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Aislinn Keely","The Block"]}