{"summary":"Binance CEO Changpeng &quot;CZ&quot; Zhao said at the Hong Kong Web3 Festival that crypto regulation by enforcement is &quot;really, really bad.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225914\/binance-ceo-cz-crypto-regulation","publishDate":"2023-04-12T08:37:28","id":10634,"type":null,"title":"Crypto regulation by enforcement is &#x27;really, really bad,&#x27; says Binance CEO","category":["REGULATION"],"content":["Binance CEO Changpeng Zhao — commonly known by his initials, \"CZ\" — said crypto regulation, rather than unclarity is a better option. However, he said that regulation by enforcement is bad.","\"Having no regulatory clarity is the worst. Having bad restrictive regulations are better than that,\" Zhao <a href=\"https:\/\/www.binance.com\/en\/live\/video?roomId=2129188\" data-v-f87c67ca=\"\">said<\/a> at the Hong Kong Web3 Festival on Wednesday. \"And then having unclear ones and then chasing people by enforcement is really, really bad.\"","Zhao's comments come after he and Binance were <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">sued<\/a> by the U.S. Commodity Futures Trading Commission last month for allegedly operating an \"illegal\" exchange and a \"sham\" compliance program. Zhao, at the time, <a href=\"https:\/\/www.theblock.co\/post\/223485\/cftc-binance-suit-what-comes-next\" data-v-f87c67ca=\"\">called<\/a> the suit \"unexpected and disappointing.\"","At today's event, Zhao said there's a \"very natural tendency\" for regulators to borrow guidelines from the traditional financial industry and apply them to crypto — but crypto is different and a nascent industry. It should be allowed to grow, and then there are \"always nefarious players, scammers, etc.,\" so \"we need to find ways to limit those guys.\"","Zhao said that most regulators don't have crypto industry experience, like how traditional financial regulators have previously worked for banks and understand that industry better.","\"So it's really important to very actively engage with regulators,\" he said. \"We can't just say, hey, look, this is decentralized. We are nowhere.\"","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">There has been a drastic change in his tone in the last two years regarding regulations. Previously, Zhao had&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/linked\/117855\/binance-shift-away-decentralized-headquarters-pitch\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">said<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;Binance is a decentralized company with no headquarters. Over the last couple of years, Binance has hired several compliance executives, registered its entities with several regulators, and applied for licenses with others.<\/span>","Zhao today said many regulators are \"very acceptive,\" while some are \"still skeptical,\" but \"that's fine,\" adding: \"We need to have conversations and we also need to have patience.\"","Governments trying to control crypto may, in fact, help grow its adoption, according to Zhao.","\"They are trying to control crypto by shutting down banks, shutting down fiat access, putting more restrictions in the traditional financial markets, which actually pushes more people into crypto, which is doing the reverse of what they want to do.\"","If they want to keep people in the traditional financial markets, they will need to help lower fees, make transactions easier and improve the user experience, Zhao said.","The lack of improvements in the traditional financial sectors is helping and will continue to support crypto adoption, he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Zhao","content":"PERSON"},{"type":"U.S. Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"last two years","content":"DATE"},{"type":"Changpeng Zhao —","content":"PERSON"}],"hashtag":["BINANCE","CFTC","CZ"],"authors":["Yogita Khatri","The Block"]}