{"summary":"The demand for crypto derivatives is taking flight as yield-hungry investors hunt opportunities in the face of macroeconomic headwinds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133317\/boarding-now-crypto-derivatives-take-flight","publishDate":"2022-02-08T08:59:02","id":10638,"type":null,"title":"Boarding Now: Crypto Derivatives Take Flight","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The demand for crypto derivatives is taking flight as yield-hungry investors hunt opportunities in the face of macroeconomic headwinds.<\/span>","<b data-v-f87c67ca=\"\">Shifting Winds: Spots to Derivatives&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Spot trading may have been crypto’s “OG” but the winds have shifted to make way for a new leader — derivatives. With derivatives volumes hitting 1.5 times the size of the spot market in 2021, the derivatives market emerged as an indicator for price movements, similar to traditional finance.<\/span>","<span data-v-f87c67ca=\"\">“Recently, what we’re finding is that the derivatives market is now the velocity of the price moves,” said Omid Zadeh, Head of Business Development EMEA, <\/span><a href=\"https:\/\/www.matrixport.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Matrixport<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Derivatives’ popularity lies in its leverage potential where investors can manage risk and trade at a lower cost with less capital. The market cycle has evolved and with derivatives’ soaring rise, looking at derivative volume patterns has now become an indication of who’s buying in the space.&nbsp;<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Piloting the Demand<\/b><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Institutional interest in the space has also seen significant growth. Particularly, after the large crypto price drop offs experienced in the first half of 2021, retail investing took a backseat to institutional participation as traditional forex markets stayed sombre.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Diving deeper, there are differing preferences within the category, too. From speaking to the TradFi institutions, the observation was a tendency to lean towards trading on US-regulated exchanges whereas, for <\/span><a href=\"https:\/\/www.matrixport.com\/institutions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the crypto-native institutions<\/span><\/a><span data-v-f87c67ca=\"\">, they were open-minded in trading across global exchanges where there are alpha generating opportunities.<\/span>","<span data-v-f87c67ca=\"\">Looking to the future, the industry foresees that institutional demand, combined with the Futures ETF and the bullish trend, are a “recipe” for increasing derivatives trading volumes at a larger multiple than spot going forward.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We are the bridge between the traditional space and DeFi, and bringing that together for <\/span><a href=\"https:\/\/www.matrixport.com\/institutions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">institutions<\/span><\/a><span data-v-f87c67ca=\"\"> in the safest possible manner.” — Omid Zadeh<\/span>","<span data-v-f87c67ca=\"\">It’s safe to say that the takeoff of institutional demand is promising — providing opportunities for new crypto offerings and innovation to serve the growing demand.<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Navigating Headwinds&nbsp;<\/b>","<span data-v-f87c67ca=\"\">The route to the perception of crypto as mainstream is fraught with some hurdles.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On this, the harmonisation of regulation to encourage innovation is critical. Crypto stakeholders have a role to play in engaging policy-makers and sharing crypto’s potential use cases. This will ensure that the market continues to grow in a sensible way and opens the doors for more investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While crypto’s foray into the mainstream is highly anticipated, predictions for the outcomes differ. One hand, there are expectations of a transition towards OTC trading as crypto exchanges become overcrowded and more crypto offerings are integrated into TradFi (e.g. institutional spot markets, equity brokerage firms) — making it even easier to trade. On the other hand, there is a strong conviction that crypto exchanges will continue to be a driving force, powered by innovation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">All that said, there is one thing we know for sure — crypto structured products are taking flight and all those watching need only to enjoy the journey through a hybrid world of CeFi and DeFi.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Head of Business Development EMEA","content":"ORGANIZATION"},{"type":"Matrixport","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Omid Zadeh","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"the first half of 2021","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}