{"summary":"The crypto exchange has clarified that the initial deposit of 1 billion BUSD came from its own assets following community concerns around the use of customer funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189897\/binance-clarifies-recovery-fund-deposits","publishDate":"2022-11-25T06:22:20","id":10635,"type":null,"title":"Binance clarifies initial $1 billion recovery fund deposit came from own assets","category":["COMPANIES"],"content":["Crypto exchange Binance clarified that an initial $1 billion deposit to its crypto industry recovery fund came from its own assets after details of the transferring wallet raised <a href=\"https:\/\/twitter.com\/DegenSpartan\/status\/1596038028921012224\" data-v-f87c67ca=\"\">questions<\/a> among some commentators on Twitter.&nbsp;","On-chain <a href=\"https:\/\/etherscan.io\/tx\/0x50c7740c25bb605b37a93632ac19b5d974786c2b6944c70d1f49e579463a6d46\" data-v-f87c67ca=\"\">transactions<\/a> show the funds came from one of Binance's cold wallets for BUSD, the exchange's dollar-pegged stablecoin.&nbsp;This wallet was recently listed in Binance's <a href=\"https:\/\/www.binance.com\/en\/blog\/community\/our-commitment-to-transparency-2895840147147652626\" data-v-f87c67ca=\"\">proof of funds documentation<\/a>, which shows all the cold and hot wallets the exchange owns as part of a transparency push following this month's collapse of rival crypto exchange FTX.","Some in the crypto community had raised concerns that Binance could be using customer funds as the wallet is listed as part of&nbsp; its proof of funds. Binance's <a href=\"https:\/\/web.archive.org\/web\/20221119210320\/https:\/\/www.binance.com\/en\/blog\/community\/our-commitment-to-transparency-2895840147147652626\" data-v-f87c67ca=\"\">original blog post<\/a> didn't specify the purposes of each wallet and whether they all store customer funds.&nbsp;","\"These are not customer funds. These are Binance assets that have been set aside,\" a spokesperson for the exchange said in emailed comments.&nbsp;","When asked whether Binance was storing its own funds in wallets along with customers' deposits, the spokesperson declined to comment.","Binance <a href=\"https:\/\/www.theblock.co\/post\/189797\/jump-crypto-polygon-ventures-gsr-contribute-to-binances-1-billion-recovery-fund\" data-v-f87c67ca=\"\">launched<\/a> the recovery fund on Thursday with 1 billion BUSD&nbsp; in initial capital, which can be <a href=\"https:\/\/etherscan.io\/address\/0x043a80999cee3711d372fb878768909fbe7f71e6\" data-v-f87c67ca=\"\">verified<\/a> at the following address. A number of big names in the crypto industry have signed on to contribute including GSR, Jump Crypto and Polygon Ventures. The addresses of other participants will be available in the next week.&nbsp;","The fund was announced last week to help mitigate the fallout stemming from FTX's collapse. It's <a href=\"https:\/\/www.theblock.co\/post\/189797\/jump-crypto-polygon-ventures-gsr-contribute-to-binances-1-billion-recovery-fund\" data-v-f87c67ca=\"\">expected<\/a> to last for around six months and has already received over 150 applications. Binance has stressed that it's not an investment fund.","<em data-v-f87c67ca=\"\">Update: Story updated to show that Binance declined to comment on whether it's storing its own funds in wallets alongside client deposits. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Kari McMahon","Ryan Weeks","The Block"]}