{"summary":"More cross-chain applications are beginning to launch now that the infrastructure needed to build them is more developed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207914\/cross-chain-margin-platform-prime-protocol-is-launching-on-arbitrum","publishDate":"2023-02-02T11:00:49","id":10633,"type":null,"title":"Cross-chain margin platform Prime Protocol is launching on Arbitrum","category":["THE BLOCK"],"content":["Cross-chain margin platform Prime Protocol launched its testnet on Arbitrum today, and will be the first cross-chain brokerage that allows users to take out margin on their entire account — regardless of what chain they are on.","This is beneficial for users because it reduces liquidation and bridge hack risk, Prime Protocol founder Colton Conley told The Block.","Prime Protocol is using Axelar’s messaging technology to enable cross-chain transactions. It is also integrated with Wormhole, which gives Prime Protocol connectivity with non-Ethereum based chains.","It does not currently have a token live, but may at some point in the future, Conley said. Once live, it plans to run incentives to bootstrap liquidity. There may be an airdrop or some type of reward for people who participate on its mainnet, he added.","Many protocols — such as Polygon’s flagship derivatives exchange Gains Network — have added support for Ethereum scaling platform Arbitrum recently. Arbitrum is an Ethereum Layer 2 that currently has the highest market share in the sector, <a href=\"https:\/\/l2beat.com\/scaling\/tvl\" data-v-f87c67ca=\"\">according<\/a> to L2Beat. Prime Protocol is also integrated with Polygon, BNB Chain, Avalanche and Fantom.","Cross-chain applications have started to pick up some traction with interoperability platforms such as LayerZero, Axelar and Wormhole further along in their development. After some growing pains, building applications that mitigate the need to bridge are becoming more of a reality.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Conley","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Colton Conley","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}