{"summary":"Tired: Fiat stablecoins. Wired: Gold on the blockchain. Just ask Novem, a blockchain company that plans to create a stable coin pegged to a hoard of gold","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9769\/novem-is-a-blockchain-connected-horde-of-gold","publishDate":"2019-02-10T15:25:28","id":10637,"type":null,"title":"Novem is a blockchain-connected hoard of gold","category":["BITCOIN"],"content":["Tired: Fiat stablecoins. Wired: Gold on the blockchain. Just ask <a href=\"https:\/\/www.novem.ag\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Novem<\/a>, a blockchain company that plans to create a stable coin pegged to a hoard of gold that will exist in Germany and allow token holders to buy and trade ounces with the ease of a crypto wallet.","Like every stablecoin we have to take these claims with a few pounds of salt, or at least a few kilos of gold. That said, the concept is worth a look.&nbsp;","The stablecoin, called 999.9, is a security token that represents .01 gram of gold. When you buy or sell a chunk the team will send you a certificate for your wee bit o'honey.","\"Novem is a better way to buy gold, with all purchases verified by third-parties at the time of purchase, secure storage with third-party auditing, and at the time of sale. The differentiation from other gold-backed coins is 100% liquidity and 'old economy' precious metals industry certifications,\" said a Novem spokesperson.","\"At this point, over $1,035,000 in NVM [999.9] tokens have been purchased in private sales. There has been significant interest in the project in both the precious metals and blockchain communities.\"","The team is keeping a store of gold in their German vault and have based the company in Liechtenstein. The alleged hoard allows the team to allegedly peg the existing tokens to actual gold with tokens to spare. Again, until we are able to Bourne Identity our way into the bank to check this stuff out we have to be careful making any assumptions about the company. But bless them for trying.","\"By the start of 2019, over 30 kg of gold, valued at nearly $1.5 million, has been stored with Loomis and subject to regular third-party auditing,\" said the spokesperson. \"The quantity of securely-stored physical gold is projected to more than double with a commensurate number of NNN Gold Tokens minted by the time of public sale, which begins in 3 weeks.\"","Should you buy some of this 999.9 token? The token is running on the failure-prone <a href=\"https:\/\/cryptocoremedia.com\/neo-blockchain-failed-fud-fact\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">NEO blockchain<\/a>, a red flag for those thinking of buying a few of these. Further, there is little proof the hoard is extant.&nbsp;","Created by former precious metal traders&nbsp;<a href=\"https:\/\/www.linkedin.com\/in\/wolfgang-schmid-41227183\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Wolfgang Schmid<\/a> and <a href=\"https:\/\/www.linkedin.com\/in\/mario-schober-945a64167\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Mario Schober<\/a> and well as marketing \"guru\" and former parkour athlete&nbsp;Andreas Kalte. Schmid and Schober have extensive experience in buying and selling gold and Kalte, who seems <a href=\"https:\/\/decryptmedia.com\/4739\/parkour-runner-creates-gold-cryptocurrency-andreas-kalteis\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">to be very good at scaling walls<\/a>, offers a little marketing pizazz. Whether that translates to blockchain chops is unclear and whether or not leprechauns are involved in guarding this treasure is still to be decided.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Andreas Kalte","content":"PERSON"},{"type":"Novem","content":"DATE"},{"type":"Loomis","content":"PERSON"},{"type":"$1,035,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Liechtenstein","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Bourne Identity","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Mario Schober","content":"PERSON"},{"type":"Schober","content":"PERSON"},{"type":"Kalte","content":"PERSON"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"Wolfgang Schmid","content":"PERSON"}],"hashtag":[],"authors":["John Biggs","The Block"]}