{"summary":"Republican lawmakers say the Fed&#x27;s new oversight of bank crypto and stablecoin ties is undermining its advancement of a bill.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247760\/republican-trio-says-fed-is-undermining-progress-on-stablecoin-bill","publishDate":"2023-08-28T13:32:22","id":10639,"type":null,"title":"Republican trio says Fed is undermining progress on stablecoin bill","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A trio of Republican lawmakers say the Federal Reserve’s recent action to bolster its oversight of banks’ crypto and stablecoin ties is undermining its advancement of their bill to regulate <a href=\"https:\/\/www.theblock.co\/post\/243720\/jpmorgan-paypal-stablecoin-ethereum\" data-v-f87c67ca=\"\">stablecoins<\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The central bank is \"effectively\" preventing banks from issuing payment stablecoins, the lawmakers said on Monday in a <a href=\"https:\/\/financialservices.house.gov\/news\/documentsingle.aspx?DocumentID=408955\" data-v-f87c67ca=\"\">letter<\/a> to Fed Chair Jerome Powell.&nbsp;<\/span>House Financial Services Committee Chair Patrick T. McHenry, R-N.C., Rep. Bill Huizenga, R-Mich., and Rep. French Hill, R-Ark., signed the letter.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"<\/span><span class=\"s1\" data-v-f87c67ca=\"\">We are concerned that these actions are being taken to subvert progress made by Congress to establish a payment stablecoin regulatory regime. Moreover, if these letters are left in place, they will undoubtedly deter financial institutions from participating in the digital asset ecosystem,\"<\/span><span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;they said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Federal Reserve published a <a href=\"https:\/\/www.federalreserve.gov\/supervisionreg\/srletters\/SR2308.htm\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a>, SR 23-8, for supervised state banks looking to engage in stablecoin activity earlier this month. <\/span><span class=\"s3\" data-v-f87c67ca=\"\">The central bank said those banks wanting engage in stablecoin activity need to have certain controls in place and get a \"<\/span><span class=\"s4\" data-v-f87c67ca=\"\">written notification of supervisory nonobjection from the Federal Reserve\" before moving forward.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The central bank <\/span><span class=\"s1\" data-v-f87c67ca=\"\">also launched the \"Novel Activities Supervision Program,\" SR 23-7,&nbsp; to enhance <\/span><span class=\"s3\" data-v-f87c67ca=\"\">its supervision of all banking organizations it oversees focusing on crypto, distributed ledger technology as well as \"technology-driven partnerships with nonbanks to deliver financial services to customers.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While the supervisory non objection process is masked as guidance outlining a process by which these activities can be permissible, it is clear the Fed does not intend to allow any such activity, at least as it relates to public, permissionless blockchains,\" the lawmakers said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The three also posed a list of questions to the Federal Reserve, including whether it plans to consult state banking regulators, specifically when the state banking regulator allows certain payment stablecoin activities.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The lawmakers said they want the central bank to respond by Sept. 29. A spokesperson for the bank told The Block that it received the letter and intends to respond.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The letter comes as the House Financial Services Committee advanced a comprehensive regulatory <a href=\"https:\/\/www.theblock.co\/post\/241852\/stablecoins-bill-advances-in-us-house-after-tense-day-of-debate\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">framework<\/span><\/a> for stablecoins, though bipartisan negotiations hit a snag in July.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"A regulatory framework established by Congress will better protect consumers and provide certainty to market participants,\" the Republican lawmakers said in the letter.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Yet, instead of working with Congress to establish a workable regime, less than two weeks after the Committee's action, the Fed released SR 23-7 and SR 23-8,\" they added.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Bill Huizenga","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sept. 29","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Committee","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Jerome Powell","content":"PERSON"},{"type":"Mich.","content":"LOCATION"},{"type":"House Financial Services Committee Chair Patrick T. McHenry","content":"ORGANIZATION"},{"type":"8","content":"DATE"},{"type":"7","content":"DATE"},{"type":"Ark.","content":"LOCATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}