{"summary":"In the opinion and order, Magistrate Judge Sarah Netburn called out the SEC&#x27;s use of conflicting arguments to shield the documents.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157448\/judge-reaffirms-that-sec-must-produce-materials-related-to-hinman-speech-in-ripple-case","publishDate":"2022-07-13T17:48:18","id":10643,"type":null,"title":"Judge reaffirms that SEC must produce materials related to Hinman speech in Ripple case","category":["LEGAL"],"content":["A magistrate judge reaffirmed yesterday that the Securities and Exchange Commission (SEC) must hand over documents related to former Commissioner Bill Hinman's speech on cryptocurrencies in its case with Ripple.","Notably, Magistrate Judge Sarah Netburn's opinion further accused the regulator of adopting arguments to further its desires rather than adhere to the law.&nbsp;","The SEC first <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\">brought a case<\/a> against the distributed ledger tech company in 2020, when it alleged the sale of its XRP token constituted an unregistered securities offering. Ripple has pushed back since then, claiming XRP isn't a security and taking aim at what it sees as a lack of clarity in the regulator's stance on crypto.","A 2018 speech by former Director of the Division of Corporate Finance has become a <a href=\"https:\/\/www.theblock.co\/linked\/142029\/ripple-celebrates-new-order-in-sec-case\" data-v-f87c67ca=\"\">sticking point<\/a> in the case. In those remarks, Hinman explained why he didn't consider bitcoin and ether to be securities. Ripple has been seeking to obtain documents and communications related to the speech, while the SEC has employed multiple conflicting arguments in an attempt to shield them.","The SEC first argued that the speech consisted of Hinman's personal views on crypto rather than an agency-wide policy. But then, it attempted to paint the speech as part of Hinman's SEC duties by arguing the communications were protected by deliberative process privilege. The statute protects certain information that was part of internal deliberations in crafting policy or reaching decisions.&nbsp;","The Court was unconvinced by both arguments, ruling that the SEC would have to produce the documents. Netburn denied the SEC's request to reconsider the court order in April. At that time, her order <a href=\"https:\/\/www.theblock.co\/linked\/142029\/ripple-celebrates-new-order-in-sec-case\" data-v-f87c67ca=\"\">admonished<\/a> the SEC for seeking to have it both ways.&nbsp;","The securities regulator made another attempt to shield the documents in June by arguing that attorney-client privilege applied to the speech, as it was developed with SEC attorneys as part of Hinman's official duties. Yesterday, Netburn denied that as well, reaffirming that the SEC will have to produce the communications.","In her opinion, she accuses the agency of trying to have it both ways, first arguing the speech was irrelevant since it reflected personal views and later that the evidence should be protected because it was official agency deliberations.","\"This question is made unnecessarily complicated by the SEC’s litigation tactics. The SEC has distanced itself from the Speech to avoid discovery and sought to preclude Hinman’s deposition on the grounds that whatever he said in the Speech, it had nothing to do with the SEC’s position. The hypocrisy in arguing to the Court, on the one hand, that the Speech is not relevant to the market’s understanding of how or whether the SEC will regulate cryptocurrency, and on the other hand, that Hinman sought and obtained legal advice from SEC counsel in drafting his Speech, suggests that the SEC is adopting its litigation positions to further its desired goal, and not out of a faithful allegiance to the law.\"","The opinion contends that it's clear the purpose of the communications between Hinman and SEC counsel wasn't to provide legal advice or to inform agency decision-making, so the communications are not protected under the statutes the SEC has sought to employ.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Division of Corporate Finance","content":"ORGANIZATION"},{"type":"Netburn","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sarah Netburn","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Hinman","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Bill Hinman","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}