{"summary":"One source told The Block that they are expecting approvals for S-1 forms tonight. Other analysts are expecting a decision by 6pm ET.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271570\/sec-decision-on-spot-bitcoin-etfs-expected-to-come-today-heres-what-we-know","publishDate":"2024-01-10T10:38:53","id":10644,"type":null,"title":"SEC decision on spot bitcoin ETFs expected to come today: Here’s what we know","category":["COMPANIES"],"content":["While the SEC’s meticulous planning around the potential approval of a spot bitcoin ETF was thrown into chaos yesterday — as its <a href=\"https:\/\/www.theblock.co\/post\/271373\/secs-x-account-compromised-to-post-fake-spot-bitcoin-etf-approval\" data-v-f87c67ca=\"\">X account was breached<\/a> and a fake approval post was put out — all signs continue to point toward a decision coming today.","One high-ranking executive at a prospective spot bitcoin ETF issuer told The Block that they are expecting approvals for S-1 forms tonight.","Fox Business journalist Eleanor Terrett similarly <a href=\"https:\/\/twitter.com\/EleanorTerrett\/status\/1745084096752005521\" data-v-f87c67ca=\"\">said on X<\/a> that multiple potential spot bitcoin ETF issuers have said they are still very optimistic about approvals coming through today.&nbsp;","While issuers and analysts appear to agree that the decision will likely come through today, what's less clear is when they might come in.","Bloomberg ETF analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1745059713224454248?t=PA9Q55CnOGRHLrf7lvResg&amp;s=19\" data-v-f87c67ca=\"\">said<\/a>, “Most likely is we see formal approvals ballpark 4-6pm [ET] today with the Derby starting on Thursday,” he said.","His colleague James Seyffart <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1745062327202803740\" data-v-f87c67ca=\"\">noted<\/a> that approvals could come anytime until roughly 6pm ET, suggesting that they might come after market close.","The approval process is fairly straightforward but has a few moving parts.&nbsp;","A big step will be if the SEC approves the 19b-4 forms filed by the respective spot bitcoin ETF applicants. These should appear on the <a href=\"https:\/\/www.sec.gov\/rules\/sro\/national-securities-exchanges\" data-v-f87c67ca=\"\">SEC website<\/a>. This is the main sign that the spot bitcoin ETFs have been approved.","However, the final step is for the S-1 forms to go effective. These will likely appear on the SEC’s filing system <a href=\"https:\/\/www.sec.gov\/edgar\/search\/#\" data-v-f87c67ca=\"\">EDGAR<\/a>. The key difference is that the forms will no longer have the red text saying that the “prospectus is not complete and may be changed.”&nbsp;","Once the 19b-4 forms have been approved and the S-1 forms are deemed effective then trading can begin. Issuers have said that they are ready to start trading tomorrow if the ETFs are approved today.","Stuart Barton, co-founder at Volatility Shares, estimates that the S-1 forms might come first in order to even out the playing field.","\"There's a couple of things going on, so obviously the S-1, effectively the registration statements of the funds — I have a feeling will be approved first and the reason for that is I think the SEC, their objective here is to bring everyone to market at the same time.\"","If they approve 19b-4s before the S-1s, that could potentially give Grayscale a head start because they already have an effective fund, Barton said.","Barton said he believes the process itself could all happen within a half hour after close.\" I think their objective is to level the playing field so they'll bring others to the same point as Grayscale and just give everyone their 19b-4s at the same time,\" Barton said.","On Tuesday, the SEC's official account posted that the SEC had granted approval for listing bitcoin ETFs on all registered securities exchanges with an image showing a quote by SEC Chair Gary Gensler. It was shortly deleted with follow up posts claiming it was unauthorized and that spot bitcoin ETFs had not been approved by that point.","The SEC has said it will <a href=\"https:\/\/www.theblock.co\/post\/271423\/sec-says-it-will-work-with-law-enforcement-following-unauthorized-access-to-x-account\" data-v-f87c67ca=\"\">work with law enforcement<\/a> to investigate the breach and any related misconduct. X said the breach happened as someone <a href=\"https:\/\/www.theblock.co\/post\/271440\/x-reveals-sec-account-breach-stemmed-from-unprotected-phone-number\" data-v-f87c67ca=\"\">obtained control<\/a> over a phone number associated with the account. The social media platform said the SEC did not set up two-factor authentication for its account when it was compromised.","The exploit did cause some alarm. One executive at a prospective ETF issuer <a href=\"https:\/\/www.reuters.com\/technology\/us-sec-has-not-approved-bitcoin-etfs-social-media-account-compromised-2024-01-09\/\" data-v-f87c67ca=\"\">told Reuters<\/a> that they were concerned the SEC might delay or withhold approval for the spot bitcoin ETFs as a result.&nbsp;","Over the last few days, many of the prospective spot bitcoin ETF issuers have dropped their fees to make their products more attractive when launched. This morning, BlackRock and Ark Invest\/21Shares slashed their fees even lower.&nbsp;","BlackRock has reduced its sponsor fee for its potential spot bitcoin ETF from 0.3% to 0.25% and reduced its temporary discount from 0.2% to 0.12% for the first $5 billion of assets in the first 12 months from launch.","Ark Invest\/21Shares also cut its fee from 0.25% to 0.21% and is maintaining its zero fees for the first six months or until $1 billion in assets, per its latest<a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1869699\/000119312524005412\/d549524ds1a.htm\" data-v-f87c67ca=\"\"> S-1 form<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.12%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Barton","content":"PERSON"},{"type":"0.3%","content":"PERCENT"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"1","content":"DATE"},{"type":"Stuart Barton","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"0.21%","content":"PERCENT"},{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"James Seyffart","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"Volatility Shares","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"0.2%","content":"PERCENT"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Fox Business journalist Eleanor Terrett","content":"ORGANIZATION"}],"hashtag":["BITCOIN","SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}