{"summary":"Polkadot developers say token has decentralized sufficiently to no longer be considered a security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183283\/polkadot-backers-say-sec-should-no-longer-treat-token-as-a-security","publishDate":"2022-11-04T16:14:40","id":10640,"type":null,"title":"Polkadot backers say SEC should no longer treat token as a security","category":["REGULATION"],"content":["The Web3 Foundation that funds development of Polkadot said the blockchain’s token should no longer be considered a security subject to regulation by the U.S. Securities and Exchange Commission.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The Polkadot blockchain’s native digital asset (DOT) has morphed and is no longer a security,'' Chief Legal Officer Daniel Schoenberger said in a <a href=\"https:\/\/medium.com\/web3foundation\/less-trust-more-truth-polkadots-native-token-dot-has-morphed-and-is-not-a-security-b2a8847a70cc\" data-v-f87c67ca=\"\">blog post<\/a>. \"It is software.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSchoenberger said the foundation has been working with the SEC for three years as it sought a path that could permit a digital asset initially offered as a security to be re-evaluated at a later date. The transition would resemble other simple agreements for future tokens, or SAFTS, a legal structure that sells investment contracts for future tokens as a security while distancing the tokens themselves from that sale.&nbsp;","This regulatory shelter became a pressing concern following the <a href=\"https:\/\/www.theblock.co\/linked\/84766\/sec-56-court-cases-2017-dao\" data-v-f87c67ca=\"\">SEC's landmark DAO Report<\/a> in July 2017, which said an ICO could be a securities offering and thus require registration. The crypto industry's subsequent dealings with the SEC have been somewhat contentious, with industry players deriding its “come in and talk to us” message.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"The stakes were high, and the margin for error was slim,\" Schoenberger said, citing a \"spirit of open communication and dialogue\" with the SEC. \"Whatever it took in order for DOT, the native token of the Polkadot blockchain to be — or to become — a non-security, we were willing to do it.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDoubts remain as to whether the current SEC believes SAFTS can truly decentralize at all.&nbsp; The SEC did not respond to requests for comment.&nbsp;","In October 2017 and March 2019, the Web3 Foundation&nbsp;<a href=\"https:\/\/www.sec.gov\/edgar\/search\/#\/q=polkadot&amp;dateRange=all&amp;filter_ciks=0001720805&amp;filter_entityName=Web%25203.0%2520Technologies%2520Foundation%2520%2520(CIK%25200001720805)\" data-v-f87c67ca=\"\">reported<\/a> sales of Polkadot SAFTs under Reg. D, which reserves sales for accredited investors. The Polkadot network did not reach its final launch until last December.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe current&nbsp;<a href=\"https:\/\/coinmarketcap.com\/currencies\/polkadot-new\/\" data-v-f87c67ca=\"\">market cap<\/a>&nbsp;for DOT is just under $8 billion.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"October 2017","content":"DATE"},{"type":"December","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Daniel Schoenberger","content":"PERSON"},{"type":"March 2019","content":"DATE"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Schoenberger","content":"PERSON"},{"type":"July 2017","content":"DATE"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["SEC"],"authors":["Kollen Post","The Block"]}