{"summary":"Layoffs were carried out earlier this week following an impromptu 15-minute all hands meeting, a person familiar with the matter said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159786\/gods-unchained-developer-immutable-lays-off-around-8-of-staff","publishDate":"2022-07-27T07:23:56","id":10641,"type":null,"title":"Gods Unchained developer Immutable lays off around 8% of staff","category":["WEB3"],"content":["The blockchain gaming brand behind web3 game Gods Unchained has cut its staff by \"more than 20\" employees, two people familiar with the matter told The Block.&nbsp;","The cuts amount to around 8% of developer Immutable's workforce, according to its employee headcount of 310 on LinkedIn. The reorganization is focused on Gods Unchained, Immutable Games' flagship strategy non-fungible token (NFT) card game, three sources said. Other job losses were concentrated in Immutable's talent acquisition team.&nbsp;","The layoffs were carried out earlier this week following an impromptu 15-minute all hands meeting, according to one person, who was granted anonymity due to the sensitivity of the story.&nbsp;","Immutable did not respond to The Block's requests for comment before press time, but told gaming publication <a href=\"https:\/\/www.kotaku.com.au\/2022\/07\/australian-studio-immutable-redundancies\/\" data-v-f87c67ca=\"\">Kotaku<\/a>, which first reported the cuts earlier this morning, that the \"small reorganization\" would \"better enable [it] to achieve [the] goal of creating the next generation of web3 games.\"","\"We hate to lose members of our team and will ensure a smooth transition for those affected by the reorganization,\" it said, adding that it would \"continue to grow at pace\" and is on track to reach 360 total headcount in the next five months.&nbsp;","The cuts are the latest example of a web3 or crypto-first organisation shedding employees. Earlier this month, NFT marketplace OpenSea laid off around <a href=\"https:\/\/www.theblock.co\/post\/157645\/nft-marketplace-opensea-lays-off-about-20-of-its-team\" data-v-f87c67ca=\"\">20% of its staff<\/a> in one fell swoop. <span data-contrast=\"auto\" data-v-f87c67ca=\"\">Coinbase, Gemini, BlockFi and BitMEX have all also announced <a href=\"https:\/\/www.theblock.co\/post\/156005\/boom-turns-to-bust-a-summary-of-recent-crypto-layoffs\" data-v-f87c67ca=\"\">significant cuts in their headcount<\/a> — reversing initial targets to double or even triple staffing by the end of the year.&nbsp;<\/span>","The Australia-based gaming studio had built a reputation for being one of the pioneers of blockchain and NFT gaming, attracting bumper funding rounds and high valuations. The news follows an announcement in June that the company is launching a <a href=\"https:\/\/www.theblock.co\/linked\/152698\/immutable-launches-500-million-development-fund-for-web3-game-adoption\" data-v-f87c67ca=\"\">$500 million fund<\/a> for web3 game adoption.","It also raised <a href=\"https:\/\/www.theblock.co\/post\/136548\/immutable-raises-200-million-nft-crypto\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$200 million<\/a> in Series C funding on March 7, reaching a $2.5 billion valuation and has previously received backing from big-named players such as Coinbase Ventures, Animoca Brands, Tencent and Temasek.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"8%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Temasek","content":"ORGANIZATION"},{"type":"Kotaku","content":"LOCATION"},{"type":"Immutable","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Australia","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"March 7","content":"DATE"}],"hashtag":["HIRING","LAYOFFS"],"authors":["Lucy Harley-McKeown","The Block"]}