{"summary":"Self-custodial solutions provider Casa has launched ether vaults, adding to its existing bitcoin vault product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235789\/casa-ether-vault-bitcoin","publishDate":"2023-06-21T11:00:39","id":10649,"type":null,"title":"Casa launches self-custody vault for ether, expanding on bitcoin product","category":["COMPANIES"],"content":["Casa, a self-custodial solutions provider, has launched ether vaults, adding to its existing bitcoin vault product.","Casa’s multi-key vaults provide enhanced security by enabling an easy way for users to hold ether in their own digital vault with up to five keys. The vaults offer more distributed security compared to single-key hardware wallets, browser extensions or third-party custodians like crypto exchanges.&nbsp;","By requiring signatures from multiple devices for transactions, known as multisig, Casa helps keep funds protected even if a key is lost or compromised, eliminating concerns over theft, loss or exchange mismanagement. The company also offers additional resources and services to assist members in taking self-custody, including guided key replacement, personalized support and emergency recovery service — where Casa holds a backup key on their behalf.","“The digital asset revolution begins with self-custody,” Casa CEO Nick Neuman said in a press release. “Our team designed Casa to help more people take control of their digital wealth, and we’re thrilled to expand that opportunity for our members and the Ethereum community at large. Everyone deserves to know their assets are safe.”","Casa has also updated its app, offering new membership <a href=\"https:\/\/keys.casa\/pricing\/\" data-v-f87c67ca=\"\">plans<\/a>, ranging from a standard plan with a three-key vault to a premium membership with a five-key vault for bitcoin and ether. Investors and families with substantial holdings can access digital inheritance planning services.","“The rollout marks Casa’s first step into building a more comprehensive self-custody offering,” Casa said in the release. “In recent years, it has become technically sound to implement Ethereum support via smart contract, which has dovetailed with market demand,” the company added, referencing a <a href=\"https:\/\/grayscale.com\/learn\/2021-bitcoin-investor-study\/\" data-v-f87c67ca=\"\">recent survey<\/a> by crypto asset manager Greyscale that found 87% of bitcoin investors also have exposure to at least one altcoin.&nbsp;","The company said it was “gathering feedback on adding support for other ETH-related assets, such as NFTs, stablecoins and ERC-20 tokens,” in the release.","“We always listen very closely to our community, and support for Ethereum was one of the most frequent requests from our members. Building a customer-first framework is at the core of what we do, so we will continue to take notice of what customers ask for,” Neuman expanded in an emailed statement to The Block.","“While users can initially secure only ETH and\/or BTC with Casa, we are taking a thoughtful and strategic approach in regard to what we choose to build next, and we are carefully evaluating what aligns with our technology and our privacy and security standards.”","Casa <a href=\"https:\/\/www.theblock.co\/post\/190825\/ethereum-storage-coming-to-custodian-casa-as-centralized-exchanges-lose-their-luster\" data-v-f87c67ca=\"\">announced<\/a> its ether self-storage plans in November, expecting it would be available in Q1 shortly after launching a new app in January. The new app design was released in February, introducing vaults. Only now is the ether self-custody solution available for the first time.","“We had hoped to release it in Q1,” Neuman told The Block. “Our customers have been excited for ETH support, and we were hoping to deliver it a bit earlier this year.”","“But we are laser-focused on building a highly secure product with a simple user experience. Those two things are not easy to do together, and doing that well takes time. We took the time to do it right and build an experience we’re proud of, and that offers our members the high level of security and usability that they expect and deserve,” Neuman added.","Recent bank failures, the collapse of centralized crypto exchanges like <a href=\"https:\/\/www.theblock.co\/post\/186132\/ftx-collapse-timeline-six-days-that-rocked-the-crypto-industry\" data-v-f87c67ca=\"\">FTX<\/a> and the U.S. Securities and Exchange Commission’s actions against <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">Binance<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">Coinbase<\/a>, have highlighted the importance of self-custody.&nbsp;","“A lot of people learned the hard lesson of why holding your own keys is important,” Neuman <a href=\"https:\/\/www.theblock.co\/post\/190825\/ethereum-storage-coming-to-custodian-casa-as-centralized-exchanges-lose-their-luster\" data-v-f87c67ca=\"\">told<\/a> The Block in an interview following FTX’s demise. There had been a “huge” number of new users joining its platform, he claimed at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nick Neuman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"87%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Casa","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"November","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Neuman","content":"PERSON"},{"type":"Greyscale","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","WALLET MAKERS"],"authors":["James Hunt","The Block"]}