{"summary":"Hong Kong&#x27;s Securities and Futures Commission has given OSL a license for bitcoin and ether retail trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242959\/hong-kong-osl-bitcoin-ethereum-license","publishDate":"2023-08-03T08:28:52","id":10659,"type":null,"title":"Hong Kong&#x27;s OSL receives license for Bitcoin and Ethereum retail trading","category":["REGULATION"],"content":["OSL has received a license from Hong Kong's financial regulator for retail crypto trading. The exchange becomes the second crypto trading platform in the city to obtain a retail services license, <a href=\"https:\/\/www.theblock.co\/post\/242897\/hashkey-obtains-first-license-in-hong-kong-to-offer-crypto-retail-trading\" data-v-f87c67ca=\"\">after HashKey's approval today<\/a>.&nbsp;The Security and Futures Commission license uplift allows Hong Kong retail investors to begin trades in bitcoin and ether.","\"This is a significant first-mover advantage, and a direct result of our strategy of putting regulation and compliance first. It demonstrates how regulation is the foundation of future growth and mainstream acceptance in the digital asset space,\" OSL CEO Hugh Madden said.","\"By granting this license uplift, the SFC has shown that it is possible for digital asset markets to be regulated and safe and we believe this will usher in a new era of growth and acceptance for digital assets, and we are excited to be at the forefront of this movement,\" head of regulatory affairs at BC Technology Group Gary Tiu said.","Unlike China's ongoing crypto ban, Hong Kong has adopted a more-welcoming stance towards crypto firms this year. To bolster its position as a global financial hub, authorities released several policy statements about cryptocurrencies in October and passed an amendment in December that initiated&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/237483\/hong-kong-government-sets-up-web3-task-force-to-help-build-a-thriving-ecosystem\" data-v-f87c67ca=\"\">a full licensing regime<\/a> for virtual asset service providers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hugh Madden","content":"PERSON"},{"type":"BC Technology Group Gary Tiu","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"December","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Brian McGleenon","The Block"]}