{"summary":"The Marshall Islands has gone one step forward in its acceptance of DAOs by allowing these organizations to register as LLCs in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197435\/marshall-islands-dao-law","publishDate":"2022-12-22T09:00:02","id":10655,"type":null,"title":"DAOs recognized as limited liability companies by the Marshall Islands","category":["POLICY"],"content":["The Republic of the Marshall Islands passed a law providing recognition of DAOs as limited liability companies (LLCs)","The Pacific island nation passed the Decentralized Autonomous Organizations Act of 2022 on Thursday, extending the <a href=\"https:\/\/www.theblock.co\/post\/173171\/a-crypto-lawyer-dissects-the-impact-of-the-cftc-targeting-daos\" data-v-f87c67ca=\"\">legality of DAOs<\/a>, according to an announcement. Earlier in the year, <a href=\"https:\/\/www.theblock.co\/post\/57547\/marshall-islands-digital-currency-will-be-built-on-algorand-blockchain\" data-v-f87c67ca=\"\">the Marshall Islands<\/a> became the first country to <a href=\"https:\/\/www.globenewswire.com\/news-release\/2022\/02\/15\/2385589\/0\/en\/The-Republic-of-the-Marshall-Islands-Formally-Recognizes-DAO-Incorporation.html\" data-v-f87c67ca=\"\">recognize DAOs as legal entities<\/a>.","The new law will allow DAOs, decentralized communities that power crypto and blockchain projects, to be incorporated in the Marshall Islands. It will provide these decentralized crypto communities with an internationally recognized LLC structure as long as they identify as DAO LLCs, the announcement stated. This means that such organizations will need to have DAO LLC as part of their name.","The Marshall Islands’ new law covers both for-profit and not-for-profit DAOs. The legal framework also recognizes the internal governance processes of these organizations, including voting on proposals and tokenization.","As part of the newly passed law, the government has also created a registry process for these crypto communities. The Marshall Islands DAO, or MIDAO, will helm this registry, according to the announcement. MIDAO will be responsible for onboarding crypto and blockchain communities that wish to register as LLCs in the island nation.","The DAO law is an extension of the island nation’s experience in international business registration and compliance, Finance Minister Brensen Wase stated in the release.","“With this adoption of the DAO Act of 2022, The Marshall Islands commits its courts and its resources to the burgeoning world of decentralization, and recognizes the unique place that decentralized autonomous organizations can hold not just in the blockchain space, but in the broader economy as well,” said Wase.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DAO LLC","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"The Marshall Islands","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Marshall Islands","content":"ORGANIZATION"},{"type":"Marshall Islands DAO","content":"ORGANIZATION"},{"type":"Brensen Wase","content":"PERSON"},{"type":"Pacific","content":"LOCATION"},{"type":"Wase","content":"PERSON"},{"type":"Marshall Islands","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","DAOS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}