{"summary":"The daily trading volume on Base surged to hit its new high of $356 million on Tuesday, after Dencun upgrade lowered fees for users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283867\/base-daily-volume-surge","publishDate":"2024-03-21T03:57:31","id":10658,"type":null,"title":"Daily volume on Base network sees 51% surge to $356 million","category":["EXCHANGES"],"content":["The daily trading volume on the Ethereum Layer 2 network, Base, surged to hit a new high of $356 million on Tuesday, representing about a 51% jump from Monday, according to DefiLlama data.","Base’s total value locked (TVL) also reached a new all-time high, amassing a total of <a href=\"https:\/\/defillama.com\/chain\/Base?volume=true\" data-v-f87c67ca=\"\">$745.3 million<\/a>, according to data. It recorded daily transactions of 1.65 million and nearly 130,000 new users on the network on Wednesday, according to analytics platform <a href=\"https:\/\/dune.com\/sixdegree\/base-blockchain-overview\" data-v-f87c67ca=\"\">Dune<\/a>.","The Base network <a href=\"https:\/\/www.theblock.co\/post\/283056\/base-dencun-transactions-users-surge\" data-v-f87c67ca=\"\">experienced<\/a> significant growth in activity earlier this month after the rollout of <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">Dencun<\/a>, registering over 1 million transactions on March 17, up from around 440,000 prior to the Ethereum upgrade. For the time being, the network’s activity has surpassed that of competitors like Arbitrum and Optimism in terms of on-chain activity.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","“The surge in activity on Coinbase’s Base network can be attributed to Ethereum’s recent Dencun upgrade, which significantly reduced transaction fees on Layer 2 networks, making Base one of the most cost-effective options in the market to utilize Ethereum,” stated Joe Caselin, head of institutional marketing at BIT. While Dencun may have been the catalyst, most of the activity yesterday occurred amid a brief spike in average transaction fees to over $1, data indicates.","Analysts further predict continued growth for Base, as Coinbase endeavors to connect its users to the on-chain economy. Coinbase recently unveiled its smart wallet, which is expected to allow traders to use their balances on the crypto exchange directly on-chain.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Base","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 17","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"Joe Caselin","content":"PERSON"},{"type":"51%","content":"PERCENT"},{"type":"$356 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Dencun","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$745.3 million","content":"MONEY"}],"hashtag":["COINBASE","MEMECOINS"],"authors":["Danny Park","The Block"]}