{"summary":"Fidelity has started opening retail crypto trading accounts after first announcing a waiting list earlier this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190286\/ready-to-trade-fidelity-finally-opens-retail-crypto-accounts","publishDate":"2022-11-28T10:02:29","id":10652,"type":null,"title":"Ready to trade? Fidelity finally opens retail crypto accounts","category":["EXCHANGES"],"content":["Fidelity has opened up <a href=\"https:\/\/www.fidelity.com\/crypto\/trading\" data-v-f87c67ca=\"\">retail crypto<\/a> trading accounts after first announcing a <a href=\"https:\/\/www.theblock.co\/post\/182635\/fidelity-turns-its-attention-to-retail-investors-with-new-crypto-offering\" data-v-f87c67ca=\"\">waiting list<\/a> earlier this month.","\"The wait is over,\" the investment powerhouse said in an email Monday sent to some users, adding that a Fidelity brokerage account was needed to be able to fund a new Fidelity Crypto account.","Once opened, the account promises commission-free trading of bitcoin and ether. Users trying to open an account were asked to read and accept a number of disclosures, including a risk statement which stated that \"investing in, buying, and selling digital assets presents a variety of risks that are not presented by investing in, buying, and selling products in other, more traditional asset classes.\"","They were also reminded that \"digital assets can fluctuate quickly, and materially.\" The service says a spread of 1% will be factored into every trade execution price.","While Fidelity has been quicker to embrace digital assets than most other large investment companies, it has received some pushback. Three U.S. senators l<a href=\"https:\/\/www.theblock.co\/post\/188869\/three-u-s-senators-ask-fidelity-to-reconsider-bitcoin-exposure-in-retirement-plans\" data-v-f87c67ca=\"\">ast week asked<\/a> the firm to reconsider a decision to allow retirement plan participants to invest in bitcoin, saying the industry has become increasingly \"volatile, tumultuous and chaotic.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fidelity Crypto","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"}],"hashtag":["CRYPTO"],"authors":["Nathan Crooks","The Block"]}