{"summary":"&quot;We went through a tough fourth quarter&quot; due to the declining price of bitcoin and lower market demand, said Canaan CEO Nangeng Zhang.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217675\/canaan-reveals-tough-fourth-quarter-with-revenue-down-60","publishDate":"2023-03-07T06:27:48","id":10656,"type":null,"title":"Canaan reveals tough fourth quarter with revenue down 60%","category":["CRYPTO INFRASTRUCTURE"],"content":["Canaan Inc. shared its unaudited fourth-quarter and full-year financial results for 2022 — showing a big decline toward the end of the year.","Total computing power sold in Q4 2022 <a href=\"https:\/\/www.prnewswire.com\/news-releases\/canaan-inc-reports-unaudited-fourth-quarter-and-full-year-2022-financial-results-301764353.html\" data-v-f87c67ca=\"\">decreased<\/a> by 45.8% to 1.9 million Thash\/s from 3.5 million Thash\/s in Q3. Worse yet, Canaan saw a decrease of 82.1% from Q4 2021.","Meanwhile, revenues decreased by 59.9% from Q3 2022 and 82.1% from Q4 2021. However, mining revenue increased by 16.3% from Q3 2022 and 368.2% from Q4 2021.","Year-over-year decreases are also reported in total computing power sold and revenues, with the former dropping by 32.4%.","\"We went through a tough fourth quarter as the further sinking bitcoin price during the quarter led to lackluster market demand for mining machines as we expected,\" said Canaan Chairman and CEO Nangeng Zhang.","Canaan CFO James Jin Cheng noted that the company's gross loss was, in part, due to greater depreciation resulting from its growing bitcoin mining fleet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nangeng Zhang","content":"PERSON"},{"type":"16.3%","content":"PERCENT"},{"type":"Canaan Chairman","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"45.8%","content":"PERCENT"},{"type":"368.2%","content":"PERCENT"},{"type":"32.4%","content":"PERCENT"},{"type":"Canaan","content":"PERSON"},{"type":"James Jin Cheng","content":"PERSON"},{"type":"82.1%","content":"PERCENT"},{"type":"Canaan Inc.","content":"ORGANIZATION"},{"type":"fourth quarter","content":"DATE"},{"type":"59.9%","content":"PERCENT"}],"hashtag":["MINING COMPANIES"],"authors":["Adam James","The Block"]}