{"summary":"The testing process will assess whether an &quot;exposure free&quot; approach makes a CBDC less vulnerable to hackers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152949\/israel-working-with-hong-kong-to-test-digital-currency-risk-bloomberg-says","publishDate":"2022-06-19T04:25:12","id":10657,"type":null,"title":"Israel working with Hong Kong to test digital currency risk, Bloomberg says","category":["RESEARCH"],"content":["The Bank of Israel is working with the Hong Kong Monetary Authority on testing a new digital currency against cyber security risks, the Bank of Israel <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-06-16\/israel-and-hong-kong-team-up-to-test-digital-currency-cyber-risk?utm_medium=social&amp;utm_campaign=socialflow-organic&amp;utm_source=twitter&amp;utm_content=crypto#xj4y7vzkg\" data-v-f87c67ca=\"\">told Bloomberg<\/a> in a statement.&nbsp;","The joint project will start in the third quarter, using a two-tier central bank digital currency (CBDC), Bloomberg reported on Thursday.","The retail CBDC is being designed to allow intermediaries, such as banks, handle it with no financial exposure to their customers, and the testing process will assess whether this makes it less vulnerable to hackers.","Such an “exposure-free” CBDC may carry “less financial risk for the customer, more liquidity, lower costs, increased competition, and wider access,” Bloomberg cited the Bank of Israel as saying.&nbsp;","The Bank for International Settlements’ Innovation Unit will also take part in the trial.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bank of Israel","content":"ORGANIZATION"},{"type":"Bank for International Settlements’ Innovation Unit","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Millard","The Block"]}