{"summary":"The Financial Accounting Standards Board&#x27;s new rule becomes effective in 2025, but companies can apply it earlier. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249557\/accounting-regulator-will-let-firms-report-crypto-at-fair-market-value-bloomberg-law","publishDate":"2023-09-06T14:34:39","id":10654,"type":null,"title":"Accounting regulator will let firms report crypto at fair market value: report","category":["POLICY"],"content":["The Financial Accounting Standards Board, a U.S. regulating body that sets general accounting practices, has approved new rules to allow companies to report their crypto holdings at fair market value.&nbsp;","The rules will be published by the end of 2023 and become active in 2025, but companies can apply the rules early, Bloomberg Law <a href=\"https:\/\/news.bloomberglaw.com\/crypto\/long-awaited-bitcoin-accounting-rules-to-capture-rises-dips\" data-v-f87c67ca=\"\">reported<\/a>. Wrapped tokens are exempt from the new rules.","Cody Carbone, vice president of policy at the blockchain trade association Chamber of Digital Commerce, <a href=\"https:\/\/twitter.com\/CodyCarboneDC\/status\/1699451906156818681\" data-v-f87c67ca=\"\">called<\/a> the decision \"huge news.\"","\"The previous accounting measurement was one of the biggest barriers for institutions to hold crypto — they were measured at impairment (measured when price went down but not up),\" he added. \"Fair value makes sense and will encourage institutional holdings of crypto.\"","Fair market value describes an asset's most recent valuation, which can include prices recovering after a dip.&nbsp;","Many major web3 firms such as <a href=\"https:\/\/www.theblock.co\/post\/236904\/microstrategy-bitcoin-12333-btc-for-347-million\" data-v-f87c67ca=\"\">MicroStrategy<\/a>&nbsp;and <a href=\"https:\/\/www.theblock.co\/post\/248984\/bitfinex-bitcoin-balance-sheet\" data-v-f87c67ca=\"\">Bitfinex<\/a> hold bitcoin on their balance sheets. The new rules can \"eliminate the poor optics that have been created by impairment losses under the rules that FASB has had in place,\" Berenberg Capital said in a report.&nbsp;","\"MicroStrategy, since adopting its bitcoin acquisition strategy in August 2020, has reported $2.23 billion of cumulative impairment losses,\" the report said.","\"Some of the quarterly reports the company has released during the past three years have included sizable impairment losses on its bitcoin holdings that reflected downward moves in the cryptocurrency’s price during the quarters in question,\" the report added. \"Some of the larger impairment losses that the MicroStrategy reported — the largest was a $917.8 million loss it recorded in Q222 — led the news coverage of its reports, giving the impression that the company’s inherent value had been negatively impacted when such was not the case.\"","MicroStrategy shares rose on the news, rising 1.2% at 2:30 p.m. ET to $353.52, according to <a href=\"https:\/\/www.tradingview.com\/symbols\/NASDAQ-MSTR\/\" data-v-f87c67ca=\"\">TradingView<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Financial Accounting Standards Board","content":"ORGANIZATION"},{"type":"Chamber of Digital Commerce","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"Cody Carbone","content":"PERSON"},{"type":"Bloomberg Law","content":"ORGANIZATION"},{"type":"$2.23 billion","content":"MONEY"},{"type":"1.2%","content":"PERCENT"},{"type":"2:30 p.m.","content":"TIME"},{"type":"FASB","content":"ORGANIZATION"},{"type":"$353.52","content":"MONEY"},{"type":"Berenberg Capital","content":"ORGANIZATION"},{"type":"$917.8 million","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}