{"summary":"Beleaguered crypto exchange FTX says funds are being transferred from FTX Global to other exchanges without approval.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188651\/ftx-wallet-funds-transfer","publishDate":"2022-11-20T11:51:24","id":10650,"type":null,"title":"FTX says &#x27;unauthorized&#x27; transfers have been routed to other exchanges","category":["EXCHANGES"],"content":["FTX said that unauthorized transfers from FTX Global are being sent to other exchanges via crypto wallets.&nbsp;","&nbsp;","Beleaguered crypto exchange FTX said unauthorized fund transfers from FTX Global are being sent to other exchanges via crypto wallets.&nbsp;","\"Exchanges should be aware that certain funds transferred from FTX Global and related debtors without authorization on 11\/11\/22 are being transferred to them through intermediate wallets,\" it <a href=\"https:\/\/twitter.com\/FTX_Official\" data-v-f87c67ca=\"\">said<\/a> on Sunday via Twitter. \"Exchanges should take all measures to secure these funds to be returned to the bankruptcy estate.\"","&nbsp;Blockchain research firm Chainalyasis <a href=\"https:\/\/twitter.com\/chainalysis\/status\/1594349583416840199\" data-v-f87c67ca=\"\">said<\/a> that funds stolen from FTX are on the move and warned exchanges to be on alert in case a hacker tries to cash out.","It did not indicate which exchanges were receiving the funds nor the amount.&nbsp;","This came after news earlier on Sunday that a purported drainer of FTX had <a href=\"https:\/\/www.theblock.co\/post\/188624\/ether-under-pressure-as-ftx-accounts-drainer-cashes-out-for-bitcoin\" data-v-f87c67ca=\"\">cashed out<\/a> in bitcoin after holding more than $300 million in ether.&nbsp;","The identity of the FTX drainer remains unknown. While many say a hacker was able to drain the funds from the embattled exchange — which has filed for Chapter 11 bankruptcy protection — others speculate that the suspicious outflow of funds may be an inside job.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Chainalyasis","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Tom Matsuda","The Block"]}