{"summary":"The team behind Frax Finance has unveiled its strategy to introduce a Layer 2 blockchain, dubbed Fraxtal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235110\/frax-finance-to-launch-ethereum-layer-2-named-fraxchain","publishDate":"2023-06-16T08:22:22","id":10668,"type":null,"title":"Frax Finance to launch Ethereum Layer 2 named Fraxtal","category":["CRYPTO ECOSYSTEMS"],"content":["The team behind <a href=\"https:\/\/www.theblock.co\/post\/141099\/frax-finance-may-buy-large-amounts-of-major-cryptos-to-back-its-stablecoin\" data-v-f87c67ca=\"\">Frax Finance<\/a>, known for creating the Frax stablecoin, has unveiled its strategy to introduce a Layer 2 blockchain: Fraxtal (originally called Fraxchain).","The team said the network will be directed towards creating a smart contract platform with a strong emphasis on decentralized finance. “Fraxchain essentially represents the culmination of the entire <a href=\"https:\/\/frax.finance\/\" data-v-f87c67ca=\"\">Frax ecosystem<\/a> and all of the traction and usage that we’ve gained,” Frax founder Sam Kazemian told The Block.","The network is expected be ready by the end of the year. Fraxtal's governance will be led by the holders of Frax Shares (FXS) tokens. The network will employ the use of the <a href=\"https:\/\/www.theblock.co\/post\/141099\/frax-finance-may-buy-large-amounts-of-major-cryptos-to-back-its-stablecoin\" data-v-f87c67ca=\"\">Frax stablecoin<\/a> and Frax Ether, Frax's liquid staking derivative, for transaction fees. Furthermore, fees generated by the roll-up network could be partly burned or redirected back to the Ethereum mainnet to be distributed among stakers of FXS governance token, Kazemian added.&nbsp;","Incorporating a Layer 2 rollup model in its design, Fraxtal will publish state roots to the Ethereum mainnet for securing the network.","The network will incorporate decentralized sequencers. These sequencers are specialized nodes responsible for ordering transactions into batches in a rollup network. They will be operated by any entity chosen via a governance vote. This feature, according to Kazemian, will differentiate Fraxtal from other Layer 2 solutions on Ethereum, which typically depend on a single sequencer.","“Fraxchain proposes a solution where sequencer roles can be auctioned off and rotated, creating a decentralized sequencer base. If a sequencer is forced to shut down, it would allow the next elected sequencer to pick up from where the previous one left off,” Kazemian said.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Sam Kazemian","content":"PERSON"},{"type":"Frax","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"Kazemian","content":"PERSON"},{"type":"Fraxtal","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["ASSETS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}