{"summary":"BitGo has hired Matthew Ballensweig to lead its Go Network and establish a comprehensive platform for settling crypto and USD transactions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242987\/bitgo-hires-former-genesis-exec-to-build-out-new-settlement-network","publishDate":"2023-08-03T11:06:54","id":10667,"type":null,"title":"BitGo hires former Genesis exec to build out new settlement network","category":["COMPANIES"],"content":["BitGo, a crypto financial services firm, has made a fresh hire to build out a new business that it hopes will place it directly at the center of the industry's nascent capital markets.&nbsp;","Matthew Ballensweig joined the firm to lead BitGo's Go Network, which provides a platform for various market participants to settle crypto and USD. Ballensweig previously <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-09-28\/genesis-s-co-head-of-crypto-sales-and-trading-leaves-in-latest-exit\" data-v-f87c67ca=\"\">worked<\/a> at Genesis, where he served as Managing Director and Co-Head of Trading and Lending before departing last year.&nbsp;","In an interview with The Block, Ballensweig said that last year's meltdown illustrated the weakness of crypto's trading and lending infrastructure which piecemealed bits and pieces of traditional finance — such as due diligence calls to understand how counter-parties were deploying risk, health checks and risk assessments — but lacked real-time information about market participants.&nbsp;","\"There was no live data on equity on exchanges and what you've lent, and when you have a massive drawdown, it puts a lot of stress on a system built like that,\" he said.&nbsp;","In his new seat at BitGo, Ballensweig is vying to build a wall-garden ecosystem of market participants where they can trade across various venues all while keeping their assets within BitGo's qualified custodian. In a sense, it will resemble defunct bank Silvergate's SEN network which allowed for settlement between crypto exchanges across the market. The network will also allow lenders to extend capital to counter-parties knowing that it will stay within the walls of the system.","\"If you lend, the borrower can't strip that out of the BitGo network,\" he said. \"The risk is contained.\"","This isn't BitGo's first foray into a new territory of financial services. The company was among the several firms to throw their hat into the race to become a full-services prime brokers, but the firm scaled back its own lending services in the wake of last year's credit crisis.&nbsp;","“Matt brings a wealth of industry knowledge and market-structure expertise to BitGo having been on the front lines of institutional digital asset trading since 2017,” BitGo CEO Mike Belshe said. “Matt’s depth of understanding and his client relationships, combined with his vision to enhance liquidity and settlement products, will significantly contribute to the commercialization of Go Network.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ballensweig","content":"ORGANIZATION"},{"type":"Silvergate","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Mike Belshe","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Matthew Ballensweig","content":"PERSON"},{"type":"Genesis","content":"LOCATION"},{"type":"Ballensweig","content":"PERSON"},{"type":"Matt’s","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"Matt","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}