{"summary":"The Block spoke with Anchorage Digital co-founder Diogo Mónica about regulation, legislation and the broader global market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239814\/anchorage-sees-institutional-crypto-pie-expanding-despite-bear-market","publishDate":"2023-07-22T09:06:25","id":10660,"type":null,"title":"Anchorage sees institutional crypto pie expanding, despite bear market","category":["COMPANIES"],"content":["The summer doldrums may have set in, but the past weeks have seen a flurry of activity on the institutional side of crypto that hasn't seemed to die down. From filings for <a href=\"https:\/\/www.theblock.co\/post\/237563\/blackrock-refile-for-spot-bitcoin-etf-naming-coinbase-as-surveillance-partner\" data-v-f87c67ca=\"\">spot bitcoin ETF<\/a>s to broader issues surrounding custody and upcoming <a href=\"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill\" data-v-f87c67ca=\"\">legislation<\/a> in the U.S. Congress, debates over foundational topics continue to rage.&nbsp;","The Block spoke with <a href=\"https:\/\/www.anchorage.com\/about\" data-v-f87c67ca=\"\">Anchorage Digital<\/a> co-founder and president <a href=\"https:\/\/twitter.com\/diogomonica\" data-v-f87c67ca=\"\">Diogo Mónica<\/a> in a wide ranging interview that touched on regulation, legislation and the broader global market. The firm is a federally chartered crypto bank in the U.S.","(<em data-v-f87c67ca=\"\">The interview has been edited for length and clarity.<\/em>)&nbsp;","<strong data-v-f87c67ca=\"\">The Block: <\/strong>Let’s start with a broad view of where you see things, now fully into the second half of the year. There have been so many interesting headlines on the institutional front over these past weeks, with all the <a href=\"https:\/\/www.theblock.co\/post\/239737\/blackrocks-larry-fink-says-crypto-will-transcend-any-one-currency\" data-v-f87c67ca=\"\">ETF filings<\/a>. We also saw the news about <a href=\"https:\/\/www.theblock.co\/post\/234551\/prime-trust-banq-bankruptcy\" data-v-f87c67ca=\"\">Prime Trust<\/a>, and then all the ongoing regulatory uncertainty in the U.S. What are you thinking about amid all of this?","<strong data-v-f87c67ca=\"\">Diogo Mónica:<\/strong> I think the best description right now for institutional participation is that institutions are staying, and their growing interest and appetite. The curious thing is that we don't see that from the outside. We, at Anchorage, see it from the inside. As you know, we're institutionally focused.","But these companies have started in the past two years actually participating in the ecosystem and starting projects that take 18 to 24 months for these large organizations, especially for something like crypto that has to be so carefully thought through before it's launched. So now, these ETFs for BlackRock and all of these things are coming out. And so what you're seeing is actually the continued carried momentum with crypto, in the fact that institutions are not shying away from it.","The narrative has shifted a little bit back to real world assets and tokenization, which makes sense because institutions that are talking about it talk about this particular use case that is very friendly toward the regulators and the public at large. We've already been back and forth. Whenever the market is in a bull market, all institutions talk about crypto. And whenever it's not a bull market, they talk about blockchain or tokenization of global assets. This is no different.","The thing that is different this time around is that there are so many legitimate, capitalized institutions in the space. They're not going anywhere. So Anchorage Digital has seen a massive flight to safety in the beginning of the year.","Prime Trust is yet another reason as to why this is continuing. In Q1, we actually grew over 80% the assets on the platform. We are supposed to be in a bear market, and we almost double in one quarter the amount of assets on platform. So that tells you the narrative.","Yes, the larger pie is getting smaller, but the institutional pie is getting bigger.","<strong data-v-f87c67ca=\"\">The Block: <\/strong>You're a federally chartered chartered digital bank. Where do you see the the most growth potential in terms of products that you offer at the moment? Is it just flat out custody or are there other things going on in your platform that might draw interest?","<strong data-v-f87c67ca=\"\">Diogo Mónica: <\/strong>Let me start by saying that we are not \"a federally chartered bank\". We are \"the only federally chartered bank.\" That dramatically changes the question, right?","Something that has been very exciting is, post-Ethereum Shapella upgrade, staking for Ethereum. In the beginning of the year, we had billions of dollars in deposits of Ethereum, and less than 10% of them were being staked. So a very small percentage. And now, we are actually quickly coming closer to 50%. And I'm betting that it will actually land closer to 70% to 80%.","They do not want to take smart contracts risks, and they want to use a bank that has in the charter, we actually have in our charter, staking as one of the services that we offer our clients from the bank charter, so that's very unique because it gives all the regulatory confidence that they're using a provider that can offer these services.","With all of the things that are coming out of the SEC, something unique about being a bank is that we can actually custody securities.<strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/strong>","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>What's your take on the debate in the U.S. going on right now in terms of whether or not there is regulatory clarity in the industry? Do we need new laws? More laws? Or do the current laws work?","<strong data-v-f87c67ca=\"\">Diogo Mónica:<\/strong> There wasn't really clarity, and there still isn't clarity in very many pockets of the world of crypto, but crypto is not one thing, right? Crypto ranges anywhere from stablecoins to NFTs to commodities like bitcoin to potential securities out there. So there's different degrees of clarity in different places.","However, what we did is from day one, we said, 'hey, if there's no clarity, let's get some regulatory apparatus that allows us to do everything effectively regardless of what the outcome is.' That's what we've done.","So everybody else in the space is effectively saying that they have no clarity because they don't want to do the hard thing of actually going to the highest level of scrutiny. We've done the strictly harder thing, so we can operate in regulatory uncertainty, which still exists.","And by the way, our position has always been the more clarity, the better. Regulation coming, regardless of whether it's fantastic regulation for crypto or not, at least that gives us a standard, something to follow, something to work with. And right now there's very little to work with when it comes to securities in crypto and digital assets. That is very much true.<strong data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/strong>","<strong data-v-f87c67ca=\"\">The Block: <\/strong>We've seen a lot talk about regulation at the federal level versus regulation at the state level. You're federally regulated. Do you think there should be one primary regulator? Or could this industry work with state regulators, as happens in parts of the banking industry. Where should the locus of crypto regulation be?","<strong data-v-f87c67ca=\"\">Diogo Mónica: <\/strong><span data-v-f87c67ca=\"\">I do think that for this asset class to have the impact that we want it to have, it needs to be at the federal level. There's a reason why every single big bank is regulated at the federal level. It makes sense because it's the highest level of scrutiny.<\/span>","<span data-v-f87c67ca=\"\">It is dramatically different to be regulated in a state, especially if you're talking about a state like Nevada, or a state like Wyoming. It makes a dramatic difference to be regulated by a regulator&nbsp;<\/span><span data-v-f87c67ca=\"\">that just doesn't have the resources. It doesn't have the people. It doesn't have the historical view with the court cases that we do. We have 200 years of federal cases that say exactly what happens in bankruptcy...and by the way, individual states means individual risk. There's a court in that state that can make an arbitrary decision about the outcome of a specific case, like we are seeing with Celsius, like we're seeing with BlockFi. So that is not beneficial to crypto. It is not beneficial for the same clarity that people are asking from the regulators. And so if people want to be consistent, we want both clarity and the highest level of scrutiny in the land, and that really stands with the federal regulators. So I think that's what we need.<\/span>","<span data-v-f87c67ca=\"\">We should do the harder thing first, rather than start by having a totally disbursed, completely separate set of expectations of what we actually need to do.<\/span>","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>Just to switch gears a bit, I know Anchorage has operations internationally. What's your view of the market abroad right now? Are there any jurisdictions that you're excited about? Is the U.S. at risk of losing out? Are you seeing evidence of that?","<strong data-v-f87c67ca=\"\">Diogo Mónica:&nbsp;<\/strong>Yes. We are. We are seeing evidence of that. We're seeing evidence that companies do not want to do business in the U.S. And in fact, we have a Singaporean license where people can actually still have a regulated entity and still participate in crypto while being outside of United States.","Let me just start by saying though, there's many compounding factors. Tax effects is one of the biggest factors. Lots of companies actually wants to be outside of the United States from a regulatory perspective, and from a tax perspective.","I've had lots of conversations with people that really want to be outside and want to have a hedge.","<strong data-v-f87c67ca=\"\">The Block:&nbsp;<\/strong>What jurisdictions are getting it right?&nbsp;","<strong data-v-f87c67ca=\"\">Diogo Mónica: <\/strong><span data-v-f87c67ca=\"\">Europe has actually done extremely well with Mica. I think there's a couple of things in that law that are literally shooting themselves in the foot, especially around stablecoins, where there's like $200 million limits and things like that are just artificial, don't really help anyone. <\/span>","<span data-v-f87c67ca=\"\">But the law actually provides a lot more clarity and an order of magnitude more clarity that we have in the U.S. So I think that's actually fantastic.<\/span>","<span data-v-f87c67ca=\"\">But Singapore has definitely done things right. They have a regime that is extremely tough and extremely thorough in the way that they do things. <\/span>","<span data-v-f87c67ca=\"\">And then finally, we have Hong Kong which has been a little bit of whiplash type situation where they are either hot or cold. Now they're very much very hot in terms of supporting. And they seem to understand that they would lose this, this financial institution center, if they lose crypto.<\/span>","<span data-v-f87c67ca=\"\">In Hong Kong, the regulators are actually putting pressure on the banks to onboard crypto companies, which is very different from the U.S., very different from Singapore. V<\/span><span data-v-f87c67ca=\"\">ery different from everybody else.<\/span>","<span data-v-f87c67ca=\"\">Why would you want crypto outside of the banking perimeter? No, you want a bank that does crypto so that the regulator actually has oversight. You shouldn't push it abroad. You shouldn't push it outside of the regulatory perimeter. So you should be giving licenses, not rejecting people that apply for licenses. <\/span>","<span data-v-f87c67ca=\"\">So those are the three biggest ones, Singapore, Hong Kong, Europe, and obviously the United States continues to be the bigger market. <\/span>","<strong data-v-f87c67ca=\"\">The Block: <\/strong>Back to the U.S., what do you hope lawmakers and regulator focus on? What should they be thinking about, or paying attention to?&nbsp;","<strong data-v-f87c67ca=\"\">Diogo Mónica: <span data-v-f87c67ca=\"\">Basics. Regulate stablecoins. Tell us what's a stablecoin and what can be called a stablecoin. And don't push it outside of the U.S. perimeter.&nbsp;<\/span><\/strong>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">And number two, tell us which regulator regulates digital assets. <\/span><\/strong><strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">And are they a new thing? Are they securities? Are they commodities? And who gets to decide that?<\/span><\/strong>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Right now, the state of the United States is regulations through enforcement. Every day, there's a new data point for us to integrate into our frameworks that tells us whether something's a security or not, and that's just bad for for everyone.<\/span><\/strong>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> The United States just delays innovation; what we want is clear regulation there. So they have to tell us who makes the decision and force them to make fast decisions.<\/span><\/strong>","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">There's lots and lots of different things around what's sufficiently decentralized, around treatment of NFTs, all these other things, but those are secondary, and those all depend on the first two.<\/span><\/strong>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"billions of dollars","content":"MONEY"},{"type":"Anchorage","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"one quarter","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Europe","content":"LOCATION"},{"type":"Mica","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"U.S","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Diogo Mónica","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wyoming","content":"LOCATION"},{"type":"second half of the year","content":"DATE"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Nevada","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SEC"],"authors":["Nathan Crooks","The Block"]}