{"summary":"Since its launch in 2018, Kava has grown from a single-application blockchain to a thriving DeFi platform with over $2 billion in on-chain assets. As the project embarks on its next phase of growth with the launch of the Kava Ecosystem, we explore Kava’s past, present, and future in a three article series. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123202\/kava-defi-for-the-mainstream","publishDate":"2021-11-03T14:17:19","id":1066,"type":null,"title":"Kava: DeFi for The Mainstream","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Since its launch in 2018, Kava has grown from a single-application blockchain to a thriving DeFi platform with over $2 billion in on-chain assets. As the project embarks on its next phase of growth with the launch of the Kava Ecosystem, we explore Kava’s past, present, and future in a three article series.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In this article, we will look at the origins of Kava and examine how you can maximize your crypto earnings using the three core DeFi protocols that make up the Kava Platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kava is a secure, highly scalable Layer-1 network and DeFi ecosystem. Built using the Cosmos SDK and featuring institutional-grade security, Kava’s goal is to unlock the value of DeFi for mainstream users by providing a trusted, streamlined environment that is ready to scale to meet global demand.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kava began as a single-application blockchain with Kava Mint, a protocol that enables users to self-issue Collateralized Debt Positions (CDPs) using high-demand crypto assets as collateral. Shortly after, it added mixed-asset lending and borrowing capabilities with Kava Lend and decentralized trading and liquidity mining with Kava Swap.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The goal of the Kava Platform is to provide a secure, seamless experience for users that want to maximize the earning potential of their crypto assets through DeFi. Featuring a single app interface for the three protocols and in-app governance, Kava brings down the barriers to entry for DeFi.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Using Kava Mint, users can lock their crypto assets as collateral and mint loans in $USDX, Kava’s native stablecoin, with borrow rates are as low as 0% APY for some assets. $USDX can then be used and exchanged on the other Kava Platform protocols to earn rewards or take additional positions in other assets. The governance of Kava Mint is enabled by $KAVA, which also functions as the governance token for the entire Kava Network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Expanding the lending and borrowing capabilities of the platform, Kava Lend enables users to earn with their minted $USDX by supplying it as collateral, along with a variety of other high-demand assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With a 12-month vesting period, users can earn more than 60% APY in rewards by supplying $USDX to Lend. They can then borrow more $USDX against that collateral, or other assets if they want to take on more risk. The primary reward token of the Kava Lend protocol is $HARD, which also serves as the governance token.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The most recent protocol to launch on the Kava Platform, Kava Swap brings automated market making to Kava, allowing users to easily exchange their assets without leaving the Kava Ecosystem. Fully decentralized, Kava Swap enables asset trading and liquidity mining for all the assets on the Kava chain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With a 12-month vesting period, users can earn reward APYs as high as 200% by providing liquidity to asset pairs on Swap. rewards are paid out in $SWP, which also functions as the governance token for the protocol.&nbsp;<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$KAVA","content":"MONEY"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"Kava Mint","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Kava Network","content":"ORGANIZATION"},{"type":"Kava Mint","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"200%","content":"PERCENT"},{"type":"$HARD","content":"MONEY"},{"type":"$USDX","content":"MONEY"},{"type":"Kava","content":"LOCATION"},{"type":"Kava","content":"PERSON"},{"type":"0%","content":"PERCENT"},{"type":"Kava Lend","content":"LOCATION"},{"type":"$SWP","content":"MONEY"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["Sponsored","The Block"]}