{"summary":"The trial of Sam Bankman-Fried got off to a muted start as jury selection began.\nThat process is expected to finish tomorrow morning, followed by opening statements from the prosecution and defense.","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254630\/inside-the-courtroom-sbfs-quiet-first-day-in-court","publishDate":"2023-10-03T21:24:01","id":1066,"type":null,"title":"Inside the courtroom: SBF’s quiet first day in court","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">In the 11 months since FTX’s collapse, the media has breathlessly covered former CEO Sam Bankman-Fried’s story. Books have been authored, podcasts produced, countless articles written.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet as the trial of the man known as SBF — who faces seven charges of fraud and conspiracy — kicked off early Tuesday morning with the start of the jury selection process, there were relatively few indications that crypto’s “trial of the century” was anything out of the ordinary at all —&nbsp;at least to its potential jurors.<\/span>","<span data-v-f87c67ca=\"\">The proceedings were straightforward. District Judge Lewis A. Kaplan spent the day slowly whittling down the pool of potential jurors, asking standard <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">voir dire <\/span><\/i><span data-v-f87c67ca=\"\">questions and making the occasional wisecrack. (When one potential juror disclosed that they were on medication for their cholesterol, Kaplan joked, “Welcome to the club!”)&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It seemed unclear whether the potential jurors had a sense of the scale of the case before them. After all, the potential jurors, from which the final 12 jurors and six alternates will be selected, were sternly instructed not to research the case on their own or discuss the details with anybody. Judge Kaplan gave a concise overview of the case to the jurors, simply noting that SBF is accused of defrauding FTX and Alameda Research’s clients and investors, without disclosing the magnitude of the fraud — or even explaining that FTX collapsed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The small courtroom where the jurors were seated was insulated from journalists covering the case, who were redirected to overflow rooms where they watched a live feed of the proceedings unfold on monitors and took notes by hand, since most were forbidden from bringing electronic devices into the courtroom.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At one point, a law clerk could be overheard&nbsp;wondering aloud why the trial wasn’t being held in a larger, ‘ceremonial’ courtroom. The room itself is so compact that the defense team is seated two rows behind the prosecution, rather than on the opposite side of the room.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">SBF himself blended in among the lawyers, dressed in an awkwardly-fitting gray suit and sporting a shorter haircut than his trademark look. At one point, SBF was told to stand so that the potential jurors could recognize him; other than that, he spent the day quietly typing on his laptop and conversing with his counsel.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The eighteen people who may decide Sam Bankman-Fried’s fate may not have ever heard of Bitcoin. They might not know that the case concerns billions of dollars, millions of users around the globe, and, perhaps, the future of the entire cryptocurrency industry. Yet, in a small courtroom in Manhattan, they will be the ones to either send SBF to prison or to set him free.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Block will be back in the courthouse tomorrow for the end of jury selection and opening statements from the defense.&nbsp;<\/span>"],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"]}