{"summary":"Despite restrictions, OpenSea stock is on offer at steep discounts on secondary markets, like many of crypto’s blue-chip startups. Here&#x27;s how.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225356\/opensea-secondary-share-sales","publishDate":"2023-04-08T04:27:45","id":10663,"type":null,"title":"How shareholders are selling OpenSea stock despite restrictions","category":["DEALS"],"content":["NFT marketplace OpenSea is a privately held startup that was last valued at $13.3 billion when it raised $300 million in early 2022. Like many prized startups, OpenSea does not permit sales of its shares by staff or investors without sign-off from the board.","And yet in one obscure corner of the startup investment space, OpenSea stock can be found on offer at steep discounts. So too are the shares of many of the crypto sector’s blue-chip companies, as The Block <a href=\"https:\/\/www.theblock.co\/post\/217937\/opensea-consensys-among-prized-crypto-startups-with-shares-available-at-big-discounts\" data-v-f87c67ca=\"\">reported<\/a> in March.","How is this possible? The answer is that brokerage platforms are skirting restrictions on stock trading through the use of Special Purpose Vehicles (SPVs) — bespoke legal entities set up purely to facilitate secondary market transactions.","“Even where a private company restricts trading in its stock, it may still be possible for investors to buy and sell indirect interests in that company’s stock by trading the ownership interest of an SPV that, in turn, owns the private company’s stock,” said Nick Fusco, founder and CEO of ApeVue, a data provider focused on pre-IPO companies.","The workaround is the source of some tension between startups and their shareholders.","The beleaguered state of the crypto and indeed global markets over the past year has weighed heavily on startup valuations. In Oct. 2022, Blockchain.com was <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-10-26\/blockchain-com-in-talks-to-raise-funds-at-shrunken-valuation\" data-v-f87c67ca=\"\">reportedly<\/a> in talks about raising money at a valuation of $3-4 billion, down from $14 billion just six months earlier. Beyond crypto, Swedish buy-now-pay-later giant Klarna saw its valuation <a href=\"https:\/\/techcrunch.com\/2022\/07\/11\/klarna-confirms-800m-raise-as-valuation-drops-85-to-6-7b\/\" data-v-f87c67ca=\"\">fall 85%<\/a> when it raised $800 million in July last year.","Some well-capitalized startups, however, have weathered the market downturn without needing to raise more money, avoiding the dreaded “down round” — which involves raising money at a valuation lower than in previous rounds. Down rounds can hurt startups both in terms of optics and because they’re demoralizing for staff, whose share options are suddenly worth less.","But secondary market platforms like Forge Global offer another barometer for the value of startup equity. Through them, investors and employees have a means to mark-to-market their shares.","OpenSea is a prime example. The category-defining NFT company has so far managed to avoid raising money in the bear market. Yet as of March 5, OpenSea shares were trading at a 51% discount on Birel, a secondary market platform for startup shares.","The chart below, based on data collected by ApeVue, paints a picture of how the secondary market for OpenSea shares has evolved since Jan. 2022. It’s based on data taken from institution-focused brokers of unlisted equity.","<span data-v-f87c67ca=\"\">source: <a href=\"https:\/\/www.apevue.com\/\" data-v-f87c67ca=\"\">ApeVue<\/a><\/span>","OpenSea has forbidden unsanctioned secondary sales since March 2021. An excerpt of the bylaws of the corporate entity behind OpenSea, Ozone Networks, Inc., obtained by The Block, states, “A stockholder shall not transfer (as such term is defined below) any shares of the corporation’s stock (or any rights of or interest in such shares) to any person unless such transfer is approved by the board of directors prior to such transfer, which approval may be granted or withheld in the board of directors’ sole and absolute discretion.”","Such restrictions are by no means unusual. “This is already the norm. Many companies do not want deals in the secondary market, so they prohibit it,” said Birel’s CEO Richard Freemanson.&nbsp;","“We have OpenSea holders who are interested in an exit. In order to make sure the deal won’t be blocked by the company, sellers offer allocations via SPV, and rarely through forward contracts. It’s common practice in secondary market,” Freemanson added.","It is not exactly clear how OpenSea or other startups in the same position feel about the state of play. OpenSea did not immediately respond to a request for comment.","At least some investors, however, see it as far from ideal. One person, who spoke on condition of anonymity, said that 95% of OpenSea shares trading on secondary markets take the form of SPVs, with each lot attached to its own entity. This fragments liquidity and hinders trading, they said.&nbsp;","Another investor, a founder and angel investor in fintech firms, said investors would prefer to buy shares directly, as SPVs come with additional fees and less control. “You’re one step removed from the actual investment, which just really isn’t ideal,” they added.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ApeVue","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Jan. 2022","content":"DATE"},{"type":"Richard Freemanson","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$3","content":"MONEY"},{"type":"March 5","content":"DATE"},{"type":"Ozone Networks, Inc.","content":"ORGANIZATION"},{"type":"$13.3 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July last year","content":"DATE"},{"type":"85%","content":"PERCENT"},{"type":"March 2021","content":"DATE"},{"type":"51%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"Birel","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"$14 billion","content":"MONEY"},{"type":"4 billion","content":"MONEY"},{"type":"Nick Fusco","content":"PERSON"},{"type":"Oct. 2022","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"$800 million","content":"MONEY"}],"hashtag":["PRIVATE EQUITY DEALS"],"authors":["Ryan Weeks","Adam Morgan McCarthy","The Block"]}