{"summary":"The last decade was foundational for the blockchain and cryptocurrency industry. Rarely has a fledgling technology so quickly captured the attention of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51304\/congress-will-scrutinize-libra-chinas-crypto-ambitions-in-2020","publishDate":"2019-12-26T12:00:51","id":10674,"type":null,"title":"Congress will scrutinize Libra, China’s crypto ambitions in 2020","category":["REGULATION"],"content":["The last decade was foundational for the blockchain and cryptocurrency industry.","Rarely has a fledgling technology so quickly captured the attention of global policymakers. Just last week, China <a href=\"http:\/\/yuanchuang.caijing.com.cn\/2019\/1209\/4631892.shtml\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">noted<\/a> it will likely launch a tokenized version of the renminbi in two major cities, and a top U.S. financial regulator told senators that the digitization of the financial system “is here.” How did we get here? And, more importantly, where are we going in the next decade?","In Washington, the rollout of Libra, the rise in geopolitical competition and lingering consumer protection concerns dominated policy discussions. These same concerns will likely inform the policy-making community’s engagement with our industry going forward. And while there is yet no uniform appreciation for the overall benefits of blockchain technology, it is clear that, on balance, U.S. lawmakers from both parties have gained a more nuanced understanding of the industry over the past year.","To butcher a phrase: with great knowledge comes great responsibility. In the coming year, it won’t suffice for lawmakers to throw up their hands and claim ignorance of this complicated technology. We would expect those savvy Congresspeople to wield their newfound knowledge well as they seek to legislate.","Here are a few areas we expect Congressional attention in the coming year:","","","First, while many lawmakers from both parties clearly wish to target Facebook and its Libra project, they have made it clear that they’re able to differentiate between Libra and other crypto projects and do not aim to scuttle the entire industry. Facebook’s announcement of the Libra project took Washington by storm, culminating with Mark Zuckerberg testifying before Congress and several policymakers calling for the project to be stopped altogether.","The debate is not over: expect Congressional scrutiny of Libra and legislative initiatives to hang over the project in 2020.","","","Foreign governments’ – particularly China’s – focus on using blockchain technology to their geopolitical advantage has broadened lawmakers’ views on the applications and importance of blockchain and crypto.","Several countries have adopted clear regulatory frameworks to manage the industry, attracting foreign entrepreneurial talent and investment. Others have already launched tokenized versions of their sovereign currencies, and China has made attaining leadership in blockchain technology a national priority. Lawmakers are belatedly realizing the strategic advantage of supporting the industry in the United States.","Expect protecting the Federal Reserve’s monetary policy autonomy and supporting the U.S. dollar’s status as the reserve currency of choice around the world to be at the forefront of policymakers’ minds in 2020 and beyond.","","","U.S. policymakers' perennial focus on consumer protection will shape regulatory and legislative initiatives in our industry.","Protecting public investors through the maintenance of fair, transparent, and liquid financial markets with minimized information asymmetries has been a priority of the federal government for nearly 100 years. Expect debate and policy proposals to ensure the integrity of the crypto markets to be a focus in 2020.","Given the strong political headwinds of the presidential election year, it is unlikely to be a year of great crypto breakthroughs, at least in terms of new legislation that can pass the House or the Senate. However, that reality is nothing to despair over.","Now is the time to continue to lay the groundwork, often out of the spotlight, for good crypto policy in the future. And, encouragingly, there are several lawmakers willing to listen.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Libra","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Libra","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Kristin Smith","The Block"]}