{"summary":"Crypto prices slip ahead of U.S. inflation data. Analysts at Nomura expect inflation to have remained elevated in March.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225795\/bitcoin-price-us-inflation-altcoins-fed-interest-rates","publishDate":"2023-04-12T06:39:29","id":10671,"type":null,"title":"Bitcoin hovers around $30,000 ahead of US inflation data as altcoins dip","category":["MARKETS"],"content":["Crypto prices dipped across the board as investors awaited key U.S. inflation data for March.","Most estimates expect month-on-month core inflation to remain elevated at 0.5%. Nomura estimates put core inflation (less food and energy) up 5.7% year-on-year, slightly higher than consensus estimates of 5.6% and above last month's 5.5%. The headline figure is expected to be 5.1% versus 6% in February.&nbsp;","Inflation is one of the key metrics the U.S. Federal Reserve is tracking ahead of its next interest rate decision on May 3. Nomura analysts said the probability of another 25 basis point increase in May might rise if inflation increases. Still, financial stress in the banking sector could negate the need for this.","Tighter credit conditions intensified by financial stress in the banking sector \"will likely exert disinflationary pressures as financially constrained firms reduce the selling price,\" analysts wrote. As a result, policymakers might become more forward-looking and put less weight on realized inflation data, which \"tends to be a backward-looking reflection of the economy.\"","Fed Chair Jerome Powell <a href=\"https:\/\/www.theblock.co\/post\/225817\/gensler-sec-binance-cftc-bankman-fried\" data-v-f87c67ca=\"\">echoed<\/a> this in his last press conference. The central bank head said the events of the previous weeks — the collapse of Silicon Valley Bank, Silvergate and Signature Bank — and potential credit tightening could impact inflation in its own right and might lead the central bank to assess its increases.&nbsp;","When pressed on whether this meant it would pause rates, Powell added that the committee doesn't know enough at this moment.&nbsp;","\"We are keeping in mind that the Fed is still largely data-dependent and has warned against taking its foot off the pedal early,\" crypto trading firm QCP Digital wrote in its latest market update, adding that markets are pricing in a 75% probability of a 25 basis point hike in May currently.","If inflation comes in lower than expected, it will likely take off the hike expectations and \"lead to a risk-asset rally,\" the firm said.&nbsp;","The minutes from the last Fed policy meeting will be released at 6 p.m. EDT. Investors will be watching for any hints of the Fed's pivoting and what they're looking at in terms of the banking sector, liquidity and overall market performance, QCP noted.","Bitcoin and the broader crypto market rallied over the weekend and into Monday. The leading cryptocurrency by market cap climbed above $30,000 for the first time since June 2022. Ether reached its highest point in nine months.","However, bitcoin struggled to hold much above $30,000 in the early hours, trading at $30,001 by 6:05 a.m. EDT, down 0.7% over the past six hours, according to Binance data via TradingView.&nbsp;","","","Crypto prices had rallied as investors looked through the expected 25 basis point hike in May and focused on the long-anticipated Fed pivot, Ryan Shea, a crypto economist at Trakx, told The Block. CME's FedWatch tool, which analyses Fed Funds futures pricing, shows a pause in June and cuts from July.&nbsp;","Beyond inflation, ether and liquid staking tokens, like lido, could move following the Ethereum blockchain's latest upgrade later on today. <a href=\"https:\/\/www.theblock.co\/post\/225655\/ethereum-shapella?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Shapella<\/a>, which will introduce staked ether withdrawals, is slated for 6:30 p.m. EDT. The price impact is broadly <a href=\"https:\/\/www.theblock.co\/post\/225701\/jpmorgan-fidelity-ethereum-eth-shapella-upgrade?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">expected<\/a> to be muted, but some argue it could cause a selloff.&nbsp;","\"We fail to see what the bullish case can be for this event as those at the front of the queue are likely to sell spot,\" QCP Digital argues, adding others further back in the withdrawal line will like be hedging via derivatives.&nbsp;","\"The market has already seen bearish price action in anticipation of this event, with ether underperforming bitcoin in recent weeks.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"5.6%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"6:30 p.m. EDT","content":"TIME"},{"type":"0.7%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"Powell","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"6 p.m. EDT","content":"TIME"},{"type":"Binance","content":"PERSON"},{"type":"6:05 a.m. EDT","content":"TIME"},{"type":"June 2022","content":"DATE"},{"type":"5.7%","content":"PERCENT"},{"type":"QCP Digital","content":"ORGANIZATION"},{"type":"May 3","content":"DATE"},{"type":"$30,001","content":"MONEY"},{"type":"$30,000","content":"MONEY"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"5.5%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"Signature Bank —","content":"ORGANIZATION"},{"type":"5.1%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Jerome Powell","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Trakx","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Ryan Shea","content":"PERSON"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["BITCOIN","CRYPTO MOVERS","CZ","ECONOMIC INDICATORS","ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}