{"summary":"Helius plans to grow its team of 14 employees and bolster its tech stack with the fresh Series A financing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278441\/solana-developer-platform-helius-raises-9-5-million-in-series-a-funding","publishDate":"2024-02-22T07:33:32","id":10670,"type":null,"title":"Solana developer platform Helius raises $9.5 million in Series A funding","category":["COMPANIES"],"content":["The Solana-focused developer platform Helius raised $9.5 million in Series A funding.&nbsp;","The venture firm Foundation Capital led the round, which had additional support from Reciprocal Ventures, 6th Man Ventures, Chapter One, Propel, Balaji Srinivasan, Kyle Samani, Solana co-founders Anatoly Yakovenko and Raj Gokal, and others.","Foundation General Partner Steve Vassallo will join Helius' board of directors, Helius CEO <a href=\"https:\/\/www.theblock.co\/post\/267018\/solana-bull-thesis\" data-v-f87c67ca=\"\">Mert Mumtaz<\/a> told The Block.","Helius focuses on building developer tools such as web hooks and remote procedure controls (RPCs). Web hooks automatically facilitate the communication between two applications, and RPCs are a way for developers to interact with blockchain nodes.&nbsp;","Helius intends to hire four more engineers to its team of 14 full-time employees with the funding, Mumtaz said, adding \"we would like to continue to grow our team strategically.\" The firm also intends to use the funds to bolster its tech stack, according to a company release.","\"Over the next year, we are aiming to ship generalized compression for Solana, improve the state of RPCs on the chain and create a new RPC client, and onboard thousands of web2 developers, and larger institutions, onto Solana,\" Mumtaz continued.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"RPCs","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Reciprocal Ventures","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Mert Mumtaz","content":"PERSON"},{"type":"RPC","content":"ORGANIZATION"},{"type":"$9.5 million","content":"MONEY"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Raj Gokal","content":"PERSON"},{"type":"Mumtaz","content":"PERSON"},{"type":"Foundation Capital","content":"ORGANIZATION"},{"type":"Kyle Samani","content":"PERSON"},{"type":"Steve Vassallo","content":"PERSON"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Helius","content":"PERSON"}],"hashtag":["SERIES A"],"authors":["MK Manoylov","The Block"]}