{"summary":"Turnkey raised $7.5 million from investors including Variant, Seqouia and Coinbase. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221669\/coinbase-variant-backed-startup-ushers-in-crypto-security-renaissance","publishDate":"2023-03-21T12:51:00","id":10672,"type":null,"title":"Sequoia, Coinbase, Variant-backed startup ushers in crypto security renaissance","category":["THE BLOCK"],"content":["A once sleepy corner of the crypto market is seeing a surge in interest: crypto security and custody.&nbsp;","Safeguarding digital assets — which are known for being swiped in hacks or lost into the ether — has always been a priority for crypto investors, but a new wave of entrepreneurs is offering solutions with more flexibility in securing and managing private keys.&nbsp;","<a href=\"http:\/\/turnkey.io\" data-v-f87c67ca=\"\">Turnkey<\/a>, which revealed a $7.5 million seed fundraise on Tuesday, provides the latest example, with a team of former Coinbase Custody execs offering a platform to provide a foundation for a crypto industry in which trillions of on-chain transactions occur, rather than a world where investors simply lock up their assets.&nbsp;","The firm has backing from Sequoia with Variant and Coinbase also investing in the round.&nbsp;","The news comes after a <a href=\"https:\/\/blog.chainalysis.com\/reports\/2022-biggest-year-ever-for-crypto-hacking\/\" data-v-f87c67ca=\"\">record year<\/a> of hacks in the crypto industry with $3.8 billion stolen, according to Chainalysis. Investors have taken notice with a flurry of new deals cropping up in the market for custody, including so-called non-custodial MPC solutions. DeFi wallet Fordefi recently <a href=\"https:\/\/blog.fordefi.com\/\" data-v-f87c67ca=\"\">nabbed<\/a> its SOC II.&nbsp;","\"Many, many, many more transactions, and more complex transactions are becoming the norm,\" said Turnkey co-founder Sam McIngvale, former CEO of Coinbase Custody.&nbsp;","\"For crypto institutions, which are still the bulk of the buyers, like foundations, VCs, trading firms, etc — there's a lot of solutions trying to push non-custodial or MPC solutions as a safer way to manage risk and minimize counterparty blowup risk,\" said Meltem Demirors of Coinshares.&nbsp;","Turnkey is aiming itself as a developer-first tool that allows users to \"generate hundreds of wallets and sign thousands of transactions across any chain, all with flexible, programmable permissions to ensure you only sign what you want.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“We believe crypto will eventually eat everything, and as such, robust, abstracted custody infrastructure will be needed by every app developer,\" said Variant co-founder Spencer Noon. \"The key management experience is tough for both developers and consumers, and is a large bottleneck for onboarding in the space. Turnkey is the simplest way to generate and manage private keys securely, and makes it incredibly easy for anyone to build in crypto.","Commenting on the deal, Alfred Lin, a partner at Sequoia Capital, said: \"We believe Turnkey is building the right foundational infrastructure that could help onboard the next million crypto developers.”&nbsp;","<em data-v-f87c67ca=\"\">Update: The story has been updated to reflect Dragonfly is not an investor, and adds statement from Variant's Noon and Chainalysis information.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sam McIngvale","content":"PERSON"},{"type":"$3.8 billion","content":"MONEY"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"MPC","content":"ORGANIZATION"},{"type":"$7.5 million","content":"MONEY"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"Meltem Demirors of Coinshares","content":"ORGANIZATION"},{"type":"Alfred Lin","content":"PERSON"},{"type":"Variant's Noon","content":"ORGANIZATION"},{"type":"Variant","content":"ORGANIZATION"},{"type":"Spencer Noon","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}