{"summary":"The CFTC withdrew its no-action letter for PredictIt last Thursday, forcing the prediction market to close up shop by February.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162000\/predictit-forced-to-close-shop-in-the-us-by-cftc","publishDate":"2022-08-07T20:03:49","id":10675,"type":null,"title":"PredictIt forced to close shop in the US by CFTC","category":["REGULATION"],"content":["One of the most popular prediction markets will have to close its doors after the Commodity Futures Trading Commission (CFTC) said it failed to comply with the terms of a no-action letter.&nbsp;","PredictIt has operated in the US since October 2014 under the protection of a No Action letter from the CFTC. The company's Twitter account brands it \"the stock market for politics.\" Users purchase and trade shares representing an outcome priced by public consensus. Traders will see a larger payout if they place their predictions when the public disagrees and the shares for the outcome are priced lower. If the trader is right, the value of the shares rise and traders can either sell their shares or hold on until the market closes.","Of course, if a trader is wrong, they'd lose money.","Some argue prediction markets are a means of more accurately establishing public opinion, since users have to put their money where their mouth is. PredictIt is a project out of the non-profit Victoria University in Wellington, New Zealand.","But some, including some regulators, view the activity as akin to gambling or unregistered sales of futures contracts. Many prediction platforms, including PredictIt, run political markets as a means of polling for election data. In the US, it's illegal to gamble on the presidential election. The CFTC also prohibits the unregistered trading of futures contracts. As of last week, the CFTC has revoked PredictIt's protected status, saying the firm failed to comply with the terms of the letter.&nbsp;&nbsp;","\"[The Division of Market Oversight] has determined that Victoria University has not operated its market in compliance with the terms of the letter and as a result has withdrawn it,\" said the notice. \"As stated in the withdrawal letter issued today, to the extent that Victoria University is operating any contract market in a manner consistent with each of the terms and conditions provided in CFTC Letter 14-130, all related and remaining listed contracts and positions comprising all associated open interest in such market should be closed out and\/or liquidated no later than 11:59 p.m. (EDT) on February 15, 2023.\"","The CFTC has not clarified which rules PredictIt failed to comply with in its statement. For its part, the firm maintains that all open markets are within the terms of the letter. In a statement, it said the security of trader funds won't be affected by this action, but it is halting the addition of new markets. It will continue to accept new deposits and signups and honor withdrawal requests. The platform has not decided how to settle markets with end dates after the February deadline.&nbsp;","The firm's <a href=\"https:\/\/www.predictit.org\/platform-announcements\" data-v-f87c67ca=\"\">statement<\/a> also included a link to submit comments to the CFTC. In the days since the decision came down, PredictIt's twitter account has retweeted multiple accounts soliciting comments to the CFTC on its decision and giving analysis on the sudden change of tune from the regulator.&nbsp;","\"We love our community and we appreciate all of the support we are getting right now,\" the firm <a href=\"https:\/\/twitter.com\/PredictIt\/status\/1555618131091066884?s=20&amp;t=VUvxr7rcwUncolpvmODtog\" data-v-f87c67ca=\"\">tweeted<\/a>.&nbsp;","The decision follows an enforcement process with crypto prediction market platform Polymarket, which <a href=\"https:\/\/www.theblock.co\/linked\/129047\/crypto-prediction-market-platform-polymarket-settles-with-cftc-for-1-4-million\" data-v-f87c67ca=\"\">settled<\/a> with the CFTC at the start of this year. The platform touts itself as a decentralized information market. The mechanisms, though blockchain-based, are similar to PredictIt, allowing users to buy contracts tied to certain outcomes and potentially see a payout as consensus shifts or the market settles an outcome. Since the enforcement, Polymarket has <a href=\"https:\/\/www.theblock.co\/linked\/131383\/following-cftc-settlement-prediction-platform-polymarket-geoblocks-trades-in-the-us\" data-v-f87c67ca=\"\">geoblocked<\/a> US customers and <a href=\"https:\/\/www.theblock.co\/linked\/147946\/polymarket-appoints-former-cftc-chief-giancarlo-as-chair-of-advisory-board\" data-v-f87c67ca=\"\">added<\/a> former CFTC chair Christopher Giancarlo to its advisory board to potentially help it navigate a reentrance into the US.&nbsp;","After news of PredictIt's revoked protection, Polymarket <a href=\"https:\/\/twitter.com\/PolymarketHQ\/status\/1555651378147631109?s=20&amp;t=VUvxr7rcwUncolpvmODtog\" data-v-f87c67ca=\"\">tweeted<\/a>:","\"Viva la PredictIt. You will forever have a special place in our hearts and those of the prediction market community. The foundation you laid will not go to waste.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New Zealand","content":"LOCATION"},{"type":"Christopher Giancarlo","content":"PERSON"},{"type":"Victoria University","content":"ORGANIZATION"},{"type":"The Division of Market Oversight]","content":"ORGANIZATION"},{"type":"11:59 p.m.","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"February","content":"DATE"},{"type":"October 2014","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Wellington","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"February 15, 2023","content":"DATE"}],"hashtag":["CFTC"],"authors":["Aislinn Keely","The Block"]}