{"summary":"The project is implementing additional measures to mitigate concerns over the collection of people&#x27;s private biometric data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287115\/worldcoin-eyeball-scans-to-be-deleted-upon-request","publishDate":"2024-04-09T09:00:05","id":10686,"type":null,"title":"Worldcoin iris codes can be deleted upon request","category":["COMPANIES"],"content":["<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update (April 9, 10:30am ET):<\/strong> Corrected headline to \"iris codes.\"<\/em>","<span data-v-f87c67ca=\"\">After <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Worldcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248504\/worldcoin-wld-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/worldcoin.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WLD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.13%\n    <\/span><\/a> <!----><\/span><\/span>'s quest to verify people's humanity by scanning eyeballs has continued to trigger government scrutiny, the project is rolling out another measure aimed at mitigating privacy concerns.<\/span>","With its latest update, Worldcoin is giving users the option to request that the identification number created from their eyeball scans, or the \"iris code,\" be permanently deleted. \"Now, World ID holders have even more control with the option to unverify their World ID,\" the project said in a statement. \"This includes the permanent deletion of their iris code, which is a numeric representation of their unique iris texture.\"","Worldcoin has assigned World IDs to nearly 5 million people who consented to have their irises scanned in order to prove their \"personhood,\" or that they are human. The project also awards signups with cryptocurrency in the form of Worldcoin tokens.","Tools for Humanity, co-founded by OpenAI CEO Sam Altman, is the<span data-v-f87c67ca=\"\">&nbsp;lead&nbsp;<\/span><span data-v-f87c67ca=\"\">software contributor&nbsp;<\/span><span data-v-f87c67ca=\"\">behind the Worldcoin project. Much of the Worldcoin project has been created around the idea that as the use of artificial intelligence becomes more prominent, having a reliable system in place capable of proving what online actors are human will become increasingly vital.<\/span>","In recent weeks, Worldcoin's ambitious initiative aimed at digital IDs that prove they are human has been both scrutinized, and in some cases, completely disrupted. In March, <a href=\"https:\/\/www.theblock.co\/post\/280331\/south-korea-launches-probe-on-worldcoin\" data-v-f87c67ca=\"\">South Korea launched<\/a> a probe while both Spain and <a href=\"https:\/\/www.theblock.co\/post\/284719\/worldcoin-data-collection-portugal\" data-v-f87c67ca=\"\">Portugal<\/a> told the project to stop collecting people's biometric data.","Worldcoin has maintained that it takes the protection of users' personal biometric data seriously. Roughly two weeks ago, in an effort to quell growing concern, Worldcoin <a href=\"https:\/\/www.theblock.co\/post\/284123\/worldcoin-to-end-storing-users-personal-data\" data-v-f87c67ca=\"\">rolled out a new initiative<\/a> called \"Personal Custody\" which gives new users more control over their data. With \"Personal Custody\" new signups have their personal data stored on their own personal devices, in most cases a smartphone. Additionally, new signups are not able to request that Worldcoin encrypt and store their data.","Besides Worldcoin now giving World ID holders, who have already signed up, the ability to request that their iris code be deleted, the project also said it will institute \"in-person age verification checks to help ensure Worldcoin is available only to humans 18 years and older.\"","The two latest measures announced on Tuesday \"were developed in consultation with third-party privacy and security experts, and based on preliminary assessments and questions raised by data protection authorities in some places where Worldcoin is available,\" the project said in a statement.","When World ID holders ask to have their iris code deleted, the project said it will do so, but only after six months.","\"The individual‘s World ID will become invalid and a six-month 'cool off' period will be initiated to help protect against fraud by ensuring individuals cannot immediately re-verify their humanness,\" said Worldcoin. \"At the end of this cool off period, their iris code will be permanently deleted and unrecoverable.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Portugal","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"-1.13%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"ORGANIZATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Spain","content":"LOCATION"},{"type":"April 9","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}