{"summary":"Shapiro v. AT &amp;amp; T Mobility, LLC, Case №2:19-cv-8972 (C.D. Cal. filed October 17, 2019) Link to Complaint SIM swapping is a problem that many in crypto","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43877\/att-customer-lawsuit-alleges-employee-aided-sim-swap-led-to-1-8-million-theft-of-cryptocurrency-and-more","publishDate":"2019-10-19T02:30:16","id":10681,"type":null,"title":"AT&amp;T customer lawsuit alleges employee-aided SIM swap led to $1.8 million theft of cryptocurrency and more","category":["HACKS"],"content":["Quick Take","Shapiro v. AT&amp;T Mobility, LLC, is a new California federal court lawsuit alleging violations of state and federal law in connection with a customer SIM swap","Plaintiff says AT&amp;T employees colluded with outsiders to easily facilitate SIM swapping of his phone number, thereby allowing access to multiple accounts, leading to more than $1 million in losses","<a href=\"https:\/\/www.scribd.com\/document\/431041530\/Shapiro-SIM-Swap-Case\" data-v-f87c67ca=\"\">Link to Complaint<\/a>","SIM swapping is a problem that many in crypto have unfortunately had to face, some multiple times. &nbsp;If you're at all prominent in the space -- and even if you're not -- your phone number is liable to be SIM swapped (ported from your device to another.)&nbsp; This particular case doesn’t necessarily involve someone well known on \"crypto twitter\", but it does involve the alleged theft of $1.8 million of money including crypto. &nbsp;","A large number of SIM swap cases have been resolved in private arbitration, in part because of arbitration clauses that mobile carriers include in their user agreements. This case is one a few that have been publicly filed, and the allegations are alarming -- including a claim that AT&amp;T insiders were deeply involved in what sounds like a devastating SIM swapping scheme.&nbsp;","The plaintiff is Seth Shapiro, a resident of California. The Complaint says that Mr. Shapiro is a “a two-time Emmy Award-winning media and technology expert, author, and adjunct professor at the University of Southern California School of Cinematic Arts.” He also was, at the relevant times for the lawsuit, a subscriber of AT&amp;T. AT&amp;T “is the second largest wireless carrier in the United States, with more than 153 million subscribers, earning $71 billion in total operating revenues in 2017 and $71 billion in 2018.”","The gist of the case is that Shapiro alleges AT&amp;T failed to protect his account from a SIM swap that resulted in a major loss of cryptocurrency. What specifically happened? &nbsp;According to the complaint:","On at least four occasions between May 16, 2018 and May 18, 2019, AT&amp;T employees obtained unauthorized access to Mr. Shapiro’s AT&amp;T wireless account, viewed his confidential and proprietary personal information, and transferred control over Mr. Shapiro’s AT&amp;T wireless number from Mr. Shapiro’s phone to a phone controlled by third-party hackers in exchange for money.","As if the preceding allegations weren’t bad enough, the end result was:","The hackers then utilized their control over Mr. Shapiro’s AT&amp;T wireless number — including control secured through cooperation with AT&amp;T employees — to access his personal and digital finance accounts and steal more than $1.8 million from Mr. Shapiro.","Even worse, the scheme allegedly involved AT&amp;T employees working on the inside with outside hackers. And, unsurprisingly, there are chat logs:","At the end of the chat, a group member brags that they “made 1.3 [million]” and they begin plotting about how to route the stolen cryptocurrency through various accounts and currencies in order to cover their trail. They also brag about plans to “buy some Gucci” or a “dream car” with the money they stole from Mr. Shapiro.","Apparently, Mr. Shapiro was in fact SIM-swapped multiple times, and all of his personal information was taken along with access to other accounts such as Google, and Evernote. Furthermore, Mr. Shapiro’s family was impacted, and he was threatened. It sounds awful. Despite this, after each incident, AT&amp;T allegedly said they followed proper procedures and alerted necessary authorities, but as the complaint states, “Mr. Shapiro’s trust in AT&amp;T was misplaced.”","So, What is Shapiro actually suing for; in other words, what is the cause of action?","One header in the lawsuit summarizes the nature of the action: “<em class=\"mq\" data-v-f87c67ca=\"\">AT&amp;T’s Repeated Failures to Protect Mr. Shapiro’s Account from Unauthorized Access Are a Violation of Federal Law<\/em>.” The argument alleges that AT&amp;T is fully aware that the information they hold in trust for their subscribers is highly sensitive and extremely valuable. Mr. Shapiro is arguing that AT&amp;T knows this to be the case, yet the company has failed in a variety of ways to take the necessary steps to protect their subscriber’s information.&nbsp;","Specifically, Shapiro has alleged violations of federal and state laws, in addition to common law torts. This includes (1) an alleged violation of the Federal Communications act for allegedly failing to protect confidentiality of his account information, (2) an alleged violation of the California state unfair business practices statute, (3) an alleged violation of the California state constitution's right to privacy, (4) two negligence claims, (5) an alleged violation of California Consumer's Legal Remedies Act and (6) a violation of the Federal Consumer Fraud and Abuse Act. &nbsp;He seeks actual and punitive damages and injunctive relief.&nbsp;","These statutory claims are creative. They may be a tactic to try to get around AT&amp;T's arbitration agreement in its terms of service. The allegations in the complaint, if true, are really awful and seem calculated to give a court good reason to let these claims be litigated openly.","At the same time, it is somewhat inexplicable that the plaintiff maintained his service with AT&amp;T after multiple hacks, as so many other alleged victims also fail to do. Additionally, he apparently didn't switch from using his phone for two-factor authentication to apps or change to a new phone number. Those facts may or may not be relevant. We don't know.&nbsp;","Anyway, this is obviously a suit between two highly motivated parties. Mr. Shapiro has apparently been through the wringer. AT&amp;T definitely doesn’t want to lose this high profile case given the recent prevalence of the SIM swap + cryptocurrency theft problem. The company will likely face nasty PR and further questions about its employee oversight and practices if the allegations in the lawsuit prove to be true.","And it would be extremely problematic for AT&amp;T if a court said its customers had a constitutional right of privacy that a telco could violate by allowing unauthorized account transfer. &nbsp;","This is an extremely interesting complaint, it is well crafted, and it is one that we will be watching closely.","<a title=\"View Shapiro SIM Swap Case on Scribd\" href=\"https:\/\/www.scribd.com\/document\/431041530\/Shapiro-SIM-Swap-Case#from_embed\" data-v-f87c67ca=\"\">Shapiro SIM Swap Case<\/a> by <a title=\"View Anonymous XdelME's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/481118616\/Anonymous-XdelME#from_embed\" data-v-f87c67ca=\"\">Anonymous XdelME<\/a> on Scribd","<iframe id=\"doc_32648\" class=\"scribd_iframe_embed\" title=\"Shapiro SIM Swap Case\" src=\"https:\/\/www.scribd.com\/embeds\/431041530\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-LRkO6xuK8uxezhu9XFRR&amp;show_recommendations=true\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.7729220222793488\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Evernote","content":"ORGANIZATION"},{"type":"Seth Shapiro","content":"PERSON"},{"type":"$71 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"AT&amp;T","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Shapiro","content":"PERSON"},{"type":"AT&amp;T Mobility, LLC","content":"ORGANIZATION"},{"type":"May 18, 2019","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"University of Southern California School of Cinematic Arts","content":"ORGANIZATION"},{"type":"SIM","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"May 16, 2018","content":"DATE"},{"type":"Gucci","content":"ORGANIZATION"},{"type":"Federal Communications","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nelson Rosario","Stephen Palley","The Block"]}