{"summary":"Banteg published leaked details of over 101,000 friend.tech users — including wallet addresses and Twitter usernames.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246529\/friendtech-leaked-database-ethereum-addresses","publishDate":"2023-08-21T08:41:40","id":10682,"type":null,"title":"Scraped data of 101,000 friend.tech users links their wallet addresses","category":["SECURITY"],"content":["Banteg, a pseudonymous core contributor to Yearn Finance, has published a <a href=\"http:\/\/web.archive.org\/web\/20230821104340\/https:\/\/gist.github.com\/banteg\/76d141fea2e658e5d2854944342f2d3d\" data-v-f87c67ca=\"\">repository<\/a> of publicly available scraped data, containing critical details of users on the friend.tech platform on GitHub. This includes wallet addresses on Base and corresponding Twitter usernames for over 101,000 users.","“101,183 people have given friend.tech access to post as them, leaked db (database) indicates,” Banteg <a href=\"https:\/\/twitter.com\/bantg\/status\/1693547023977382277\" data-v-f87c67ca=\"\">said<\/a>. This statement came after he released a CSV file containing detailed user data.","Banteg’s move extended beyond the repository. He also highlighted a troubling situation involving friend.tech’s permissions, asserting that these users had granted friend.tech the ability to post on their behalf — possibly without complete understanding or consent.","The information was unveiled following Spot On chain analysts’ <a href=\"https:\/\/twitter.com\/spotonchain\/status\/1693581452355739653\" data-v-f87c67ca=\"\">discovery<\/a> that friend.tech’s API had \"leaked\" information. For example, Twitter usernames and associated crypto wallets belonging to users can be viewed by others through the API. Currently, the project <a href=\"https:\/\/www.friend.tech\/\" data-v-f87c67ca=\"\">states<\/a> on its website that its data privacy policy is \"coming soon.\"","Friend.tech, operating as a web3 social application on the Coinbase-incubated Layer 2 chain Base, provides a platform for trading shares in Twitter accounts. This feature gives shareholders unique access to private chat rooms.","With the platform gaining traction due to recent high-profile signups, it has also generated protocol fees exceeding <a href=\"https:\/\/www.theblock.co\/post\/246423\/friend-tech-fees\" data-v-f87c67ca=\"\">$1.42 million<\/a> in the last 24 hours, ranking it among the top three crypto projects in terms of user-paid fees.","Friend.tech responded by saying the information was publicly available and hence not leaked.","\"This is just someone scraping our public API that shows the association between public wallet addresses and public Twitter usernames,\" the company said in a comment on social media.&nbsp;","<em data-v-f87c67ca=\"\">(Corrects headline and depiction to characterize list as resulting from scraping.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"CSV","content":"ORGANIZATION"},{"type":"$1.42 million","content":"MONEY"},{"type":"Banteg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Yearn Finance","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"API","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}