{"summary":"MetaMask has made a few key fixes relating to the privacy of its users in its latest update — and made it easier to switch away from Infura.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219692\/metamask-fixes-privacy-issue-accounts-linked-together","publishDate":"2023-03-14T10:09:03","id":10683,"type":null,"title":"MetaMask fixes privacy issue that linked accounts together","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto wallet MetaMask has made a few key fixes relating to the privacy of its users in its latest update.","Before, when MetaMask users connected to crypto applications, it would link all of their accounts together even if they intended to keep them separate. Now, it will keep accounts separate when connecting to applications and these connections will even be maintained in separate browser tabs.","\"For example, you may want to use Account 1 as your 'public facing' account associated with your ENS, while using Account 2 for your DeFi degen activities that you want to keep private,\" said MetaMask in a <a href=\"https:\/\/metamask.io\/news\/latest\/metamask-mobile-and-extension-updates-improve-wallet-experience-with-more-control-and-transparency\/\" data-v-f87c67ca=\"\">blog post<\/a>. \"Now you can as they won’t be linked to each other.\"","The update also limits the amount of data that is sent to third-party services used to run the wallet extension.","The blog post noted that when someone sets up a wallet, they're able to choose any RPC provider — the service used to connect to the blockchain — instead of automatically using Infura (a provider owned by ConenSys, which also owns MetaMask). It's also possible to opt-out of using Infura.","This comes after some privacy settings were <a href=\"https:\/\/www.theblock.co\/post\/208058\/metamask-rolls-out-updates-to-privacy-settings-for-new-and-existing-users\" data-v-f87c67ca=\"\">changed<\/a> in February that made it easier to change RPC providers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ConenSys","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"}],"hashtag":["WALLETS"],"authors":["Tim Copeland","The Block"]}