{"summary":"Mechanism Capital co-founder Andrew Kang has spent two years trying to fractionalize the NFT and it’s finally going ahead.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281625\/andrew-kang-harambe-nft-dao-tokenization","publishDate":"2024-03-11T07:05:56","id":10687,"type":null,"title":"Andrew Kang sells 75% of Harambe NFT to a DAO for $5 million so it can be tokenized","category":["CRYPTO ECOSYSTEMS"],"content":["Mechanism Capital co-founder and partner Andrew Kang sold 75% of his <a href=\"https:\/\/opensea.io\/assets\/ethereum\/0x3b3ee1931dc30c1957379fac9aba94d1c48a5405\/40582\" data-v-f87c67ca=\"\">Harambe NFT<\/a> to a newly formed DAO, which plans to tokenize it.","Harambe was a gorilla at the Cincinnati Zoo who was killed by a zoo worker after a three-year-old boy entered the enclosure. Prior to his death, photographer Jeff McCurry took a photo of Harambe, which became a popular meme.&nbsp;","In May 2021, on the fifth anniversary of his death, McCurry sold seven photographs of Harambe as one-of-one NFTs. In September, Kang purchased the first NFT of the collection and two months later <a href=\"https:\/\/twitter.com\/Rewkang\/status\/1461993988592791555\" data-v-f87c67ca=\"\">said<\/a> that he would like to see it fractionalized.","Over two years later, the initiative is finally going ahead. Kang sold the 75% ownership of the NFT for $5 million and he will receive 25% of the fractionalized tokens. The remaining tokens will be distributed in an airdrop to other meme tokens — TRUMP, PEPE, MOG and TOSHI —&nbsp;and will be used for providing liquidity on decentralized exchanges.","McCurry is also supporting the initiative. “$HARAMBE is fractionalized by my 1-of-1 NFT of Harambe’s most popular photo that has been viewed over 25 billion times,” he <a href=\"https:\/\/twitter.com\/jeffmccurry9\/status\/1766973665415958547?s=46&amp;t=Zg98JZyrZ-lJDdBCp_SPNg\" data-v-f87c67ca=\"\">posted on X<\/a>. “May Harambe's memory live forever.”","An NFT is fractionalized by locking the original NFT up in a vault and issuing tokens that each represent an equal proportion of the NFT. While it’s easy to fractionalize an NFT, it’s much harder to undo it. This often involves having a majority of token holders voting to turn it back into the NFT in exchange for a payout.","The DAO set up to support the initiative is called the Harambe DAO. The tokens will be used for governance purposes within the DAO. The DAO said it has donated $25,000 to the Dian Fossey Gorilla Fund.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harambe DAO","content":"ORGANIZATION"},{"type":"Kang","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Cincinnati","content":"LOCATION"},{"type":"Jeff McCurry","content":"PERSON"},{"type":"McCurry","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"two years later","content":"DATE"},{"type":"September","content":"DATE"},{"type":"May Harambe","content":"ORGANIZATION"},{"type":"$25,000","content":"MONEY"},{"type":"$5 million","content":"MONEY"},{"type":"Dian Fossey","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Harambe","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"TRUMP","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Andrew Kang","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"DAO","content":"ORGANIZATION"},{"type":"two months later","content":"DATE"},{"type":"Harambe NFT","content":"ORGANIZATION"},{"type":"$HARAMBE","content":"MONEY"}],"hashtag":["DAOS","TOKENS"],"authors":["Tim Copeland","The Block"]}