{"summary":"Manta Pacific rose to the third-largest Layer 2 network in just five months for two core reasons, according to co-founder Kenny Li.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274807\/manta-kenny-li-interview","publishDate":"2024-01-29T07:13:24","id":10690,"type":null,"title":"Manta co-founder on why Manta Pacific became the third-largest Layer 2 network by TVL","category":["PEOPLE"],"content":["Earlier this month, Manta Pacific overtook Coinbase’s Base network to become the second-largest Layer 2 network — just five months after <a href=\"https:\/\/www.theblock.co\/post\/250538\/manta-pacific-mainnet\" data-v-f87c67ca=\"\">launch<\/a>.","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Manta Network <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/273326\/manta-network-manta-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MANTA<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.29%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Kenny Li says this was for two main reasons. To start with, he said, the project’s New Paradigm campaign pushed the network into fourth place a few weeks prior. This was an upgrade that introduced yield-bearing assets natively into the Layer 2 network.<\/span>","As a result, when someone deposits ether, the platform stakes it and returns the yield to the user. If they deposit the stablecoin USDC, this is used to earn yield from U.S. Treasurys through the platform’s partner Mountain Protocol. “Overall, I think that drove a massive amount of interest in a short amount of time. And that grew us to the top four,” said Li, adding: “And then after our token launch itself, with a lot of the liquidity and volume on our actual chain — because that's where it's natively deployed — I think that really pushed us into the top three.\"","Manta Pacific is an EVM-compatible network that offers support for decentralized applications and uses <a href=\"https:\/\/www.theblock.co\/post\/268071\/manta-pacific-celestia\" data-v-f87c67ca=\"\">Celestia for data availability<\/a> (technically making it a validium). Built using the OP Stack, Manta Pacific currently has $1.7 billion of value in its smart contracts, falling behind Arbitrum and Optimism. It has gone far past Base, which has just $709 million of value in its smart contracts, according to <a href=\"https:\/\/l2beat.com\/scaling\/summary\" data-v-f87c67ca=\"\">L2 Beat<\/a>.&nbsp;","Manta Pacific is one of two networks offered by Manta Network. The other is Manta Atlantic, a zero-knowledge proof blockchain running on Polkadot. Manta Atlantic offers support for confidential on-chain identities and credentials.","The Manta Network <a href=\"https:\/\/www.theblock.co\/price\/273326\/manta-network-manta-usd\" data-v-f87c67ca=\"\">token<\/a> was launched on Jan. 18. Immediately after going live, it was hit by what the project described as a distributed denial of service attack. Li said the project saw almost one billion requests hit its RPC nodes, which are used by other users to make transactions.","“It was quite a rollercoaster,” Li said. “But overall, I think we were able to navigate that well as a community, as a team.”","Li said the project has a lot of information around the IP addresses, the data centers and the cloud service providers that were used to carry out the attack. He said the project is trying to determine what happened and identify the perpetrators.","Li noted that the attack caused a lot of congestion, which raised transaction fees across the network for everyone trying to claim their tokens. They rose as high as $20 to $30, he said, adding that the project remunerated everyone for this.","While not directly related, Li said that since the project has moved to Celestia for storing its batched transaction data, this has saved the network’s users around $1 million in transaction fees. That’s because it’s cheaper to store the data on Celestia than the Ethereum mainnet.","Going ahead, Manta Pacific is <a href=\"https:\/\/www.theblock.co\/post\/256348\/manta-pacific-migration-optimism-polygon-zkevm-ethereum-layer-2\" data-v-f87c67ca=\"\">in the throes<\/a> of being converted to a zkEVM. This would make it based on zero-knowledge proof technology while being compatible with the Ethereum blockchain.","As for Manta Network, its main focus is on encouraging projects to build on its ecosystem and supporting the more than 150 projects that are already there, Li said. “We're purely focused on helping these ecosystem products grow,” he said, adding that it’s the main focus for at least the next quarter.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$30","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Mountain Protocol","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"next quarter","content":"DATE"},{"type":"Kenny Li","content":"PERSON"},{"type":"$709 million","content":"MONEY"},{"type":"Manta Network","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$20","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Manta Atlantic","content":"LOCATION"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Manta Pacific","content":"LOCATION"},{"type":"Manta Network","content":"LOCATION"},{"type":"Jan. 18","content":"DATE"},{"type":"Celestia","content":"LOCATION"},{"type":"Li","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Manta Network <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/273326\/manta-network-manta-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MANTA","content":"LOCATION"},{"type":"-2.29%","content":"PERCENT"},{"type":"OP Stack","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","BASE","OPTIMISM","ZKEVM"],"authors":["Tim Copeland","The Block"]}