{"summary":"KuCoin Pool, which supports bitcoin and litecoin mining services, is set to halt operations from Aug. 15 until further notice.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242800\/bitcoin-litecoin-kucoin-pool-halt-operations","publishDate":"2023-08-02T11:53:37","id":10697,"type":null,"title":"KuCoin to halt bitcoin and litecoin mining pool services","category":["COMPANIES"],"content":["KuCoin Pool, a crypto mining pool that supports bitcoin and litecoin services, will halt operations from Aug. 15 until further notice.","The move is \"in line with KuCoin's evolving business strategy,\" <a href=\"https:\/\/www.kucoin.com\/announcement\/en-announcement-kucoin-pool-to-temporarily-suspend-operations\" data-v-f87c67ca=\"\">said<\/a> KuCoin, which also operates a crypto exchange. A company spokesperson told The Block that the company would focus on its core business and&nbsp;provide users with a safer and more user-friendly trading platform","\"We will see if it is needed to restart based on the market and users' demand in the future,\" the spokesperson said when asked if KuCoin Pool would ever return.","The suspension of KuCoin Pool comes two years after it was <a href=\"https:\/\/www.kucoin.com\/news\/en-kucoin-pool-goes-live-connect-to-kucoin-pool-to-claim-bonus\" data-v-f87c67ca=\"\">first launched<\/a> in Aug. 2021. The news coincides with the Litecoin halving event, which occurred today and cut the blockchain network's per block reward to 6.25 LTC from 12.5 LTC.","KuCoin Pool is currently ranked as the <a href=\"https:\/\/miningpoolstats.stream\/bitcoin\" data-v-f87c67ca=\"\">8th largest<\/a> for bitcoin mining and the <a href=\"https:\/\/miningpoolstats.stream\/litecoin\" data-v-f87c67ca=\"\">11th largest<\/a> for litecoin mining, according to MiningPoolStats data.","KuCoin Pool users will retain \"complete access and control\" over their assets throughout the suspension, KuCoin said, adding that users should migrate their mining machines to alternative mining pools before Aug. 15.","\"Please be informed that failure to migrate to alternative mining pools within the aforementioned timeline may affect your mining revenue, and KuCoin Pool will not be held accountable for any potential earnings lapses,\" KuCoin said. It also suggested miners back up and preserve their mining records and associated data before Aug. 27.","KuCoin's trading platform is currently ranked as the 8th largest in terms of spot trading volume, according to<a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\"> The Block's Data Dashboard. <\/a>","In June, KuCoin <a href=\"https:\/\/www.theblock.co\/post\/236838\/crypto-exchange-kucoin-mandatory-kyc\" data-v-f87c67ca=\"\">introduced<\/a> compulsory know-your-customer procedures for all clients to \"better comply with the applicable regulatory requirements.\" Earlier this year, New York State Attorney General Letitia James <a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\">sued KuCoin<\/a>, saying the crypto exchange is an unregistered commodities and securities broker or dealer.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"KuCoin","content":"PERSON"},{"type":"KuCoin Pool","content":"ORGANIZATION"},{"type":"New York State","content":"ORGANIZATION"},{"type":"Aug. 2021","content":"DATE"},{"type":"Aug. 27","content":"DATE"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Aug. 15","content":"DATE"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Letitia James <a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\">sued KuCoin","content":"PERSON"},{"type":"LTC","content":"ORGANIZATION"}],"hashtag":["MINING"],"authors":["Yogita Khatri","The Block"]}