{"summary":"After day after day of dominance it appeared Grayscale&#x27;s spot bitcoin ETF may finally lose the crown for total daily trading volume.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275240\/blackrock-and-fidelity-spot-bitcoin-etfs-are-on-track-to-outpace-grayscale-in-daily-trading-volume-for-first-time","publishDate":"2024-01-30T14:14:56","id":10695,"type":null,"title":"BlackRock and Fidelity spot bitcoin ETFs close in on Grayscale in daily trading volume","category":["FUNDS"],"content":["After several days in a row of dominance, it appeared for a time on Tuesday that BlackRock and Fidelity spot bitcoin ETFs might surpass Grayscale's fund in terms of daily volume for the first time since the products began trading more than two weeks ago.","Grayscale's fund, a conversion rather than a brand new product, has shed billions of dollars after starting with more than $25 billion in assets under management. In terms of total trading volume — buying and selling — the BlackRock and Fidelity new spot bitcoin ETFs have been ranking second and third behind Grayscale.","As market close on Tuesday, BlackRock and Fidelity had generated, according to Yahoo Finance data compiled by The Block, $383 million and $288 million in trading volume, respectively. Grayscale ranked first again with $396 million.","Around the midway point on Tuesday, BlackRock and Fidelity both led Grayscale in terms of daily volume.","Since trading began this month, the three issuers have dominated total trading volume, accounting for, at times, about 90% of all buying and selling activity. Other spot bitcoin ETFs like those offered by Invesco and Galaxy, Franklin Templeton and Ark Invest have trailed far behind the top three.&nbsp;","Total daily trading volume for Tuesday was about $1.2 billion, according to Yahoo Finance data compiled by The Block.","So far, Grayscale's ETF has lost more than $5 billion in assets under management, <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1752376723847409873\" data-v-f87c67ca=\"\">according to<\/a> Bloomberg Intelligence ETF analyst James Seyffart. Both BlackRock and Fidelity's products are net positive by more than $2 billion.&nbsp;","In what may be an effort to gain a competitive edge, Invesco and Galaxy Asset Management on Monday announced in a <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1855781\/000119312524018212\/d721311dex991.htm\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">filing<\/a> that the firms intend to cut their fund's fee from 0.39% to to 0.25%, which will put them on par with most rivals.","Total trading volume for all of the active spot bitcoin ETFs is nearing $27 billion, also according to Seyffart's post on Tuesday. Many market watchers and crypto enthusiasts have heralded the billions of dollars of money flowing into the new ETFs as a positive development for digital assets.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/cumulative-spot-bitcoin-etf-volumes\/embed\" title=\"Cumulative Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Bloomberg Intelligence ETF","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"0.39%","content":"PERCENT"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Seyffart","content":"ORGANIZATION"},{"type":"$25 billion","content":"MONEY"},{"type":"James Seyffart","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"0.25%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Galaxy Asset Management","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$383 million","content":"MONEY"},{"type":"$288 million","content":"MONEY"},{"type":"$396 million","content":"MONEY"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"$27 billion","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["RT Watson","The Block"]}