{"summary":"Crypto exchange Enclave Markets has launched a &quot;OTC dark pool&quot; for institutional traders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168578\/crypto-exchange-enclave-launches-confidential-trading-platform-for-institutions","publishDate":"2022-09-08T09:16:52","id":10692,"type":null,"title":"Crypto exchange Enclave launches confidential trading platform for institutions","category":["CAPITAL MARKETS"],"content":["San Francisco-based Enclave Markets announced the launch of a fully confidential trading platform for institutional investors on Thursday.","The crypto exchange's new service, Enclave Cross, will allow users to trade blocks of digital assets at the market price without any information leakage. The product was developed to be an over-the-counter (OTC) digital asset dark pool, where traders execute trades in private using smart contracts.","The firm's CEO David Wells told The Block the product is in line with one of the supposed founding principles of crypto: the concept of levelling the playing field.&nbsp;","\"No one, not even a system administrator, knows the amount of open interest before trades are executed. At Enclave Markets, we give our users the ability to maximize these advantages — all within a fully compliant network,\" he said in a release.&nbsp;","Wells went on to say that all assets and trades are held and executed off-chain, meaning others in the marketplace will only see when the funds are withdrawn from the platform. This reduces the impact of a time mismatch of buyers and sellers, according to the CEO.","Verified traders move their assets off-chain onto the firm's platform, allowing Enclave Cross to match traders directly with any interested counterparties and without sharing wallet addresses.","Enclave Markets focuses on institutional-grade trading by combining centralized and decentralized elements. As such its new product offering has begun&nbsp; testing with institutional trading firms such as, Hidden Road Partners, LedgerPrime and Republic Crypto, among others.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Republic Crypto","content":"LOCATION"},{"type":"Enclave Cross","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Enclave Markets","content":"ORGANIZATION"},{"type":"David Wells","content":"PERSON"},{"type":"Hidden Road Partners","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}