{"summary":"ARK Invest sold nearly half a million Coinbase shares after the crypto exchange earned analyst upgrades for its Q4 outperformance.","author":["Adam James","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277968\/cathie-wood-ark-invest-coinbase-90m-usd-analyst-upgrades","publishDate":"2024-02-19T03:24:11","id":107,"type":null,"title":"Cathie Wood&#x27;s ARK Invest unloads Coinbase shares worth $90 million","category":["Funds"],"content":["ARK Invest, an investment solutions provider and one of Coinbase’s largest institutional backers, sold nearly half a million shares in the Nasdaq-listed centralized crypto exchange for about $90 million on Friday.","Cathie Wood’s investment firm unloaded a total of 499,149 COIN shares from its exchange-traded funds. Specifically, it sold 397,924 shares from its ARK Innovation exchange-traded fund (ARKK), 45,433 shares from its ARK Next Generation Internet ETF (ARKW), and 55,792 shares from its ARK Fintech Innovation ETF (ARKF).","The large sale came after <a href=\"https:\/\/www.theblock.co\/post\/277726\/coinbase-beats-q4-estimates-as-transaction-revenue-rises-to-529-million\" data-v-f87c67ca=\"\">Coinbase received a multitude of analyst upgrades<\/a> — from the likes of KBW, Wedbush, Canaccord Genuity, and JPM Securities — resulting from better-than-expected fourth-quarter results.","J.P. Morgan analyst Kenneth Worthington was less positive,&nbsp;<a href=\"https:\/\/www.coindesk.com\/business\/2024\/02\/16\/jpmorgan-criticizes-coinbases-lack-of-insights-into-its-etf-business\/?_gl=1*wt612f*_up*MQ..*_ga*MTk2OTg1MDIxNy4xNzA4MzI4NjE2*_ga_VM3STRYVN8*MTcwODMyODYxNi4xLjAuMTcwODMyODYxNi4wLjAuMA..\" data-v-f87c67ca=\"\">claiming<\/a> the firm is “still uncertain of its true earning impact\" while acknowledging both strengths and weaknesses. This perspective contrasts with Coinbase’s positive outlook on its participation in the U.S. spot Bitcoin ETF.","Worthington was also critical of the exchange’s lack of clarity around its ETF custodial services.","Meanwhile, the stock price of the crypto exchange saw an increase of nearly 27% last week.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/public-companies\/coinbase-pre-ipo-stock-price\/embed\" title=\"Coinbase Valuation\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;"],"hashtag":["COINBASE","EQUITY MOVERS","INVESTMENT FIRMS"]}