{"summary":"One of the central topics at our recent Lisk.js 2021 event was the publication of the Lisk interoperability solution. Since we announced that all the research up to blockchain interoperability was completed one year ago, the main focus of the team has been on the Lisk interoperability phase of the roadmap. We take great pride in the fact that we have proposed a scalable and decentralized interoperability solution for the Lisk ecosystem. Since we announced that all the research up to blockchain interoperability was completed one year ago, the main focus of the team has been on the Lisk interoperability phase of the roadmap. Each roadmap objective defines one key aspect of our interoperability solution that is addressed by one or more LIPs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105913\/lisk-interoperability-solution-published","publishDate":"2021-05-26T08:55:11","id":10703,"type":null,"title":"Lisk Interoperability Solution Published","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">One of the central topics at our recent <\/span><a href=\"https:\/\/lisk.io\/liskjs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk.js 2021<\/span><\/a><span data-v-f87c67ca=\"\"> event was the publication of the Lisk interoperability solution. Since we announced that <\/span><a href=\"https:\/\/lisk.io\/blog\/research\/all-research-blockchain-interoperability-completed\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">all the research up to blockchain interoperability<\/span><\/a><span data-v-f87c67ca=\"\"> was completed one year ago, the main focus of the team has been on the Lisk interoperability phase of the roadmap. We take great pride in the fact that we have proposed a scalable and decentralized interoperability solution for the Lisk ecosystem.<\/span>","<span data-v-f87c67ca=\"\">To easily comprehend the entire interoperability solution, we organized it around 8 roadmap objectives. Each roadmap objective defines one key aspect of our interoperability solution that is addressed by one or more LIPs. For these LIPs, we distinguish between interoperability core LIPs and supporting LIPs. Some of these are already present in our <\/span><a href=\"https:\/\/research.lisk.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Research forum<\/span><\/a><span data-v-f87c67ca=\"\"> and the remainder will be published in the next few weeks.<\/span>","<span data-v-f87c67ca=\"\">The goal of this roadmap objective is to introduce the data structures and the transactions necessary to exchange messages between chains participating in the Lisk interoperability.<\/span>","<span data-v-f87c67ca=\"\">This objective aims to define the lifecycle of a sidechain, starting from its connection to the Lisk ecosystem, realized by its registration on the mainchain, up to its potential termination including the recovery mechanisms from terminated chains.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The goal of this roadmap objective is to introduce a new state model and the concept of state root in the Lisk protocol.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The goal of this roadmap objective is to introduce the data structures and transactions to be used to handle tokens in the Lisk ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Lisk-BFT is the new consensus protocol introduced as part of Lisk Core 3.0. It defines a protocol for validators to finalize blocks using two rounds of voting on blocks. In order to support the new Proof-of-Authority mechanism and cross-chain certification for interoperability, the Lisk-BFT protocol requires some modifications that are encompassed by this roadmap objective.<\/span>","<span data-v-f87c67ca=\"\">The block header schema was touched in several other LIPs, including the LIP <\/span><a href=\"https:\/\/research.lisk.com\/t\/state-model-and-state-root\/301\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">State model and state root<\/span><\/a><span data-v-f87c67ca=\"\"> or the LIP <\/span><a href=\"https:\/\/research.lisk.com\/t\/introduce-a-certificate-generation-mechanism\/296\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Introduce a certificate generation mechanism<\/span><\/a><span data-v-f87c67ca=\"\">. This roadmap objective aims to cover all changes to the block header schema in one place, which is achieved by the LIP <\/span><a href=\"https:\/\/research.lisk.com\/t\/new-block-header-and-block-asset-schema\/293\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">New block header schema<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Currently, the SDK offers DPoS as the only validator selection mechanism by default for new blockchains. This objective aims to provide alternative mechanisms for future sidechains so that they can adapt for a wider range of use cases and applications.<\/span>","<span data-v-f87c67ca=\"\">This roadmap objective has two main goals. The first one is to enable compact aggregate multisignatures. Without them, the certificates contained in a cross-chain update transaction would be significantly larger. The second one is to remove any security risk of signature re-purposing and signature replays that may occur once new data structures are signed within the Lisk ecosystem.<\/span>","<span data-v-f87c67ca=\"\">If you watched Lisk.js 2021, then you are surely aware that the Research team’s work is far from over. With the publication of the entire amount of interoperability and supporting LIPs, the team will first focus on an improvement phase for the interoperability solution. During this phase, we will work on topics such as reducing the time for finality in the consensus mechanism or providing a sound incentivization for the role of the relayer in the interoperability solution. We will also collaborate with our colleagues in UI to ensure that the accessibility for end-users to the Lisk ecosystem is as seamless and secure as possible. In general terms, with the completion of this phase, the Lisk ecosystem will reach a higher level of future-proofness.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Looking further ahead, one of the key features to be added to the Lisk ecosystem is the capability to interoperate with other existing ecosystems. This will be the goal of the blockchain interoperability phase crystallized in the concept of Lisk bridges. Once this roadmap objective is completed, the Lisk ecosystem will not only be a solid autonomous blockchain application platform but also a universally interoperable blockchain solution.<\/span><span data-v-f87c67ca=\"\">In the meantime, we encourage the entire Lisk community, and particularly those with a technical focus, to discover every detail of our interoperability solution in the <\/span><a href=\"https:\/\/research.lisk.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Research forum<\/span><\/a><span data-v-f87c67ca=\"\"> and give feedback about it.<\/span>","For more details click <a href=\"https:\/\/lisk.com\/blog\/research\/lisk-interoperability-solution-published\" data-v-f87c67ca=\"\">here.<\/a>"],"entity":[{"type":"SDK","content":"ORGANIZATION"},{"type":"LIP <\/span><a href=\"https:\/\/research.lisk.com\/t\/state-model-and-state-root\/301\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">State","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Lisk","content":"PERSON"},{"type":"Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}