{"summary":"“This partnership reflects our commitment to providing institutions and investors with exposure to leading assets,&quot; MarketVector said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241732\/marketvector-figment-introduce-first-staking-rewards-indexes","publishDate":"2023-07-27T11:43:15","id":10701,"type":null,"title":"MarketVector, Figment introduce first staking rewards indexes","category":["COMPANIES"],"content":["MarketVector Indexes is partnering with staking infrastructure firm Figment to introduce what it says are the industry’s first <a href=\"https:\/\/www.theblock.co\/post\/229399\/coinfund-ethereum-yield\" data-v-f87c67ca=\"\">Ethereum staking<\/a> rewards indexes.","“We’ve been proud to be on the forefront of digital assets indexing and this partnership with <a href=\"https:\/\/figment.io\/\" data-v-f87c67ca=\"\">Figment<\/a> reflects our commitment to providing institutions and investors with exposure to leading assets,\" MarketVector digital assets product strategist Martin Leinweber said in a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20230727449147\/en\/MarketVector-Indexes%E2%84%A2-and-Figment-Partner-on-the-Industry%E2%80%99s-First-Staking-Rewards-Indexes\" data-v-f87c67ca=\"\">statement<\/a>.","\"Now, asset managers and advisors are able to have customizable access to staking rewards as an industry first,\" he continued.","The partnership plans to launch two products — the MarketVector Figment Ethereum Staking Reward Reference Rate and the MarketVector Figment Ethereum Total Return Index.","Figment business development lead Josh Deems said the new products would \"address one of the most significant challenges faced by institutions in the digital asset space, which is access to reliable, robust data.\"","Deems added the indexes would \"unlock new opportunities for institutions offering investors exposure to digital assets.\" He said that it would allow asset managers to provide products with staking rewards benchmarked against the new indexes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Leinweber","content":"PERSON"},{"type":"MarketVector Figment Ethereum Total Return Index","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Josh Deems","content":"PERSON"},{"type":"MarketVector Figment Ethereum Staking Reward Reference Rate","content":"ORGANIZATION"}],"hashtag":["STAKING FIRMS"],"authors":["Brian McGleenon","The Block"]}