{"summary":"Escape Velocity, a crypto venture firm founded by two 27-year-olds, has raised a $25 million fund backed by prominent VCs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203823\/castle-island-a16z-escape-velocity-fund","publishDate":"2023-01-20T05:16:13","id":10706,"type":null,"title":"Castle Island, a16z founders back Escape Velocity&#x27;s $25 million fund","category":["DEALS"],"content":["Mahesh Ramakrishnan and Salvador Gala, two 27-year-old Goldman Sachs alumni, have raised $25 million for their crypto-focused venture firm's first fund.&nbsp;","Known as&nbsp;<a href=\"https:\/\/ev3.xyz\/\" data-v-f87c67ca=\"\">Escape Velocity<\/a>, the Boston-based firm started fundraising in June last year, when many crypto VCs were licking their wounds from the collapse of the Terra ecosystem.","The pair already have $25 million in hard commitments but the total raised could go up to a $30 million cap before the fund officially closes in the coming weeks, Ramakrishnan said in an interview. <a href=\"https:\/\/moneromr.substack.com\/p\/escape-velocity-launches-25m-fund\" data-v-f87c67ca=\"\">Backing<\/a> comes from founders from several top tier venture institutions such as Andreessen Horowitz (a16z), Castle Island Ventures, Multicoin, Ribbit Capital and Framework Ventures — as well as senior partners from Apollo Global Management, where Ramakrishnan previously worked.","The pair say they managed to capture the attention of industry titans despite crypto's crisis of confidence by expounding an investment thesis centered on the decentralization of digital commodities such as bandwidth and computing power.","\"The next 15 years is far more about being distributed,\" Ramakrishnan said. \"Because there's so many computers out there right now, there's so many pieces of hardware out there right now, with excess capacity that you can monetize.\"","\"I think we're hitting the point at which monetizing that excess capacity is actually&nbsp; far more valuable and cost efficient paradigm than continuing to double down on scale, so we're really investing in that transition,\" he added.","The new fund seeks to invest in early-stage projects that are either decentralizing networks such as wireless and energy or providing tools to enable this transition. Check sizes will be anywhere between $250,000 to $1 million, with the funds being deployed over the course of three years, Ramakrishnan said. About a third of the cash is reserved for follow-on investments.&nbsp;","With crypto enduring such a tough year in 2022, culminating in FTX filing for bankruptcy in November, Escape Velocity's founders were pleased not to lose any commitments following the exchange giant's implosion.&nbsp;","\"A lot of people are looking for some degree of validation that crypto was still an interesting idea, that all of this wasn't going to go to zero or fall apart,\" Ramakrishnan said. \"That's really where we were able to add a bit of differentiation because I think we tend to be really, really deep at the core of the networks that we're investing in.\"","The fund has already made five investments, including Xnet and Andrena. Ramakrishnan listed Ribbit Capital and Framework as venture firms they aspire to copy.","<em data-v-f87c67ca=\"\">This story has been updated to include Ribbit Capital and Multicoin as backers.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ramakrishnan","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"Apollo Global Management","content":"ORGANIZATION"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Multicoin","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Escape Velocity","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"June last year","content":"DATE"},{"type":"Mahesh Ramakrishnan","content":"PERSON"},{"type":"$25 million","content":"MONEY"}],"hashtag":["ANDREESSEN HOROWITZ","SEED &AMP; PRE-SEED","SERIES A"],"authors":["Kari McMahon","The Block"]}