{"summary":"This past week saw the successful final Ethereum testnet merge, BlackRock launching a bitcoin product and Tornado Cash sanctioned by the US.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163398\/three-biggest-stories-from-past-week-in-the-crypto-space","publishDate":"2022-08-13T12:18:17","id":10708,"type":null,"title":"Three biggest stories from past week in the crypto space","category":["CRYPTOCURRENCY"],"content":["There is seldom a dull moment in the crypto news cycle and the past week was no different.","The US Treasury sanctioned open-source code for the first time, Ethereum’s transition to proof-of-stake passed another milestone and the institutional bitcoin investment space welcomed a major player.","Here are three of the biggest stories from this past week:","The US Treasury <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">imposed sanctions on crypto mixer Tornado Cash<\/a> by adding 44 Ethereum and usd coin (USDC) wallets associated with the service to its Specially Designated Nationals list. US authorities said the action was in connection with reports that North Korean hackers were using the mixer to launder proceeds from several high-profile crypto hacks.","Monday’s sanctions triggered widespread criticisms from several quarters in the crypto space. <a href=\"https:\/\/www.theblock.co\/post\/163252\/dangerous-precedent-crypto-execs-slam-arrest-of-suspected-tornado-cash-developer\" data-v-f87c67ca=\"\">These criticisms increased<\/a> when Dutch authorities <a href=\"https:\/\/www.theblock.co\/post\/163206\/suspected-tornado-cash-developer-arrested-in-amsterdam\" data-v-f87c67ca=\"\">arrested a Tornado Cash developer<\/a> on Friday.","Tornado Cash has faced de-platforming issues on multiple fronts all week. The mixer’s website, email and GitHub have been taken down. The same happened with Tornado Cash’s <a href=\"https:\/\/www.theblock.co\/post\/163228\/tornado-cashs-discord-server-and-governance-forum-shuttered-amid-arrest?utm_source=cryptopanic&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Discord server and community page<\/a>.","USDC stablecoin issuer Circle also <a href=\"https:\/\/www.theblock.co\/post\/162172\/circle-freezes-usdc-funds-in-tornado-cashs-us-treasury-sanctioned-wallets\" data-v-f87c67ca=\"\">froze the mixer’s fund<\/a>s in the sanctioned wallets. Crypto apps including DeFi protocols and node providers have begun <a href=\"https:\/\/www.theblock.co\/post\/162928\/dydx-confirms-blocking-user-accounts-tied-to-tornado-cash\" data-v-f87c67ca=\"\">blocking access to users<\/a> with wallets that have Tornado Cash transactions in their history.","Ethereum developers executed the Goerli testnet merge on Wednesday. This marked the final dress rehearsal for the mainnet merge when Ethereum will transition from proof-of-work (PoW) to proof-of-stake (PoS).","The mainnet merge now has <a href=\"https:\/\/www.theblock.co\/post\/162988\/ethereum-foundation-suggests-tentative-dates-for-the-merge\" data-v-f87c67ca=\"\">a tentative date<\/a>. Ethereum core developers said on Thursday that the event will likely happen in mid-September — 15th or 16th.","Not everyone in the Ethereum ecosystem supports the merge. There are reports of a miner-led hard fork of the blockchain to maintain the PoW status quo. Those at the heart of this movement said on Friday that an <a href=\"https:\/\/www.theblock.co\/post\/163229\/ethpow-team-says-its-miner-led-ethereum-fork-is-inevitable\" data-v-f87c67ca=\"\">ETHPoW chain was inevitable<\/a>. Ethereum co-creator Vitali Buterin added to the conversation, saying an ETHPoW fork was <a href=\"https:\/\/www.theblock.co\/post\/162066\/potential-ethereum-proof-of-work-fork-unlikely-to-succeed-says-vitalik-buterin\" data-v-f87c67ca=\"\">unlikely to succeed<\/a>.","The $9 trillion asset manager <a href=\"https:\/\/www.theblock.co\/post\/162987\/blackrock-launches-private-trust-offering-direct-bitcoin-exposure\" data-v-f87c67ca=\"\">announced its first crypto offering<\/a>: a private bitcoin (BTC) trust for institutional investors. This BlackRock product offers US institutional investors direct exposure to spot BTC.","The announcement came barely a week after the asset management giant <a href=\"https:\/\/www.theblock.co\/post\/161450\/blackrock-to-offer-institutional-clients-access-to-crypto\" data-v-f87c67ca=\"\">partnered with Coinbase<\/a>. BlackRock’s deal with Coinbase will see the former being able to offer corporate clients access to crypto investment products via Coinbase Prime.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US Treasury","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Specially Designated Nationals","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Vitali Buterin","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Coinbase Prime","content":"ORGANIZATION"},{"type":"$9 trillion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["BLACKROCK","ETHEREUM"],"authors":["Osato Avan-Nomayo","The Block"]}