{"summary":"The firm said it has filed its spot bitcoin ETF application with the SFC and is &#x27;in active discussion&#x27; with the Hong Kong regulator.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285263\/hong-kong-vsfg-spot-bitcoin-etf-may","publishDate":"2024-03-28T05:28:40","id":10702,"type":null,"title":"Hong Kong finance firm VSFG aims to launch spot bitcoin ETF as early as May","category":["FUNDS"],"content":["<span data-v-f87c67ca=\"\">Venture Smart Financial Holdings Ltd., a Hong Kong-based financial services firm, has submitted its application for a spot bitcoin exchange-traded fund — and aims to launch the ETF as early as May.<\/span>","<span data-v-f87c67ca=\"\">Brian Chan, group head of investment and products of VSFG, told The Block on Thursday that the team is hoping for a May launch “if all goes smoothly.”<\/span>","<span data-v-f87c67ca=\"\">“But we're also keeping June in our sights just to be on the safe side,” Chan said. “It's tough to pin down an exact date with regulatory processes, but we're in active discussions with the SFC. We've hit the ground running with their initial feedback and are working together closely.”<\/span>","<span data-v-f87c67ca=\"\">Hong Kong is paving the way for spot crypto ETFs, with the Securities and Futures Commission and the Hong Kong Monetary Authority, its de facto central bank, announcing in December that both agencies have reviewed their existing policy. The regulators <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/circular\/doc?refNo=23EC67\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published two circulars<\/span><\/a><span data-v-f87c67ca=\"\"> addressing the requirements for spot crypto ETFs.<\/span>","<span data-v-f87c67ca=\"\">Bloomberg Senior ETF Analyst Eric Balchunas <\/span><a href=\"https:\/\/x.com\/EricBalchunas\/status\/1772602019133423921?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">posted<\/span><\/a><span data-v-f87c67ca=\"\"> on X, citing a Bloomberg Intelligence report, that the SFC is looking to allow in-kind creations and redemptions for spot bitcoin ETFs in the second quarter of this year. That could potentially help spark assets under management and volume, Balchunas said.<\/span>","<span data-v-f87c67ca=\"\">“We're excited about the prospect of adding this feature for sure as it will be exclusive for the Hong Kong market and it potentially leads to higher AUM,” said Chan of VSFG. “Meanwhile, the approval would not only benefit ETF issuers but also the HKEx and VATPs and qualified Participating Dealers in Hong Kong, creating a win-win situation.”<\/span>","<span data-v-f87c67ca=\"\">Chan added that it's important to recognize variables at play, such as the readiness of various service providers, which “introduce a degree of uncertainty.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"second quarter of this year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Smart Financial Holdings Ltd.","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Brian Chan","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Balchunas","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["ASIAN REGULATION","SPOT BITCOIN ETF"],"authors":["Timmy Shen","The Block"]}