{"summary":"SharesPost Digital Assets CEO John Wu has left after one year with the broker dealer, seemingly to focus on starting a new venture. But, the firm has yet","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33893\/sharespost-digital-assets-ceo-moves-on-company-has-yet-to-replace-him","publishDate":"2019-07-30T16:10:42","id":10709,"type":null,"title":"SharesPost Digital Assets CEO moves on, company has yet to replace him","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">SharesPost Digital Assets CEO John Wu has left after one year with the broker dealer, seemingly to focus on starting a new venture. But, the firm has yet to replace him, according to a source with knowledge of the matter.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">SharesPost Digital Assets confirmed Wu’s move from CEO to an advisory role at the firm. It declined to comment further on the details surrounding Wu's departure or what this means for the Digital Assets unit of the company. The Digital Assets unit is an arm of SharesPost, which also operates a marketplace for trading private shares and a crypto alternative trading system.<\/span>","<span data-v-f87c67ca=\"\">The firm's crypto unit completed a secondary trade of security tokens on the blockchain at the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/blockchain-capitals-bcap-security-tokens-to-be-listed-on-sharespost-marketplace\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">start of this year<\/span><\/a><span data-v-f87c67ca=\"\">. It became the first marketplace offering secondary trading as well as custody of digital securities.&nbsp; <\/span>","<span data-v-f87c67ca=\"\">A person with direct knowledge of the situation said the digital assets arm has been integrated into the larger firm.<\/span>","<span data-v-f87c67ca=\"\">“DA is a whole-firm strategy and touches every part of what we do,” said a person familiar with the matter. “The market is developing, albeit slower than some initially anticipated.”<\/span>","<span data-v-f87c67ca=\"\">Wu did not respond to a request for comment in time for publication.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wu’s LinkedIn lists him in multiple advisory roles at places like CapLinked, CoinAlpha and Cornell Blockchain. According to SharesPost, he will take on an advisor role there as well after stepping down as CEO.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Amid his activities at SharesPost and his advisor roles at various ventures, Wu has been helming his own company. Sego, once Sureview Capital, invests in various technology and fintech products.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now it seems Wu is looking to bootstrap another project. He founded Trellis Software this year, a software company aimed at automating some of the challenges that come with alternatives investing. The platform also purports to help issuers that haven’t conducted an initial public offering capital raise in a more efficient and compliant way, matching investors with opportunities. The goal is to become a “virtual capital markets desk for alternative assets,” according to Trellis.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sureview Capital","content":"ORGANIZATION"},{"type":"John Wu","content":"PERSON"},{"type":"SharesPost","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CoinAlpha","content":"ORGANIZATION"},{"type":"SharesPost Digital Assets","content":"ORGANIZATION"},{"type":"Digital Assets","content":"ORGANIZATION"},{"type":"Cornell Blockchain","content":"ORGANIZATION"}],"hashtag":["HIRING"],"authors":["Aislinn Keely","The Block"]}