{"summary":"Fractal, which raised $6 million, provides on-chain transparency in crypto following the collapse of FTX and others.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226652\/crypto-transparency-fractal-raises-6-million-to-reshape-market-structure-after-ftx-3ac","publishDate":"2023-04-17T12:04:05","id":10705,"type":null,"title":"Crypto startup wants to bring transparency in a post-FTX world","category":["MARKETS"],"content":["\"They sent us the term sheet a week after FTX blew up.\"","Aya Kantorovich — a crypto markets wonk — is talking about her new startup Fractal, which in her opinion could have prevented many of the capital market blunders that plagued the scabrous industry in 2022.&nbsp;","Hack VC said it sent the term sheet to Fractal on November 18, seven days after FTX filed for bankruptcy, and amid increasing institutional investor interest in on-chain finance.&nbsp;","The new company, which announced a $6 million fundraise on Monday, is building out a platform that facilitates more transparent clearing and settlement in digital assets, stripping out the opaqueness that led to the levered deal-making that precipitated the collapse of firms like Three Arrows Capital and FTX.&nbsp;","Kantorovich is co-CEO of Fractal alongside Alex Elkrief, a former engineer at LedgerPrime, a hedge fund, was acquired by FTX in 2021 and turned into a family office before the bankruptcy. Kantorovich and Elkrief are married and Kantorovich joined the Fractal team on April 1.&nbsp;","With Fractal, clients will be able to monitor their positions in real time with counter-parties to reduce counterparty risk. In theory, that means that a counter-party can't trade using the same collateral with multiple counter-parties.","Collateral for borrowing will be limited to crypto blue-chip coins to avoid the wrong-sided liquidity issues that counter-parties face with Alameda, which borrowed against their holdings in their native token FTT.&nbsp;","\"A trade with counterparty A and counterparty B doesn't necessarily affect the rest of their counterparties because they all have segregated accounts and you have to post collateral with each account,\" Kantorovich said. \"If someone deposits $10 million with a counter-party and that shows up in a dashboard, you can see it is not being rehypothecated.\"","Fractal's not alone in its mission. Longtime crypto markets executive Michael Moro joined an <a href=\"https:\/\/www.theblock.co\/post\/224765\/former-genesis-ceo-cryptocurency-derivatives-exchange\" data-v-f87c67ca=\"\">upstart derivatives exchange<\/a> called Ankex as CEO after stepping down from beleaguered lending and trading firm Genesis Global Capital.","\"Having come from Genesis and seen the events of 2022 unfold, I’m acutely aware of the importance of empowering traders to operate on trustless platforms while retaining full control of their assets at all times,\" Moro said at the time.","To be sure, institutional traders also crave under-collateralized loans because they are more capital efficient.&nbsp;","“It is challenging to cross collateralize on-chain yield bearing assets, OTC bilateral agreements in a cost efficient way. Fractal solves this by putting it on-chain, which is transparent, and efficient for both sides of the transaction. QCP Capital is pleased to support such a solution that improves capital efficiency and catalyzes the progression of DeFi,” said Stan Low, head of investments, QCP Capital.","QCP invested alongside 6th Man Ventures, Archetype. Blizzard and CMT Digital. Other investors include Golden Tree Asset Management, CoinShares and Spartan Group.","<em data-v-f87c67ca=\"\">Updated: This story has been updated to clarify the relationship between the co-CEOs.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Moro","content":"PERSON"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"April 1","content":"DATE"},{"type":"November 18","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Elkrief","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Moro","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alex Elkrief","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"6th Man Ventures","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"Kantorovich","content":"PERSON"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"Golden Tree Asset Management","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Stan Low","content":"PERSON"},{"type":"CoinShares","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}