{"summary":"Coinbase is aiming to mobilize crypto advocates around the U.S. as lawmakers and regulators weigh decisions that could impact how digital assets are used and traded.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215829\/coinbase-launches-grassroots-campaign-to-influence-us-lawmakers-and-regulators","publishDate":"2023-02-28T11:28:43","id":10713,"type":null,"title":"Coinbase launches grassroots campaign to influence US lawmakers and regulators","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Coinbase is taking the crypto gospel on the road with plans to make inroads all across the United States. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">On Twitter, the crypto exchange operator announced an initiative aimed at advancing “<\/span><span data-v-f87c67ca=\"\">pro-crypto policy in all 435 Congressional Districts across the U.S.,” while also posting a link to an online petition. The cryptocurrency exchange is eager to influence both the legislators and regulators who will likely determine how people and companies are able to buy, sell and trade digital assets. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“We need thoughtful policymaking and smart regulation so that we can continue to advance crypto and web3, and make progress on our mission to increase economic freedom,” Coinbase said in a Twitter post. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Coinbase’s effort to harness the power of people interested in a future where digital assets play an integral part in society comes at a potential crossroads for the crypto industry. Amid a series of bankruptcies and fraudulent behavior, lawmakers and regulatory bodies like the <\/span><span data-v-f87c67ca=\"\">U.S. Securities and Exchange Commission have intensified their scrutiny of digital assets.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Reaching out to politicians and potentially influencing how they vote on future legislation appears to be at the heart of the exchange’s campaign. “<\/span><span data-v-f87c67ca=\"\">Coinbase will empower the<\/span><a href=\"https:\/\/twitter.com\/hashtag\/Crypto435?src=hashtag_click\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">#Crypto435<\/span><\/a><span data-v-f87c67ca=\"\"> community with information about how to contact specific politicians in their local districts,” the company also posted to Twitter<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["COINBASE"],"authors":["RT Watson","The Block"]}