{"summary":"Babel Finance, which abruptly suspended withdrawals last week, has announced several steps to improve its liquidity situation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153067\/babel-finance-steps-crypto-liquidity-situation","publishDate":"2022-06-20T07:57:07","id":10712,"type":null,"title":"Babel Finance announces steps to improve its liquidity situation","category":["ASIA"],"content":["Crypto financial services firm Babel Finance, which abruptly suspended withdrawals last week, has announced several steps to improve its liquidity situation.","Sharing the news with The Block in a statement on Monday, Babel Finance said it carried out an emergency assessment of its business operations to understand its liquidity status and has also reached “preliminary agreements on the repayment period of some debts” with major counterparties and customers, “which has eased the company's short-term liquidity pressure.”","Today’s announcement doesn’t mean withdrawals — which were <a href=\"https:\/\/www.theblock.co\/post\/152677\/babel-finance-suspends-withdrawals-citing-unusual-liquidity-pressures\" data-v-f87c67ca=\"\">suspended<\/a> on Friday because it was facing \"unusual liquidity pressures\" — are resumed, however. The company said it has “actively communicated with shareholders and potential investors, and will continue to communicate and obtain liquidity support.”","Amid <a href=\"https:\/\/wublock.substack.com\/p\/investigation-how-2billion-lending\" data-v-f87c67ca=\"\">reports<\/a> that Babel Finance has informed partners it's insolvent, a company spokesperson told The Block that “no, we never told partners that.”","When asked whether Babel Finance is facing liquidity issues due to exposure to troubled crypto hedge fund Three Arrows Capital, the spokesperson said, \"Babel Finance has no business with Three Arrow Capital.\"","Last month, Babel Finance entered the unicorn club firm after raising <a href=\"https:\/\/www.theblock.co\/post\/148643\/babel-finance-raises-series-b-crypto-valuation\" data-v-f87c67ca=\"\">$80 million<\/a> in a Series B funding round at a $2 billion valuation.","Investors in the round included Jeneration Capital, Dan Tapiero's 10T Holdings, Dragonfly Capital and Circle Ventures.","Founded in 2018, Hong Kong-based Babel Finance provides lending and trading services to institutional investors. It claimed to have about 500 clients and 170 employees as of last month.","The liquidity issues of Babel Finance mark the latest blow to the crypto space. In recent weeks, <a href=\"https:\/\/www.theblock.co\/post\/151069\/terraform-labs-ordered-to-cooperate-with-sec-probe-of-mirror-protocol\" data-v-f87c67ca=\"\">Terra<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/153013\/celsius-says-its-determined-to-find-a-resolution-a-week-after-halting-withdrawals\" data-v-f87c67ca=\"\">Celsius<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/152682\/three-arrows-capital-considers-asset-sales-and-bailout-wsj-reports?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Three Arrows Capital<\/a> have all suffered financial problems.","Last month, Terra's ecosystem completely collapsed, losing $40 billion in value. Last week, crypto lending firm Celsius halted customer withdrawals. And earlier this week, top crypto hedge fund Three Arrows Capital faced massive liquidations after failing to meet margin call requirements.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Babel Finance","content":"ORGANIZATION"},{"type":"$40 billion","content":"MONEY"},{"type":"Jeneration Capital","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Dan Tapiero","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Dragonfly Capital and Circle Ventures","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"\"Babel Finance","content":"ORGANIZATION"},{"type":"Three Arrow Capital","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$2 billion","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}