{"summary":"Crypto-native gaming space still hasn&#x27;t found an indispensable game or application. Beam by Merit Circle will reportedly be able to deploy on-chain games with ease.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226904\/beam-blockchain-gaming-avalanche","publishDate":"2023-04-18T15:32:22","id":10726,"type":null,"title":"Merit Circle brings you Beam, a gaming subnet on Avalanche","category":["GAMING"],"content":["Merit Circle announced a new development from its decentralized autonomous organization: Beam, a gaming-focused blockchain that aims to become the home for various web3 games.","The metaverse-focused DAO claims Beam is a sovereign network powered by Avalanche — a popular layer-one blockchain and Ethereum rival — aimed directly at gamers and game developers.","The latter will reportedly be able to deploy on-chain games with ease. \"Everything from smart contracts to gas-optimized transactions, asset management, oracles for web2 games and marketplaces can be provided on Beam, letting developers focus on their games,\" an announcement post on Medium <a href=\"https:\/\/medium.com\/@meritcircle\/merit-circle-dao-to-launch-gaming-subnet-beam-in-collaboration-with-avalanche-62f0e23f3e30\" data-v-f87c67ca=\"\">states<\/a>.","Merit Circle claims Beam boasts \"a strong network of more than 60 partnered games, dozens of contributors, developers, tools and investors.\"","Merrit Circle highlighted that Avalanche was chosen because its subnets, sovereign networks that define their own rules regarding their memberships and token economics, boast low fees and quick settlements — essential aspects that make them attractive for web3 gaming.","For example, in March of last year, DeFi Kingdoms — arguably the most-notable crypto-native game to date — <a href=\"https:\/\/www.theblock.co\/post\/164497\/defi-kingdoms-to-leave-harmony-for-metaverse-focused-blockchain\" data-v-f87c67ca=\"\">launched<\/a> its Crystalvale realm on Avalanche subnet DFK Chain. (It also <a href=\"https:\/\/www.theblock.co\/post\/193571\/defi-kingdoms-serendale-realm-goes-live-on-klaytn\" data-v-f87c67ca=\"\">launched<\/a> another realm, Serendale, on Klaytn.)","Avalanche is also known for hosting the once-noteworthy crypto game Crabada — a play-and-earn idle game in which players control hermit crabs and battle over oceanic kingdoms. The game's volume and transactions garnered a lot of attention and peaked late last spring before falling off.","<span data-v-f87c67ca=\"\">Crabada surged and crashed in mid-2022. Source: <a href=\"https:\/\/dappradar.com\/avalanche\/games\/crabada\" data-v-f87c67ca=\"\">DappRadar<\/a><\/span>","Despite some relative successes in the crypto-native gaming space, the industry has still failed to find its killer app — an indispensable game or application.","Titles coming to Beam, such as Trial Xtreme, Walker World, Hash Rush, Sphere and Edenhorde Eclipse, will look to garner attention and staying power — but it remains to be seen how large of a player base they can attract.","These games are currently not live on Beam.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Serendale","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"Beam","content":"ORGANIZATION"},{"type":"Walker World","content":"ORGANIZATION"},{"type":"March of last year","content":"DATE"},{"type":"Hash Rush","content":"PERSON"},{"type":"Edenhorde Eclipse","content":"ORGANIZATION"}],"hashtag":["AVALANCHE","GAMING DAOS"],"authors":["Adam James","The Block"]}