{"summary":"At the same time, critics suggest that the move could result in short term pain for investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270638\/crypto-proponents-think-a-spot-bitcoin-etf-would-be-watershed-moment-that-could-add-billions-of-value","publishDate":"2024-01-05T11:46:15","id":10728,"type":null,"title":"Crypto proponents think a spot bitcoin ETF would be ‘watershed moment’ that could add billions of value","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crypto proponents think the sky’s the limit for bitcoin awareness and adoption if a spot bitcoin (<span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.53%\n    <\/span><\/a> <!----><\/span>) ETF gets approved, although some skeptics believe investors could be in line for some negative price action in the short term.<\/span>","\"The bitcoin ETF has been a long time coming,\" Ben Zhou, co-founder and CEO of Bybit, said in emailed comments to The Block. \"But now, with BlackRock and other [traditional finance] juggernauts in the mix, the odds of approval are higher than ever. If approved, the effects will permeate the entire crypto market, bringing not only new money but also a new sense of confidence.\"","While Zhou said the move would be a watershed moment for the wider crypto space, he argued it was not a necessary requirement for success and that institutions need the ETF more than bitcoin does. \"The last two years have proven that you can throw pretty much anything at bitcoin, including bankruptcies, hostile regulation, and a banking crisis, and it still outperforms pretty much any asset on Earth,\" he said.","The Securities and Exchange Commission has yet to approve a spot bitcoin ETF, and it hasn't said when a decisions could come for the multiple applications its reviewing.&nbsp;","In a November <a href=\"https:\/\/www.coinbase.com\/institutional\/research-insights\/research\/monthly-outlook\/monthly-outlook-nov-2023\" data-v-f87c67ca=\"\">outlook report<\/a>, David Duong, head of institutional research at Coinbase, said that the impact of a spot bitcoin ETF would be significant as it would open up an opportunity for the wealth management community and could be the foundation for further financial products.","\"In the long run, this means spot bitcoin ETFs could add billions of dollars to the total crypto market cap as well as spark new potential investments for the asset class. While this will take time, we expect ETFs to lay the foundation for a more regulated environment, greater inclusion and a material growth in demand,\" Duong said.","He added that some of the effects might take a while to play out. For instance, while ETFs would make it easier for portfolios to include bitcoin exposure, employers might not immediately allow 401(k) retirement contributions to bitcoin. Similarly, while he reckons spot bitcoin ETFs are more suitable for banks and broker-dealers than their futures-based counterparts, there might be restrictions on how much can be allocated to such products in the short term.","Adam Cochran, managing partner at Cinneamhain Ventures, took a similar view. He said that observers are largely over estimating the short-term impact of a spot bitcoin ETF approval, but underestimating the long-term impact.","\"A bitcoin ETF's biggest change is in its legitimacy for pension funds, RIAs, mutual funds, and other conservative funds informally,\" he said. \"While a few funds and advisors have regulations that would prevent them from pushing their clients to an OTC asset like GBTC, many have internal risk control policies that would prevent it. It was the same with gold back in the day. But, once it had a legitimate ETF, properly custodied and settled, and managed by the likes of BlackRock, it became legitimate for these funds and advisors to push it.\"","Nate Geraci, president of investment advisor The ETF Store, noted that a potential spot bitcoin ETF approval could result in a bridge between decentralized finance and traditional finance.","\"For many mainstream investors, crypto is viewed as an area that’s simply too complicated or risky to get involved with,\" he told The Block, \"The ETF wrapper will serve as a bridge to help mainstream investors become more educated on and comfortable with the crypto space. Longer-term, that should help overall crypto adoption as mainstream investors will ultimately shed the ETF wrapper and interact directly with the underlying technology.\"","Crypto proponents think a spot bitcoin ETF could have a positive effect on prices, while critics have casted doubt on the idea in the short term.","\"When a tsunami of buying meets a fixed supply, the price is only going one direction,\" said Dan Held, a prominent bitcoiner and part-time CMO at Taproot Wizards, an NFT project on Bitcoin.&nbsp;","Nansen CEO Alex Svanevik weighed in, adding that this could be good for the wider ecosystem. He said a \"rising tide lifts all boats,\" noting that more capital allocated to bitcoin would be good for all of crypto.","Yet crypto skeptic and prominent gold bug Peter Schiff suggested caution in the short term.","\"As I warned, it's likely that the bitcoin ETF will not be a 'buy the rumor, sell the news' event, but a 'buy the rumor, sell the rumor of the news' event. Those who wait for the [actual] news to sell their bitcoin may discover that there are very few speculators left to buy!\" he <a href=\"https:\/\/twitter.com\/PeterSchiff\/status\/1742527770310144492\" data-v-f87c67ca=\"\">posted on X<\/a>.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">Once the ETFs are launched and the highly anticipated institutional and other new investor demand does not show up, look out below!\" he <a href=\"https:\/\/twitter.com\/PeterSchiff\/status\/1742292287063757011\" data-v-f87c67ca=\"\">added<\/a>.<\/span>","This was matched by CNBC host Jim Cramer, who recently flipped bullish on bitcoin, <a href=\"https:\/\/www.theblock.co\/post\/270024\/jim-cramer-touts-bitcoins-remarkable-comeback-and-says-its-a-technological-marvel\" data-v-f87c67ca=\"\">calling it a technological marvel<\/a> in a January appearance.","“I do think that the people who are in it for that are going to use that as a chance to sell,\" he noted, addeding that \"You can’t kill it.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"David Duong","content":"PERSON"},{"type":"CMO","content":"ORGANIZATION"},{"type":"Zhou","content":"PERSON"},{"type":"Peter Schiff","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Duong","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Adam Cochran","content":"PERSON"},{"type":"Nate Geraci","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"-0.53%","content":"PERCENT"},{"type":"Alex Svanevik","content":"PERSON"},{"type":"Earth","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Dan Held","content":"PERSON"},{"type":"Ben Zhou","content":"PERSON"},{"type":"Cinneamhain Ventures","content":"ORGANIZATION"},{"type":"Taproot Wizards","content":"ORGANIZATION"},{"type":"Jim Cramer","content":"PERSON"}],"hashtag":["BITCOIN","SEC"],"authors":["Tim Copeland","The Block"]}