{"summary":"The recent crypto rally has been &quot;propagated&quot; by investors purchasing both gold and bitcoin futures since February rather than by investors shifting from gold to bitcoin, according to JPMorgan analysts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282572\/jpmorgan-bitcoin-rally-propagated-gold","publishDate":"2024-03-14T12:36:45","id":10723,"type":null,"title":"JPMorgan says bitcoin rally &#x27;propagated&#x27; by retail and speculative institutional investors","category":["MARKETS"],"content":["The recent surge in bitcoin and the broader crypto market is primarily driven by retail and speculative institutional investors buying both gold and bitcoin futures rather than investors shifting from gold to bitcoin, according to JPMorgan analysts.","Since their launch earlier this year, spot bitcoin exchange-traded funds have seen heavy inflows, while gold ETFs have witnessed outflows. This leads to the general interpretation that investors are shifting from gold to bitcoin, but that isn't the case, JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Thursday. Instead, retail and institutional investors have been purchasing both gold and bitcoin futures, leading to the rally, the analysts said.","\"Beyond retail investors, speculative institutional investors such as hedge funds, including momentum traders such as CTAs [commodity trading advisors], appear to have also propagated the rally by purchasing both gold and bitcoin futures since February, perhaps even more heavily than retail investors,\" the analysts said.","JPMorgan's futures position indicators also imply \"a sharp position buildup since February,\" amounting to $7 billion in bitcoin futures and $30 billion in gold futures, the analysts said. They attribute this primarily to momentum traders.","The JPMorgan analysts noted that <a href=\"https:\/\/www.theblock.co\/post\/281216\/jpmorgan-bitcoin-gold-investors-portfolios\" data-v-f87c67ca=\"\">gold<\/a> ETF outflows aren't a new phenomenon arising this year because of the launch of spot bitcoin ETFs. Instead, \"it has been taking place for the past four years since the pandemic,\" they said.","Moreover, gold ETF investors aren't shifting to bitcoin ETFs because they have, in fact, been purchasing more gold but in the form of bars and coins, the analysts said.","\"This [gold ETF] outflow trend does not reflect an aversion to gold by private investors such as individuals and family offices, but rather an instrument shift away from physical gold ETFs to bars and coins,\" the analysts said. \"Privacy and tangibility have become more important considerations for private investors since the pandemic, and physical gold ETFs have a disadvantage in this respect relative to holding bars and coins.\"","While shying away from gold ETFs, those private investors have been buying gold bars and coins \"in a rather strong and steady manner since the pandemic,\" the analysts noted, adding that these purchases have even outpaced gold purchases by central banks.","","","As for spot bitcoin ETF inflows, the analysts <a href=\"https:\/\/www.theblock.co\/post\/272099\/jpmorgan-spot-bitcoin-etfs-36-billion-inflows\" data-v-f87c67ca=\"\">reiterated<\/a> that it is primarily a rotational capital shift from existing crypto venues such as crypto exchanges. Recent bitcoin outflows from crypto exchanges corroborate this view, they said.","\"Crypto exchanges saw a cumulative bitcoin outflow of around $7 billion since the spot bitcoin ETF launch\" in January, the analysts said. \"In other words, it is more likely that the net flow from retail investors into the newly created ETFs is closer to $2 billion rather than $9 billion.\"","MicroStrategy's <a href=\"https:\/\/www.theblock.co\/post\/281654\/microstrategy-bitcoin-205000-btc-blackrock\" data-v-f87c67ca=\"\">recent massive bitcoin purchases<\/a> have also amplified this year's crypto rally, according to the JPMorgan analysts. Michael Saylor's company appears to be transforming itself into a leveraged bet on bitcoin by buying the cryptocurrency via the sale of convertible notes. That approach is risky, according to the analysts.","\"We believe debt-funded bitcoin purchases by MicroStrategy add leverage and froth to the current crypto rally and raise the risk of more severe deleveraging in a potential downturn in the future,\" they concluded.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"$9 billion","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"$30 billion","content":"MONEY"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","JPMORGAN","SPOT BITCOIN ETF","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}