{"summary":"One sniper managed to buy up over 20% of the coin&#x27;s supply nearly instantly and has realized $450,000 in profits so far.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285790\/poopcoin-worth-millions-following-airdrop-from-doodles-creator","publishDate":"2024-03-30T18:17:02","id":10737,"type":null,"title":"Poopcoin worth millions following airdrop from Doodles creator","category":["CRYPTO ECOSYSTEMS"],"content":["Poopie, the Doodles co-founder also known as Jordan Castro, has released a memecoin named Poopcoin, ticker $poop. Since its launch ten hours ago, as of publishing time at 6 pm ET, nearly $60 million in poop volume has already changed hands, and the memecoin has a market cap of about $7 million, though that figure has been declining rapidly throughout the day.&nbsp;","Poopie announced the coin on X as a <a href=\"https:\/\/x.com\/poopie\/status\/1774042347036197226?s=20\" data-v-f87c67ca=\"\">quote-post<\/a> to Vitalik Buterin's recent blog in which the Ethereum co-founder shared his thoughts on the memecoin ecosystem, condemning intentionally offensive memecoins while <a href=\"https:\/\/www.theblock.co\/post\/285587\/ethereum-vitalik-buterin-memecoins\" data-v-f87c67ca=\"\">praising<\/a> \"high quality fun projects that contribute positively to the ecosystem and the world around them.\"","The memecoin was airdropped to holders of Doodles NFTs and certain other early adopters, such as anyone who minted an original Doodle, even if they have since sold the NFT. The <a href=\"https:\/\/mirror.xyz\/poopie.eth\/g7L4RyfIxXtovJGD4eL_luOxpqIBs4bip_4FMTs1Ctc\" data-v-f87c67ca=\"\">memecoin<\/a>, which Castro warns \"could very well be worth less than zero, like a fresh, steaming pile of dung,\" was created on Base, the Ethereum Layer 2 network created by Coinbase.&nbsp;","In the moments after Poopie's announcement, two wallets managed to purchase over 36% of the coin's total supply, a sum outweighing the 15% allocation for community members and early adopters, <a href=\"https:\/\/x.com\/bubblemaps\/status\/1774156063266296049?s=20\" data-v-f87c67ca=\"\">according<\/a> to blockchain analytics firm Bubblemaps.&nbsp;","One wallet, which managed to purchase 23.5% of the coin's supply, still holds 20% across across 95 wallets. So far, they've realized $450,000 in profits, according to data Bubblemaps shared with The Block.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Poopie","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Jordan Castro","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$450,000","content":"MONEY"},{"type":"Vitalik Buterin","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"36%","content":"PERCENT"},{"type":"Castro","content":"PERSON"},{"type":"$60 million","content":"MONEY"},{"type":"$poop","content":"MONEY"},{"type":"Doodle","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Doodles","content":"ORGANIZATION"},{"type":"23.5%","content":"PERCENT"}],"hashtag":["MEMECOINS"],"authors":["Zack Abrams","The Block"]}