{"summary":"Crypto exchange Binance has released an oracle service called Binance Oracle, to link real-world data to blockchain applications.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180042\/binance-releases-oracle-service-on-bnb-chain-rivaling-chainlink","publishDate":"2022-10-26T11:24:04","id":10736,"type":null,"title":"Binance releases oracle service on BNB Chain, rivaling Chainlink","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Binance has released an oracle service called Binance Oracle to help blockchain applications connect with real-world data.<\/span>","<span data-v-f87c67ca=\"\">BNB Chain ecosystem will be the first blockchain to use Binance Oracle, though the team has plans to expand it to other chains. Over ten BNB Chain projects have already integrated with the Binance Oracle.<\/span>","<span data-v-f87c67ca=\"\">“Binance Oracle will emerge as a significant contributor to Web3 by offering a stable, reliable, and efficient Oracle network with comprehensive accuracy and accessibility features,” said Gwendolyn Regina, investment director at BNB Chain.<\/span>","<span data-v-f87c67ca=\"\">With this release, Binance has forayed into a niche largely dominated by <a href=\"https:\/\/www.theblock.co\/post\/174886\/two-sigma-securities-becomes-a-chainlink-network-data-provider\" data-v-f87c67ca=\"\">Chainlink<\/a>, an oracle network that serves over 690,000 active users across many different blockchains. Other oracle projects like Band Protocol, API3 and <a href=\"https:\/\/www.theblock.co\/linked\/144062\/seven-infrastructure-firms-add-support-for-pyth-oracle-network-on-solana\" data-v-f87c67ca=\"\">Pyth<\/a> are widely used by blockchain apps as well.<\/span>","<span data-v-f87c67ca=\"\">Its oracle solution will aggregate off-chain data needed by applications such as those in the decentralized finance sector (DeFi). According to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\" data-v-f87c67ca=\"\">data<\/a> from The Block, there's more than $7 billion in assets locked within DeFi apps on BNB Chain.<\/span>","<span data-v-f87c67ca=\"\">Binance Oracle will leverage the use of \"threshold signatures,\" a type of cryptographic tool that will be used to securely sign data feeds into blockchain applications. This cryptographic mechanism will assure that there is no single point of failure in the data feeds.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/total-value-locked-tvl\/value-locked-by-defi-project-on-bsc-notional\/embed\" title=\"Value Locked by DeFi Project on BNB Chain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7 billion","content":"MONEY"},{"type":"Binance Oracle","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Gwendolyn Regina","content":"PERSON"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Binance","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Vishal Chawla","The Block"]}