{"summary":"Halborn disclosed a critical vulnerability within browser extensions of web3 wallets like MetaMask and Phantom.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152374\/metamask-and-phantom-crypto-wallets-fix-browser-extension-vulnerability","publishDate":"2022-06-16T05:02:44","id":10733,"type":null,"title":"MetaMask and Phantom crypto wallets fix browser extension vulnerability","category":["WALLETS"],"content":["Popular crypto wallets, including MetaMask and Phantom, suffered for months from a critical vulnerability in their browser extension software, according to a <a href=\"https:\/\/halborn.com\/disclosures\/demonic-vulnerability\/\" data-v-f87c67ca=\"\">report<\/a> on Wednesday from cybersecurity firm Halborn.","The vulnerability, dating back to September 2021 and now fixed, put users' funds at risk as it made it possible for hackers to extract wallet recovery seed phrases stored on computer disks. However, no exploits have yet been reported that could be tied to the vulnerability.","In the report, Halborn's researchers said the seed phrases generated by wallet providers were being saved on users' computers in plain text as part of the \"Restore Session\" feature. This meant malicious actors could gain entry using malware or physical access. Halborn added they worked with wallet providers to patch their wallets against the vulnerability.","<a href=\"https:\/\/www.theblock.co\/post\/142304\/metamask-advises-users-to-disable-automatic-icloud-backups-of-its-wallet-data-to-prevent-hacks\" data-v-f87c67ca=\"\">MetaMask<\/a>, the most popular web3 wallet on Ethereum, clarified that the critical security issue affected only a \"small segment of users\" and that the vast majority of users were not at high risk. The MetaMask team added that it already issued mitigations against the vulnerability in its latest update of the wallet's browser extension.","Meanwhile, Phantom, the most-used web3 wallet on the Solana blockchain, said it began issuing fixes in January, three months after the vulnerability was initially flagged by Halborn. Furthermore, Phantom <a href=\"https:\/\/twitter.com\/phantom\/status\/1537102761199816706\" data-v-f87c67ca=\"\">plans<\/a> on rolling out another exhaustive patch next week, it said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana blockchain","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Halborn","content":"PERSON"}],"hashtag":["WALLETS"],"authors":["Vishal Chawla","Anushree Dave","The Block"]}