{"summary":"SEC v. Mahabub, and GenAudio Inc., Civil Action №15-cv-2118-WJM-SKC (D. Col. ordered September 5, 2019) Link to order You may not realize it, but most of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/39681\/sec-enforcement-action-leads-to-disgorgement-order-against-bitcoin-trader-who-claimed-apple-management-was-interested-in-3d-speaker-biz","publishDate":"2019-09-15T12:09:30","id":10730,"type":null,"title":"SEC enforcement action leads to disgorgement order against bitcoin trader who claimed Apple management was interested in 3d speaker biz","category":["LEGAL"],"content":["<a class=\"cj cf mj mk ml mm\" href=\"https:\/\/scholar.google.com\/scholar_case?case=7105924014588510663\" target=\"_blank\" rel=\"noopeneer noopener noreferrer\" data-v-f87c67ca=\"\">Link to order<\/a>","You may not realize it, but most of what we cover at the ole CCM is at a high level about really basic stuff that your parents should have taught you. Stuff like keep your word, don’t lie, don’t cheat, don’t steal, do your best, be honest, eat your vegetables*, and things that are basically common sense. Anyways, if you do those things you likely won’t get in trouble that often in life. Also, it's probably a bad idea to say Steve Jobs is interested in your software if, you know, he isn’t. That tidbit and more are what is at the heart of this recent order out of Colorado in an SEC enforcement action.","This filing is an order from the district court judge granting an SEC motion in part for particular remedies against the defendants in this case: Mahabub and GenAudio. Who are the defendants? Well, Taj Mahabub founded a company called, yep, GenAudio. The idea behind the company was to turn any set of speakers into 3D surround sound sounding speakers. Pretty cool idea.","Unfortunately, over a period of three years, Mahabub made six public statements that were not true. The statements claimed that Apple, yes that Apple, was very interested in Mahabub’s technology. Now, Mahabub did speak with some mid-level executives at Apple, but he'd told people he was speaking with a global VP and that Steve Jobs was personally interested in the project. Why would he do that? Well, he was also engaged in the sale of unregistered securities for GenAudio during the relevant time period. As loyal CCM readers know the SEC doesn’t like that kind of activity, which is what prompted the enforcement action.","Mahabub did not contest the underlying facts of the case, so what is this particular filing about? Well, the SEC moved for a particular remedy in the suit. Namely, the SEC moved for disgorgement of Mahabub’s ill-gotten gains connected to his illegal securities offerings. Mahabub’s lawyers countered that this remedy wasn’t proper in this case, and even if that remedy was proper, it should only be limited to $15,000 of loss that the SEC proved. The Court in this order was having none of that.","So, what about crypto? Well, the SEC provided a declaration from an accountant named McDevitt who spoke with Mahabub starting on July 2017, and who over the course of a year and more Mahabub confided the following:","• he owns a recording studio in California worth over $10 million;","• he owns a yacht in Panama and land in Costa Rica;","• he has made significant profits trading in Bitcoin;","• he has started a new company to create software for automated cryptocurrency trading, and has contracts for work in that field; and","• he is deliberately hiding assets from the SEC.","That doesn’t look great for Mahabub, but then the Court points out the following, which is somehow worse:","Interestingly, he nowhere denies making the claims that McDevitt reports — indeed, he does not mention McDevitt at all. He instead directly denies owning a recording studio, a yacht, or real property; denies having profited from foreign currency trading (although he does not mention Bitcoin trading); and denies having real business prospects with his cryptocurrency software.","Yeah, that’s not good. The Court goes on to say that it has no reason to believe Mahabub that he doesn’t have any money. So, what penalty is he looking at? Well, Mahabub owes $1,280,900, and his company GenAudio owes $4,503,000. Don’t do the frauds. If you do, own up to it and don’t try and hide your assets from the SEC. Mahabub is gonna have to pay. He’ll likely appeal, and if so we'll see if an appellate court is any more sympathetic to the arguments.","*Vegetables are good for you bitcoin carnivores. Sorry, not sorry.","<em class=\"mi\" data-v-f87c67ca=\"\">Disclaimer: Crypto Caselaw Minute is provided for educational purposes only by Nelson Rosario and Stephen Palley. These summaries are not legal advice. They are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mahabub","content":"PERSON"},{"type":"Costa Rica","content":"LOCATION"},{"type":"$4,503,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"GenAudio","content":"ORGANIZATION"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Steve Jobs","content":"PERSON"},{"type":"$15,000","content":"MONEY"},{"type":"Colorado","content":"LOCATION"},{"type":"Panama","content":"LOCATION"},{"type":"Taj Mahabub","content":"ORGANIZATION"},{"type":"Mahabub","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"McDevitt","content":"PERSON"},{"type":"July 2017","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"$1,280,900","content":"MONEY"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["SEC"],"authors":["Nelson Rosario","The Block"]}