{"summary":"&quot;We received quite a number of inquiries, I would say especially from the funds and hedge fund side,&quot; said Martin Burgherr, chief clients officer at Sygnum Bank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218365\/sygnum-bank-sees-client-inquiries-silvergate-winds-down","publishDate":"2023-03-09T12:28:46","id":10743,"type":null,"title":"Sygnum Bank sees influx in client inquiries as Silvergate winds down","category":["COMPANIES"],"content":["As one of the U.S.'s most prominent crypto banks winds down, on the other side of the pond its Swiss analog is experiencing an influx in demand.","\"I think there were not only U.S. players, but I think there were players across the globe, who used Silvergate,\" said Martin Burgherr, chief clients officer at Sygnum Bank, in an interview with The Block on Monday. \"We received quite a number of inquiries, I would say especially from the funds and hedge fund side who seem to have now a need to diversify their banking partners with what has happened.\"","Last night, Silvergate Capital Corporation <a href=\"https:\/\/www.theblock.co\/post\/218223\/silvergate-will-liquidate-bank-wind-down-operations\" data-v-f87c67ca=\"\">said<\/a> it would wind down operations and voluntarily liquidate Silvergate Bank.","When the bank <a href=\"https:\/\/www.theblock.co\/amp\/post\/216548\/silvergates-network-unravels-leaving-crypto-industry-in-search-of-new-partners\" data-v-f87c67ca=\"\">warned<\/a> last week that it may be “less than well-capitalized,\" many key industry players severed ties with the bank and said they would instead rely on other partners. However, with limited options in the U.S., its collapse <a href=\"https:\/\/www.theblock.co\/post\/218223\/silvergate-will-liquidate-bank-wind-down-operations\" data-v-f87c67ca=\"\">raises<\/a> questions about how crypto firms will access the banking system, said Alex More, partner at the law firm of Carrington, Coleman, Sloman and Blumenthal.","For Sygnum, the increase in inquiries about its banking services had already started to pick up following several industry collapses last year. The bank, which has obtained a Swiss banking license as well as a capital markets services license in Singapore, stores crypto assets off balance sheet as the Swiss regulatory framework considers crypto an asset class, which means banks can store the assets off balance sheet removing credit risk.","\"FTX was the top of the iceberg but also we saw what has happened with Celsius or BlockFi,&nbsp; I think the awareness for credit risk and crypto services has increased significantly,\" Burgherr said. \"And this is actually something that we benefit dramatically from.\"","Sygnum was <a href=\"https:\/\/www.insights.sygnum.com\/post\/friday-30-august-the-day-we-became-the-world-s-first-digital-asset-bank\" data-v-f87c67ca=\"\">built<\/a> with a vision that institutional clients will want to access digital assets from trusted players such as Swiss banks, Burgherr said. Many prospective clients reaching out are surprised to find that Sygnum is a full-fledged Swiss bank with rights to also offer crypto services.","\"I think this is really what they are looking for that they have a [politically] very, very stable tier one country, which endorses cryptocurrencies,\" Burgherr said. \"And which provides legal certainty and regulatory certainty around the crypto services that they need.\"","Securing clients comes with some peculiarities. As the bank is dual headquartered in Singapore and Switzerland, when it comes to providing services outside those home jurisdictions its subject to reverse solicitation laws, which means clients in other countries need to inquire about services from the bank with no prior solicitation from the bank itself.","\"We cannot actively prospect these clients outside our home jurisdictions for cross-border reasons because that's the beauty and the beast of being a bank, there are quite a few regulations that we need to comply with,\" Burgherr said.","The bank also cannot completely fill the void left by Silvergate as it does not service U.S. customers. It provides custody, brokerage and banking services to four key client groups: hedge funds, distributed ledger companies and foundations, high net worth individuals and external asset managers.","\"We took the strategic decision to not offer our services to U.S. clients,\" Burgherr said. \"Simply because the regulatory uncertainty in the U.S. is quite high. This is why for the time being until we see that there is more clarity around crypto. This is not within our risk appetite.\"","To those who can access Sygnum's services, they can receive everything under one roof, Burgherr said. It's easy to transfer funds between the crypto side of the bank and its traditional banking arm, he added.","\"They are sometimes thinking it's too good to be true,\" Burgherr said, adding that Sygnum is much more than a crypto friendly bank like Silvergate.","However, one of the key <a href=\"https:\/\/www.theblock.co\/post\/216548\/silvergates-network-unravels-leaving-crypto-industry-in-search-of-new-partners\" data-v-f87c67ca=\"\">draws<\/a> of Silvergate Bank was the Silvergate Exchange Network, which allowed clients to send U.S. dollars and euros 24 hours a day. Some players like BCB Group are <a href=\"https:\/\/www.coindesk.com\/business\/2023\/03\/06\/crypto-banking-firm-bcb-readies-us-dollar-payments-to-plug-silvergate-gap\/\" data-v-f87c67ca=\"\">planning<\/a> to step in to fill this void but it's not a service that Sygnum currently offers.","\"It's a very particular business, the settlement for brokers and exchanges,\" said Burgherr, adding that there are probably more attractive opportunities elsewhere. In light of Silvergate's situation, \"the landscape changes and this also always means opportunities for other players.\"","Sygnum has instead been focusing on the roll out of its <a href=\"https:\/\/www.insights.sygnum.com\/post\/sygnum-launches-ryse-web3-growth-hub\" data-v-f87c67ca=\"\">Ryse initiative<\/a>, which will help digital asset companies grow regardless of stage. At the early stages, fundraising and KYC needs often dominate while at the later stages it's treasury management, Burgherr said.","\"Our hypothesis is that there is more regulatory scrutiny coming in,\" Burgherr said.&nbsp; \"Properly regulated players, whether it's under MiCA or as a Swiss bank or whatever the regulatory regimes you come up with, I think the winners will clearly be people who comply with these regulations and for us it's a strategic priority.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Carrington","content":"LOCATION"},{"type":"Blumenthal","content":"PERSON"},{"type":"Sygnum","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Martin Burgherr","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sygnum","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Coleman","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"BCB Group","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Sloman","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"Burgherr","content":"PERSON"},{"type":"Silvergate Exchange Network","content":"ORGANIZATION"},{"type":"Sygnum Bank","content":"ORGANIZATION"},{"type":"Alex More","content":"PERSON"},{"type":"Silvergate Capital Corporation","content":"ORGANIZATION"}],"hashtag":["ASSET MANAGERS","CRYPTO BANKS AND LENDERS","HEDGE FUNDS","INVESTMENT FIRMS","WEALTH MANAGERS"],"authors":["Kari McMahon","The Block"]}