{"summary":"Join The Block, along with leaders from Blockset by BRD, KPMG Cryptoasset Services, and Unbound Tech for conversations exploring Digital Asset Data and Infrastructure. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62755\/the-block-presents-digital-asset-data-and-infrastructure-featuring-blockset-kpmg-and-unbound","publishDate":"2020-04-22T20:10:04","id":1074,"type":null,"title":"The Block Presents: Digital Asset Data and Infrastructure featuring Blockset, KPMG, and Unbound","category":["LAYER 1S"],"content":["Join The Block, along with leaders from <a href=\"https:\/\/blockset.com\/?utm_source=TheBlock&amp;utm_medium=Webinar&amp;utm_campaign=04282020\" data-v-f87c67ca=\"\">Blockset by BRD<\/a>, <a href=\"https:\/\/advisory.kpmg.us\/articles\/2020\/cracking-crypto-custody.html\" data-v-f87c67ca=\"\">KPMG Cryptoasset Services<\/a>, and <a href=\"https:\/\/www.unboundtech.com\/?utm_campaign=casp_for_custody&amp;utm_source=BRD_webinar_Apr_2020\" data-v-f87c67ca=\"\">Unbound Tech<\/a> for conversations exploring Digital Asset Data and Infrastructure.&nbsp;","<iframe title=\"The Block Presents: Digital Asset Data and Infrastructure featuring Blockset, KPMG and Unbound | The Block\" src=\"https:\/\/app.livestorm.co\/p\/a413eb3e-d643-4c67-a7d8-a468cb633d4a\/form\" width=\"100%\" height=\"360\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","","","<b data-v-f87c67ca=\"\">Adam Traidman, <\/b><b data-v-f87c67ca=\"\">CEO and Co-founder, BRD<\/b>","<span data-v-f87c67ca=\"\">Adam Traidman is currently CEO and co-founder of BRD, a global company that's bringing blockchain-enabled financial services to the mobile generation. BRD provides consumers with the simplest and most secure way to buy and protect bitcoin and other cryptocurrencies. BRD is also the maker of Blockset, a new blockchain infrastructure platform for large enterprises. Traidman is also currently the CEO of SBI Ripple Asia Co., Ltd. and the CEO of SBI Mining Chip Co.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">About Blockset by BRD:<\/strong>","<span data-v-f87c67ca=\"\">Blockset by BRD enables enterprises around the globe to deliver high-quality blockchain-based applications quickly, at a fraction of the cost. Blockset is your hosted blockchain infrastructure that reduces costs related to node hosting, data integrity, and human resources required to continuously add new chains and maintain existing architecture. Using the services provided by Blockset, businesses can build professional custody solutions, auditing platforms, and much more with its multi-chain API and professional services. It is the industry-leading B2B solution that is propelling crypto adoption at scale. &nbsp;<\/span>","&nbsp;","","","<b data-v-f87c67ca=\"\">Sal Ternullo, Co-leader KPMG Cryptoasset Services<\/b>","<span data-v-f87c67ca=\"\">Sal is a Director in KPMG’s Innovation &amp; Enterprise Solutions Practice and Co-leader, Cryptoasset Services. Drawing on his deep technical background in cryptocurrencies, blockchain, robotic process automation, and public cloud computing, Sal helps companies across industry lines develop, design, implement, and manage products and services for the crypto economy.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">About KPMG Cryptoasset Services<\/strong>","<span data-v-f87c67ca=\"\">KPMG Cryptoasset services help organizations of all kinds capitalize on the crypto economy by working at the forefront of the industry to deploy new institutional-quality solutions.&nbsp; Our team combines macro perspectives with industry-leading research and deep applied experience,&nbsp; to enable crypto businesses and institutional adoption in secure, trusted and compliant manners.&nbsp; KPMG is actively engaged across a full lifecycle of crypto services supporting strategy, product innovation, risk management, security, compliance and support for tailored attestations.<\/span>","&nbsp;","","","<b data-v-f87c67ca=\"\">Rebecca Aspler, <\/b><b data-v-f87c67ca=\"\">Director, Product Management (Blockchain Product Line)<\/b><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Leading the blockchain product line at Unbound Tech, Rebecca is driving innovation all the way from prototyping, market-fit validation, roadmap planning to periodical features-prioritization and specification. Staying informed of the market landscape, Rebecca is also analyzing the digital assets and enterprise blockchain ecosystem, products and constantly evolving regulations.<\/span> <span data-v-f87c67ca=\"\">Prior to this role and specializing in product management for large scale cloud-based (SaaS) enterprise software applications, Rebecca has led product management groups and operations at companies such as SAP and Teoco, growing new products from inception point to profitable product lines; serving successfully various Fortune 1,000 companies.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">About Unbound Tech<\/strong>","<span data-v-f87c67ca=\"\">Unbound Tech creates cryptographic and blockchain key management solutions designed for enterprise banks, institutional-grade custodians, and premier exchanges. Unbound’s blockchain and tokenized asset management platforms utilize the latest in cutting-edge multiparty computation (MPC) technology to provide greater interoperability, rigid and reliable security, and enhanced operational efficiency for its clients.<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Product Management (Blockchain Product Line)","content":"ORGANIZATION"},{"type":"Rebecca Aspler","content":"PERSON"},{"type":"Digital Asset Data","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SAP","content":"ORGANIZATION"},{"type":"SBI Ripple Asia Co.","content":"ORGANIZATION"},{"type":"BRD","content":"ORGANIZATION"},{"type":"KPMG’s Innovation &amp; Enterprise Solutions Practice","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"Unbound Tech","content":"ORGANIZATION"},{"type":"KPMG Cryptoasset Services","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Ltd.","content":"ORGANIZATION"},{"type":"Adam Traidman","content":"PERSON"},{"type":"Cryptoasset Services","content":"ORGANIZATION"},{"type":"SBI Mining Chip Co.","content":"ORGANIZATION"},{"type":"Sal Ternullo","content":"PERSON"},{"type":"Rebecca","content":"PERSON"}],"hashtag":[],"authors":["The Block","The Block"]}