{"summary":"Former FTX CEO Sam Bankman-Fried is set to take the stand in his own defense on Thursday in an effort to convince jurors he&#x27;s not guilty.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259553\/sam-bankman-fried-gets-chance-to-dispel-cartoon-villain-narrative-as-he-prepares-to-take-stand","publishDate":"2023-10-25T18:12:15","id":10746,"type":null,"title":"Sam Bankman-Fried gets chance to dispel ‘cartoon villain’ narrative as he prepares to take stand","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">After weeks of silence, speculation and <a href=\"https:\/\/slate.com\/culture\/2023\/10\/sam-bankman-fried-trial-crypto-ftx-courtroom-sketch-jane-rosenberg.html\" data-v-f87c67ca=\"\">surreal courtroom sketches<\/a>, the disgraced<\/span><span data-v-f87c67ca=\"\"> former CEO of bankrupt crypto exchange FTX, Sam Bankman-Fried, is <a href=\"https:\/\/www.theblock.co\/post\/259447\/former-ftx-ceo-sam-bankman-fried-will-take-the-stand-on-thursday\" data-v-f87c67ca=\"\">planning to testify<\/a> in his own defense in a move that has <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">courtroom watchers<\/a> wondering just what his <\/span><span data-v-f87c67ca=\"\">high-powered defense attorneys are thinking.&nbsp;<\/span>","Confined to a New York jail <a href=\"https:\/\/www.theblock.co\/post\/253445\/sam-bankman-fried-loses-bid-for-temporary-release-from-jail-reports\" data-v-f87c67ca=\"\">since August<\/a> after prosecutors accused him of witness tampering and succeeded in having his bail revoked, Bankman-Fried has not been able to do much in court other than to <a href=\"https:\/\/www.theblock.co\/post\/253303\/sam-bankman-fried-can-wear-a-suit-to-court-take-notes-on-laptop\" data-v-f87c67ca=\"\">take notes<\/a> on a laptop as government prosecutors present their side of the story. The defense on Wednesday <a href=\"https:\/\/www.theblock.co\/post\/259446\/sbf-lawyers-want-help-from-fbi-agents-as-they-seek-to-shift-narrative-in-court\" data-v-f87c67ca=\"\">previewed<\/a> a potential strategy, asking the court to allow testimony from two FBI special agents in an attempt to poke holes in the testimony of government witnesses.&nbsp;","<span data-v-f87c67ca=\"\">\"Bankman-Fried's defense appears to be that he didn't intend to commit any fraud. He didn’t intend to deceive anyone. He didn’t intend to lie,\" <\/span><span data-v-f87c67ca=\"\">Josh Naftalis, a former federal prosecutor and ex-assistant U.S. attorney for the Southern District of New York, told The Block.<\/span><span data-v-f87c67ca=\"\"> \"His best option at this point … is to testify because that's the best way for him to show the jury what he was thinking.\"<\/span>","<span data-v-f87c67ca=\"\">Naftalis, who has been complimentary of Bankman-Fried's defense considering the overwhelming amount of evidence which appears to point to his guilt, said the defense's decision to put their client on the stand could help to bolster the notion<\/span><span data-v-f87c67ca=\"\"> that the prosecution had unjustly painted the former head of FTX as a \"cartoon villain\" and criminal mastermind.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried's lawyer Mark Cohen confirmed on Wednesday that his client intended to testify starting Thursday. <\/span><span data-v-f87c67ca=\"\">\"It’s hard for defense lawyers to prove someone didn't intend to commit a crime unless they actually have the defendant say it,\" said <\/span><span data-v-f87c67ca=\"\">Naftalis, who spent several years working as a prosecutor in the securities unit at the Southern District of New York.<\/span>","<span data-v-f87c67ca=\"\">The former assistant U.S. attorney, now a partner at Pallas Partners, said he believes the best outcome Bankman-Fried can hope for is likely a hung jury, meaning not enough jurors agree on a ruling and a guilty verdict becomes impossible.&nbsp;<\/span>","But the move to put Bankman-Fried on the stand is risky.","<span data-v-f87c67ca=\"\">The prosecution's cross examination of Bankman-Fried will likely begin on Friday, and the government's attorneys should be well prepared to question the once-celebrated wunderkind, according to Naftalis.<\/span>","<span data-v-f87c67ca=\"\">\"I expect they've been preparing for him to testify for a long time and that they have mined all of his prior statements whether it's tweets, his emails, his texts, the public statements he made about the company and they are just going to sit there and impeach him with them,\" said <\/span><span data-v-f87c67ca=\"\">Naftalis. \"Given how much Bankman-Fried has talked over the years … it may be a pretty rough cross examination for him.\"<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pallas Partners","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Naftalis","content":"ORGANIZATION"},{"type":"FBI","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Josh Naftalis","content":"PERSON"},{"type":"Naftalis","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Mark Cohen","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["FTX","SBF TRIAL"],"authors":["RT Watson","The Block"]}