{"summary":"Before a spot bitcoin ETF goes live, two forms have to be approved — and those approvals may come at different times, reports indicate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270765\/heres-how-to-know-if-a-spot-bitcoin-etf-has-been-approved","publishDate":"2024-01-07T12:29:19","id":10759,"type":null,"title":"Here&#x27;s how to know if a spot bitcoin ETF has been approved","category":["COMPANIES"],"content":["Crypto investors and asset managers are eagerly awaiting news about what the Securities and Exchange Commission might decide in its ongoing review of a dozen applications for a spot bitcoin ETF, with some expecting a decision as soon as this week. Enthusiasts are <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/270638\/crypto-proponents-think-a-spot-bitcoin-etf-would-be-watershed-moment-that-could-add-billions-of-value\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/270638\/crypto-proponents-think-a-spot-bitcoin-etf-would-be-watershed-moment-that-could-add-billions-of-value\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">hopeful<\/a> that an approval would add billions of dollars of value to the cryptocurrency sector, but a lot still needs to happen before that becomes a reality.&nbsp;","Decisions are expected in the coming days in part because of the Jan. 10 deadline for the SEC to respond to the first in the pack of the latest wave of applications, Cathie Wood’s ARK Investment and 21Shares. However, some analysts have noted that the SEC has wide-ranging authority in the process and could possibly try and delay a decision again.","Last week ended on an optimistic note, however, as stock exchanges <a href=\"https:\/\/www.theblock.co\/post\/270711\/nasdaq-files-fresh-forms-for-blackrock-and-valkyrie-spot-bitcoin-funds-adding-momentum-to-potential-approval\" data-v-f87c67ca=\"\">rushed to file fresh 19b-4 forms<\/a> for each proposed fund. The market will be eagerly watching the <a href=\"https:\/\/www.sec.gov\/rules\/sro\/national-securities-exchanges\" data-v-f87c67ca=\"\">SEC's website<\/a> this week for news about those rule filing forms, and any overall approval would likely first begin there.&nbsp;","In a parallel process, it's expected that issuers will file amended S-1 registration forms for the proposed bitcoin ETFs, laying out the terms about fees, naming authorized participants, and removing any bracketed items.&nbsp;","The approval process is two-fold. First, the 19b-4 forms would need to be approved, and then the S-1 forms would have to become \"effective.\" Once those two conditions are met, trading can be allowed to begin, with some asset managers saying they are already ready, should approval come.&nbsp;","Representatives from five financial firms <a class=\"c-link\" href=\"https:\/\/www.reuters.com\/markets\/us\/us-spot-bitcoin-etfs-could-win-approval-next-week-after-last-minute-application-2024-01-06\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.reuters.com\/markets\/us\/us-spot-bitcoin-etfs-could-win-approval-next-week-after-last-minute-application-2024-01-06\/\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">told Reuters<\/a> that they’ve discussed final S-1 changes with regulators and expect to file amendments and receive approval by late Tuesday or Wednesday of next week, which could mean the launch of a spot bitcoin ETF by the end of the week.","What's still unknown is just how the SEC might announce any kind of decision. The regulator could decide to issue a decision about all the filings at the same time, or it could accept some and reject or delay others.&nbsp;","Any decisions could likely be announced by the SEC, or the asset managers themselves. It may also be visible through the SEC's electronic database, <a class=\"c-link\" href=\"https:\/\/www.sec.gov\/cgi-bin\/browse-edgar?action=getcurrent&amp;type=EFFECT\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.sec.gov\/cgi-bin\/browse-edgar?action=getcurrent&amp;type=EFFECT\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">EDGAR<\/a>.<span class=\"c-message__edited_label\" dir=\"ltr\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\"> \"We don’t comment on individual filings,\" a spokesperson for the SEC <a href=\"https:\/\/www.theblock.co\/post\/270498\/heres-how-spot-bitcoin-etf-issuers-are-anticipating-the-coming-days-to-play-out\" data-v-f87c67ca=\"\">previously told The Block<\/a> in an emailed response to questions. \"Broadly speaking, if the Commission declares a registration statement effective, that is reflected on EDGAR. Any Commission 19b-4 orders will be posted on our website and then published in the Federal Register.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"Cathie Wood’s ARK Investment","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Commission 19b","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS","SPOT BITCOIN ETF"],"authors":["Zack Abrams","The Block"]}