{"summary":"Marathon Digital CEO Fred Thiel argued that a proposed tax on U.S. bitcoin miners who drive the industry offshore. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231498\/biden-bitcoin-policy-tax","publishDate":"2023-05-18T18:31:30","id":10754,"type":null,"title":"Biden plan to tax Bitcoin miners won&#x27;t work, Marathon Digital CEO says","category":["COMPANIES"],"content":["The administration of U.S. President Joe Biden recently&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/229221\/biden-tax-on-bitcoin-miners-electricity-usage\" data-v-f87c67ca=\"\">announced a proposal<\/a> to tax American bitcoin miners.","But that policy approach, if implemented, will drive mining firms outside of the country and won't raise the intended funds, according to Marathon Digital's chief executive officer.","\"Bitcoin miners will just leave the U.S., which is really what they're trying to,\" CEO Fred Thiel said in an interview on the sidelines of the Bitcoin 2023 conference in Miami.","Thiel went on to contend that a mining tax wouldn't result in more available renewable power.","\"It'll actually create less because if you're building a solar farm today or wind farm, it's a two-year waiting list to interconnect,\" remarked Thiel. \"And bitcoin miners provide the economic incentive for those people to operate.\"","Miners have mostly escaped the regulatory scrutiny that has targeted crypto exchanges in the country, including Binance and Coinbase. The company does, however, face headwinds from other sectors of the economy, Thiel said.","\"So one interest that's at play is the banking lobby. They don't want the crypto industry which is disintermediating the banking industry,\" he said, saying that some companies that run gas-fired power plants had also been hostile. \"Bitcoin mining in Texas specifically removes the need for peaker plants, and so it's impacting their business negatively. So if they can stop Bitcoin mining in Texas, guess what, the peaker plants are back in business.\"","Thiel <a href=\"https:\/\/decrypt.co\/139722\/sec-serves-bitcoin-mining-firm-marathon-digital-subpoena-again\" data-v-f87c67ca=\"\">confirmed that the company had received a subpoena<\/a> from the U.S. Securities and Exchange Commission last month but said that it didn't indicate anything more than a request for information.","\"A subpoena simply means people want information,\" he said. \"That doesn't mean that we're necessarily under investigation. It doesn't mean necessarily that we're being accused of anything. They're&nbsp; simply asking for it.\"","Thiel said he believed there was a broader initiative within the administration to target the bitcoin economy, including miners.","\"While I'm not gonna go so far as to say that they want to kill Bitcoin, they want to make it very difficult for people to operate,\" he said, adding the company is already looking to grow outside of the country.&nbsp;","Marathon just announced <a href=\"https:\/\/www.theblock.co\/post\/230049\/abu-dhabi-bitcoin-mining-marathon-digital-zero-two\" data-v-f87c67ca=\"\">a new project in Abu Dhabi<\/a>, and it's also actively looking at new initiatives around the world in places like Paraguay, said Thiel.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"They built a hydro facility together with Brazil, where Paraguay uses less than half of the electricity that is their share and if they could monetize it, that would be great,\" he said.&nbsp;","Thiel says there are reasons to be hopeful following a period of financial stress and consolidation in the bitcoin mining sector.&nbsp;","\"Now we've kind of come through the worst parts of the winter, and I think people are seeing bitcoin price up,\" Thiel said. \"They're more optimistic. They're seeing kind of that things are going in the right direction.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Thiel","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Paraguay","content":"LOCATION"},{"type":"Abu Dhabi","content":"LOCATION"},{"type":"last month","content":"DATE"},{"type":"\" Thiel","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Marathon Digital","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Nathan Crooks","The Block"]}