{"summary":"Grayscale Bitcoin Trust’s (GBTC’s) premium has fallen below 5% from about 40% a month ago, according to data tracked by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/92074\/gbtc-premium-has-fallen-below-5-btc","publishDate":"2021-01-22T05:45:26","id":10768,"type":null,"title":"GBTC&#x27;s premium has fallen below 5% from about 40% a month ago","category":["BITCOIN"],"content":["Grayscale Bitcoin Trust (GBTC) product's premium has fallen below 5% from about 40% a month ago, according to data tracked by The Block.","The<a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/grayscale\/weekly-premium-of-gbtc\" data-v-f87c67ca=\"\"> current premium<\/a> stands at about 3%. The sharp fall in GBTC's premium suggests that some large investors might be cashing out their gains or just arbitraging premiums away.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/grayscale\/premium-of-gbtc\/embed\" title=\"Premium of GBTC\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","GBTC is a trust product and its shares are traded on over-the-counter (OTC) secondary markets. But accredited investors who invest in GBTC shares at net asset value (NAV) can sell their shares only after a six-month lockup period, according to private placement rules in the U.S. by the Securities and Exchange Commission (SEC).","GBTC used to have a 12-month lockup period until last year, before <a href=\"https:\/\/www.globenewswire.com\/news-release\/2020\/01\/21\/1973013\/0\/en\/Grayscale-Bitcoin-Trust-Becomes-SEC-Reporting-Company.html\" data-v-f87c67ca=\"\">it became an SEC reporting company<\/a> in January 2020. The reporting company status allowed GBTC's accredited investors, who own or purchase its shares from private placements, to have an earlier liquidity opportunity.","It is possible that some accredited investors who bought GBTC's shares about six months ago may have sold their shares now and hence the drop in its premium.","Last June, crypto hedge fund Three Arrows Capital <a href=\"https:\/\/www.theblockcrypto.com\/post\/67985\/crypto-hedge-fund-three-arrows-capital-now-holds-6-26-of-gbtc-shares-worth-nearly-259-million\" data-v-f87c67ca=\"\">bought<\/a> over 21 million shares of GBTC, worth nearly $260 million at the time. It is not clear whether the fund has sold its shares now, its co-founder Kyle Davies declined to comment to The Block when reached.","Premiums in trust products like GBTC exist because they don't have a redemption program like exchange-traded funds (ETFs), due to regulatory prohibitions. That means large investors have no other option but to wait for either six months or a year to sell their shares, explaining volatility in premiums of such products.","GBTC is the largest bitcoin trust product worldwide. It <a href=\"https:\/\/twitter.com\/Grayscale\/status\/1352369874673291266\/photo\/1\" data-v-f87c67ca=\"\">manages $21 billion worth of assets<\/a>. Across its products, Grayscale has a total AUM of more than $25 billion.","Just last week, GBTC disclosed that it <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1588489\/000156459021001769\/gbtc-8k_20210115.htm\" data-v-f87c67ca=\"\">issued new shares<\/a> worth $1.28 billion, representing 35,159 bitcoins. It reflects the massive demand the product has.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"$25 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"January 2020","content":"DATE"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"$260 million","content":"MONEY"},{"type":"$21 billion","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"$1.28 billion","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}