{"summary":"Dong Jin, a deputy to the NPC, suggested at the “Two Sessions” event that China should speed up its blockchain infrastructure development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280766\/national-peoples-congress-member-urges-speeding-up-blockchain-development-in-china","publishDate":"2024-03-06T03:03:06","id":10766,"type":null,"title":"National People’s Congress member urges speeding up blockchain development in China","category":["POLICY"],"content":["One member of the National People’s Congress suggested that China should accelerate the development of national blockchain infrastructure to support government services, the country's supply chain and trade.","Dong Jin, a deputy to the NPC, <a href=\"https:\/\/www.chinanews.com.cn\/cj\/2024\/03-06\/10175046.shtml\" data-v-f87c67ca=\"\">stated<\/a> that he had submitted a formal suggestion this week, urging the government to establish broader blockchain infrastructure and industry standards to stimulate the growth of the country’s blockchain industry, as reported by the state news agency China News Service.","He mentioned that China has produced a significant amount of data resources due to its flourishing digital economy, and blockchain technology could aid in facilitating data circulation and sharing.","Dong, who manages a national blockchain research center in Beijing, observed that the center is developing a blockchain-based system to serve industries including maritime transport, supply chain finance, and energy.","The NPC deputy’s proposal was made as thousands of delegates from across China gathered in Beijing this week for the “Two Sessions,” the most crucial annual political meetings that assemble the country’s political elite and industry leaders.","<span data-v-f87c67ca=\"\">While China continues to ban cryptocurrency trading and mining, the country remains bullish on homegrown blockchain technology and digital economies — with Chinese tech giants, such as Alibaba and Tencent, focusing on developing their own consortium networks.<\/span>","In May 2023, Beijing, China’s capital city, <a href=\"https:\/\/www.theblock.co\/post\/232404\/beijing-web3-white-paper?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">released<\/a> a whitepaper aimed at improving innovation and development in the country's Web 3.0 industry. In that regard, government intends to establish Beijing as an innovation hub for the economy.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"May 2023","content":"DATE"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"National People’s Congress","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Dong Jin","content":"PERSON"},{"type":"China News Service","content":"ORGANIZATION"},{"type":"this week","content":"DATE"},{"type":"NPC","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}