{"summary":"Polkadot’s blockchain mainnet has gone live, allowing users to access their token accounts. Investors that have purchased DOTs under SAFTs can access their accounts now, but they can’t transfer their DOT tokens at this time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66361\/polkadot-blockchain-mainnet-live","publishDate":"2020-05-26T13:21:06","id":10765,"type":null,"title":"Polkadot’s blockchain mainnet is now live; limited access to token accounts","category":["LAYER 1S"],"content":["Polkadot's blockchain network is now live.","According to the <a href=\"https:\/\/polkadot.network\/p\/69eb705e-ab81-4112-ae0c-060e299fe360\/\" data-v-f87c67ca=\"\">network's managing partner, Web3 Foundation<\/a>, today marks the first phase of Polkadot's mainnet rollout. At this stage, Web3 Foundation will retain control of the network, running nodes and validating blocks. Investors of Polkadot's native token DOT can also access their accounts to express intent to become validators or nominate other validators, although they cannot transfer DOTs at this time, a Polkadot spokesperson told The Block.","As laid out in the <a href=\"https:\/\/polkadot.network\/technology\/\" data-v-f87c67ca=\"\">development roadmap<\/a>, Web3 Foundation plans to gradually hand over control of the network to DOT holders after ensuring that the network is running smoothly.","\"Since the release of the Polkadot paper three years ago, we have been researching and building the Polkadot protocol, which has greatly advanced our collective understanding of these systems since our early work building Ethereum,\" said Polkadot and Web3 Foundation co-founder Peter Czaban. \"In particular, we believe Polkadot's open governance system will allow the network to innovate and grow much more quickly than legacy networks, accelerating the development of mainstream decentralized applications.\"","The Polkadot project was kickstarted in 2016 by Gavin Wood, a co-founder of Ethereum. In 2017, Web3 Foundation conducted a private token sale that saw 5 million DOTs issued for $144 million, and it later <a href=\"https:\/\/www.theblockcrypto.com\/daily\/26540\/polkadots-sale-of-500000-tokens-closes-successfully-foundation-says-in-nod-of-confidence-to-1-2b-valuation\" data-v-f87c67ca=\"\">sold 500,000<\/a> more DOTs in late 2019. According to a Wall Street Journal report, it was valued at<a href=\"https:\/\/www.theblockcrypto.com\/linked\/8867\/parity-ceo-says-polkadot-1bn-valuation-is-a-fair-number\" data-v-f87c67ca=\"\"> $1.2 billion<\/a> in early 2019.","All of the tokens were sold under SAFTs, or Simple Agreements for Future Tokens, which promised to deliver DOTs when the network is live. Now that the network has officially launched, the community will vote in the next few months on whether to enable the token transfer feature.","This feature will allow investors to fully access their DOTs and directly trade them, instead of trading on the secondary market under SAFTs.&nbsp;As The Block previously <a href=\"https:\/\/www.theblockcrypto.com\/daily\/24111\/polkadot-dfinity-among-pre-launch-protocol-tokens-selling-at-a-steep-discount-on-otc-desks-but-buyers-are-hesitant\" data-v-f87c67ca=\"\">reported<\/a>, DOTs were, at one point, trading on the secondary market at a deep discount.","In the weeks before going live, the Web3 Foundation <a href=\"https:\/\/www.theblockcrypto.com\/post\/65420\/polkadot-redenomination-supply-proposal-web3\" data-v-f87c67ca=\"\">made a proposal<\/a> to re-denominate DOT and increase the total token supply by 100 times — a move that ultimately generated some controversy. Although the Polkadot community passed the proposal at the time, the foundation decided to table the implementation and conduct another poll after the launch.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"Simple Agreements for Future Tokens","content":"ORGANIZATION"},{"type":"Peter Czaban","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"Gavin Wood","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"},{"type":"$144 million","content":"MONEY"}],"hashtag":[],"authors":["Celia Wan","The Block"]}