{"summary":"Lightning Network hit a record-high capacity of 5,630 BTC ($172 million) for the first time since April — up 42% over the last 12 months.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236315\/lightning-network-capacity","publishDate":"2023-06-26T06:16:48","id":10764,"type":null,"title":"Lightning Network hits all-time high in bitcoin and US Dollar capacity","category":["LAYER 2S AND SCALING"],"content":["The Lightning Network, a second-layer payment protocol on Bitcoin, has reached a new all-time high bitcoin capacity — the amount of bitcoin locked in payment channels on the network.&nbsp;","The record capacity of 5,630 BTC was hit on Saturday, according to The Block’s <a href=\"https:\/\/www.theblockcrypto.com\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\" data-v-f87c67ca=\"\">data dashboard<\/a>, breaching the 5,620 prior peak on April 18. The network’s capacity in U.S. Dollars also reached an all-time high, exceeding $172 million. Lightning Network capacity is up 42% and 105% in bitcoin and U.S. Dollar terms, respectively, over the last 12 months as adoption has continued to grow.","Lightning Network operates as a network of bi-directional payment channels on top of the Bitcoin blockchain, designed to enable fast and cost-effective micropayments. Enabling users to transact directly without immediate settlement on the main blockchain, Lightning offers a solution to the slower transaction speeds and higher fees associated with Bitcoin's mainnet. Users can open payment channels between themselves, allowing for off-chain transactions later settled on the Bitcoin blockchain.","David Marcus, CEO of enterprise-grade Lightning Network firm <a href=\"https:\/\/www.theblock.co\/post\/225538\/bitcoins-lightning-network-paypal\" data-v-f87c67ca=\"\">Lightspark<\/a>, highlighted the importance of building out the infrastructure and capacity of the network. “Particularly because we can actually guarantee that even larger payments succeed on Lightning, which in the past has been pretty hard to achieve,” Marcus told The Block during the latest <a href=\"https:\/\/www.theblock.co\/post\/236600\/bitcoin-lightning-lightspark?utm_source=onecryptofeed&amp;utm_medium=social\" data-v-f87c67ca=\"\">episode<\/a> of The Scoop podcast.","“It's really building the capabilities that will enable any enterprise out there to access a real time, super low cost settlement network for the internet that's interoperable, that's open that any developer can build on. I think that you're going to see more adoption,” added the former PayPal president and head of Meta’s abandoned Diem stablecoin project. “You need more exchanges to be on the network so they can actually move not only bitcoin but be good on and off ramps for the Lightning Network.”","\"There's just more happening. I think there's more happening on Bitcoin in terms of development energy in the last 12 months than in the last X number of years combined. It's really pretty amazing to see,\" Marcus said.","The Lightning Network’s growth coincides with a recent price rise and increased adoption from crypto exchanges. It also follows a period of congestion and higher transaction fees associated with the <a href=\"https:\/\/www.theblock.co\/post\/231892\/bitcoin-ordinals-nft-boom-wash-trading\" data-v-f87c67ca=\"\">rise<\/a> in popularity of Ordinals — NFT-like tokens minted on the Bitcoin blockchain.","Binance, the world’s largest cryptocurrency exchange, recently <a href=\"https:\/\/www.binance.com\/en\/feed\/post\/499916\" data-v-f87c67ca=\"\">announced<\/a> it was integrating the Lightning Network on its platform, following rivals including <a href=\"https:\/\/www.kraken.com\/learn\/lightning-network\" data-v-f87c67ca=\"\">Kraken<\/a> and <a href=\"https:\/\/support.bitfinex.com\/hc\/en-us\/articles\/360039801053-Lightning-Network-BTC-LN-BTC-Deposits-Withdrawals\" data-v-f87c67ca=\"\">Bitfinex<\/a>. Last week, eagle-eyed users spotted the exchange <a href=\"https:\/\/www.theblock.co\/post\/235556\/binance-starts-whipping-up-bitcoin-lightning-network-nodes\" data-v-f87c67ca=\"\">spinning up<\/a> new Lightning Network nodes, Binance confirmed.","Bitcoin capacity is a more accurate reflection of adoption of the Lightning Network, with the record high in U.S. Dollar terms less surprising given bitcoin broke through yearly highs on Friday. Bitcoin is currently trading at $30,300, up 83% since the start of 2023, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">according<\/a> to CoinGecko data. However, bitcoin’s price is still down around 56% from an all-time high of $69,000 in November 2021.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Marcus","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"42%","content":"PERCENT"},{"type":"56%","content":"PERCENT"},{"type":"$172 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Lightning Network nodes","content":"ORGANIZATION"},{"type":"David Marcus","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"November 2021","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"Lightspark","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"105%","content":"PERCENT"},{"type":"$30,300","content":"MONEY"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"83%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"April 18","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","BITCOIN","KRAKEN"],"authors":["James Hunt","The Block"]}