{"summary":"Crypto-friendly trading app Robinhood plans to expand crypto services into the EU and establish a UK brokerage.\nThe move comes amid disappointing Q3 results for the fintech firm, driven by a 55% decline in crypto revenues.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262158\/robinhood-eu-uk-crypto-expansion","publishDate":"2023-11-08T07:09:01","id":1076,"type":null,"title":"Robinhood plans EU crypto trading expansion as Q3 revenue fell short of estimates","category":["Companies"],"content":["Trading app Robinhood is set to expand its crypto trading services to the European Union and open UK brokerage operations in the coming weeks. Its crypto brokerage services are only available in the United States at the moment.","“With an experienced team in place, we will soon launch brokerage operations in the UK,” Robinhood wrote in its Q3 <a href=\"https:\/\/s28.q4cdn.com\/948876185\/files\/doc_news\/Robinhood-Reports-Third-Quarter-2023-Results-2023.pdf\" data-v-f87c67ca=\"\">earnings statement<\/a> released late yesterday. “As another step in global expansion, we are also planning to launch crypto trading in the EU following our UK launch.”","Robinhood currently supports the trading of crypto assets in the U.S., including Bitcoin, Ether, Chainlink, Dogecoin and USDC, according to its <a href=\"https:\/\/robinhood.com\/us\/en\/support\/articles\/no-commission-crypto\/\" data-v-f87c67ca=\"\">website<\/a>. The firm <a href=\"https:\/\/www.theblock.co\/post\/233961\/robinhood-ends-support-for-solana-polygon-cardano-amid-sec-exchange-crackdown\" data-v-f87c67ca=\"\">ended support<\/a> for Solana, Polygon and Cardano in June after SEC's legal complaint against <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">Coinbase<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\">Binance<\/a>, in which the agency deemed the assets unregistered securities.","The move follows Q3 results for the fintech firm, which resulted in Robinhood shares falling around 10% from $9.76 to $8.82 in after-hours trading, according to TradingView. Its stock (NASDAQ: HOOD) currently trades at $9.02 in pre-market trading.","Robinhood Markets, Inc.’s transaction-based revenue fell 11% year-over-year to $185 million, driven by a 55% decline in crypto revenues to $23 million amid a slump in crypto trading volumes, per quarterly results. The firm reported a 29% year-over-year jump in total net revenue to $467 million. However, that fell short of analyst estimates, contributing to the decline in share price.","“It's been nearly 10 years since we founded Robinhood and we're just getting started. Over the past year, we’ve put a lot more value in products like Robinhood Gold including a 4.9% annual yield on cash and a 3% match on IRA contributions,” Robinhood co-founder and CEO Vlad Tenev said. “Looking ahead, we remain focused on providing industry-leading products that serve far more of customers’ financial needs, gaining market share, expanding internationally and continuing to change the industry for the better.”"],"hashtag":["ROBINHOOD"]}