{"summary":"Arkham Intelligence plans to add support for more chains in the future and will be airdropping its token to people who participate in its private beta.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205746\/data-analytics-firm-arkham-intelligence-adding-support-for-polygon-in-q1","publishDate":"2023-01-25T18:24:29","id":10770,"type":null,"title":"Data analytics firm Arkham Intelligence adding support for Polygon in Q1","category":["DEFI"],"content":["Arkham Intelligence announced it is adding support for Polygon, giving users the ability to track, monitor and identify wallets on its chain.","This is the second chain Arkham Intelligence will add support for besides Ethereum, which it will do in the first quarter. Arkham <a href=\"https:\/\/www.arkhamintelligence.com\/blog\/arkham-x-polygon\" data-v-f87c67ca=\"\">said<\/a> it chose Polygon for its second integration because of its partnerships with Disney, Starbucks and Stripe, as well as its large user base.","Support for additional blockchains is important for data analytics platforms to expand their appeal to wider audience. On-chain activity continues to expand to multiple blockchains and Polygon is of the largest Layer 1 blockchains by Total Value Locked, <a href=\"https:\/\/defillama.com\/chains\" data-v-f87c67ca=\"\">according<\/a> to DeFiLlama.","Arkham plans to add support for other blockchains in the future and <a href=\"https:\/\/www.arkhamintelligence.com\/blog\/arkham-x-polygon\" data-v-f87c67ca=\"\">said<\/a>&nbsp;having multiple chains integrated on its platform “opens new possibilities for on-chain research.”","Arkham Intelligence rolled out private beta testing for its platform last year. It currently lets whitelisted users share referral links, which will be used to airdrop its ARKM token.","“Once we launch the $ARKM token network, as a referrer you will be rewarded with $ARKM tokens directly to your wallet of choice for every person who signs up with your link,” the Arkham Referral Program acceptance email reads.","Arkham Intelligence said it raised a Series A funding round that included the founders of Palantir and ChatGPT’s parent company OpenAI. Its analytics platform can be used to label specific wallets and monitor transactions. It also has a unique visualizer that allows users to see how wallets are connected to each other.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"$ARKM","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Total Value Locked","content":"ORGANIZATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Disney","content":"ORGANIZATION"}],"hashtag":["AIRDROP"],"authors":["Mike Truppa","The Block"]}