{"summary":"After making bitcoin a legally recognized currency in April, the Central African Republic has published online plans for a “crypto hub.”\nThe plans, dubbed Project Sango, include a “crypto island” and a digital wallet.","author":["Andrew Rummer","Kristin Majcher","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148416\/central-african-republic-teases-project-sango-crypto-hub","publishDate":"2022-05-24T06:49:50","id":1077,"type":null,"title":"Central African Republic teases &#x27;Project Sango&#x27; crypto hub","category":["Policy"],"content":["A month after <a href=\"https:\/\/www.theblockcrypto.com\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp\" data-v-f87c67ca=\"\">making bitcoin<\/a> a legally recognized currency, the Central African Republic has unveiled plans to create a \"crypto hub\" to attract global crypto enthusiasts.&nbsp;","The plans have been dubbed Project Sango, according to a <a href=\"https:\/\/m.facebook.com\/story.php?story_fbid=pfbid0NMB9KS92GbwaveRhi2n4FCGCTHaPS1jNhDkA2Rspzp1e6EAEea9BDVKrQ4mKT5yAl&amp;id=100068314766662&amp;m_entstream_source=timeline\" data-v-f87c67ca=\"\">post<\/a> on the government's official Facebook page dated Monday that directed people to a landing page at <a href=\"https:\/\/sango.org\/\" data-v-f87c67ca=\"\">sango.org<\/a>. After registering for the waitlist, users were sent a link to a 24-page <a href=\"https:\/\/sango.org\/sango.pdf\" data-v-f87c67ca=\"\">online presentation<\/a> with further details on the proposed project.","There was no confirmation of the Facebook post on the Twitter account of Faustin-Archange Touadéra, CAR's president. Although he had <a href=\"https:\/\/twitter.com\/FA_Touadera\/status\/1527987577223008260\" data-v-f87c67ca=\"\">tweeted<\/a> on Saturday that \"very soon we will announce the next planned phase\" with the hashtag #bitcoin.","According to the presentation, which is filled with images of undulating skyscrapers and sailboat-dotted lakes, the Sango project involves creating \"the first legal crypto hub recognized by a country's parliament.\" CAR's plans include founding a Digital Nation Bank, facilitating land purchases in bitcoin, and developing a crypto wallet.","The government will support crypto firms' access to natural resources such as gold, diamonds and uranium and institute a \"citizenship by investment\" program with zero-rate tax on income and businesses, according to the presentation.&nbsp;","The landlocked African nation ranks among the least developed economies in the world with agriculture the largest contributor to its GDP. According to World Bank <a href=\"https:\/\/data.worldbank.org\/indicator\/NY.GDP.MKTP.CD?locations=CF\" data-v-f87c67ca=\"\">figures<\/a>, CAR’s economic output stood at only $2.38 billion as of 2020 and the country ranks near the bottom of the United Nation’s Human Development Index.","Last month,&nbsp;CAR became the first African nation to adopt bitcoin as an official currency, alongside the France-backed CFA franc.","<em data-v-f87c67ca=\"\">With reporting by Adam Morgan McCarthy and Osato Avan-Nomayo.&nbsp;<\/em>"],"hashtag":["BITCOIN"]}