{"summary":"The Securities and Exchange Commission brought civil charges against Terraform Labs, the developer of TerraUSD, and its CEO Do Kwon on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212772\/jump-terraform-prop-up-terrausd","publishDate":"2023-02-17T12:00:01","id":10777,"type":null,"title":"Jump is the unnamed &#x27;US trading firm&#x27; in SEC complaint against Do Kwon: sources","category":["COMPANIES"],"content":["Jump Trading is the unidentified \"U.S. trading firm\" the Securities and Exchange Commission accused of helping support the TerraUSD stablecoin as it de-pegged from the dollar in 2021, according to two people with knowledge of the trades.&nbsp;","The U.S. Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/212695\/sec-charges-terraform-and-do-kwon-post-terra-collapse\" data-v-f87c67ca=\"\">brought civil charges<\/a> against Terraform Labs, the developer of TerraUSD and its related luna token, and the firm's CEO Do Kwon on Thursday, including the allegation that they misled investors by using a \"U.S. trading firm\" to support TerraUSD's value in May 2021. That firm was Jump, according to the people.","The SEC has not brought any charges against Jump or accused the firm of wrongdoing. A spokesperson for Jump declined to comment.&nbsp;","TerraUSD, the stablecoin often known by its ticker UST, <a href=\"https:\/\/www.theblock.co\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">collapsed<\/a> in May 2022, resulting in tens of billions in losses for investors. Yet these allegations from the SEC relate to a de-pegging that took place one year earlier — with the accusation that Terraform used human traders to prop up its value, rather than the software algorithm it claimed supported the system.&nbsp;","\"In May 2021, when the value of UST became 'unpegged' from the U.S. dollar, Terraform, through Kwon, secretly discussed plans with a third party, the 'U.S. trading firm,' to buy large amounts of UST to restore its value,\" according to the SEC <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/02\/terra-sec.pdf\" data-v-f87c67ca=\"\">complaint<\/a>. \"When UST’s price went back up as a result of these efforts, defendants falsely and misleadingly represented to the public that UST’s algorithm had successfully re-pegged UST to the dollar.\"","The May 2021 de-pegging came four months before Chicago-based Jump Trading officially <a href=\"https:\/\/www.businesswire.com\/news\/home\/20210914005700\/en\/Jump-Trading-Group-Launches-Jump-Crypto\" data-v-f87c67ca=\"\">unveiled<\/a> a crypto-focused unit, known as Jump Crypto and run by Kanav Kariya.&nbsp;","The SEC accused Terraform of working with the unidentified trading firm from around November 2019. The firm provided&nbsp; market making for luna and TerraUSD in exchange for compensation — generally paid in luna at a discount to the prevailing market price.&nbsp;","Yet after the trading firm stepped in to help prop up TerraUSD in May 2021, Terraform sweetened the terms of the deal, the SEC said. Now the trading firm would regularly receive luna tokens at 40 cents each, even when they were trading at more than $90 in the secondary market.&nbsp;","The trading firm — identified as Jump by The Block's sources — ultimately profited by about $1.28 billion from this deal, according to the SEC.&nbsp;","In addition to the allegations surrounding the TerraUSD de-pegging, the SEC accused Terraform Labs and Kwon of raising billions of dollars from investors by “offering and selling an inter-connected suite of crypto asset securities, many in unregistered transactions.” That included “mAssets,” which the SEC said are security-based swaps designed to pay returns by mirroring the price of U.S. company stocks as well as TerraUSD.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"40 cents","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"November 2019","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Kanav Kariya","content":"PERSON"},{"type":"Chicago","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$1.28 billion","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"Terraform","content":"LOCATION"},{"type":"$90","content":"MONEY"}],"hashtag":["DO KWON","INVESTMENT FIRMS","LAWSUITS","SEC"],"authors":["Frank Chaparro","Andrew Rummer","The Block"]}