{"summary":"The hub&#x27;s Eurosystem Centre will open locations in Frankfurt and Paris and work with all 19 euro area central banks and the European Central Bank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152953\/bis-innovation-hub-to-create-platform-addressing-collapse-of-stabecoins-defi-lenders","publishDate":"2022-06-19T07:37:38","id":10789,"type":null,"title":"BIS Innovation Hub to create platform addressing collapse of stablecoins, DeFi lenders","category":["PROJECTS"],"content":["The Bank for International Settlements (BIS) Innovation Hub on Friday <a href=\"https:\/\/www.bis.org\/press\/p220617.htm\" data-v-f87c67ca=\"\">revealed<\/a> the first three projects of its forthcoming Eurosystem Centre.","Eurosystem Centre will open locations in Frankfurt and Paris and work with all 19 euro area central banks and the European Central Bank.","Its first project is a cryptocurrency market intelligence platform, a need that has been highlighted by the collapse of many stablecoins and decentralised finance (DeFi) lending platforms. The goal is to create an open-source market intelligence platform to shed light on market capitalisations, economic activity and risks to financial stability.","A second project involves post-quantum cryptography and securing the privacy of payments systems. Quantum computers may be capable of breaking the cryptography used by central banks and the private financial sector to secure payment and settlement systems. The goal is to test use cases in various payment systems and examine how the introduction of quantum-resistant cryptography affects their performance.&nbsp;","Increasing the transparency of climate-related disclosures is the third BIS project. Central banks are increasingly looking into how climate change may affect financial stability, inflation and other issues. The hub aims to build an open-source database of corporate reports coupled with a full-text search engine to identify sustainability-related disclosures.","In addition to the Eurosystem initiatives, the Innovation Hub's Hong Kong Centre will partner with the <a href=\"https:\/\/www.theblock.co\/post\/152949\/israel-working-with-hong-kong-to-test-digital-currency-risk-bloomberg-says\" data-v-f87c67ca=\"\">Bank of Israel<\/a> and the Hong Kong Monetary Authority on a study of central bank digital currency and cybersecurity.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Frankfurt","content":"LOCATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bank of Israel","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Hong Kong Centre","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Millard","The Block"]}