{"summary":"South Korean investment firm has received a default notice on its loan taken on collateral-free lending platform TrueFi.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175843\/south-korean-firm-blockwater-defaults-on-3-million-loan-from-truefi","publishDate":"2022-10-10T04:14:43","id":10785,"type":null,"title":"South Korean firm Blockwater defaults on $3 million loan from TrueFi","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">South Korean investment firm Blockwater failed to repay its <a href=\"https:\/\/app.truefi.io\/loans\/0x4A66a867f52DF4Ed1D8580A1C383B2dD036a3C47\" data-v-f87c67ca=\"\">$3.4 million loan<\/a> taken from uncollateralized lending provider TrueFi, according to a <a href=\"https:\/\/blog.truefi.io\/truefi-issues-notice-of-default-to-blockwater-technologies-19088a9b2570\" data-v-f87c67ca=\"\">blog post<\/a> by TrueFi.<\/span>","<span data-v-f87c67ca=\"\">Blockwater received a \"notice of default\" on Oct. 6 after it missed a scheduled payment for a loan that was taken in the BUSD stablecoin, per <a href=\"https:\/\/etherscan.io\/tx\/0x761a5d3172dc12f6eb061c4a224af8317187407136879e6b0ec0bfaffdc42537\" data-v-f87c67ca=\"\">on-chain data<\/a>. <\/span>","<span data-v-f87c67ca=\"\">TrueFi said it has collected approximately $645,000 in eight repayments and the remaining debt is estimated to be $2.96 million at the time of the default. The $3.4 million loan default represents about 2% of TrueFi’s Total Value Outstanding, the lender added.<\/span>","\"While this represents TrueFi’s only declared default to date, the credit group continues to remain vigilant and proactive with existing borrowers to ensure that reporting and compliance requests are being promptly met, given the challenging market conditions,\" said TrueFi.","Originally, the loan had a maturity of 90 days ending in the of the first week of August. Later, as part of negotiations between the two parties, the $3.4 million loan was restructured with the loan maturity extending through to October and a weekly repayment schedule.&nbsp;","TrueFi lets crypto players take loans without the use of collateral. The borrowers on TrueFi are institutions that have to pass various Know Your Customer (KYC) procedures to open a borrower pool.","<span data-v-f87c67ca=\"\">Blockwater's default is yet another example of financial distress faced by many centralized crypto entities and lenders in 2022. Since May, institutional players like Three Arrows Capital and Celsius Network have defaulted on unsecured loans, thereby triggering financial woes across the crypto space.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$645,000","content":"MONEY"},{"type":"first week of August","content":"DATE"},{"type":"Oct. 6","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"$3.4 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2.96 million","content":"MONEY"},{"type":"Blockwater","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["LENDING"],"authors":["Vishal Chawla","The Block"]}