{"summary":"Want some bare-knuckled bitcoin litigation, agents (but not the James Bond kind), and news on why too much of a good thing sometimes isn&#x27;t all that great?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8021\/the-court-denies-the-dismissal-of-the-winklevii-lawsuit","publishDate":"2019-01-21T12:00:39","id":10792,"type":null,"title":"The Court denies the dismissal of the Winklevii lawsuit","category":["LEGAL"],"content":["Want some bare-knuckled bitcoin litigation, agents (but not the James Bond kind), and news on why too much of a good thing sometimes isn't all that great? Read on, MacDuff!&nbsp;","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes and provided by <a href=\"https:\/\/twitter.com\/nelsonmrosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a>&nbsp;&nbsp;and <a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stephen Palley<\/a>&nbsp;These posts are not legal advice. These are our opinions only and aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.&nbsp;<\/em>","If you have the unpleasant experience of getting sued, one of the opening gambits your lawyer might try is to move to dismiss the lawsuit. In federal court this usually arises under Rule 12(b) of the Federal Rules of Civil Procedure. Not to be a Negative Nate here, but these things are usually not granted because the standard to survive such a motion isn’t hard to satisfy. But sometimes they are and there are sometimes tactical reasons for moving even if you think you’ve got a slim chance.","We’ve written about the Winklevoss v. Shrem lawsuit in the past and if you want to catch up on the merits of that case, you can look at one of prior pieces <a href=\"https:\/\/www.theblockcrypto.com\/2018\/11\/09\/winklevoss-lawsuit-against-charlie-shrem-peeled-out-in-top-gear-but-now-may-be-stuck-in-neutral\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">here<\/a>. In the latest chapter in this bare knuckled bitcoin litigation, the case survived a motion to dismiss late December. And the court last week issued an opinion explaining why it wouldn’t dismiss the lawsuit. It was maybe worth a try, but a competent lawyer usually doesn’t file a lawsuit that can’t beat a 12(b) motion.","First, the court rejected the argument that there it lacked subject matter jurisdiction because “Shrem fails to show to a ‘legal certainty’ that the total of all four of WCF’s claims cannot exceed $75,000.” The court says that even if WCF only gets $61,000 on the fraud claim — that’s the amount WCF says they gave Shrem to buy bitcoin for it — there are other potential damages claims, including punitive damages claims, the court noted. In short, more than enough allegations to get past $75,000, which is what you need to get Federal Court “Diversity Jurisdiction” in the United States.","Second, as the allegations themselves — this isn’t a hard standard. You have to lay out legal allegations and facts with requisite particularity to survive dismissal. The court doesn’t evaluate the merits of the claims, which are assumed true for purposes of the ruling.","True or not, the Court says that “The events alleged in WCF’s complaint suffice to give rise to the requisite strong inference that Shrem acted fraudulently. WCF alleges that Shrem intentionally misrepresented his intentions to use WCF’s money to buy WCF Bitcoin and to provide a full accounting of those purchases in order to induce WCF to give him money that he could take for himself, and that he similarly shortchanged at least one other purchaser in order to build a personal Bitcoin fortune.” Again, and this is important — these are unproven allegations — the Court isn’t saying they are true. The Court says that the other allegations also meet pleading standards.","What’s next? Initial disclosures, discovery (written and depositions), and then I imagine we will see summary judgments. A summary judgment motion is where a court decides on the factual merits of a case and whether there is a sufficient dispute for a case to go trial.","I am totally guessing of course but this feels like a case that gets tried if it isn’t settled. It doesn’t seem like a summary judgment decision, at least from the outside. Something like 98 percent of all cases settle. I’m not sure what the incentive is here. WCF doesn’t need the money, has used heavy artillery from the outset (prejudgment attachment, which failed but was an expensive first move) and seems to be sending a message.","The Block<em data-v-f87c67ca=\"\"> is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given <\/em>The Block<em data-v-f87c67ca=\"\"> permission to republish their commentary and analysis in full. Part III of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em><i data-v-f87c67ca=\"\"><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Federal Rules of Civil Procedure","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"98 percent","content":"PERCENT"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"WCF","content":"ORGANIZATION"},{"type":"Federal Court “Diversity Jurisdiction","content":"ORGANIZATION"},{"type":"$61,000","content":"MONEY"},{"type":"$75,000","content":"MONEY"},{"type":"WCF Bitcoin","content":"ORGANIZATION"},{"type":"MacDuff!","content":"ORGANIZATION"},{"type":"Winklevoss","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}