{"summary":"A group of XRP investors has filed a petition seeking a writ of mandamus in the SEC vs. Ripple case.\nThe group seeks an amendment of the SEC’s complaint against Ripple so that their XRP holdings aren’t considered securities.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/89934\/xrp-investors-file-petition-writ-of-mandamus-sec-vs-ripple-case","publishDate":"2021-01-04T08:35:22","id":1079,"type":null,"title":"XRP investors file a petition seeking a writ of mandamus in the SEC vs. Ripple case","category":["Ripple"],"content":["A group of XRP investors has filed a petition in the Rhode Island District Court seeking a writ of mandamus in the U.S. Securities and Exchange Commission (SEC) vs. Ripple case filed last month.","A <a href=\"https:\/\/www.investopedia.com\/ask\/answers\/123015\/what-writ-mandamus.asp\" data-v-f87c67ca=\"\">writ of mandamus<\/a> is a court order compelling someone to execute a duty that they are legally obligated to complete. In this case, <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/01\/xrp_investors_sec.pdf\" data-v-f87c67ca=\"\">the petition filed<\/a> on Friday by the group is against Elad Roisman, acting chairman of the SEC. The petitioners seek an amendment of the SEC's complaint against Ripple so that their XRP holdings aren't considered securities.","The SEC views XRP as a security and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/88912\/sec-ripple-labs-lawsuit-filed-2\" data-v-f87c67ca=\"\">sued<\/a> Ripple and two of its executives — CEO Brad Garlinghouse and co-founder Chris Larsen — on December 22, alleging that they have raised more than $1.3 billion via an ongoing, unregistered securities sale of XRP.","The petitioners argue that \"today's XRP\" is not a security. They say the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/14823\/some-corporate-executives-use-buybacks-to-cash-out-sec-commissioner-claims\" data-v-f87c67ca=\"\">SEC<\/a> could have targeted specific distributions of XRP, especially in the early days of 2013 through 2015. \"Any colorable claim or argument that XRP constitutes an unregistered security could only be made in those very early days and distributions. The SEC could have targeted those early Ripple distributions and any individual sales by its executives without attempting absurdity by calling the XRP in the Petitioners' wallets unregistered securities,\" the petitioners say.","They claim that the former chairman of SEC, Jay Clayton, \"knowingly and intentionally caused multibillion-dollar losses to innocent investors who have purchased, exchanged, received and\/or acquired the Digital Asset XRP, including the named Petitioners, and all others similarly situated\" by suing Ripple. The named petitioners are John Deaton, Jordan Deaton, James Lamonte, Tyler Lamonte, Mitchell McKenna, and Kristiana Warner — all residents of the U.S.","They further say that Clayton went after Ripple and the executives seven years after XRP was introduced to the public for sale and just one day before leaving the SEC. They go on to say that Clayton never clarified whether XRP is a security when asked by media on a few occasions.","\"Clayton chose to file, quite possibly, the most significant SEC enforcement action in 76 years as he was walking out the door after allowing the Digital Asset XRP be sold for SEVEN years, leaving a new administration to deal with the aftermath,\" they say. \"A different political party is assuming control and it is quite possible, if not likely, that they withdraw and\/or amend and limit the Complaint's scope and allegations related to XRP.\"","The petitioners also noted that all major U.S. crypto exchanges are set to either delist or suspend all XRP trading and after that, the XPR owned by them will become \"untradeable and thus lose all value and become useless.\"","It remains to be seen whether the court will grant the petitioners a writ of mandamus. The SEC and Ripple, on their part, are <a href=\"https:\/\/www.theblockcrypto.com\/linked\/89634\/sec-ripple-case-initial-pretrial-conference-february-22-xrp\" data-v-f87c67ca=\"\">set to begin<\/a> legal proceedings on February 22."],"hashtag":["LAWSUITS","SEC","XRP"]}