{"summary":"Crypto miner Greenidge&#x27;s pending air permit renewal for its upstate New York plant has been delayed to June 30.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140081\/greenidge-permit-renewal-delayed-as-company-debates-with-regulators","publishDate":"2022-03-31T19:12:49","id":10809,"type":null,"title":"Greenidge permit renewal delayed as company debates with regulators","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">A final decision on the permit renewal for Greenidge’s upstate New York crypto mining facility has been pushed back to June 30.<\/span>","<span data-v-f87c67ca=\"\">The New York State Department of Environmental Conservation announced on Thursday that it would start reviewing new greenhouse gas (GHG) emission mitigation measures proposed by Greenidge in a letter dated March 25.<\/span>","The agency had <a href=\"https:\/\/www.dec.ny.gov\/permits\/123728.html\" data-v-f87c67ca=\"\">previously<\/a> told Greenidge that additional steps were needed to meet the requirements set by New York's <span data-v-f87c67ca=\"\">Climate Leadership and Community Protection Act (CLCPA), signed into law in 2019.<\/span>","In the letter, Greenridge proposed that two limitations be added to the permit. Firstly, a 40% greenhouse gas emissions reduction of its Dresden facility from the current permitted level by the end of 2025. Secondly, a requirement to be a zero-carbon emitting power generation facility by 2035.","Greenidge maintains that it is already compliant with the CLCPA. The company argues that a denial over emissions standards \"defies logic\" because GHG emissions limits in the CLCPA would only need to be achieved years after the new permit would expire.","The company said its 106-megawatt facility in Dresden only made up “a fraction” of electricity generation in New York and that it had reduced the plant's combined upstream and onsite GHG emissions by roughly 70% when compared to the 1990 baseline set in the CLCPA.","<span data-v-f87c67ca=\"\">Cornell professor Anthony Ingraffea, who testified during a State Assembly public hearing last year on mining and climate change, told The Block on first review of the letter: “I have no idea how they could possibly reduce their CO2 emissions by 40% below their current permit without seeing details.”<\/span>","<span data-v-f87c67ca=\"\">Ingraffea said it would be important to have a clear roadmap for when and how the company plans to achieve this.<\/span>","<span data-v-f87c67ca=\"\">“The devil is in the details,” Ingraffea said. “They say by the end of 2025. Are they going to start doing it at the beginning of 2025? Are they gonna start doing it tomorrow?”<\/span>","<span data-v-f87c67ca=\"\">The Block has reached out to Greenidge for more details on how the company plans to achieve this goal. While it did not provide the specific steps it plans to take, the company said it plans to go further than it has in the past to reduce emissions.<\/span>","\"We are willing to do far more than we have already done to further reduce GHG emissions and help the State achieve its statewide CLCPA goals,\" Greenidge said.","It also claimed that opponents of the plant have tried to \"mislead the public.\"","\"This is a standard air permit renewal governing permitted emissions levels, not a cryptocurrency permit,\" Greenidge said.","<span data-v-f87c67ca=\"\">The decision by the DEC has now been delayed multiple times, as the plant drew attention from environmentalists and the general public. The DEC has received around 4,000 letters about the permit and will continue to review them in the following months.<\/span>","<span data-v-f87c67ca=\"\">With a growing number of miners setting up operations in New York, state <a href=\"https:\/\/www.theblockcrypto.com\/post\/138860\/new-yorks-revamped-crypto-mining-moratorium-is-not-a-ban-but-it-is-moving-forward\" data-v-f87c67ca=\"\">legislators have been trying to push a bill<\/a> that would establish a moratorium on new permits for certain types of mining plants planning to use carbon-based fuel.<\/span>","<span data-v-f87c67ca=\"\">A recent study from Columbia University has also argued that the New York governor <a href=\"https:\/\/www.theblockcrypto.com\/post\/138789\/new-york-legislators-weigh-moratorium-on-crypto-mining-while-some-look-to-an-executive-order-from-the-governor\" data-v-f87c67ca=\"\">has the authority to impose a moratorium<\/a> via executive order.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"State","content":"ORGANIZATION"},{"type":"New York State Department of Environmental Conservation","content":"ORGANIZATION"},{"type":"Greenidge","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"June 30","content":"DATE"},{"type":"Anthony Ingraffea","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"1990","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2035","content":"DATE"},{"type":"DEC","content":"ORGANIZATION"},{"type":"Ingraffea","content":"PERSON"},{"type":"March 25","content":"DATE"},{"type":"Dresden","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"State Assembly","content":"ORGANIZATION"},{"type":"Greenidge","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"Columbia University","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Greenridge","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}