{"summary":"The European Commission estimates the data economy is worth $3 trillion dollars. The most valuable companies in the world, like Google and Facebook, are","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119377\/data-monetisation-solution-swash-brings-power-to-the-people-by-reimagining-data-ownership","publishDate":"2021-10-04T00:57:00","id":10807,"type":null,"title":"Data monetisation solution, Swash, brings power to the people by reimagining data ownership","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The European Commission estimates the data economy is worth $3 trillion dollars. The most valuable companies in the world, like Google and Facebook, are so valuable because of their access to <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">your<\/span><\/i><span data-v-f87c67ca=\"\"> data. Unfortunately, for anyone who doesn’t want to be a part of this system, there is a lack of viable alternatives.<\/span>","<span data-v-f87c67ca=\"\">With major data scandals, like Cambridge Analytica-Facebook, regulations like GDPR and CCPA, and the growing demands for data rights, the world is waking up to what’s happening with our data. Increasing digitisation not only means that every internet user creates approximately 1.7MB of data every second, but it’s also time to think of or digital footprints and the way data is affecting our lives.<\/span>","<span data-v-f87c67ca=\"\">As the data economy continues to grow, set to reach 175 zettabytes in the next five years, it’s crucial that people are recognised for their essential role in this vibrant economy. Unfortunately, despite growing income disparity, people don’t have any way to receive their share for all their contributions. Instead, tech monoliths extract our data and reap the profits from it, leaving the rest of us behind.<\/span>","<span data-v-f87c67ca=\"\">Swash is rebalancing this power dynamic by putting people at the centre of the data economy. Through a friendly interface, Swash redistributes value back to the people who deserve it - everyday internet users.<\/span>","<span data-v-f87c67ca=\"\">As the world’s first and largest Data Union, Swash is centred on giving back control to individuals, breaking free from data silos, and offering fair rewards. Over 60,000 people already use the live Swash app to reclaim ownership and compensation over their data.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now, <\/span><a href=\"https:\/\/medium.com\/swashapp\/introducing-swashs-all-star-backers-eff650f5bef2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">backed<\/span><\/a><span data-v-f87c67ca=\"\"> by KuCoin, Outlier Ventures, and Streamr, and partnered with the likes of Chainlink, Ocean Protocol, Boson Protocol, and the Data Privacy Protocol Alliance (DPPA), the Swash team have raised over $5.5MM in an ongoing private round in preparation for their upcoming IDO.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With this, Swash will expand into a fully-fledged data ecosystem that enables key stakeholders to work together by providing novel incentivisation mechanisms that cater to the needs of everyone involved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">People share their data to earn while retaining their privacy, businesses access high-quality, zero-party data in a sustainable and compliant way, and developers can easily set up and build systems within a collaborative development framework.<\/span>","<span data-v-f87c67ca=\"\">The ecosystem will launch with four First Wave Solutions; Data Union, sIntelligence, sApps, and sCompute, all fuelled by the Swash token. For details on the upcoming IDO and to learn more about Swash, visit the <\/span><a href=\"https:\/\/swashapp.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">, and follow the team on <\/span><a href=\"https:\/\/twitter.com\/swashapp\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/t.me\/swashapp_group\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Telegram<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.linkedin.com\/company\/swashapp\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">LinkedIn<\/span><\/a><span data-v-f87c67ca=\"\">. Join the <\/span><a href=\"https:\/\/swashapp.io\/newsletter\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Swash mailing list<\/span><\/a><span data-v-f87c67ca=\"\"> to get prioritised for whitelisting and for exclusive updates and announcements.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"First Wave Solutions; Data Union","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"KuCoin","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Boson Protocol","content":"ORGANIZATION"},{"type":"$5.5","content":"MONEY"},{"type":"Data Union","content":"ORGANIZATION"},{"type":"Cambridge Analytica","content":"LOCATION"},{"type":"$3 trillion dollars","content":"MONEY"},{"type":"Ocean Protocol","content":"ORGANIZATION"},{"type":"Swash","content":"PERSON"},{"type":"Outlier Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}