{"summary":"DEX aggregator 1inch has expanded to Ethereum scaling solution Optimism. The aim is to lower gas fees and increase transactions per second.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114793\/dex-aggregator-1inch-expands-to-ethereum-scaling-solution-optimism","publishDate":"2021-08-17T11:04:26","id":10806,"type":null,"title":"DEX aggregator 1inch expands to Ethereum scaling solution Optimism","category":["DEX"],"content":["1inch, a decentralized exchange (DEX) aggregator that sources liquidity from various exchanges, has expanded to Optimism Ethereum, a Layer-2 scaling solution.","The aim is to lower gas fees and increase throughput or transactions per second (TPS) for users, said 1inch. Specifically, Optimism Ethereum will be capable of up to around 2,000 TPS when an optimized production version of its network is launched, 1inch co-founder Anton Bukov told The Block.","However, Optimistic Ethereum's throughput is currently limited to 0.6 TPS; the limitation is to avoid potential risks and failures during the alpha stage of development, said Bukov. Ethereum's current TPS, on the other hand, is around 15.","Last month, the decentralized exchange protocol <a href=\"https:\/\/www.theblockcrypto.com\/linked\/111194\/uniswap-takes-next-step-toward-adopting-layer-2-tech-with-alpha-launch-on-optimism\" data-v-f87c67ca=\"\">Uniswap<\/a> also expanded to Optimism Ethereum.","As for reduced gas fees on the Optimistic Ethereum network, Bukov said there should be savings of around 2x-10x compared to Ethereum. \"The reduced gas fees became possible due to the architecture of the Optimistic network, which only needs to transfer compressed state changes to Layer-1 (L1) and doesn't have to pay for calculations on L1,\" said Bukov.","1inch users can now start migrating assets to the Optimistic Ethereum network through the&nbsp;Optimism Gateway, said 1inch. The network is compatible with several wallets, including MetaMask.","With the expansion on Optimistic Ethereum, 1inch is now available on a total of four blockchains, including Ethereum, Binance Smart Chain, and Polygon (formerly Matic Network).&nbsp;&nbsp;","Bukov said 1inch is looking to support more blockchains, including Solana, Avalanche, TRON, NEAR, xDAI, and also other Layer-2 solutions like Arbitrum and zkSync.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anton Bukov","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Optimistic Ethereum","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Matic Network)","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Bukov","content":"PERSON"}],"hashtag":["OPTIMISM"],"authors":["Yogita Khatri","The Block"]}