{"summary":"Bakkt, the cryptocurrency venture backed by Intercontinental Exchange, announced Monday the launch of its institutional custody business.  In a blog post,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/46549\/bakkt-officially-dives-into-crowded-crypto-custody-market-after-nydfs-blessing","publishDate":"2019-11-11T09:59:36","id":1080,"type":null,"title":"Bakkt officially dives into crowded crypto custody market after NYDFS blessing","category":["BITCOIN"],"content":["Bakkt, the cryptocurrency venture backed by Intercontinental Exchange, announced Monday the launch of its institutional custody business.&nbsp;","In a <a href=\"https:\/\/medium.com\/bakkt-blog\/raising-the-bar-announcing-bakkt-institutional-custody-ed5e2ad0da9a\" data-v-f87c67ca=\"\">blog post<\/a>, the company said the Bakkt Warehouse, which until now stored the bitcoin tied to its futures product, would open its doors to clients looking to \"safeguard their assets using Bakkt's enterprise-grade offering.\" Bakkt's custody ambitions have been well-documented, but approval from the New York Department of Financial Services (NYDFS) will allow the firm to officially launch the business.&nbsp;","In August, The Block reported Bakkt would \"soon open their doors to hedge funds, asset managers, and other clients.\" To start, Bakkt will offer its services to Galaxy Digital, Tagomi, and Pantera Capital.","<strong data-v-f87c67ca=\"\">Crowded market<\/strong>","Bakkt Warehouse is entering a market with a fair amount of competition, including Fidelity Digital Assets, which fully rolled-out its platform in October, as per the <a href=\"https:\/\/www.ft.com\/content\/ca95d640-f0b6-11e9-ad1e-4367d8281195\" data-v-f87c67ca=\"\">Financial Times<\/a>. There's also <a href=\"https:\/\/custody.coinbase.com\/pricing\" data-v-f87c67ca=\"\">Coinbase Custody<\/a>, which now manages over $7 billion thanks in part to its acquisition of Xapo's institutional business. Coinbase Custody launched in 2018.&nbsp;","The Xapo deal was also being considered by Fidelity, a sign of the mounting competition in what many consider to be the most crowded corner of the digital asset market.&nbsp;<a href=\"https:\/\/www.bitgo.com\/services\/custody\" data-v-f87c67ca=\"\">BitGo<\/a>, which competes fiercely with Coinbase on several accounts, is arguably the most established firm in the market. It counts Goldman Sachs as a backer and at one point, was working on a proof of concept with the bulge bracket bank, sources say.&nbsp;","At the same time, new entrants promising sexier tech are looking to snag market share from rivals with bigger names. Anchorage is looking to take on the \"old guards\" cold storage approach to custody <a href=\"https:\/\/www.theblockcrypto.com\/daily\/30631\/visa-blockchain-capital-back-40-million-round-for-crypto-custodian-anchorage\" data-v-f87c67ca=\"\">with a newfangled offering<\/a>, leveraging so-called \"<a href=\"https:\/\/medium.com\/anchorage\/smart-storage-how-anchorage-provides-crypto-investors-greater-security-and-usability-dcaa00d1173c\" data-v-f87c67ca=\"\">smart storage<\/a>\" technology.","Increased competition has caused fees to collapse. Coinbase, which at one point charged over 100 basis points to custody cryptocurrency, is now charging just 50 points, according to its website. A Bakkt spokesperson declined to comment on fees.&nbsp;","Fee compression has forced firms to look for an edge. BitGo is exploring prime broker solutions for its clients, while Gemini looks to beef up its settlement capabilities for institutional clients, for example.&nbsp;","<strong data-v-f87c67ca=\"\">Back to Bakkt<\/strong>","Each custodian offers its own flavor to crypto storage. As for Bakkt, it is touting a $125 million insurance policy, underwritten by an undisclosed entity. BitGo claims to have the \"most comprehensive custody solution\" with its $100 million insurance package. Insurance is a thorny concept and not all packages, irrespective of size, are created equal.&nbsp;","Furthermore, Bakkt has also secured its SOC2 certification, a review of its systems by a third-party auditor.&nbsp;","The firm says its relationship with Intercontinental Exchange will allow it to offer some unique features, including \"on-premises data centers and dedicated network connectivity between operational sites\" which eliminate the need to rely on third parties.&nbsp;","For good measure, the firm will also protect its systems with \"24x7 video monitoring, armed guards, and security operations and incident response teams.\"","Bakkt just logged the largest single-day trading volume of its physically-settled monthly bitcoin futures. Volume hit ~$15.33 million on Friday, passing its previous high of ~$10.25 million on Oct. 25. The total volume of Bakkt’s monthly bitcoin futures now stands at $106.74 million (12,012 BTC) since its launch on Sept. 23. The firm has applied to launch a liquidity incentive program to spur further adoption of its futures product, but it has yet to been approved, according to a person familiar with the situation.&nbsp;","Bakkt also recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/44872\/bakkt-to-launch-consumer-app-in-first-half-of-2020-will-test-product-with-starbucks\" data-v-f87c67ca=\"\">announced<\/a> that its plans to launch a cryptocurrency consumer app and merchant portal in the first half of 2020 with Starbucks, the provider's first launch partner. In an October earnings call, Intercontinental Exchange (ICE) CEO Jeffrey Sprecher <a href=\"https:\/\/www.theblockcrypto.com\/post\/45349\/ice-ceo-all-kinds-of-financial-institutions-are-talking-to-bakkt\" data-v-f87c67ca=\"\">announced<\/a>&nbsp;that all types of financial institutions were talking to Bakkt to explore the possibility of adopting its offering. ICE is the main backer of Bakkt.&nbsp;","<i data-v-f87c67ca=\"\">This post has been amended to clarify that Bakkt hasn't&nbsp;received approval for a liquidity incentive program for its bitcoin futures market.&nbsp;<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bakkt","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Bakkt","content":"LOCATION"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$125 million","content":"MONEY"},{"type":"Oct. 25","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"Bakkt","content":"ORGANIZATION"},{"type":"Jeffrey Sprecher","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tagomi","content":"LOCATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"$10.25 million","content":"MONEY"},{"type":"the first half of 2020","content":"DATE"},{"type":"$7 billion","content":"MONEY"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Sept. 23","content":"DATE"},{"type":"$106.74 million","content":"MONEY"},{"type":"$15.33 million","content":"MONEY"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}