{"summary":"Ethereum core developers will maintain only two testnets following the merge, which are Goerli and Sepolia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153581\/ethereum-devs-to-shutter-ropsten-rinkeby-and-kiln-testnets-after-merge","publishDate":"2022-06-22T12:39:28","id":10800,"type":null,"title":"Ethereum devs to shutter Ropsten, Rinkeby and Kiln testnets after the merge","category":["THE MERGE"],"content":["<span data-v-f87c67ca=\"\">The Ethereum core development team has announced a plan to shut down three of its existing testnets — Ropsten, Kiln and Rinkeby — after <\/span><span data-v-f87c67ca=\"\">the so-called merge. <\/span>","<span data-v-f87c67ca=\"\">Testnets are blockchain clones used for experimental purposes. In the Ethereum ecosystem, multiple testnets exist that allow developers to deploy applications and check for bugs free of cost before those are deployed on the mainnet. <\/span>","<span data-v-f87c67ca=\"\">However, testnets are deprecated periodically when they are no longer needed. The merge is one such milestone where the Ethereum developers have decided to leave behind three of its testnets.<\/span>","<span data-v-f87c67ca=\"\">The merge is a highly anticipated event during which the Ethereum blockchain will swap consensus mechanisms, shifting from from proof of work to proof of stake. The merge is tentatively estimated to occur in <a href=\"https:\/\/wenmerge.com\/\" data-v-f87c67ca=\"\">September<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Post-merge, the team plans to maintain only two existing testnets, Goerli and Sepolia, an official <a href=\"https:\/\/blog.ethereum.org\/2022\/06\/21\/testnet-deprecation\/\" data-v-f87c67ca=\"\">blog post<\/a> stated.<\/span>","<span data-v-f87c67ca=\"\">Among the <\/span><span data-v-f87c67ca=\"\">deprecated testnet list is <a href=\"https:\/\/www.theblock.co\/post\/150864\/ethereums-ropsten-proof-of-stake-test-merge-goes-live\" data-v-f87c67ca=\"\">Ropsten<\/a>, the oldest testnet on Ethereum since that was launched in 2016. Notably, Ropsten went through a test <\/span><span data-v-f87c67ca=\"\">merge earlier this month. Still, Ethereum core developers will wind it down in the fourth quarter of 2022, sometime after the merge.<\/span>","<span data-v-f87c67ca=\"\">Kiln, a testnet spun in early 2022 for the purpose of providing a post-merge testing environment, and be the first to shut down immediately the merge.<\/span>","<span data-v-f87c67ca=\"\">The final name on the list is Rinkeby, a testnet operating since 2017, that is set to close down next year. <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the announcement, Rinkeby will not be an “accurate staging environment for mainnet” after the merge and therefore the core devs will halt it anywhere between the second and third quarter of 2023.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goerli","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"September","content":"DATE"},{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ropsten","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}