{"summary":"Sam Bankman-Fried&#x27;s lawyers already had their work cut out for them. Then he contacted a possible witness in his criminal case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208521\/walking-himself-into-prison-bankman-frieds-texts-may-harm-his-legal-defense","publishDate":"2023-02-06T05:30:41","id":10816,"type":null,"title":"&#x27;Walking himself&#x27; into prison: Bankman-Fried’s texts may harm his legal defense","category":["POLICY"],"content":["Sam Bankman-Fried just threw a wrench in his criminal trial before it even started.","A judge barred Bankman-Fried from using “encrypted or ephemeral” messaging apps like Signal until a court hearing this week after reviewing evidence that Bankman-Fried used the platform to contact a potential witness. Bankman-Fried is also temporarily banned from contacting employees of his collapsed crypto exchange FTX and trading firm Alameda Research unless a lawyer is present.","“It's not that hard for someone in his position to become involved in obstruction of justice, which could add substantially to his sentence if he is convicted,” said attorney Benjamin Brafman, who has represented well-known clients including Sean “P. Diddy” Combs, “Pharma Bro” Martin Shkreli&nbsp;and accused mafia members. “He also runs the risk of alienating the judge even before the case begins.”","The former billionaire’s bail terms were tightened last week, at least temporarily, after prosecutors <a href=\"https:\/\/www.theblock.co\/post\/206462\/prosecutor-seek-to-restrict-bankman-frieds-bail-terms-after-apparent-attempts-to-influence-witnesses\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">accused<\/span><\/a> Bankman-Fried of reaching out to a potential witness in his criminal case.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> The issue will be argued on Thursday to determine whether the restrictions will continue. <\/span>Regardless, the former CEO's behavior could attract additional charges that would add further time to a possible sentence.","By seeking to establish what Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/206845\/bankman-fried-sought-constructive-relationship-with-criminal-case-witness\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">called<\/span><\/a> a “constructive relationship” with a former employee, legal experts say he runs the risk of weakening his defense, sullying his relationship with the judge presiding over the case or even attracting new criminal charges.","“It appears to have been an effort to have both the defendant and [the witness] sing out of the same hymn book,” U.S. District Court Judge Lewis Kaplan wrote in a court filing.&nbsp;","Court filings show Bankman-Fried contacted new FTX CEO John Ray III and FTX's general counsel, who may be the person referred to in court documents as Witness-1, in the months after his arrest. FTX.US General Counsel Ryne Miller, who is not named in court documents, did not respond to a request for comment.","“I would really love to reconnect and see if there’s a way for us to have a constructive relationship, use each other as resources when possible, or at least vet things with each other,” Bankman-Fried wrote in a message to the potential witness. A Bankman-Fried spokesperson declined to comment.","The former FTX boss even offered to meet with Ray in New York City in a Jan. 2 email, the day before he pleaded not guilty to criminal charges.","Bankman-Fried faces criminal charges for his alleged mishandling of customer funds at FTX, among other misdeeds, and could spend the rest of his life in jail if convicted on all counts. The former crypto billionaire’s attempts at backchanneling could put him in even deeper legal jeopardy, legal experts say.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“This guy is walking himself into a lengthy prison sentence in a federal penitentiary because he just can't stay home, shut up and let his lawyers do their job,” said Anthony Sabino, a St. John’s University law professor.&nbsp;","Contacting a potential witness is just the latest Bankman-Fried move to leave legal experts scratching their heads. Since FTX filed for bankruptcy protection in November, Bankman-Fried has taken an atypical approach to his legal predicament.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The 30-year-old founder went on a media blitz before his arrest in December. Some of his comments have already appeared in court filings.","Now under house arrest in California, Bankman-Fried has attacked FTX’s new chief executive in the press and reposted skeptical tweets about the exchange’s bankruptcy case.","“The judge is going to have a tremendous lack of trust in SBF,” said Michael Popok, a lawyer and co-host of the “LegalAF” podcast. “It cuts down on his credibility and the ability of his lawyers to maneuver in a courtroom in front of this judge.”","Bankman-Fried’s lawyers argued that any messages to Miller and Ray were benign, but the judge took a different view.&nbsp;","“A possible motive for such an attempt is evident from the fact that Witness-1 undisputedly was a witness to some events likely to be at issue in this case, and defendant is facing the possibility of a long prison term,” Kaplan wrote.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","It is not unusual for a defendant’s lawyers to act as a buffer and contact a potential witness in a criminal case, legal experts noted. Reaching out directly to witnesses, however, is hardly the norm.","“The only place where that happens is in the movies,” Sabino said.","The move could be seen as witness tampering — or even an admission of guilt.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“If he is smart, he would let his lawyers contact any prospective witnesses, rather than he himself trying to do it. The other thing he has to be careful about is anything he says to a witness might be used against him in the trial if it's considered an admission by the government,” Brafman said. “The worst-case scenario might be him inadvertently saying something to a witness which suggests that he might be trying to influence that testimony.”","Sabino was blunter in his advice for Bankman-Fried, whose trial is slated for October.","“Stay home, watch cable TV, keep your mouth shut. Don't email. Don't talk to anybody. Don't pick up the phone. Just shut your mouth and do nothing. That's what you have lawyers for,” Sabino said.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Sabino","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Michael Popok","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Ray","content":"PERSON"},{"type":"Ryne Miller","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Miller","content":"PERSON"},{"type":"Jan. 2","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Anthony Sabino","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sean “P. Diddy” Combs","content":"PERSON"},{"type":"1","content":"DATE"},{"type":"Benjamin Brafman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"St. John’s University","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Pharma Bro” Martin Shkreli","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"California","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Brafman","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["COURT HEARINGS","FTX"],"authors":["Stephanie Murray","The Block"]}