{"summary":"Web3 Foundation (W3F) director Ryan Zurrer has left the firm, as his work “has been completed” after the closing of the foundation&#x27;s second token sale for","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34834\/web3-foundation-director-departs-after-the-closing-the-second-polkadot-token-sale","publishDate":"2019-08-05T17:06:30","id":10812,"type":null,"title":"Web3 Foundation director departs after closing the second Polkadot token sale","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">Web3 Foundation (W3F) director Ryan Zurrer has left the firm, as his work “has been completed” after the closing of the foundation's second token sale for its Polkadot project, according to a company statement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">W3F brought Zurrer on board in October 2017, immediately after its first Polkadot token sales of $144 million. The former venture capitalist was tasked to lead the second token sale, according to the statement. <\/span>","<span data-v-f87c67ca=\"\">In June, Polkadot <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/06\/27\/polkadots-sale-of-500000-tokens-closes-successfully-foundation-says-in-nod-of-confidence-to-1-2b-valuation\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">conducted its second private sale<\/span><\/a><span data-v-f87c67ca=\"\"> under W3F's management and distributed 500,000 DOTs at a “successful” value, said W3F to The Block. The project is said <\/span><a href=\"https:\/\/www.theblockcrypto.com\/tiny\/parity-ceo-says-polkadot-1bn-valuation-is-a-fair-number\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">to be valued at $1.2 billion<\/span><\/a><span data-v-f87c67ca=\"\"> after this second sale.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Zurrer started his role at the foundation while he was still a partner at the famed blockchain venture capital firm Polychain Capital. In the statement, Zurrer said he will return to the venture capital space and help grow early-stage blockchain startups. <a href=\"https:\/\/www.coindesk.com\/former-polychain-partner-ryan-zurrer-is-leaving-web3-to-start-his-own-dao?utm_source=twitter&amp;utm_medium=coindesk&amp;utm_term=&amp;utm_content=&amp;utm_campaign=Organic%20\" data-v-f87c67ca=\"\">According to a Coindesk report<\/a>, he plans to reignite the decentralized autonomous organization (DAO) project by starting a company that also assumes the name The DAO. Zurrer also shares a draft of the new DAO project's white paper on his GitHub page.&nbsp;<\/span>","Polkadot, the Swiss-based foundation's first project, aims to facilitate cross-chain messaging between different blockchains, allowing for interoperability and scalability.&nbsp; Its first client is set to launch by the end of the year.&nbsp;","<span data-v-f87c67ca=\"\">“With the success of the DOT sale, the success of the Web3 Summit and the Web3 Foundation in a strong position organizationally, it’s an appropriate time to step away,\" said Zurrer in the statement. \"I will migrate and go back to what my primary passion is - deploying capital and helping early-stage teams build new concepts in the space.\"&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"Zurrer","content":"PERSON"},{"type":"Ryan Zurrer","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"October 2017","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"},{"type":"$144 million","content":"MONEY"}],"hashtag":[],"authors":["Celia Wan","The Block"]}