{"summary":"Bitcoin&#x27;s network mining difficulty has risen by more than 9%, marking the biggest difficulty adjustment since last summer. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131110\/bitcoin-network-difficulty-all-time-high-2022","publishDate":"2022-01-20T22:15:03","id":10811,"type":null,"title":"Bitcoin network difficulty jumps more than 9% to new all-time high","category":["BITCOIN"],"content":["Bitcoin's network mining difficulty has risen by more than 9%, marking the biggest difficulty adjustment since last summer.&nbsp;","According to BTC.com, which tracks mining difficulty data, the difficulty rose by 9.32%. Today's jump was the second thus far in 2022, following January 8's 0.41% adjustment.","The Bitcoin network's mining difficulty level adjusts every 2,016 blocks, on a roughly two-week schedule. Difficulty changes are designed to maintain an average block time of 10 minutes as the hash rate rises and falls, though actual per-block times often vary.","With the exception of a 1.49% decrease on November 28, the difficulty has seen steady growth since last summer's mining crackdown in China, which <a href=\"https:\/\/www.theblockcrypto.com\/post\/110425\/bitcoin-largest-difficulty-drop-ever\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">plunged the difficulty<\/a> by its largest share on record as miners in that country shut down their equipment and decamped to countries like the United States and Kazakhstan.&nbsp;","As noted on The Block's Data Dashboard, the mining hash rate has fully recovered since late August, with the US emerging as the world's current mining powerhouse.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","According to an analysis from The Block Research, the total bitcoin hash rate has increased by about 18 EH\/s since December 11. Notably, Foundry USA -- owned by the Digital Currency Group subsidiary -- has increased by approximately 5 EH\/s in that time.","This represents the fastest rate of growth among the world's top mining pools. The second-fastest growth during that period came from F2Pool, which expanded its collective mining power by 3.3 EH\/s.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"0.41%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December 11","content":"DATE"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"November 28","content":"DATE"},{"type":"January 8","content":"DATE"},{"type":"1.49%","content":"PERCENT"},{"type":"9.32%","content":"PERCENT"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"last summer","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}