{"summary":"Decentral Bank DAO plans to use a basket of market-leading stablecoins as USN&#x27;s underlying collateral.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155108\/decentral-dao-pauses-use-of-near-tokens-for-minting-usn-stablecoin","publishDate":"2022-06-30T11:38:16","id":10829,"type":null,"title":"Decentral Bank pauses use of NEAR tokens for minting USN stablecoin","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">Decentral Bank, a decentralized autonomous organization (DAO), working on the USN stablecoin, stated it has temporarily paused allowing the use of NEAR tokens in the minting process of USN, a pivot away from its <a href=\"https:\/\/www.theblock.co\/post\/143275\/usn-stablecoin-goes-live-on-near-protocol\" data-v-f87c67ca=\"\">original design<\/a>. The DAO cited shaky crypto market conditions for its decision.<\/span>","<span data-v-f87c67ca=\"\">The developers of USN stablecoin, announced <\/span><span data-v-f87c67ca=\"\">version 2 (v2.0) update of their project on Thursday. <\/span><span data-v-f87c67ca=\"\">USN is a decentralized stablecoin soft-pegged to the US dollar and exists on Near Protocol, a scalable Layer 1 blockchain<\/span>","USN was originally built similarly to TerraUSD (UST), the stablecoin that collapsed and brought down its sister token Luna (LUNA) with it. After UST collapsed, it led to concerns that stablecoins built in the same way would suffer similar fates.","<span data-v-f87c67ca=\"\">From Thursday, t<\/span><span data-v-f87c67ca=\"\">he stablecoin will exclusively be minted with <a href=\"https:\/\/www.theblockcrypto.com\/post\/100614\/tether-usdt-stablecoin-polkadot-kusama\" data-v-f87c67ca=\"\">USD Tether<\/a> (USDT), the largest centralized stablecoin issued by Tether.&nbsp;<\/span><span data-v-f87c67ca=\"\">This means that USN will be 1:1 collateralized and redeemed with USDT, rather than NEAR, the native token of the Near Protocol blockchain as originally decided.<\/span>","<span data-v-f87c67ca=\"\">Furthermore, the DAO said it is planning to use a basket of market-leading stablecoins as its underlying collateral, including USDT, USDC and DAI. The team claimed that this strategy will make the stablecoin more resilient in current market scenario.<\/span>","<span data-v-f87c67ca=\"\">\"We concluded that given the uncertainty around how long this bear market will last and the selling pressure induced by tightening macro conditions, the v1.0 could, potentially, pose a risk that $USN could become undercollateralized from sustained volatility of the NEAR price,\" Decentral Bank DAO <\/span>said in a media statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"Decentral Bank","content":"ORGANIZATION"},{"type":"USN","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Decentral Bank DAO","content":"ORGANIZATION"},{"type":"$USN","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"}],"hashtag":["TETHER"],"authors":["Vishal Chawla","The Block"]}