{"summary":"As the losses mount up for Tiger Global Management, the once-voracious tech investor is now getting bruised by its bets on blue-chip crypto businesses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227879\/tiger-global-crypto-losses","publishDate":"2023-04-24T06:46:43","id":10822,"type":null,"title":"Tiger Global Management discloses 20% loss after crypto writedowns","category":["DEALS"],"content":["As the losses mount for Tiger Global Management, the once-voracious tech investor is now getting bruised by bets on blue-chip crypto businesses.","Tiger recently informed investors that its $12.7 billion venture fund, which it launched late in 2021, had produced a paper loss of 20%, net of management fees, as of December last year, according to a <a href=\"https:\/\/www.theinformation.com\/articles\/tiger-global-managements-12-7-billion-venture-fund-records-20-loss?utm_medium=organic_social&amp;utm_source=twitter&amp;utm_content=push_copy&amp;utm_campaign=article_post&amp;rc=8uivwi\" data-v-f87c67ca=\"\">report<\/a> from The Information citing private documents.","Half a dozen major crypto startups contributed to the loss. An investment in Sam Bankman-Fried’s FTX, which collapsed in November, was entirely wiped out, while Tiger also marked down investments in NFT marketplace OpenSea, Bored Ape Yacht Club creator Yuga Labs, payments firm MoonPay, decentralized wireless network startup Helium and Sam Altman’s eyeball scanning protocol Worldcoin, according to the report.","Tiger had invested $126.8 million in OpenSea — an investment now worth just $30.2 million, according to The Information.","That chimes with wider reporting that shares in prized crypto companies are available on secondary market platforms at steep discounts. On March 8, The Block <a href=\"https:\/\/www.theblock.co\/post\/217937\/opensea-consensys-among-prized-crypto-startups-with-shares-available-at-big-discounts\" data-v-f87c67ca=\"\">reported<\/a> that some OpenSea shares were trading at a 51% discount on Birel.io, a secondary marketplace.","After emerging as one of the tech sector’s biggest investors, Tiger has suffered a period of sustained losses. In November 2022, its flagship hedge fund <a href=\"https:\/\/www.ft.com\/content\/9d63cd68-7a6e-4cb5-ab41-4b92562b79b4\" data-v-f87c67ca=\"\">reported losses<\/a> of 54.7% for the year. Later, in March, The Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/tiger-global-writes-down-venture-funds-bets-by-33-in-2022-3f9f6ade\" data-v-f87c67ca=\"\">reported<\/a> that Tiger had marked down the value of its private funds by an average of 33% in 2022.","Tiger’s venture fund has to date invested more than $11 billion, according to The Information report. Close to a quarter of that cash has been plowed into a category of companies described as enterprise software as a service, with fintech and crypto being Tiger’s second and third biggest investment categories, respectively.","In total, Tiger has backed around 250 startups through the venture fund, of which more than 170 were worth less in December last year than when the firm first invested — suggesting crypto price tags are falling at least somewhat in line with the wider tech startup space.","Tiger did not immediately respond to a request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"December last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$126.8 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"Tiger","content":"ORGANIZATION"},{"type":"$12.7 billion","content":"MONEY"},{"type":"33%","content":"PERCENT"},{"type":"$11 billion","content":"MONEY"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"51%","content":"PERCENT"},{"type":"Tiger Global Management","content":"ORGANIZATION"},{"type":"$30.2 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"54.7%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"March 8","content":"DATE"},{"type":"November 2022","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}