{"summary":"Jump Capital&#x27;s Peter Johnson offers his take on the year ahead for the bitcoin and crypto space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128666\/crypto-starts-to-eat-the-world-peter-johnson-of-jump-capitals-2022-predictions","publishDate":"2021-12-28T13:59:33","id":10831,"type":null,"title":"Crypto &#x27;starts to eat the world&#x27;: Peter Johnson of Jump Capital&#x27;s 2022 predictions","category":["OP-ED"],"content":["<em data-v-f87c67ca=\"\">Peter Johnson is a Partner at Jump Capital, where he leads their investments in the fintech and crypto sectors.&nbsp;<\/em>","At the beginning of 2021, we predicted that it would be a seminal year for crypto and made <a href=\"https:\/\/www.theblockcrypto.com\/post\/89756\/outlook-2021-peter-johnson-predictions\" data-v-f87c67ca=\"\">10 bold predictions<\/a>.","Over the year, the majority of these predictions came true - including bitcoin hitting $50,000, stablecoins hitting $100 billion in supply, exponential growth in DeFi, an ETF being approved, and the rise of crypto IPOs and M&amp;A.","We believe 2022 will be another big year for crypto, with the overarching theme being widespread adoption - including widespread adoption of stablecoins, DAOs, fast chains, L2s, and cross-chain applications. As crypto is more widely adopted, traditional companies and investors will adapt, ushering in a future where crypto is embedded across a variety of industries and most investors are involved in the crypto market in some way.","For 2022, we have 10 predictions across 5 major themes – all related to this overarching theme of widespread adoption.","<b data-v-f87c67ca=\"\">Stablecoin supply reaches $500 billion <\/b>","At Jump Capital, we have been longtime believers in stablecoin adoption and included the rise of stablecoins in both our 2020 and 2021 predictions when stablecoin supply was at ~$6 billion and ~$30 billion, respectively. Now with supply greater than $140 billion, we see no signs of stablecoin adoption slowing, and believe there will eventually be several trillion dollars in stablecoins.","In 2022, we are particularly excited about the growth of stablecoins for non-trading use cases. Historically, stablecoins have primarily been used for trading, but 2022 will be the year that their usage for cross-border payments and as a safe-haven asset in countries with unstable currencies becomes more apparent and a larger driver of growth.<b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">USDC, UST take market share from Tether<\/b>","Within the stablecoin market, we believe most of the growth will come from USDC and UST as they establish themselves as the dominant centralized and decentralized stablecoins. As USDC and UST grow, the market share of USDT (Tether) will fall significantly.","<b data-v-f87c67ca=\"\">DAOs grow exponentially as coordination vehicles <\/b>","Decentralized autonomous organizations (DAOs) enable global coordination of individuals utilizing blockchain-based governance. DAOs can serve many purposes, including managing the operations and capital of blockchain projects (MakerDAO), managing capital for investments (The LAO), managing the usage of gaming assets (YGG DAOs), coordinating cultural groups (Friends With Benefits), or coordinating to purchase assets (Constitution DAO).","We believe that the Constitution DAO was a watershed moment for DAOs as its raise of over $40 million showed the ability for thousands of people to coordinate their capital and efforts for a joint goal. In 2022, we believe DAOs will gain significant traction as the next-generation way of coordinating global investments and communities. Trying to buy the Constitution was just the start; In 2022, there will be multiple $100 million-plus DAO capital raises, and they will set their sights on even bigger objectives.<b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">DAO governance designs and infrastructure mature<\/b>","We are in an early phase of both defining and agreeing on the full scope of DAOs as crypto networks have been iterating on governance models to manage network decisions and communities.","We believe in 2022, many crypto networks will have made significant progress in their decentralization journey and governance models will mature to enable effective management of these DAOs. This maturation will be enabled by enhanced DAO tooling and infrastructure that we plan to see this year.","<b data-v-f87c67ca=\"\">Fast chains continue to grow &amp; L2’s take off<\/b>","2021 saw the rise of fast, low-cost blockchains such as Solana, Terra, and Avalanche, Ethereum sidechains such as Polygon, and the early rollout of Ethereum L2 scaling solutions using optimistic and Zk rollups.","We are bullish on all these solutions, as transactions increasingly migrate off L1 Ethereum and an exponentially growing pie creates room for a variety of winners (at least in the near term). The enhanced user experience from these fast chains and L2s is a key piece of enabling mainstream adoption and will be a critical part of crypto’s narrative in 2022. Eventually, winners (and losers) will be sorted out between these, but in 2022 we’re betting on strong growth across the board.<b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">Cross-chain usage become seamless<\/b>","Currently, L1 and L2 blockchains ecosystems are rather siloed, and bridging between ecosystems is often either complex or relies on a centralized exchange. In 2022, solutions such as Wormhole will make huge strides in enabling assets and information to seamlessly move across blockchains, and applications will smoothly route transactions to the best blockchain to serve their purpose.","<b data-v-f87c67ca=\"\">Financial institutions, advisors and fintechs offer crypto products<\/b>","Crypto has finally become too big for financial institutions, financial advisors, and traditional fintechs to ignore, and 2022 will be the year that crypto products are rolled out to their customers. Enabling buying\/selling of crypto will become table stakes, and more forward-looking companies will also offer crypto-backed loans, high-yield savings accounts, and other products that leverage crypto.","As more financial institutions offer crypto products, we also expect product offerings to mature, and are particularly bullish on the growth of the options market which enables market participants to take more nuanced hedging or speculative positions and are used to create structured products. Options currently represent less than 2% of crypto derivatives volume, and we expect this percentage to grow significantly in 2022.<br data-v-f87c67ca=\"\">\n<b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">Gaming studios go all-in on crypto<\/b>","2021 saw the rise of crypto-based “play-to-earn” gaming led by Axie Infinity where players can earn real economic value from their in-game activities. The success of Axie and other blockchain-based games has led to a flood of crypto games – many of which are not very good games and are unlikely to have staying power.","However, we believe the concept of games that enable true ownership will become foundational to the future of gaming. In 2022, we expect traditional game studios to move into crypto gaming, launching the next generation of crypto games that offer not just economic incentives and true ownership, but also first-rate gameplay.<b data-v-f87c67ca=\"\"><\/b>","<b data-v-f87c67ca=\"\">Crypto starts to eat the world<\/b>","Early adopters of the internet were dubbed “internet companies” or “dot-coms,”, but these monikers stopped being used as internet adoption moved across the adoption cycle.","Similarly, over time most companies will adopt crypto in some way – by offering crypto products, utilizing stablecoins as payment rails, enabling Web3 wallet logins, utilizing NFTs, having token curated communities, or a variety of other use cases. In 2022, we expect to see strong adoption of crypto across many industries, and also expect this trend to further accelerate in future years.","<b data-v-f87c67ca=\"\">Record amount of VC money deployed into crypto<\/b>","In the first 9 months of 2021, $15 billion was invested in crypto startups, representing an almost 5x increase to the total capital invested into crypto startups in 2020. This might seem like a lot but is only around 3% of the total venture capital invested during this period.","During 2022, we expect to see a significant increase in venture dollars going into crypto, as traditional VC funds both rush to allocate to crypto-native projects and get pulled in by the convergence of crypto and a variety of other industries. This increase in crypto VC funding will also be powered by multiple $1 billion-plus crypto funds that have recently been announced, and several more that will be announced soon. In this industry awash in capital, the most successful investors will be those that provide much more than just money – helping to build products, provide liquidity, recruit talent, scale organizations, develop communities, attract users, and participate in governance.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"several trillion dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"$100 million","content":"MONEY"},{"type":"first 9 months of 2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"$50,000","content":"MONEY"},{"type":"$6 billion","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"$140 billion","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"Terra","content":"LOCATION"},{"type":"$500 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"UST","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"Peter Johnson","content":"PERSON"},{"type":"$30 billion","content":"MONEY"}],"hashtag":[],"authors":["Contributor Network","The Block"]}