{"summary":"Revolut, the UK-based digital bank, has irked its own board over the way it reacted to reports that auditor BDO was unable to verify a significant part of its 2021 revenues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223925\/revolut-audit-accounts-board-response","publishDate":"2023-03-30T04:54:30","id":10838,"type":null,"title":"Revolut’s board frustrated by its audit response: Financial Times","category":["COMPANIES"],"content":["Revolut, the UK-based digital bank, has irked its own board over the way it handled reports that auditor BDO was unable to verify a significant part of its 2021 revenues.","Revolut’s long-delayed accounts showed the startup achieved its first full-year of profit in 2021, but BDO cast some doubt on the numbers. Specifically, it said in the accounts that it was unable to verify three-quarters of the revenue Revolut had reported — equal to $765 million — and warned that some information may be “materially misstated.”","Then, Revolut issued a public statement insisting that BDO had confirmed the “financial statements give a true and fair view” of its finances, and hired Schillings, the lawyers, to ram the point home, according to a <a href=\"https:\/\/www.ft.com\/content\/9d2f6193-3e43-4fc9-ab9e-772cd7a8201d\" data-v-f87c67ca=\"\">report<\/a> today from the Financial Times.","That report also said that some of Revolut’s board members — which include city grandees Martin Gilbert and Michael Sherwood — felt the startup's statement was an “overreaction” and suggests staff had failed to understand BDO’s opinion properly.","Crypto trading is a significant business line for Revolut, and the startup capitalized on a boom in retail trading in 2021.","Revolut did not immediately respond to a request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Gilbert","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Schillings","content":"LOCATION"},{"type":"BDO","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$765 million","content":"MONEY"},{"type":"Michael Sherwood —","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}