{"summary":"A co-founder of U.S. bitcoin miner Layer1 has filed suit against the firm amid a dispute about the purchase of a power plant in West Texas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/83354\/layer1-cofounder-bitcoin-mine-lawsuit","publishDate":"2020-11-03T08:49:23","id":10837,"type":null,"title":"Layer1 co-founder sues U.S. bitcoin mine operator over $20M power plant purchase dispute","category":["LEGAL"],"content":["One of the co-founders of U.S. bitcoin mine operator Layer1 has filed suit against the company in West Texas, court records show.","Jakov Dolic, a co-founder and former president of Layer1, is suing the U.S. bitcoin miner operator to vest his title on Layer1's $20 million power plant in West Texas.&nbsp;","The case, <a href=\"https:\/\/www.pacermonitor.com\/public\/case\/36920287\/Dolic_v_Layer1_Technologies,_Inc\" data-v-f87c67ca=\"\">filed<\/a> on October 30 to the Western District Court of Texas, shines a light on internal issues at the U.S. bitcoin miner operator, which claimed to be backed by billionaire investor Peter Thiel and has ambitions to become the largest mining operation in North America.&nbsp;","The case docket shows the court has granted an <em data-v-f87c67ca=\"\">ex parte<\/em> motion filed by Dolic for an injunction against Layer1' from selling the power plant that's at the center of the dispute. The motion was granted on October 30.","When reached for comment, Layer1 CEO Alex Liegl told The Block:&nbsp;\"The complaint filed by Dolic is without&nbsp;merit. It is filled with factual allegations that are inaccurate and false. On a related note, the relief it seeks (i.e., to prevent the sale of the substation) is based on a factual premise that is false, as we are not planning to sell the substation.\"","Dolic co-founded Layer1 with Liegl and Ivan Kirillov in June 2019, who took on the roles as CEO and CTO, respectively. Dolic alleged in the complaint that Liegl told him at the time that he could raise \"significant funding\" from U.S. venture capitalists — to the tune of $50 million — in order to fund the mining operation.","The two then began negotiations to purchase a 30-acre substation that has a 100 megawatt-hour capacity to support its envisioned mining business, per the complaint.","Dolic then alleged in the filing that \"because Liegl had not raised funds from any venture capitalists\" at that point, he and Liegl agreed that Dolic would pay for the acquisition using his own funds and would be reimbursed after Liegl completed a successful fundraise.&nbsp;","Dolic claimed he wired $16 million in July 2019 to Hodl Ranch for the entire acquisition of the Texas power station in Ward County. In October, he said he paid another $3.5 million via his own funds to Hodl Ranch for an additional 50 megawatt-hour capacity as an expansion, which cost $7 million in total.&nbsp;","But in both deals, Layer1 was the entity that held the legal title of the substation. And according to Dolic's allegations, from 2019 to 2020, Liegl failed to raise capital from venture capitalists — and that Dolic himself continued making personal contributions totaling $6.4 million.","\"Other than Dolic’s contributions, Layer1 had no source of income or capital,\" the complaint read. \"On information and belief, Liegl never contributed any money of his own or raised any money from venture capitalists.\"","In October 2019, Layer1 announced to various media outlets that it raised a $50 million Series A round with backing from Peter Thiel and Shasta Ventures. However, in August 2020, reports from <a href=\"https:\/\/www.theblockcrypto.com\/daily\/75873\/bitcoin-miner-layer1-pitch-deck\" data-v-f87c67ca=\"\">The Block<\/a> and <a href=\"https:\/\/www.coindesk.com\/bitcoin-miner-layer1-50m-investment-pitch\" data-v-f87c67ca=\"\">CoinDesk<\/a> revealed that Layer1 only raised $23 million at that time, which was contributed by its own founding team.","Since this September, Dolic alleged, he has \"grown concerned that Liegl was not appropriately utilizing the funds\" he provided.&nbsp;\"In fact, Dolic later learned that Liegl had been paying himself significant 'consulting' fees without Dolic’s knowledge or authorization,\" the filing contended.","The relationship between the two began to further deteriorate to the point that Dolic alleged he was \"cut off\" access to all aspects of Layer1 and his approximately 75% of common shares were \"forfeited.\"&nbsp;","Dolic claimed his departure caused Layer1 to \"experience an acute cash crisis\" and alleged that Liegl's response was to sell the Texas substation.&nbsp;","\"On Monday, October 26, 2020, Liegl flew to Texas... to sell the Substation for pennies on the dollar, with the intention of completing the transactions before Dolic can protect his rights,\" Dolic alleged in the complaint.","Per the complaint, Dolic is demanding a jury trial to divest Layer1's name and transfer the substation's title to him.&nbsp;","<a title=\"View Dolic v.s. Layer1 on Scribd\" href=\"https:\/\/www.scribd.com\/document\/482711540\/Dolic-v-s-Layer1#from_embed\" data-v-f87c67ca=\"\">Dolic v.s. Layer1<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe id=\"doc_24272\" class=\"scribd_iframe_embed\" title=\"Dolic v.s. Layer1\" src=\"https:\/\/www.scribd.com\/embeds\/482711540\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-b1OTuOrOSTj9gNuG6m4S\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.75\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"West Texas","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"August 2020","content":"DATE"},{"type":"October 30","content":"DATE"},{"type":"Shasta Ventures","content":"ORGANIZATION"},{"type":"Ivan Kirillov","content":"PERSON"},{"type":"Dolic","content":"PERSON"},{"type":"$3.5 million","content":"MONEY"},{"type":"Western District Court","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Monday, October 26, 2020","content":"DATE"},{"type":"$23 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"June 2019","content":"DATE"},{"type":"Dolic","content":"ORGANIZATION"},{"type":"Liegl","content":"PERSON"},{"type":"North America","content":"LOCATION"},{"type":"July 2019","content":"DATE"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"75%","content":"PERCENT"},{"type":"Alex Liegl","content":"PERSON"},{"type":"Hodl Ranch","content":"ORGANIZATION"},{"type":"MichaelPatrickMcSweeney","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Jakov Dolic","content":"PERSON"},{"type":"$6.4 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"CTO","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Ward County","content":"LOCATION"},{"type":"$16 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}