{"summary":"Ethereum scaling solutions Arbitrum and Optimism have steadily increased in transaction count since the beginning of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177378\/ethereum-layer-2-protocols-arbitrum-and-optimism-continue-to-gain-traction","publishDate":"2022-10-14T19:36:44","id":10832,"type":null,"title":"Ethereum Layer 2 protocols Arbitrum and Optimism continue to gain traction","category":["DEFI"],"content":["Ethereum-based Layer 2 protocols Arbitrum and Optimism have seen a steady increase in transactions since the beginning of the year.","Both protocols set new all-time highs on transaction counts in September.","One key distinction between the two is that Arbitrum does not have a governance token. Optimism formally announced the launch of its token at the end of April and released it the following month.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/transaction-count-daily-7dma\/embed\" title=\"Transaction Count on Optimistic Rollups (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Optimism’s transaction count began rising leading up to the governance token <a href=\"https:\/\/www.theblock.co\/linked\/143635\/ethereum-scaling-startup-optimism-confirms-governance-token-as-part-of-broader-shift\" data-v-f87c67ca=\"\">announcement<\/a>. The protocol then saw a surge when the token formally went live across exchanges on May 31. This led to interest and speculation for a potential Arbitrum token launch.","Since then, both platforms have seen a steady rise in transactions and have continued an upward trajectory.","Arbitrum currently has the highest Total Value Locked (TVL) across all Layer 2 networks, with roughly 50% market share. Optimism has a market share of approximately 30%, <a href=\"https:\/\/l2beat.com\/scaling\/tvl\/\" data-v-f87c67ca=\"\">according to L2Beat.<\/a>","By contrast, the next closest Layer 2 by market share is Metis, which has a <a href=\"https:\/\/l2beat.com\/scaling\/tvl\/\" data-v-f87c67ca=\"\">2.71% market share.<\/a> Metis announced a 26-week-long<a href=\"https:\/\/metisdao.medium.com\/metisdao-foundation-announces-metis-marathon-builder-incentive-program-94b424e5553b\" data-v-f87c67ca=\"\"> incentive program<\/a> on July 26, leading to a roughly 60% increase in its TVL. However, it has since tapered off to just above the level it was at prior to the announcement.&nbsp;","Layer 2 networks inherit security from Ethereum and are intended to reduce the cost of transactions. Arbitrum and Optimism are Optimistic Rollups, which have gained the most traction to date.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 26","content":"DATE"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Metis","content":"ORGANIZATION"},{"type":"2.71%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"May 31","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Arbitrum","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","ETHEREUM","OPTIMISM"],"authors":["Mike Truppa","The Block"]}