{"summary":"Users will be able to link their Ready Player Me avatars to their Unstoppable Domains profile.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201482\/unstoppable-domains-ready-player-me-to-connect-metaverse-avatars-with-domain-names","publishDate":"2023-01-12T09:00:50","id":10847,"type":null,"title":"Unstoppable Domains, Ready Player Me to connect metaverse avatars with domain names","category":["METAVERSE"],"content":["Unstoppable Domains introduced a new integration that will allow users to add their Ready Player Me avatars to their Unstoppable Domains profiles.&nbsp;","Ready Player Me is a platform where metaverse users and gamers create avatars that are usable across different worlds such as Mona, Somnium Space, Spatial and The Nemesis. By linking it with their Unstoppable Domain profiles, they will be able to set their avatar as a profile picture and use it in thousands of compatible platforms supported by Unstoppable Domains.","With the rise of platforms such as the Ethereum Name Service (ENS) and Unstoppable Domains, interest has grown around web3 domains and digital identity.","Unstoppable Domains claims it has registered over 3.1 million domains since launch. The company compares web3 domains to web extensions like \".com\" or \".info\" launched as smart contracts on public blockchains.","The domains are then stored in a wallet by the owner as an NFT and can be used in lieu of a wallet address for making financial transactions and for enabling decentralized websites.&nbsp;","For proponents of web3 domain usage, the idea is to create a system where people have a persistent identity online as they do in real life. They point to certain advantages of having such a system including being able to log into different services with the same account (and not needing to remember different passwords) and the potential to reduce online harassment.","Despite potential privacy and security concerns, investors are on board. Unstoppable Domains <a href=\"https:\/\/www.theblock.co\/post\/159736\/unstoppable-domains-clinches-unicorn-status-in-65-million-series-a-round\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">raised<\/a> $65 million at a $1 billion valuation during its Series A round last July.&nbsp;","Trying to come up with one system that works across the board is the challenge here. Last year Unstoppable joined with several other domain naming systems including Tezos Domains and the Polkadot Name System to form the <a href=\"https:\/\/www.theblock.co\/post\/181751\/web3-domain-alliance-starts-with-unstoppable-domains-bonfida-as-founding-members\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Web3 Domain Alliance<\/a>. The group aims to address challenges around domain fraud and naming collisions as the services’ popularity grows.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Somnium Space","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$65 million","content":"MONEY"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Mona","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Web3 Domain Alliance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}