{"summary":"Xue Lee and Brenda Chunga raised over $1.7 billion from investors around the world in what the SEC calls a pyramid scheme.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275014\/sec-charges-founders-of-1-7-billion-hyperfund-scheme-with-fraud","publishDate":"2024-01-29T19:22:01","id":10850,"type":null,"title":"SEC charges founders of $1.7 billion HyperFund scheme with fraud","category":["LEGAL"],"content":["The Securities and Exchange Commission has charged $1.7 billion HyperFund scheme with fraud and unregistered securities offering, the agency announced.&nbsp;","Xue Lee and Brenda Chunga — also known as Sam Lee and Bitcoin Beautee, respectively — raised over $1.7 billion from investors around the globe from June 2020 through early 2022, the SEC said in a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2024-11\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">press release<\/a> on Monday.","Lee and Chunga advertised HyperFund as an opportunity to invest in profitable mining operations, but in reality, it was a pyramid scheme with no real sources of revenue, the SEC alleged, adding that both Lee and Chunga \"knew or were reckless in not knowing.\" In 2022, the project imploded and investors lost their money.","“This case illustrates yet again how noncompliance in the crypto space facilitates schemes where promoters capitalize on the promise of easy money, without providing the detailed investor protection disclosures required by the registration provisions of the federal securities laws,” said Gurbir S. Grewal, director of the SEC’s division of enforcement.","The SEC filed the complaint in federal district court in the District of Maryland, charging Lee and Chunga with violating the anti-fraud and registration provisions of the federal securities laws. The U.S. Attorney’s Office for the District of Maryland also pressed criminal charges against Lee and Chunga.&nbsp;","Chunga has already pleaded guilty to conspiracy to commit securities fraud and wire fraud. He also agreed to settle the charges and pay disgorgement and civil penalties in amounts that the court will determine.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Lee","content":"PERSON"},{"type":"June 2020","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Lee","content":"PERSON"},{"type":"Xue Lee","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Chunga","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Bitcoin Beautee","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"the District of Maryland","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Brenda Chunga","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"U.S. Attorney’s Office","content":"ORGANIZATION"},{"type":"District of Maryland","content":"LOCATION"},{"type":"$1.7 billion","content":"MONEY"}],"hashtag":["CRIME"],"authors":["Anna Baydakova","The Block"]}