{"summary":"The Cosmos-based, EVM-compatible Layer 1 has launched its public testnet — paving the way for a targeted mainnet release in Q2.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271883\/berachain-public-testnet-mainnet-q2","publishDate":"2024-01-11T09:05:09","id":10853,"type":null,"title":"Berachain unveils Artio public testnet ahead of anticipated mainnet in Q2","category":["LAYER 1S"],"content":["Berachain, an Ethereum Virtual Machine-compatible Layer 1 blockchain built on the Cosmos SDK, has rolled out its public test network named Artio.","Berachain’s previous private testnet, hosted under a non-disclosure agreement with various partners, saw around 50 teams deploy contracts in a month, according to a statement. “There are currently 30+ native teams building on Berachain with 100+ teams from other networks planning on deploying on testnet and mainnet, including name brands like Pendle, Redacted, Sudoswap, Abracadabra, and many more,” Berachain said.","Upon the final launch expected later this year, Berachain will also be supported by custodians, cross-chain messaging and bridging protocols, and data availability solutions, it added. Berachain’s mainnet planned for the second quarter of this year.","<a href=\"https:\/\/www.theblock.pro\/research\/searching-for-alpha-berachain-215595\" data-v-f87c67ca=\"\">Berachain<\/a> utilizes a variant of delegated proof of stake consensus called “proof of liquidity” — an attack resistance mechanism meant to harmonize staking and align incentives between security and liquidity, according to the team behind the project.","Contrary to typical proof of stake chains, where (outside of external liquid staking service providers) users have to choose between contributing to security by staking with a validator or providing on-chain liquidity on a DeFi platform, proof of liquidity means users can only contribute toward network security by first doing the “work” of providing liquidity to a set of DeFi primitives, the team said.","In Berachain’s tri-token system, users earn BGT staking tokens by providing liquidity to on-chain protocols such as a native DEX or stablecoin lending platform. “BGT is naturally illiquid and soulbound, and cannot be market bought, only earned,” with rewards controlled via validators and the network’s governance process, the team added. However, BGT can be burned for the network’s native gas token, bera, in a one-way process.","Validators then direct the staking rewards back into the Berachain ecosystem across multiple supported protocols to keep the network liquid. Users delegating BGT tokens to validators earn fees in honey tokens — Berachain’s native stablecoin — from protocols on the network, as well as “bribes” from the validators they are delegated to.","“Through their contribution to liquidity on the chain, users bootstrap its security,” the team said, while also earning rewards. Protocols passing governance votes can integrate their smart contracts into Berachain's liquidity pool, attracting liquidity at reduced costs and driving capital efficiency. And “for Cosmos validators, there’s an opportunity to attract new capital and delegates from the EVM world, which has typically been a major restriction for growth in the Cosmos ecosystem,” it added.","Berachain’s bear-themed crypto project is run by a group of pseudonymous co-founders known as Homme Bera, Dev Bear, Papa Bear and Smokey the Bera. Its now 30-strong team has prior experience at projects such as Sui, Polygon, Mantle, Coinbase, Chainlink and Aave.","Under development since late 2021, Berachain is the co-founders' main foray into the industry after the NFT project “Bong Bears” and other associated collections.","Speaking to The Block in April last year, Smokey the Bera originally anticipated the public testnet — and potentially the mainnet — to launch in 2023, amid <a href=\"https:\/\/www.theblock.co\/post\/227344\/berachain-funding-new-layer-1-blockchain\" data-v-f87c67ca=\"\">raising $42 million<\/a> in a private token round led by Polychain Capital. Participants also included Hack VC, Shima Capital, Robot Ventures and Goldentree Asset Management, among others.","Berachain began raising for the round shortly after the <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">FTX crypto exchange collapsed<\/a> in November 2022, with the deal closing \"not too long after,\" Smokey the Bera told The Block at the time.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cosmos validators","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"BGT","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Papa Bear","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$42 million","content":"MONEY"},{"type":"November 2022","content":"DATE"},{"type":"Berachain","content":"ORGANIZATION"},{"type":"Sudoswap","content":"LOCATION"},{"type":"second quarter of this year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Bera","content":"PERSON"},{"type":"Bera","content":"LOCATION"},{"type":"April last year","content":"DATE"},{"type":"Goldentree Asset Management","content":"ORGANIZATION"},{"type":"Abracadabra","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Homme Bera","content":"ORGANIZATION"},{"type":"Sui","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Pendle","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Berachain","content":"LOCATION"},{"type":"Mantle","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Berachain","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":["COSMOS","ETHEREUM"],"authors":["James Hunt","The Block"]}