{"summary":"The European Central Bank (ECB) has developed a proof of concept for a partially anonymous central bank digital currency that seeks to merge privacy with","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50882\/ecb-builds-proof-of-concept-for-anonymous-transactions-using-central-bank-backed-digital-currency","publishDate":"2019-12-18T00:30:07","id":10851,"type":null,"title":"ECB builds proof-of-concept for anonymous transactions using central bank-backed digital currency","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The European Central Bank (ECB) has developed a proof of concept for a partially anonymous central bank digital currency that seeks to merge privacy with compliance.<\/span>","<span data-v-f87c67ca=\"\">In its latest <a href=\"https:\/\/www.ecb.europa.eu\/paym\/intro\/publications\/pdf\/ecb.mipinfocus191217.en.pdf?3824c3f26ad2f928ceea370393cce785\" data-v-f87c67ca=\"\">report<\/a>, published Tuesday, the ECB outlines details of the initiative, which was developed on the DLT platform Corda and builds on past proofs-of-concept based around the technology.<\/span>","<span data-v-f87c67ca=\"\">The concept centers around the use of&nbsp;<\/span><span data-v-f87c67ca=\"\">anonymity vouchers for users who are making smaller transactions and, as such, wouldn't need to reveal their identities. Larger transactions, however, wouldn't be extended the same degree of privacy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The proof of concept shows that it is possible, using the Corda platform, to build a simplified CBDC payment system that safeguards users’ privacy for lower-value transactions, while still ensuring that higher-value transactions are subject to mandatory AML\/CFT checks,” the report says.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">What's in the PoC?&nbsp;<\/strong>","<span data-v-f87c67ca=\"\">The PoC envisions four parties – the central bank, two intermediaries, and an anti-money laundering (AML) authority – each represented by a node that operates a Corda distributed application (CorDapp). The central bank does not directly onboard users, issue or distribute CBDC units, or oversee CBDC transfers. Rather, intermediaries would maintain relationships with users, process transactions, and keep records of the ledger.<\/span>","<span data-v-f87c67ca=\"\">The key element of the proposed system is the use of the so-called anonymity vouchers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Every user is identified in the network with a pseudonym and allocated a certain number of vouchers per month, the report explains. When users process low-value transactions, they can spend the vouchers to avoid revealing their personal information to either the central bank or the intermediaries. <\/span>","<span data-v-f87c67ca=\"\">When they make high-value transactions that exceed the allowed amount of anonymous transfers, on the other hand, a dedicated AML authority will oversee transaction data and ensure that they meet current compliance standards &nbsp;and monitor for money laundering and terrorism financing.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Areas of improvement<\/strong>","The ECB's report digs into some of the challenges that the proposed system would face if ever implemented as a real-world use case.","<span data-v-f87c67ca=\"\">First, there needs to be a better transaction validation mechanism to allow for more confidentiality. Currently, to validate a transfer, an intermediary needs to check all past transactions associated with that CBDC unit. To address this problem, the bank proposes introducing a “chain snipping” to reduce the amount of information made visible to unrelated parties.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Second, users need to be able to access their balances and initiate transactions when their assigned intermediary is unavailable. This improvement can be achieved by enabling users to store their keys in their private device such as a mobile phone wallet or allowing other intermediaries in the system to process their CBDC units.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Additionally, the bank believes there need to be more privacy-enhancing techniques, interoperablity with a real-time gross settlement (RTGS) system as well as a deep analysis of the PoC’s practical scalability.<\/span>","<b data-v-f87c67ca=\"\">Uncertain regulatory environment<\/b>","It has long been debated whether the ECB should issue its own digital currency so that the public can enjoy a cheap and easy way to make payments.&nbsp;Last week, ECB President Christine Lagarde said during a press conference that the ECB should accelerate its efforts in digital currency and get \"ahead of the curve\" on stablecoins or tokens that are intended to be tied to the value of government-issued currencies.&nbsp;","But there has also been considerable resistance from EU authorities.","In early December, EU financial ministers at <a href=\"https:\/\/www.nytimes.com\/reuters\/2019\/12\/05\/technology\/05reuters-eu-ecofin-cryptocurrencies.html\" data-v-f87c67ca=\"\">asserted<\/a> that no global stablecoins should be allowed until their legal, regulatory, and oversight risks have been fully addressed. ECB former president Jean-Claude Trichet also affirmed his tough stance against digital currencies.","During a Beijing conference in November, he <a href=\"https:\/\/www.scmp.com\/print\/business\/banking-finance\/article\/3037099\/bitcoin-not-real-and-any-purchase-amounts-speculation-says\" data-v-f87c67ca=\"\">said<\/a>: “I am strongly against bitcoin, and I think we are a little complacent…The currency itself is not real, with the characteristics that a currency must have.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"RTGS","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"CFT","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"Jean","content":"PERSON"},{"type":"Claude Trichet","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Corda","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Corda","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"AML","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","ECB"],"authors":["Yilun Cheng","The Block"]}