{"summary":"Crypto trading and lending firm Genesis Trading reported losses of around $7 million &quot;across all counterparties&quot; after it hedged and sold collateral on Tuesday ahead of anticipated market volatility in the wake of a liquidity crunch at FTX. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184920\/genesis-reports-losses-of-around-7-million-after-hedging-against-market-volatility","publishDate":"2022-11-09T14:12:58","id":10859,"type":null,"title":"Genesis reports losses of around $7 million after hedging against market volatility","category":["COMPANIES"],"content":["Crypto trading and lending firm Genesis Trading <a href=\"https:\/\/twitter.com\/GenesisTrading\/status\/1590391027214725120\" data-v-f87c67ca=\"\">reported losses<\/a> of around $7 million \"across all counterparties\" that include Alameda Research after it hedged and sold collateral on Tuesday in anticipation of market volatility following a liquidity crunch at FTX.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe company reiterated that it had no material exposure to FTX's native token or \"any other tokens issued by centralized exchanges.\" It said that 95% of the collateral on its lending book is comprised of USD, stablecoins, bitcoin and ether.&nbsp;","Although Genesis said it did trade with FTX, it said the relationship did not extend to lending.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Our business ops, including lending and trading across spot and derivatives, continue to run normally and our balance sheet remains strong,\" the company wrote on Twitter. \"Yesterday was a top 5 volume day for our derivatives business as clients turn to us during volatile market conditions to manage their risk.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Genesis","content":"PERSON"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Kristin Majcher","The Block"]}