{"summary":"Binance will replace Capitual with a local payment provider to be announced soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152931\/binance-says-it-is-changing-brazil-payments-partner-for-better-customer-solution","publishDate":"2022-06-18T07:13:49","id":10855,"type":null,"title":"Binance says it is changing Brazil payments partner for better customer solution","category":["EXCHANGES"],"content":["Binance will switch from its current payments partner in Brazil to provide a better solution for customers, it <a href=\"https:\/\/www.binance.com\/pt-BR\/blog\/payment\/binance-muda-parceiro-de-pagamentos-para-garantir-saques-de-clientes-421499824684904025\" data-v-f87c67ca=\"\">said in a blog post<\/a> on Friday.","It will replace Capitual with a local payment provider to be announced soon, make the transition in coming weeks and take steps to ensure users are not adversely affected.","For deposits and withdrawals, users can transact via Binance's P2P system, and for direct purchase of cryptocurrencies, Pix and bank transfers are available through an alternative provider, it said. For withdrawals, there is also a “sell to card” option available for Visa, and if in doubt, users can access Binance support or chat.","Still, <a href=\"https:\/\/www.coindesk.com\/business\/2022\/06\/17\/binance-suspends-withdrawals-and-deposits-in-brazil-following-new-central-bank-policy\/\" data-v-f87c67ca=\"\">CoinDesk reported today<\/a> that Binance had suspended deposits and withdrawals in Brazilian reals via Pix. Binance said on the platform that deposits via Pix were experiencing instability because of a policy change made by the central bank, without providing further details, according to the report.","Binance is in the process of acquiring local brokerage company Sim;paul, which is already authorized by the central bank and the Securities and Exchange Commission.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Millard","The Block"]}