{"summary":"Crypto market data from March indicates that exchange volumes are getting closer to rivaling the volumes seen on markets owned and operated by NYSE Group.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102740\/februarys-crypto-exchange-volumes-made-up-nearly-half-the-volumes-on-nyse-groups-stock-markets","publishDate":"2021-04-23T15:40:40","id":10867,"type":null,"title":"February&#x27;s crypto exchange volumes made up nearly half the volumes on NYSE Group&#x27;s stock markets","category":["CAPITAL MARKETS"],"content":["Crypto exchange volumes have surged over the last few months, and are getting closer to rivaling volumes being clocked in by the world's largest equities exchange.","Exchange volumes tracked by The Block across legitimate venues hit their highest level ever this month. Thus far in April, crypto exchanges saw more than $1.26 trillion, slightly higher than the previous month's $1.17 trillion in volumes.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Exchange Volume (The Block Legitimate Index)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The surge in prices across crypto-assets helped fuel this growth in volumes. Indeed, trading volumes in the crypto world are a much higher percentage of the much larger equity market, according to data compiled by The Block.&nbsp;","Per data from Cboe Global Markets and CryptoCompare, crypto exchange volumes as a share of volumes by New York Stock Exchange-owned venues soared from 8% in September 2020 to a high of 49% in February 2021. NYSE, the largest exchange venue, makes up about 20-25% of US equity exchange trading, depending on the day.","New York Stock Exchange, which operates 5 stock exchanges including NYSE, NYSE American, NYSE Arca, NYSE National, and NYSE Chicago, clocked in $3.325 trillion in total volume across its venues in March 2021 compared to the crypto market's $1.17 trillion in exchange volumes.","Binance, the largest exchange in the crypto market by volumes, equaled 23% of NYSE volumes across all 5 of its venues in March.&nbsp;","","","HideNotSlide, a <a href=\"https:\/\/twitter.com\/HideNotSlide\" data-v-f87c67ca=\"\">well-followed anonymous commentator<\/a> on market structure and exchange businesses, said the data backs up the \"look how big crypto is getting relative to legacy finance\" market perspective.&nbsp;","Dave Weisberger, who runs CoinRoutes, a crypto trading technology firm, was surprised by the data, noting \"those percentages are stunningly high to my eyes.\"","Part of it can be explained by the unique elements of the crypto market, he reckoned.","\"It really shows how much turn-over there is,\" Weisberger said. \"From a trading perspective, there is much more velocity, meaning much more trading, than in other assets.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"NYSE Chicago","content":"ORGANIZATION"},{"type":"September 2020","content":"DATE"},{"type":"Dave Weisberger","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Cboe Global Markets","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"NYSE National","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"$3.325 trillion","content":"MONEY"},{"type":"March 2021","content":"DATE"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Weisberger","content":"PERSON"},{"type":"$1.26 trillion","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"February 2021","content":"DATE"},{"type":"49%","content":"PERCENT"},{"type":"$1.17 trillion","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"NYSE Arca","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Frank Chaparro","The Block"]}