{"summary":"True Names Ltd, the company behind the Ethereum Name Service (ENS), has filed a lawsuit against GoDaddy and others.\nThe suit alleged that GoDaddy wrongly declared the domain expired and sold it to another party.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168579\/company-behind-ethereum-name-service-files-lawsuit-over-domain-sale","publishDate":"2022-09-08T12:15:04","id":1086,"type":null,"title":"Company behind Ethereum Name Service files lawsuit over domain sale","category":["Legal"],"content":["The company behind the Ethereum Name Service (ENS) has filed suit against domain registrar GoDaddy over the sale of a Web domain it previously owned.","According to the complaint, filed by True Names Ltd., GoDaddy is alleged to have wrongly declared the eth.link domain expired and sold it to a third party. Plaintiffs True Names and Virgil Griffith — who is serving a prison term following a conviction earlier this year — characterized this as a breach of contract.&nbsp;","The complaint was filed in the U.S. District Court for the District of Arizona. In addition to GoDaddy, two other companies, Dynadot and Manifold Finance, were named in the complaint. The plaintiffs are being represented by the law firm Crowell &amp; Moring LLP.","<span data-v-f87c67ca=\"\">ENS offers decentralized names that can serve as a replacement for default alphanumeric Ethereum wallet addresses. <\/span><span data-v-f87c67ca=\"\">The service, widely used within Ethereum apps, relied on the web domain eth.link to allow the use of crypto addresses in Web browsers. This was the domain ENS had registered with GoDaddy.<\/span>","<span data-v-f87c67ca=\"\">While True Name used the eth.link domain for its operations, the company said in its complaint that it was first registered in 2018 by Griffith, a former employee. <\/span>","<span data-v-f87c67ca=\"\">Griffith later drew headlines after being accused in 2019 of helping North Korea violate sanctions after Griffith gave a speech during a crypto conference in that country. He was <a href=\"https:\/\/www.theblock.co\/linked\/141690\/ethereum-dev-virgil-griffith-sentenced-to-63-months-for-north-korean-crypto-expedition\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">ultimately sentenced<\/a> to 63 months in prison.<\/span>","<span data-v-f87c67ca=\"\">True Names said that it initially failed to renew the domain name in July 2022 because Griffith was in prison, but they claimed that&nbsp;<\/span><span data-v-f87c67ca=\"\">during the grace period after the domain expiry, a re-registration was performed by a service called easyDNS on True Names’ behalf, as<\/span><a href=\"https:\/\/discuss.ens.domains\/t\/eth-link-expiry\/13899\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> announced<\/span><\/a><span data-v-f87c67ca=\"\"> on the ENS community forum.<\/span>","GoDaddy allegedly proceeded to declare the domain expired despite that re-registration on August 25, per the complaint, which alleges that GoDaddy subsequently sold the&nbsp;<span data-v-f87c67ca=\"\">eth.link domain to Dynadot on September 3 without notifying the plaintiffs. The complaint claimed that the plaintiffs tried to reach GoDaddy multiple times but the requests were ignored.<\/span>","“We are disappointed to see the acts of GoDaddy, and feel misled due to being told that the domain would be returned to the registry, only to find out it was purportedly sold to another domain provider before we had the chance to claim it,” Nick Johnson, founder of ENS told The Block in a statement.","<span data-v-f87c67ca=\"\">After the sale, Dynadot allegedly resold the domain for $852,000 in a September 3 auction to Manifold Finance, a cryptocurrency project. On September 3, Manifold<\/span><a href=\"https:\/\/twitter.com\/foldfinance\/status\/1566270613341147136?t=6IrZ2IzvHubiwyfnWKD0Qg&amp;s=19\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> confirmed<\/span><\/a><span data-v-f87c67ca=\"\"> its acquisition of the domain on Twitter.<\/span>","<span data-v-f87c67ca=\"\">Since losing access to the eth.link domain, True Names has<\/span> <a href=\"https:\/\/twitter.com\/eth_limo\/status\/1565540952818814976\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">begun using<\/span><\/a><span data-v-f87c67ca=\"\"> another domain called eth.limo as the new Web gateway for ENS names.<\/span>","<span data-v-f87c67ca=\"\">GoDaddy and Dynadot did not immediately respond to The Block's request for comment. True Names and Manifold Finance were not immediately available for comment when reached.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">A copy of the complaint is embedded below:&nbsp;<\/em>","<a title=\"View Complaint on Scribd\" href=\"https:\/\/www.scribd.com\/document\/592846369\/Complaint#from_embed\" data-v-f87c67ca=\"\">Complaint<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe frameborder=\"0\" height=\"600\" src=\"https:\/\/www.scribd.com\/embeds\/592846369\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-4N1OGztOmeS28ybwfloi\" title=\"Complaint\" width=\"100%\" data-auto-height=\"false\" data-aspect-ratio=\"0.7729220222793488\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":["ETHEREUM"]}