{"summary":"In the world of Web3 and cryptocurrency, it is clear that women are lagging behind men. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153888\/bridging-the-gap-making-a-space-for-women-in-web3-and-crypto","publishDate":"2022-06-24T09:00:45","id":1086,"type":null,"title":"Bridging the Gap: Making a Space for Women in Web3 and Crypto","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">In the world of Web3 and cryptocurrency, it is clear that women are lagging behind men.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Twice as many men as women invest in crypto, while few female leaders currently work in the space. Only 35% of women engaged in at least one crypto-related activity in the past year versus nearly 50% of men, according to a recent <\/span><a href=\"https:\/\/www.mastercard.com\/news\/perspectives\/2022\/digital-payment-landscape-2022\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">global consumer survey<\/span><\/a><span data-v-f87c67ca=\"\"> by Mastercard. Today’s crypto climate and market volatility creates a joint opportunity to look ahead and reflect on how to give more people the choice to <\/span><a href=\"https:\/\/www.careerarc.com\/job-search?job_group=74012\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">explore and engage<\/span><\/a><span data-v-f87c67ca=\"\"> in the crypto ecosystem and better understand the power of blockchain as an underlying technology to build a better future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Web3 and crypto have potential to reshape the global financial industry, but to maximize that potential, we need to ensure that everyone has the opportunity to participate.&nbsp; For digital assets to become an integral part of the global financial system, they have to be accessible to everyone. To ensure inclusion and to foster true innovation, women and underrepresented minorities must have a seat at the table.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The majority of women have heard of cryptocurrency and digital assets, but many are still unsure about understanding its ins and outs, according to Mastercard’s New Payment Index. Only 58% of women are aware of non-fungible tokens (NFTs) versus 75% of men. In the past year, only 9% of women made a payment using cryptocurrency versus 18% of men. Women are also less likely to say they are considering using crypto for a purchase in the coming year.<\/span>","<span data-v-f87c67ca=\"\">But at the same time, we know that women’s appetite for more crypto knowledge is strong. The 75% of women who are familiar with crypto agree that they would use the digital currency more if they understood it better. Mastercard plans to provide women with the tools to safely take the first step and explore Web3 and crypto.<\/span>","<b data-v-f87c67ca=\"\">Women are starting to step in<\/b>","<span data-v-f87c67ca=\"\">Over the last several years, we have seen some great groups emerge that are connecting and supporting women who are working in Web3 and crypto while also encouraging more to join the space. <\/span><a href=\"https:\/\/www.shefi.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SheFi<\/span><\/a><span data-v-f87c67ca=\"\">, for example, helps women go from “crypto curious” to “crypto confident.” Other groups that are doing excellent work in helping to bridge the gap include <\/span><a href=\"https:\/\/www.herhouse.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">HerHouse<\/span><\/a><span data-v-f87c67ca=\"\">, a Web3 ecosystem of women and non-binary builders; <\/span><a href=\"https:\/\/linktr.ee\/Blu3_dao\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Blu3 DAO<\/span><\/a><span data-v-f87c67ca=\"\">, which promotes learning through hackathons and technical workshops; and <\/span><a href=\"https:\/\/boysclub.vip\/learn\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Boys Club<\/span><\/a><span data-v-f87c67ca=\"\">, which founders call a “no bro zone for the crypto curious.”&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Bridging the gender gap<\/b>","<span data-v-f87c67ca=\"\">At Mastercard, we want to do our part to help bridge this significant gender gap and engage more women and non-binary individuals to work in Web3 and crypto. So, we decided to partner with the Web3 community to launch The Belle Block™.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The initiative will educate, empower and train the women of Mastercard and beyond in crypto, blockchain and NFTs. It will serve to make women and non-binary people confident in their knowledge and eager to pursue a <\/span><a href=\"https:\/\/www.careerarc.com\/job-search?job_group=74012\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">career in crypto.<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Through both in-person and online gatherings, networking sessions, panels and other events, we will advocate for balanced laws and regulations and foster collaboration on product innovations that empower women and other minorities. Our approach will focus on business growth, educational awareness, leadership, legal and regulatory advocacy, and building an entrepreneurship network and mindset.<\/span>","<span data-v-f87c67ca=\"\">There is significant momentum with existing groups today. We kicked off our first event this week at Mastercard’s New York City Tech Hub, where a panel of four accomplished female leaders in Web3 spoke, including Deana Burke, co-founder of Boys Club; Cynthia Huang, founder of Blu3 DAO, Maggie Love, founder of SheFi; and Candace Stewart of HerHouse.<\/span>","<span data-v-f87c67ca=\"\">We are excited to partner with other organizations that are already doing great work in the space and to offer new programming together in the coming weeks and months. For crypto and blockchain to truly succeed, it has to work for everyone. At The Belle Block, we know that through education and collaboration we will increase inclusion, deliver more innovation and discover exciting new opportunities in the world of digital currencies.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTo learn more, check out our article <a href=\"https:\/\/www.mastercard.com\/news\/press\/2022\/june\/mastercard-spearheads-new-web3-and-crypto-community-alongside-leading-industry-voices-to-make-emerging-tech-more-accessible-to-women-and-non-binary-individuals\/\" data-v-f87c67ca=\"\">here<\/a>.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Mastercard<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City Tech Hub","content":"LOCATION"},{"type":"9%","content":"PERCENT"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"The Belle Block","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Maggie Love","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"Cynthia Huang","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Deana Burke","content":"PERSON"},{"type":"HerHouse","content":"ORGANIZATION"},{"type":"Boys Club","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"58%","content":"PERCENT"},{"type":"35%","content":"PERCENT"},{"type":"Candace Stewart","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}