{"summary":"What does this mean for me? This section provides an overview of the new and updated features which are now available on the new Lisk Mainnet v3.  New","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115256\/meet-the-new-lisk-mainnet","publishDate":"2021-08-23T09:04:17","id":10866,"type":null,"title":"Meet the New Lisk Mainnet","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">We are proud to announce that on August, 21st 2021, at around 2:00 pm CEST, the Lisk Mainnet v2 successfully completed the <\/span><a href=\"https:\/\/lisk.com\/blog\/development\/announcing-lisk-mainnet-v3-migration\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">migration to Lisk Mainnet v3<\/span><\/a><span data-v-f87c67ca=\"\">. This comprises the biggest protocol change to ever occur on the Lisk blockchain, and marks the beginning of a whole new era for the Lisk network as it eliminates all weaknesses of the Lisk Mainnet v2 related to fees, consensus algorithm and accounts, and also prepares and improves the Lisk blockchain for the upcoming interoperability release in many regards.<\/span>","<span data-v-f87c67ca=\"\">This section provides an overview of the new and updated features which are now available on the new Lisk Mainnet v3.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Did you know that with Lisk v3 you have an extremely secure new account address system, with built-in error detection for typos? No need for account initialization anymore! We give our community complete security.<\/span><\/i>","<span data-v-f87c67ca=\"\">The old address and ID system has been replaced and all existing accounts have been automatically migrated to the new system. This introduces a longer address, decreasing user experiences of address collisions and ensuring that such addresses are resistant to preimage attacks. In addition, this also eliminates the need to initialize a new account, as was required in the old Mainnet v2, ensuring that every new account in the Lisk network is completely secure right from the start.<\/span>","<span data-v-f87c67ca=\"\">The following credentials of your account have not changed:<\/span>","<span data-v-f87c67ca=\"\">Hence, you can still use your old passphrase to log in to Lisk Desktop as before.<\/span>","<span data-v-f87c67ca=\"\">The following credentials of your account have changed:<\/span>","<span data-v-f87c67ca=\"\">The new address is created from the public key as described in the illustration shown below. Please note that we now append a checksum of the address at the end of the address, which provides support for detecting typos in the account addresses.<\/span>","","","","","<span data-v-f87c67ca=\"\">All important information about the new address and ID system can be found in the blog post: <\/span><a href=\"https:\/\/lisk.com\/blog\/research\/new-lisk-id-system\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The new Lisk ID System<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Did you know that with Lisk v3 transactions are up to 98,64% cheaper? Instead of 0.1 LSK the new minimum fee is now only 0.00136 LSK. We give our community competitive fees.<\/span><\/i>","&nbsp;","<span data-v-f87c67ca=\"\">Our new dynamic fee system has replaced the static fees, making transactions significantly cheaper to execute. This also enables users to overwrite their transactions in the transaction pool (i.e. transactions which are not included in the block yet), by setting a higher fee and the same nonce as the transaction they wish to overwrite. The minimum fee of each transaction is always burned to secure the system against various game theoretic attack scenarios.<\/span>","","","<span data-v-f87c67ca=\"\">More information about dynamic fees can be found in the following blog posts: <\/span><a href=\"https:\/\/lisk.com\/blog\/research\/lisks-dynamic-fee-system\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk's Dynamic Fee System<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/lisk.com\/blog\/research\/static-vs-dynamic-fee-system-comparison-both\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Static vs Dynamic Fee System: A Comparison of Both<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Did you know that with Lisk v3 the DPoS consensus algorithm received an entire revamp? A fair network, new validators, and no more cartels. We give our community fair decentralization.<\/span><\/i>","<span data-v-f87c67ca=\"\">The DPoS consensus algorithm has been completely redesigned to improve the decentralization and security of the validator selection algorithm. This includes a completely new voting mechanism, two additional randomly selected delegates per forging round, and a new punishing mechanism for malicious delegates.<\/span>","<span data-v-f87c67ca=\"\">Please note that all previous votes for delegates have <\/span><b data-v-f87c67ca=\"\">not<\/b><span data-v-f87c67ca=\"\"> been migrated to the new Lisk Mainnet v3, and every account needs to recast their votes for their favorite delegates.<\/span>","<span data-v-f87c67ca=\"\">More information can be found in the following blog post: <\/span><a href=\"https:\/\/lisk.com\/blog\/development\/actions-required-upcoming-mainnet-migration#votedelegate\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Actions Required for the Upcoming Mainnet Migration<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">A list of the most important features in the DPoS new consensus algorithm can be viewed in the illustration below:<\/span>","<br data-v-f87c67ca=\"\">\n","","<span data-v-f87c67ca=\"\">More information about the new DPoS can be found in the blog post: <\/span><a href=\"https:\/\/lisk.com\/blog\/research\/3-new-dpos-lips-changing-voting-system-lisk\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">3 New DPoS LIPs: Changing the Voting System for Lisk<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","&nbsp;","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Did you know that with Lisk v3 you can send a transaction and be certain it never gets reverted again? This is the way forward for future cross-blockchain transactions on our blockchain application platform. We give our community total immutability.<\/span><\/i>","&nbsp;","<span data-v-f87c67ca=\"\">With sidechains and interoperability coming into the Lisk ecosystem in the next major release of Lisk Core v4, blockchain applications will be able to facilitate transactions across multiple blockchains. To achieve this, it is necessary to guarantee that a sent transaction can never be reverted again. That is precisely what our newly implemented Lisk BFT consensus algorithm is doing.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">A block will become final on average after 155 blocks or approximately 26 minutes after it was included in the blockchain. If you want to be sure a block is finalized, compare its block height and the finalized height of the blockchain (e.g. check the finalized height with <\/span><a href=\"https:\/\/lisk.com\/wallet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk Desktop<\/span><\/a><span data-v-f87c67ca=\"\"> or the community-maintained explorers <\/span><a href=\"https:\/\/lisk.observer\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk Observer<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/liskscan.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk Scan<\/span><\/a><span data-v-f87c67ca=\"\">). If the block height of the block is lower than the finalized height, it is 100% ensured that this block and all its contained transactions are final and cannot be reverted or changed again.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">All important information about the new Lisk BFT consensus can be found in the following blog posts: <\/span><a href=\"https:\/\/lisk.com\/blog\/research\/introducing-byzantine-fault-tolerance-consensus-lisk\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Introducing Byzantine Fault Tolerance Consensus for Lisk<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/lisk.com\/blog\/research\/bft-consensus-exploring-pre-votes-and-pre-commits\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Exploring Pre-Votes and Pre-Commits<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Did you know that with Lisk v3 over 1,000,000 transactions can be processed every day? That is a vast increase of 5 times more than with the previous version. We give our community greater scalability.<\/span><\/i>","<span data-v-f87c67ca=\"\">The performance of Lisk Core has been improved in multiple ways. The main improvements are listed below:<\/span>","<br data-v-f87c67ca=\"\">\n","","<span data-v-f87c67ca=\"\">Further details about the performance improvements of Lisk Core v3 can be found in the blog post <\/span><a href=\"https:\/\/lisk.com\/blog\/development\/benchmarking-lisk-core-v3.0.0-against-lisk-core-v2.1.6-0\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Benchmarking Lisk Core v3.0.0 against Lisk Core v2.1.6<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Besides the extensive protocol improvements, there have also been large improvements in the code base of the Lisk SDK, which is also utilized in version 3 of Lisk Core.<\/span>","<span data-v-f87c67ca=\"\">The overall development experience has improved greatly by creating a completely modular architecture of the blockchain application, whereby all different components of the application can be changed, extended, or replaced by the developer.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Lisk Commander has become a powerful CLI tool, which greatly simplifies the creation of blockchain applications. For example, it is now possible to bootstrap a completely new blockchain application with one single command, or to generate skeletons for new modules, plugins, or assets for a blockchain application.<\/span>","<br data-v-f87c67ca=\"\">\n","","<span data-v-f87c67ca=\"\">For more information about the new architecture, and how to develop blockchain applications with the Lisk SDK, check out the <\/span><a href=\"https:\/\/lisk.com\/documentation\/lisk-sdk\/index.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Lisk SDK documentation<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lisk Commander","content":"ORGANIZATION"},{"type":"Lisk Mainnet","content":"PERSON"},{"type":"Lisk blockchain","content":"PERSON"},{"type":"Lisk BFT","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"98,64%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Lisk Core","content":"ORGANIZATION"},{"type":"Lisk SDK","content":"ORGANIZATION"},{"type":"Lisk Desktop","content":"ORGANIZATION"},{"type":"Upcoming Mainnet Migration","content":"ORGANIZATION"},{"type":"Lisk","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}