{"summary":"Despite the growth of DeFi, Bitcoin remained the preferred vehicle for most illicit financing in crypto, especially among online scams. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/131580\/money-laundering-via-crypto-rose-30-in-2021-with-defi-laundering-up-20x-chainalysis","publishDate":"2022-01-26T08:00:20","id":10862,"type":null,"title":"Money laundering via crypto rose 30% in 2021, with DeFi laundering up 20x: Chainalysis","category":["DEFI"],"content":["New research from blockchain forensics firm Chainalysis finds that money laundering in crypto grew from $6.6 billion to $8.6 billion between 2020 and 2021.","While centralized exchanges with weak know-your-customer controls still account for the lion's share of wallet addresses used in illicit crypto, decentralized platforms shot up by almost 2,000% in terms of value received from illicit addresses.","","","\"Undeniably the theme this year is the way that DeFi has become a space for criminals,” Kim Grauer, Chainalysis' head of research, told The Block. Mostly, however, illicit money traveling through DeFi originated in DeFi hacks. Bad actors seldom used DeFi as a means for laundering external money; instead, they turned to Bitcoin.","The biggest source of illicit funding remained fairly typical <a href=\"https:\/\/www.theblockcrypto.com\/post\/115858\/russian-pyramid-scheme-netted-over-1-5-billion-in-bitcoin-throughout-eastern-europe-says-chainalysis\" data-v-f87c67ca=\"\">scams aimed at collecting crypto<\/a>.","“This dataset is very conservative, so these are all investigated crimes,” Grauer explained, detailing that it took more than general suspicion to be included in the report. It is perhaps for this reason that the firm identified money laundering as \"just 0.05% of all cryptocurrency transaction volume in 2021.\"","Moreover, almost all of the data related to \"cryptocurrency-native\" crime, rather than offline crime converted into cryptocurrency to be laundered. The dataset also did not include privacy tokens like Monero, which remain resistant to this sort of analysis.","Holding true throughout the years is that a surprising amount of illicit money still goes through a small roster of 5 major centralized crypto exchanges. Chainalysis' most recent report did not name those exchanges, nor would Grauer, but a similar study in 2019 <a href=\"https:\/\/www.theblockcrypto.com\/linked\/53138\/chainalysis-traced-2-8-billion-in-bitcoin-being-sent-to-crypto-exchanges-by-criminals-last-year\" data-v-f87c67ca=\"\">named Binance and Huobi<\/a>.&nbsp;","A major <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106282\/ofac-blockchain-analytics-tools-chainalysis\" data-v-f87c67ca=\"\">contractor for the U.S. government<\/a> as well as for crypto platforms worldwide, Chainalysis saw its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109515\/chainalysis-valuation-hits-4-2-billion-after-100-million-series-e-fundraise\" data-v-f87c67ca=\"\">valuation exceed $4 billion<\/a> in a 2021 funding round.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$6.6 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Chainalysis","content":"PERSON"},{"type":"Grauer","content":"PERSON"},{"type":"Monero","content":"PERSON"},{"type":"2,000%","content":"PERCENT"},{"type":"0.05%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"Kim Grauer","content":"PERSON"},{"type":"Huobi","content":"PERSON"},{"type":"$8.6 billion","content":"MONEY"}],"hashtag":[],"authors":["Kollen Post","The Block"]}