{"summary":"The partnership sees Alchemy Pay&#x27;s on and off-ramp integrate with Checkout.com&#x27;s Visa and Mastercard channels.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241872\/alchemy-pay-checkout","publishDate":"2023-07-28T05:43:01","id":10879,"type":null,"title":"Alchemy Pay continues expansion through Checkout.com partnership","category":["CRYPTO INFRASTRUCTURE"],"content":["Fiat-crypto payment gateway Alchemy Pay today announced a partnership with parent processor Checkout.com.","The partnership sees Alchemy Pay's on and off-ramp integrate with Checkout.com's Visa and Mastercard channels — with its NFT Checkout also slated to see integration \"in the near future\" — according to <a href=\"https:\/\/alchemypay.org\/news-and-press\/alchemy-pay-expands-global-reach-through-checkout-coms-payment-rails\" data-v-f87c67ca=\"\">a press release<\/a>.","Alchemy Pay claims the new integration helps it achieve \"one of the highest payment acceptance rates in the industry\" while allowing users to buy and sell crypto through the aforementioned card providers.","\"The smooth conversion process facilitated by Checkout.com plays a crucial role in eliminating obstacles to widespread crypto and NFT service adoption, perfectly aligning with Alchemy Pay's mission of bridging the gap between the fiat and crypto global economies,\" the Singapore-based crypto-fiat payment gateway states.","The new partnership continues a trend of Alchemy Pay partnering with a slew of companies in an effort to expand its reach. It has also aggressively obtained operational licenses in multiple countries, including the United States.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Checkout.com","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":[],"authors":["Adam James","The Block"]}