{"summary":"Coinbase-incubated Base has unveiled a plan to move its network to a decentralized model, focusing on several technical updates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247268\/coinbase-base-optimism","publishDate":"2023-08-24T12:08:54","id":10882,"type":null,"title":"Coinbase outlines decentralization plan for Base with fault proofs and OP client diversity %","category":["COMPANIES"],"content":["Coinbase has unveiled a plan to move the Base network to a decentralized model, focusing on multiple technical updates to ensure no single entity has control.","The firm announced it would work on decentralizing the network by implementing fault proofs and using diverse client software to keep the network censorship-resistant.","Coinbase, in collaboration with the decentralized autonomous organization Optimism Collective and OP Labs, will work on transitioning Base (part of Optimism’s OP Stack) towards full decentralization. However, Coinbase has not provided a specific timeline for this transition.","\"We’re excited to see OP Labs and other contributors to the OP Stack making fast progress on key decentralization goals, most notably fault proofs. We're working closely with these teams to ensure that Base adopts these improvements as soon as they are ready,\" said Coinbase protocols lead Jesse Pollak.","The team's efforts include contributions to the OP Stack, the creation of OP chains like Base and the ecosystem known as the “<a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">Superchain<\/a>.” It is also one of the main contributors to OP-geth, the first client for the OP Stack, and is working with Paradigm on another client OP-reth — aiming for fault-proof diversity and minimizing network failure risks.","Finally, the Base team plans to assist in forming a \"security council\" for the Superchain, aimed at implementing further checks and balances to augment the security and decentralization of Base, OP Mainnet and related chains.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"Base","content":"ORGANIZATION"},{"type":"OP Labs","content":"ORGANIZATION"}],"hashtag":["BASE","COINBASE","OPTIMISM"],"authors":["Vishal Chawla","The Block"]}