{"summary":"DeFi protocol PieDAO is considering a proposal to end its liquidity mining program to stem the decline in the price of its native token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176599\/piedao-mulls-ending-liquidity-mining-as-dough-token-slumps","publishDate":"2022-10-12T11:11:18","id":10880,"type":null,"title":"PieDAO mulls ending liquidity mining after dough token slumps 98% in a year","category":["GOVERNANCE"],"content":["PieDAO, a DeFi yield platform, is looking to <a href=\"https:\/\/forum.piedao.org\/t\/doughpamine-programme-termination\/1409?u=bvb\" data-v-f87c67ca=\"\">end<\/a> its token emissions to liquidity providers after the program drove down the value of its native token, called dough.","The incentive program — called Doughpamine — is among a slew of liquidity mining programs created by DeFi protocols to bootstrap liquidity. These projects rent liquidity from market participants&nbsp;in exchange for token emissions from the protocol.","While these programs can have benefits for DeFi protocols by attracting liquidity at the start of the project, they come at a cost. Because the token emissions used to reward liquidity providers (LPs) increase the number of the protocol’s coins in circulation, this can drive down their price.","In PieDAO’s case, the project distributed 18.8 million DOUGH since the start of its liquidity mining program in April 2021. The project rewarded LPs with these tokens for providing liquidity in four incentivized pools on the platform. The arrangement with the LPs is that 20% of the rewards are immediately liquid while the other 80% are under a one-year linear vesting schedule.","PieDAO says renting liquidity comes at a considerable cost to its DAO treasury. The cost of liquidity — a measure of&nbsp;how much the protocol pays for every $1 worth of liquidity provided — for three of PieDAO’s four pools ranges from $0.50 to $0.86.&nbsp;","A high cost of liquidity is not beneficial for DeFi projects as it means that the rewards it has to pay out are almost at par with the liquidity being rented from LPs. Indeed, PieDAO stated that the cost has risen to as high as $1.52 in the past, meaning that there have been periods where the protocol was renting liquidity at a loss.","“The fact that the DAO has been overpaying for liquidity provision has certainly been contributing to the dough sell pressure, possibly inducing a resulting poor price performance,” the proposal stated.","<span class=\"citation\" data-v-f87c67ca=\"\">PieDAO's DOUGH token is down 98% since April 2020. Image: CoinGecko<\/span>","PieDAO has seen its native governance token decline by over 98% from $2.14 when it started the program to $0.04 as of the time of publishing. It peaked at $6.27 in October 2020.","The DAO will hold a SnapShot vote to decide whether to halt liquidity mining for all four pools. For the vote to pass, 60% of participants have to support the motion. However, some in the community have asked that one of the pools, with a significantly lower cost of liquidity, should remain incentivized.","The proposal authored by PieDAO core contributors and treasury committee members also identified some possible risks associated with ending incentivized token emissions for LPs. For one, the proposal’s authors recognize that LPs may decide to withdraw their liquidity if the project stops rewarding them. The proposal also identified the possibility that LPs may sell their remaining tokens once the vesting period ends.","To mitigate these risks, the proposal called for the DAO to institute a token buyback program. This program aims to reduce the circulating supply of dough tokens. As such, the DAO may be intending to burn the tokens.","With the pivot away from renting liquidity from LPs, the DAO will need to come up with another way to obtain liquidity. One viable option already being discussed in the community is the protocol-owned liquidity model used by the likes of OlympusDAO. In protocol-owned liquidity, the DeFi project does not rent liquidity from LPs. Instead, the protocol acquires liquidity provider tokens from market participants. In this way, the protocol has autonomy over the underlying liquidity owned by those token positions.","PieDAO is the latest DeFi protocol to consider ending its incentivized token emission scheme. Decentralized exchange aggregator ParaSwap recently announced that it was looking to <a href=\"https:\/\/www.theblock.co\/post\/175892\/paraswap-plots-reduced-token-emissions-with-new-social-escrow-system\" data-v-f87c67ca=\"\">reduce its native token emissions<\/a> as well as move to a social escrow system.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"April 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"98%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"$0.50","content":"MONEY"},{"type":"$1.52","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"October 2020","content":"DATE"},{"type":"$2.14","content":"MONEY"},{"type":"$0.04","content":"MONEY"},{"type":"$0.86","content":"MONEY"},{"type":"$6.27","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}