{"summary":"Bitcoin miners in China now control 65% of the crypto network’s processing power (hash rate), according to research from CoinShares\nChina’s Sichuan province alone produces 54% of global hash rate\nBitmain’s market share by hash rate, however, continues to decline and now stands at around 66% ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50274\/chinese-bitcoin-miners-control-65-of-the-crypto-networks-processing-power-bitmains-market-share-continues-to-decline","publishDate":"2019-12-12T05:50:34","id":1089,"type":null,"title":"Chinese bitcoin miners control 65% of the crypto network&#x27;s processing power; Bitmain’s market share continues to decline","category":["China"],"content":["Bitcoin miners in China now control 65% of the cryptocurrency network's processing power (hash rate), according to research by digital assets manager CoinShares.","In its latest report, shared with The Block, CoinShares said 65% of global bitcoin mining happens in China, and the country’s Sichuan province alone produces 54% of global hash rate. The remaining 35% of bitcoin miners are spread from the U.S. to Russia and Kazakhstan.","The Chinese share of hash rate, up from 60% in June, is reportedly the highest recorded by CoinShares since it began tracking hash rate almost two years ago. CoinShares said the development of the last 6 months has been mainly one of expansion.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","“More than anything miners have been taking advantage of increased cashflows, especially in spring and summer, from rejuvenated bitcoin prices to reinvest in more powerful and more efficient mining gear – both to secure their share of network hashrate against the advent of next-generation hardware, and as an efficiency preparation for the upcoming block reward halving,” per the report, authored by Christopher Bendiksen, head of research at CoinShares and Samuel Gibbons, research analyst at the firm.","Major improvements in mining hardware have also made their way into the bitcoin network, per the report. Key players are Bitmain (with their Antminer 15 and 17 series) and MicroBT (Whatsminer 10 and 20 series). Bitfury (Clarke chipset), Canaan (Avalon 10-series), Innosilicon (T3 unit) and Ebang (E10 model) also contributed, said CoinShares.","<strong data-v-f87c67ca=\"\">Bitmain’s declining market share<\/strong>","While Bitmain is one of the key players, its market share by hash rate has fallen from ~70% in June to ~66% now, according to the report. In June 2017, Bitmain’s own estimates (via Frost and Sullivan) showed that it had a market share of around 75%.","“Bitmain needs fresh inflows of capital mainly to heal a series of self-inflicted wounds caused by poor strategic decisions,” said Bendiksen and Gibbons, adding: “Judging from internal leaks and the financial statements released as part of their failed Hong Kong IPO bid, Bitmain has suffered from serial malinvestment, ranging from failed tape-outs, hardware overproduction, overhiring, and perhaps worst of all, its disastrously performing and likely captive BCH [bitcoin cash] holdings. All these factors have been contributing to balance sheet issues which, according to a recent leaked internal memo by Bitmain chairman and co-founder Jihan Wu, almost sunk the company in early 2019.”","CoinShares further said that at current bitcoin prices, the average miner is profitable. However, going into the reward halving in the spring of 2020 the company said equipment matters.","\"Older gear such as the venerable Antminer S9, which is still widely deployed in the network, will likely be approaching the end of its useful lifetime unless the price of Bitcoin rises dramatically, or indeed if more operators gain access to electricity around or below ¢1\/kWh,\" it concluded."],"hashtag":[]}