{"summary":"South Korean prosecutors are examining if Wemade withheld giving private keys to users, which would mean that it violated reporting rules.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276612\/wemade-reporting-investigation","publishDate":"2024-02-08T03:11:46","id":10893,"type":null,"title":"Wemade investigated for allegedly dodging reporting duties: report","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Wemade, a South Korean Web3 game developer with a market capitalization of 1.6 trillion Korean won ($1.2 billion), is under investigation by local prosecutors, according to South Korean news reports.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The investigation centers on allegations of unfair profits through potentially evading regulations that require virtual asset service providers to register with authorities, local news outlet Munhwa <\/span><a href=\"https:\/\/www.munhwa.com\/news\/view.html?no=2024020801071230020001\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> Thursday.<\/span>","<span data-v-f87c67ca=\"\">South Korean regulations <\/span><a href=\"https:\/\/www.fsc.go.kr\/comm\/getFile?srvcId=BBSTY1&amp;upperNo=75409&amp;fileTy=ATTACH&amp;fileNo=6\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">mandate<\/span><\/a><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> registration and reporting by crypto service platforms, except for those not sharing control over user assets by providing private keys. Wemade, which started as a game developer but has transitioned to issuing its own token (<span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248516\/wemix-wemix-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/wemixcoin_color_200.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WEMIX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -4.032%\n    <\/span><\/a> <!----><\/span>) and blockchain mainnet, has insisted that the company is not subject to reporting requirements.<\/span><\/span>","<span data-v-f87c67ca=\"\">Prosecutors are reportedly examining whether Wemade-affiliated decentralized exchange, PNIX, and its digital asset storage system, Play Wallet, withhold private keys from users. This probe aims to determine if PNIX and Play Wallet services violate the mandate by avoiding reporting duties required for platforms that do not grant users private keys, according to Munhwa.<\/span>","<span data-v-f87c67ca=\"\">The Financial Intelligence Unit, the local financial sector’s supervisor, also received similar complaints and launched an investigation on Wemade, Munhwa reported.<\/span>","<span data-v-f87c67ca=\"\">Wemade’s WEMIX team <\/span><a href=\"https:\/\/www.wemix.com\/ko\/communication\/wemix-dfd74ca3237d\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">responded<\/span><\/a><span data-v-f87c67ca=\"\"> to the allegations in an official announcement Thursday afternoon in Asia, where it said that PNIX DEX and the Play Wallet services are not subject to the compliance requirements.<\/span>","<span data-v-f87c67ca=\"\">The statement said that the Play Wallet is a decentralized service where the team does not have control over users' private keys or assets. The team added that PNIX merely provides a decentralized trading platform that processes buy and sell orders where assets waiting for transactions are stored in smart contracts outside the operator’s hands.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The statement did not explicitly specify whether the two services have been offering users with private keys. <\/span>","<span data-v-f87c67ca=\"\">The Block has reached out to Wemade and the prosecutor’s office for further comments.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"-4.032%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Intelligence Unit","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Munhwa","content":"ORGANIZATION"},{"type":"Wemade","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"afternoon","content":"TIME"}],"hashtag":["GAME","PLAY2EARN"],"authors":["Danny Park","The Block"]}