{"summary":"Jack Dorsey’s payments company Square has decided to make a bitcoin hardware wallet.\nThe wallet will be multi-sig and will prioritize mobile use. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110916\/jack-dorsey-square-bitcoin-hardware-wallet","publishDate":"2021-07-09T06:44:36","id":109,"type":null,"title":"Jack Dorsey&#x27;s Square decides to build a bitcoin hardware wallet","category":["Wallets"],"content":["Square, the payments company headed by Twitter CEO Jack Dorsey, has confirmed it will make a bitcoin hardware wallet. The decision comes a month after Dorsey <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107250\/jack-dorsey-says-square-is-weighing-a-possible-bitcoin-hardware-wallet\" data-v-f87c67ca=\"\">said<\/a> Square was considering making one.","\"We have decided to build a hardware wallet and service to make bitcoin custody more mainstream,\" <a href=\"https:\/\/twitter.com\/JesseDorogusker\/status\/1413222597207134214\" data-v-f87c67ca=\"\">tweeted<\/a> Square's hardware lead Jesse Dorogusker on Thursday. Dorsey <a href=\"https:\/\/twitter.com\/jack\/status\/1413261505156599809?s=20\" data-v-f87c67ca=\"\">confirmed<\/a> the news in a separate tweet.","A personal hardware wallet is non-custodial, meaning crypto holders stay in control of their own private keys instead of letting third parties like crypto exchanges handle the keys for them.","The wallet will offer <a href=\"https:\/\/twitter.com\/JesseDorogusker\/status\/1413222598931099653?s=20\" data-v-f87c67ca=\"\">multi-sig<\/a> or multi-signature transactions, which require two or more private keys to sign and send a transaction. Specifically, Dorogusker said that the multi-sig options will be used to enable \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">assisted-self-custody.\" This suggests that Square might play some role in the key process.<\/span>","Dorogusker added that the wallet will prioritize mobile use, meaning it plans to integrate with smartphones. Square plans for it to be distributed globally.","To that end, Square is building a team and <a href=\"https:\/\/twitter.com\/JesseDorogusker\/status\/1413222599849619459?s=20\" data-v-f87c67ca=\"\">hiring<\/a> across hardware, software, and security, and business functions. The team will be led by Max Guise, Square's hardware security lead. Square's general manager of hardware, Thomas Templeton, will also help build the team out.","Dorsey's love for bitcoin is no secret; the billionaire's Twitter bio says only one thing: \"#bitcoin.\" Dorsey <a href=\"https:\/\/twitter.com\/rjwile\/status\/1400855150743494657\" data-v-f87c67ca=\"\">recently said<\/a> he would be working on bitcoin if he wasn't working at Square and Twitter.","Square's bitcoin hardware wallet won't be the company's first crypto product either. Square's Cash App already allows users to buy and sell bitcoin, and this business line has been a moneymaker for the company. Square <a href=\"https:\/\/www.theblockcrypto.com\/post\/104136\/square-reports-3-51-billion-in-bitcoin-revenue-via-its-cash-app-for-first-quarter-of-2021\" data-v-f87c67ca=\"\">generated<\/a> $3.51 billion in bitcoin revenue during the first quarter of this year and $75 million in bitcoin gross profit during the same period. The firm also <a href=\"https:\/\/www.theblockcrypto.com\/post\/80196\/square-bitcoin-purchase-details-paper\" data-v-f87c67ca=\"\">holds bitcoin<\/a> on its balance sheet.","In addition, the company recently formed a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100632\/fidelity-coinbase-square-crypto-council\" data-v-f87c67ca=\"\">crypto council<\/a> with other notable companies to lobby policymakers. On top of that, Square is building a 100% solar-powered <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107469\/square-blockstream-solar-powered-bitcoin-mine-united-states\" data-v-f87c67ca=\"\">bitcoin mining farm<\/a> in the U.S. with Blockstream.","Besides Square, its music streaming service unit Tidal also appears to be interested in the crypto space. The firm recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109903\/tidal-interested-nft-jack-dorsey-shawn-carter-jay-z\" data-v-f87c67ca=\"\">said<\/a> it might start exploring non-fungible tokens (NFTs), potentially as a new way to compensate artists. Square's sister company <a href=\"https:\/\/www.theblockcrypto.com\/post\/110127\/twitter-is-selling-140-ethereum-nfts-on-rarible\" data-v-f87c67ca=\"\">Twitter<\/a> also recently gave away 140 NFTs to random users. But does that mean Dorsey might start purchasing ether? <a href=\"https:\/\/twitter.com\/jack\/status\/1410269221855154186\" data-v-f87c67ca=\"\">Apparently not<\/a>."],"hashtag":["BITCOIN"]}