{"summary":"FTX has agreed to hire BitGo to hold its $740 million of remaining digital assets in cold wallets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189667\/ftx-asks-court-to-let-bitgo-safeguard-its-assets-during-bankruptcy","publishDate":"2022-11-23T17:46:33","id":10908,"type":null,"title":"FTX asks court to let BitGo safeguard its assets during bankruptcy","category":["COMPANIES"],"content":["FTX notified a federal judge that it wants BitGo to safeguard its remaining digital assets as bankruptcy proceedings play out.","A custodial services agreement with BitGo was signed Nov. 13, approximately one day after someone completed “unauthorized transfers” draining $372 million worth of assets from FTX accounts.&nbsp;","The company and its affiliates have to ask the judge overseeing its bankruptcy before moving assets. FTX told the court yesterday that it was concerned about ongoing cyberthreats and theft.","FTX has agreed to pay a $5 million upfront fee to BitGo, and the company will charge FTX a monthly fee equal to the average U.S. dollar value of the digital assets held, multiplied by 1.5 basis points. In their filing announcing the deal, lawyers for the company estimate it will cost FTX approximately $100,000 per month, based on the initial transfer of $740 million worth of assets to BitGo as of Nov. 16.","FTX will continue to investigate and attempt to recover lost or stolen assets while the bankruptcy plays out, and attorneys for the company note that could increase the amount of assets in custody.","“It’s time to get serious about ending the human-created disasters in crypto,\" <span data-v-f87c67ca=\"\"> co-founder and CEO of Bitgo Mike Belshe said in a message to The Block.<\/span>&nbsp;<span data-v-f87c67ca=\"\">“When you break down FTX subsidiaries, the ones that used BitGo products are solvent and safe. The ones that didn’t, aren't.”<\/span>","Objections to the custodial services agreement are due by Dec. 7 at 4 p.m. The next hearing in U.S. Bankruptcy Court for the District of Delaware will take place on Dec. 16 at 10 a.m. EST.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$740 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$372 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dec. 16","content":"DATE"},{"type":"10 a.m. EST","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Dec. 7","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bitgo Mike Belshe","content":"PERSON"},{"type":"4 p.m","content":"TIME"},{"type":"Nov. 13","content":"DATE"},{"type":"$5 million","content":"MONEY"},{"type":"Nov. 16","content":"DATE"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Christiana Loureiro","Colin Wilhelm","The Block"]}