{"summary":"Ethereum&#x27;s recent staking growth has led to more centralization of the network and declining staking yield, according to JPMorgan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255116\/jpmorgan-ethereum-more-centralized-staking","publishDate":"2023-10-06T03:29:42","id":10905,"type":null,"title":"JPMorgan: Ethereum has become &#x27;more centralized&#x27; with staking surge","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.33%\n    <\/span><\/a> <!----><\/span><\/span>'s recent staking growth has led to more centralization of the network and declining staking yield, according to JPMorgan.<\/span>","\"The rise in Ethereum staking since the Merge and Shanghai upgrades has come at a cost as the Ethereum network became more centralized and as the overall staking yield declined,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a note on Thursday.","The <a href=\"https:\/\/www.theblock.co\/post\/169846\/the-merge-live-coverage-of-ethereums-major-upgrade\" data-v-f87c67ca=\"\">Merge upgrade<\/a> executed in September 2022 shifted Ethereum from a proof-of-work network to a proof-of-stake blockchain, enabling staking. The Shanghai upgrade in April of this year allowed validators to withdraw the staked ether locked in the network and reinvest, leading to a <a href=\"https:\/\/www.theblock.co\/post\/226879\/lido-deposits-surpass-12-billion-as-ethereums-shapella-boosts-liquid-staking\" data-v-f87c67ca=\"\">surge in staking<\/a>.","The major contributors to staking growth are liquid staking providers, such as <a href=\"https:\/\/www.theblock.co\/post\/158154\/lido-to-launch-liquid-staking-on-ethereum-layer-2-networks\" data-v-f87c67ca=\"\">Lido<\/a>. \"The top 5 liquid staking providers control more than 50% of staking on the Ethereum network, and Lido specifically accounts for almost one-third,\" said JPMorgan analysts. Platforms like Lido, although being decentralized liquid staking platforms, \"involve a high degree of centralization,\" they said.","","","\"Needless to say that centralization by any entity or protocol creates risks to the Ethereum network as a concentrated number of liquidity providers or node operators could act as a single point of failure or become targets for attacks or collude to create an oligopoly that would promote their own interests at the expense of the interests of the community, e.g. by censoring certain transactions or by front running on end users' transactions,\" the analysts added.","Besides centralization, another concern stemming from the growth of liquid staking is the practice of rehypothecation — which involves using liquidity tokens as collateral across multiple DeFi protocols simultaneously, the analysts noted. This practice could result in a cascade of liquidations if a staked asset drops sharply in value or is hacked or slashed due to a malicious attack or a protocol error, they added.","Ethereum's staking growth has also led to declining staking rewards compared to increasing yields offered by traditional financial assets. \"The total staking yield has declined from 7.3% before the Shanghai upgrade to around 5.5% currently,\" they added.","Last month, JPMorgan <a href=\"https:\/\/www.theblock.co\/post\/252470\/jpmorgan-ethereum-shanghai-disappointing\" data-v-f87c67ca=\"\">said<\/a> Ethereum has fallen short of expectations in terms of network activity following the Shanghai upgrade. Ethereum's daily transactions, daily active addresses and total value locked of decentralized finance protocols on the network have all experienced declines, they said at the time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"7.3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"5.5%","content":"PERCENT"},{"type":"-1.33%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"April of this year","content":"DATE"},{"type":"September 2022","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","STAKING FIRMS"],"authors":["Yogita Khatri","The Block"]}