{"summary":"Arkham CEO Miguel Morel responded to user questions about the firm’s new Intel Exchange platform in a Tuesday Twitter Spaces event.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238929\/arkham-ceo-faces-pushback-over-new-platform-as-debate-over-anonymity-rages","publishDate":"2023-07-11T14:13:02","id":10906,"type":null,"title":"Arkham CEO faces pushback over platform as anonymity debate rages","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Miguel Morel, CEO of the blockchain data firm Arkham Intelligence, discussed the <a href=\"https:\/\/www.arkhamintelligence.com\/announcements\/arkham-intel-exchange\" data-v-f87c67ca=\"\">launch<\/a> of its&nbsp;<\/span>Intel Exchange <a href=\"https:\/\/www.theblock.co\/post\/238596\/binance-arkham-token\" data-v-f87c67ca=\"\">data platform<\/a> in a Tuesday Twitter Spaces event where he faced some pushback amid a raging debate between crypto anonymity and identity.","<span data-v-f87c67ca=\"\">When asked whether Arkham Intel Exchange incentivizes users to \"dox,\" or reveal personally identifying information about, certain crypto wallets, <a href=\"https:\/\/www.theblock.co\/post\/215997\/how-on-chain-data-can-possibly-prevent-the-next-sbf-according-to-arkham-intel-ceo\" data-v-f87c67ca=\"\">Morel<\/a> not only agreed but said that's the whole point of the platform.<\/span>","<span data-v-f87c67ca=\"\">“There’s an incentive from the community that’s actually getting exploited to put in real work to figure out who is behind the fraud so that they could be reported to the authorities, or for the community to know,” Morel said. “This could have prevented very large frauds and crises within crypto, such as the FTX and Alameda collapse.”<\/span>","Arkham plans for the exchange to benefit the crypto community by identifying wallet addresses belonging to hedge funds or finding out who might be behind a celebrity impersonation account. To curb abuse of the platform, however, Morel said that Arkham must approve bounties and submissions for the program, and that users must show they obtained their information through public sources.","<span data-v-f87c67ca=\"\">“If there are people who have information about somebody who has conducted a hack or other info that’s extremely valuable to the community, that is the kind of thing that will be accepted onto the Intel Exchange, and which will receive a lot of volume from the market,\" he said. \"<\/span><span data-v-f87c67ca=\"\">It will not be small individual private wallets, because that’s not the goal of the Arkham Intel Exchange. No one cares for those and is going to pay money for them.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Some participants in the Twitter Spaces event pushed back over fears that Intel Exchange could be used to&nbsp;<\/span><span data-v-f87c67ca=\"\">dox private individuals. Others worried the information could be incorrect and said that many could be forced to get private security if their holdings are revealed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto trader Ran Neuer worried that those who have access to crypto wallet know-your-customer information, such as people working for centralized exchanges, may feel compelled to dox their user base for a reward.&nbsp;<\/span>","\"My issue is not with the [Arkham Intel Exchange] system,\" Neuer says. \"My issue is your company managing the data.\"","The comments came just one day after the company faced widespread criticism after it appeared to have made some customer emails<a href=\"https:\/\/www.theblock.co\/post\/238764\/arkham-referral-links-appear-to-reveal-user-email-addresses\" data-v-f87c67ca=\"\"> publicly available<\/a> through decodable referral links that were shared by users in the runup to a token airdrop.&nbsp;","Identity, meanwhile, is key to Arkham's vision. The firm stated in its <a href=\"https:\/\/assets-global.website-files.com\/62879326fd745f7489b43224\/64abc4471879916bc4e2aeb0_Arkham_Whitepaper_FINAL.pdf\" data-v-f87c67ca=\"\">whitepaper<\/a> that it plans to help usher in a web3 future that links personal identity to blockchain interactions.","\"Deanonymization is destiny,\" the firm wrote, \"In the early days of the internet everyone was pseudonymous. Now, people use their real identity online. MySpace to Facebook was a microcosm of this transition.\"","\"The same process is happening with blockchain identities — consider the rise of ENS and of NFT profile pictures,\" it continued. \"Eventually, everyone’s blockchain identity will be linked to their real-world identity.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arkham Intel Exchange","content":"ORGANIZATION"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Intel Exchange","content":"ORGANIZATION"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Miguel Morel","content":"PERSON"},{"type":"Morel","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"ENS","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}