{"summary":"BNB Chain announced the launch of a dApp hub for the ecosystem on Thursday with built in anti-scam tools to protect users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157543\/bnb-chain-launches-dapp-aggregator-platform-with-anti-scam-alarm","publishDate":"2022-07-14T08:57:18","id":10902,"type":null,"title":"BNB Chain launches dApp aggregator platform with anti-scam alarm","category":["LAYER 1S"],"content":["BNB Chain announced the launch of a dApp hub for the ecosystem on Thursday with built in anti-scam tools to protect users.","The network, which was originally founded by exchange giant Binance, said DappBay’s Red Alarm feature would allow users to assess project risk by entering the contract address and seeing flags for logical flaws and fraud risks.","“The Red Alarm feature helps users in staying one step ahead of scammers; the system warns in real time of potential risks associated with the projects, allowing the community to make informed investment decisions,” Gwendolyn Regina, investment director at BNB Chain, said in a statement.","Developers will be able to list their own dApps on the platform and track projects through metrics such as fastest user growth and best performing tokens. It will also analyze and compile lists of promising upcoming projects in advance of their launch.","BNB Chain, formerly known as Binance Smart Chain, <a href=\"https:\/\/www.theblock.co\/linked\/134257\/binance-renames-bsc-bnb-blockchain-token\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">rebranded in February this year<\/a>. The move was interpreted as crypto exchange Binance trying to distance itself from the ecosystem.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Gwendolyn Regina","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"February this year","content":"DATE"}],"hashtag":["BINANCE","BNB CHAIN"],"authors":["Callan Quinn","The Block"]}