{"summary":"BitGo executive Darren Jordan said that he gets regular calls from corporates looking to add bitcoin to their balance sheets.\nGenesis Trading CEO noted that this was one of the biggest changes over the last year.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119751\/bitgo-exec-corporates-are-asking-weekly-to-add-bitcoin-to-their-balance-sheet","publishDate":"2021-10-07T06:20:19","id":1090,"type":null,"title":"BitGo exec: Corporates are asking weekly to add bitcoin to their treasury","category":["Bitcoin"],"content":["Corporates are inquiring how to add bitcoin to their balance sheets on a regular basis, according to Darren Jordan, managing director of EMEA at BitGo.","Speaking at the Token 2049 conference in London on Thursday, Jordan said, \"The dramatic change — and I have this conversation many times per week — is with corporates. And they are looking to allocate a small percentage of their balance sheet.\"","\"That has been the most significant change we've seen over the last 12 months,\" he added.","Jordan said that this involves a lot of education, with corporates having to wrap their heads around liquidity, regulatory frameworks and whether they're allowed to do so.","On the same panel, Genesis Trading CEO Michael Moro concurred with Jordan. Moro said that although the firm has worked with hedge funds since as early as 2015 and that family offices and similar businesses have entered the market since, this was one of the biggest changes over the last year.","Moro said that we have seen a \"tremendous increase in corporations putting crypto on their balance sheet, and this wasn't just U.S. tech firms, I think we saw involvement from firms in South America and South-East Asia again as kind of a diversification of their treasury portfolio play itself.\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BITCOIN"]}