{"summary":"An InvestHK official said that potential Hong Kong dollar-pegged stablecoins may draw strong demand from institutional investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285286\/old-money-may-prefer-regulated-hkd-pegged-stablecoins-says-hong-kong-govt-official","publishDate":"2024-03-28T06:02:38","id":10927,"type":null,"title":"&#x27;Old money&#x27; may prefer regulated HKD-pegged stablecoins, says Hong Kong gov&#x27;t official","category":["STABLECOINS"],"content":["<span data-v-f87c67ca=\"\">The regulated nature of potential Hong Kong dollar-pegged stablecoins may be favored by “old money” in competition with the already prevalent U.S. dollar-pegged stablecoins, a Hong Kong government official said.<\/span>","<span data-v-f87c67ca=\"\">“When you have the backing of the most reputable regulator — the HKMA — giving you the license, that can actually give a lot of confidence to industry players,” King Leung, head of fintech and financial services at Invest Hong Kong, told The Block in an interview. “I'm not talking about just retail [investors] but also institutional investors, because that's where the big money is.”<\/span>","<span data-v-f87c67ca=\"\">Invest Hong Kong, the region's government department for foreign direct investment, aims to “strengthen Hong Kong's status as the leading international business location in Asia,” according to its website.<\/span>","<span data-v-f87c67ca=\"\">Leung’s comment comes as Hong Kong <\/span><a href=\"https:\/\/www.theblock.co\/post\/281914\/hong-kong-sandbox-stablecoin-issuers-communicate-supervisory-expectations\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched a “sandbox” arrangement for stablecoin issuers<\/span><\/a><span data-v-f87c67ca=\"\"> earlier this month to pave the way for future relevant regulations. The Hong Kong authorities had just concluded a consultation on Feb. 29 on regulating stablecoin issuers. <\/span>","<span data-v-f87c67ca=\"\">In December, the Hong Kong Monetary Authority, together with the Financial Services and the Treasury Bureau, <\/span><a href=\"https:\/\/www.theblock.co\/post\/269292\/hong-kong-proposes-licenses-should-be-required-for-stablecoin-issuers\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched a consultation<\/span><\/a><span data-v-f87c67ca=\"\"> and proposed that all fiat-referenced stablecoin issuers should obtain a license from the HKMA.<\/span>","<span data-v-f87c67ca=\"\">With U.S. dollar-pegged stablecoins dominating the stablecoin market, some industry players have questioned market demand for an HKD stablecoin. <\/span>","<span data-v-f87c67ca=\"\">Alessio Quaglini, chief executive officer and co-founder of Hong Kong-based crypto custodian Hex Trust, <\/span><a href=\"https:\/\/www.theblock.co\/post\/283857\/conflux-aims-for-q2-launch-of-hkd-pegged-stablecoin-with-anchorx\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> there’s no need for a stablecoin in Hong Kong dollars. <\/span><span data-v-f87c67ca=\"\">“I don't think there's space for more than one provider, if any,” Quaglini said.<\/span>","<span data-v-f87c67ca=\"\">However, Animoca Brands Chairman Yat Siu said that HKD-pegged stablecoins may secure their unique territory in the already saturated crypto market. “If you want to have another kind of regulated currency that, however, is non-American, but is yet tied to an American system as in the U.S. dollar, I think the Hong Kong dollar becomes a very interesting proxy”, Siu <\/span><a href=\"https:\/\/www.theblock.co\/post\/285249\/animoca-brands-hong-kong-stablecoin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told The Block<\/span><\/a><span data-v-f87c67ca=\"\"> today in Seoul.<\/span>","<span data-v-f87c67ca=\"\">Leung of InvestHK said that as the world is looking to entire the crypto world to “buy stuff on-chain,” the demand for stablecoins will most likely go up.<\/span>","<span data-v-f87c67ca=\"\">“If you are, as I said, the institutional people and you have this fiduciary responsibility of your clients' money, you are not going to buy stablecoins from unregulated entities,” Leung added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Invest Hong Kong","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Feb. 29","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"King Leung","content":"PERSON"},{"type":"Siu","content":"PERSON"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Quaglini","content":"PERSON"},{"type":"Leung","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}