{"summary":"Metamundo’s 3D NFT marketplace, focused on producing assets that can be used across multiple metaverse platforms, went live on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158069\/metamundo-launches-marketplace-for-interoperable-metaverse-nfts","publishDate":"2022-07-19T08:00:03","id":10922,"type":null,"title":"MetaMundo launches marketplace for interoperable metaverse NFTs","category":["GAMING AND METAVERSE"],"content":["BVI-based MetaMundo said on Tuesday that it has launched its 3D non-fungible token (NFT) marketplace.","A marketplace for metaverse assets such as galleries, villas, music venues, parks, avatars and vehicles, MetaMundo focuses on producing assets that can be used across multiple metaverse platforms.","To do this, the company takes 3D designs created by artists and puts them through a conversion and optimization pipeline to create multiple 3D files for different metaverse platforms. Each NFT sold on MetaMundo therefore includes a bundle of 3D files that make it compatible with multiple metaverses including Decentraland, Cryptovoxels, The Sandbox and Spatial.","MetaMundo said that in the future, new 3D files can be added to the NFT so that it will also be compatible with emerging metaverse environments.","“We’re solving the lack of NFT interoperability through a unique architecture we’ve developed which features a versatile and extensible NFT metadata structure, supporting multiple 3D file versions and offering the flexibility to add additional file versions later to enable future-proofing as 3D technology evolves,” said MetaMundo co-founder Finn Hansen in a statement.","Hansen, a former product leader at Booking.com, founded MetaMundo last year alongside Mark Studholme, who has a background in working on e-commerce marketplaces. The company’s first funding round was announced in November. It raised $2.7 million led by Animoca Brands.&nbsp;","Interoperability continues to be a top issue for metaverse creators who want to ensure users can transfer assets between worlds. One other attempt to address this has been the <a href=\"https:\/\/www.theblock.co\/post\/153299\/tech-giants-opt-into-newly-formed-metaverse-standards-forum\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Metaverse Standards Forum<\/a>, which formed last month, albeit without some of the top platforms on their roster.","In its <a href=\"https:\/\/www.theblock.co\/post\/157995\/yuga-labs-champions-openness-collaborative-development-in-otherside-litepaper\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">recent litepaper<\/a> for metaverse platform Otherside, Yuga Labs also said that it will support interoperability in the future and wants to give users the chance to bring their own outside collections and NFTs into its metaverse.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"$2.7 million","content":"MONEY"},{"type":"Finn Hansen","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Hansen","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"MetaMundo","content":"ORGANIZATION"},{"type":"Metaverse Standards Forum","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Mark Studholme","content":"PERSON"}],"hashtag":["INTEROPERABILITY"],"authors":["Callan Quinn","The Block"]}