{"summary":"Representatives from the Federal Reserve Bank of Boston and the IMF tackled the topic of central bank digital currencies during the MIT Bitcoin Expo on Saturday","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58067\/during-mit-panel-experts-say-blockchain-is-not-yet-a-clear-design-choice-for-central-bank-digital-currencies","publishDate":"2020-03-08T13:31:36","id":10923,"type":null,"title":"During MIT panel, experts say blockchain is not yet a clear design choice for central bank digital currencies","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Blockchain technology is not yet a clear design choice for central bank digital currencies (CBDC), according to experts.&nbsp;<\/span>","During this weekend's MIT Bitcoin Expo, three central bank experts took to the stage: <span data-v-f87c67ca=\"\">Bob Bench of the Federal Reserve Bank of Boston, Sonja Davidovic of the International Monetary Fund (IMF), and Robleh Ali of the MIT Digital Currency Initiative and a former Bank of England official. A<\/span><span data-v-f87c67ca=\"\">ll agreed that central banks have yet to figure out whether they should issue digital currencies via distributed ledger technology (DLT) or the traditional centralized system.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the panelists, while cryptocurrencies offer a more efficient financial model, they possess certain weaknesses – or, at least, pose uncertainties – when it comes to privacy, interoperability, and the ability to move value consistently.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"What we've seen a lot is that there's a hype out there and people are quickly jumping to choosing that technology just because it's popular,\" said Davidovic, economist and digital expert at IMF. &nbsp;\"That certainly happened with blockchain. The result of that is that we've seen central banks that are directly engaging with it without going through the proper process of testing the technology in a proof of concept, selecting vendors through an open bidding process, and having a request for proposals.\"<\/span>","<span data-v-f87c67ca=\"\">There are plenty of options that DLT can offer, she contended, including the ability to program a CBDC to perform specific functions and build intelligent tools on top of the currency to track transactions. <\/span>","<span data-v-f87c67ca=\"\">However, researchers have yet to discover a means to ensure privacy and interoperability. On the latter point, central banks would have to coordinate to interoperate not only various DLT-enabled networks but also between DLT-enabled networks and legacy networks.<\/span>","<span data-v-f87c67ca=\"\">The existence of these problems, according to Davidovic, is especially dangerous when it comes to central banks because they often cannot evaluate the technology and vendors properly. As a result, they are likely to outsource some of the work to commercial vendors and third parties, introducing additional risks.<\/span>","<span data-v-f87c67ca=\"\">\"It's about the weakest link,\" she said. \"You can have a secure system, but if the people who're operating the system click on a phishing email or allow a security breach, your most robust system is not going to help with security.\"<\/span>","<span data-v-f87c67ca=\"\">\"[CBDC] is not going to be a straight copy of cryptocurrency for sure,\" she added.<\/span>","<span data-v-f87c67ca=\"\">Echoing Davidovic's concern, Bob Bench, director of the applied fintech research division of the Federal Reserve Bank of Boston, argued that while cryptocurrencies like Bitcoin provide an interesting security model, they might not be the right solution for the BCDC use case. This, he said, is because such a central bank-backed system requires the ability to move value consistently, highly securely, and with sufficient speed.<\/span>","<span data-v-f87c67ca=\"\">\"BTC is very interesting because it's mostly just transactional values,\" he said. \"But if you're trying to build a retail central bank currency – like China, for example, there's 40 trillion in volume last year generated through WeChat alone – you need something that over and over and over again, can move value and do it quickly without breaking.\"<\/span>","<span data-v-f87c67ca=\"\">Many moving pieces could potentially compromise a CBDC's security model, Bench said. Users on the retail side would need to access the CBDC in a secure environment. Since they will likely interact with the currency via phone, manufacturers and operators of the hardware and the app will require additional scrutiny. Moreover, even the cell towers and the lines that the cell towers are attached to could potentially present weak security.<\/span>","<span data-v-f87c67ca=\"\">\"[DLT] might work, but what if you get to the 10 or 30 trillion volume and pieces start falling off the shelf?\" he continued. \"That's something that any central bank that's thinking about putting their full faith and trust of their government's currency behind a platform needs to understand.\"<\/span>","<span data-v-f87c67ca=\"\">It's still an open question whether central banks will incorporate elements of blockchain into possible CBDCs. But Ali, a research scientist at the MIT Digital Currency Initiative and a former manager of digital currencies at the Bank of England, believes that the eventual outcome will probably be a \"hybrid\" DLT-and-centralized system.<\/span>","<span data-v-f87c67ca=\"\">\"You'll likely end up with a hybrid in the end,\" Ali said. \"I don't think every central bank would choose the same system. How they interact with each other will be key, so you can sort them into a single system.\"<\/span>","<span data-v-f87c67ca=\"\">Despite skepticism toward pure DLT-based networks, all three panelists believe that CBDCs are necessary for improving the current global financial system.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Davidovic, even though digital payment systems like Venmo, PayPal, and various cryptocurrencies already exist, a big proportion of the world's population does not have access to these means of payments. Depending on the infrastructure, she said, a CBDC might not be commercially valuable, but it is crucial to the advancement of financial inclusion.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A CBDC would also useful for cutting the cost of handling physical bills since it can be expensive to print and move cash around. Moreover, it would reduce the risk of potential monopoly or market distortion from private providers, she said. And this, in her reasoning, is precisely why the Facebook-led Libra stablecoin project was not acceptable for many central banks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bench agreed that a CBDC could be especially useful in the developing realm due to existing consumer needs. In the East Caribbean islands, for example, families are often scattered across different islands and there is a $100 fee for them to send cash to each other. This adds a considerable financial burden to an already impoverished population.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"This might not be a use case that requires high throughput,\" Bench explained. \"They just need to be faster than the boat or plane that goes from island to island.\"<\/span>","<span data-v-f87c67ca=\"\">\"Currently, we really don't have digital central bank reserves with the possible exception of Alipay and WeChat, which since June of last year became directly funded by the People's Bank of China,\" he continued. \"That was the largest digital central bank project to date.\"<\/span>","<span data-v-f87c67ca=\"\">Ali pointed out that CBDCs offer a superior alternative even for advanced economies because they allow users to have a direct claim on the central bank and circumvent certain crisis-period risks of commercial banks.<\/span>","<span data-v-f87c67ca=\"\">\"Since BTC, we haven't had a breakdown of the market. But when things do break down, questions about counterparty risks, entity viability, the role of intermediaries become important,\" he said. \"A digital account in a commercial bank is how most people function money, until things get really bad and commercial banks start struggling or have crises.\"<\/span>","<span data-v-f87c67ca=\"\">At the same time, however, Ali contended that there's still a lot of work to be done to fully understand what it means to have a direct claim on the central bank, how to operate such a system, and what happens to banks when CBDCs replace the existing system. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve Bank of Boston","content":"ORGANIZATION"},{"type":"International Monetary Fund (IMF","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"MIT Digital Currency Initiative","content":"ORGANIZATION"},{"type":"Ali","content":"PERSON"},{"type":"$100","content":"MONEY"},{"type":"BCDC","content":"ORGANIZATION"},{"type":"Bob Bench","content":"PERSON"},{"type":"East Caribbean","content":"LOCATION"},{"type":"People's Bank of China","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"June of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Robleh Ali","content":"PERSON"},{"type":"Sonja Davidovic","content":"PERSON"},{"type":"Bench","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"MIT Bitcoin Expo","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Davidovic","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["FEDERAL RESERVE"],"authors":["Yilun Cheng","The Block"]}