{"summary":"Coinbase claimed in a statement that the agency&#x27;s approach is damaging America&#x27;s ability to compete economically.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233315\/coinbase-sec-lawsuit-is-hurting-americas-economic-competitiveness","publishDate":"2023-06-06T10:24:33","id":10921,"type":null,"title":"Coinbase: SEC lawsuit is &#x27;hurting America’s economic competitiveness&#x27;","category":["COMPANIES"],"content":["Coinbase responded to the SEC's lawsuit against the exchange, claiming that the agency's approach is damaging America's ability to compete economically.","“The SEC's reliance on an enforcement-only approach in the absence of clear rules for the digital asset industry is hurting America’s economic competitiveness and companies like Coinbase that have a demonstrated commitment to compliance,\" said Paul Grewal, chief legal officer and general counsel at Coinbase, in a statement.","Yet he added that the exchange plans to continue as normal.","\"The solution is legislation that allows fair rules for the road to be developed transparently and applied equally, not litigation. In the meantime, we’ll continue to operate our business as usual,” said Grewal.","Following his comments, Coinbase CEO Brian Armstrong <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1666127353574219777\" data-v-f87c67ca=\"\">tweeted<\/a>, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Instead of publishing a clear rule book, the SEC has taken a regulation by enforcement approach that is harming America. So if we need to avail ourselves of the courts to get clarity, so be it.<\/span>\"","Armstrong noted that the lawsuit was heavily focused on the issue of whether the exchange was listing securities. On this point, he said the exchange was confident in its approach.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brian Armstrong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"America","content":"LOCATION"},{"type":"Grewal","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Tim Copeland","The Block"]}