{"summary":"House Republicans pressed SEC chair Gary Gensler over his agency&#x27;s approach to ether.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226877\/gensler-sec-congress-hearing-crypto","publishDate":"2023-04-18T12:02:28","id":10926,"type":null,"title":"Gensler gets grilled in the House on SEC&#x27;s take on crypto","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">House Republicans grilled Securities and Exchange Commission Chair Gary Gensler over his agency’s handling of digital assets, especially a lack of clarity over whether or not ether is a security, stablecoins regulations and the agency's handling of FTX.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Appearing before the House Financial Services Committee on Tuesday, Gensler faced criticism from the outset of the hearing when the committee's chairman questioned him about <\/span><span data-v-f87c67ca=\"\">whether or not he views the cryptocurrency with the second-largest market capitalization, ether, as a security. <\/span><span data-v-f87c67ca=\"\">Gensler responded with previous statements about the amount of digital asset projects and tokens in violation of securities law.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I’ve never seen a field that’s so non-compliant with laws written by Congress and affirmed over-and-over by the courts,” as digital assets, Gensler said. “We talk to the crypto firms about tokens and how they can register.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chair Patrick McHenry grew exasperated with Gensler after repeatedly attempting to get him to weigh in on whether ether is a security or commodity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Give me a break, come on,” said McHenry. “There’s a lack of clarity here, can you at least agree with that?”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Gensler replied that securities laws are clear, and that the SEC enforces securities laws that require disclosures to investors on investment vehicles.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The status of ether in particular remains uncertain. Under the leadership of Gensler’s Republican predecessor, Jay Clayton, the SEC took a similar stance that almost all tokens are securities under longstanding laws, but said a small number of tokens might cease to be considered securities if they became broadly decentralized.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A <\/span><a href=\"https:\/\/www.sec.gov\/news\/speech\/speech-hinman-061418\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">2018 speech by a senior SEC official<\/span><\/a><span data-v-f87c67ca=\"\">, speaking on his own views, said that ether had reached a threshold of being decentralized enough that he no longer saw the value in applying securities laws. The official, William Hinman, was willing to set aside whether or not its initial offering, which became a model for the 2017 initial coin offering boom that started greater SEC scrutiny of digital assets, violated the law.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But Gensler has implied that ether, and any other proof-of-stake cryptocurrency, could be considered a security, seeming to disagree with those past views of senior commission officials on the world’s second-largest digital asset.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Further confusing the matter, Commodity Futures Trading Commission Chair Rostin Behnam sees <\/span><a href=\"https:\/\/www.theblock.co\/post\/218149\/cftc-head-says-stablecoins-are-in-agencys-jurisdiction-without-clear-direction-from-congress\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ether as a commodity<\/span><\/a><span data-v-f87c67ca=\"\"> falling under his jurisdiction, while New York Attorney General Letitia James <\/span><a href=\"https:\/\/www.theblock.co\/post\/218600\/new-york-sues-kucoin-claims-ether-is-an-unregistered-security\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">declared ether an unregistered security<\/span><\/a><span data-v-f87c67ca=\"\"> in an enforcement action taken against the crypto firm KuCoin.<\/span>","Ether isn’t the only crypto topic where the SEC and CFTC seem to disagree. Behnam also told reporters last month that stablecoins fall under his agency’s jurisdiction, absent a new comprehensive regulatory framework made law by Congress and the Biden administration.","Gensler signed off on an administration proposal to create that framework in 2021. But there’s skepticism over whether he and his staff actually <a href=\"https:\/\/www.theblock.co\/post\/225152\/gensler-sec-crypto-stablecoin-congress\" data-v-f87c67ca=\"\">want a law to be made around stablecoins<\/a>, as the <a href=\"https:\/\/www.theblock.co\/post\/211214\/sec-action-against-paxos-paints-regulatory-target-on-stablecoins\" data-v-f87c67ca=\"\">SEC has asserted jurisdiction<\/a> over those assets as well.","Questioned today by Rep. French Hill, R-Ark., as to whether he wants to see a law made around stablecoins, Gensler gave a qualified yes, with the caveat of, “not undermining the $100 trillion capital markets,” later adding that he supports <a href=\"https:\/\/www.theblock.co\/post\/174527\/senior-u-s-regulators-propose-new-legislation-increased-rules-around-digital-assets\" data-v-f87c67ca=\"\">recommendations for stablecoin legislation<\/a> made by a regulatory panel led by Treasury Secretary Janet Yellen.","Gensler also connected last month’s failures of Silvergate and Signature Banks as tied to their business exposure to digital assets, and noted that Circle held $3 billion in reserves for USDC with Silicon Valley Bank.","Several Republicans brought up the agency’s handling of FTX, Silvergate’s most well-known client.","Rep. Andy Barr, R-Ky., criticized the SEC for not preemptively acting on FTX before Sam Bankman-Fried’s crypto empire failed, citing the one-time multibillion dollar company’s alleged commingling of funds and well-documented accounting issues.","\"A one-time $32 billion company was run on Quickbooks,\" said Barr.","“If these companies had registered we’d actually be able to look at their books and records,” replied Gensler.","House Majority Whip Tom Emmer, a vocal advocate of digital assets, went a step further, yelling at Gensler that, “You’ve been an incompetent cop on the beat!” and accusing him of intentionally driving the digital asset industry out of the U.S.","“I’m trying to drive it to compliance and if they’re not complying with laws then they shouldn’t be offering their product to investors,” replied Gensler.","Some Democrats also pressed Gensler on his agency’s approach to digital assets, including why the SEC hasn’t prioritized enforcement actions against <a href=\"https:\/\/www.theblock.co\/post\/217075\/sec-staff-believe-binance-us-is-operating-an-unregistered-securities-exchange\" data-v-f87c67ca=\"\">offshore firms like Binance<\/a> and Tether, which cater to U.S. customers but aren’t registered in the U.S., as FTX did from its primary operations in the Bahamas.","“It seems like your enforcement priorities ignore the lessons learned from the FTX failure,” said Rep. Ritchie Torres, D-N.Y., noting investigations into U.S. crypto firms like Paxos and Coinbase.","Gensler defended the agency’s enforcement priorities, while acknowledging that offshore firms may illegally do business with U.S. customers, and that the SEC has jurisdiction in those cases.","“It takes longer to build the investigative files. It takes longer sometimes in cooperation with offshore enforcement authorities to pursue that and it is frankly, more challenging to actually get subpoenas complied with,” if a foreign company is involved, Gensler said.","Digital assets were only one of the topics of Tuesday’s general oversight hearing of the SEC, which also touched on new agency policies on environmental disclosures, SEC staff turnover, and non-crypto agency initiatives.","<em data-v-f87c67ca=\"\">Update: This story has been updated with additional information from the hearing.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Letitia James","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"William Hinman","content":"PERSON"},{"type":"Jay Clayton","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"KuCoin","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Barr","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Commodity Futures Trading Commission Chair Rostin Behnam","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Andy Barr","content":"PERSON"},{"type":"N.Y.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Tom Emmer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Ky.","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$100 trillion","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ritchie Torres","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"House Republicans grilled Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Ark.","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"McHenry","content":"PERSON"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["CONGRESS","FTX","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","PATRICK MCHENRY","ROSTIN BENHAM","SAM BANKMAN-FRIED","SEC"],"authors":["Colin Wilhelm","The Block"]}