{"summary":"Fidelity&#x27;s hunt follows the roll out of retail brokerage trading for ether and bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223190\/fidelity-hiring-crypto-token-research-team","publishDate":"2023-03-28T05:31:22","id":10934,"type":null,"title":"Fidelity is hiring for its crypto and token research team","category":["DEALS"],"content":["Asset management giant Fidelity is building out its crypto research chops, hiring for a lead for its crypto and token research development team.&nbsp;","The newly created role would be a senior position that would join its existing quantitative research and investments technology team in its asset management business, as per a job advert posted to LinkedIn.","\"They will work on data and technical frameworks for the evaluation of tokens, and the associated blockchain protocols, that form the basis of the rapidly evolving Crypto and DeFi economy,\" the firm noted in the ad.&nbsp;","Fidelity is no stranger to the crypto market, having a stood up an institutional trading and execution services team since 2018. The firm also recently opened up bitcoin and ether <a href=\"https:\/\/www.theblock.co\/post\/220298\/fidelity-crypto-quietly-went-live-giving-millions-of-retail-customers-access-to-bitcoin-ether\" data-v-f87c67ca=\"\">trading<\/a> to its retail brokerage clients. It plans to expand the offering by allowing clients to move coins on and off its platform.&nbsp;","As for the new crypto research role, the position will report into the vice president of quant development and will \"partner with other Fidelity business and technology leaders to identify and define strategic priorities based on an understanding of business value needs.\"","Fidelity is one of the largest financial-services companies in the world, offering a wide range of services including 401k products, brokerage services as well as indexing. The firm's quantitative and technology staff use data to build out various investment strategies for client portfolios.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"2018","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}