{"summary":"Digital Asset’s smart-contract language DAML is becoming compatible with more distributed ledgers, including Hyperledger Fabric and R3 Corda, as it continues to push its open-source model\nThe company is hoping compatibility with these groups will boost businesses trial blockchain without needing to commit to a single provider or overhauling their core infrastructure ","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27763\/digital-asset-eyes-enterprises-as-it-rolls-out-more-widely-compatible-app-software","publishDate":"2019-06-18T03:00:55","id":1093,"type":null,"title":"Digital Asset eyes enterprises as it rolls out more widely compatible app-software","category":["Startups"],"content":["<span data-v-f87c67ca=\"\">Blockchain development firm Digital Asset is leveraging Amazon’s data unit to make its <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/04\/digital-asset-is-making-its-smart-contract-language-open-source-to-help-more-enterprises-access-blockchain\/\" data-v-f87c67ca=\"\">open-source<\/a> smart contract language, DAML, more accessible. In particular, DAML will now be compatible with enterprise blockchain-maker giants Hyperledger Fabric and R3 Corda.<\/span>","<span data-v-f87c67ca=\"\">Digital Asset's <\/span><span data-v-f87c67ca=\"\">partnership with AWS Aurora means companies will be able to build applications using DAML and later add them to various blockchain systems. In brief, rather than re-coding a project to fit a specific ledger at a later date, the projects can now be transferred from Aurora to most blockchains with no change in code. <\/span><span data-v-f87c67ca=\"\">The firm is hoping this will open companies up to the world of blockchain without forcing them to take the leap with one single provider. <\/span>","<span data-v-f87c67ca=\"\">Co-founder and CEO of Digital Asset Yuval Rooz explained that some enterprises are conservative in their interest in blockchain because they are unready to risk committing to one ledger system over another when building infrastructure that will likely last at least a decade. Cloud compatibility mitigates this problem, according to Rooz.<\/span>","<span data-v-f87c67ca=\"\">“One of the things that we're doing with this strategy and with these announcements is we're actually allowing companies to not give up this wave of innovation by building it on traditional tech and not waiting another 10 years, but also not having to bet on which is the underlying protocol that is going to win in two to three years and allowing them to bridge [between traditional tech and blockchain],” he said.<\/span>","<span data-v-f87c67ca=\"\">Digital Asset seems to be making DAML <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/vmwares-blockchain-platform-to-integrate-digital-assets-smart-contract-language\/\" data-v-f87c67ca=\"\">as approachable as possible<\/a>, making the language compatible even with competitor ledgers like R3 Corda.<\/span>"],"hashtag":[]}