{"summary":"BIT has rolled out options trading for XRP to tap into rising interest in its market after Ripple’s partial win against the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245876\/bit-xrp-options-trading","publishDate":"2023-08-17T05:44:17","id":10941,"type":null,"title":"BIT unveils XRP options trading amid rising market interest","category":["EXCHANGES"],"content":["BIT, a crypto exchange focused on options trading, has introduced XRP options trading to capitalize on the increasing interest in the XRP market following Ripple’s <a href=\"https:\/\/www.theblock.co\/post\/239758\/ripple-ceo-calls-sec-a-bully-following-partial-win-in-xrp-ruling\" data-v-f87c67ca=\"\">partial win<\/a> against the SEC last month.","With this new addition, XRP becomes the sixth asset that can be traded as an option product on BIT’s platform, joining BTC, ETH, ADA, TON, and LADYS, as announced in a <a href=\"https:\/\/blog.bit.com\/bit-unveils-xrp-options-trading-in-response-to-soaring-interest-in-the-xrp-market\/\" data-v-f87c67ca=\"\">blog post<\/a> today.","Operating with USD denomination and settlement, BIT’s platform allows users to trade XRP options without the need to hold the underlying assets. The platform also provides a unified margin system that enables users to use all the assets in their account, including XRP, as collateral for trading purposes.","Options are a type of financial derivative where parties enter into a contract to trade an asset at a predetermined price by a set future date. The holder of the option has the choice to buy or sell the asset at the agreed-upon price but isn't obligated to do so.","BIT is collaborating with institutional liquidity provider Orbit Markets to provide the initial liquidity for the XRP options market, enabling investors to manage and hedge their portfolio risks and speculate on future prices.&nbsp;","“We are proud to become one of the first exchanges making XRP options trading accessible to both institutional and retail traders, enabling long and short for options traders at the same time,” BIT’s Global Head of Institutional Sales Justin Buitendam said.","On July 13, Ripple gained a <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">partial legal victory<\/a> when Southern District Court of New York Judge Analisa Torres dismissed certain claims from the Securities Exchange Commission that XRP should be labeled a security.","Mainstream crypto exchanges, including Coinbase and Kraken, <a href=\"https:\/\/www.theblock.co\/post\/239522\/coinbase-will-re-enable-trading-for-xrp-after-mixed-court-ruling\" data-v-f87c67ca=\"\">relisted<\/a> the cryptocurrency following the ruling as <a href=\"https:\/\/www.theblock.co\/post\/239608\/xrp-daily-volume-surges-court-ruling-exchange-relistings\" data-v-f87c67ca=\"\">daily volumes<\/a> surged 18-fold. The price of XRP initially rose nearly 100% following the news. It is currently up over 25% since before the ruling at $0.59, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/xrp\" data-v-f87c67ca=\"\">according<\/a> to CoinGecko data.","XRP investment products also marked their 16th consecutive week of inflows last week, adding another <a href=\"https:\/\/www.theblock.co\/post\/244744\/bitcoin-crypto-fund-inflows-rebound-us-inflation-data\" data-v-f87c67ca=\"\">$0.5 million<\/a>, now accounting for 12% of current assets under management with fund managers. XRP assets under management have risen 127% since the start of the year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July 13","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Justin Buitendam","content":"PERSON"},{"type":"12%","content":"PERCENT"},{"type":"127%","content":"PERCENT"},{"type":"Southern District Court of New York Judge Analisa Torres","content":"ORGANIZATION"},{"type":"USD denomination","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"$0.59","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"ADA","content":"ORGANIZATION"},{"type":"$0.5 million","content":"MONEY"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Securities Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC","XRP"],"authors":["James Hunt","The Block"]}