{"summary":"Poloniex, a centralized crypto exchange owned by Justin Sun, appears to have suffered a security hack on one of its wallets, tagged as Poloniex 4 on Etherscan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262563\/justin-suns-crypto-exchange-poloniex-seemingly-hit-by-60-million-hack","publishDate":"2023-11-10T06:37:52","id":10943,"type":null,"title":"Justin Sun&#x27;s crypto exchange Poloniex seemingly hit by hack for over $100 million","category":["EXCHANGES"],"content":["<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Update:<\/strong> The estimated value of Poloniex wallet outflows connected to the event, based on on-chain data, now exceeds $100 million.<\/em>","Centralized crypto exchange Poloniex appears to have suffered a security hack on one of its wallets, tagged as Poloniex 4 on Etherscan.","<a href=\"https:\/\/etherscan.io\/address\/0xa910f92acdaf488fa6ef02174fb86208ad7722ba\" data-v-f87c67ca=\"\">Suspicious outflows<\/a> from the apparent hot wallet indicate the incident affected a large sum of its funds, although the exchange has yet to confirm the amount.","Initial analysis of the addresses receiving the outflows suggests that over $100 million in crypto assets were taken, according to analyst firms PeckShield and <a href=\"https:\/\/platform.arkhamintelligence.com\/explorer\/entity\/893f9614-ccae-4b56-bf6e-6b072b297b5c\" data-v-f87c67ca=\"\">Arkham Intelligence<\/a>.","“Our wallet has been disabled for maintenance. We will update this thread once the wallet has been re-enabled,” the exchange <a href=\"https:\/\/twitter.com\/PoloSupport\/status\/1722934043543752968\" data-v-f87c67ca=\"\">stated<\/a> on its customer support X account.","Poloniex has operated as a centralized exchange since 2014. Tron founder Justin Sun acquired the exchange in 2019.&nbsp;","In response to the incident, Sun stated that Poloniex is conducting an investigation and has affirmed the intention to reimburse all affected user funds.&nbsp;","\"We are currently investigating the Poloniex hack incident. Poloniex maintains a healthy financial position and will fully reimburse the affected funds,\" Sun <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1722942733680296246?s=61&amp;t=55L83kfNTuoAHYQGyzx24Q\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","Furthermore, Sun <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1722951876986204259\" data-v-f87c67ca=\"\">offered<\/a> a 5% whitehat bounty to the attacker on the condition of a complete fund return, setting a seven-day deadline before initiating legal proceedings with law enforcement.","\"The Poloniex team has successfully identified and frozen a portion of the assets associated with the hacker's addresses. At present, the losses are within manageable limits, and Poloniex's operating revenue can cover these losses,\" Sun <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1723008641433784695\" data-v-f87c67ca=\"\">said<\/a> later in the day.","\"Additionally, the team have restored Poloniex's systems, preserved relevant evidence, and in the coming days, we will work diligently to gradually resume deposits and withdrawals on Poloniex, ensuring 100% security,\" he added.","<em data-v-f87c67ca=\"\">The headline was updated to reflect the total size of funds affected in the event, and further details were added throughout the article.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Poloniex","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Poloniex","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}