{"summary":"The continuing blizzard in the US has had a drastic impact on Bitcoin miners, causing many of them to shut down. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197861\/bitcoin-mining-hashrate-declines-more-than-30-amid-americas-big-winter-storm","publishDate":"2022-12-25T06:35:18","id":10944,"type":null,"title":"Bitcoin mining hash rate plunges more than 30% amid America&#x27;s big winter storm","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The continuing blizzard in the U.S. has had a drastic impact on bitcoin miners, causing many of them to shut down.&nbsp;<\/span>","Thousands of homes and businesses nationwide were without power this holiday weekend amid an Arctic blast and winter storm that tore down power lines with winds and heavy snow and dropped temperatures dangerously low, leaving at least 22 people dead, CNN <a href=\"https:\/\/www.cnn.com\/2022\/12\/24\/weather\/christmas-arctic-winter-storm-power-outages-saturday\/index.html\" data-v-f87c67ca=\"\">reported<\/a>.","<span data-v-f87c67ca=\"\">A major shake-up was occurring on the Bitcoin network with the hash rate — a measure of how much computing power is being used to process transactions — dropping significantly. Just s<\/span><span data-v-f87c67ca=\"\">ince Saturday, the mean hash rate dropped by more than 30%, down to 155 EH\/s from 230 EH\/s, according to CoinMetrics <\/span><a href=\"https:\/\/charts.coinmetrics.io\/network-data\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data<\/span><\/a><span data-v-f87c67ca=\"\">. This came as many big miners paused operations after the National Weather Service warned of the impending Arctic blast.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin mean hash rate | CoinMetrics<\/span>","<span data-v-f87c67ca=\"\">Mining firm Riot Blockchain said it was closing its Rockdale facility in Texas because of extreme weather conditions. Other miners took similar positions. Core Scientific, which recently filed for bankruptcy protection, said it would be \"participating in multiple power curtailments to help stabilize the electrical grid.\" Bitcoin production is expected to decrease during this time, Core Scientific <\/span><a href=\"https:\/\/twitter.com\/core_scientific\/status\/1606325456688422918?s=46&amp;t=EVCVKl54jNIq5nQs7Zl2Eg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said <\/span><\/a><span data-v-f87c67ca=\"\">on Twitter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Please be prepared for some ups and downs this weekend as we deal with the winter storm,\" Neil Galloway, director of mining operations at Compass Mining, said on Twitter, adding that its sites in Texas were offline. \"Because your miner is offline, people can heat their homes and cook.\"<\/span>","<span data-v-f87c67ca=\"\">The weather event has created a unique set of challenges for U.S. bitcoin miners. They depend on access to reliable electricity in order to conduct operations, and any prolonged power outages have serious implications for their ability to engage in mining activities. The U.S. accounts for the biggest share of Bitcoin's global hash rate, <\/span><a href=\"https:\/\/ccaf.io\/cbeci\/mining_map\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">at least 37%,<\/span><\/a><span data-v-f87c67ca=\"\"> according to the Cambridge Centre for Alternative Finance.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cambridge Centre for Alternative Finance","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"CNN","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Texas","content":"LOCATION"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"37%","content":"PERCENT"},{"type":"Neil Galloway","content":"PERSON"},{"type":"National Weather Service","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"this weekend","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}