{"summary":"Bitcoin miner Marathon has canceled the earnings call scheduled for Tuesday afternoon after being notified about &quot;accounting errors&quot; going as far back as 2021.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215869\/bitcoin-miner-marathon-cancels-q4-earnings-call-over-accounting-corrections","publishDate":"2023-02-28T13:10:54","id":10949,"type":null,"title":"Bitcoin miner Marathon cancels Q4 earnings call over accounting corrections","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner Marathon Digital canceled its fourth-quarter earnings call scheduled for Tuesday after the U.S. close.","The miner postponed the release of its fourth-quarter and 2022 full-year results after getting a notice from the U.S. Securities and Exchange Commission about \"accounting errors,\" according to a <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1507605\/000149315223006171\/formnt-10k.htm\" data-v-f87c67ca=\"\">filing<\/a> on Tuesday.","Those errors were related to the impairment of digital assets and impacted published results going as far back as 2021. Marathon said it intends to correct the errors and restate the impacted financial statements.","The company should have recorded revenue from its MARA pool on a gross basis and not on a net basis, the filing said.","\"The company estimates that both its revenues and its cost of revenues for the year ended December 31, 2021 were understated due to the 'net' vs. 'gross' presentation of revenues in its financial statements. As a result, both revenues and cost of revenues, energy, hosting and other are expected to increase upon completion of this restatement for 2021,\" the filing said.","However, it shouldn't have any effect on total margin, operating income or net income in 2021 or in any of the interim periods in 2021 or 2022, it added.","\"The company intends to provide additional updates at an appropriate time in the future,\" Marathon said in a press release on Tuesday.","Shares of Marathon were up 4.22% as of 12:42 p.m. EST.","The miner <a href=\"https:\/\/www.theblock.co\/post\/215493\/bitcoin-miner-marathon-expected-to-see-revenue-triple-in-q4\" data-v-f87c67ca=\"\">was expected to report $38.4 million in revenue<\/a>, triple what it posted in the previous quarter but still down year-over-year from $60.3 million, according to analyst estimates compiled by FactSet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"12:42 p.m.","content":"TIME"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"$60.3 million","content":"MONEY"},{"type":"$38.4 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Bitcoin miner Marathon Digital","content":"ORGANIZATION"},{"type":"December 31, 2021","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"4.22%","content":"PERCENT"},{"type":"FactSet","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}