{"summary":"Crypto-asset-related activities pose risks to the U.S. banking system, according to the FDIC in its 2023 annual risk review.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244938\/crypto-asset-risk-banking-system-fdic","publishDate":"2023-08-15T07:11:11","id":10952,"type":null,"title":"Cryptocurrency activities pose risk to US banking system, FDIC says","category":["REGULATION"],"content":["Cryptocurrency-related activities pose risks to the U.S. banking system, according to the Federal Deposit Insurance Corporation (FDIC) in its 2023 annual <a href=\"https:\/\/www.fdic.gov\/analysis\/risk-review\/2023-risk-review\/2023-risk-review-full.pdf\" data-v-f87c67ca=\"\">risk review<\/a>.","The FDIC, which insures deposits and supervises financial institutions in the United States, provided an entire section on crypto asset risks among the broader economic, credit, market and operational risks for banks.","After a volatile crypto market in 2022, which saw the bankruptcies of major crypto firms, including Terraform Labs, BlockFi, Celsius, Three Arrows Capital and FTX, which had a knock-on effect at collapsed crypto-friendly banks like <a href=\"https:\/\/www.theblock.co\/post\/218223\/silvergate-will-liquidate-bank-wind-down-operations\" data-v-f87c67ca=\"\">Silvergate<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/218838\/silicon-valley-bank-closed-by-california-regulator\" data-v-f87c67ca=\"\">Silicon Valley Bank<\/a>, the FDIC said “it has been generally aware of the rising interest in crypto-asset-related activities through its normal supervision process.”","“However, as this interest [by some banks to engage in crypto-asset activities] has accelerated, the FDIC determined that more information was needed to better understand the risks associated with these activities,” it added.","Crypto-assets, with their dynamic nature and rapid pace of innovation, introduce “novel and complex risks that are difficult to fully assess,” the FDIC said.","Some of the key risks identified in the report spanned from fraud, legal ambiguities and misleading or inaccurate representations or disclosures to immature risk management practices and platform vulnerabilities. The interconnections within the crypto-asset sector could also pose contagion risks for banks with significant exposure, the FDIC said. Notably, the review highlighted the potential for deposit outflows from banks holding stablecoin reserves due to stablecoin run risks.","Recognizing such risks, in April 2022, the FDIC released a Financial Institution Letter, urging FDIC-supervised institutions to inform the agency about their current and intended crypto-related activities — including crypto custody, issuing crypto assets and participating in blockchain-based payments systems such as performing node functions — to better understand and assess the associated risks.&nbsp;","In May 2022, it also finalized a rule to help address misrepresentation of the availability of deposit insurance. The FDIC sent cease and desist letters to five companies in August 2022 for falsely implying that crypto-assets were eligible for FDIC insurance.","In January 2023, a joint statement on crypto-asset risks was released by the FDIC, the Federal Reserve and the Office of the Comptroller of the Currency, emphasizing the need for banking organizations to ensure that crypto activities are conducted safely, legally and in compliance with consumer protection laws. A further statement in February highlighted the liquidity risks to banks associated with sources of funding from crypto-asset-related entities.","However, the agencies also stressed that banking organizations are neither prohibited nor discouraged from offering banking services to any particular group or category of customers, as long as it aligns with legal and regulatory guidelines.","The FDIC, alongside other federal banking agencies, said it will continue to closely monitor the crypto activities of banking organizations and is committed to robust supervisory discussions and issuing further guidance to ensure the stability and integrity of the banking system.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"August 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Federal Deposit Insurance Corporation (FDIC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["FDIC"],"authors":["James Hunt","The Block"]}