{"summary":"While the legal process plays out, a number of firms may be caught in the crossfire of the SEC&#x27;s complaint.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159239\/crypto-firms-could-face-fallout-from-sec-insider-trading-case-against-former-coinbase-employee","publishDate":"2022-07-22T20:12:00","id":10950,"type":null,"title":"Crypto firms could face fallout from SEC insider trading case against former Coinbase employee","category":["LEGAL"],"content":["The US Department of Justice (DOJ) and the Securities and Exchange Commission (SEC) on July 21 brought parallel criminal and civil actions against a former Coinbase employee, his brother and his friend for allegedly running an insider trading scheme. While the legal proceedings play out, a number of firms may be caught in the crossfire.","According to the DOJ's complaint, Ishan Wahi worked on Coinbase's assets listing team, and during his time with the firm, he allegedly tipped his brother Nikhil Wahi and friend Sameer Ramani about new coins that were slated to be listed on Coinbase. The complaint alleges the men made at least $1.5 million in illegal trades from 25 different crypto assets and at least 14 Coinbase listings. Many of those assets, the SEC contends, are securities — a claim that could affect business for firms even if they aren't the object of this enforcement.&nbsp;","The three now are facing charges of wire fraud from the DOJ. It's applying a case theory it's also <a href=\"https:\/\/www.theblockcrypto.com\/news+\/150681\/the-case-against-nate-chastain-shows-how-authorities-could-pursue-insider-trading-in-crypto\" data-v-f87c67ca=\"\">using<\/a> to prosecute former OpenSea product manager Nate Chastain, who allegedly purchased non-fungible tokens (NFTs) ahead of their listing on the NFT platform's home page and sold them for a profit. In both cases, the DOJ is using wire fraud charges to take the alleged perpetrators to task for profiting off of non-public information. Wire fraud alleges fraud took place using the \"wires,\" or in modern terms, the internet. It's a broad statute that prosecutors have used to go after a variety of activities.&nbsp;&nbsp;","The DOJ has not sought the charge of insider trading in either situation. That's because insider trading is a securities violation. Anand Sithian​​, counsel at Crowell &amp; Morning and a former trial attorney in the DOJ's Criminal Division, Asset Forfeiture &amp; Money Laundering Section, noted the DOJ hasn't touched the question of whether the digital assets at hand are securities. If the DOJ brought securities fraud charges, Sithian said, it would have to prove the underlying assets were securities, which is an additional burden rather than just proving some type of fraud occurred using the wires.","But that's not stopping the SEC.","In Chastain's case, the assets were NFTs, which for the moment seem to be squarely outside the SEC's purview. But Wahi's trading took place on Coinbase, a platform SEC Chair Gary Gensler has continuously <a href=\"https:\/\/www.theblock.co\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">called attention to<\/a> for possibly qualifying as an unregistered securities exchange. Gensler contends that many crypto tokens are likely securities, and therefore the platforms that list them should register with the SEC.&nbsp;","With that as backdrop, the SEC lodged a parallel civil <a href=\"https:\/\/www.theblock.co\/post\/158973\/sec-lists-nine-crypto-tokens-as-securities-following-coinbase-insider-trading-charges\" data-v-f87c67ca=\"\">complaint<\/a> against Wahi and his associates alleging insider trading violations, and it called out a number of tokens the men allegedly traded as securities. Those assets were: AMP, RLY, DDX, XYO, RGT, LCX, POWR, DFX, KROM.","This appeared to be the first clear communication from the SEC that it viewed these specific tokens as securities. Indeed, Coinbase's CLO Paul Grewal published a statement in response to the complaint: \"Seven of the nine assets included in the SEC’s charges are listed on Coinbase’s platform. None of these assets are securities.\"","\"We cooperated with the SEC’s investigation into the wrongdoing charged by the DOJ today. But instead of having a dialogue with us about the seven assets on our platform, the SEC jumped directly to litigation,\" his post said.","\"The SEC’s charges put a spotlight on an important problem: The US doesn’t have a clear or workable regulatory framework for digital asset securities. And instead of crafting tailored rules in an inclusive and transparent way, the SEC is relying on these types of one-off enforcement actions to try to bring all digital assets into its jurisdiction, even those assets that are not securities.\"","To be clear, Coinbase is not officially on the defense in this case. In fact, both the SEC and DOJ's cases against Wahi hinge on the idea that he allegedly violated his employee agreement with Coinbase. In other words, Coinbase is the victim of the scheme. But with the wording of its complaint, Jason Gottlieb, partner and chair of Morrison Cohen's White Collar and Regulatory Enforcement group, said the SEC has taken one more step in solidifying the idea that some digital assets, particularly those named, are securities. The exchanges that list them could be considered unregistered, yet the SEC hasn't issued a rulemaking process or provided clear communication on how the potentially liable firms should proceed.","\"The fact that the SEC has come out publicly and said that these tokens are securities is going to have an immediate and terrible impact on the price and availability of all these tokens and therefore all these projects,\" he said.","A significant portion of its filing is devoted to explaining why the SEC believes these assets are securities, and these projects could face fallout from such a public declaration even if the enforcement isn't aimed at the projects themselves. It's possible US exchanges might choose to delist the assets and US investors choose to sell, ultimately pushing these projects offshore to avoid noncompliance. Even if the SEC hasn't taken formal action against them specifically, branding them could curb some of their activity in the US.","\"What the SEC has done is sort of help itself to a win against these projects in a way, to certain kinds of injunctive relief, and I think that's not the proper way to regulate,\" Gottlieb said. \"It's not even regulation by enforcement, it's regulation by enforcement against other people.\"","The projects themselves have little recourse in this situation, according to Gottlieb. Because they aren't parties in the case, they likely won't have an avenue to contest the claims.","Still, it might never get that far. It's possible the civil proceedings might receive a stay while criminal proceedings play out, experts agreed. By the time Wahi and his associates close their criminal case, they may choose to settle with the SEC. If the case doesn't move forward in court, the SEC won't have to prove the tokens are securities, and the regulator will have branded the projects without further discussion.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 21","content":"DATE"},{"type":"$1.5 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Gottlieb","content":"PERSON"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"Asset Forfeiture &amp; Money Laundering Section","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"US Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jason Gottlieb","content":"PERSON"},{"type":"Crowell &amp; Morning","content":"ORGANIZATION"},{"type":"Criminal Division","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Sameer Ramani","content":"PERSON"},{"type":"Wahi","content":"PERSON"},{"type":"Nate Chastain","content":"PERSON"},{"type":"Chastain","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Sithian","content":"PERSON"},{"type":"Morrison Cohen's White Collar and Regulatory Enforcement","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"Nikhil Wahi","content":"PERSON"}],"hashtag":["COINBASE","SEC"],"authors":["Aislinn Keely","The Block"]}