{"summary":"GitHub has reversed a complete ban on Tornado Cash’s open source code.\nThe functionality of the code repositories remains restricted to “read-only.”","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172339\/github-restores-tornado-cashs-code-in-read-only-mode","publishDate":"2022-09-23T05:37:50","id":1095,"type":null,"title":"GitHub restores Tornado Cash&#x27;s code in &#x27;read-only&#x27; mode","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">GitHub, the internet's most widely used software hosting platform, lifted a ban on Tornado Cash’s open-source repositories on Thursday.<\/span>","<span data-v-f87c67ca=\"\">Still, the Microsoft-owned platform restored the code in “read-only” mode, making it available to only open and read the code. The move came after the U.S. Treasury<\/span><a href=\"https:\/\/www.theblock.co\/post\/163415\/tornado-cash-developer-arrest-sparks-fears-of-global-crypto-enforcement\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">clarified<\/span><\/a><span data-v-f87c67ca=\"\"> that sanctions against Tornado Cash did not apply to people’s ability to share and read the app’s code.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In August, the U.S. Treasury Department's Office of Foreign Assets Control (OFAC)<\/span><a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">blacklisted<\/span><\/a><span data-v-f87c67ca=\"\"> the use of Tornado Cash and certain Ethereum addresses connected to the app, citing use by cybercriminals for money laundering. In response to sanctions, GitHub removed all Tornado Cash code in compliance with the regulator.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then on Sept. 13, the Treasury clarified that sanctions on Tornado Cash don’t stop people from sharing its code. \"U.S. persons would not be prohibited by U.S. sanctions regulations from copying the open-source code and making it available online for others to view, as well as discussing, teaching about, or including open-source code in written publications,” an official Treasury post<\/span><a href=\"https:\/\/home.treasury.gov\/policy-issues\/financial-sanctions\/faqs\/added\/2022-09-13\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">read<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Following this clarification, GitHub modified the blanket ban on the application, though the platform did not reinstate Tornado Cash’s full functionality. Currently, it remains in read only mode, so while users can open and read the code, it cannot be modified or deployed on the platform.<\/span>","<span data-v-f87c67ca=\"\">Launched in 2019, Tornado Cash was designed as a privacy-preserving tool intended to shield users' financial activities that are visible to anyone on a public blockchain like Ethereum. Still, it became a tool for cybercriminals to obfuscate transactional activity of assets connected to illicit activities and funds procured from decentralized finance (DeFi) hacks.<\/span>"],"hashtag":[]}