{"summary":"The U.S. Treasury&#x27;s Office of Foreign Assets Control sanctioned digital currency addresses associated with a Russian military task force.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170534\/u-s-treasury-sanctions-neo-nazi-russian-wallet-addresses","publishDate":"2022-09-15T14:25:57","id":10953,"type":null,"title":"U.S. Treasury sanctions neo-Nazi Russian wallet addresses","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The U.S. Treasury's Office of Foreign Assets Control sanctioned digital currency addresses associated with a Russian military task force.<\/span>","<span data-v-f87c67ca=\"\">The sanctioned addresses included BTC, ETH and USDT that OFAC said belong to Task Force Rusich, a sabotage and reconnaissance group with neo-Nazi ties that goes by a number of aliases. In total, 22 individuals and 2 entities have been sanctioned for facilitating aggression in Ukraine.<\/span>","<span data-v-f87c67ca=\"\">“As a result of today’s action, all property and interests in property of the persons above that are in the U.S. or in the possession or control of U.S. persons are blocked and must be reported to OFAC,” <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/jy0954\" data-v-f87c67ca=\"\">the agency said<\/a>. Entities directly or indirectly owned by 50% or more by one or more of those sanctioned are also blocked.<\/span>","The U.S. and an international coalition of allies and partners have tried to substantially sever Russia’s access to the world’s financial infrastructure following its invasion of Ukraine earlier this year. Russia has been looking for new ways to process payments and conduct transactions, according to OFAC.","<span data-v-f87c67ca=\"\">The agency will also prohibit all transactions by U.S. citizens or those within the U.S. related to property or interest in property owned by designated individuals without express licensing from OFAC. Prohibitions such as making or receiving contributions, and providing funds, goods and services were specified in the list.<\/span>","<span data-v-f87c67ca=\"\">Rusich has a long history of joining Russian-backed proxies in Ukraine’s Donbas region, OFAC said. In 2015, mercenaries from the group “were accused of, and filmed, committing atrocities against deceased and captured Ukrainian soldiers,” according to the report.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury's Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Task Force Rusich","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["PAYMENTS"],"authors":["Jeremy Nation","The Block"]}