{"summary":"German VC Picus Capital launched new crypto investment arm called picus.xyz, signaling its long-term commitment to web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193677\/german-vc-picus-capital-commits-to-web3-with-new-investment-arm","publishDate":"2022-12-09T12:00:16","id":10969,"type":null,"title":"German VC Picus Capital commits to web3 with new investment arm","category":["DEALS"],"content":["German venture capital firm <a href=\"https:\/\/www.picuscap.com\/portfolio\/\" data-v-f87c67ca=\"\">Picus Capital<\/a> launched a dedicated web3 and crypto investment arm called picus.xyz.","\"Picus.xyz is not only a sign of our long-term belief and commitment to web3, but also a means for us to more effectively communicate with the web3 community, and a way to aggregate all of our know-how and value-add to prospective partners,\" the company said in a <a href=\"https:\/\/medium.com\/@picus.xyz\/announcing-picus-xyz-f8f68eeb62d7\" data-v-f87c67ca=\"\">blog post<\/a>.","The new investment arm will stay close to the firm's core thesis of investing in the early pre-seed to Series A stages, targeting web3 infrastructure and consumer products. It will invest in both equity and tokens.","Founded in 2015, Picus Capital has made <a href=\"https:\/\/www.picuscap.com\/portfolio\/\" data-v-f87c67ca=\"\">over 140 investments<\/a> including in Nested, Omni and Gatherly. The firm has already backed a number of crypto startups including staking service Stride, artificial intelligence infrastructure platform Spice AI and crypto asset management service Arch.","\"At picus.xyz we seek to partner with founders whose north star is the advancement of web3 and who are solving the hard problems in the way of the next billion users,\" the company said.","Picus Capital is known for offering dedicated teams for HR and operational support to founders. The new investment arm will offer similar support tailored to the idiosyncrasies of web3 such as token design, audit support and community management.","The investment team includes David Mirzazadeh, Daniel Niklas, Pierre Bourdan and Julius Nagel. They previously worked in the investment banking and consulting industries before joining Picus.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Picus Capital","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"Pierre Bourdan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Picus","content":"PERSON"},{"type":"Nested","content":"LOCATION"},{"type":"David Mirzazadeh","content":"PERSON"},{"type":"Daniel Niklas","content":"PERSON"},{"type":"Julius Nagel","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED","SERIES A"],"authors":["Kari McMahon","The Block"]}