{"summary":"The Israeli startup is looking to raise $10 million via convertible notes, according to a pitch deck obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215729\/crypto-wallet-zengo-is-raising-funds-at-a-flat-valuation-of-100-million","publishDate":"2023-02-28T13:17:55","id":10968,"type":null,"title":"Crypto wallet ZenGo is raising funds at a flat valuation of $100 million","category":["COMPANIES"],"content":["Cryptocurrency wallet provider ZenGo is raising funds in a Series A extension round.","The Israel-based startup hopes to raise $10 million via convertible notes before targeting a full Series B round later this year, according to a pitch deck obtained by The Block.","The Series A extension is pegged at the same $100 million post-money valuation as ZenGo's Series A round nearly two years ago, according to a separate pitch message seen by The Block. ZenGo <a href=\"https:\/\/www.theblock.co\/post\/102974\/non-custodial-crypto-wallet-zengo-20-million-series-a\" data-v-f87c67ca=\"\">bagged<\/a> $20 million in Series A funding in April 2021 from investors including Insight Partners, Austin Rief Ventures and Samsung Next. It did not disclose a valuation at the time.","\"We routinely talk to investors all the time that express interest in our company but cannot comment further on any rumored operation,” ZenGo co-founder and CEO Ouriel Ohayon said.&nbsp;","The fundraising effort comes as non-custodial wallets have risen in popularity following last year's high-profile crypto collapses, including FTX, Celsius and BlockFi. ZenGo offers a software wallet that helps users self-custody their crypto holdings rather than trust centralized players. It saw record downloads following FTX's November bankruptcy, which froze billions in client funds.","“ZenGo was built for a moment like this,” Ohayon <a href=\"https:\/\/newsdirect.com\/news\/ftx-collapse-drives-record-downloads-of-zengos-non-custodial-wallet-283673922\" data-v-f87c67ca=\"\">said<\/a> in a statement at the time. “For years we’ve focused on creating the most secure non-custodial crypto wallet with no private key vulnerability, powered by next-gen MPC cryptography.\"","MPC stands for multi-party computation; the technology is often used in self-custody tools where multiple devices can validate a transaction, removing the potential for a single point of failure.","ZenGo currently <a href=\"https:\/\/www.linkedin.com\/posts\/zengo_crypto-ceo-coinbase-activity-7036337159611518976-ZeSa?utm_source=share&amp;utm_medium=member_desktop\" data-v-f87c67ca=\"\">has<\/a> over 800,000 registered users and targets 2 million users this year and $1 million to $2 million in annual revenue, according to the deck.","Several crypto wallets have announced fresh funding rounds in recent weeks. These include OneKey raising at an $85 million valuation, Blocto <a href=\"https:\/\/www.theblock.co\/post\/213890\/blocto-crypto-wallet-closes-series-a-round-at-an-80-million-valuation\" data-v-f87c67ca=\"\">raising<\/a> at an $80 million valuation and Exodus raising over $59 million in a share subscription.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Updates with the latest number of registered users.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"$85 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Ohayon","content":"PERSON"},{"type":"$59 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Israel","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Ouriel Ohayon","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Samsung Next","content":"ORGANIZATION"},{"type":"Austin Rief Ventures","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"}],"hashtag":["SERIES A","WALLET MAKERS"],"authors":["Yogita Khatri","The Block"]}