{"summary":"U.S. Securities and Exchange Commission Chair Gary Gensler said yesterday he believes the crypto markets are “generally non-compliant” and based on a “false narrative” of decentralization.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230957\/gary-gensler-sec-crypto-false-narrative-decentralization","publishDate":"2023-05-16T07:11:13","id":10967,"type":null,"title":"SEC&#x27;s Gensler: crypto is based on &#x27;false narrative&#x27; of decentralization","category":["COMPANIES"],"content":["U.S. Securities and Exchange Commission Chair Gary Gensler said he believes the crypto markets are “generally non-compliant” and based on a “false narrative” of decentralization.","In a <a href=\"https:\/\/www.youtube.com\/live\/k-ueNvNwcnI?feature=share&amp;t=2044\" data-v-f87c67ca=\"\">question-and-answer session at the 27th annual Financial Markets Conference<\/a>, held by the Federal Reserve Bank of Atlanta yesterday, Gensler was asked about the SEC's dispute with Coinbase and crypto regulation generally, and he gave a bleak appraisal of the legal position of the crypto economy as a whole:","The session began with a speech about the SEC’s role in preventing systemic contagion in the traditional banking sector. In a throwaway remark while talking about digital banking, Gensler said “<a href=\"https:\/\/www.youtube.com\/live\/k-ueNvNwcnI?feature=share&amp;t=1050\" data-v-f87c67ca=\"\">I’m not talking about the generally non-compliant crypto markets<\/a>.”","Tom Barkin, the president and CEO of the Federal Reserve Bank of Richmond, then asked him to comment on the dispute with Coinbase. <a href=\"https:\/\/www.theblock.co\/post\/222427\/what-comes-next-after-coinbases-wells-notice\" data-v-f87c67ca=\"\">The SEC has served Coinbase with a Wells notice<\/a> (probably based on the suspicion that Coinbase may be marketing unregistered securities) and in response <a href=\"https:\/\/www.theblock.co\/post\/228283\/coinbase-vs-the-sec-a-gamble-to-take-on-a-regulator-undefeated-on-crypto\" data-v-f87c67ca=\"\">Coinbase sued the agency<\/a> in an attempt to force it to make new rules for the crypto industry.","“Why doesn’t the SEC want to publish rules for that market?” Barkin asked.","“Because, Tom, the rules have already been published and to make it quite direct this is a field that has been <a href=\"https:\/\/www.theblock.co\/post\/228649\/gary-gensler-crypto-compliance\" data-v-f87c67ca=\"\">operating largely non-compliant<\/a>. Our agency has put out rules about what it is to be an exchange, what it means be a broker-dealer, what it is to be an adviser of custody and assets, and how to register a securities offering. Those rules are in existence and there’s nothing about a new technology that makes it non-consistent with the public policies that Congress has laid out.”","“We’ve looked at the intermediaries in the middle,” he said. “Financial intermediaries in the middle, nodes in the network, and they need to come into compliance if they’ve got securities on their platforms.”","“We stand ready to help those intermediaries come into compliance. I would say that their business models though tend to be built on non-compliance. Their business models tend to be built on customer funds, commingling it, they’re rife with conflicts, Tom. We wouldn’t let the New York Stock Exchange operate direct on the exchange as market makers, as a hedge fund, and commingle all these things, and have a token themselves and raise money off the token, leverage off, borrow off the token, and not even give public disclosure in a proper way. All we call upon in our rules for the tokens is, register and have full, fair and truthful disclosure and the intermediaries to register, of course. Deal with the conflicts and ensure they have time-tested rules against fraud and manipulation and the like.”","Gensler then expanded into the SEC’s philosophy on how the regulation of securities relates to crypto, by summarizing a legal doctrine known as the Howey test. “If the public is investing money anticipating profit, based on the efforts of others, in a common enterprise, that’s a security, an investment contract.”","<span data-v-f87c67ca=\"\">Gary Gensler speaking at the meeting of the Atlanta Fed.<\/span>","He also talked more broadly about the disconnect between the way crypto natives see their industry and the way the government sees it, arguing that most “decentralized” platforms or protocols are in fact actually centralized around a few operators in some way.","“We don’t know who Satoshi Nakamoto is yet, who she, or he, or they, were. It’s a field built off of sort of a concept to not use centralization even though finance since antiquity tended toward centralization. To be decentralized, lack of authorities, anti-commercial bank, anti-central bank, a worldwide off-the-grid approach. And yet it very much relies on the law when they go bankrupt and they’re in bankruptcy court. And you know what we’ve seen.”","“But there’s this field that arose where the investing public, 24 hours a day, seven days a week, around the globe — it’s not just a U.S. market it’s largely an international market — is investing their hard-earned money hoping for a better future and that therein lies the core of what a security is… It’s a false narrative to say that these things are that decentralized. They tend toward centralization. You can find a website for nearly [all]. If there’s 12,000 or 23,000 tokens you can find some group of entrepreneurs in a website, in a Reddit channel, in a Twitter channel around most of these, again without prejudging any one of them.”","Toward the end of his comments, Gensler related the increasing links between crypto and traditional finance, in the context of whether a “fire” might start in one sector that could get out of control.","The collapse of First Republic Bank, <a href=\"https:\/\/www.theblock.co\/post\/218838\/silicon-valley-bank-closed-by-california-regulator\" data-v-f87c67ca=\"\">Silicon Valley Bank<\/a> and Signature Bank were the second-, third- and fourth-largest bank failures in U.S. history. A smaller bank, Silvergate, also collapsed. SVB, Signature and Silvergate all had significant exposure to crypto clients and assets.","“Recent banking issues, the four banks that failed, two of them had significant crypto books, the third had a significant stablecoin issuer put their deposits there and it actually led to a depegging, it was called, for the second-largest stablecoin operator. So there was even some interconnectedness in crypto markets and crypto actors with at least three of these banks,” Gensler said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Atlanta Fed","content":"ORGANIZATION"},{"type":"Silvergate","content":"ORGANIZATION"},{"type":"Tom","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"Tom Barkin","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Federal Reserve Bank of Richmond","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"First Republic Bank","content":"ORGANIZATION"},{"type":"Financial Markets Conference","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Federal Reserve Bank of Atlanta","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["GARY GENSLER","SEC"],"authors":["Jim Edwards","The Block"]}