{"summary":"This is the firm&#x27;s first earnings report after its long awaited direct listing, and results are consistent with its March projections.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104847\/coinbase-doge-q1-earnings","publishDate":"2021-05-13T18:00:20","id":10979,"type":null,"title":"Coinbase says it will soon support DOGE in Q1 earnings","category":["STARTUPS"],"content":["Coinbase published its Q1 2021 earnings today, which showed that the exchange hit the targets it set in its estimated results this March.","According to its investor letter, Coinbase saw strong results thanks to its public debut and the ongoing growth of the crypto industry: \"The wind is in our sails right now, and it feels good.\"","This is the firm's first earnings report after its long-awaited direct listing on Nasdaq this <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101715\/coinbase-nasdaq-direct-listing-first-day-ends\" data-v-f87c67ca=\"\">April<\/a>. In March, ahead of the debut, it reported an estimated $1.8 billion in total revenue. It hit the mark, according to today's results.","It also hit $335 billion in total volume — a metric also projected in the estimated report. That's a more than 275%<strong data-v-f87c67ca=\"\">&nbsp;<\/strong>jump from $89 billion last quarter. About $120 billion came from retail activity, with the remaining $215 billion coming from institutions. The growth can be partially credited to a mass of new participants in the crypto economy, according to Coinbase.","As many assets hit all-time highs and displayed high levels of volatility, venues saw an influx of participants. Coinbase saw a jump from 43 million verified users last quarter to 56 million verified users. Monthly transacting users more than doubled from 2.8 million to 6.1 million. This translated to $771.5 million in net income.&nbsp;","Crypto market capitalization reached $2 trillion after sitting at $782 million last quarter, and 11.3% of that market cap, or $223 billion, is on Coinbase.","Though the growth of the industry helped Coinbase produce a strong quarter, it also acknowledged that more competition creates more challenges.&nbsp;","\"Our competitors are supporting certain crypto assets that are experiencing large trading volume and growth in market capitalization that we do not currently support, as well as offering new products and services that we do not offer. We welcome these challenges as they indicate that the market we serve is growing rapidly, but we also have to continue to move quickly to address them, and that inspires us towards action and growth.\"","The exchange still doesn't support DOGE, the dog meme-themed cryptocurrency whose price has risen dramatically recently thanks to a movement on social media. Coinbase has yet to onboard the token and competitors like Robinhood remain key access points during the rally. But on the earnings call, CEO Brian Armstrong said it plans to list DOGE in the next six to eight weeks.&nbsp;","\"We're putting a lot of work and thought into how to accelerate our asset onboarding, including DOGE,\" said Armstrong.","In the coming months, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/99345\/coinbase-alumni-soups-ranjan-startup-sardine-4-6-million\" data-v-f87c67ca=\"\">Coinbase<\/a> will devote more resources to onboarding assets more quickly, accelerating the legal and cybersecurity checks as well as distributing onboarding resources to teams behind tokens.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2 trillion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$120 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$335 billion","content":"MONEY"},{"type":"$771.5 million","content":"MONEY"},{"type":"$215 billion","content":"MONEY"},{"type":"$223 billion","content":"MONEY"},{"type":"11.3%","content":"PERCENT"},{"type":"275%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$89 billion","content":"MONEY"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"$782 million","content":"MONEY"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"last quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Aislinn Keely","The Block"]}