{"summary":"Crypto exchange bitFlyer Europe has integrated with PayPal.\nThe move means bitFlyer users can now deposit euros using their PayPal accounts to buy cryptocurrencies.\nJacek Bastin, business strategy manager at bitFlyer Europe, told The Block: “The integration is all about removing barriers to entry.”","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78279\/bitflyer-europe-paypal-integration","publishDate":"2020-09-20T19:00:52","id":1097,"type":null,"title":"Crypto exchange bitFlyer Europe links up with PayPal, enabling account deposits with euros","category":["Exchanges"],"content":["Crypto exchange bitFlyer Europe has announced an integration with PayPal.","The move means bitFlyer users can now deposit euros using their PayPal accounts to buy cryptocurrencies.&nbsp;\"What we have done is that we have integrated PayPal in the same way e-commerce websites would,\" Jacek Bastin, business strategy manager at bitFlyer Europe, told The Block. \"The integration is all about removing barriers to entry.\"","Indeed, PayPal is a dominant payment method in Europe, with about 35% market share, said Bastin. \"So that's a clear milestone for us, and enables us to follow our mission to make crypto more accessible for all, especially newcomers,\" he added.","As for how the integration would work in practical terms, bitFlyer Europe users will be redirected to PayPal's website when selecting the payment method to deposit funds. The fund transfers would be \"close to instant,\" said Bastin. Traditional payment methods can take up to three business days for deposits to clear.","\"We're proud to offer users the opportunity to use their PayPal accounts to deposit funds for purchasing crypto,\" said Andy Bryant, COO of bitFlyer Europe.","Currently, no crypto exchange allows depositing funds via PayPal accounts. Coinbase, which has a longstanding relationship with PayPal, <a href=\"https:\/\/help.coinbase.com\/en\/coinbase\/getting-started\/adding-a-payment-method\/paypal-faq\" data-v-f87c67ca=\"\">allows only withdrawals<\/a> to users' PayPal accounts. The Block has reached out to Coinbase about whether the exchange would also enable deposits via PayPal in the near future, and will update this story should we hear back.","Peer-to-peer (P2P) exchanges, such as LocalBitcoins and Paxful, allow buying crypto via PayPal, but that is not a direct integration. On these platforms, buyers and sellers transfer funds from and to their PayPal accounts for trades. \"That is a C2C [customer-to-customer] relationship, ours is a B2C [business-to-customer],\" Bastin told The Block.","Brokerage firm eToro also <a href=\"https:\/\/www.etoro.com\/crypto\/trading-platform\/\" data-v-f87c67ca=\"\">allows<\/a> buying crypto via PayPal. The option works as a normal PayPal transaction, an eToro spokesperson told The Block, adding that in the U.S., eToro currently only accepts deposits by wire and ACH transfers.","For bitFlyer Europe, PayPal is an intermediary and a bridge between users and the exchange, Bastin told The Block.","bitFlyer Europe was launched in January 2018 and is a fully-owned subsidiary of its Japanese parent bitFlyer. The exchange also operates in the U.S. It currently has about 1.25% <a href=\"https:\/\/www.theblockresearch.com\/crypto-august-by-the-numbers-77040\" data-v-f87c67ca=\"\">market share<\/a> in terms of trading volumes, according to The Block Research, and is recognized as one of a few exchanges with legitimate volumes.","","","PayPal has reportedly <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72177\/paypal-has-reportedly-partnered-with-paxos-to-launch-its-crypto-service\" data-v-f87c67ca=\"\">been looking to offer<\/a> a crypto trading service via its app. The payment giant is said to have partnered with Paxos Crypto Brokerage to launch such a service.","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">This story has been updated to include comments from an eToro spokesperson.&nbsp;<\/em><\/span>"],"hashtag":[]}