{"summary":"OpenChat, an on-chain messaging app, raised over $5.5 million in a community-driven crowdfunding sale.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217854\/openchat-to-transfer-control-to-community-after-5-5-million-decentralization-sale","publishDate":"2023-03-07T17:00:52","id":10975,"type":null,"title":"OpenChat to transfer control to community after $5.5 million &#x27;decentralization sale&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["OpenChat, an on-chain messaging platform based on the <a href=\"https:\/\/www.theblock.co\/linked\/104146\/dfinity-launches-internet-computer\" data-v-f87c67ca=\"\">Internet Computer<\/a> blockchain, will soon transfer control of the messaging app to a decentralized, token-based governance system via the Service Nervous System (SNS), its team said.","This comes shortly after the project raised more than $5.5 million in a crowdfunding sale <a href=\"https:\/\/dashboard.internetcomputer.org\/account\/a2200978cf15fa0d19b7c7eb75cc5d6d3ebabbacaec64a2a9a3f811277619c57\" data-v-f87c67ca=\"\">conducted<\/a> last week.","Its recent token sale, which had 2,375 participants, allowed them to buy OpenChat's native governance tokens to form a decentralized autonomous organization (DAO). After the sale, the OpenChat team said that the on-chain messaging platform will be owned and controlled by its community of chat token holders, not a centralized tech firm.","\"OpenChat users can become consumers, shareholders, and decision-makers and actively decide the platform's future. For example, if the community accepts a proposal, including a code update, it will be implemented by the SNS automatically instead of a single entity making a unilateral decision,\" Matt Grogan, co-founder of OpenChat, said in an interview with The Block.","The newly raised funds from the token \"decentralization sale\" will be held in OpenChat's DAO treasury, and chat holders will decide how best to utilize them, the team said. The platform will allow users to vote directly on new proposals for upgrades, features, and treasury allocations via the Service Nervous System (SNS), a governance system model used on the Internet Computer.","“From now on, OpenChat will be owned and controlled by its community of chat token holders. The platform allows users to vote directly on new proposals for upgrades, features, and treasury allocations via a Service Nervous System (SNS) which provides an algorithmic DAO-like model,\" Grogan said.","<a href=\"https:\/\/oc.app\" data-v-f87c67ca=\"\">OpenChat<\/a> is a decentralized messaging platform that runs fully on-chain, including both the front- and back-end of the platform. In addition to typical social media messaging features, the platform is bundled with crypto-native add-ons, such as the ability to send and swap crypto tokens on Internet Computer.","Instead of traditional social media accounts that depend on email IDs and a unique username, OpenChat makes use of crypto addresses and NFTs for authentication and monetization purposes. This setup puts users, rather than a centralized company, in control of the content and personal data associated with accounts.","Scalability is a big issue for decentralized social media since such products are both data-intensive and involve a high throughput of transactions. Blockchains usually struggle with both of these issues. In response to the scalability matter, the OpenChat team said Internet Computer's architecture and its own governance model might be enough to meet any scaling challenges.","<span data-v-f87c67ca=\"\">\"The Internet Computer's architecture enables OpenChat to accommodate a large number of users without harvesting user data, or pushing an ad revenue model,\" Grogan added. \"This network also allows OpenChat to remain 100% on-chain, so it doesn’t have to rely on third-party cloud computing services.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grogan","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Matt Grogan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$5.5 million","content":"MONEY"},{"type":"Internet Computer","content":"ORGANIZATION"},{"type":"SNS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}