{"summary":"The Starknet Foundation plans to distribute 1.8 billion tokens as user rewards and network rebates, with precise details still to come.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266724\/starknet-foundation-plans-to-distribute-1-8-billion-tokens-as-rewards-transaction-rebates","publishDate":"2023-12-08T07:30:04","id":10978,"type":null,"title":"Starknet Foundation plans to distribute 1.8B tokens as rewards, rebates","category":["CRYPTO ECOSYSTEMS"],"content":["The Starknet Foundation, the organization behind the Ethereum Layer 2 network Starknet, plans to distribute 1.8 billion tokens as user rewards and rebates, with precise details still under development.","The foundation will employ various groups or “committees” to oversee the broader distribution of these Layer 2 blockchain tokens, according to a statement.","One specific committee, the “Provisions Committee,” will be tasked with rewarding users, including rewarding community members with tokens. This committee will distribute 900 million Starknet (STRK) tokens in a phased manner to reward past and future contributions by users and community members. This initial distribution phase may begin in the first half of 2024.","This plan follows the foundation’s recent <a href=\"https:\/\/www.theblock.co\/post\/265588\/starknet-foundation-confirms-screenshots-showing-draft-airdrop-plans-says-snapshot-already-taken\" data-v-f87c67ca=\"\">confirmation<\/a> of a token airdrop snapshot, which became known after a draft of the eligibility criteria (for the planned airdrop) briefly appeared on its website and was circulated on social media.","“We’ve been working on the first phase of distributions for a while now, and we are close to getting this over the line. There’ll be more formal communications on this soon,” the Starknet Foundation said.","Besides the rewards, the foundation is planning “user rebates” to subsidize or refund transaction costs. A second committee, according to the foundation, will distribute 900 million tokens — covering transaction fees for users on the network.","“Planning for this initiative is currently underway, and a new committee is being formed to oversee the distribution of STRK to reward users for their vital transactions on the network,” the foundation added.","Additionally, a third group, the “DeFi Committee,” will allocate an initial 50 million to encourage activity on DeFi protocols within the network, with the goal of “boosting liquidity” for the network's DeFi ecosystem.","The Starknet Foundation previously <a href=\"https:\/\/www.theblock.co\/post\/157323\/starkware-confirms-launch-of-starknet-token-with-no-airdrops-until-next-year\" data-v-f87c67ca=\"\">detailed<\/a> that a total of 10 billion Stark (STRK) tokens would be issued. Of these, 50% would be retained by the organization, with the remainder allocated to core developers, ecosystem contributors and the community.","Starknet operates as a decentralized Layer 2 network on Ethereum, using a zero-knowledge roll-up solution. This solution condenses multiple transactions on an off-chain layer before collectively publishing them on the Ethereum network.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"“DeFi Committee","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"“Provisions Committee","content":"ORGANIZATION"},{"type":"the first half of 2024","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Starknet Foundation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}