{"summary":"After over four years of work, zkSync is approaching its highly anticipated mainnet launch later this month. Here&#x27;s everything you need to know.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178896\/zksync-to-launch-on-mainnet-this-month-what-you-need-to-know","publishDate":"2022-10-21T07:29:28","id":10977,"type":null,"title":"ZkSync to launch on mainnet this month: What you need to know","category":["LAYER 2S AND SCALING"],"content":["After over four years of preparation, zkSync is approaching its highly anticipated launch.&nbsp;","One of the largest debates in the industry is how Ethereum will scale, and which methods or technologies will be the most successful. As a result, zkSync's launch will be a pivotal moment for Ethereum, as it’s the first time zkSync’s novel scaling approach will be stress-tested in a live environment.&nbsp;","ZkSync is a complicated piece of technology — with words like “zkEVM” making it a challenge to understand. Let's break down what zkSync is, when it is launching and what makes it different from other Ethereum scaling solutions.&nbsp;","ZkSync is a novel approach to fixing Ethereum's scaling woes. It’s one of the first applications of a technology called zero-knowledge proofs, and it’s claiming to be the first to use this technology in a way that’s natively compatible with Ethereum applications.&nbsp;&nbsp;","In short, zkSync wants to provide much-cheaper and faster transactions on the Ethereum blockchain, and also be home to many popular Ethereum applications. If successful, we could see major decentralized exchanges and DeFi protocols expand to the zkSync layer — letting crypto users access this tools at a lower cost.&nbsp;","More specifically, zkSync is a Layer 2 protocol. This means it is a layer that’s built on top of Ethereum and <a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">provides<\/a> scalability benefits. Ethereum’s plan to scale is through a system of multiple layers, each one building on top of Ethereum and inheriting its security. ZkSync wants to provide an alternative to the current Layer 2 options, such as Arbitrum and Optimism.&nbsp;","ZkSync is being built by a team called Matter Labs. On the team is Head of Product Steve Newcomb, who founded Powerset, which was acquired by Microsoft and later became part of Microsoft Bing. Alongside him is Head of Engineering Anthony Rose, who led engineering teams at SpaceX for several years, building software for Falcon, Dragon, and Starlink.&nbsp;","Currently, zkSync is running on a testnet, which has been operational since February. Users are able to interact with the platform and applications built on it ahead of the mainnet launch.&nbsp;","The mainnet launch itself is broken down into several different stages. Each stage is designed to progressively build up and stress test various parts of the network before allowing access to masses of users or providing other projects with the ability to fully deploy on it.&nbsp;","The first launch is called the Baby Alpha stage. It will take place on Oct. 28. This will see the network running — but without any external projects, to ensure the entire network is working properly before its ready for prime time.&nbsp;","Once this is accomplished, the Fair Launch Alpha will begin. This is expected later this year and will allow ecosystem projects and a limited number of users to port over.&nbsp;&nbsp;","The final stage is the Full Alpha, which will <a href=\"https:\/\/docs.zksync.io\/userdocs\/roadmap\/\" data-v-f87c67ca=\"\">allow<\/a> all projects and users to deploy and use zkSync. The team is planning to have this ready by the end of the year.&nbsp;","The main reason why the launch of zkSync is meaningful for Ethereum is because it will bring faster transaction speeds at a lower cost.&nbsp;&nbsp;","Upon launch, zkSync will offer transactions that are up to 10x to 20x faster and cheaper than using the main Ethereum blockchain. This will provide an alternative way for crypto users to use the blockchain — particularly when more applications are available on zkSync.&nbsp;","“We will finally be able to see scaling occur so that there's thousands and thousands of transactions per second ultimately, and that the the fees for using Ethereum can go down and down and down to the point where the number of use cases, the number of apps coming on board and the number of users coming on board can finally reach mass adoption,” <a href=\"https:\/\/www.theblock.co\/post\/173663\/zksync-head-of-product-ethereum-learning-to-scale-will-be-like-coming-out-of-platos-cave\" data-v-f87c67ca=\"\">said<\/a> Newcomb on The Scoop.&nbsp;","Another major element to zkSync is that it claims to be the first zkEVM to launch its mainnet.&nbsp;","ZkEVM, short for Zero Knowledge Ethereum Virtual Machine, allows developers to build zero-knowledge applications using the industry standard coding language Solidity. The ability to use Solidity means developers can build applications using the same language and tools they would use on Ethereum, and easily transition to zkSync once it's live.&nbsp;&nbsp;","The important thing here is that zero-knowledge technology potentially offers greater scalability than other scaling solutions. Until now, projects haven’t been able to offer such scalability combined with the benefits of running an Ethereum Virtual Machine.&nbsp;","The result is that it may provide a very tempting environment for Ethereum developers and applications. Not only may it offer strong scalability, but it will also allow for projects to be ported to the network quickly and easily. For this reason, many protocols are also <a href=\"https:\/\/www.theblock.co\/post\/177141\/decentralized-exchange-protocol-uniswap-v3-is-deploying-on-zksync-2-0\" data-v-f87c67ca=\"\">expected<\/a> to expand from the main Ethereum blockchain to zkSync and migrate from other blockchain ecosystems.&nbsp;","“The amount of projects that have requested to port to us has ranged from people who were on alternative layer one solutions, people who were on Ethereum, people who were on optimistic roll ups, people who are on the Polygon sidechain and then a lot of projects from StarkWare are coming to us and saying, can we port?” Newcomb explained. “We are seeing just a firehose come at us of how many projects want to launch.”&nbsp;","Newcomb added that it will probably take around nine months to bring on all of these projects because the team doesn’t want to bring on too many in the beginning and face sudden scaling issues.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anthony Rose","content":"PERSON"},{"type":"Zero Knowledge Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Steve Newcomb","content":"PERSON"},{"type":"Falcon","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Full Alpha","content":"ORGANIZATION"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Starlink","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Powerset","content":"ORGANIZATION"},{"type":"Dragon","content":"ORGANIZATION"},{"type":"Fair Launch Alpha","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Oct. 28","content":"DATE"},{"type":"Newcomb","content":"PERSON"},{"type":"Microsoft Bing","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","ZKSYNC"],"authors":["Mike Truppa","The Block"]}