{"summary":"London could be losing its place as a conference hotspot with Token2049 and DAS not returning to the city this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222649\/london-paris-crypto-conference-hotspot","publishDate":"2023-03-28T04:23:01","id":10985,"type":null,"title":"London loses ground to Paris in battle for crypto conference crown","category":["COMPANIES"],"content":["London's place in the crypto conference hierarchy is slipping, as two key events have been dropped by planners for 2023.","Both Token2049 and Blockworks' Digital Assets Summit, which respectively played host to <a href=\"https:\/\/twitter.com\/token2049\/status\/1598283905471500290\" data-v-f87c67ca=\"\">over 2,500<\/a> attendees and <a href=\"https:\/\/twitter.com\/Blockworks_\/status\/1576933439097384962\" data-v-f87c67ca=\"\">600 institutions<\/a> last year, have decided not to return to the UK capital.","The organizers of Token2049 confirmed in a statement to The Block that Token2049 Singapore will be its only event this year, but did not share why they had decided to turn away from London.","Meanwhile Blockworks has decided to move its Digital Assets Summit from both New York and London to Washington, D.C.","\"Why are we moving DAS to DC?\" the company said in a<a href=\"https:\/\/twitter.com\/Blockworks_\/status\/1638945846577475589?s=20\" data-v-f87c67ca=\"\"> tweet thread<\/a> last week. \"The aim is simple. We want to get regulators, policymakers and the brightest minds in crypto together in one room, speaking the same language.\"","DAS won't return at all this year and will instead kick off in its new location in March next year. In 2022, both Token2049 and DAS events took place toward the end of the conference year, in November and October respectively.&nbsp;","\"Whilst it's disappointing to see two of the major industry events not taking place in the UK, we are certain this is a short break and not an end to these events returning in future years,\" Su Carpenter, director of operations for trade association group CryptoUK, said in a statement.","\"At times when organisations are having to prioritize their resources on more operational costs to ensure regulatory readiness, budgets will be repositioned differently than in previous years and <span class=\"markmoss9wa4j\" data-markjs=\"true\" data-ogac=\"\" data-ogab=\"\" data-ogsc=\"\" data-ogsb=\"\" data-v-f87c67ca=\"\">su<\/span>rplus spend on activities like sponsorship and attendance to some of these higher cost, bigger events will most likely be a lower a priority,\" she added.","Many industry insiders had expected event organizers to scale back this year in the face of a ferocious bear market and challenging macro environment, which has hit company balance sheets and <a href=\"https:\/\/www.theblock.co\/post\/206479\/weekly-wrap-up-big-funding-rounds-layoffs-and-ftx-developments\" data-v-f87c67ca=\"\">resulted<\/a> in widespread layoffs. Yet event organizers <a href=\"https:\/\/www.theblock.co\/post\/195621\/swanky-crypto-meetup-scene-unlikely-to-cool-down-much-despite-downturn\" data-v-f87c67ca=\"\">told<\/a> The Block last year that it would still be full steam ahead in 2023.","Even so, the UK is suffering as some of the biggest success stories take place across the English Channel, including <a href=\"https:\/\/www.nftparis.xyz\/\" data-v-f87c67ca=\"\">NFT Paris<\/a> and <a href=\"https:\/\/www.parisblockchainweek.com\/\" data-v-f87c67ca=\"\">Paris Blockchain Week<\/a>.","In true bull-market style, Paris Blockchain Week saw events and parties hosted in impressive venues from a VIP dinner <a href=\"https:\/\/twitter.com\/twobitidiot\/status\/1638256565563060241\" data-v-f87c67ca=\"\">within the famous art gallery the Louvre<\/a> to <a href=\"https:\/\/twitter.com\/pudgypenguins\/status\/1624877539196915712\" data-v-f87c67ca=\"\">degen boat parties<\/a> on the Seine river. Meanwhile <a href=\"https:\/\/www.parisblockchainweek.com\/speakers\/gasly\" data-v-f87c67ca=\"\">Formula One driver Pierre Gasly<\/a> and legendary crypto investor <a href=\"https:\/\/www.parisblockchainweek.com\/speakers\/draper\" data-v-f87c67ca=\"\">Tim Draper<\/a> took to the stage in keynote speeches.","<span data-v-f87c67ca=\"\">View from NFT project Doodles' NFT Paris party (Lucy Harley-McKeown\/The Block)<\/span>","Michael Amar, chairman of Paris Blockchain Week and &nbsp;general partner at V3ntures, estimated that last week's event attracted about 8,500 people.&nbsp;The organizers were aiming for around 10,000 attendees but expected attendance to be somewhat impacted by the bear market and the strikes happening in Paris during the event. It still remained a record turnout as last year saw about <a href=\"https:\/\/www.parisblockchainweek.com\/media\" data-v-f87c67ca=\"\">6,000 people<\/a> attend.","Around 18,000 people were seen on site next to the Eiffel Tower at NFT Paris, the conference's founder Alexandre Tsydenkov told The Block. This included French first lady Brigitte Macron.&nbsp;","David An, a partner at European venture firm <a href=\"https:\/\/greenfield.xyz\/\" data-v-f87c67ca=\"\">Greenfield Capital<\/a>, believes events such as Paris Blockchain Week and others across Europe can fill the gap left by those which have deserted London.","\"As there are a number of quite good smaller events across Europe, I think, the opportunities to catch up with builders and to be part of a very active and vibrant European crypto community are still there,\" said An in an email to The Block. \"Despite that, there's enough room for new big summits where the whole industry could meet.\"","Amar has heard from several people in the industry that they are scaling back when it comes to event attendance. In this environment, brand becomes incredibly important, he added.","\"People who could attend six or seven conferences, or sponsor six or seven conferences, are back to two or three,\" Amar said.","It takes almost a year to pull off Paris Blockchain Week with the help of over 20 full-time staff, Amar said. It can be challenging to execute a top tier event across multiple locations, he added.","\"When you think about conferences trying to do two locations, there's lots of respect because it's a lot,\" Amar said. \"For us, it's nine to 10 months really full-time just to produce one week of events.\"","What's driving the success of crypto events in European hubs such as Paris and Berlin?","For Paris, Amar believes it's a combination of factors, from strong travel links which bring in an international crowd, to the city also being a hub for blockchain engineers and home to several web3 unicorns, such as Ledger and The Sandbox.","\"NFT and metaverse is good for art, fashion and luxury, which Paris is pretty good about,\" Amar said.","<span data-v-f87c67ca=\"\">Paris Blockchain Week 2022 event space (Andrew Rummer\/The Block)<\/span>","With the U.S. cracking down on crypto companies and the regulatory environment remaining uncertain, many founders are looking to other hubs such as Paris, Lisbon and Dubai, which are providing clearer guidance, Amar added.","In February, the UK <a href=\"https:\/\/www.theblock.co\/post\/207488\/the-uk-finally-reveals-plan-to-regulate-crypto-trading-and-lending\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">unveiled<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> its plans for regulating crypto trading and lending. The consultation paper from the Treasury outlined a new crypto regulatory framework that will cover a range of industry issues from consumer protection to crypto issuance. CryptoUK's Carpenter sees this as a positive for the country putting it back on equal footing with other hubs in Europe.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\"> However on Monday, the UK Treasury <a href=\"https:\/\/www.theblock.co\/post\/223181\/uk-government-nft-canceled-royal-mint\" data-v-f87c67ca=\"\">announced<\/a> it was no longer moving forward with the launch of its non-fungible token. Its Royal Mint NFT was part of plans to make the nation a more appealing hub for crypto innovation, the decision to halt the launch appears to be another set back for the country's adoption of digital assets.<\/span>","\"I believe as the industry here in the UK moves through our regulatory consultation period and there is more stability across the sector, we will see the return of these events, and possibly more, to the UK as we aim to take a leading global role when it comes to innovation and opportunities for crypto and digital asset businesses,\" Carpenter said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Su Carpenter","content":"PERSON"},{"type":"Brigitte Macron","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Paris","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Pierre Gasly","content":"PERSON"},{"type":"Berlin","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Alexandre Tsydenkov","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Lucy Harley","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"Tim Draper","content":"PERSON"},{"type":"Carpenter","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Paris Blockchain Week","content":"LOCATION"},{"type":"Louvre","content":"LOCATION"},{"type":"Lisbon","content":"LOCATION"},{"type":"Michael Amar","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Greenfield Capital","content":"ORGANIZATION"},{"type":"Andrew Rummer","content":"PERSON"},{"type":"Royal Mint NFT","content":"ORGANIZATION"},{"type":"Carpenter","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"DAS","content":"ORGANIZATION"},{"type":"Amar","content":"PERSON"},{"type":"Blockworks' Digital Assets Summit","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"McKeown","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"March next year","content":"DATE"},{"type":"Paris Blockchain Week","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kari McMahon","The Block"]}