{"summary":"Crypto staking services provider Staked has entered into the asset management space with its new ETH trust product.\nThe Staked ETH Trust gives investors both exposure to ETH and staking rewards.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99366\/staked-ether-eth-trust-earn-staking-rewards","publishDate":"2021-03-25T10:00:19","id":1098,"type":null,"title":"Staked launches ETH trust that allows users to also earn staking rewards","category":["Ethereum"],"content":["Crypto staking services provider Staked has entered into the asset management space with its new ether (ETH) trust product.","<a href=\"https:\/\/staking.staked.us\/eth-trust\" data-v-f87c67ca=\"\">The Staked ETH Trust<\/a> gives investors both exposure to ETH and staking rewards of about 7.5% annually, as opposed to Grayscale Ethereum Trust and other similar products that provide exposure to ETH only.","Staked co-founder and CEO Tim Ogilvie told The Block that purchasing, custodying, and staking crypto assets is \"complicated\" for traditional investors. Thus, the firm wanted to offer all of these services in one vehicle.","\"We believe that when staking is made easy for a larger pool of capital, the levels of participation will grow significantly,\" said Ogilvie. Staked is <a href=\"https:\/\/www.theblockcrypto.com\/daily\/88762\/ethereum-2-proof-of-stake-power-concenration\" data-v-f87c67ca=\"\">one of the largest validators <\/a>of ETH.&nbsp;","The sponsor of the Staked ETH trust is Staked Capital, a wholly-owned subsidiary of Staked Securely. The custodian of the product is Fireblocks, and Staked Cayman Ltd provides staking services.","The product has an expense ratio of 1% and is open only by private placement to accredited investors. The minimum investment amount is $25,000, and investors face a 12-month lock-up period.","Like most crypto trust products in the market today, Staked ETH trust doesn't have a redemption mechanism in place. But Ogilvie told The Block that Staked will look to enable liquidity for the product by listing the trust's shares on over-the-counter markets.","Staked had been working on the ETH trust for the last six months, Ogilvie told The Block, adding that now is a good time to launch it because ETH is going through a \"major evolution\" and there is broader institutional interest in crypto.","\"Ethereum Improvement Proposal (<a href=\"https:\/\/www.theblockcrypto.com\/post\/96316\/ethereum-mining-pools-divided-eip1559\" data-v-f87c67ca=\"\">EIP)-1559<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/daily\/85771\/eth2-phase-0-roll-out-long-way-to-go\" data-v-f87c67ca=\"\">move to proof-of-stake<\/a> will materially change the ETH economic policy, and seem likely to lead to a declining overall supply of ETH,\" said Ogilvie. \"So investors that like the hard cap of 21 million bitcoin will really like the ultra-sound money ETH offers.\"","Looking ahead, Staked could also launch trust products for more proof-of-stake coins, Ogilvie told The Block, because that would be a \"natural fit.\""],"hashtag":["ETHEREUM","STAKING"]}