{"summary":"Early investors and builders in crypto aim to accelerate the development of technologies they view as good for humanity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267758\/ethereum-ogs-earmark-100-million-to-invest-in-crypto-ai-and-robotics","publishDate":"2023-12-14T17:31:15","id":10989,"type":null,"title":"Ethereum OGs earmark $100 million to invest in crypto, AI and robotics","category":["PRIVATE INVESTMENTS"],"content":["Early Ethereum investors Konstantin Lomashuk and Vasiliy Shapovalov are re-upping their financial interests in new technologies with the \"re-launching\" of an investment firm called cyber.Fund, which plans to invest $100 million of the founders' capital.","\"This new $100 million fund will serve current portfolio companies and as well as service new projects and teams,\" cyber.Fund <a href=\"https:\/\/twitter.com\/cyberFund_\/status\/1735344984780402737\" data-v-f87c67ca=\"\">said in a post<\/a> to X on Thursday. \"Its mission is to accelerate the transition to an open cybernetic economy by backing entrepreneurs innovating in blockchain, AI, robotics and adjacent technologies.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCyber.Fund is headed by Konstantin Lomashuk and Vasiliy Shapovalov, both of whom say they invested in Ethereum in 2014. When asked why now, Lomashuk told The Block the motivation centers around furthering the development of these newer technologies. \"We believe that we can accelerate the technologies by investing capital,\" said Lomashuk.&nbsp;","The $100 million investment firm is being funded entirely with capital from cyber.Funds' founders, a spokesperson said by email.","Although the flow of fresh capital into crypto and blockchain enterprises has continued during the last year, the amount of money being invested <a href=\"https:\/\/www.theblock.co\/post\/248626\/crypto-vc-funding-two-half-year-low\" data-v-f87c67ca=\"\">has slowed considerably<\/a> from what it was during the bull run. Meanwhile, investment in artificial intelligence has soared, spurred partly by interest in projects like ChatGPT.","Before this re-launch, cyber.Fund was primarily active between 2014 and 2018, according to Lomashuk. The firm not only invested early in projects like Ethereum, Cosmos, Polkadot and Solana, but also helped build Lido Finance and P2P, according to Thursday's announcement. Lomashuk co-founded Lido Finance.","\"Our aim is to create a more open, efficient and sustainable economy,\" cyber.Fund said in the post. \"We believe that by working to accelerate the growth, adoption and eventual decentralization of the these technologies, the world will enter a new age of unprecedented prosperity.\"","Cyber-Fund considers the emergence of a \"cybernetic\" world as inevitable and sees blockchain, robotics and AI playing a key role in shaping this new paradigm.","\"We invested in Ethereum and build staking to keep it censorship resistant and decentralized,\" said Lomashuk. Now, \"instead of building we can invest in founders with the same values to build open source [technologies] good for humanity.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Vasiliy Shapovalov","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"Lomashuk","content":"LOCATION"},{"type":"Lomashuk","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Konstantin Lomashuk","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}