{"summary":"They claim that fundamental IP and subsidiaries were illegally transferred from ConsenSys AG (CAG) to a new entity, ConsenSys Software Incorporated (CSI) and used to fundraise.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136030\/consensys-ag-shareholders-push-multi-billion-dollar-audit-to-investigate-alleged-irregularities","publishDate":"2022-03-02T12:42:55","id":10980,"type":null,"title":"ConsenSys AG shareholders push multi-billion dollar audit to investigate alleged irregularities","category":["LAYER 1S"],"content":["ConsenSys AG, the Ethereum software company behind crypto wallet MetaMask also known as Mesh, is facing a multi-billion dollar audit, as a group of 35 former employees seek to investigate what they are calling \"serious irregularities.\"","Claims <a href=\"https:\/\/www.prnewswire.com\/news-releases\/blockchain-company-consensys-faces-multi-billion-dollar-audit-as-shareholders-claim-board-breaches-fiduciary-duties---attributed-to-arthur-falls-301493433.html\" data-v-f87c67ca=\"\">published on Tuesday<\/a> state that in August 2020, fundamental intellectual property and subsidiaries were illegally transferred from CAG into a new entity, ConsenSys Software Incorporated (CSI).","This was in exchange for 10% ownership of CSI and an offset of a <span class=\"xn-money\" data-v-f87c67ca=\"\">$39 million<\/span>&nbsp;loan by founder&nbsp;<span class=\"xn-person\" data-v-f87c67ca=\"\">Joseph Lubin<\/span>.&nbsp;","The former employees claim that the transaction, internally code-named \"Project North Star\", resulted in legacy financial institutions such as JPMorgan Chase acquiring an influential stake in MetaMask and Infura, two of the most widely used infrastructure tools in Ethereum.","The claims by former employees also state that one year on, the IP from CAG was used to fundraise for CSI.&nbsp;","The company raised funds in November 2021, when it announced <a href=\"https:\/\/www.theblockcrypto.com\/post\/124615\/consensys-raise\" data-v-f87c67ca=\"\">a $200 million round<\/a> at a valuation of $3.2 billion. New investors in that round included British hedge fund Marshall Wace, Daniel Loeb’s Third Point Ventures and HSBC.","<a href=\"https:\/\/www.theblockcrypto.com\/post\/131445\/ethereum-developer-consensys-poised-to-double-its-valuation-in-pending-fundraise\" data-v-f87c67ca=\"\">The Block reported exclusively in January<\/a> that the firm had held talks with potential backers about investing at a valuation of roughly $6.5 billion, citing three people close to the discussions. Several sources said the company’s post-money valuation would be close to $7 billion.","<span class=\"xn-person\" data-v-f87c67ca=\"\">Lubin<\/span> is the majority shareholder of both CAG and CSI. Former employees claim that the transaction was to the detriment of the minority shareholders of CAG and to the benefit of <span class=\"xn-person\" data-v-f87c67ca=\"\">Lubin<\/span>&nbsp;personally.","They argue that the transaction may be void under Swiss law and subject to \"special scrutiny\" in US law due to the fact that during Project North Star, L<span class=\"xn-person\" data-v-f87c67ca=\"\">ubin<\/span> and <span class=\"xn-person\" data-v-f87c67ca=\"\">Frithjof Weinert<\/span> acted as directors at both CAG and CSI.","CAG minority shareholders were not given information about the transfer, due to delayed shareholder meetings. Due to the delays, <span class=\"xn-person\" data-v-f87c67ca=\"\">Weinert was allowed to be re-elected to the board of directors, the validity of which is also being brought into question alongside issues with the transaction, per the allegations.&nbsp;<\/span>","The minority shareholders say their requests for information relating to the transaction were denied for more than a year until the directors learned of legal efforts to enforce minority shareholder rights.","As shareholders have argued for their rights, staff numbers have been cut dramatically at CAG by Lubin, from a peak of 1,700 in 2017, according to the group's claims. The minority shareholders say the events have resulted in a de-facto liquidation of CAG without their consent.&nbsp;","A ConsenSys AG spokesperson said: \"Mesh refutes the allegations underlying the legal action as well as those contained in the factually inaccurate press release that was self-authored by one of the former employees. Mesh looks forward to formally refuting the allegations and accusations in Swiss courts.\"","They added that the spin-out was \"conducted properly\" and that the business environment has changed since the time of the deal.","\"Though the group would like to apply a valuation that might be achieved today to a set of projects that were pre-monetization during the darkest days of COVID when the transaction took place,\" they said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CAG","content":"ORGANIZATION"},{"type":"AG","content":"ORGANIZATION"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Lubin","content":"PERSON"},{"type":"CSI","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"November 2021","content":"DATE"},{"type":"Third Point Ventures","content":"ORGANIZATION"},{"type":"$39 million","content":"MONEY"},{"type":"$3.2 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$6.5 billion","content":"MONEY"},{"type":"Frithjof Weinert","content":"PERSON"},{"type":"Weinert","content":"PERSON"},{"type":"ConsenSys AG","content":"ORGANIZATION"},{"type":"Marshall Wace","content":"ORGANIZATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"$7 billion","content":"MONEY"},{"type":"Daniel Loeb","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["JOE LUBIN"],"authors":["Lucy Harley-McKeown","The Block"]}