{"summary":"Polygon Labs brought up apple farming in a letter about how it thinks U.S. lawmakers should look to tax crypto staking rewards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250303\/polygon-labs-asks-senators-to-consider-apple-orchard-as-they-tax-crypto","publishDate":"2023-09-11T14:46:27","id":10982,"type":null,"title":"Polygon Labs asks senators to consider apple orchard as they tax crypto","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Polygon <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248360\/polygon-matic-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/matic-token-icon.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MATIC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.063%\n    <\/span><\/a> <!----><\/span><\/span> Labs used a novel analogy to explain crypto staking to Senators Ron Wyden, D-Ore., and Mike Crapo, R-Idaho, in a letter responding to a request for comments on the <\/span><a href=\"https:\/\/www.theblock.co\/post\/247478\/treasury-irs-release-proposed-crypto-tax-reporting-rules\" data-v-f87c67ca=\"\">taxation<\/a> of digital assets — apple farming.&nbsp;","\"Assume a group of farmers happens upon an apple orchard on ownerless property,\" Polygon Labs chief legal officer Rebecca Rettig wrote <a href=\"https:\/\/assets-global.website-files.com\/637359c81e22b715cec245ad\/64febb59789e623c02c162b9_Polygon%20Labs%20Letter%20to%20Senators%20Wyden%20and%20Crapo%20on%20Staking%20Rewards.pdf\" data-v-f87c67ca=\"\">in the letter<\/a>. \"They agree to take turns picking apples. To ensure no one cheats, each farmer is required to ante up the first 32 apples they pick. If they cheat, those apples are thrown into a river.\"","\"Over time, each of the farmers begins selling some of their apples, establishing a market price for them,\" the example continued. \"Although a system thus emerges from the aggregate of each farmer's actions, the farmers are not taxed until they sell their apples. Stakers should be treated similarly on their newly minted tokens.\"","Polygon Labs thinks potential rewards from staking should be taxed when tokens are sold, and not as they are accrued, according to the letter. Failure to do so could result in over taxation, it argued in the Sept. 8 letter, citing what it said was a long-standing tradition in the U.S. of there not being a tax event simply for exercising dominion and control over property for which there is no previous owner.","Sens. Crapo and Wyden asked for input on how to tax digital assets in July and asked for stakeholders to respond by last week. The Internal Revenue Code of 1986 does not classify digital assets in a straightforward way, they said.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"This uncertainty creates complex reporting issues for taxpayers, and warrants examining how the IRC can provide clearer guidance for taxpayers on the treatment of digital asset transactions,\" the lawmakers said in July in <a href=\"https:\/\/www.finance.senate.gov\/chairmans-news\/wyden-crapo-solicit-policy-input-on-taxation-of-digital-assets\" data-v-f87c67ca=\"\">a statement<\/a>. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Others also filed letters to Sens. Wyden and Crapo including the Tax Policy Center, the Coin Center and the Crypto Council for Innovation. Both senators lead the Senate Finance Committee, which has jurisdiction over the Treasury Department.<\/span>","\"When taxpayers extract oil, gas, or minerals, they are not taxed until they sell that property,\" Polygon Labs' Rettig continued. \"When they breed animals, they are not taxed until they sell the animals. When they harvest crops, they are not taxed until they sell the crops. The same rule applies when taxpayers create art, manufacture goods, bake scones, affix their autograph to paper, or otherwise assume control over property that does not have a previous owner.\"","Polygon Labs further argued that newly minted tokens that accrue to stakers are created by software and should not be considered as income for tax purposes. It also pointed out staking rewards can only be used after a validator un-stakes them, and it also said that taxing staking rewards only upon disposition would be the administratively easiest option.&nbsp;&nbsp;","\"Tax policy should not incentivize one product type over another,\" the letter continued. \"In this nascent stage of blockchain development, taxing staking rewards when credited to validators risks doing just that, without materially increasing tax revenues.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"+0.063%","content":"PERCENT"},{"type":"Mike Crapo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Idaho","content":"LOCATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Wyden","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Senate Finance Committee","content":"ORGANIZATION"},{"type":"1986","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Rebecca Rettig","content":"PERSON"},{"type":"Rettig","content":"PERSON"},{"type":"Sept. 8","content":"DATE"},{"type":"Ore.","content":"LOCATION"},{"type":"Ron Wyden","content":"PERSON"},{"type":"Crapo","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"},{"type":"IRC","content":"ORGANIZATION"}],"hashtag":["IRS"],"authors":["Nathan Crooks","The Block"]}