{"summary":"The SEC responded to Coinbase&#x27;s legal gamble. The SEC fired back at Coinbase&#x27;s extraordinary lawsuit over digital asset rules.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230935\/the-sec-calls-coinbases-suit-over-digital-asset-rules-petition-baseless","publishDate":"2023-05-15T22:56:52","id":10990,"type":null,"title":"The SEC calls Coinbase&#x27;s suit over digital asset rules petition &#x27;baseless&#x27;","category":["POLICY"],"content":["The Securities and Exchange Commission responded to Coinbase’s lawsuit seeking a response to the company’s petition for new digital asset regulations, arguing that the commission is under no obligation to issue new regulations and Coinbase has no standing to sue the agency.","At the heart of the lawsuit is the longstanding dispute between the crypto industry and markets regulator over which digital assets should be considered security investments, subject to existing registration and transparency requirements, or exempted on the argument that they don’t fall neatly into those existing laws.","“Neither the securities laws nor the Administrative Procedure Act impose on the Securities and Exchange Commission an obligation to issue the broad new regulations regarding “digital assets” Coinbase has requested,” SEC lawyers responded in <a href=\"https:\/\/ecf.ca3.uscourts.gov\/n\/beam\/servlet\/TransportRoom?servlet=ShowDoc\/003014413245&amp;caseId=119939&amp;recapDocNum=26&amp;recapCaseNum=23-1779\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/ecf.ca3.uscourts.gov\/n\/beam\/servlet\/TransportRoom?servlet%3DShowDoc\/003014413245%26caseId%3D119939%26recapDocNum%3D26%26recapCaseNum%3D23-1779&amp;source=gmail&amp;ust=1684291200869000&amp;usg=AOvVaw0neTAFP9MXF9IJ3lhfWR55\" data-v-f87c67ca=\"\">a filing<\/a> to the Third Circuit of the U.S. Court of Appeals late Monday.","The Coinbase lawsuit, and the SEC’s response, is the latest escalation in growing tensions between the trading platform and markets regulator dating back to at least last summer.","The suit, which seeks to compel a specific response out of the SEC over Coinbase’s petition, with the possibility of continued legal fighting once one comes, is also unreasonably close to when Coinbase asked for the new set of rules, the agency argued.","“The rulemaking petition as to which Coinbase seeks an immediate determination asks the Commission to take a series of discretionary actions to replace existing applicable securities laws and regulations with a comprehensive new regulatory regime for the trading of crypto assets that are securities,” continues the SEC. “As Coinbase’s own submissions make clear, considering the various paths it suggests is a necessarily complicated endeavor.”","But Coinbase’s lawsuit came less than a year after its request for new rules that would potentially overhaul much of the U.S. financial system beyond cryptocurrencies and digital assets, the SEC continued.","The SEC called Coinbase’s argument that a decision had already been determined on the petition “baseless” and said the commission could still decide to move forward with crypto-specific rules.","“The Commission continues to consider Coinbase’s petition in the ordinary course,” SEC lawyers wrote to the court.","Part of the SEC’s argument also repeats a familiar sentiment among regulators: that the crypto industry has rules and laws governing it, but just doesn’t like them.","As part of its filing, the SEC’s lawyers note that “as a part of the Commission’s overall regulatory agenda, it is also pursuing a number of actions that concern crypto assets that are securities.”","Those actions include the proposed rule changes to how companies safeguard customer assets <a href=\"https:\/\/www.theblock.co\/post\/229944\/a16z-sec-crypto-regulation-investment-advisers-coinbase\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.theblock.co\/post\/229944\/a16z-sec-crypto-regulation-investment-advisers-coinbase&amp;source=gmail&amp;ust=1684290490726000&amp;usg=AOvVaw0t5eHUMAf5LhgYQCLdS-3N\" data-v-f87c67ca=\"\">that Coinbase submitted a comment letter to last week<\/a>, in addition to cybersecurity, trade execution, and exchange-related rule tweaks that the SEC has proposed this year. The commission argues that those changes, and the feedback from industry, experts and customers that the agency solicits as part of its rulemaking process are part of its consideration of whether completely new rules around digital assets are needed.","“The information gathered from any or all of these efforts could inform the Commission’s consideration of its regulatory approach in this area, including its consideration of the regulatory approaches suggested in Coinbase’s petition,” the SEC says in its filing.","Citing multiple public documents issued by the agency over the years, including a widely publicized <a href=\"https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf&amp;source=gmail&amp;ust=1684290490726000&amp;usg=AOvVaw39itySnGLA5VK4p2hRBSkU\" data-v-f87c67ca=\"\">2017 report<\/a> on the original Decentralized Autonomous Organization and the tokens it issued, the SEC also argues that it has provided digital asset guidance outside of enforcement actions over the years.","Coinbase petitioned the commission for new digital asset rules at the same time that the commission accused a former Coinbase executive of <a href=\"https:\/\/www.theblock.co\/post\/209149\/former-coinbase-product-manager-pleads-guilty-to-criminal-charges-in-landmark-case\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.theblock.co\/post\/209149\/former-coinbase-product-manager-pleads-guilty-to-criminal-charges-in-landmark-case&amp;source=gmail&amp;ust=1684291200869000&amp;usg=AOvVaw18c7Yu6i5GqmxFZZSwz6Oz\" data-v-f87c67ca=\"\">the first ever insider trading case involving cryptocurrency<\/a>. Coinbase also <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwj-merS2vj-AhX5kIkEHXbEBzcQFnoECB4QAQ&amp;url=https%3A%2F%2Fwww.coinbase.com%2Fblog%2Fwe-asked-the-sec-for-reasonable-crypto-rules-for-americans-we-got-legal&amp;usg=AOvVaw1rD0KzmV1BZZ2S9yi1xGYF\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.google.com\/url?sa%3Dt%26rct%3Dj%26q%3D%26esrc%3Ds%26source%3Dweb%26cd%3D%26cad%3Drja%26uact%3D8%26ved%3D2ahUKEwj-merS2vj-AhX5kIkEHXbEBzcQFnoECB4QAQ%26url%3Dhttps%253A%252F%252Fwww.coinbase.com%252Fblog%252Fwe-asked-the-sec-for-reasonable-crypto-rules-for-americans-we-got-legal%26usg%3DAOvVaw1rD0KzmV1BZZ2S9yi1xGYF&amp;source=gmail&amp;ust=1684291200869000&amp;usg=AOvVaw2OurvfwfjxcHbkw9_V1JaQ\" data-v-f87c67ca=\"\">acknowledged an SEC investigation<\/a> into multiple parts of the company’s business in late March, approximately a month before suing the federal regulator.","The former employee, Ishan Wahi, pleaded guilty to charges he participated in front-running listings by the company and <a href=\"https:\/\/www.theblock.co\/post\/229991\/ex-coinbase-product-manager-handed-two-year-prison-term-for-insider-trading-reuters\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.theblock.co\/post\/229991\/ex-coinbase-product-manager-handed-two-year-prison-term-for-insider-trading-reuters&amp;source=gmail&amp;ust=1684291200869000&amp;usg=AOvVaw0hFLbjmTYdmN1KwqsrBQA9\" data-v-f87c67ca=\"\">was sentenced to two years in prison last week<\/a>. In April he notified a court that he would <a href=\"https:\/\/www.theblock.co\/post\/224919\/former-coinbase-employee-insider-trading\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/www.theblock.co\/post\/224919\/former-coinbase-employee-insider-trading&amp;source=gmail&amp;ust=1684291200869000&amp;usg=AOvVaw1CRMsEIHlaufTBOLJeuesM\" data-v-f87c67ca=\"\">likely settle<\/a> his related but separate civil case with the SEC.","Authorities have not accused Coinbase of wrongdoing in connection to the case, but several of the tokens that Wahi traded on using insider knowledge were named as securities by the SEC, implying that the agency believed Coinbase illegally listed them.","The suit is seen as part of a preemptive legal effort over the investigation, a <a href=\"https:\/\/www.theblock.co\/post\/228283\/coinbase-vs-the-sec-a-gamble-to-take-on-a-regulator-undefeated-on-crypto\" data-v-f87c67ca=\"\">major bet by Coinbase<\/a> that initiating legal action will help its leverage, despite the SEC's strong record in enforcement actions against digital asset companies.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commission","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Decentralized Autonomous Organization","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"Third Circuit of the U.S. Court of Appeals","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["COINBASE","COURT HEARINGS","SEC"],"authors":["Colin Wilhelm","The Block"]}