{"summary":"DeFi lender Aave’s planned stablecoin project GHO is now live for testing on Goerli, an Ethereum testnet environment.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210092\/aaves-gho-stablecoin-goes-live-on-ethereums-goerli-testnet","publishDate":"2023-02-09T09:00:16","id":10991,"type":null,"title":"Aave&#x27;s GHO stablecoin goes live on Ethereum&#x27;s Goerli testnet","category":["CRYPTO ECOSYSTEMS"],"content":["Aave Companies, the developer behind the Aave DeFi project, has launched the protocol’s native stablecoin called GHO on Goerli, an Ethereum testnet network, the team said on Thursday.","Users wishing to test out GHO on Goerli can now access the stablecoin’s <a href=\"https:\/\/github.com\/aave\/gho\" data-v-f87c67ca=\"\">codebase<\/a> on GitHub, according to the announcement. Today’s deployment on Goerli is part of the planned rollout of the stablecoin on the Ethereum mainnet.","Aave DAO, the community that oversees the Aave protocol, <a href=\"https:\/\/www.theblock.co\/post\/160381\/aave-dao-votes-to-approve-creation-of-gho-stablecoin\" data-v-f87c67ca=\"\">will vote to approve<\/a> GHO’s official mainnet launch. This will happen at a later date.","GHO, when launched, will be Aave’s native stablecoin pegged to the U.S. dollar. The token will be similar to MakerDAO’s DAI stablecoin in that it will be overcollateralized. This means that users will have to supply collateral in amounts exceeding the value of GHO they wish to mint.","Collateral assets for GHO will also generate yield, according to previously released details about the planned stablecoin. Aave DAO will earn interest payments from borrowers of the stablecoin. All repaid interest will be directed to the Aave DAO treasury, according to Thursday’s update.","The Aave DAO will also control the facilitator set for the GHO stablecoin. Facilitators are those who can mint and burn GHO tokens. Aave Companies recently recommended that the Ethereum V3 pool be the first facilitator upon the GHO mainnet launch.","GHO is among a set of stablecoin projects being released by DeFi-native protocols. Curve Finance also <a href=\"https:\/\/www.theblock.co\/post\/158998\/curve-finance-founder-implies-a-stablecoin-is-on-its-way\" data-v-f87c67ca=\"\">reportedly has plans<\/a> to release its own stablecoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Aave DAO","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Goerli","content":"ORGANIZATION"},{"type":"GHO","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}