{"summary":"The agency’s complaint “appears to assert that fund shares held by investors—namely, securities—can themselves constitute leveraged trading,” pursuant to commodities laws, said CFTC Commissioner Pham in a statement on Friday.\nQuestions over where the CFTC and SEC have authority over the crypto industry has come up quite a bit over the past year. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285690\/cftc-commissioner-pham-says-agency-may-be-infringing-on-secs-authority-in-kucoin-charges","publishDate":"2024-03-29T12:06:00","id":11,"type":null,"title":"CFTC Commissioner Pham says agency may be infringing on SEC&#x27;s authority in KuCoin charges","category":["Exchanges"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">One of the Commodity Futures Trading Commission's leaders, Caroline Pham, criticized her own agency, saying the regulator may be infringing on its sister agency in charges it brought against crypto exchange KuCoin earlier this week.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFTC, alongside the U.S. Department of Justice, charged <a href=\"https:\/\/www.theblock.co\/post\/284814\/crypto-exchange-kucoin-laundered-9b-flouted-anti-money-laundering-laws-doj-indictment\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">KuCoin<\/span><\/a> on March 26 for illegally operating a digital assets derivatives exchange.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">CFTC Commissioner Pham said in a statement on Friday that the agency's complaint \"appears to assert that fund shares held by investors—namely, securities—can themselves constitute leveraged trading,\" pursuant to commodities laws. However, \"<\/span><span class=\"s3\" data-v-f87c67ca=\"\">this interpretation fails to distinguish between an investment in a fund, which would typically be a security under the jurisdiction of the SEC, and the trading activities of a fund, alleged here to be under the CFTC’s jurisdiction,\" Pham said. \"The CFTC’s approach may infringe upon the SEC’s authority and undermine decades of robust investor protection laws by conflating a financial instrument with a financial activity, disrupting the foundations of securities markets.\"&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"Owning shares is not the same thing as trading derivatives,\" Pham added.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Over the past year, questions have frequently arisen about where the CFTC and SEC have authority over the crypto industry.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">For example, the SEC and CFTC publicly have been divided on whether ether is a security or a commodity. SEC Chair Gary Gensler has skirted the question but has said many cryptocurrencies are securities. The CFTC has said, as recently as in its charges against KuCoin this week, that <a href=\"https:\/\/www.theblock.co\/post\/284856\/cftc-ether-is-commodity-kucoin-lawsuit\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">ether<\/span><\/a> is a commodity.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">CFTC Chair Rostin Behnam told <a href=\"https:\/\/www.theblock.co\/post\/280952\/legislation-needed-to-regulate-crypto-cftc-chair-behnam-says-citing-cryptos-recent-uptick-in-value\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">lawmakers<\/span><\/a> during a congressional hearing earlier this month that if the SEC <\/span><span class=\"s1\" data-v-f87c67ca=\"\">were to constitute ether as a security, it would cause the CFTC's registrants who list ether as a futures contract into noncompliance with SEC rules, calling the situation \"critical.\"&nbsp;<\/span>"],"hashtag":["CFTC","SEC"]}