{"summary":"The Block Research was commissioned by HashKey Capital to produce The Digital Asset Funding Landscape, which provides an in-depth study of investments in crypto since 2017. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203194\/digital-asset-funding-landscape-presented-by-hashkey-capital","publishDate":"2023-01-17T22:27:43","id":110,"type":null,"title":"Digital Asset Funding Landscape presented by HashKey Capital","category":["THE BLOCK"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research has created “Digital Asset Funding Landscape” presented by HashKey Capital. To access the full report in PDF format, please fill out the form below:&nbsp;<\/b>","The Block Research was commissioned by HashKey Capital to produce The Digital Asset Funding Landscape, which provides an in-depth study of investments in crypto since 2017.&nbsp; The digital asset landscape tends to be plastered with an abundance of speculative data from unreliable sources, which makes it arduous to separate the signal from the noise. The crypto industry serves unique challenges like the identification of multichain protocols, interpretation and categorization of on-chain investments, exclusion of ‘web3’ companies in which blockchain only contributes as a buzzword, etc. Tackling these issues requires a more nuanced crypto-native understanding. As a result, the digital asset sector has never gotten the comprehensive, fact-based, in-depth analysis of the venture funding landscape it deserves. This report endeavors to change that.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Digital Asset Funding Landscape","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"HashKey Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}