{"summary":"Breaking down the different ways that DWF Labs deals with crypto companies and how it tends to communicate with clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267354\/how-dwf-labs-makes-deals-and-its-tendency-to-talk-about-price","publishDate":"2023-12-13T07:18:28","id":11009,"type":null,"title":"How DWF Labs makes deals and its tendency to talk about price","category":["COMPANIES"],"content":["A new entrant broke out on the crypto scene earlier this year. All of a sudden, the name DWF Labs was everywhere, pouring capital into projects that were struggling for funding in the wake of <a href=\"https:\/\/www.theblock.co\/post\/186132\/ftx-collapse-timeline-six-days-that-rocked-the-crypto-industry\" data-v-f87c67ca=\"\">FTX’s collapse<\/a> and a wider market drought.","The company was seemingly splashing cash everywhere. Over the last year, it found $20 million for an investment deal with the Synthetix protocol, $28 million for blockchain platform Conflux, $40 million for AI platform Fetch.AI, $45 million for the EOS Network Foundation —&nbsp;and a further $50 million for the Algorand Foundation. It now claims to have invested in 470 projects in total, according to <a href=\"https:\/\/en.foresightnews.pro\/foresight-interview-with-dwf-labs-founder-innovators-forge-ahead-leaving-the-old-hat-market-makers-behind\/\" data-v-f87c67ca=\"\">Foresight News<\/a>, and worked with around <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1729044331531731350\" data-v-f87c67ca=\"\">35% of the top 1,000 tokens<\/a> by market capitalization in its short 16-month history.&nbsp;","But for a young company to be throwing so much cash around, this raised questions as to how these deals were put together and whether everything was as it appeared.","In April, some of these questions were answered. Reports by <a href=\"https:\/\/www.theblock.co\/post\/225705\/dwf-labs-biggest-crypto-investors\" data-v-f87c67ca=\"\">The Block<\/a> and <a href=\"https:\/\/www.coindesk.com\/business\/2023\/04\/14\/market-maker-dwf-labs-more-than-200m-in-deals-blur-what-investing-means\/\" data-v-f87c67ca=\"\">CoinDesk<\/a> shed light on the way these deals were structured, revealing that, for the most part, they weren’t traditional investment rounds but over-the-counter trades. Yet lingering questions remained over how DWF Labs conducts its business and how these trades and other deals are structured.&nbsp;","To understand more, The Block spoke with 16 clients, prospective clients and people with intimate knowledge of the company’s operations. The Block analyzed 10 proposals and contracts between DWF Labs’ clients and prospective clients, as well as communication between them. Key among the findings was that DWF Labs often talked about potential price movements when trying to get the attention of prospective clients, and indeed while working with clients.","DWF Labs declined to comment or be interviewed for this article.","Shortly after DWF Labs was launched in September 2022,&nbsp;the trading firm created a pitch deck for prospective clients. Obtained and verified by The Block, the pitch deck made considerable mention of price action.&nbsp;","Under a section called “Price Management,” the pitch deck stated the trading firm can synchronize its efforts with the prospective client’s marketing team to help the token’s price respond to relevant events.","Later in the deck, it explained how this is done. “Before or during important scheduled news events the algorithms can be skewed to prefer one side of the orderbook and that is used to drive price upwards,” the deck stated.&nbsp;","“As this is done on a passive orderbook level and not by actively creating artificial volume the growth of the token's price looks authentic,” it added. “Note that although DWF can provide artificial volume, it is hardly necessary due to the competitive pricing.”","This type of language would continue for some time. For a while, DWF Labs’ boilerplate language for its proposals to clients explained that the company would use its market-making services and its own funds to trade the client’s token, improving the token’s market. It said this would lead to “bullish sentiment, organic trading activities and price improvements.” The Block has seen one proposal sent to a prospective client that contained this wording and a source directly familiar with the matter confirmed that it was used on multiple proposals.","This was also conveyed in verbal conversations. A prospective client told The Block that a DWF Labs employee pointed to graphs showing token price increases following previous partnerships when trying to get their business in the last few months. A source directly familiar with the matter said that on calls with prospective clients, if they were hesitant, a certain DWF Labs executive would start referencing token price increases for projects it had worked with previously.","This was the case in written conversations too. A different prospective client provided messages from a DWF Labs executive earlier this year confirming they were offering to boost their token’s price. Separately, one of its clients provided messages from earlier this year that show DWF Labs Managing Partner Andrei Grachev asking how high the client would like their token’s price to be raised and discussing whether the company could deliver on this. The Telegram handles for both executives were confirmed as authentic by the company’s own <a href=\"https:\/\/verify.dwf-labs.com\/\" data-v-f87c67ca=\"\">verification checker<\/a>.","More recently, the company appears to have phased out this kind of price management-related language in writing, at least in pitch decks, according to two separate documents provided to two prospective clients pitched over the last few months.","DWF Labs focuses on three types of deals: liquid token investments, locked token investments and market-making arrangements — and it will often package these together.","For liquid token investments, DWF Labs will typically try to purchase a certain number of tokens with stablecoins at a 5-15% discount to the prevailing market price, according to the terms of three deals seen by The Block. The purchases take place in daily tranches of around $100,000-150,000 over a month or a few months with the purchases made at the token’s price at the start of each day, minus the discount.","This means that project founders were able to effectively cash out through DWF Labs — at a slight premium — while touting that the project was receiving a large investment.","“The OTC desk became a godsend to many smaller projects because they could get rid of their tokens, attach themselves to a bigger name, say they got investment and extend their runway,” said a person with direct knowledge of DWF Labs’ operations.&nbsp;","One of DWF Labs’ clients said this was exactly why they worked with the company. They said the relationship was a good way to offload tokens without selling them directly on the market.","In a previous interview with The Block, Grachev — who <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1719301142117540207\" data-v-f87c67ca=\"\">asked<\/a> to be referred to as the “Notorious AG” for this article — cast doubt on this idea, saying that the trading firm moving funds to crypto exchanges did not mean the company was immediately selling the tokens.&nbsp;","“We transfer coins to exchanges but we never dump it and I would say that most of the transactions we did last month, or even more, we haven’t sold them yet&nbsp;— maybe a small, small part,” he said, during the interview in April. Grachev declined to be interviewed for this article.","An issue that had caused controversy was that DWF Labs’ token purchases were often announced in advance, even though they may not get completed later on. In response to this backlash, the company has reportedly altered its strategy.","“We have learned a lot since the first half of this year,” Grachev told BlockBeats, <a href=\"https:\/\/www.theblockbeats.info\/news\/45416?from=telegram\" data-v-f87c67ca=\"\">in an interview<\/a>. “We won't announce anything that hasn't been completed yet. If we announce something, it's already done.”","For market-making services, DWF Labs will often provide its services over a year, according to two proposals to prospective clients and one contract with a client seen by The Block. This may involve taking loans in the project’s token, as shown by the two proposals.&nbsp;","When taking loans, according to the two proposals, the company will have call options that it can exercise to buy the project’s tokens at the price when the agreements are signed, a common feature of market-making contracts. These options can be exercised if the token’s price reaches a certain level, known as the strike price. This is designed to protect the market maker from losses incurred when repaying the loan if the token’s price rises while the services are being provided.&nbsp;","“A market maker has to show both bids and asks. For downside protection they have to choose projects that they are comfortable to hold exposure in. For upside protection they need the strike price,” said Jordi Alexander, CIO at Selini Capital. He added that strike prices are usually close to the token price but can be slightly above.","According to two people familiar with other crypto market-making firms, these strike prices are usually set up to 100% higher than the token’s starting price.","For DWF Labs, however, the strike prices are set as high as many multiples of the token’s price, according to the terms of the two proposals. This means if the token’s price rises substantially, DWF Labs has the potential to make a higher percentage return.","“If you’re a market maker, you want tokens to increase in price. You make money on options on how you price these tokens in a year’s time,” said a person directly familiar with the company’s operations. “You want to be able to exercise the options at a lower price than what you priced them. That’s where the money is generated.”","In one market-making proposal, DWF Labs specified that it would help to promote the project’s announcements and increase engagement with its community. Internally, this was a big focus. The company would tell employees when announcements were coming and encourage staff to post about them in order to keep up the momentum and “strike while it's hot,” this person familiar with the matter said.","But its external communication hasn’t always been so clear. One of DWF Labs’ clients said the company gave scant details on market-making services that had been provided, unlike other crypto market-making firms. “Usually you get a detailed report back. With them it's not as detailed. To be honest we don’t really know what they’re doing with the tokens,” they said. One contract with another client seen by The Block states DWF Labs has the ability to determine what information it provides in such reports.","Another client said they didn’t receive a report from DWF Labs about market-making services they were engaged in. The client had to reach out to the relevant crypto exchange to get confirmation that the services were indeed being provided, which they did receive.","As for locked token investments on the venture capital side, the trading firm will typically seek much larger discounts, up to 50%, with a one or two-year lock-up, according to a client and two proposals to different prospective clients. Here it will also pay in stablecoins.","As all of these deals took place, DWF Labs kept ramping up its operations and expanding its reach across the industry. It has also doubled down on some of its partnerships, such as <a href=\"https:\/\/medium.com\/@DWF-research\/dwf-labs-has-launched-two-validator-nodes-on-the-ton-blockchain-92426d95192e\" data-v-f87c67ca=\"\">running validator nodes<\/a> on the TON blockchain. In written comments to The Block, some of its industry partners said they were pleased with the outcome.","The Algorand Foundation said its $50 million transaction was an OTC trade that involved DWF Labs purchasing tranches of the ALGO token over time and was completed in July 2023. “At no stage during our negotiations with DWF was there a suggestion of them moving the market or providing artificial volume,” said Eric Wragge, global head of business development and capital markets at the Algorand Foundation.","DWF Labs’ deal with the EOS Network Foundation involved a purchase of $45 million of EOS tokens and a $15 million commitment to invest in EOS-based businesses and its ecosystem. EOS Network Foundation CEO Yves La Rose said, “Our strategic partnership with DWF has been exceptionally productive, resulting in a significant expansion of our ecosystem through cross-collaboration and financial investments. We eagerly anticipate the continued success and growth in 2024.”","“We are very happy with our partnership with them,” said B, a core team member of memecoin project Floki, which sold $5 million of tokens to DWF Labs. “On an institutional level they have been immensely helpful: opening up access to their network, helping to facilitate exchange listings and connections with their portfolio partners, and just overall pushing our brand and offering support. They have a really good and professional team, too. They respond to our requests usually within minutes almost 24\/7, and often we have Andrei himself responding and pushing things.”","Synthetix declined to comment for this article. Conflux and Fetch.ai did not respond when asked for comment. There is no suggestion that any of the crypto projects mentioned in this article had conversations about price management with DWF Labs.","For all the controversy surrounding DWF Labs, the company and those close to it show no signs of slowing down. In September, HTX (formerly known as Huobi) handed Digital Wave Finance <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1702220742388318501?t=4lMw1c5KWF7g8Cl-bsZdeQ&amp;s=19\" data-v-f87c67ca=\"\">an award<\/a> for being its best partner. On X, Grachev recently <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1729044342042669170\" data-v-f87c67ca=\"\">posted<\/a> that the company is going through an audit by an unspecified Big Four accounting firm and is in the process of getting multiple licenses. It has already applied for a virtual asset service provider license in the British Virgin Islands, according to his interview with BlockBeats.","Going ahead, the company is starting an inaugural <a href=\"https:\/\/twitter.com\/DWFLabs\/status\/1729711815310053842\" data-v-f87c67ca=\"\">incubation program<\/a> for crypto companies and it plans to create what Grachev <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1725526428358254855\" data-v-f87c67ca=\"\">described<\/a> as a compliant market for crypto OTC trades — which could put it in a pivotal position among crypto traders.","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Grachev posted a photograph of a Lamborghini branded with the DWF Labs logo. Image: Grachev via X.<\/span><\/em>","Grachev himself has not been shy about flaunting his wealth and toasting his firm’s success. Last month, he <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1729104810975416501?t=vvFL2Y4da0dDarUH8tmj7w&amp;s=19\" data-v-f87c67ca=\"\">sent $22,000<\/a> to a pseudonymous crypto trader to buy a car within three hours of them asking for one on X — with some observers <a href=\"https:\/\/twitter.com\/theirish_man\/status\/1729107605174321455\" data-v-f87c67ca=\"\">noticing<\/a> that it mirrored former FTX CEO Sam Bankman-Fried’s <a href=\"https:\/\/twitter.com\/greg16676935420\/status\/1544818100675149826?lang=en\" data-v-f87c67ca=\"\">sporadic Tesla giveaway<\/a> last year. Grachev also <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1709173307638010340\" data-v-f87c67ca=\"\">posted<\/a> a picture of a Lamborghini branded with the DWF Labs logo, while his other posts show the company has been raising its profile by hosting events in Istanbul and Hong Kong.","Looking back on DWF Labs’ progress over the last year and four months, Grachev <a href=\"https:\/\/twitter.com\/ag_dwf\/status\/1729044342042669170\" data-v-f87c67ca=\"\">acknowledged<\/a> he had made mistakes and that the company was “not ideal.” But he claimed that it’s raising the bar among market-making firms by taking risks, acting differently and that the firm is “controversial and proud of it.”","<em data-v-f87c67ca=\"\">This is the first of a two-part series on DWF Labs. The second article, looking at the history of the company and how it became so flush with cash, can be <a href=\"https:\/\/www.theblock.co\/post\/268542\/the-origin-story-of-crypto-trading-firm-dwf-labs\" data-v-f87c67ca=\"\">found here<\/a>.<\/em>","<i data-v-f87c67ca=\"\">Ryan Weeks and Yogita Khatri contributed to the reporting of this article.<\/i>","<i data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute —&nbsp;a competitor to DWF Labs — previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"Algorand Foundation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$40 million","content":"MONEY"},{"type":"“Price Management","content":"ORGANIZATION"},{"type":"“Notorious AG","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jordi Alexander","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"$28 million","content":"MONEY"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"X.","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Selini Capital","content":"ORGANIZATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Grachev","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"EOS Network Foundation —","content":"ORGANIZATION"},{"type":"Yves La Rose","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"$22,000","content":"MONEY"},{"type":"EOS Network Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EOS","content":"LOCATION"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Digital Wave Finance","content":"ORGANIZATION"},{"type":"Eric Wragge","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$45 million","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"Istanbul","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"September 2022","content":"DATE"},{"type":"the first half of this year","content":"DATE"},{"type":"Andrei Grachev","content":"PERSON"},{"type":"July 2023","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"Yogita Khatri","content":"PERSON"}],"hashtag":["CRYPTO","INVESTMENT FIRMS","SAM BANKMAN-FRIED","STRATEGIC INVESTMENTS"],"authors":["Tim Copeland","The Block"]}