{"summary":"BlackRock told The Block that its application for a spot bitcoin ETF was still under review by the Securities and Exchange Commission.\nThe price of the world’s largest crypto currency surged after rumors on social media that the fund had been approved.","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256729\/blackrock-says-application-for-spot-bitcoin-etf-is-still-under-review-by-sec","publishDate":"2023-10-16T10:00:22","id":1100,"type":null,"title":"BlackRock says application for spot bitcoin ETF is still under review by SEC despite rumors on social media","category":["Companies"],"content":["BlackRock said Monday that its application for a spot bitcoin ETF was still under review by the Securities and Exchange Commission as the price of the world's largest crypto currency surged after rumors on social media that the fund had been approved.","<span data-v-f87c67ca=\"\">A BlackRock spokesperson confirmed with The Block that the iShares <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.26%\n    <\/span><\/a> <!----><\/span><\/span> application is still under review by the regulator. The SEC has not yet approved of a spot bitcoin ETF in the U.S.<\/span>","Sources close to the SEC also confirmed that the reports were not true. The regulator <a href=\"https:\/\/www.theblock.co\/post\/253506\/sec-moves-to-again-delay-decision-on-valkyrie-spot-bitcoin-etf\" data-v-f87c67ca=\"\">last month<\/a> said it was instituting additional proceedings to determine whether proposed spot bitcoin ETFs from big names including BlackRock, Invesco, Valkyrie and Fidelity should be approved or disapproved, in an apparent additional delay to the ongoing review processes that could last at least another month.&nbsp;","Bitcoin surged toward $30,000 immediately after posts on X suggested the fund had been approved early Monday morning in the U.S. It's since declined from that peak and is currently trading at $28,003, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","The Monday rumors came days after the SEC said it <a href=\"https:\/\/www.theblock.co\/post\/256450\/bitcoin-rises-as-friday-draws-to-close-without-sec-appeal-of-grayscale-ruling\" data-v-f87c67ca=\"\">did not plan to appeal<\/a> an August court ruling that ordered it to reconsider a bid from Grayscale Investments to convert its flagship GBTC fund into a spot bitcoin ETF.","Though the industry is waiting on pins and needles for approval of the first spot bitcoin ETF, a <a href=\"https:\/\/www.theblock.co\/post\/255560\/gold-etfs-could-shed-light-on-the-secs-thinking-about-proposals-for-spot-bitcoin-funds\" data-v-f87c67ca=\"\">number of things<\/a> would still need to happen before one hits the market. The SEC's decision not to appeal the Grayscale case doesn't automatically mean that the regulator plans to approve one.","(<em data-v-f87c67ca=\"\">Updates with additional details throughout.)<\/em>"],"hashtag":["SEC"]}