{"summary":"Galaxy Digital is looking at acquisitions to add new areas to its core businesses, and its CEO sees an opportunity in tokenization.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162080\/galaxy-digital-eyeing-more-ma-despite-554-million-loss","publishDate":"2022-08-08T10:24:08","id":11005,"type":null,"title":"Galaxy Digital eyeing more M&amp;A despite $554 million loss","category":["COMPANIES"],"content":["Galaxy Digital is looking at acquisitions to add new areas to its core businesses.","Founder and CEO Michael Novogratz noted the firm has $1 billion in cash to spend and that it continues to raise capital with an eye toward dealmaking.","“I want to be offensive and we’re looking,” the Galaxy Digital founder and CEO said in a call with analysts after the company posted a $554 million loss in the second quarter.","Galaxy Digital would be following in the footsteps of Sam Bankman-Fried, who has been on a buying spree of late, scooping up lender BlockFi, clearing firm Embed and Bitvo, a Canadian crypto asset trading platform.","“Tokenization, that space appeals to me personally,” Novogratz. “That’s on my radar but it’s something I think we can be a little patient with.”","Galaxy Digital is still waiting to close on its purchase of Bitgo, which was announced in May 2021 and was expected to close by the end of last year.&nbsp;","Novogratz said he expects traditional finance companies to step up later this year and get involved in crypto M&amp;A. “We don’t have a mountain of capital coming in this year but I still feel like there’s a put almost in terms of time and capital marching towards our space,” he said.","Novogratz pointed to mining as a sector that needs more capital investment. “We think we’ve got a role to play in both the lending and potentially consolidation in that space,” he said.","Galaxy also said that it is cutting expenses, including 20% of vendor costs, and has also eliminated some positions. Still, it expects to end the year with about 400 employees, up from around 300 at the start of the year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Novogratz","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"May 2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"second quarter","content":"DATE"},{"type":"Bitvo","content":"PERSON"},{"type":"$554 million","content":"MONEY"},{"type":"Bitgo","content":"LOCATION"},{"type":"Novogratz","content":"PERSON"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}