{"summary":"A renewed effort to create a de minimis tax exemption for day-to-day cryptocurrency purchases has begun in the halls of the U.S. Congress. The bill addresses an issue that arose from the IRS&#x27;s determination in 2014 that bitcoin and other cryptocurrencies constitute a form of property.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53281\/new-congressional-bill-seeks-de-minimis-tax-exemption-for-smaller-crypto-transactions","publishDate":"2020-01-16T12:00:49","id":11019,"type":null,"title":"US Congress seeks De minimis tax exemption for smaller crypto transactions","category":["THE BLOCK"],"content":["A renewed effort to create a&nbsp;<em data-v-f87c67ca=\"\">de minimis<\/em>&nbsp;tax exemption for day-to-day cryptocurrency purchases has begun in the halls of the U.S. Congress.","The Virtual Currency Tax Fairness Act of 2020, published Thursday by Washington, D.C.-based crypto advocacy group <a href=\"https:\/\/coincenter.org\/entry\/congress-takes-a-step-toward-a-de-minimis-exemption-for-everyday-cryptocurrency-transactions\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Coin Center<\/a>, was introduced by Congresswoman Suzan Delbene of Washington and Congressman David Schweikert of Arizona.","The bill addresses an issue that arose from the IRS's determination in 2014 that bitcoin and other cryptocurrencies constitute a form of property – namely, that transactions both big and small trigger a taxable event that leaves payers on the hook for capital gains. Critics of this state of affairs say that it impedes the use of cryptocurrencies as a form of payment due to the tax burden involved.&nbsp;","The goal of the new bill is to exempt transactions involving cryptocurrencies if the calculated gain in question is below $200. As the bill states:","\"Gross income of an individual shall not include gain, by reason of changes in exchange rates, from the disposition of virtual currency in a personal transaction (as such term is defined in section 11 988(e)). The preceding sentence shall not apply if the gain which would otherwise be recognized on the transaction exceeds $200.\"","If approved, the bill would cover transactions taking place after December 31, 2019.","The language and intent of the bill is similar to <a href=\"https:\/\/www.coindesk.com\/us-lawmakers-seek-tax-exemption-bitcoin-transactions-600\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a 2017 effort<\/a> in Congress, also sponsored by Schweikert along with then-Rep. Jared Polis, though in that case, the proposed law would have exempted transactions at a floor of $600 in gains.","Coin Center, which has pushed for the&nbsp;<em data-v-f87c67ca=\"\">de minimis&nbsp;<\/em>exemption as part of its work on Capitol Hill, said Thursday that \"this easy solution to an obvious problem with today’s tax treatment of cryptocurrencies would help level the playing field for this technology.\"","As The Block's Aislinn Keely <a href=\"https:\/\/www.theblockcrypto.com\/daily\/53173\/crypto-is-taking-hold-in-congress-but-2020-elections-will-likely-slow-down-legislation\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">reported this week<\/a>, there is growing momentum around legislation that focuses on cryptocurrency and blockchain. But the unique pressures of an election hear – let alone one that includes the presidency – could act as a roadblock to meaningful progress on proposed bills.&nbsp;","That said, the new bill – along with past proposed measures like Rep. Tom Emmer's Safe Harbor for Taxpayers with Forked Assets Act – further illustrates what is perhaps sustained interest in legislative moves on the tax front.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"December 31, 2019","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$600","content":"MONEY"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Aislinn Keely","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Suzan Delbene","content":"PERSON"},{"type":"Arizona","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"D.C.","content":"LOCATION"},{"type":"David Schweikert","content":"PERSON"},{"type":"Jared Polis","content":"PERSON"},{"type":"Schweikert","content":"PERSON"}],"hashtag":["CONGRESS","IRS"],"authors":["Michael McSweeney","The Block"]}