{"summary":"Bitcoin miners in Texas are powering down amid a heatwave in Texas and as the grid operator asks residents to save energy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156974\/as-texas-grid-operator-calls-for-energy-conservation-some-bitcoin-miners-paused-operations","publishDate":"2022-07-11T16:45:42","id":11016,"type":null,"title":"As Texas grid operator calls for energy conservation, some bitcoin miners paused operations","category":["MINING"],"content":["The Electric Reliability Council of Texas (ERCOT) asked Texans and Texas businesses to voluntarily conserve electricity to conserve energy on Monday due to extreme temperatures.","Energy-intensive bitcoin miners have responded to the peak in power demand by temporarily shutting down operations.","Argo Blockchain <a href=\"https:\/\/twitter.com\/ArgoBlockchain\/status\/1546493365616771075\" data-v-f87c67ca=\"\">said on Twitter<\/a> that it would curtail power to its Helios facility, in Dickens County on Monday afternoon, in response to ERCOT's appeal.","\"We are doing our part to help stabilize the Texas grid,\" the company said.&nbsp;","Riot Blockchain's executive vice president and chief commercial officer Chad Everett <a href=\"https:\/\/twitter.com\/chadeverett\/status\/1546151526837665792\" data-v-f87c67ca=\"\">said<\/a> that the company had already taken its miners offline on Saturday morning at 8 am.","\"Rockdale curtailed all of the power to help the grid battle this extreme heat. The power remained off till 10:00 pm.,\" Everett wrote on Twitter.","Development at Riot's Rockdale site (which will have 400 megawatts in its first phase) is still currently under development. Argo is also midway through constructing its 200-megawatt Helios facility in Dickens County.","Core Scientific said that while only 15% of its footprint is located in Texas, it has powered down all mining machines in the state &nbsp;\"until further notice\" in order to \"provide relief to people in Texas.\"","Many Bitcoin miners in the state have set agreements with ERCOT to power down at peak energy demand times. Advocates say this kind of flexibility can be an asset to the grid.","ERCOT issued the warning to residents not just due to the increased electricity demand, but also because the wind would produce significantly less power than what it historically generated in this time period, according to the statement.","In early June, another heat wave that hit Texas, leading power use <a href=\"https:\/\/www.theblock.co\/post\/151084\/bitcoin-miners-in-texas-have-been-powering-down-amid-heatwave-and-record-electricity-demand\" data-v-f87c67ca=\"\">to break a record for that month<\/a> at 72,785 megawatts. ERCOT's forecast for this Monday said that power demand could reach. 79,000 megawatts. Meanwhile, it also predicted that the grid's total capacity would be at 80,168 between the tightest hours of 2 and 3 pm.","The National Weather Service <a href=\"https:\/\/twitter.com\/NWSHouston\/status\/1546462718634360835\" data-v-f87c67ca=\"\">said<\/a> that \"dangerously hot weather\" was expected in Texas on Monday, with temperatures reaching the 100s, like they did over the weekend.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Electric Reliability Council of Texas (ERCOT","content":"ORGANIZATION"},{"type":"ERCOT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"Blockchain","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"June","content":"DATE"},{"type":"Riot","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"National Weather Service","content":"ORGANIZATION"},{"type":"Dickens County","content":"LOCATION"},{"type":"afternoon","content":"TIME"},{"type":"Chad Everett","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}