{"summary":"Friday morning went without a decision in the ongoing case between Grayscale Investments and the SEC, but bitcoin volatility is back.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246164\/bitcoin-market-reignites-with-volatility-as-grayscale-decision-drags-out","publishDate":"2023-08-18T15:16:35","id":11013,"type":null,"title":"Bitcoin market reignites with volatility as Grayscale decision drags out","category":["CRYPTO ECOSYSTEMS"],"content":["Friday morning came <a href=\"https:\/\/www.cadc.uscourts.gov\/internet\/opinions.nsf\" data-v-f87c67ca=\"\">and went<\/a> without a decision in the ongoing lawsuit filed by Grayscale Investments against the Securities and Exchange Commission. A ruling in the case about plans for a spot bitcoin ETF had been widely <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1692549142839443589\" data-v-f87c67ca=\"\">expected by some<\/a>, and a <a href=\"https:\/\/www.theblock.co\/post\/246121\/bitcoin-price-drops-to-25200-in-sudden-crash-before-rebounding\" data-v-f87c67ca=\"\">flash crash<\/a> last night in crypto markets occurred amid all the <a href=\"https:\/\/www.theblock.co\/post\/245422\/bitcoin-price-declines-as-nervous-market-turns-attention-to-grayscale\" data-v-f87c67ca=\"\">jitters<\/a> in anticipation.&nbsp; &nbsp;","With all the excitement, over $1 billion in leveraged positions were liquidated in the past 24 hours, with the wipe-out of longs sending bitcoin below $26,000 for the first time in two months.&nbsp;","Bitcoin's price was jumpy throughout the day on Friday but continued its downward trend, declining 6.6% over the past day to $26,033 at 2:35 p.m. ET, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","Data from The Block confirmed a spike in price fluctuations. After a month of notable stability, the annualized hourly bitcoin volatility for the last 24 hours was 96.6%. That's much higher than an annualized volatility of 29.52% over the last 30 days.","Although the two figures show differing time scales, one for the last day and the other for the past month, they are both annualized. And the past 24 hours has definitely been an outlier from what had been the new normal.&nbsp;&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/annualized-btc-volatility-30d\/embed\" title=\"Annualized BTC Volatility (30D)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Analysts, meanwhile, spent the day searching for a reason for it all. Some news headlines pointed to a Wall Street Journal <a href=\"https:\/\/www.wsj.com\/tech\/behind-the-curtain-of-elon-musks-secretive-spacex-revenue-growth-and-rising-costs-2c828e2b\" data-v-f87c67ca=\"\">report<\/a> that SpaceX <a href=\"https:\/\/www.theblock.co\/post\/246111\/spacex-wrote-down-bitcoin-holdings-by-373-million-wsj\" data-v-f87c67ca=\"\">sold<\/a> its bitcoin holdings after writing the value down by $373 million. Others placed the blame at door of the Federal Reserve after Wednesday's FOMC minutes <a href=\"https:\/\/www.theblock.co\/post\/245422\/bitcoin-price-declines-as-nervous-market-turns-attention-to-grayscale\" data-v-f87c67ca=\"\">signaled<\/a> hawkish officials hold sway.","The steeper declines Thursday evening occurred shortly after reports that property developer China Evergrande had filed for bankruptcy protection in the U.S., stoking concerns that troubles in China's real estate markets could spread into other parts of the global economy.","According to K33 Research, however, \"none of these narratives can explain the timing or the sharpness of the drop.\" In a note sent to The Block, analysts at the firm said a build-up of leverage in derivatives markets created rapid feedback loops.","Yield App chief investment officer Lucas Kiely corroborated the K33 analysis.","\"Bitcoin and ether have already initiated a recovery today, suggesting the sharp tumbles were liquidation events,\" he told The Block.","Kiely added that multiple factors beyond the realm of crypto are affecting investor sentiment, as investors regard bitcoin as a \"risk-on\" asset to buy in bullish conditions.","Risk on assets are typically dumped in the face of macroeconomic headwinds, and right now, those headwinds include China's real estate crisis.","\"Rising bond yields in the U.S. along with Chinese property giant Evergrande filing for U.S. bankruptcy protection has in turn impacted the Chinese yuan and indirectly influenced bitcoin sentiment,\" Kiely added.","Grayscale, in a <a href=\"https:\/\/grayscale.com\/market-byte-bitcoins-sudden-selloff\/\" data-v-f87c67ca=\"\">Friday report<\/a>, said the declines \"appeared related to macro factors.\" It didn't mention its ongoing case against the SEC.","\"We suspect that the synchronized selloff in equities and fixed income eventually spilled over into crypto as crossover investors reduced portfolio risk,\" Grayscale analysts wrote.&nbsp;","\"Although we see a variety of positives for the digital asset industry over the coming months, the macro markets backdrop remains challenging and may continue to be a source of price volatility,\" the continued.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"29.52%","content":"PERCENT"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"$373 million","content":"MONEY"},{"type":"$26,033","content":"MONEY"},{"type":"last 30 days","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Lucas Kiely","content":"PERSON"},{"type":"6.6%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"2:35 p.m. ET","content":"TIME"},{"type":"Kiely","content":"PERSON"},{"type":"$26,000","content":"MONEY"},{"type":"China Evergrande","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"96.6%","content":"PERCENT"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ANALYST REPORTS","BITCOIN","EQUITY MOVERS"],"authors":["Brian McGleenon","The Block"]}