{"summary":"Ripple is selling one-third of its stake in MoneyGram for the first time, after investing in the remittance firm last year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85911\/ripple-selling-stake-moneygram-first-time","publishDate":"2020-11-28T11:10:16","id":11018,"type":null,"title":"Ripple is selling a part of its stake in MoneyGram for the first time","category":["RIPPLE"],"content":["Ripple is selling one-third of its stake in MoneyGram for the first time, after investing in the remittance firm last year.","The development was <a href=\"https:\/\/sec.report\/Document\/0001104659-20-129908\/0001104659-20-129908.txt\" data-v-f87c67ca=\"\">revealed in a filing<\/a> submitted to the U.S. Securities and Exchange Commission on Friday, in which Ripple said it has authorized an unnamed financial institution to sell up to 4 million shares of MoneyGram on its behalf by March 31, 2021.","After the sale, Ripple will still own 2.3 million shares of MoneyGram and a warrant that gives it the right to buy additional 5.9 million shares, making the total to 8.2 million shares.","So, in terms of percentage stake, Ripple is selling about 33% of its shares in MoneyGram, when including the warrant shares. It would still hold about 67% of the stake (12.2 million minus 4 million shares).","\"This is purely a judicious financial decision to realize some gains on Ripple's MGI [Moneygram International] investment and is in no way a reflection of the current state of our partnership,\" a Ripple spokesperson told The Block.","Indeed, the stock of MoneyGram has gone up in price since Ripple's initial investment. In June 2019, Ripple <a href=\"https:\/\/ir.moneygram.com\/news-releases\/news-release-details\/moneygram-announces-strategic-partnership-ripple\" data-v-f87c67ca=\"\">bought the MoneyGram shares<\/a> at $4.10 apiece — representing a premium of about 183% at the time. The shares are currently trading at about $7.45 — i.e., a gain of about 80% on the initial investment.","\"We will remain a significant shareholder in MoneyGram following the sale — they are clearly a leader in the global payments space in over 200 countries and territories,\" said the spokesperson. \"In just over a year, we've made incredible progress and look forward to continuing to work alongside MoneyGram to transform cross-border payments.\"","The Block has reached out to MoneyGram for comments and will update this story should we hear back.","Ripple and MoneyGram <a href=\"https:\/\/www.theblockcrypto.com\/linked\/48383\/ripple-made-another-20m-investment-in-moneygram-to-complete-its-50m-commitment\" data-v-f87c67ca=\"\">partnered<\/a> last year to leverage XRP in forex settlements as part of MoneyGram's cross-border payments business. As part of the deal, Ripple invested $50 million in MoneyGram. Their partnership agreement is scheduled to expire in July 2023.","Apart from the $50 million investment, Ripple also provides regular incentives to MoneyGram in XRP for leveraging the digital asset in remittance processes. So far, Ripple has <a href=\"https:\/\/www.theblockcrypto.com\/linked\/83044\/ripple-moneygram-xrp-incentives-q3-2020\" data-v-f87c67ca=\"\">shelled out<\/a> $52 million worth of incentives.","While MoneyGram receives these incentives in XRP, the company does not hold the digital asset. \"We sell XRP as soon as we receive it,\" a MoneyGram spokesperson <a href=\"https:\/\/www.theblockcrypto.com\/daily\/58860\/we-sell-xrp-as-soon-as-we-receive-it-says-moneygram-on-ripple-incentive-payments\" data-v-f87c67ca=\"\">told The Block<\/a> earlier this year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"MoneyGram","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$4.10","content":"MONEY"},{"type":"67%","content":"PERCENT"},{"type":"MGI","content":"ORGANIZATION"},{"type":"$7.45","content":"MONEY"},{"type":"33%","content":"PERCENT"},{"type":"$52 million","content":"MONEY"},{"type":"183%","content":"PERCENT"},{"type":"June 2019","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"March 31, 2021","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Ripple","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"},{"type":"Moneygram International","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["XRP"],"authors":["Yogita Khatri","The Block"]}