{"summary":"Trezor has launched its Safe 3 hardware wallet, a limited edition bitcoin-only version and its Keep Metal recovery seed backup solution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256114\/trezor-new-crypto-hardware-wallets-backup-solution","publishDate":"2023-10-12T07:23:40","id":11014,"type":null,"title":"Trezor unveils new crypto hardware wallets and backup solution","category":["COMPANIES"],"content":["Crypto hardware wallet manufacturer Trezor has rolled out a trio of new products designed to encourage self-custody of digital assets: the Trezor Safe 3 hardware wallet, a limited edition bitcoin-only version and the Trezor Keep Metal for recovery seed backup.","The Trezor Safe 3 hardware wallet comes in four colors: “Solar Gold, Stellar Silver, Galactic Rose and Cosmic Black,” priced at $79, according to a statement. The bitcoin-only Trezor Safe 3 was built to commemorate the Trezor's 10th anniversary and comes in “Bitcoin Orange,” and the Trezor Keep Metal is designed to provide a mistake-proof, convenient backup solution for users recovery seed, the team added.","“Bitcoin, and the wider cryptocurrency sector, has been with us now for 14 years. It is no longer a niche interest,” Trezor CEO Matěj Žák said in the statement. “There are 420 million crypto owners worldwide and, according to predictions, this number will more than double by 2027 to almost a billion — one in eight of the global population.”","“Events over the last year or so [like FTX’s collapse] have demonstrated the risks people are taking when they entrust the custody of their cryptocurrencies to centralized exchanges. Time and again, we’ve seen the reality of ‘not your keys, not your coins’ play out,” Žák continued. “As we approach the next wave of Bitcoin adoption, we’ve introduced new devices that enable crypto novices and newcomers to enjoy the security and peace of mind that comes with owning and safeguarding their own crypto.”","The Trezor Safe 3 integrates with the existing Trezor Suite desktop application, allowing users to buy, sell and exchange their assets securely. The wallet supports bitcoin, ether and more than 7,000 other coins and tokens.","The Trezor Safe 3 also adds another layer of security by introducing a secure element, offering tamper-resistant protection against physical attacks.","Unlike rival manufacturer Ledger, Trezor devices are open-source, meaning they are community-based and audited, so vulnerabilities may be seen and fixed faster. On the other hand, it may make devices easier to crack when they are stolen. For the Trezor Safe 3 secure element, a third-party vendor was chosen that allows it to publish any vulnerabilities discovered.","In a nod to Trezor’s launch year, only 2,013 bitcoin-only versions will be produced, with €21 ($22) from each sale donated to support the Trezor Academy, a Bitcoin education initiative.","The Trezor Keep Metal, crafted from aerospace-grade stainless steel, is resistant to fire, water and corrosion, the team claims, helping to ensure the safety of recovery seeds. Available for both 12-word and 24-word backups at $99, it's also compatible with the more advanced 2-of-3 Shamir split recovery seed backup scheme for the Trezor Safe 3, priced at $249.","A recovery seed, often referred to as a seed phrase or backup phrase, is a series of words generated when setting up crypto wallets, serving as a backup method to restore access to funds in case access to the wallet is lost.","“We understand that self-custody can be intimidating, especially for newcomers,” Žák added. “That’s why we have designed the new wallets and the backup solution with beginners in mind. They’re packed with security features to keep digital assets safe.”","The new products are available for pre-order now, with shipping commencing in mid-November.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Trezor","content":"ORGANIZATION"},{"type":"$249","content":"MONEY"},{"type":"2027","content":"DATE"},{"type":"$79","content":"MONEY"},{"type":"$22","content":"MONEY"},{"type":"$99","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Trezor Keep Metal","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bitcoin Orange","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"mid-November","content":"DATE"},{"type":"Trezor CEO Matěj Žák","content":"ORGANIZATION"},{"type":"Trezor Academy","content":"ORGANIZATION"},{"type":"3","content":"DATE"}],"hashtag":["BITCOIN","ETHEREUM","FTX","HARDWARE","WALLET MAKERS"],"authors":["James Hunt","The Block"]}