{"summary":"Robinhood was fined for allegedly failing to comply with anti-money laundering and cybersecurity regulations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160891\/robinhoods-crypto-division-slapped-with-30-million-fine","publishDate":"2022-08-02T09:43:47","id":11021,"type":null,"title":"Robinhood&#x27;s crypto division slapped with $30 million fine","category":["REGULATION"],"content":["Robinhood's crypto unit has been fined $30 million by the New York State Department of Financial Services (NYDFS), which <a href=\"https:\/\/www.dfs.ny.gov\/reports_and_publications\/press_releases\/pr202208021\" data-v-f87c67ca=\"\">alleges<\/a> that the company violated anti-money laundering and cybersecurity regulations.","According to the release, the NYDFS found the alleged failures through a supervisory exam and a subsequent enforcement investigation. This is the regulator's first crypto enforcement action.","The NYDFS said that Robinhood's Bank Secrecy Act and anti-money-laundering compliance programs weren't adequately staffed. It added that the firm's cybersecurity program didn't properly address the company's operational risks, nor did its policies comply with the regulator's cybersecurity and virtual currency regulations.","The investigation also found that by not having a dedicated phone number on its website for consumer complaints, Robinhood had failed to comply with consumer-protection requirements.","\"DFS will continue to investigate and take action when any licensee violates the law or the Department’s regulations, which are critical to protecting consumers and ensuring the safety and soundness of the institutions,” superintendent Adrienne Harris said.&nbsp;&nbsp;","Robinhood will now be required to maintain an independent consultant to evaluate its compliance with the state regulator's rules and its remediation efforts.&nbsp;","Shares in the retail investment platform were down marginally at the open on Tuesday, losing just over 1% following the news. The firm will post its second quarter earnings on Wednesday.","<em data-v-f87c67ca=\"\">This article has been updated to remove references to an earlier Wall Street Journal report and add quotes from superintendent Harris following a press release from the NYDFS.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Adrienne Harris","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"DFS","content":"ORGANIZATION"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Harris","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"$30 million","content":"MONEY"}],"hashtag":["ROBINHOOD"],"authors":["Adam Morgan McCarthy","The Block"]}