{"summary":"Colorado-based Riot recorded a net loss of $27.7 million in Q2, compared with a net loss of $353.6 million in the same quarter last year, its earnings showed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244050\/bitcoin-miner-riot-platforms-narrows-losses-in-q2-earns-more-power-credits","publishDate":"2023-08-09T23:39:10","id":11029,"type":null,"title":"Bitcoin miner Riot Platforms narrows losses in Q2, earns more power credits","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Bitcoin mining firm Riot Platforms posted a narrowed net loss in the second quarter of this year, significantly less than in the same period last year when the industry languished under high energy cost and low bitcoin prices, its latest earnings results showed.<\/span>","<span data-v-f87c67ca=\"\">Colorado-based Riot recorded a net loss of $27.7 million in the second quarter, compared with a net loss of $353.6 million in the same period last year, according to the company’s <\/span><a href=\"https:\/\/www.riotplatforms.com\/news-media\/press-releases\/detail\/158\/riot-platforms-reports-second-quarter-2023-financial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">earnings report<\/span><\/a><span data-v-f87c67ca=\"\"> released Wednesday.<\/span>","<span data-v-f87c67ca=\"\">“Riot’s core business is bitcoin mining, and the scale of our vertically integrated operations and financial strength allowed us to execute on our power strategy at unmatched scale this quarter, driving our average cost to mine to $8,389 per Bitcoin in the second quarter, compared to an average bitcoin price of $28,024,” Jason Les, chief executive officer of Riot, said in the report.<\/span>","<span data-v-f87c67ca=\"\">The company’s revenue came in at $76.7 million in the second quarter of this year, up from $72.9 million in the same quarter last year. The increase was mainly driven by a 27% increase in bitcoin production, offset by lower Bitcoin prices, the company said.<\/span>","<span data-v-f87c67ca=\"\">Notably, Riot earned $13.5 million in power curtailment credits during the second quarter, compared with $5.7 million in the same period last year.<\/span>","<span data-v-f87c67ca=\"\">The company produced 1,775 Bitcoin in the second quarter, with its mining revenue amounting to $49.7 million, up from $46.2 million in the year-ago period. “Higher Bitcoin production was driven by a significant increase in miners deployed year over year,” Riot said.<\/span>","<span data-v-f87c67ca=\"\">Les said that Riot has signed a long-term purchase agreement with MicroBT to acquire 33,280 next-generation miners with an option to purchase 66,560 more miners. These miners would likely add an additional 7.6 EH\/s in capacity for Riot by mid-2024, he added.<\/span>","<span data-v-f87c67ca=\"\">Riot reached 10.7 EH\/s in capacity in the second quarter, an all-time high. It expects to reach 20.1 EH\/s by the second quarter of 2024 and 35.4 EH\/s in 2025.<\/span>","<span data-v-f87c67ca=\"\">Riot’s stock price closed 4.42% lower on Wednesday and dipped 0.85% in after-hours trading.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"$13.5 million","content":"MONEY"},{"type":"second quarter of this year","content":"DATE"},{"type":"0.85%","content":"PERCENT"},{"type":"$76.7 million","content":"MONEY"},{"type":"$72.9 million","content":"MONEY"},{"type":"$353.6 million","content":"MONEY"},{"type":"this quarter","content":"DATE"},{"type":"$8,389","content":"MONEY"},{"type":"$46.2 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Jason Les","content":"PERSON"},{"type":"$49.7 million","content":"MONEY"},{"type":"Colorado","content":"LOCATION"},{"type":"$28,024","content":"MONEY"},{"type":"second quarter of 2024","content":"DATE"},{"type":"4.42%","content":"PERCENT"},{"type":"$27.7 million","content":"MONEY"},{"type":"27%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Riot","content":"ORGANIZATION"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"second quarter","content":"DATE"},{"type":"$5.7 million","content":"MONEY"}],"hashtag":["MINING COMPANIES"],"authors":["Timmy Shen","The Block"]}