{"summary":"The FTX creditors committee described the draft plan as just &quot;ideas&quot; and said there had been no formal talks with debtors to discuss approval.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242575\/ftxs-creditors-say-they-werent-looped-in-on-plan-to-recoup-funds","publishDate":"2023-08-01T11:05:56","id":11027,"type":null,"title":"FTX&#x27;s creditors say they weren&#x27;t looped in on plan to recoup funds","category":["COMPANIES"],"content":["Lawyers representing most of the creditors owed money by Sam Bankman-Fried's failed crypto empire blasted a a draft <a href=\"https:\/\/www.theblock.co\/post\/242414\/ftx-proposes-to-reboot-offshore-exchange-as-part-of-reorganization-plan\" data-v-f87c67ca=\"\">reorganization plan<\/a> released Monday by FTX's caretaker leadership, and said lawyers representing the multinational web of companies should do more to engage with them.","The official committee of unsecured creditors did agree with FTX's interim leadership, brought in to restructure the group of companies, on a restarting operations. But they said they weren't looped in on the plan for a “<a href=\"https:\/\/www.theblock.co\/post\/242414\/ftx-proposes-to-reboot-offshore-exchange-as-part-of-reorganization-plan\" data-v-f87c67ca=\"\">rebooted<\/a>” offshore exchange available to non-U.S. users, submitted in bankruptcy court late on Monday.","The disagreement could hold up restructuring plans and extend the bankruptcy process through litigation, as creditors will have a vote on the final path forward for the group of largely scandal and debt-ridden companies.","\"What was supposed to be a watershed moment for these bankruptcy cases—the filing of a plan of reorganization preceded by robust, good faith negotiation and collaboration—is anything but,\" the committee of unsecured creditors said in a <a href=\"https:\/\/restructuring.ra.kroll.com\/FTX\/Home-DocketInfo\" data-v-f87c67ca=\"\">statement<\/a> late Monday. The friction could hold up restructuring plans aimed at repaying customers and other creditors.","In the reorganization plan, debtors said they intended to&nbsp;sort claimants into groups, with FTX.com offshore exchange users classified as “dotcom customers” and FTX US users as “U.S. customers.” Those non-U.S. users could receive non-cash consideration in the form of equity or tokens in a new offshore exchange.","The creditors committee described the draft plan as just \"ideas\" and said there had been no formal talks to discuss it, indicating that an FTX reboot is far from becoming a reality. Any formal plan should place control of a post-reorganization company in the hands of \"qualified parties\" selected by the creditors, they declared in their statement.&nbsp;","\"The committee is extremely disappointed that the debtors have not engaged with the committee on these issues nor yet discussed them with its members to appreciate their import,\" it said in the response filing.","The committee added that it wanted a regulatory-compliant recovery token and a re-started FTX exchange \"to enhance creditor recoveries.\"&nbsp;","Lawyers for the creditor committee noted that they've avoided litigation with the corporate estate so far, but argued that FTX's current administrators aren't doing enough to maximize recovery for customers and others who lost money in the company, a legal obligation for debtors in U.S. bankruptcy.","\"For example, the Committee has requested for many months that the Debtors invest a portion of their almost $2.6 billion cash balance in short-term treasury notes in order to generate greater income for the estates and partially offset the professional fees in these cases,\" lawyers from Paul Hastings and Young Conaway Stargatt &amp; Taylor write in their court statement.","The attorneys also claim to have provided a \"blueprint\" for maximizing the remaining crypto holdings of FTX and its various affiliates, Alameda Research, and other investment vehicles currently in the bankruptcy process. Those include staking, hedging, and selling the \"vast coin holdings\" of those firms. The creditor committee criticized FTX's caretakers for not putting forward a plan to make money from the remaining assets until recently, and also called proposals to sell certain venture assets held by the failed companies, \"questionable.\"&nbsp;","The creditor group also criticized the more than $330 million spent on professional fees in the bankruptcy process so far, making it one of the more expensive corporate bankruptcies in history.&nbsp;","\"With a monthly professional fee burn rate of over $50 million, these cases cannot afford a unilateral plan approach,\" the creditors committee said. \"The Debtors must understand that their customers and creditors will not vote in favor of a plan that is imposed on them without the substantive input and recommendation of the Committee, their fiduciary representative.\"","But if creditors begin to sue that could drag out the process, adding more to the overall cost. Lawyers representing them called on FTX's lawyers to loop them in more, while threatening to reject any restructuring plan, including one that could relaunch parts of the unusually expansive web of international companies, unless that plan includes \"substantive input and recommendation\" from the creditor committee.","\"The committee remains ready to negotiate a plan that customers and creditors can support. This will take willingness on the part of the debtors to listen and engage and not attempt to substitute their judgment for that of the parties who truly know and understand the cryptocurrency markets,\" the statement added.&nbsp;","Proceedings remain ongoing in the U.S. Bankruptcy Court for the District of Delaware.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Paul Hastings","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Committee","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Young Conaway Stargatt &amp; Taylor","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$330 million","content":"MONEY"},{"type":"$2.6 billion","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","FTX","SAM BANKMAN-FRIED"],"authors":["Nathan Crooks","The Block"]}