{"summary":"The Arbitrum DAO is voting on a proposal that would enable ARB token staking, offering a yield financed by the DAO’s treasury.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261390\/ongoing-vote-on-arbitrum-token-staking-is-leaning-toward-majority-approval-from-dao","publishDate":"2023-11-03T10:57:39","id":11033,"type":null,"title":"Ongoing vote on Arbitrum token staking is leaning toward majority approval from DAO","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The Arbitrum DAO is in the midst of an initial vote on a proposal that aims to <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.73%\n    <\/span><\/a> <!----><\/span> holders to lock in their tokens in return for a yield paid out in tokens. The decision, now subject to a temperature check vote, is scheduled to conclude on November 6.<\/span>","Initially introduced by PlutusDAO in September, the proposal recommends the DAO to use Arbitrum treasury funds to fund the staking yield and distribute it to stakers through a smart contract over 12 months.","The initial governance <a href=\"https:\/\/snapshot.org\/#\/arbitrumfoundation.eth\/proposal\/0xf22530295daee96dffd7f70854475c06216a4d3594929672f71c12bf638bb0c8\" data-v-f87c67ca=\"\">proposal<\/a> being voted on presents multiple options for users to decide on the use of the <a href=\"https:\/\/arbiscan.io\/address\/0xf3fc178157fb3c87548baa86f9d24ba38e649b58\" data-v-f87c67ca=\"\">3.5 billion ARB tokens<\/a> ($3.4 billion) in treasury funds — or to reject the proposal altogether. It outlines a tiered token allocation system, suggesting that between 1% (100 million tokens), 1.5% (150 million) and 1.75% (175 million tokens) of the total 10 billion ARB supply be earmarked from the DAO’s treasury for staking rewards. At the time of writing, the majority of voters are in favor on enabling staking for which they want allocate 1% (100 million tokens).","The proposed staking model also includes penalties for early withdrawal to encourage stakeholders to maintain their investments, thereby aligning the commitment of token holders with the ecosystem’s long-term objectives.","After this temperature check voting period, the DAO is set to consider a subsequent AIP proposal that will focus on the specifics of the staking implementation and will need approval. Furthermore, a final community nod on the Tally, an on-chain DAO management platform, would be required to finally grant stakers a token yield from the treasury. This yield will be distinct from other mechanisms where tokens are staked to secure the network or to distribute revenue.","<em data-v-f87c67ca=\"\">The article has been updated to specify that a subsequent vote, following the above initial one, will be held to approve the implementation of staking.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AIP","content":"ORGANIZATION"},{"type":"1.75%","content":"PERCENT"},{"type":"November 6","content":"DATE"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"-1.73%","content":"PERCENT"},{"type":"$3.4 billion","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"1%","content":"PERCENT"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}