{"summary":"Multiple sources have told The Block that the SEC is not providing the assistance requested on a major congressional effort to overhaul crypto markets in the U.S.\nA final draft of the unusual multi-committee bill is expected to be introduced on Thursday, in anticipation of a committee debate and vote next week.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill","publishDate":"2023-07-20T08:02:09","id":1103,"type":null,"title":"SEC said to be slow-walking assistance requested for US crypto market bill","category":["Policy"],"content":["A Republican-led effort to create new rules for crypto markets in the U.S, which has gathered momentum for months, could be headed for a Securities and Exchange Commission-sized speed bump.&nbsp;","The market structure legislation — as of Wednesday afternoon still an untitled bill, though Republican members of the House Financial Services Committee were briefed on the otherwise completed product in the afternoon — would direct U.S. markets regulators to make explicit the path for a digital asset to transition from being a security to a commodity. It would also grant the Commodity Futures Trading Commission greater power over crypto commodities markets — mainly bitcoin trading, for now. Assets that become decentralized enough to be considered commodities would no longer be subject to financial disclosure requirements, a central sticking point in the crypto industry’s ongoing battles with the SEC.","The bill, a rare joint effort between House committees because the House Agriculture Committee holds jurisdiction over commodities regulation, is expected to be unveiled on Thursday. A markup, the term for a committee debate and amendment process, was originally scheduled for the Financial Services portion on Wednesday but pushed to next week to allow time for additional review by committee members and tweaks to language to gain additional Democratic support.","But people familiar with the bill and its drafting, who asked for anonymity to speak freely on the topic, told The Block the SEC has yet to provide substantive technical feedback requested for the highly complex bill, which may hinder efforts to attract Democrats to supporting the legislation, key if it is to have a chance of becoming law this Congress.","SEC officials gave staff of Democratic members of the House Financial Services Committee a briefing last week about their views of digital asset regulation, in the context of the committee’s upcoming consideration of bills to create a comprehensive framework for stablecoins and crypto markets in the U.S.","“The general message was this bill is not fixable and we’re not giving you technical assistance to try to fix it,” said a financial lobbyist familiar with the briefing.","A Republican staffer for the Financial Services Committee said that SEC staff have been communicative, and House Financial Services Committee Chair Patrick McHenry, R-N.C. and SEC Chair Gary Gensler had “good conversations.” But the SEC had not provided the full technical assistance requested on the bill.","“It’s been almost six weeks,” said the staffer. “We have not received what I would characterize as the typical technical assistance.”","The staffer added that congressional staff drafting the legislation had received more from the CFTC. But the staffer also gave some benefit of the doubt to the SEC, saying they weren’t sure that the SEC was deliberately dragging its feet.","Rewriting any portion of securities law is inherently complicated, even before accounting for the eccentricities of cryptocurrencies and digital assets.","U.S. securities laws have been on the books since the 1930s, intended to be as open-ended as possible because they focus more on activities — raising capital and investment — than the ways those actions might be taken. That’s why so much of the digital asset ecosystem falls under the American definition of a security: most offerings raised money for the projects or companies that created them, even if they had an ostensible utilitarian purpose within a blockchain ecosystem. Within U.S. law, that made a majority of tokens look like stocks or bonds, or even newer forms of capital formation enabled by fintech like equity crowdfunding, but without those digital asset projects providing the typical disclosures required for other issuers. The industry even borrowed language from the stock market in hyping token sales: initial coin offerings.","Gensler has repeatedly noted his reluctance to adjust existing securities laws because of fears of creating loopholes and potentially undermining stability in the broader securities market.","“If Congress were to act, though I don’t think we need these authorities, not to undermine inadvertently through definitions of what’s in or out, or in essence allowing for conflicts that we don’t allow,” Gensler said following testimony before a House Appropriations subcommittee in March.","Another complicating factor: technical assistance could be brought into lawsuits, as documents related to a 2018 speech on ether by former SEC official Bill Hinman were in the agency's case against Ripple Labs, or obtained and published via Freedom of Information Act requests, as industry groups have attempted.","Asked about providing technical assistance to House lawmakers during a gaggle with reporters on Wednesday, Gensler declined to discuss his and his staff’s contact with Congress around the legislation.","“Our discussions with any member of Congress, Senate, House, majority, minority, we try to do that directly with them rather than through the press,” said Gensler.","Another source familiar with contact between the SEC and Congress, who would only speak to the matter if granted anonymity, disputed the notion that the agency had not provided technical assistance to lawmakers.","The SEC has, “given technical assistance to both majority and minority, both orally and written technical assistance,” said the source.","Hours before Gensler spoke to reporters on Wednesday, Reps. French Hill, R-Ark., and Dusty Johnson, R-S.D., sent the SEC chair a letter calling for “<a href=\"https:\/\/www.theblock.co\/post\/240548\/republicans-want-productive-engagement-from-gensler-on-crypto-bills\" data-v-f87c67ca=\"\">productive engagement<\/a>” on legislative efforts that they see as a way to prevent future collapses of crypto firms.","“It is a difficult situation,” said the Republican Financial Services Committee staffer, adding that staff would continue to try to get the input they sought from the SEC.","While the SEC does not play a formal role in lawmaking, congressional offices often seek agency assistance when drafting complex bills in the agency’s jurisdiction, in order to iron out potential issues, including possible unintended consequences, as well as due to the fact that agencies have far more subject matter experts than congressional offices.","Democratic lawmakers, particularly financial regulatory hawks like Senate Banking Committee Chair Sherrod Brown, D-Ohio, whose committee the bill would likely have to go through in order to become law, also value SEC Chair Gary Gensler’s opinion on regulatory issues because of his prior experience implementing parts of the Dodd-Frank financial reform law passed as a response to the 2008 global financial crisis. Gensler oversaw enactment of parts of that law during his tenure at the CFTC.","The SEC chair also has personal relationships with several lawmakers. During an <a href=\"https:\/\/www.theblock.co\/post\/240659\/post-ftx-senators-want-gensler-to-do-more-to-police-crypto-industry\" data-v-f87c67ca=\"\">SEC budget hearing<\/a> at the Senate Appropriations Committee on Wednesday, Gensler noted that he and Sen. Chris Van Hollen, the Maryland Democrat who chairs the subcommittee with power over funding for the agency, have known each other for over 20 years and speak by phone.","Gensler and the SEC were seen as intentionally dragging their feet on a similar request for <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwiViKHDpJyAAxWDrYkEHUCjDQcQFnoECB8QAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F225152%2Fgensler-sec-crypto-stablecoin-congress&amp;usg=AOvVaw2EPa6nVRHYalkX32VKwKVe&amp;opi=89978449\" data-v-f87c67ca=\"\">cooperation on bipartisan stablecoin legislation<\/a> last year. Talks stalled with midterm elections looming, but picked back up again after Republicans took a smaller majority than they’d anticipated in the House of Representatives, and Democrats unexpectedly maintained narrow control of the Senate.","Democratic support for the market structure legislation, which could be the biggest concrete, long-term policy boost digital assets have seen in the U.S., remains ambiguous.","The lobbyist tracking the effort saw a delay in introducing the bill this week, as staff and lawmakers work behind the scenes to accommodate concerns from Democrats, as a positive step to at least part of the House effort becoming law. But at the same time the lobbyist cast doubt that the market structure bill of would get there, which could endanger Republican support for passing a stablecoins bill, as the hope by House Republicans is to move the two together.","“I don’t think the administration’s taking market structure really that seriously. Gary is basically the lead there,” the lobbyist said, referring to Gensler.","The lobbyist added that the perception is Rep. Maxine Waters, the top Democrat on the committee, wants a deal on stablecoins but not the market structure bill. Though the bill tries to address a problem highlighted by U.S. regulators, that they do not have direct oversight authority into the largest digital asset spot market — bitcoin trading — it could diminish, slightly, the better-funded SEC’s power over digital asset regulation. After a year of high-profile bankruptcies, and the perception that FTX had nearly bought its way to legitimacy in Washington, lawmakers are also wary of how volatile the crypto industry is. In addition to ideological differences, lawmakers may see supporting any bill perceived as accommodating the industry as politically risky.","“Market structure is very complicated,” Waters told The Block on Tuesday when asked about guidance the SEC had given Financial Services Committee Democrats. “I think that for the most part, our members are still needing a lot more information.”","After last year’s negotiations, and further ones during this Congress, the stablecoins bill is expected to have more bipartisan buy-in than the market structure legislation, which would require proof of reserves and approval from regulators before offering payment stablecoins in the U.S.","McHenry, the Financial Services chair and one of the most influential members of Congress, has repeatedly said he wants to approach the issue pragmatically and make law, rather than introduce a bill containing a laundry list of industry asks that would go nowhere in a split Congress, and with a Democrat in the White House. The hope is to get enough House Democrats to support the bills, without watering down too much of what more laisez faire Republicans and industry advocates want, in addition to some behind-closed-doors negotiations, to convince Senate Democrats and the Biden administration to move forward on the bills.","But that persuasion will have to happen this week, in advance of the committee votes next week. On Tuesday, Waters sounded skeptical.","“We’ve got a long way to go on market structure,” the California Democrat said.","Or, as the lobbyist tracking the effort put it, “You have to build the plane while flying it.”"],"hashtag":["CFTC","CONGRESS","FINTECH","FTX","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","PATRICK MCHENRY","SAM BANKMAN-FRIED","SEC"]}