{"summary":"Celsius approached investors about the project, branded Celsius Web Services, with former CEO Alex Mashinsky seeking $1 billion to get it started.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230438\/celsius-web-services-white-label-pivot","publishDate":"2023-05-12T08:23:54","id":11034,"type":null,"title":"Celsius pitched bold white-label pivot as core business collapsed","category":["COMPANIES"],"content":["Celsius Network, the failed crypto lender, pitched deep-pocketed investors on an ambitious plan to white-label some of its services last year — just as its core business imploded. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPitch documents obtained by The Block show that Celsius approached both Wall Street bank Goldman Sachs and Abu Dhabi-backed fund ADQ about a project branded Celsius Web Services in May and June, respectively. The initiative would see Celsius offer generic versions of its products — including those focused on yield and custody — and was described, in one of the decks, as a “web3 toolbox for a New World.”","Alex Mashinsky, the former CEO of Celsius who resigned in September, spearheaded the CWS plan and wanted to raise $1 billion to get it off the ground, according to a person with direct knowledge of the matter. As well as Goldman and ADQ, Mashinsky pitched his own board, which until June last year included Laurence Tosi, managing partner of WestCap Group, and a representative of Canadian pension fund Caisse de Depot et Placement du Quebec. Those investors jointly invested $750 million in Celsius in late 2021, but wanted no part of CWS.","Mahinsky’s attempt to launch a raft of new products and pivot Celsius away from its core business of lending out crypto assets couldn’t, however, happen fast enough to avoid that lending business sinking the entire company. Celsius froze withdrawals on June 12 and filed for Chapter 11 bankruptcy a month later, <a href=\"https:\/\/www.wsj.com\/articles\/celsius-owes-users-more-than-4-7-billion-11657841826\" data-v-f87c67ca=\"\">owing over $4.7 billion<\/a> to more than 100,000 users.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“What he [Mashinsky] wanted to do was to create the Amazon Web Services of crypto,” said the source. A second person close to Celsius said of the CWS plan, “A summary often used was Plaid for web3,” while adding that it went by many names internally. Plaid is a fintech startup that helps customers connect their financial data to new apps and services.","As the pressure mounted on Celsius in May, Mashinsky hoped he could shift attention to the CWS project, the first person said. It was a strategy that surprised some people within the business given how recently Celsius had banked $750 million from external investors, they added. But by that point, the funds were already gone. “The reality is that no one had any idea how bad things were at that time,” the person said.","Those comments chime with the findings of a <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174901312380000000039.pdf\" data-v-f87c67ca=\"\">689-page report<\/a> by court-appointed examiner Shoba Pillay, published earlier this year.","“Throughout May 2022, as Celsius’s employees openly expressed the view that Celsius was a ‘sinking ship’ without a plan, Mr. Mashinsky continued to assure customers that all was well,” Pillay wrote. “Celsius also continued to focus on growth, attempting to attract additional deposits by offering promo codes and reassurances about its liquidity.”","<a href=\"https:\/\/www.theblock.co\/post\/199522\/new-york-sues-former-celsius-ceo-for-fraud\" data-v-f87c67ca=\"\">Mashinsky was hit with a civil lawsuit<\/a> from New York attorney general Letitia James in January that accused him of misleading investors about the health of Celsius. He last week <a href=\"https:\/\/www.theblock.co\/post\/229211\/alex-mashinsky-celsius-nys-lawsuit-defense\" data-v-f87c67ca=\"\">dismissed the fraud claims<\/a> as “baseless.”","In response to requests for comment on the CWS project from The Block, Mashinsky <a href=\"https:\/\/celsiusnetwork.se\/why-did-celsius-collapse-the-true-story\/\" data-v-f87c67ca=\"\">offered a link to a blog post<\/a> detailing the “true story” of Celsius’s collapse authored by a p<a href=\"https:\/\/twitter.com\/celhodl\/\" data-v-f87c67ca=\"\">seudononymous Twitter user named Celhodl<\/a>. It suggests that Celsius’s demise resulted from an “attack” by short-sellers — namely, Alameda Research, the sister company of Sam Bankman-Fried’s failed crypto exchange FTX.","A spokesperson for Caisse de Depot et Placement du Quebec declined to comment. ADQ, Goldman Sachs, WestCap and Celsius’s new management did not respond to requests for comment.","Ultimately, the CWS plan did not come off, with Goldman and ADQ passing and Celsius’s existing investors following suit. Corporate records in the UK suggest WestCap’s Tosi resigned from the board on June 22 last year.","Still, details of the last-gasp pivot give some insight into how Mashinsky hoped to save his ailing crypto empire.","The Goldman deck, dated May 2022, states that Celsius hoped to explore how it could partner with the bank to further its involvement in the crypto industry. CWS had a dedicated internal team, the deck promised, and the “full backing” of the board and external investors.","Most of the deck consists of a high-level overview of the types of services Celsius could offer through CWS. The initiative would see Celsius white-label its products — in the short-term those focused on yield, custody, on-ramp services and a tool for bridging centralized and decentralized ecosystems named CelsiusX. Credit cards, staking, prime brokerage, insurance and NFTs were all listed as potential areas CWS could come to encompass in the future. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Businesses demand a scalable, all-in-one solution with everything needed to build your business,” the deck stated. “Celsius Web Services offer a foundational product suite to power rapid business transformation and continued growth; a web3 toolbox for a New World.”","The ADQ deck, dated June 2022, is a little different. It pitched the creation of a Central Bank Digital Currency (CBDC) for which Celsius and Polygon, a blockchain scaling company, would jointly provide the technology. Polygon denied it was involved in the pitch when contacted for comment.","According to the plan outlined in the deck, the UAE’s central bank would act as the “sole issuer” of the Digital Dirham CBDC, while Celsius and Polygon supplied the infrastructure to run it. For Celsius, that meant providing the types of white-labeled products outlined in the Goldman deck. Chainlink, another crypto startup, was positioned in the deck as a provider of on-chain infrastructure and proof of reserves.","A spokesperson for Chainlink Labs said “we are unaware of CWS and were not involved in any Digital Dirham project.” <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEven though investors balked at Mashinsky’s proposed white-label pivot, he may have been onto something. In March, the UAE <a href=\"https:\/\/www.coindesk.com\/policy\/2023\/03\/24\/uae-unveils-cbdc-strategy-first-phase-to-be-completed-by-mid-2024\/\" data-v-f87c67ca=\"\">unveiled its CBDC strategy<\/a>, stating that it expects to complete the first phase of a Digital Dirham project by mid-2024. G42 Cloud, a local company, and enterprise blockchain firm R3 were named as technology providers. Celsius was not mentioned.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Caisse de Depot et Placement du Quebec","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"Pillay","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"gasp","content":"DATE"},{"type":"WestCap","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"$750 million","content":"MONEY"},{"type":"WestCap Group","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Chainlink Labs","content":"ORGANIZATION"},{"type":"Laurence Tosi","content":"PERSON"},{"type":"June 22 last year","content":"DATE"},{"type":"CWS","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Mashinsky","content":"LOCATION"},{"type":"Mashinsky","content":"PERSON"},{"type":"June 2022","content":"DATE"},{"type":"Digital Dirham CBDC","content":"ORGANIZATION"},{"type":"a month later","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"Goldman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Goldman","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"$4.7 billion","content":"MONEY"},{"type":"ADQ","content":"ORGANIZATION"},{"type":"Celsius Web Services","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"Celsius","content":"PERSON"},{"type":"Abu Dhabi","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Amazon Web Services of crypto","content":"ORGANIZATION"},{"type":"June last year","content":"DATE"},{"type":"Shoba Pillay","content":"PERSON"},{"type":"Tosi","content":"PERSON"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"},{"type":"June 12","content":"DATE"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Ryan Weeks","The Block"]}