{"summary":"BlockFi has put client loans into forbearance, according to a customer email viewed by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189335\/blockfi-puts-client-loans-into-forbearance-email-shows","publishDate":"2022-11-22T17:18:51","id":11046,"type":null,"title":"BlockFi puts client loans into forbearance, email shows","category":["STARTUPS"],"content":["Crypto lender BlockFi has put client loans into forbearance, according to a customer email viewed by The Block.&nbsp;","\"At this time, clients do not have the ability to post new funds to BlockFi,\" the email states. \"As a result, we are putting your loan into administrative forbearance. Any amounts due, including interest and maturity payments, are placed on hold until further notice.\"","BlockFi, which said it has \"significant exposure\" to beleaguered crypto exchange FTX,&nbsp;announced it was suspending withdrawals on Nov. 10. FTX filed for Chapter 11 bankruptcy protection the next day. Earlier that week on Nov. 8, founder Flori Marquez tweeted that all of BlockFi's products were \"fully operational.\"&nbsp;","The customer email said that the interest rate on BlockFi loans will be set to 0% with a starting date of Nov. 11, the email said, adding that \"margin call requirements and auto liquidations at predefined loan-to-value levels are currently paused.\"","Clients do not have to make payments on loans that have matured, the email said, and loans will not be reported to credit bureaus as delinquent. Loan holders will not pay late fees on any payments, according to the message. It does not appear that borrowers requested forbearance on their loans.","BlockFi warned that its loan servicing provider, Scratch, will show the loans as delinquent in its system. \"But given the 0% interest rate, your loan will not accrue any interest or late penalties,\" BlockFi's email said.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Flori Marquez","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nov. 10","content":"DATE"},{"type":"next day","content":"DATE"},{"type":"0%","content":"PERCENT"},{"type":"Nov. 11","content":"DATE"},{"type":"Nov. 8","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Kristin Majcher","The Block"]}