{"summary":"Spot bitcoin ETFs opened the large pools of traditional capital to bitcoin, but there are a number of potential risks for the ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272675\/three-unexpected-risks-from-wall-streets-foray-into-bitcoin","publishDate":"2024-01-15T14:24:03","id":11044,"type":null,"title":"Three unexpected risks from Wall Street&#x27;s foray into bitcoin","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.27%\n    <\/span><\/a> <!----><\/span><\/span> has officially gone mainstream in the U.S. after the <\/span><a href=\"https:\/\/www.theblock.co\/post\/271341\/spot-bitcoin-etfs-can-start-trading-as-sec-clears-final-hurdle\" data-v-f87c67ca=\"\">approval<\/a> of 11 spot bitcoin ETFs. Products by issuers such as BlackRock, Fidelity and Bitwise debuted on Thursday and exceeded <a href=\"https:\/\/www.theblock.co\/post\/272331\/spot-bitcoin-etfs-clear-5-billion-of-cumulative-volume-as-second-day-of-trading-kicks-off\" data-v-f87c67ca=\"\">$7 billion<\/a> in cumulative trading volume over the first two days of trading.","For years, the crypto industry has been waiting for this approval to bring a huge inflow of fresh funds into the market, which is now open to the largest legacy finance firms and crypto-curious retail investors who are not ready for the technicalities of crypto.&nbsp;","However, bitcoin meeting Wall Street has its risks, too. Some long-time bitcoiners point at potentially increasing concentration of bitcoin ownership in the hands of a small group of institutions, potential rehypothecation and changes in the way the bitcoin community governs itself.","The most obvious concern noticed by many prominent crypto individuals is that all the bitcoins backing the ETF shares will be held by only a handful of assigned custodians. Most of the issuers listed Coinbase as their custodian, with exceptions of VanEck, who chose Gemini, and Fidelity with its own custody product.","Jameson Lopp, co-founder and CTO of a bitcoin custody firm Casa, points out that in such situation, the custodian becomes a single point of failure and there are “relatively few ‘doors’ that would need to be knocked upon by government agencies,” if they wanted to seize the bitcoin locked in the ETFs, he told The Block.&nbsp;","Jeffrey Ross, the founder and managing director of an asset management firm Vailshire Capital, believes this concern is “overblown.” Theoretically, there is a risk of a custodian to make a mistake and lose large amounts of clients’ bitcoin, but large finance firms like the current ETF issuers have measures in place to prevent such accidents from happening, he told The Block.&nbsp;","As for a potential government seizure, people draw analogies with the Roosevelt-era ban on gold ownership. However, back then, the U.S. dollar was backed by gold, making it an essential component of monetary policy, and bitcoin is not in the same position, Ross said. “There is no reason for the government to seize bitcoin from Americans,” he added.&nbsp;","Another potential concern can be the so-called financialization of bitcoin, or the transfer of practices from traditional finance into the bitcoin economy, which until now has been functioning more or less by its own standards.","“The ETFs are a double-edged sword for the bitcoin ecosystem,” says Caitlin Long, founder and CEO of Custodia. “The big drawback is that new forms of leverage-based financialization of bitcoin will happen. The SEC did the right thing by prohibiting custodians from lending the bitcoin that backs the ETF units, but there will be commingling, collateral substitution and leverage on the layer above that,” Long told The Block.","Bitcoin-based securities will essentially create bitcoin IOUs (“I owe you”), says Casa’s Lopp. This means that with ETFs, instead of actual bitcoins stored in hardware and software wallets, people will own something that represents the value of bitcoin but has none of its essential properties like decentralization, permissionless nature and visibility on a public ledger.&nbsp;","“Since you can't verify a company's balance sheet, you can't be sure that your IOU is redeemable for the asset it represents,” Lopp said in a blog post last year.&nbsp;","As Long <a href=\"https:\/\/x.com\/CaitlinLong_\/status\/1745894663033086016?s=20\" data-v-f87c67ca=\"\">points out<\/a> in a post on X, there are examples of Wall Street firms artificially inflating the supplies of stocks by buying and selling non-existent shares. Now they can try and pull the same tricks with bitcoin.&nbsp;","Vailshire Capital’s Ross says the current design of the ETFs approved by the SEC does not allow the issuers to loan the bitcoin backing the ETFs. However, with time, more complex derivatives can be created on top of these ETFs — which could open the doors for more reckless behavior. Already, one of the bitcoin ETF issuers, Grayscale, has filed an application with the SEC for a <a href=\"https:\/\/www.theblock.co\/post\/272109\/grayscale-files-for-bitcoin-covered-call-etf-following-conversion-of-gbtc\" data-v-f87c67ca=\"\">covered-call ETF<\/a>, which is designed to generate income from a position in its GBTC ETF.","“You will have to trust that the SEC is monitoring that, but the SEC also has a track record of not monitoring things well,” Ross said. He is both pessimistic and optimistic about this concern. The transparency of public blockchains mean that companies could chose to make their holdings public. But companies are unlikely to provide this information unless the public demands it. And it will only demand it, Ross argued, if someone screws up.&nbsp;","“In 2025-2026, there will be some Wall Street rug pull related to bitcoin,” Ross reckons.","Yet another concern being discussed is that the ETF issuing and trading institutions, which will accumulate a lot of bitcoin and gain some authority in the bitcoin community, wil start trying to influence how the bitcoin protocol is maintained going forward.","For instance, if the bitcoin blockchain is forked into two significant camps, this could be problematic for ETF issuers who are currently <a href=\"https:\/\/www.theblock.co\/post\/270222\/issuers-have-fixed-three-of-the-secs-remaining-concerns-for-spot-bitcoin-etfs-sources\" data-v-f87c67ca=\"\">forced to disregard<\/a> the proceeds from any forks (or airdrops) — potentially leaving them with a less valuable asset underlying their ETFs. They may be incentivized to dampen momentum for any such forks.","Casa’s Lopp believes this idea is far-fetched. In the bitcoin <a href=\"https:\/\/hackernoon.com\/the-great-bitcoin-scaling-debate-a-timeline-6108081dbada\" data-v-f87c67ca=\"\">“blocksize war”<\/a> of 2016-2018, mining and crypto service companies became a voice in favor of forking bitcoin and increasing the maximum block size. However, they did not prevail and the bitcoin community opted to keep the block size as it was.&nbsp;","The difference between now and then is that, unlike companies that became active in the bitcoin scaling debate of the past, the ETF issuers won't be making many on-chain transactions and interacting with the bitcoin protocol as such. “So hopefully they will be less incentivized to become activists in the area of protocol development,” Lopp said.&nbsp;","Ross, however, expects a new governance war to erupt some time after 2025. “[ETF issuers] will definitely try to make changes but that won’t matter,” Ross said. “They will probably try to switch to proof-of-stake or to change the fixed supply [of bitcoins] but there is almost no chance the true bitcoiners will allow this to happen,” he added.&nbsp;","The silver lining is, bitcoin ETFs are only a temporary fix for the transition phase, during which most people will switch from traditional financial instruments to bitcoin, Ross believes. The baby boomer generation currently owns the most wealth, but their children will not need an intermediary between them and bitcoin.","“The longer people own bitcoin the more they will be incentivized to learn what bitcoin actually is. The younger generation will inherit the wealth of their parents and they will sell these ETFs and buy bitcoin,” said Ross.&nbsp;&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"Vailshire Capital","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Roosevelt","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ross","content":"PERSON"},{"type":"Casa","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Lopp","content":"PERSON"},{"type":"Jameson Lopp","content":"PERSON"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"-0.27%","content":"PERCENT"},{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jeffrey Ross","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Casa’s Lopp","content":"PERSON"},{"type":"Caitlin Long","content":"PERSON"},{"type":"$7 billion","content":"MONEY"},{"type":"ETF","content":"ORGANIZATION"},{"type":"Custodia","content":"LOCATION"},{"type":"CTO","content":"ORGANIZATION"}],"hashtag":["BITCOIN","SPOT BITCOIN ETF"],"authors":["Anna Baydakova","The Block"]}