{"summary":"The MEV solution provider says it wants to open source its relay code as a way of hardening the Ethereum ecosystem post-Merge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164152\/flashbots-to-hasten-open-sourcing-of-its-mev-boost-relay-code","publishDate":"2022-08-18T09:00:28","id":11047,"type":null,"title":"Flashbots to hasten open sourcing of its MEV-Boost relay code","category":["ETHEREUM"],"content":["Flashbots says it will accelerate the release of the relay code for its MEV-Boost as open source code, the project <a href=\"https:\/\/writings.flashbots.net\/writings\/Flashbots-Relay-open-sourcing\/\" data-v-f87c67ca=\"\">announced<\/a> on Wednesday.","“Open sourcing our relay code will encourage competition and eschew monopoly and single points of failure,” the announcement stated.","Flashbots is a research project that provides MEV solutions to Ethereum users. MEV stands for maximal extractable value and it refers to the premium that block producers can charge for specially reordering or censoring transaction blocks. This premium is in excess of the normal transaction fee. <a href=\"https:\/\/www.theblock.co\/post\/139155\/mev-bots-earn-476000-by-targeting-large-stablecoin-swaps\" data-v-f87c67ca=\"\">Arbitrageurs use MEV<\/a> to bribe miners or validators to place their transactions in specific blocks for significant financial gains. When used nefariously, MEV can lead to front-running and sandwich attacks.","The MEV-Boost is Flashbots’ latest offering for fair and transparent MEV extraction. By “open sourcing” its code, Flashbots says it is making the Ethereum transaction block market even more competitive.","Flashbots also stated that the open source relay code for MEV-Boost is licensed under an aggressive coy-left license, also known as AGPL. This type of license prescribes open source development of derivatives from the parent code.","“We encourage all teams to develop their relays in the open, and for community members to trust relays only if they act consistent with AGPL norms of transparency and free software, Flashbots advised.”","The project’s decision to open source its relay code comes amid fears that relay providers for crypto services could <a href=\"https:\/\/www.theblock.co\/post\/163415\/tornado-cash-developer-arrest-sparks-fears-of-global-crypto-enforcement\" data-v-f87c67ca=\"\">come under regulatory pressure<\/a>. These fears stem from the recent <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">sanctions imposed<\/a> on crypto mixer Tornado Cash.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Flashbots","content":"PERSON"}],"hashtag":["MEV","SANCTIONS"],"authors":["Osato Avan-Nomayo","The Block"]}