{"summary":"10T Fund Founder &amp; CEO Dan Tapiero chats with host Frank Chaparro about the globalization of crypto and his macro investment strategy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120696\/macro-investor-dan-tapiero-on-why-his-fund-is-pouring-hundreds-of-millions-into-crypto-unicorns","publishDate":"2021-10-15T06:00:01","id":11048,"type":null,"title":"Macro investor Dan Tapiero on why his fund is pouring hundreds of millions into crypto unicorns","category":["BITCOIN"],"content":["Episode <strong data-v-f87c67ca=\"\">64 <\/strong>of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Dan Tapiero, Founder &amp; CEO at 10T Holdings.","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"7d0d12191e1c0e093d0915181f11121e161e0f040d0912531e1210\">[email&nbsp;protected]<\/a>.<\/i>","<strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.exodus.com\/\" data-v-f87c67ca=\"\">Exodus<\/a><\/strong>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em>","<strong data-v-f87c67ca=\"\">About Kraken<\/strong>","<em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em>","<strong data-v-f87c67ca=\"\">About Exodus<\/strong>","<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n“It’s a global development.”<\/span>","<span data-v-f87c67ca=\"\">On this episode of The Scoop, 10T Founder and CEO Dan Tapiero joined host Frank Chaparro to discuss his insights into the globalization of crypto markets and how his macro investing strategy has seen his fund 10T pour hundreds of millions into crypto unicorns.<\/span>","<span data-v-f87c67ca=\"\">To date, Tapiero has already allocated the majority of some of his funds to companies such as Kraken, Deribit, and Ledger. “We have a portfolio of about 10 to 15 companies that are our targets.\"&nbsp; <\/span>","<span data-v-f87c67ca=\"\">Tapiero mentioned how 10T has been helping investors adopt a macro crypto strategy, saying that he’s rejected some 50 plus deals in favor of a more careful approach with a closer guarantee to 5-10x returns. <\/span>In spite of bear swings, Tapiero remains bullish. \"I don't think the valuations of things that we're looking at are high to begin with.\"","Tapiero also observed an \"asymmetry\" that he credits to the market's resilience. He said he's noticed that as bitcoin upside drives valuations up, any market downsides simply cause bitcoin company valuations to remain relatively neutral. He had this to say:","\"I saw that you can have a productive portfolio of assets withstand an unbelievable bear market without even having a negative mark. And so in 2018, what brought me to this idea to some degree, was in '18 bitcoin was down 80 percent, Ethereum 95 percent, but a basket of companies that we looked at broadly maintained their value. So to me, that's like mind blowing. I can build a portfolio that has access to all of the upside, not just of Bitcoin and Ethereum, but the entire space without having to suffer, hopefully, much on the downside... For institutions, especially, this is a very attractive type of portfolio.\"","<span data-v-f87c67ca=\"\">Tapiero also sees a case for youth advocacy of cryptocurrencies as a means of holding sway over politics, with lobbyists backing certain political candidates based on their views of cryptocurrency. “I think there's certainly a strong case to be made that as the younger people come into political power, that we're going to have a transition in the way that people are viewing the crypto business.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tapiero","content":"PERSON"},{"type":"95 percent","content":"PERCENT"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"80 percent","content":"PERCENT"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"10T Holdings","content":"ORGANIZATION"},{"type":"Dan Tapiero","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Deribit","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["BITCOIN","ETHEREUM"],"authors":["Frank Chaparro","The Block"]}