{"summary":"The Chair of the CFTC also noted that crypto exchanges fuse a number of duties that in traditional finance are split.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179494\/behnam-just-a-matter-of-time-before-crypto-returns-to-conditions-of-spring-crash","publishDate":"2022-10-24T15:30:54","id":11050,"type":null,"title":"Behnam: &#x27;Just a matter of time&#x27; before crypto returns to conditions of spring crash","category":["POLICY"],"content":["A key market regulator predicts a return to crypto's spring market crash is \"just a matter of time.\"","\"We can think about what happened last spring with Celsius and Three Arrows and some of the other funds that blew up,\" said Commodity Futures Trading Commission Chair Rostin Behnam. \"I know a lot of that leverage was sort of unwound, we’ve had a much tighter trading range in the crypto space but it’s just a matter of time before it builds up and renews itself and I’d much rather be ahead of it than behind it the next time.\"","Speaking in New York City at the annual meeting of the Securities Industry and Financial Markets Association, Behnam issued his latest call for broader direct authority over crypto markets, which is currently under consideration by Congress, to allow his agency to directly oversee and write rules for spot markets of digital commodities like bitcoin. The CFTC currently can — and has — taken <a href=\"https:\/\/www.theblock.co\/post\/178781\/cftc-highlights-legal-actions-against-crypto-firms-in-year-end-wrap-up\" data-v-f87c67ca=\"\">enforcement actions<\/a> against alleged fraud and market manipulation in crypto markets, but its rulemaking authority is limited to derivatives and futures contracts.&nbsp;","The CFTC chair noted that the structure of crypto intermediaries is \"fraught with potential disaster,\" because crypto exchanges fuse a number of duties that would typically be split.&nbsp;","“A native exchange in the crypto space is probably an exchange, a dealer, a custodian and a bank, all in one. Right? I mean, just think about that in traditional finance, there’s too many conflicts layered on, we wouldn’t have that. So those are the types of things we need to remediate,” Behnam said. \"This just raises a lot of interesting policy questions about market structure. And that's why I think we have to be very proactive in coming up with a policy framework that is not too different from what we have now in our traditional market spaces.\"&nbsp;","A bill before the Senate Agriculture Committee that would grant Behnam and his agency the direct authority over crypto spot markets that he's called for has <a href=\"https:\/\/www.theblock.co\/post\/178485\/sbf-posts-regulatory-manual-for-crypto-and-ftx-cautions-against-locking-in-defi-policy\" data-v-f87c67ca=\"\">vocal support<\/a> from FTX CEO Sam Bankman-Fried and his company, but has received skepticism if not opposition from some developers and lobbyists for the digital asset industry.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Commodity Futures Trading Commission Chair Rostin Behnam","content":"ORGANIZATION"},{"type":"Securities Industry and Financial Markets Association","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"Behnam","content":"PERSON"},{"type":"Senate Agriculture Committee","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Kollen Post","The Block"]}