{"summary":"The Bitcoin network&#x27;s hash rate has suffered a short-term loss as miners in China&#x27;s Sichuan region are facing temporary power limitations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105464\/bitcoin-hash-rate-sichuan-miner-power-limit","publishDate":"2021-05-20T09:15:03","id":11059,"type":null,"title":"Bitcoin hash rate drops as Sichuan miners face short-term power cap","category":["BITCOIN"],"content":["The Bitcoin network's hash rate has suffered a short-term loss as miners in China's Sichuan region are facing temporary power limitations.","The State Grid in Sichuan's Aba county, one of the mountainous ares in the province that houses hydropower plants, issued a notice on May 16, requiring local energy-intensive enterprises to limit their power consumption as the province is currently facing a surging utility demand.","The notice, seen and verified by The Block, was not specifically targeting bitcoin mining farms but requiring all operations in Sichuan's \"Hydro-electricity Consumption Industrial Demonstration Zones\" to cut down their power usage for the time being.","As The Block previously <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86520\/china-sichuan-hydropower-consumption-parks-bitcoin-mining\" data-v-f87c67ca=\"\">reported<\/a>, these industrial zones were set up by the local government to attract power-intensive industries to help consume excessive hydro-electricity during the summer rainy season. As such, bitcoin mining farms have been operating their facilities in these government-sanctioned locations but they are now affected by the power limit until further notice.&nbsp;","The three-day and seven-day moving average of bitcoin's computing power are now at 145 and 154 exahashes per second (EH\/s) respectively, down nearly 20% from the period between May 2 and May 13. Meanwhile, some bitcoin miners in Xinjiang are also gradually unplugging their machines from Northern fossil fuel power plants to transport to Sichuan in time for summer.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In Sichuan, a region hailed as a bitcoin mining hub due to its abundant cheap hydro-electricity, the rain typically starts in May, gradually reaches its peak from June to September and then cools off in October. Therefore, the months of May and October are considered as the flat season and the three months in between are the wet season.","According to the State Grid's notice, there is currently surging demand for electricity from the general public as the weather has been getting hotter in May than usual. But the volume of the rain so far has been relatively small, resulting in a severe power demand and supply imbalance.","Meanwhile, China is <a href=\"https:\/\/www.reuters.com\/world\/china\/china-cut-coal-use-share-below-56-2021-2021-04-22\/\" data-v-f87c67ca=\"\">on its mission<\/a> to cut down the coal use to below 56% of 2021's energy consumption. This is also leading to increasing difficulty for the State Grid in Sichuan to purchase and distribute energy from northern provinces, where the energy is mostly based on fossil fuel power.","It remains to be seen when the situation will be resolved. While the Sichuan State Grid's notice didn't provide a timeline, a <a href=\"https:\/\/www.chinatimes.net.cn\/article\/107355.html\" data-v-f87c67ca=\"\">report<\/a> from China Times on Thursday said the situation could be improved after May 25, citing estimates from local mining farm operators.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 13","content":"DATE"},{"type":"Sichuan","content":"LOCATION"},{"type":"May 25","content":"DATE"},{"type":"May 2","content":"DATE"},{"type":"Sichuan State Grid","content":"ORGANIZATION"},{"type":"May 16","content":"DATE"},{"type":"Xinjiang","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"China Times","content":"ORGANIZATION"},{"type":"56%","content":"PERCENT"},{"type":"State Grid","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Aba","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"October","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}