{"summary":"Bybit’s transparency scheme uses Merkle Trees to allow customers to verify the crypto exchange platform’s reserves.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193985\/bybit-crypto-exchange-says-customers-can-verify-its-crypto-reserves","publishDate":"2022-12-12T07:32:27","id":11058,"type":null,"title":"Bybit crypto exchange says customers can verify its crypto reserves","category":["COMPANIES"],"content":["Bybit has rolled out a system that will allow its customers to verify the crypto assets that the crypto exchange platform holds in its reserves, the company announced last week.","The Bybit proof of reserves system utilizes Merkle Trees, a type of data structure that can be used for on-chain verification. Bybit <a href=\"https:\/\/announcements.bybit.com\/en-US\/article\/bybit-proof-of-reserves--blt8e4e596a04e12ca8\/\" data-v-f87c67ca=\"\">says<\/a> customers with funds on the platform can use the system to confirm that the exchange holds 100% of their assets.","The Merkle Tree-based system also allows customers to check the platform’s reserve ratio, the announcement stated. Reserve ratios help to prove whether crypto exchanges hold enough assets to cover the balances held by users. Bybit’s reserve ratio is currently 1:1, based on Saturday’s announcement.","This is the latest user assurance step taken by the crypto exchange in the wake of the FTX collapse. Bybit has previously <a href=\"https:\/\/blog.bybit.com\/en-US\/post\/statement-from-ben-on-bybit-s-wallets-bltfb7a70c50462875b\/\" data-v-f87c67ca=\"\">published<\/a> the wallet addresses that hold its reserves. The platform’s assets can also be viewed on <a href=\"https:\/\/portfolio.nansen.ai\/dashboard\/bybit\" data-v-f87c67ca=\"\">this<\/a> Nansen dashboard.","Bybit is also the latest to roll out a system for users to verify its holdings following the FTX bankruptcy. Crypto exchange platforms like Binance and Crypto.com have also <a href=\"https:\/\/www.theblock.co\/post\/193684\/crypto-com-releases-proof-of-reserves-study-conducted-by-mazars\" data-v-f87c67ca=\"\">released<\/a> their own proof-of-reserves <a href=\"https:\/\/www.theblock.co\/post\/192861\/binance-collateralized-mazars-audit\" data-v-f87c67ca=\"\">statements<\/a>. These audits and transparency efforts have also come amid massive withdrawals by customers worried about the financial health of other crypto exchanges.","These proof of reserves reports have, however, led to further questions for some platforms. Crypto exchanges like Gate.io and Huobi recently came in for some scrutiny amid allegations that their audits showed borrowed funds as part of their reserves.","Despite these efforts, some critics say <a href=\"https:\/\/www.theblock.co\/post\/187240\/exchanges-rushed-to-show-proof-of-reserves-its-not-enough\" data-v-f87c67ca=\"\">it is not enough<\/a>. They point to the fact that these reports often paint an <a href=\"https:\/\/twitter.com\/jespow\/status\/1596227031637045248?ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">incomplete<\/a> picture of the financial health of these crypto exchanges. Information concerning liabilities and fiat reserves have not been part of these reports.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Alameda","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nansen","content":"LOCATION"},{"type":"Merkle Trees","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Osato Avan-Nomayo","The Block"]}