{"summary":"A vote on choosing a cross-chain bridge to connect Uniswap with BNB Chain sparked a significant behind-the-scenes push. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208095\/uniswap-foundation-charts-path-forward-amid-cross-chain-bridge-governance-debate","publishDate":"2023-02-02T10:43:54","id":11063,"type":null,"title":"Uniswap Foundation charts path forward amid cross-chain bridge governance debate","category":["CRYPTO ECOSYSTEMS"],"content":["The Uniswap Foundation's executive director said a cross-chain bridge governance vote garnered \"more attention than any Uniswap proposal in recent memory.\"","Devin Walsh's post came after a spirited debate over which bridge — a protocol used to connect blockchains — will be used to tie Uniswap with Binance's BNB Chain. Wormhole prevailed in a community \"temperature check\" that attracted significant involvement, both publicly and behind the scenes, from some of DeFi's most deep-pocketed backers, including a16z and Jump.","Walsh wrote that the \"final Governance vote will move forward with the results of the most recent Snapshot Poll.\"","\"In other words, no votes voiced outside of the Snapshot poll will be counted in the results,\" Walsh continued. \"The proposal to deploy Uniswap v3 on BNB Chain will go forward to the final governance vote with Wormhole as the selected bridge.\"","LayerZero, which came in second place in the vote, argued in a statement Tuesday that, in light of sentiments expressed by Uniswap stakeholders, it was the \"preferred bridge\" out of the group. The startup also argued that the foundation should hold a vote with both Wormhole and LayerZero as options.","In her post, Walsh wrote that the foundation \"saw the clear opportunity to create a better process for future cross-chain deployment proposals\" and invited feedback on a proposal for a cross-chain bridge assessment group.","Walsh said that the debate over the bridge selection \"highlighted the urgent need for a better process to be implemented for bridge selection\" as well as more research \"into bridges for governance, and into bridge-agnostic solutions for protocols.\"","\"We hope our learnings, and the new process we create from here, will contribute to the creation of more seamless, standard processes and technological solutions that other protocols can benefit from as they consider deploying across other chains,\" she wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Walsh","content":"PERSON"},{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Devin Walsh","content":"PERSON"},{"type":"Uniswap stakeholders","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","UNISWAP"],"authors":["Michael McSweeney","The Block"]}