{"summary":"Tools For Humanity, the main developer of Worldcoin, is in talks with investors about raising more capital through the sale of WLD tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266688\/worldcoin-tools-for-humanity-fundraise-wld-sale","publishDate":"2023-12-08T08:05:08","id":11068,"type":null,"title":"Worldcoin developer Tools For Humanity looks to raise funds through WLD sale","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">Tools For Humanity — the main developer of Worldcoin, a crypto project co-created by Sam Altman — is in talks with investors about raising more capital through the sale of <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248504\/worldcoin-wld-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/worldcoin.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WLD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.66%\n    <\/span><\/a> <!----><\/span> tokens.<\/span>","TFH has held talks with multiple investors over the past few weeks about a potential over-the-counter sale of WLD. Two people familiar with the process said the company wants to raise up to $50 million, with WLD potentially priced at $1 per token — a significant discount to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/worldcoin\" data-v-f87c67ca=\"\">the prevailing spot price of $2.50<\/a>. However, another person close to the deal stressed that no terms have been finalized.&nbsp;","FT Partners, the San Francisco-based investment bank focused on the fintech sector, is assisting with the raise, according to a third person familiar with the matter. A fourth person with knowledge of the deal said demand from potential investors had been strong since the token’s launch, adding that standard terms around lock-ups would apply to any further investment in WLD.","A spokesperson for Worldcoin declined to comment.&nbsp;","Worldcoin is an identity-focused crypto project that uses orb devices to scan people’s irises to help them prove their identity online. Its co-creator, Sam Altman, is also CEO of OpenAI, the company behind the smash-hit generative AI tool ChatGPT. <a href=\"https:\/\/www.theverge.com\/2023\/11\/29\/23982046\/sam-altman-interview-openai-ceo-rehired\" data-v-f87c67ca=\"\">He recently survived a dramatic attempt by OpenAI<\/a><a href=\"https:\/\/www.theverge.com\/2023\/11\/29\/23982046\/sam-altman-interview-openai-ceo-rehired\" data-v-f87c67ca=\"\">’s<\/a><a href=\"https:\/\/www.theverge.com\/2023\/11\/29\/23982046\/sam-altman-interview-openai-ceo-rehired\" data-v-f87c67ca=\"\"> board to oust him as CEO<\/a>, reassuming control of the firm on Nov. 22.","Worldcoin uses WLD as an incentive to get users signed up to the protocol — rewarding those who get their eyeballs scanned with tokens. <a href=\"https:\/\/www.theblock.co\/post\/241074\/sam-altman-worldcoin-launches-token\" data-v-f87c67ca=\"\">The token officially launched on July 24<\/a>. At that time, more than 2 million people stood to receive their share. Today, over 2.5 million have signed up.","At launch, WLD’s price shot to above $3 before falling to a low of just above $1 in September, <a href=\"https:\/\/www.theblock.co\/price\/248504\/worldcoin-wld-usd\" data-v-f87c67ca=\"\">according to The Block's Price Page<\/a>. It has since risen steadily to the current price of $2.50. The initial launch of the token <a href=\"https:\/\/www.theblock.co\/post\/242109\/worldcoin-ceo-defends-token-launch-after-criticism-over-unfair-distribution\" data-v-f87c67ca=\"\">drew criticism from some commentators<\/a>, who claimed a “low float” structure had created an artificially high price.","<span data-v-f87c67ca=\"\">The price of Worldcoin has increased over the last few weeks. Image: The Block's Price Page.<\/span>","<a href=\"https:\/\/whitepaper.worldcoin.org\/tokenomics\" data-v-f87c67ca=\"\">Worldcoin’s whitepaper<\/a> states that there would be a maximum of 143 million WLD tokens in circulation at launch — out of a total supply of 10 billion. Of those 143 million, 43 million went to verified users, while another 100 million were lent to five market makers operating outside of the U.S. for a term of three months.","TFH, the for-profit company based in San Francisco that has spearheaded most aspects of Worldcoin so far, has raised hundreds of millions of dollars from venture capitalists — most recently <a href=\"https:\/\/www.theblock.co\/post\/232172\/worldcoin-developer-announces-115-million-fundraise\" data-v-f87c67ca=\"\">scoring a $115 million Series C round<\/a> led by Blockchain Capital in May, which FT Partners also helped with. Other investors in the business include a16z crypto, Bain Capital Crypto, Distributed Global and Khosla Ventures. Previous raises have seen investors purchase equity in TFH in addition to token warrants.","The WLD held by backers will begin to unlock 12 months after the token’s launch, meaning it can be sold, assuming investors exercised their warrants in July, according to the whitepaper. The tokens then unlock daily and evenly over a 24-month period. The same rules apply for past and current TFH employees.","Earlier this week, the Worldcoin Foundation — a non-profit that will help guide the project’s continued development — <a href=\"https:\/\/www.theblock.co\/post\/266229\/worldcoin-launches-grant-program-outlines-decentralization-plans\" data-v-f87c67ca=\"\">outlined plans to decentralize the network<\/a> while also launching its first grants program for developers.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"$115 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"July 24","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Worldcoin","content":"LOCATION"},{"type":"$3","content":"MONEY"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Khosla Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2.50","content":"MONEY"},{"type":"Sam Altman","content":"PERSON"},{"type":"FT Partners","content":"ORGANIZATION"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"-0.66%","content":"PERCENT"},{"type":"Nov. 22","content":"DATE"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["SERIES C &AMP; BEYOND"],"authors":["Ryan Weeks","The Block"]}