{"summary":"Maelstrom CIO and former BitMEX CEO Arthur Hayes said AI-powered DAOs will revolutionize the way economic entities are organized and funded.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241873\/ai-dao-arthur-hayes","publishDate":"2023-07-28T06:24:02","id":11066,"type":null,"title":"AI will revolutionize DAOs, says former BitMEX CEO Arthur Hayes","category":["GOVERNANCE"],"content":["Maelstrom CIO and former BitMEX CEO Arthur Hayes said AI-powered DAOs would revolutionize how economic entities are organized and funded — breaking free from traditional company structures.&nbsp;","These traditional structures are not well-suited for AI-driven economic entities, given their reliance on human work ethic and state-enforced contracts to generate productivity and wealth, Hayes argued in his latest <a href=\"https:\/\/cryptohayes.medium.com\/moai-da798c72a83b\" data-v-f87c67ca=\"\">blog post<\/a>.","State-enforced contracts become futile when applied to AIs with no physical bodies and cannot be punished or coerced without destroying the internet and all computer infrastructure — meaning an AI DAO had no reason to follow state-based legal norms, Hayes said.&nbsp;Instead of choosing a jurisdiction, AI DAOs will use smart contracts deployed on public blockchains, like Ethereum, to allow the DAO to provide services for a fee — enabling such DAOs to be self-governing and enforce their own rules.","Unlike traditional companies, AI DAOs wouldn’t need to rely on human intermediaries and be subject to state control, with the blockchain serving as the ultimate enforcer — ensuring compliance with contracts and transparency of operations, Hayes said.","Hayes predicted that DAO capital markets would become the first truly global markets, allowing anyone with an internet connection to trade AI DAO-issued tokens. Decentralized exchanges would become the venue of choice to raise capital and trade the tokens rather than traditional centralized exchanges, he added.&nbsp;“A DEX is naturally suited to support the trading of any type of equity, debt, utility, participation, etc. token issued by an AI-powered DAO,” Hayes said, and will “likely become natural monopolies,” dominating the trading of various DAO-issued tokens.","He added that investors would also have access to the financial performance of DAOs in real-time, eliminating the need for auditors and third-party intermediaries.","Hayes believes the future AI-powered economy will grow into a market of trillions of dollars within the next decade. As AI DAOs emerge, the demand for blockchains, like Ethereum, will skyrocket, leading to a surge in the price of their native tokens.&nbsp;“Ethereum transactions will grow exponentially as DAOs proliferate. As a result, the price of ETH should skyrocket in anticipation if this AI DAO hypothesis is widely believed,” Hayes said.","“I’m a bit of an ETH maxi when it comes to needing actual utility on a Layer-1,” he added. “While investors might make money trading the latest hyped Ethereum clone, none of them will ever eclipse Ethereum in terms of adoption and usefulness.\"","Summing up how he intends to profit from his hypothesis, “Ethereum jig jig boom,” Hayes said.","On Wednesday, The Block reported Hayes’ family office, Maelstrom, had participated in a Pre-A funding round for Aethir, a decentralized cloud network for gaming and AI, at a <a href=\"https:\/\/www.theblock.co\/post\/241498\/arthur-hayes-maelstrom-aethir\" data-v-f87c67ca=\"\">$150 million<\/a> valuation.","Earlier this month, Hayes <a href=\"https:\/\/www.theblock.co\/post\/238311\/bitcoin-ai-currency-arthur-hayes\" data-v-f87c67ca=\"\">said<\/a> bitcoin would be the currency of artificial intelligence, with its digital, uncensorable and scarce properties being ideal for an AI-driven future.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"1","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"$150 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["DAOS","ETHEREUM","SAM BANKMAN-FRIED"],"authors":["James Hunt","The Block"]}