{"summary":"GnosisDAO’s GNO token is now one step away from being an approved collateral for minting the DAI stablecoin on MakerDAO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189921\/makerdao-delegates-approve-gnosisdao-token-as-dai-collateral","publishDate":"2022-11-25T07:30:26","id":11062,"type":null,"title":"MakerDAO delegates approve GnosisDAO token as DAI collateral","category":["GOVERNANCE"],"content":["MakerDAO token holders and delegates have approved GnosisDAO (GNO) tokens as a new vault type for its multi-collateral DAI stablecoin system.","Data from the voting <a href=\"https:\/\/vote.makerdao.com\/polling\/QmUBoGiu#vote-breakdown\" data-v-f87c67ca=\"\">page<\/a> shows 91% approval for onboarding the GNO vault. The result means GNO is one step closer to being used as collateral for minting DAI — the stablecoin issued by the Maker protocol. The Maker governance <a href=\"https:\/\/www.theblock.co\/post\/171316\/makerdao-governance-votes-yes-to-adding-gnosisdao-token-as-collateral-for-dai\" data-v-f87c67ca=\"\">already voted yes<\/a> to the proposal in September. An executive vote in late December will be the final step in the process.","The approved GNO vault will have a maximum debt ceiling of 5 million DAI ($5 million) with a debt floor of 100,000 DAI. These parameters refer to the maximum and minimum amount of DAI that can be minted using GNO as collateral. Other parameters approved by the delegates include a stability fee of 2.5% and a liquidation ratio of 350%. The former helps to maintain DAI’s parity to the U.S. dollar by balancing the risk of mining the stablecoin against the GNO collateral, while the latter determines the minimum collateralization required to prevent the liquidation of the vault.","The plan to onboard GNO as collateral for DAI is part of a partnership between MakerDAO and GnosisDAO. This partnership will see GnosisDAO conduct most of its stablecoin borrowing on Maker. As part of the agreement, GnosisDAO will ensure that at least 75% of its stablecoin borrowing activities will include the use of highly liquid assets like ether and staked ether as collateral.","Maker also called on GnosisDAO to utilize the $5 million maximum debt ceiling “as soon as possible.” GnosisDAO, for its part, plans to mint 30 million DAI using GNO as collateral. The GNO collateral will come from GnosisDAO’s $635 million <a href=\"https:\/\/deepdao.io\/organization\/529571a8-5816-47ff-a50e-1e6372e2324b\/organization_data\/finance\" data-v-f87c67ca=\"\">treasury<\/a>. The minted DAI will be used to support the development of the Gnosis chain, the project said in its <a href=\"https:\/\/forum.makerdao.com\/t\/gno-mip6-collateral-onboarding-application-gnosisdao\/17321\" data-v-f87c67ca=\"\">proposal<\/a>.","The Maker protocol should also benefit from the arrangement. DAI is the primary stablecoin on the <a href=\"https:\/\/www.theblock.co\/post\/142701\/gnosis-chain-makes-key-upgrade-to-prevent-potential-security-attacks\" data-v-f87c67ca=\"\">Gnosis chain<\/a> and is also the token used to pay transaction fees on the network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GNO","content":"ORGANIZATION"},{"type":"91%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Gnosis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$635 million","content":"MONEY"},{"type":"2.5%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"350%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["DAI","DAOS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}