{"summary":"The new firm—which Harrison has been developing in stealth since he left FTX in September—will provide software trading tools in the decentralized finance space for large investors and institutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204140\/brett-harrison-raises-5-million-for-defi-platform-aimed-at-institutions-bloomberg","publishDate":"2023-01-20T08:06:27","id":11064,"type":null,"title":"Brett Harrison raises $5 million for DeFi company aimed at institutions","category":["COMPANIES"],"content":["Former FTX.US president Brett Harrison has raised $5 million from investors including Coinbase Ventures and Circle Ventures to build out his latest venture: Architect.&nbsp;","The new firm—which Harrison has been raising for in stealth since he <a href=\"https:\/\/www.theblock.co\/post\/172744\/ftx-us-president-harrison-is-stepping-down\" data-v-f87c67ca=\"\">left<\/a> FTX in September—will provide software trading tools in the decentralized finance space for large investors and institutions. The raise was first reported by Bloomberg.","Other investors in the round include Anthony Scaramucci, who previously invested in Harrison's former employer, FTX. SV Angel, Third King Venture Capital and Motivate Venture Capital are also backers of the new firm.&nbsp;","Harrison said in a <a href=\"https:\/\/twitter.com\/BrettHarrison88\/status\/1616438223055556609\" data-v-f87c67ca=\"\">Twitter thread<\/a> that the company will build \"institutional-grade trading technology that streamlines crypto market structure, making it easier and safer for firms and large traders to access decentralized protocols and centralized exchanges alike.\"","The primary product is a connectivity layer that helps bridge decentralized venues and players such as qualified custodians, he told The Block.","Its client base is set to include \"small and medium hedge funds as well as trading firms. High volume individual users, who are trading firms themselves. People trading significant volumes who might lack the developer team to build the infrastructure they need,\" the executive added.&nbsp;","Harrison views this a solving the problem of a lack of standardization. \"In DeFi there aren't really market standards...when you combined the fact that people want to trade across DeFi and CeFi markets - there's no real comprehensive solution that ties it all together,\" he said.&nbsp;&nbsp;","Previously head of semi-systematic technology at Citadel Securities, Harrison was tapped to lead FTX's American offshoot in 2021. He has recently distanced himself from disgraced former billionaire and FTX founder Sam Bankman-Fried for his stewardship of the now bankrupt firm.&nbsp;","\"There was tremendous pressure not to disagree with Sam, but I did so anyway,\" Harrison said in a tweet on Jan. 14, referring to his disagreements with Bankman-Fried. \"At that time, and for all of my time at FTX US, his influence over the media, FTX’s partners, the venture capital industry, and the traditional finance industry was pervasive and unyielding.\"","When asked today whether he found it challenging to raise due to his association with FTX, Harrison said that raising capital was challenging for founders across the board even before the company collapsed. \"In talking with other founders, it doesn't seem like we found it any harder than they did,\" he added.&nbsp;","<em data-v-f87c67ca=\"\">This piece was updated after publication to include additional information about the business and Harrison's tenure at FTX.US.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Third King Venture Capital and Motivate Venture Capital","content":"ORGANIZATION"},{"type":"Harrison","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Anthony Scaramucci","content":"PERSON"},{"type":"Jan. 14","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"Coinbase Ventures and Circle Ventures","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":["FTX"],"authors":["Frank Chaparro","Lucy Harley-McKeown","The Block"]}