{"summary":"Hong Kong’s Legislative Council passed an amendment introducing a licensing regime for virtual asset service providers.\nThe new rules for VASPs are scheduled to commence on June 1, 2023.","author":["Adam James","Benjamin Robertson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193209\/hong-kong-amendment-vasp-licensing-regime","publishDate":"2022-12-08T05:18:39","id":1106,"type":null,"title":"Hong Kong passes amendment introducing VASP licensing regime","category":["Regulation"],"content":["Hong Kong's lawmakers passed a law introducing a licensing regime for virtual asset service providers.&nbsp;The Anti-Money Laundering and Counter-Terrorist Financing (Amendment) Bill 2022 also&nbsp;<a class=\"c-link c-link--focus-visible\" tabindex=\"-1\" href=\"https:\/\/www.legco.gov.hk\/yr2022\/english\/counmtg\/papers\/cm20221207cb3-876-1-e.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.legco.gov.hk\/yr2022\/english\/counmtg\/papers\/cm20221207cb3-876-1-e.pdf\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">applies<\/a>&nbsp;traditional customer due diligence and record-keeping requirements to VASPs when conducting certain transactions.","The new rules also require financial institutions to better track customer purchases of crypto assets and codify penalties for the fraudulent sale of digital asset-related products.","The Hong Kong government and the central bank&nbsp;<a class=\"c-link c-link--focus-visible\" tabindex=\"-1\" href=\"https:\/\/www.hkma.gov.hk\/media\/eng\/doc\/key-information\/guidelines-and-circular\/2022\/20221207e1.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.hkma.gov.hk\/media\/eng\/doc\/key-information\/guidelines-and-circular\/2022\/20221207e1.pdf\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">confirmed<\/a>&nbsp;the news in statements on Dec. 7.","The changes strengthen Hong Kong's status as an international financial centre, <a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202212\/07\/P2022120700263.htm\" data-v-f87c67ca=\"\">said<\/a> Christopher Hui, Secretary for Financial Services and the Treasury, in a statement on Wednesday.&nbsp;‘’For VA exchanges, a comprehensive and balanced regulatory framework can protect investors and promote responsible and sustainable industry development,\" Hui said.","Hong Kong has long positioned itself as the world's trading gateway into China and, in October, officials spoke of their goal to also become an international virtual assets center. The city was one of the first to introduce a regulatory licensing regime for fund managers and exchanges that traded digital assets, with other governments around the world trialling their own approaches to supervising crypto-related activities.","While that earlier licensing effort was voluntary, the new rules will require all firms to apply to the Securities and Futures Commission for regulatory oversight. To date, only two crypto exchanges run by BC Group and Hashnet have been granted virtual asset licenses, alongside a handful of fund management firms.","Licensed exchanges and their wholly owned subsidiaries will need to submit audited accounts and financial information to the SFC, the government statement said. The regulator will also have the power to enter business premises for inspections and investigations.","The SFC will carry out further consultation on the detailed regulatory requirements of the regime, the statement said. The regulator is separately holdings consultations on allowing crypto exchange-traded funds to list in Hong Kong, and also on permitting retail investors to trade crypto via locally licensed exchanges. At the moment, only professional investors can trade.","The new rules for VASPs are scheduled to commence on June 1, 2023.","The amendment does not exclusively deal with VASPs. It also establishes a registration regime for precious metals and stones dealers.","<em data-v-f87c67ca=\"\">Updated to provide additional information and context.<\/em>"],"hashtag":["ASIAN REGULATION"]}