{"summary":"Avalanche Foundation has named five memecoins it holds as part of its Culture Catalyst program which aims to “foster web3 creators.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282714\/avalanche-foundation-reveals-five-community-coins-it-holds","publishDate":"2024-03-15T00:08:37","id":11078,"type":null,"title":"Avalanche Foundation reveals five memecoins it holds","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Avalanche <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248368\/avalanche-avax-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avalanche_Circle_RedWhite_Trans.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AVAX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.60%\n    <\/span><\/a> <!----><\/span><\/span> Foundation, which supports the Avalanche blockchain network, has disclosed the first five memecoins that are part of its \"community coins holdings.\"<\/span>","These include meme coins such as Coq Inu, Gecko, Kimbo, NoChill, and Tech. Including these coins in its portfolio is part of the Foundation’s broader Culture Catalyst program, which claims to “foster web3 creators.”","Last year, the foundation declared its plan to acquire community coins specific to the Avalanche network. The selection process for these coins follows the Foundation’s guidelines and emphasizes “high community value.”","“Each community coin held by the Foundation conforms to the Foundation’s established eligibility guidelines for community coin projects. These criteria are designed to assess a particular coin’s commitment to Avalanche and fair Web3 practices,” the foundation stated.","These <a href=\"https:\/\/www.avax.network\/blog\/avalanche-foundation-eligibility-criteria-framework-for-community-coins\" data-v-f87c67ca=\"\">criteria<\/a> include fairness in launch, resistance to snipe bots, security measures, a high number of holders, low concentration of ownership, adequate liquidity provision, and minimum requirements for lifespan, market cap and trading volume.","The foundation also mentioned it is currently evaluating <a href=\"https:\/\/www.theblock.co\/post\/277040\/erc-404-token-prices-dip-as-rival-implementation-approaches\" data-v-f87c67ca=\"\">ERC-404<\/a> tokens to expand its list of community coin holdings. It further clarified that it might modify its community coin holdings and adjust the criteria for eligible community coins in the future.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Kimbo","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"%\n    <\/span><\/a> <!----><\/span><\/span> Foundation","content":"ORGANIZATION"},{"type":"Coq Inu","content":"ORGANIZATION"},{"type":"Gecko","content":"ORGANIZATION"},{"type":"Tech","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["AVALANCHE"],"authors":["Vishal Chawla","The Block"]}