{"summary":"BlockFi CEO Zac Prince cashed out nearly $10 million from the platform last year to pay taxes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200282\/blockfi-said-ceo-cashed-out-nearly-10-million-as-ftx-loan-stabilized-clients","publishDate":"2023-01-09T17:26:14","id":11076,"type":null,"title":"Correction: BlockFi said CEO cashed out nearly $10 million to pay taxes","category":["BANKRUPTCY"],"content":["<span data-v-f87c67ca=\"\">Bankrupt crypto lender BlockFi said its CEO cashed out close to $10 million from the platform to pay taxes last year, the company said in a presentation outlining the progress, schedules and proposed agenda of its ongoing bankruptcy case.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Zac Prince withdrew around $9.2 million from BlockFi in April 2022, according to the <a href=\"https:\/\/twitter.com\/BlockFi\/status\/1612485889485336577?s=20&amp;t=b0_Wgj4do2kqDs3tjzWf9w\" data-v-f87c67ca=\"\">presentation<\/a>. He then <\/span>withdrew an additional $1.36 million at then-market prices in August. He used the funds to pay taxes, the company said.","<span data-v-f87c67ca=\"\">In June, after sector-wide contagion caused material withdrawals from platforms across the industry, FTX provided a $400 million loan to BlockFi so the company would be able “to process billions of dollars in clients’ requested withdrawals and other transactions between June and November 2022.\"<\/span>","BlockFi is one of several companies that took loans out from FTX, which itself filed for bankruptcy in November.","<span data-v-f87c67ca=\"\">By the company’s own disclosure, its management team “deployed their personal assets on the platform, to trade, earn interest, and store different cryptocurrencies under the same terms of service as clients,” thus transmitting to them client benefits from the FTX bailout.<\/span>","“Like many BlockFi clients, Zac deployed his own personal assets on BlockFi’s platform. Zac kept a substantial portion of his assets on the platform, and the withdrawal he made in April 2022 was to pay U.S. federal and state taxes,\" BlockFi told The Block in an emailed statement. \"Zac and other insiders did not make any withdrawals since October 14, 2022, and no withdrawals of [greater than] 0.2 BTC in value since August 17th.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\">BlockFi also highlighted a $15 million settlement payment, funded by FTX, to a counterparty that threatened litigation.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Due to the structure of the settlement, certain payments from BlockFi were routed through the executives and ultimately made to the counterparty,” according BlockFi.<\/span>","<em data-v-f87c67ca=\"\">Correction: Updates story throughout to remove reference to FTX loan's connection to Prince's withdrawals.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 17th","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"April 2022","content":"DATE"},{"type":"$1.36 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Zac","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"November 2022","content":"DATE"},{"type":"October 14, 2022","content":"DATE"},{"type":"$9.2 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Jeremy Nation","The Block"]}