{"summary":"The deal follows a report from The Block in November that former partner and digital assets head Joe Naggar was set to leave GoldenTree.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286056\/steven-tananbaum-goldentree-sells-crypto-unit-republic-joe-naggar","publishDate":"2024-04-02T09:26:40","id":11071,"type":null,"title":"Steven Tananbaum’s GoldenTree Asset Management sells crypto unit to investment firm Republic","category":["MERGERS & ACQUISITIONS"],"content":["Global asset manager GoldenTree has sold its digital asset unit to investment firm Republic, with former partner Joe Naggar set to join the company.","Republic <a href=\"https:\/\/www.businesswire.com\/news\/home\/20240403341560\/en\/Republic-Announces-Acquisition-of-GoldenChain-the-Digital-Asset-Arm-of-GoldenTree-Asset-Management\" data-v-f87c67ca=\"\">announced<\/a> the acquisition of GoldenChain on Tuesday, a wholly owned subsidiary of GoldenTree, which managed the firm’s digital asset funds. Nagger will become CEO and CIO of the newly formed digital asset-focused entity Republic Digital.&nbsp;","Republic said the deal was designed to bolster its market position. It will leverage the combined expertise to explore new opportunities in the digital asset space.","“We are excited to welcome GoldenChain into the Republic family,” Republic President Andrew Durgee said in a statement. “We are confident that the combined strengths of Republic and GoldenChain will create compelling opportunities for our investors.”","The deal follows news, <a href=\"https:\/\/www.theblock.co\/post\/264200\/goldentree-partner-who-led-crypto-push-set-to-leave-firm\" data-v-f87c67ca=\"\">reported<\/a> by The Block exclusively in November, that Naggar was set to leave GoldenTree. Naggar was formerly Head of Digital Assets at GoldenChain and a previous Managing Director at Morgan Stanley with over 25 years of investing experience.","“We are grateful for Joe’s invaluable contributions to GoldenTree over the years and we look forward to him leading this new chapter for Republic Digital,” GoldenTree Founder, Managing Partner and Chief Investment Officer Steve Tananbaum said.","Naggar <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2024-04-02\/tananbaum-s-goldentree-sells-crypto-subsidiary-to-republic\" data-v-f87c67ca=\"\">told<\/a> Bloomberg that the acquisition was completed last week. “The acquisition is not changing the fund at all, it’s actually just changing the ownership,” he added.","GoldenTree made the decision in September 2023, citing that the crypto fund was not a “great fit” for an asset manager focused on credit and distressed markets, especially given the “regulatory and reputational issues” associated with the crypto industry, Naggar told Bloomberg.","“GoldenTree has been a great partner throughout the process, but decided that it wasn’t appropriate,” Naggar said. “We decided that we would spin the business out in some way shape or form.” GoldenChain was managing between $120 million and $150 million in assets at the time, Naggar added.","The deal amounts to an exit from the crypto industry for GoldenTree, which will no longer control any crypto entities, only invest in them, a source familiar with the matter told The Block.","Post-acquisition, GoldenTree will remain an investor in GoldenChain, which is now Republic Digital. “We intend to remain investors in GoldenChain and believe transitioning GoldenChain to Republic puts the digital assets business in the best position for growth,” Tananbaum said.","Bloomberg reported that six more GoldenChain employees are set to join Republic. <a href=\"https:\/\/www.theblock.co\/linked\/136765\/goldentree-hires-blocktowers-avi-felman-as-head-of-digital-asset-trading\" data-v-f87c67ca=\"\">Avi Felman<\/a>, Head of Digital Assets Trading at GoldenTree, has left GoldenChain but is not among those joining Republic.","The companies told The Block they could not disclose the terms of the deal, citing confidentiality.","<em data-v-f87c67ca=\"\">Updated with confirmation on GoldenTree's exit from the crypto industry following the deal.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tananbaum","content":"PERSON"},{"type":"Head of Digital Assets Trading","content":"ORGANIZATION"},{"type":"GoldenChain","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Republic","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Naggar","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Steve Tananbaum","content":"PERSON"},{"type":"GoldenChain","content":"ORGANIZATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Avi Felman","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Andrew Durgee","content":"PERSON"},{"type":"” Naggar","content":"ORGANIZATION"},{"type":"Naggar","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Joe Naggar","content":"PERSON"},{"type":"Republic Digital","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"Head of Digital Assets","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"$150 million","content":"MONEY"}],"hashtag":["INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}