{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/5204\/crypto-caselaw-minute-week-of-12-09-18-the-sec-wont-ignore-your-pyramid-schemes-and-scams-just-because-you-use-a-blockchain","publishDate":"2018-12-14T11:30:51","id":11079,"type":null,"title":"The 2011-12 BTCST ponzi scheme: a landmark legal ruling that Bitcoin could be used as money","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" data-v-f87c67ca=\"\">@NelsonMRosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Their analysis,&nbsp;Crypto Caselaw Minute, is below.<\/em>","This week’s CCM takes a look at where it all began with the SEC, a bank, but decentralized, and ends with a new case on token sales and the Securities Act. (As always, Rosario summaries are “NMR” and Palley summaries are “SDP”.)","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter: <a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Securities and Exchange Commission v. Trendon T. Shavers and Bitcoin Savings and Trust (ED. Tex. № 4:13-CV-416, 8\/6\/2013) [NMR]<\/strong><\/em>","Link to Memorandum Opinion: <a href=\"https:\/\/law.justia.com\/cases\/federal\/district-courts\/texas\/txedce\/4:2013cv00416\/146063\/23\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">SEC vs. Shavers<\/a>","Let’s take a trip down memory lane to the case that got the SEC involved in all this cryptomania, and probably the most cited case in crypto: SEC v. Shavers. From February 2011 to August 2012 Trendon Shavers ran an online entity called the Bitcoin Savings and Trust (“BTCST) that he advertised on forums as a great investment opportunity guaranteeing up to 7% returns weekly to investors. 7% weekly. Guaranteed. As any CCM reader knows “guaranteed returns,” is a big red flag. Shavers claimed the returns were based on his trading prowess, and the whole endeavor was virtually risk free. As Palley is fond of saying, you can never eliminate risk, but you can shift it.","Unfortunately, the returns did not materialize and Shavers was in fact using the bitcoin invested from later stage investors to pay off earlier stage investors. This is, of course, a traditional Ponzi scheme. What is most interesting about this case is an argument that Shavers made in his defense, but before that is discussed it is worth mentioning just how many bitcoin Shavers received from his investors. Over the course of nineteen months Shavers received at least 700,467 bitcoin. To put that in perspective, at the time his scheme ended there were approximately 10 million bitcoin in existence. Shavers was busy.","At the beginning of his case Shavers made the argument that the court did not have subject matter jurisdiction to hear his case. The SEC brought the case against Shavers alleging that he had defrauded his investors and run afoul of the securities laws of the United States. Generally speaking, for any court to decide a dispute, ie hear a case, that court must have subject matter jurisdiction (the court has the power to hear that type of case) and personal jurisdiction (power over the defendant). In arguing that there was no subject matter jurisdiction, Shavers claimed “that the BTCST investments are not securities because Bitcoin is not money, and is not part of anything regulated by the United States.” Shavers took the next logical step and extended the argument to say “that his transactions were all Bitcoin transactions and that no money ever exchanged.” The court did not buy either of these arguments.","The court said, and it is worth reading in its entirety, that:","<em data-v-f87c67ca=\"\">First, the Court must determine whether the BTCST investments constitute an investment of money. <strong data-v-f87c67ca=\"\">It is clear that Bitcoin can be used as money. It can be used to purchase goods or services, and as Shavers stated, used to pay for individual living expenses. The only limitation of Bitcoin is that it is limited to those places that accept it as currency.<\/strong> However, it can also be exchanged for conventional currencies, such as the U.S. dollar, Euro, Yen, and Yuan. Therefore, Bitcoin is a currency or form of money, and investors wishing to invest in BTCST provided an investment of money. (emphasis added)<\/em>","Money is a funny thing, and looking back on human history shows that lots of things have been used as money. Here, Shavers’s own words “used to pay for individual living expenses,” factored into the court’s analysis as to whether bitcoin is money. Consequently, the court found that subject matter jurisdiction was proper, and the rest is history.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Securities and Exchange Commission v. AriseBank, Jared Rice Sr., and Stanley Ford (N.D. Tex., № 3:18-CV-00186, 12\/11\/2018) [NMR]<\/strong><\/em>","Link to Final Judgment: <a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2018\/finaljudgment-pr2018-280.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">SEC<\/a>","An interesting phenomenon in the blockchain and cryptocurrency world is the tendency of entrepreneurs to essentially reinvent, or rediscover, traditional financial institutions and services. What’s interesting about that is they try to do it with a technology that was largely invented in revolt against those institutions and services, but I digress.","Jared Rice and Stanley Ford were officers in a “decentralized bank” called AriseBank. Naturally, Rice and Ford launched an ICO that would let investors purchase a cryptocurrency for use at their new decentralized bank. To promote the ICO Rice and Ford made some, umm, bold claims. They claimed that they were purchasing an FDIC insured bank and were going to offer an AriseBank branded Visa card to purchase hundreds of cryptocurrencies. It appears that none of these things ever happened, and this tale is very similar to other ICO scams we have covered, but the purpose of this post is to look at what sorts of consequences result from actions like these.","The SEC and the defendants agreed to enter a final judgment in this case, which is linked to above. The judgment stipulates that the defendants neither admit nor deny the allegations brought against them, they waive findings of fact and conclusions of law, and also waived their right to appeal. So, what consequences do Rice and Ford face? Well, quite a lot actually.","As part of the final Judgment Rice and Ford agreed to they are permanently barred from taking part in any securities offerings, serving as officers or directors in any companies that offer securities registered with the SEC, or any companies that have to file certain reports with the SEC, and additionally, Rice and Ford may not participate in any “issuance, offer, or sale of any digital security; provided, however, that such injunction shall not prevent him from purchasing or selling digital securities for his own accounts.” (emphasis added). Oh, and Rice and Ford are also “jointly and severally liable for disgorgement of $2,259,543.83, representing profits gained as a result of the conduct alleged in the Complaint, together with prejudgment interest thereon in the amount of $68,423.32, and individually liable for a civil penalty in the amount of $184,767.00 each.”","Put another way, Rice and Ford can’t really be involved in managing public companies anymore, can’t be involved in offering digital securities, and they owe a lot of money, but they can still trade crypto for personal gain. A common theme on this blog, and really in many cases that you read in the law, is that lying is bad. Eventually, someone has to pay the piper.","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Solis v. Latium Network, 2018 U.S. Dist. LEXIS 207781 (D.N.J., 10–10255, 12\/10\/2018) [SDP]<\/em><\/strong>","This case involves a token sale, a securities class action and a Howey test. While I don’t like to make predictions about the future, my crystal ball says it’s the first of several dozen we will see in the next couple of years. In short, this Court says that a plaintiff adequately pleaded that a token was an unregistered security for purposes of a putative (that word again) class action and will allow the case to go forward.","Before getting into the merits, how ‘bout a little bit of federal court civil procedure? If you file a case in federal court you have to state a legal cause of action. If you sue someone under the theory that they made french toast with cumin and you don’t like cumin, that probably won’t suffice. Or if you allege securities fraud but you don’t describe the elements of a security in your lawsuit, that won’t either. In a motion to dismiss the court ASSUMES that the (well pleaded) facts are true. What matters is if on the face of the complaint you described actionable conduct. It’s not a terribly high bar but it’s one that a plaintiff has to jump over. Not all do. This one did.","OK, enough civ pro — let’s get to the alleged merits and the court’s analysis. According to the Court’s opinion, this lawsuit involves Latium, a corporation that operates something called a “blockchain based tasking platform.” Latium did a long ICO between July 2017 and March 2018 and sold LATX tokens in exchange for Ether and dollars. The plaintiff bought $25,000 of LATX tokens on January 12, 2018 and 6 months later filed a (putative) class action alleging that the ICO violated the Securities Act of 1933 because the tokens were allegedly unregistered securities.","Per the Court, Plaintiff alleged that the LATX tokens are investment contracts and should have been registered as securities and weren’t. The Court applied the Howey test as follows:","Count II of the Complaint alleged control person liability against co-founders and c-suite officers. Per the Court, “considering their positions and public statements during Latium’s ICO” enough facts were pleaded to keep them in the lawsuit and deny the Motion to Dismiss Count II. (D and O insurance might come in hand here, if they bothered to get it.)","In short, this case will continue. Whether or not a class is certified or Plaintiffs can overcome a summary judgment motion (a motion where evidence can be considered) remains to be seen. This case is at an early stage and while it lays out a roadmap for how to allege a securities act violation and make it past a 12(b) motion to dismiss in Federal Court it is not a final resolution.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Savings and Trust","content":"ORGANIZATION"},{"type":"the Court","content":"ORGANIZATION"},{"type":"Latium Network","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Stanley Ford","content":"ORGANIZATION"},{"type":"SEC v. Shavers","content":"ORGANIZATION"},{"type":"$68,423.32","content":"MONEY"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$184,767.00","content":"MONEY"},{"type":"March 2018","content":"DATE"},{"type":"$25,000","content":"MONEY"},{"type":"July 2017","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"7%","content":"PERCENT"},{"type":"Court","content":"ORGANIZATION"},{"type":"$2,259,543.83","content":"MONEY"},{"type":"August 2012","content":"DATE"},{"type":"Jared Rice","content":"PERSON"},{"type":"2018 U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"1933","content":"DATE"},{"type":"February 2011","content":"DATE"},{"type":"Jared Rice Sr.","content":"PERSON"},{"type":"Judgment Rice","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"AriseBank branded Visa","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Stanley Ford (N.D. Tex.","content":"ORGANIZATION"},{"type":"Federal Court","content":"ORGANIZATION"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Rice","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Rosario","content":"PERSON"},{"type":"Trendon Shavers","content":"ORGANIZATION"},{"type":"]Securities and Exchange Commission v. Trendon T. Shavers","content":"ORGANIZATION"},{"type":"January 12, 2018","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Shavers","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Ford","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Bitcoin Savings and Trust (ED","content":"ORGANIZATION"},{"type":"ICO Rice","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Exchange Commission v. AriseBank","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Latium","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["SEC"],"authors":["Contributor Network","The Block"]}