{"summary":"Elon Musk has reiterated his support for the cryptocurrency Dogecoin in an interview at the Qatar Economic Forum today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153194\/elon-musk-supports-dogecoin-despite-market-turmoil","publishDate":"2022-06-21T05:43:02","id":11073,"type":null,"title":"Elon Musk doubles down on support for dogecoin despite market turmoil","category":["CRYPTOCURRENCY"],"content":["Elon Musk has reiterated his support for dogecoin in an interview at the Qatar Economic Forum today in Doha despite continued weakness in cryptocurrency markets.&nbsp;","Speaking to Bloomberg in Doha today, the world's richest person <a href=\"https:\/\/www.bloomberg.com\/news\/videos\/2022-06-21\/tesla-ceo-musk-at-qatar-economic-forum-full-interview\" data-v-f87c67ca=\"\">said<\/a> that while he never encouraged people to invest in crypto, he personally supports the dog-themed coin.&nbsp;","\"I intend to personally support dogecoin,\" he said. \"I know a lot of people who are not that wealthy have encouraged me to buy and support dogecoin so I'm responding to those people.\"&nbsp;","The CEO of both Tesla and SpaceX noted that the car company will accept dogecoin as a form of payment for merchandise, with SpaceX following suit soon. Musk also said that the two companies have bought bitcoin, but only using a small percentage of cash assets.&nbsp;","This follows previous Twitter statements where the billionaire has <a href=\"https:\/\/www.theblock.co\/post\/152951\/musk-tweets-that-he-will-keep-supporting-dogecoin-in-spite-of-lawsuit\" data-v-f87c67ca=\"\">shown support<\/a> for the meme coin despite his actions <a href=\"https:\/\/www.theblock.co\/post\/152538\/tesla-ceo-elon-musk-accused-of-dogecoin-ponzi-scheme-in-new-class-action-lawsuit\" data-v-f87c67ca=\"\">attracting a lawsuit<\/a>.&nbsp;","Musk has previously shown himself to be a proponent of cryptocurrencies. Earlier this month,&nbsp;<a href=\"https:\/\/www.theblock.co\/linked\/152620\/elon-musk-floats-crypto-payments-during-meeting-with-twitter-employees\" data-v-f87c67ca=\"\">the billionaire advocated<\/a> for integrating payments into Twitter more broadly, including support for cryptocurrencies. He has <a href=\"https:\/\/twitter.com\/elonmusk\/status\/1396049547680391168?s=21&amp;t=JOLc0P4cSC429CeVbdgx5g\" data-v-f87c67ca=\"\">also tweeted<\/a> his support for cryptocurrencies over fiat currencies.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"Qatar Economic Forum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Doha","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["DOGECOIN","ELON MUSK","MEMECOINS","TWITTER"],"authors":["Tom Matsuda","The Block"]}