{"summary":"Ethereum is seeing a surge in staking activity as annual rewards currently hover around $1.8 billion, according to a new report from Staked.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230508\/ethereum-staking-rate-rising","publishDate":"2023-05-11T16:49:58","id":1108,"type":null,"title":"Ethereum staking rate could double over next 18 months to 35%","category":["COMPANIES"],"content":["Ethereum is seeing a surge in staking activity following the <a href=\"https:\/\/www.theblock.co\/post\/226792\/staked-ether-deposits-surpass-withdrawals-shapella\" data-v-f87c67ca=\"\">Shapella upgrade<\/a> that enabled validator withdrawals for the first time.","Thanks to that surge, the rate of staked ETH could double over the next 18 months, <a href=\"https:\/\/staking.staked.us\/state-of-staking\" data-v-f87c67ca=\"\">according to a new report<\/a>.","Total ETH deposits during the week ending May 2 were four times higher than the amount added in the week before the Shapella upgrade last month. That data comes from a report by Staked, a non-custodial staking service provider and a subsidiary of crypto exchange Kraken.&nbsp;","\"Based on this increase in staking demand, we expect the ETH stake rate to increase from ~15% today, to the 20-35% range in the next 12-18 months, Staked said, noting that average daily deposits are currently 6.5 times higher than in April.","The company said 750,000 ETH had been staked in the six days following the Shapella upgrade. That's more than the 600,000 ETH staked in the entire month of March.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/cumulative-eth-deposited-to-beacon-chain-and-validators\/embed\" title=\"Cumulative ETH Deposited to Beacon Chain and Validators\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Staking, which <a href=\"https:\/\/ethereum.org\/en\/staking\/#why-stake-your-eth\" data-v-f87c67ca=\"\">Ethereum has described as a public good<\/a>, refers to the depositing of 32 ETH — currently worth about $57,000 — to activate the validation software the network uses as part of its security model. I","Staking has been integral to Ethereum since the protocol was switched to a proof-of-stake-consensus mechanism last year in an event called The Merge.","After making the deposit, validators earn rewards for performing actions that help the network achieve consensus. The Block <a href=\"https:\/\/www.theblock.co\/post\/230000\/ethereums-staking-rewards-rate-hits-post-merge-record-high-fueled-by-memecoin-frenzy\" data-v-f87c67ca=\"\">reported earlier this week<\/a> that Ethereum's staking rewards rate — a metric validators use to predict annual returns — hit a post-Merge record of 8.6%.","Ethereum currently generates about $1.8 billion in annual staking rewards, Staked said in the report.","Concerns about an \"un-staking spiral\" after the Shapella upgrade seem to have been dispelled, with the so-called \"exit queue\" falling to only about three hours after reaching a high of 10 or more days. Withdrawals of staked ETH can take longer if the demand to un-stake is high.&nbsp;","As of May 2, a total of 1.97 million ETH has been un-staked, while a total of 1.65 million ETH was been staked for a net decline of just 320,000 ETH.","\"As a result of the recent settlement with the SEC, Kraken was responsible for a majority of the early un-staking activity,\" the report stated. \"Coinbase and Binance have been responsible for most of the more recent un-staking activity.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1.97 million","content":"MONEY"},{"type":"May 2","content":"DATE"},{"type":"$57,000","content":"MONEY"},{"type":"8.6%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kraken","content":"PERSON"},{"type":"18 months","content":"DATE"},{"type":"March","content":"DATE"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}