{"summary":"From Jan. 29, advertisers certified by Google may promote such trusts targeting the United States where they meet its requirements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267006\/google-crypto-ads-spot-bitcoin-etf","publishDate":"2023-12-11T09:51:38","id":11086,"type":null,"title":"Google updates crypto ads policy amid January spot bitcoin ETF anticipation","category":["COMPANIES"],"content":["Google is revising its crypto ads policy to include the advertising of “Cryptocurrency Coin Trusts” targeting the United States. The recent <a href=\"https:\/\/support.google.com\/adspolicy\/answer\/14293829?hl=en\" data-v-f87c67ca=\"\">update<\/a>, due to be enacted on Jan. 29, will enable Google-certified advertisers to promote such products, provided they meet the tech giant’s requirements.","Google’s non-exhaustive example of these trusts includes “financial products that allow investors to trade shares in trusts holding large pools of digital currency,” according to the update.","\"This change will allow crypto coin trusts to serve ads targeting the U.S. provided they complete our certification process and have voluntarily registered with the SEC by filing Form 10-12g,\" Google told The Block.","The policy will apply globally to all Google accounts, and advertisers must continue to comply with local laws wherever these products are targeted, the company stated in the update. “Violations of this policy will not lead to immediate account suspension without prior warning,” it added. “A warning will be issued, at least seven days, before any suspension of your account.”","Google's crypto policies have regularly been updated over time. In September, Google enabled advertisers to <a href=\"https:\/\/www.theblock.co\/post\/249553\/google-advertising-unit-permits-promotion-of-nft-games-if-gamble-free\" data-v-f87c67ca=\"\">promote NFT games<\/a> using its services as long as they do not advertise gambling-related content. In April, Google allowed the promotion of <a href=\"https:\/\/support.google.com\/adspolicy\/answer\/13311696\" data-v-f87c67ca=\"\">hardware wallets<\/a> designed to hold the private keys of crypto assets but that didn't offer other services such as purchasing, selling, exchanging or trading. In June 2021, Google's rules were updated to allow crypto <a href=\"https:\/\/support.google.com\/adspolicy\/answer\/10688110?hl=en\" data-v-f87c67ca=\"\">software wallet<\/a> promotions targeting the U.S. in addition to crypto exchanges.","\"We continue to prohibit ads promoting the purchase, sale or trade of cryptocurrency products such as unregulated dApps, initial coin offerings and DeFi trading protocols,\" Google added.","Google’s crypto policy update is due to be enacted in the same month many anticipate the approval of spot bitcoin exchange-traded funds in the U.S. While the policy is expanding to include “Cryptocurrency Coin Trusts,” Google said cryptocurrency ETFs and ETNs can already advertise on its platform in the U.S., provided they comply with local legal requirements.","The next deadlines for the Security and Exchange Commission’s decision to approve, reject or delay applications from firms including BlackRock, Bitwise, WisdomTree, Invesco, Fidelity, Valkyrie and VanEck are expected to fall in mid-January.&nbsp;","The SEC is also currently reviewing Grayscale’s Bitcoin Trust (GBTC) product after the U.S. Court of Appeals for the D.C. Circuit <a href=\"https:\/\/www.theblock.co\/post\/258767\/us-court-confirms-grayscale-ruling-says-sec-must-re-review-bid-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\">issued<\/a> a formal mandate in October for the regulator to reconsider Grayscale’s <a href=\"https:\/\/www.theblock.co\/post\/258767\/us-court-confirms-grayscale-ruling-says-sec-must-re-review-bid-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\">bid<\/a> to convert its flagship GBTC fund into a spot bitcoin ETF.","Bloomberg analyst James Seyffart recently <a href=\"https:\/\/x.com\/JSeyff\/status\/1730327792066195501?s=20\" data-v-f87c67ca=\"\">said<\/a> the window for potential spot bitcoin ETF approval was looking like it would fall between Jan. 5 and Jan. 10.","<em data-v-f87c67ca=\"\">Updated with comments from Google and additional details throughout.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Jan. 10","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"Jan. 29","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Jan. 5","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Google’s crypto","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"mid-January","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"D.C. Circuit","content":"ORGANIZATION"},{"type":"June 2021","content":"DATE"},{"type":"James Seyffart","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"U.S. Court of Appeals","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Security and Exchange Commission","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["GOOGLE","INTERNET"],"authors":["James Hunt","The Block"]}