{"summary":"Decentralized finance (DeFi) protocol Gamma Strategies suffered an exploit resulting in the loss of around $3.4 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270338\/defi-protocol-gamma-strategies-suffers-an-estimated-3-4-million-exploit","publishDate":"2024-01-04T06:12:23","id":11088,"type":null,"title":"DeFi protocol Gamma Strategies suffers an estimated $3.4 million exploit","category":["DEFI"],"content":["Decentralized finance (DeFi) protocol Gamma Strategies suffered an exploit resulting in the loss of around $3.4 million, according to security analysts.","The protocol has taken immediate action to prevent further losses. The team has disabled deposits to all public DeFi vaults while ensuring that withdrawals remain active for users needing to access their funds.","\"Our vaults will continue to be managed normally for now, but deposits are currently shut down until we identify and mitigate the problem,\" the team <a href=\"https:\/\/twitter.com\/GammaStrategies\/status\/1742839968240980408\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","Security firms PeckShield and BlockSec both told The Block the incident resulted in estimated losses of $3.4 million, with the hacker taking over 1500 ether. BlockSec’s analysis points to a critical vulnerability in the protocol's \"accounting mechanism.\"","The attacker manipulated the prices of specific liquid staking tokens and stablecoin vaults, enabling the creation of an excessive amount of LP tokens.","“The root cause stems from the inconsistency between the accounting mechanisms for depositing and withdrawing used by Gamma Strategies, which results in a discrepancy between the liquidity and the shares,” BlockSec founder Yajin Zhou told The Block. “Exploiting this, the attacker could withdraw an excessive amount of tokens.”","Gamma Strategies is a decentralized asset management protocol built on Ethereum and other blockchains. It allows users to deposit funds into pools called “hypervisors” and earn a return on their investment through active liquidity management and market-making strategies.","Gamma Strategies did not immediately respond to a request for comment.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"LP","content":"ORGANIZATION"},{"type":"$3.4 million","content":"MONEY"},{"type":"Yajin Zhou","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gamma Strategies","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}