{"summary":"An indirectly held subsidiary of BIT Mining was among the 26 mining firms ordered by the Sichuan government to shut down last week\nRebranded from 500.com, BIT Mining is on track to ship 2,600 more bitcoin miners to Kazakhstan by the end of this month","author":["Wolfie Zhao","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109190\/bit-mining-bitcoin-miners-kazakhstan","publishDate":"2021-06-22T03:52:50","id":1108,"type":null,"title":"Shenzhen-based BIT Mining has already sent bitcoin miners to Kazakhstan","category":["Mining"],"content":["BIT Mining, formerly known as 500.com, a Shenzhen-based online sports lottery firm that pivoted into bitcoin mining last year, has already shipped some of its equipment to Kazakhstan.","The New York Stock Exchange-listed mining firm said in an <a href=\"https:\/\/ir.btc.com\/2021-06-21-BIT-Mining-Successfully-Delivers-Mining-Machines-to-Kazakhstan\" data-v-f87c67ca=\"\">announcement<\/a> on Monday that it had delivered its first batch of mining equipment to the Central Asia country. The first batch that was already shipped had 320 bitcoin mining machines with a total computing power of 18.2 petahashes per second and is expected to be operational by June 27, BIT Mining said. It is shipping two more batches with a total of 2,600 bitcoin miners by July 1 to the same facility.","The move follows a government order last week from China's hydro-hub Sichuan to shut down 26 bitcoin mining facilities as an initial target, which included a subsidiary of BIT Mining. It is one example of the swift response that many Chinese bitcoin miners are taking in reaction to the recent orders given in <a href=\"https:\/\/www.theblockcrypto.com\/post\/107707\/xinjiang-bitcoin-miner-shut-crackdown-china\" data-v-f87c67ca=\"\">Xinjiang<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/108916\/sichuan-orders-state-power-grid-to-cut-supply-for-26-bitcoin-mining-farms\" data-v-f87c67ca=\"\">Sichuan<\/a>.","BIT Mining said in the announcement that its indirectly held subsidiary, Ganzi Changhe Hydropower Consumption Service Co, received a notice from State Grid Sichuan Ganzi Electric Power Co. on Saturday, which informed the firm that its power supply would be suspended \"effective 9:00 pm Beijing time, June 19.\"","\"Ganzi Changhe Data Center has since suspended its operations. Data centers in Sichuan, including the Ganzi Changhe Data Center, contributed approximately 3% of the Company's total revenues in the month of May 2021,\" BIT Mining added in the announcement.","Ganzi is one of the three mountainous prefectures in the west side of the Sichuan province close to Tibet that had been known for housing bitcoin mining farms due to their abundant hydroelectricity resources.","Indeed, BIT Mining's Ganzi Changhe data center was among the 26 bitcoin mining facilities on the Sichuan government's shutdown order issued last Thursday. As The Block reported, a majority of the entities on the list were previously granted by the local government to operate mining facilities legally in Sichuan's <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86520\/china-sichuan-hydropower-consumption-parks-bitcoin-mining\" data-v-f87c67ca=\"\">Hydroelectricity Consumption Industrial Demonstration Zones<\/a>.","Another firm on the list that also stood out is called Shutian Information Technology, which is wholly and directly owned by the <a href=\"https:\/\/en.wikipedia.org\/wiki\/State-owned_Assets_Supervision_and_Administration_Commission\" data-v-f87c67ca=\"\">Chinese State‑owned Assets Supervision and Administration<\/a>. That meant the Chinese state-owned capital fully funded and supported the development of the Shutian mining facility.","BIT Mining itself is also indirectly backed by some state-owned capital, as The Block <a href=\"https:\/\/www.theblockcrypto.com\/daily\/96817\/chinese-state-owned-capital-500-bitcoin-mining\" data-v-f87c67ca=\"\">explained<\/a> last year when the firm formally revealed its pivot that had been in the works since early 2019.","Last month, days after the Chinese central government State Council released a meeting comment about <a href=\"https:\/\/www.theblockcrypto.com\/post\/105814\/china-bitcoin-miners-brace-regulatory-uncertainty\" data-v-f87c67ca=\"\">cracking down<\/a> on bitcoin trading and mining activities, BIT Mining already announced it's investing in mining facilities in the U.S. Texas state and also Kazakhstan through joint ventures with local partners."],"hashtag":[]}