{"summary":"The &#x27;FTX drainer&#x27; wallet has moved over $200 million in ETH to 12 different wallets, and some analysts expect them to start selling.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188825\/ftx-drainer-moves-200-million-in-ether-some-analysts-expect-selling-to-start","publishDate":"2022-11-21T14:15:58","id":11085,"type":null,"title":"&#x27;FTX drainer&#x27; moves $200 million in ether, some analysts expect selling to start","category":["EXCHANGES"],"content":["The so-called \"FTX Drainer,\" the individual or entity behind suspicious withdrawals from embattled crypto exchange FTX, has transferred approximately $200 million worth of ether (ETH) to 12 different crypto wallets.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe moves came shortly after the entity transferred $72 million to Bitcoin from Ethereum <a href=\"https:\/\/www.theblock.co\/post\/188710\/ftx-drainer-swaps-another-20000-ether-for-bitcoin\" data-v-f87c67ca=\"\">this morning<\/a> and followed similar actions that began on Sunday when it exchanged 50,000 ether for renBTC.","The ETH transfers began around 11 a.m. EST. In the span of six minutes, the wallet made <a href=\"https:\/\/etherscan.io\/txs?a=0x59abf3837fa962d6853b4cc0a19513aa031fd32b\" data-v-f87c67ca=\"\">12 transactions<\/a>, each sending 15,000 ether to different crypto wallet addresses. None of the 12 new wallet addresses have yet done anything with the funds.","The previously mentioned transfers of ether for renBTC have put negative sell pressure on ether, with the price on Sunday dropping almost 5%. Avi Feldman, head of digital asset trading at GoldenTree Asset Management, <a href=\"https:\/\/twitter.com\/AviFelman\/status\/1594727475896090629\" data-v-f87c67ca=\"\">tweeted<\/a> the movement could signify that “he is getting ready to sell.”","The entity, however, may not be able to sell the ether it has moved to the 12 wallets, The Block VP of Research Larry Cermak said, noting that there is almost no liquidity left to swap ether for renBTC and that such a transaction would incur slippage of around 70%.","Additionally, the bridge used to send renBTC to the Bitcoin network has been disabled. Swapping into stablecoins on Ethereum isn't a valid option, either, as they would be frozen by legal authorities immediately.","The \"FTX drainer\" wallet has slowly dropped in the rankings of top ether holders. It originally was in the top 30, but fell to 36th place after the <a href=\"https:\/\/www.theblock.co\/post\/188710\/ftx-drainer-swaps-another-20000-ether-for-bitcoin\" data-v-f87c67ca=\"\">selling this morning.<\/a> The identity of the wallet holder is unknown.&nbsp;","<em data-v-f87c67ca=\"\">(Updates with comment from The Block VP of Research Larry Cermak in 5th paragraph.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"this morning","content":"TIME"},{"type":"70%","content":"PERCENT"},{"type":"$72 million","content":"MONEY"},{"type":"11 a.m. EST","content":"TIME"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"The Block VP of Research Larry Cermak","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Avi Feldman","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"GoldenTree Asset Management","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}