{"summary":"Tribe DAO is moving to close its doors and has outlined a multi-million dollar redemption plan that will distribute assets to holders and hack victims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164611\/tribe-dao-proposes-a-157-million-redemption-for-token-holders-rari-hack-victims","publishDate":"2022-08-19T18:48:16","id":11098,"type":null,"title":"Tribe DAO proposes a $157 million redemption for token holders, Rari hack victims","category":["DEFI"],"content":["Tribe DAO is moving to close its doors and has outlined a multi-million dollar redemption plan that will see it distribute crypto assets to token holders as well as those impacted by the $80 million Rari hack earlier this year.","Tribe DAO — which acquired Rari in the largest DeFi merger of all time last year — proposed a roughly $157 million redemption plan to distribute remaining DAO-controlled assets to TRIBE holders and compensate victims of <a href=\"https:\/\/www.theblock.co\/linked\/144511\/hackers-steal-80-million-from-rari-capitals-lending-pools\" data-v-f87c67ca=\"\">the Rari hack that occurred in April.<\/a> Any approval would need to come during a future DAO vote by token holders.","On April 30, Rari Capital, a protocol that allowed users to create custom borrowing and lending markets for various assets, saw seven of its so-called fuse pools drained for approximately $80 million.","<a href=\"https:\/\/tribe.fei.money\/t\/tip-121-proposal-for-the-future-of-the-tribe-dao\/4475\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The redemption proposal<\/a> would compensate hack victims from this incident with the teams’ 88.9 million unvested TRIBE tokens, which would distribute approximately $16 million dollars to victims.","The vesting period for the team's tokens ends on July 1.","For TRIBE holders, the DAO-controlled assets total approximately $141 million and would be distributed in proportional allocations.","The motivation behind this move by Tribe DAO is a mixture of the current global macro environment, the Rari hack, and future regulatory risks, per the proposal.","“Any of the mounting technical, financial, and future regulatory risks could cause the project to be far worse off than it is now,” the proposal stated.&nbsp;","The proposal is comprised of three components: consolidation (of DAO assets), fuse hack victim payment, and final redemption. Each component will have its own independent snapshot. “The purpose of the snapshots is to determine which parts of the proposal to include in the on-chain vote(s), and whether to adjust or change any pieces.” the proposer Fei Labs stated.","The first snapshot will be for the consolidation component and occur the week of August 22.","The proposal stated it could take one to two months after the snapshot before any developments are put up to an on-chain vote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Rari Capital","content":"ORGANIZATION"},{"type":"Rari","content":"ORGANIZATION"},{"type":"August 22","content":"DATE"},{"type":"April 30","content":"DATE"},{"type":"$16 million dollars","content":"MONEY"},{"type":"$141 million","content":"MONEY"},{"type":"$157 million","content":"MONEY"},{"type":"Tribe DAO","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Fei Labs","content":"ORGANIZATION"},{"type":"July 1","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}