{"summary":"BlackRock Managing Director Tony Ashraf explained the company is seeing three key areas that are driving demand from its clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283350\/blackrock-managing-director-says-spot-bitcoin-etfs-are-satisfying-pent-up-demand","publishDate":"2024-03-19T09:19:28","id":11092,"type":null,"title":"BlackRock Managing Director says spot bitcoin ETFs are satisfying &#x27;pent-up demand&#x27;","category":["MARKETS"],"content":["Spot bitcoin ETFs are helping to meet demand for bitcoin, which had been building up for a while, according to BlackRock Managing Director Tony Ashraf.","\"What we're really seeing over the past couple of months is that pent-up demand being satisfied because of the ETFs,\" said Ashraf<span data-v-f87c67ca=\"\"> on a panel about bitcoin ETFs at the Digital Asset Conference in London<\/span>.&nbsp;","Ashraf noted that new investors are entering the crypto space because ETFs are providing a newer level of access to many investors.","Michael Sonneshein, CEO of Grayscale Investments — which operates a spot bitcoin ETF — concurred with his view. He observed that there’s been explosive growth in the ETFs in general, which has met the pent-up demand. He mentioned that we are now in a phase between that stage and the next one, which will entail more growth and institutionalization of these products.","Ashraf stated that there were three key drivers of demand for the bitcoin ETFs.","He mentioned the first one as the macroeconomic environment and changing demographics in terms of wealth — something he said should not be underestimated in terms of its impact. He remarked that this demographic might alter the standard crypto cycle as, for instance, investors buying bitcoin through a registered investment advisor are unlikely to market sell when the price drops 10%.","The second area is the maturation of the industry, something he described as really important. He cited the influx of more venture capitalists into the space and traditional advisors as supporting this trend. Moreover, he noted that simple things like custody for cryptocurrencies have become more secure.","Ashraf pointed to the improving regulatory environment as the third area driving demand. He remarked that more clarity and certainty are starting to emerge. However, he added, this is still in the early stages.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Asset Conference","content":"ORGANIZATION"},{"type":"Michael Sonneshein","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock Managing Director Tony Ashraf","content":"ORGANIZATION"},{"type":"Ashraf","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}