{"summary":"Dymension is working on the first IBC-enabled EVM-compatible Layer 2 rollup scaling solution that will integrate with the Cosmos ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228617\/evm-rollup-dymension-evmos-cosmos","publishDate":"2023-04-27T09:00:08","id":11090,"type":null,"title":"Dymension and Evmos test an EVM rollup for the Cosmos ecosystem","category":["CRYPTO ECOSYSTEMS"],"content":["Dymension, a blockchain development firm, announced it is working on an EVM-compatible Layer 2 rollup scaling solution that will integrate with <a href=\"https:\/\/www.theblock.co\/post\/219219\/cosmos-hub-releases-replicated-security\" data-v-f87c67ca=\"\">Cosmos<\/a>, an ecosystem of many Layer 1 blockchains.","While Cosmos generally lacks Layer 2 solutions, they are slowly emerging. Dymension's Layer 2 rollup will be compatible with the Ethereum Virtual Machine (EVM), a computing environment used by Ethereum. The rollup aims to enable developers to write and deploy Ethereum applications, a task that is typically challenging due to differences in code between Cosmos and Ethereum.","Currently in the testing phase, Dymension's rollup will be launched as a Layer 2 solution on <a href=\"https:\/\/www.theblock.co\/post\/143771\/evmos-launches-blockchain-to-bring-ethereum-virtual-machine-to-cosmos\" data-v-f87c67ca=\"\">Evmos<\/a>, a blockchain within the Cosmos ecosystem, according to an announcement. The company cites close collaboration with the Evmos core team and a data availability protocol called Celestia.","\"We're excited to have worked closely with the Evmos team to achieve this milestone. With the world's first IBC-enabled EVM rollup now deployed on the testnet, we're one step closer to bringing scalable and interoperable blockchain solutions to the wider community,\" Yishay Harel, Dymension Lab's CEO and co-founder, said in the statement. IBC refers to the <a href=\"https:\/\/tutorials.cosmos.network\/academy\/3-ibc\/1-what-is-ibc.html\" data-v-f87c67ca=\"\">Inter-Blockchain Communication Protocol<\/a>, which handles authentication and data transfer between two Cosmos blockchains.","Adopting a modular approach, Dymension's team plans to create multiple EVM-compatible rollups using a common software development kit, enabling them to operate on top of various Cosmos chains and communicate with those chains.","This is made possible by the IBC-enabled nature of Dymension's rollups, allowing for native connections with the entire Cosmos ecosystem of IBC blockchains without the need for bridges.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Yishay Harel","content":"PERSON"},{"type":"Dymension","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Inter-Blockchain Communication Protocol","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}