{"summary":"USDT was trading at $0.9915 on Thursday. \nTether’s stablecoin is the largest by market capitalization. \nA wallet that might be owned by Alameda Research recently borrowed USDT from Aave and swapped it on Curve.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184653\/tethers-usdt-falls-1-below-dollar-peg-amid-market-uncertainty","publishDate":"2022-11-10T07:07:03","id":111,"type":null,"title":"Tether&#x27;s USDT falls 1% below dollar peg amid market uncertainty","category":["Markets"],"content":["USDT, the stablecoin issued by Tether, has fallen 1% below its peg to the U.S. dollar today amid ongoing market turmoil.&nbsp;","The largest stablecoin on the market fell to $0.9911 today, according to data via TradingView. It has seen a 0.68% decrease in the past hour.","Crypto prices more broadly have also come under pressure this week. Speculators are monitoring the rapidly developing story of crypto exchange FTX and its downfall.","Curve's stablecoin pool is also getting unbalanced. The large majority — some 82% — of the pool is in USDT, resulting in less liquidity for other stablecoins. This will have been caused by traders swapping USDT for other stablecoins.","Tether CTO Paolo Ardoino said this morning that $700 million worth of redemptions had been processed in the last 24 hours. \"No issues. We keep going,\" he <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1590671674378067968?s=20&amp;t=ZPGYQeHfMq2h2RBwRn5dRQ\" data-v-f87c67ca=\"\">tweeted<\/a>.","Sam Bankman-Fried's exchange came under scrutiny last week when a balance sheet relating to Alameda Research — a trading shop he also owns — was leaked. The balance sheet showed significant liabilities and holdings of FTT, FTX's exchange token.&nbsp;","Selling pressure from Binance of FTT over the weekend put increasing pressure on FTX and its trading arm. By Tuesday, Binance had agreed to acquire the struggling exchange — but the deal was off by Wednesday after a review of FTX's finances."],"hashtag":["DAI","TETHER","USDC"]}