{"summary":"The suit discusses in detail the Coinbase board’s confidential plan to go public two years ago, a project given the nickname &quot;Project Fall Fruits.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229049\/coinbase-insider-lawsuit-brian-armstrong-marc-andreessen","publishDate":"2023-05-02T07:07:27","id":11107,"type":null,"title":"Coinbase insiders got $1 billion richer by not disclosing bad information: lawsuit","category":["POLICY"],"content":["Coinbase’s top executives made themselves richer by $1.09 billion by failing to disclose negative information about the company prior to listing its shares in April 2021, according to a lawsuit filed in a Delaware state court.","Coinbase denies the claims, calling the action \"frivolous\" and \"meritless.\"","<a href=\"https:\/\/www.documentcloud.org\/documents\/23794383-2023-0464-ksjm-2023-05-01-adam-grabski-v-marc-andreessen-et-al-coinbase-global-inc-red-compl\" data-v-f87c67ca=\"\">The suit was filed by Adam Grabski, an investor in Coinbase stock<\/a>, on behalf of all shareholders, on May 1. It names famed investors Marc Andreessen and Fred Wilson as defendants, alongside Coinbase CEO Brian Armstrong and his top management team. It also details exactly how much money they all made selling stock.","The suit discusses in detail the Coinbase board’s confidential plan to go public two years ago, a process which internally was given the nickname “Project Fall Fruits”.","At the time, <a href=\"https:\/\/www.theblock.co\/linked\/101715\/coinbase-nasdaq-direct-listing-first-day-ends\" data-v-f87c67ca=\"\">Coinbase chose to do a direct listing<\/a> of its existing shares, rather than the more common initial public offering (IPO), in which new shares are offered to the public markets.","An IPO had two key disadvantages for Coinbase insiders, the suit claims:","The main advantage of a direct listing, the suit claims, was that the shares being offered for sale to the public were pre-existing ones already owned by Coinbase executives and investors. Any stock sales would therefore directly benefit the executives and investors . In the event, <a href=\"https:\/\/www.dlnews.com\/articles\/people-culture\/coinbases-chief-product-officer-will-leave-with-a-105-million-payday\/\" data-v-f87c67ca=\"\">insiders at Coinbase sold their stock through a 10b5-1 trading plan<\/a>. Such a plan sells stock for the executive frequently and automatically, on a schedule they don’t control. Crucially, according to the suit, those 10b5-1 sales would begin on the first day of public trading.","At the same time, the suit alleges, Coinbase’s board members knew there were two pieces of bad news that they had not yet made public:","This set up a tightly scheduled series of events that would make Coinbase insiders rich before the bad news dropped, according to the suit:","\"On April 14, 2021, Coinbase became a Nasdaq-listed company, with its stock trading over $380 per share at the outset and as high as $429 per share in a volatile first day on the public markets.\"","\"Defendants took full advantage of the absence of any lock-up in the Direct Listing, rapidly selling over $2.9 billion of Coinbase stock on the first day and in the days that followed, from April 14, 2021 through April 22, 2021.\"","\"[By] May 18, 2021, both the compression of the Company’s revenue margins during the first fiscal quarter and the issuance of a dilutive convertible offering were publicly disclosed. Neither detail was disclosed in the offering prospectus or the preliminary results provided by the company prior to the Direct Listing on April 6, 2021. By May 18, the stock had declined by more than 37% since its listing, wiping out just over $37 billion in value.\"","Coinbase insiders benefitted massively from the staged release of shares and negative information, the suit alleges, avoiding $1.09 billion in losses as they sold $2.9 billion in shares. The suit lists the beneficiaries:","Coinbase responded to the suit in a statement to The Block: \"As the most popular and only publicly traded crypto exchange in the US, we are at times the target of frivolous litigation. This is an example of one of those meritless claims.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 1","content":"DATE"},{"type":"Delaware","content":"LOCATION"},{"type":"Marc Andreessen","content":"PERSON"},{"type":"May 18","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"$1.09 billion","content":"MONEY"},{"type":"$2.9 billion","content":"MONEY"},{"type":"April 22, 2021","content":"DATE"},{"type":"$429","content":"MONEY"},{"type":"Adam Grabski","content":"PERSON"},{"type":"$37 billion","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"the first fiscal quarter","content":"DATE"},{"type":"April 6, 2021","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"37%","content":"PERCENT"},{"type":"May 18, 2021","content":"DATE"},{"type":"1","content":"DATE"},{"type":"Fred Wilson","content":"PERSON"},{"type":"$380","content":"MONEY"},{"type":"April 14, 2021","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["COINBASE","LAWSUITS"],"authors":["Jim Edwards","The Block"]}