{"summary":"Vitalik Buterin has recovered his T-Mobile account after a SIM swap attack enabled a phishing scam on his X (formerly Twitter) account.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250379\/vitalik-buterin-tmobile-twitter","publishDate":"2023-09-12T06:11:27","id":11102,"type":null,"title":"Vitalik Buterin recovers T-Mobile account, didn&#x27;t realize phone number linked to X","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.99%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Vitalik Buterin has now recovered his T-Mobile account after confirming he was a victim of a SIM swap attack that led to a phishing scam on X (formerly Twitter).<\/span>","“Finally got back my T-mobile account (yes, it was a sim swap, meaning that someone socially-engineered T-mobile itself to take over my phone number),” <a href=\"https:\/\/warpcast.com\/vitalik.eth\/0x8ea2d0\" data-v-f87c67ca=\"\">Buterin wrote on Warpcast<\/a> — a client for the decentralized social protocol Farcaster, where account recovery can be managed via an Ethereum address.","Despite warnings on the insecure nature of phone numbers for authentication in the crypto space, given the prevalence of SIM swap attacks, Buterin didn’t realize a phone number was sufficient for malicious actors to reset his X account, even if it’s not used for two-factor authentication.","“A phone number is sufficient to password reset a Twitter account even if not used as 2FA,“ Buterin noted. “I had seen the 'phone numbers are insecure, don't authenticate with them' advice before, but did not realize this.”","2FA is a security process for accessing a range of online accounts in which users provide two different authentication methods to verify themselves, such as a password and authenticator app code.","Many other users might unknowingly have their phone numbers linked to their X accounts, with Buterin speculating he may have added his number when signing up for a Twitter Blue premium X subscription.","“I don't remember when I *added* the number; my guess is that it was required to sign up for Twitter Blue,“ Buterin said.","Flashbots strategy lead <a href=\"https:\/\/x.com\/hasufl\/status\/1701511924700115454?s=20\" data-v-f87c67ca=\"\">Hasu also warned other X users to be vigilant<\/a>, claiming every Twitter Blue account is SIM-swappable.","“If you signed up to Twitter Blue, it automatically added your phone number to your Twitter profile,” Hasu said. “This phone number can be used to reset your account, whether you use it for 2FA or not. Go to settings\/profile to remove your phone number right now.”","Buterin's X account was compromised over the weekend following the SIM swap attack and used in a phishing scam, resulting in the <a href=\"https:\/\/www.theblock.co\/post\/250047\/vitalik-buterins-x-account-hacked-to-carry-out-phishing-attack-that-stole-700000-in-crypto-nfts\" data-v-f87c67ca=\"\">theft of $700,000 worth of cryptocurrencies and NFTs<\/a>.","The attackers used the account to promote a fake commemorative NFT mint, luring users to a malicious website designed to siphon funds from wallets interacting with it using the popular Pink <a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\">Drainer software<\/a>.","Buterin’s incident is the latest in a series of phishing attacks on X — with several prominent crypto figures and organizations, including the NFT project <a href=\"https:\/\/www.theblock.co\/post\/206378\/azuki-says-twitter-account-compromised-after-posts-promote-virtual-land-scam\" data-v-f87c67ca=\"\">Azuki<\/a> and the <a href=\"https:\/\/www.theblock.co\/post\/238214\/aptos-foundation-twitter-account-hacked-to-promote-fake-airdrop\" data-v-f87c67ca=\"\">Aptos Foundation<\/a>, previously targeted.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Aptos Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"-0.99%","content":"PERCENT"},{"type":"Hasu","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$700,000","content":"MONEY"}],"hashtag":["HACKS","VITALIK BUTERIN"],"authors":["James Hunt","The Block"]}