{"summary":"Coinbase has raised $57 million for a new crypto lending service aimed at lending digital assets to institutional trading clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249333\/coinbase-creates-crypto-lending-service-for-institutional-clients-coindesk","publishDate":"2023-09-05T17:36:39","id":11104,"type":null,"title":"Coinbase creates crypto lending service for institutional clients: CoinDesk","category":["COMPANIES"],"content":["Coinbase has raised $57 million for a new crypto lending service, CoinDesk <a href=\"https:\/\/www.coindesk.com\/business\/2023\/09\/05\/coinbase-creates-new-crypto-lending-service-geared-toward-large-investors\/\" data-v-f87c67ca=\"\">reported<\/a>, citing both a Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1986579\/000198657923000002\/xslFormDX01\/primary_doc.xml\" data-v-f87c67ca=\"\">filing<\/a> and an anonymous source.&nbsp;","The U.S.-based cryptocurrency exchange plans to borrow primarily crypto assets from customers and then turn around and lend it to \"institutional trading clients,\" according to the report.","The proposed platform is unlike the retail lending program Coinbase cancelled in 2021, said the report.","\"With this service, institutions can choose to lend digital assets to Coinbase under standardized terms in a product that qualifies for a Regulation D exemption,\" a Coinbase spokesperson told CoinDesk in a statement.","\"Coinbase is working to update the financial system that was built over 100 years ago, leveraging crypto to provide people with more economic freedom and opportunity,\" it continued.","Coinbase's plan to lend crypto to institutional clients comes in the wake of Genesis and BlockFi's troubled efforts in providing crypto-lending services.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$57 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"BlockFi","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["RT Watson","The Block"]}