{"summary":"Staking protocol Tenderize has announced a $3 million raise led by blockchain venture capital firm Eden Block. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156282\/defi-staking-protocol-tenderize-raises-3-million-in-seed-funding","publishDate":"2022-07-07T09:00:10","id":11112,"type":null,"title":"DeFi staking protocol Tenderize raises $3 million in seed funding","category":["DEFI"],"content":["Tenderize, a staking derivatives protocol, has raised $3 million in seed funding in a round led by blockchain venture capital firm Eden Block.","Other investors in the round included blockchain infrastructure firm Figment, web3 angel collective Daedalus and digital asset investment firm TRGC, according to a statement on Thursday.","Tenderize is a protocol that allows users to collateralize loans and trade tokens while maintaining a position of staked assets. Through this increased flexibility, the company believes that it can unlock the full utility potential of staked assets with the end goal of enabling permissionless liquid staking, an emerging form of staking that seeks to unlock the value of staked tokens.","\"The team's previous experience at projects like Livepeer, Pocket Network and Yearn gave us the insight into the growing need for a better staking experience for web3 protocols,\" said Tenderize co-founder Nico Vergauwen.\"For the longest time users had to choose between liquidity and staking rewards\/securing their network. With Tenderize’s liquid staking, users have both.\"&nbsp;","Currently, the Tenderize team is working on integrations with wallets, analytics platforms, custodial staking partners and exchanges. It says that users can already access liquid staking options for LPT, GRT, AUDIO and MATIC tokens.&nbsp;","The raise follows other moves to support liquid staking protocols. In May, The Block <a href=\"https:\/\/www.theblock.co\/post\/147385\/coinbase-figment-alluvial-institutional-liquid-staking-protocol\" data-v-f87c67ca=\"\">reported<\/a> that Coinbase and Figment would work together on an institutional liquid staking project.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eden Block","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Tenderize","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Daedalus","content":"ORGANIZATION"},{"type":"Pocket Network","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Nico Vergauwen","content":"PERSON"},{"type":"$3 million","content":"MONEY"}],"hashtag":["STAKING"],"authors":["Tom Matsuda","The Block"]}