{"summary":"Youssef said that trusting platforms kept users at the &quot;mercy of these custodians and their morals,&quot; referencing FTX&#x27;s collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194274\/ceo-paxful-tells-customers-get-bitcoin-off-platform","publishDate":"2022-12-12T16:14:07","id":11116,"type":null,"title":"Paxful CEO tells customers to get their bitcoin off its platform","category":["EXCHANGES"],"content":["The CEO of the peer-to-peer bitcoin trading platform Paxful Ray Youssef told customers to get their bitcoin off the platform and move it into self-custody.&nbsp;","Youssef cited the collapse of Sam Bankman-Fried's crypto exchange FTX as reasons for urging Paxful's 11 million customers to self-custody their cryptocurrency.&nbsp;","\"I take great pride in protecting our community’s funds and, unlike others in our industry, I have&nbsp;<u data-v-f87c67ca=\"\">never<\/u> touched our customers’ money,\" Youssef said in an email to users. \"My sole responsibility is to help and serve you. That’s why today I’m messaging all of our users to move your Bitcoin to self-custody. You should not keep your savings on <a href=\"https:\/\/www.theblock.co\/linked\/107017\/paxful-officially-launches-paxful-pay-businesses-receive-btc-payment\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Paxful<\/a>, or any exchange, and only keep what you trade here.\"","Last month, cryptocurrency exchange volumes <a href=\"https:\/\/www.theblock.co\/post\/191352\/decentralized-crypto-exchange-volumes-nearly-double-in-november-amid-ftx-debacle\" data-v-f87c67ca=\"\">jumped<\/a> compared to October as the collapse of FTX roiled markets, with decentralized platforms seeing an increase of 93% as doubled to $65 billion from $34 billion. Centralized exchange volumes rose by 24% to $673 billion, up from $543 billion in October, according to The Block data.","Youssef adds that when customers trust platforms to safeguard their crypto, \"you're at the mercy of these custodians and their morals.\"","\"Bitcoin has given us the chance to finally be in control and we must take it,\" Youssef said.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$34 billion","content":"MONEY"},{"type":"$65 billion","content":"MONEY"},{"type":"$543 billion","content":"MONEY"},{"type":"Paxful","content":"ORGANIZATION"},{"type":"93%","content":"PERCENT"},{"type":"Paxful Ray Youssef","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$673 billion","content":"MONEY"},{"type":"24%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Youssef","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}