{"summary":"Former FTX US executive Brett Harrison is raising money for a new crypto start-up for large investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191865\/former-ftx-us-head-brett-harrison-tries-raising-money-for-new-startup-the-information","publishDate":"2022-12-02T15:42:10","id":11119,"type":null,"title":"Former FTX US head Brett Harrison attempts to raise money for new startup: The Information","category":["PEOPLE"],"content":["Former FTX US president Brett Harrison is trying to raise money for a crypto trading software startup for large investors, The Information <a href=\"https:\/\/www.theinformation.com\/articles\/former-ftx-executive-brett-harrison-in-talks-with-investors-for-new-crypto-startup\" data-v-f87c67ca=\"\">reported<\/a>, citing sources.&nbsp;","The company aims to&nbsp;make it easier for professional investors to trade digital assets on centralized exchanges and decentralized protocols, two people familiar with the matter told The Information. Harrison told at least one venture capital firm he’s looking to raise $6 million at a valuation of $60 million, although those details are subject to change, the sources said.","Harrison, who <a href=\"https:\/\/twitter.com\/BrettHarrison88\/status\/1574782901748727809?s=20&amp;t=tqAH7rHOC2FON3_WoiapSQ\" data-v-f87c67ca=\"\">stepped down<\/a> from the company just about five weeks before<a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\"> the exchange's public troubles<\/a> first started, was one of FTX US’s more public-facing executives during his time at the company. While the new fundraising attempts had not been previously reported,&nbsp;Harrison put out a couple tweet <a href=\"https:\/\/twitter.com\/BrettHarrison88\/status\/1585685422105042944?s=20&amp;t=EBeiwor6MQnE5-adKdYzqQ\" data-v-f87c67ca=\"\">threads<\/a> in October about problems facing crypto and decentralized finance and what he may be working on.","“There are many companies, founders, builders, and investors currently working (some in stealth) to make DeFi infrastructure and applications easier, simpler, and more useful,” Harrison<a href=\"https:\/\/twitter.com\/BrettHarrison88\/status\/1586786120792125440?s=20&amp;t=_-rWB6xXarH4T4yjyJweNQ\" data-v-f87c67ca=\"\"> tweeted<\/a> on Oct. 30, a month after he left FTX US.","“I’m proud to join the group of founders and devs who are building technology to make DeFi more accessible and more widely applicable,” he wrote in the same thread.&nbsp;Harrison wrote in a different <a href=\"https:\/\/twitter.com\/BrettHarrison88\/status\/1585685422105042944?s=20&amp;t=EBeiwor6MQnE5-adKdYzqQ\" data-v-f87c67ca=\"\">thread<\/a> about a specific order type useful for volatile markets not yet available in crypto that’s frequently used in equity markets to help manage risk.","Harrison did not immediately reply to a request for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harrison","content":"PERSON"},{"type":"Oct. 30","content":"DATE"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Brett Harrison","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"The Information","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}