{"summary":"The settlement was reportedly discussed at a private dinner for some of the crypto exchange’s biggest traders in September.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265660\/binance-vip-traders-forewarned-of-settlement","publishDate":"2023-12-01T08:58:21","id":11113,"type":null,"title":"Binance&#x27;s &#x27;VIP&#x27; traders were forewarned of $4 billion settlement penalty: Bloomberg","category":["LEGAL"],"content":["Binance's biggest traders, attending a conference in Singapore this September, were privy to the crypto exchange's forthcoming settlement with U.S. authorities during a luxurious private dinner.","The exclusive gathering, held in the sophisticated 1880 members-only club, saw a select group of market makers and traders, referred to as VIPs, gain insight into Binance's impending legal turmoil amidst a setting of American Angus beef and Australian truffles, according to several attendees, Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-12-01\/binance-vip-traders-got-sneak-peek-of-record-us-crypto-penalty\" data-v-f87c67ca=\"\">reported<\/a>.","The attendees broke off into smaller groups and reportedly quizzed Binance executives on the company’s legal troubles, raising the likelihood of a $4 billion fine and leaving convinced the firm could afford and would pay it.","Binance’s now-former CEO Changpeng “CZ” Zhao was notably absent, while Richard Teng — who replaced Zhao as CEO last week — was there but asked not to be identified discussing the private gathering, according to Bloomberg. However, the bottom line was that Binance would survive.","A Binance spokesperson told Bloomberg the depiction of the event was inaccurate but declined to identify which aspects were wrong. Binance did not respond to a request for comment from The Block.","Two months later, U.S. authorities, including the Department of Justice, Department of the Treasury and the Commodity Futures Trading Commission <a href=\"https:\/\/www.theblock.co\/post\/264010\/justice-department-set-to-announce-settlement-with-binance-bloomberg\" data-v-f87c67ca=\"\">settled<\/a> with Binance last week, concluding a criminal investigation into allegations of money laundering and sanctions violations — marking one of the largest corporate settlements in U.S. history. The settlement involved $4.3 billion in penalties and included criminal charges against Zhao.","The DOJ had been <a href=\"https:\/\/www.theblock.co\/post\/193988\/justice-department-weighs-charging-binance\" data-v-f87c67ca=\"\">investigating<\/a> Binance and its executives since 2018 over concerns about money laundering and sanctions violations, with scrutiny on the firm increasing throughout 2023 from <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\">additional<\/a> financial regulatory bodies, including a <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">lawsuit<\/a> filed in June by the Securities and Exchange Commission — though the SEC wasn’t part of the $4.3 billion settlement deal.&nbsp;","Zhao also agreed to <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">step down<\/a> as CEO as part of a deal with the DOJ. He pleaded guilty to violations of the Bank Secrecy Act and will pay a $50 million fine. Zhao also posted a <a href=\"https:\/\/www.theblock.co\/post\/264191\/binance-ex-ceo-cz-released-on-175-million-bond-after-u-s-criminal-charges\" data-v-f87c67ca=\"\">$175 million<\/a> personal recognizance bond and faces a potential prison sentence of up to 18 months.&nbsp;","His sentencing is scheduled for February 2024, and he will have to stay in the U.S. ahead of the hearing, at least until a <a href=\"https:\/\/www.theblock.co\/post\/264875\/judge-says-cz-cant-return-to-uae-ahead-of-sentencing-for-now\" data-v-f87c67ca=\"\">further review<\/a> is conducted. If Zhao fails to show up at the court in February 2024, he will face up to 10 years' imprisonment and a fine of $250,000.","Zhao's absence was not just confined to this event; he also missed Binance’s conference in Istanbul last month, choosing instead to stay near his Dubai residence in the United Arab Emirates. The UAE doesn’t have an extradition agreement with the U.S., but Zhao voluntarily flew to the U.S. to attend last week’s hearing.","Zhao had been preparing to step down since May, according to four people familiar with conversations during Binance’s leadership calls. A possible deal with the DOJ earlier in the year fell through after some officials pushed for him to personally face a stiffer penalty, according to a person with direct knowledge of the matter, Bloomberg reported.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Department of the Treasury","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"1880","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"$175 million","content":"MONEY"},{"type":"Zhao","content":"PERSON"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Dubai","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Istanbul","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","BINANCE","COURT HEARINGS","CZ","LAWSUITS"],"authors":["James Hunt","The Block"]}