{"summary":"The price of staked ether (stETH) is trading at a 5% discount from the price of ETH, following some large sales.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151380\/lido-staked-ether-steth-discount-drops-to-5-for-second-time-in-one-month","publishDate":"2022-06-10T13:45:44","id":11111,"type":null,"title":"Lido staked ether (stETH) discount drops to 5% for second time in one month","category":["DEFI"],"content":["Lido’s staked ETH (stETH) token price has dropped to a 5% discount against ether (ETH) for the second time in a month, amid fears of shrinking liquidity for the staking derivative.&nbsp;","stETH is a derivative token backed 1:1 by ETH. Users who stake their ETH on the Lido Finance platform receive the staked derivative in return. The upside is that they can access the value of their staked tokens while they are being staked, but the downside is that they can’t unstake the actual ETH until after Ethereum goes through The Merge, when it will transition to a proof-of-stake network.&nbsp;","Token holders are able to sell their stETH for ETH on the open market, but there has always been a slight discount, reflecting the level of risk that comes with holding a derivative rather than the actual asset itself. Yet over the last month, this discount has deepened considerably.&nbsp;","On May 13, the value of stETH was worth around 95% of the ETH price. It then rose to around 98% and remained there for the next few weeks. In the past day, the value has dropped again, back down to the 95% mark.","<span data-v-f87c67ca=\"\">The value of stETH has dropped 5% below the value of ETH. Image: CoinMarketCap.<\/span>","The main cause appears to be significant stETH owners selling large quantities of the token. One wallet <a href=\"https:\/\/twitter.com\/HsakaTrades\/status\/1534464723302891522\" data-v-f87c67ca=\"\">sold<\/a> close to 50,000 stETH on Thursday.","This has had a big impact on Curve, the main DeFi liquidity pool. Curve works by having quantities of both assets in a pool, which traders can sell into. But due to the large selling volume, the pool has become unbalanced. It now has a <a href=\"https:\/\/curve.fi\/steth\/deposit\" data-v-f87c67ca=\"\">ratio<\/a> of 22% ETH to 78% stETH as of the time of publishing. This is the most unbalanced that the pool has ever been.&nbsp;","An unbalanced pool means one of the assets, stETH in this case, is becoming more illiquid. As such, it will become harder to sell as there isn’t enough ETH liquidity to honor sell orders of stETH at current prices.","This situation has prompted Lido to make a <a href=\"https:\/\/twitter.com\/LidoFinance\/status\/1535184472546889735\" data-v-f87c67ca=\"\">statement<\/a> saying that there is no cause for alarm.","“The market is naturally finding a fair price for stETH as some participants need to find liquidity. This creates an opportunity for others to buy stETH at a significant discount,” the platform stated on Twitter.","Lido blamed recent crypto market events for having caused the value of stETH to drop, including the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/146722\/terra-says-it-has-halted-blockchain-for-second-time-in-24-hours\" data-v-f87c67ca=\"\">collapse of Terra<\/a>, as well as crypto participants deleveraging positions in the wake of falling prices.","If the value of stETH drops further, it is not necessarily an issue for current holders. Each token is backed by 1 ETH and when redemptions are available, the underlying collateral will become available.&nbsp;","Crypto researcher Mika Honkasolo pointed out that stETH is not pegged to ETH in the same way that a stablecoin might be pegged to the value of its underlying collateral. In a <a href=\"https:\/\/mhonkasalo.substack.com\/p\/stetheth-peg-not-a-peg-presents-a?s=w\" data-v-f87c67ca=\"\">blog post<\/a> on this topic, he said, “There’s no “need” for stETH to maintain a tight correlation to the ETH price. It doesn’t matter if it fluctuates 90% below the ETH price or 50% above it. Confidence can’t be lost because of price action.”","Honkasolo noted, however, that the drop in value of stETH could affect those who have used the token to create leveraged positions, in particular to go long on the price of ETH. He said that if the value of stETH goes to 85% of ETH, liquidations would start to happen.","“The current market sentiment is bad and it seems there’s a non-trivial chance of cascading liquidations. That then pushes the stETH price really low (theoretically, to the 0.65 range),” he said.","On the flipside, as Lido noted, if the price falls lower it could incentivize more traders to buy stETH and to wait until they can redeem it for the underlying ETH.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 13","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"98%","content":"PERCENT"},{"type":"78%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"past day","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Mika Honkasolo","content":"PERSON"},{"type":"85%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Terra","content":"ORGANIZATION"},{"type":"last month","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}