{"summary":"The Inner Mongolia government has hired a contractor to help the state search for illegal mining operations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117845\/china-crypto-mining-crackdown-mechanism","publishDate":"2021-09-16T04:44:52","id":11128,"type":null,"title":"China&#x27;s Inner Mongolia hires contractor to search for illegal crypto mining","category":["MINING"],"content":["The Development and Reformation Commission of China's Inner Mongolia, previously one of the crypto mining hubs in China, said on Wednesday that it has hired a contractor to help the state monitor for illegal mining operations.","The commission selected Inner Mongolia Mengze Engineering Management Limited, just one week after it opened the bid to the public for applications.","The goal for Mengze — with a $46,000 government budget — is to help the state build up an intelligence and response unit to continuously analyze and spot possible operations that are secretly mining cryptocurrencies in the region.","It's a sign that China will not ease its crackdown on the crypto mining space in the long term, even though some Chinese Bitcoin and Ethereum miners have quietly resumed operations — mostly in secrecy — now that it has been three months since the initial crackdown.","What's notable from the bidding document revealed last week is that the Inner Mongolia government is looking for specific details on uncovering mining operations. It outlined at least ten areas that it wants to know about, such as:","Since China revealed the crackdown on crypto mining in May, a total of seven provinces that had notable amount of mining operations have launched relevant measures. The Hebei province is the latest one to form a special task force to normalize the efforts.","While the crackdown had a strong chilling effect at the beginning, which resulted in Bitcoin and Ethereum's hash rates plunging, some Chinese miners have gradually found ways to resume operations secretly over the past two months as things cooled off.","But with provincial governments aiming to scale up their knowledge and responding mechanism, it appears there will be a tug of war in the foreseeable future between law enforcement and local crypto miners.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Mongolia","content":"LOCATION"},{"type":"Reformation Commission of China","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$46,000","content":"MONEY"},{"type":"Hebei","content":"LOCATION"},{"type":"Inner Mongolia Mengze Engineering Management Limited","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}