{"summary":"A committee within El Salvador&#x27;s Legislative Assembly is considering a long-awaited digital asset framework.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189427\/el-salvador-lawmakers-to-consider-regulation-for-issuing-digital-assets","publishDate":"2022-11-23T00:19:33","id":11123,"type":null,"title":"El Salvador lawmakers to consider regulation for issuing digital assets","category":["REGULATION"],"content":["A committee within El Salvador's Legislative Assembly is considering a <a href=\"https:\/\/www.asamblea.gob.sv\/sites\/default\/files\/documents\/correspondencia\/4CCA02DF-7C4F-4B25-9725-821EB3618A5D.pdf\" data-v-f87c67ca=\"\">long-awaited law<\/a> aimed at regulating digital asset service providers and issuers in the country.&nbsp;","The so-called \"digital asset issuance law\" would create a legal framework for companies offering digital assets in El Salvador, and create a national commission tasked with overseeing their certification and operations.","The proposed digital asset law is now with the Legislative Assembly's economic committee, according to a document seen by The Block and corroborated by a broadcast of a Nov. 22 plenary session.&nbsp;","The new law would have the \"aim of promoting the efficient development of the digital asset market and protecting the interests of the acquirers,\" according to the text.&nbsp;","It is significant because it broadly references digital assets, instead of narrowly focusing on bitcoin, which El Salvador adopted as legal tender in September 2021. However, this latest proposal focuses on providing standards for offering digital assets to the public rather than making other cryptocurrencies legal tender.&nbsp;","Digital asset service providers in El Salvador would have to complete a registration process and follow several rules under the proposed law. These entities would have to provide a list of digital assets they plan to offer, including their \"benefits, restrictions and limits.\" They would also have to demonstrate cybersecurity precautions and customer service capabilities, as well as providing the names and titles of company employees.","Issuers of digital assets would also have to follow certain rules, such as disclosing information about the jurisdictions or countries where they operate.","The proposal also mentions the creation of a so-called \"bitcoin fund management agency\" that would be in charge of \"the administration, safekeeping and investment of funds from public offerings of digital assets carried out by the state of El Salvador and its autonomous institutions and the returns from said public offerings.\"","Further laws focused on digital assets or securities could be in the works. El Salvador's president Nayib Bukele said in <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1495278787684179973\" data-v-f87c67ca=\"\">February<\/a> that the government was working on 52 reforms aimed at securities laws, tax incentives and other items.","The Block <a href=\"https:\/\/www.theblockcrypto.com\/news+\/137641\/el-salvador-could-launch-its-bitcoin-bond-next-week-but-some-key-details-remain-unclear\" data-v-f87c67ca=\"\">reported<\/a> that El Salvador was developing a legal framework for digital asset service providers ahead of the planned launch of its so-called \"bitcoin bond\" in mid-March, which so far has not come to fruition.","At that time, Tether and Bitfinex Chief Technology Officer Paolo Ardoino said El Salvador's government was working on a method to license companies offering digital assets. Bitfinex Securities had said it was planning to apply for a license so that the bitcoin bond issuer could raise funds through its platform, but was still waiting for the legal framework to be finalized.","\"Digital securities law will enable El Salvador to be the financial center of Central and South America,\" Ardoino <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1595246771097288705?s=20&amp;t=Lrvn9PdgtIADv_oBRu_Tkw\" data-v-f87c67ca=\"\">tweeted<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"Legislative Assembly","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"February","content":"DATE"},{"type":"El Salvador's Legislative Assembly","content":"ORGANIZATION"},{"type":"mid-March","content":"DATE"},{"type":"South America","content":"LOCATION"},{"type":"Bitfinex Securities","content":"ORGANIZATION"},{"type":"Nov. 22","content":"DATE"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"El Salvador","content":"PERSON"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}