{"summary":"Six months of calamity in the crypto sector have done nothing to dampen its boosters’ spirits.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174935\/its-too-compelling-not-to-try-again-crypto-keeps-the-faith-at-singapore-shindig","publishDate":"2022-10-05T05:14:06","id":11124,"type":null,"title":"&#x27;It’s too compelling not to try again&#x27;: Crypto keeps the faith at Singapore shindig","category":["EVENTS"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">A sign of the times at Token 2049 in Singapore last week: A woman could be seen handing out a smartly produced print magazine about The Merge that must have cost a pretty penny to make. Its patron? Singapore-based crypto lender Zipmex, which filed for <a href=\"https:\/\/www.reuters.com\/technology\/crypto-platform-zipmex-files-bankruptcy-protection-singapore-2022-07-29\/\" data-v-f87c67ca=\"\">bankruptcy protection<\/a> in late July.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Six months of calamity in the crypto sector have done nothing to dampen its boosters’ spirits, however. Despite the turmoil and the bad news, more than 7,000 of them were out in force at the city state’s Marina Bay Sands resort. Mixed in with the schmoozing and the spectacle of Formula 1 were fleeting moments of reflection and evidence of lessons learned. Mostly, though, it was partying as usual.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With the conference getting underway, Pantera Capital boss Dan Morehead, in town for the event, <\/span><a href=\"https:\/\/www.theblock.co\/post\/173339\/pantera-is-seeking-1-25-billion-for-second-blockchain-fund\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">informed Bloomberg<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> of plans to raise a new $1.25 billion fund to plow into the blockchain sector.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Morehead wasn’t the only fund manager in Singapore courting fresh capital. Rumors abounded that Arthur Cheong’s DeFiance Capital is seeking $100 million for a new liquid token fund. Sure enough, the <\/span><a href=\"https:\/\/www.theblock.co\/post\/174077\/arthur-cheongs-defiance-capital-raising-100-million-to-invest-in-liquid-tokens\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">news broke<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> on Sept. 30. DeFiance previously billed itself as a “sub-fund” of Three Arrows Capital, the bankrupt hedge fund that had borrowed money from a significant portion of Token 2049’s exhibitors — but later distanced itself.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The Block also got its hands on a deck for CVP NoLimit Holdings, a token-focused fund that is also pitching investors to raise $100 million. The fund is a partnership between China-focused private equity firm ClearVue Partners and NoLimit Holdings. Its founding partner Gin Chao previously led Binance’s venture arm. Strategy-wise, it will target Layer 1 blockchains before their tokens go live, according to the pitch deck. The Block contacted ClearVue Partners for comment, but did not receive a response.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">One investor that also sees a bright future for new Layer 1 chains is Dragonfly Capital. The venture firm announced an investment in Aptos Labs during Token 2049, adding an undisclosed amount of capital to <\/span><a href=\"https:\/\/www.theblock.co\/post\/159439\/aptos-closes-150-million-round-led-by-ftx-ventures-jump-crypto\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">the $350 million<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> pile it has already amassed this year. While further details of the investment could not be pried from Dragonfly managing partner Haseeb Qureshi, he did at least impart a zesty comment.&nbsp;&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“The place in the pantheon they’re trying to attack is what Solana wanted to be,” Qureshi said in an interview. “They want to be super high throughput, super high performance, super low latency. Now, they’re doing that in a different way than Solana is, and they also had the benefit of seeing what Solana did badly.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The Block also <a href=\"https:\/\/www.theblock.co\/post\/174933\/axie-infinity-bounce-back-founder-interview-leonard-larsen\" data-v-f87c67ca=\"\">caught up with<\/a> Aleksander Leonard Larsen, co-founder and COO of Axie Infinity developer Sky Mavis — another business that has been “learning from mistakes,” after a year that saw it<\/span> <a href=\"https:\/\/www.theblock.co\/post\/156038\/how-a-fake-job-offer-took-down-the-worlds-most-popular-crypto-game\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">lose $540 million<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> to a hack and considerable momentum in terms of active users and token prices.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">With the original Axie Classic game now shelved, the stolen funds returned to users, and a new game in the form of Axie Origins ready for lift-off, Leonard Larsen is feeling optimistic. He is also feeling hard done by.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“I’m excited to show people more of what we’re building,” he said. “People in this space might misunderstand what Sky Mavis and Axie is about and don’t really see the big picture. I feel like a little bit of an underdog story, again, which has historically been very good for us.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">One goal, he added, is to show people that Axie is “more than just that play-to-earn that everybody is getting to know us for.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Gaming — the kind underpinned by blockchain technology — was a particularly prominent theme in Singapore. It was the word on many a founder’s lips.&nbsp; One young entrepreneur described plans to gamify spending — “spend-to-earn,” effectively. He had already secured two chunks of seed-stage funding.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Gaming was also front of mind for David Shin, head of global adoption for at Klaytn Foundation, booster of a blockchain by the same name. Klaytn is the chain developed by Kakao, the Korean internet giant. With its governance council of prominent tech and crypto companies, its model is a little like the structure employed by Facebook’s Libra before regulatory pressure forced that project to crumble.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Our focus right now is gaming, metaverse and creator economies. For the metaverse we’re looking at a lot of entertainment use cases,” said Shin.&nbsp;&nbsp;&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">&nbsp;Originally built as a Solana-focused platform for NFT trading, Magic Eden told The Block that its long-term goal is to expand to other chains, including Ethereum. The company raised $130 million in June. Since July, Magic Eden has been making investments in the crypto gaming sector. Why? “We want to form strong partnerships with developers in our ecosystem,” said Tony Zhao, who looks at partnerships and investments for the firm. “We want to people to feel comfortable working with us.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">One crypto gaming developer described a new method of community-building involving tech that can identify when two players of the same game also frequent the same coffee shop. Sound a bit dystopian? “All the best stuff is!” he said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Given the extent of the carnage stemming from the collapse of Terra and 3AC — whose co-founders Zhu Su and Kyle Davies lived in Singapore before running into trouble — it is perhaps unsurprising that some attendees were feeling smug about boasting a clean bill of health. The custodians, in particular, were putting on a brave face.&nbsp;&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Hex Trust, an Asia-focused firm with $6 billion under custody at peak prices, was Terra’s custody partner — yet the firm took no losses when the whole ecosystem flamed out in May, according to co-founder and CEO Alessio Quaglini.&nbsp; <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">That’s despite the fact that custodians often lend out — or deploy in other ways — the assets they safeguard, and Hex Trust was no exception. Its loans were over-collateralized, Quaglini said, but in some cases that collateral appears to have been held in luna or terraUSD — Terra-based tokens that saw their value vaporized to hear zero in May. How, then, did Hex Trust not take a hit?&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“If you’re a custodian, you’re usually very intimate with the client,” Quaglini said. What that means is that Hex Trust was acutely aware of the risk of a so-called death spiral taking hold of Terra-town, and had the levers needed to liquidate its collateral quickly if forced to.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Not all custodians were quite so lucky, though they do seem to have fared better than other lenders. Take Singapore-based Matrixport, a crypto app that offers a range of investment products and custody tools. Cactus Custody, its third-party institutional custody business, looked after $10 billion at peak prices — down to $5 billion-$6 billion currently, thanks to falling crypto prices. The firm had given <a href=\"https:\/\/www.theblock.co\/post\/158279\/three-arrows-capital-3ac-creditors-committee-five-members\" data-v-f87c67ca=\"\">a loan to 3AC<\/a> that was 120% collateralized, and liquidated the hedge fund when it failed to meet a margin call in the summer. The liquidation came too late to avoid some losses, however, with Matrixport recovering around 80% of the loan, according to founding partner and chief operating officer Cynthia Wu.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">No company at Token 2049 projected confidence in a crypto bounce back quite so loudly as OKX, the Seychelles-headquartered exchange operator.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Earlier this year, crypto companies were splashing cash on big-ticket marketing campaigns involving stadium rebrands and prime-time Super Bowl slots. Then the bear market set in, and marketing budgets — as well as staff — were <\/span><a href=\"https:\/\/www.businessinsider.com\/crypto-companies-slash-marketing-budgets-and-slow-advertising-spend-2022-6\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">slashed<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> across the sector.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">OKX, which radically <\/span><a href=\"https:\/\/www.okx.com\/academy\/en\/okex-rebrands-to-okx\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">rebranded<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> from OKEx in January, is still very much on the offensive.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Earlier this week, it signed up Olympian snowboarder Scotty James as its latest brand ambassador. James joins a cast of OKX-affiliated sports stars and teams that already features golf ace Ian Poulter, Formula 1 driver Daniel Ricciardo, Ricciardo’s team (for now) McLaren, and English Premier League champions Manchester City.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The OKX-F1 link was on display at Token 2049, where one in every three attendees sported a bright orange McLaren cap. OKX hosted several events featuring Ricciardo, Lando Norris and team CEO Zak Brown. Ricciardo even took part in a fireside chat at the event in which he was asked, repeatedly, to compare race driving to crypto trading. “It’s something that all athletes deal with, ups and downs, highs and lows,” Ricciardo said. Somehow there was no mention of crashing.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">OKX global chief marketing officer Haider Rafiq talked through the firm’s audacious bid for eyeballs. “OKX has gone through quite a transformation over the last eight to nine months,” he said, adding that it has spent hundreds of millions of dollars on marketing this year. “They’re not cheap deals but what I will tell you is we were absolutely willing to walk away from the table if they became about money.” <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The expenditure seems to be paying dividends, with OKX consistently ranked as one of the largest crypto trading venues by volume, according to CoinGecko data.&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">But the 800-pound gorilla in the region — indeed, globally — is still Binance, which has been besting crypto-only exchange rivals for years and now boasts around 80% market share, according to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\/crypto-only-exchange-market-share\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">The Block Research’s data<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\">.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The Block spoke with Gleb Kostarev, vice president and regional head of Asia at the ambiguously headquartered exchange. Mostly, he is focused on blazing a trail to licenses in what is a very fragmented market in terms of regulation. Binance, in fact, <\/span><a href=\"https:\/\/www.theblock.co\/post\/173895\/binance-secures-new-zealand-registration-opens-local-office\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">announced<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> registration and the opening of a local office in New Zealand on the final day of the conference.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Unlike in the Middle East and Europe, where it has regional hubs in Dubai and Paris, Binance has yet to establish a headquarters in Asia. “We would like to do that at some point, because we think that sooner or later there will be strong competition between countries in Asia to attract crypto businesses,” Kostarev said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">One stumbling block for Binance as it attempts to work through the concerns of regulators in places like Vietnam, Cambodia and Malaysia is the issue of where liquidity comes from. “For example, in Malaysia, there is segregated liquidity,” said Kostarev, meaning trading can only take place between local counterparties. Binance is pushing back against this. “Global liquidity is one of the best user protection tools, because if you have access to global liquidity, it means that users can buy and sell at a better price,” Kostarev said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Another Seychelles-based exchange that could be found touting its wares at Token 2049 — for the first time in a while — was BitMEX. The firm is on the comeback trail, as it has been ever since its co-founders were hit with <\/span><a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8270-20\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">charges<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> that they had illegally operated a crypto derivatives platform and violated anti-money laundering rules in the U.S.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">CEO Alexander Höptner has been diligently working on a plan to re-establish BitMEX as a force to be reckoned with ever since he took over in January 2021. That plan involved branching out beyond derivatives trading and, at one time, the purchase of a small German bank. BitMEX faced another setback in March when the deal <\/span><a href=\"https:\/\/www.theblock.co\/linked\/140000\/bitmexs-planned-acquisition-of-bankhaus-von-der-heydt-falls-through\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">fell through<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> — but Höptner isn’t ruling out a second bite at the apple. “It’s too compelling not to try again,” he said in an interview.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">No phrase could better encapsulate the mindset of the many startups and investors jostling for position in Singapore last week. Down but not out, they appeared united in their belief that crypto prices, NFT sales, and startup valuations would all rebound — even with reminders of the crises that so recently rocked them ever-present.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<em data-v-f87c67ca=\"\">This story has been updated to reflect the fact that Zipmex filed for bankruptcy protection in late July. An earlier version had described it as bankrupt. It has also been changed in light of revised data given to The Block by Matrixport.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tony Zhao","content":"PERSON"},{"type":"Matrixport","content":"PERSON"},{"type":"Daniel Ricciardo","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"Kakao","content":"PERSON"},{"type":"Leonard Larsen","content":"PERSON"},{"type":"English Premier League","content":"ORGANIZATION"},{"type":"January 2021","content":"DATE"},{"type":"NoLimit Holdings","content":"ORGANIZATION"},{"type":"Malaysia","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"$130 million","content":"MONEY"},{"type":"Sept. 30","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dan Morehead","content":"PERSON"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Axie","content":"ORGANIZATION"},{"type":"Terra","content":"LOCATION"},{"type":"McLaren","content":"PERSON"},{"type":"ClearVue Partners","content":"ORGANIZATION"},{"type":"Marina Bay Sands","content":"LOCATION"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"David Shin","content":"PERSON"},{"type":"Alessio Quaglini","content":"PERSON"},{"type":"$350 million","content":"MONEY"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"Gin Chao","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"CVP NoLimit Holdings","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Gleb Kostarev","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"Axie Classic","content":"ORGANIZATION"},{"type":"Alexander Höptner","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Mavis —","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Mavis","content":"PERSON"},{"type":"Klaytn Foundation","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"New Zealand","content":"LOCATION"},{"type":"Vietnam","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Token 2049","content":"ORGANIZATION"},{"type":"Paris","content":"LOCATION"},{"type":"$5 billion","content":"MONEY"},{"type":"Ricciardo","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Manchester City","content":"LOCATION"},{"type":"$540 million","content":"MONEY"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Haider Rafiq","content":"PERSON"},{"type":"120%","content":"PERCENT"},{"type":"Dubai","content":"LOCATION"},{"type":"Aleksander Leonard Larsen","content":"PERSON"},{"type":"Quaglini","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Scotty James","content":"PERSON"},{"type":"Haseeb Qureshi","content":"PERSON"},{"type":"2049","content":"DATE"},{"type":"$1.25 billion","content":"MONEY"},{"type":"Shin","content":"PERSON"},{"type":"late July","content":"DATE"},{"type":"Kostarev","content":"PERSON"},{"type":"Cynthia Wu","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"Lando Norris","content":"PERSON"},{"type":"Cambodia","content":"LOCATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"Zak Brown","content":"PERSON"},{"type":"Middle East and Europe","content":"LOCATION"},{"type":"” Qureshi","content":"PERSON"},{"type":"Höptner","content":"PERSON"},{"type":"OKX","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Ian Poulter","content":"PERSON"}],"hashtag":["ASIA","FUNDRAISING"],"authors":["Ryan Weeks","The Block"]}