{"summary":"&quot;There&#x27;s significant evidence that the market structure has shifted from a bearish bleed to a bullish trend.&quot; That&#x27;s Joe McCann from crypto investment","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262014\/crypto-markets-look-like-theyre-trending-bullish-as-alt-coins-stage-comeback","publishDate":"2023-11-07T18:01:05","id":11137,"type":null,"title":"Crypto markets look like they&#x27;re trending bullish as alt-coins stage comeback","category":["COMPANIES"],"content":["\"There's significant evidence that the market structure has shifted from a bearish bleed to a bullish trend.\"","That's Joe McCann from crypto investment fund Asymmetric.","The firm is an active investor in DeFi markets, and their recent market memo caught my attention, especially given current conditions.","After significant rallies over the past year, crypto heavyweights like ether and bitcoin seem to be settling in a bit of a relative rut (price wise, at least), while a wide range of other assets, from Solana to LINK and even more obscure meme coins like BONK, have recently gained significant traction. Many of my favorite crypto enthusiasts on Twitter have been expressing their frustration about being caught flat-footed on the sidelines. They were comfortable holding onto ether and stablecoins but have missed out on substantial gains in coins that have appreciated by more than 50% in just the past few weeks.","The performance of The Block's DeFi index relative to ether and bitcoin illustrates the shift that has occurred in the crypto market, with the 30-day return of the former surpassing ether's performance on Nov. 5. The index covers names including COMP, Aave and Yearn.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/price-performance-30d\/embed\" title=\"Price Performance (30D)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","We haven't released a SolFi (SolanaFinance) Index yet, but it's likely that such an index would have performed exceptionally well. I'll instruct the data team to work on creating one.","The bullish case for Solana underpinning this rally has been unfolding for some time, as noted by McCann.","He highlighted the increasing inflows into fund products compared to other assets, growing transaction activity on-chain, and the rising popularity of staking through Jito.","\"The total value moving on chain is the highest it's been all year. And it is not just trading activity that's happening on Solana. NFT activity is also ripping.\"","The data dashboard from The Block shows that non-vote transactions experienced a significant surge last week but have since returned to 19.5 million on Nov. 11. In any case, I will leave it to McCann to make the Solana bull thesis to his LPs and the world writ large.&nbsp;","I am more interested in the way in which it ties into the broader alt-season we are seeing in crypto right now. Dare I call it that. Bitcoin dominance has declined, stablecoin volumes printed last month with highs not seen since March, and spot exchange volumes have been surging.&nbsp;","\"Speculators are entering the market and opting for riskier trades,\" McCann explained.","He noted that this trend began with Solana but has extended to other layer twos and long-tail assets.","In his opinion, a significant portion of these flows is originating from Asia. Historically, Asian investors favored BTC and ETH, but as these cryptocurrencies have become more established, they are now seeking assets with greater upside potential.","Still, one must consider the state of liquidity in crypto. Taking a more cautious perspective on this rally, it's reasonable to consider that we've witnessed price increases in a low-volume environment where even a small spark can ignite a rally.\"","\"Liquidity is like 1\/10th of what it used to be, so you'll often see exaggerated moves,\" one portfolio manager noted in a Telegram DM.&nbsp;","\"Historically we've seen sustainable bull markets in the space when there's a shiny new use case that excited people to come back in and say 'I see the value of blockchains' which inevitably led to the eutrophic thinking,\" he added.&nbsp;","Only time will tell.&nbsp;","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">This first appeared in Frank Chaparro's biweekly The Scoop Newsletter.&nbsp;<a href=\"https:\/\/www.theblock.co\/newsletters\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Sign up<\/a>&nbsp;now.&nbsp;<\/em><\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nov. 5","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"McCann","content":"PERSON"},{"type":"19.5 million","content":"MONEY"},{"type":"Joe McCann","content":"PERSON"},{"type":"Nov. 11","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}