{"summary":"JPMorgan analysts estimate the impact of traders betting on the Grayscale Bitcoin Trust who may want to cash out if it turns into an ETF.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264543\/jpmorgan-gbtc-outflows-estimates-etf-conversion","publishDate":"2023-11-23T16:04:08","id":11130,"type":null,"title":"JPMorgan says GBTC could see outflows of $2.7 billion upon ETF conversion","category":["MARKETS"],"content":["Since the beginning of the year, traders have been buying up shares of the Grayscale Bitcoin Trust — which have been trading at a discount to the underlying value of its bitcoin holdings — likely in the hope of pocketing the difference if it gets converted to a spot bitcoin ETF.","This implies that many of those GBTC traders will be looking to cash out upon its ETF conversion. With this in mind, analysts at JPMorgan looked at GBTC inflows since 2023 to calculate the value of its shares that might be sold upon the conversion. They estimate this figure at around $2.7 billion.","\"To proxy the buying flow into [the Grayscale Bitcoin Trust] since the beginning of the year, we cumulate the daily signed dollar volume, i.e., the daily volume in thousands of shares times the price times the sign of the price change, positive if the price had increased over that day and negative if the price had decreased,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Thursday.","\"This methodology produces an estimate of around $2.5 billion for the net cumulative flow into [the Grayscale Bitcoin Trust] since the beginning of the year. This number increases to close to $2.7 billion if one also adds the covering of the short interest since the beginning of the year,\" they said.","Assuming most of this buying was driven by speculation about the Grayscale Bitcoin Trust becoming an ETF, it is likely that investors will exit as they take profit once it gets converted to an ETF, according to the analysts. The question of outflows arises as investors apparently purchased shares at significant discounts in anticipation of its ETF conversion, intending to profit when the discount to net asset value is arbitraged away upon the conversion. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Grayscale Bitcoin Trust discount to net asset value is <a href=\"https:\/\/www.theblock.co\/post\/264464\/gbtc-discount-to-nav-falls-below-10-per-cent\" data-v-f87c67ca=\"\">currently below<\/a> 10% for the first time since July 2021.<\/span>","The $2.7 billion figure is the minimum outflow the JPMorgan analysts are expecting from the Grayscale Bitcoin Trust upon its ETF conversion. It could be \"significantly more\" if GBTC's current fee of 200 basis points is not lowered sharply after ETF conversion, the analysts said.","\"Once the SEC approves spot bitcoin ETFs in the U.S., we envisage a more intense competition with the average fee for bitcoin ETFs converging towards that of Gold ETFs, which currently stands at around 50 basis points,\" the analysts added.","The ARK 21Shares Bitcoin ETF application has indicated a fee of 80 basis points, which sets the level the Grayscale Bitcoin Trust would have to initially lower its fee towards to avoid more severe outflows and to maintain its dominance as the biggest and most liquid bitcoin fund, the analysts noted. \"Over time, investors tend to lean towards the most cost-effective and the most liquid ETF,\" they said.","If the $2.7 billion amount indeed gets exited completely, then such an outflow would “of course put severe downward pressure on bitcoin prices,” the analysts noted. But they expect most of this amount will be shifted into other bitcoin instruments — such as the newly created spot bitcoin ETFs post-SEC approval — and if so, “then any negative market impact would be more modest.”","This would change the balance of assets in the bitcoin fund space from $23 billion in the Grayscale Bitcoin Trust and $5 billion in other funds to $20 billion in the trust and $8 billion elsewhere, they said. \"Nevertheless, the balance of risks for bitcoin prices is skewed to the downside in our opinion as some of this $2.7 billion is likely to completely exit the bitcoin space,” they added.","JPMorgan reiterated in Thursday's note the comments <a href=\"https:\/\/www.theblock.co\/post\/264283\/jpmorgan-binance-settlement-positive-crypto\" data-v-f87c67ca=\"\">shared<\/a> with The Block on Wednesday that Binance's settlement with U.S. agencies is \"positive\" for the crypto exchange and the industry. Binance's recent market share loss \"should be contained going forward and perhaps partly reverse once the implications from the settlement on Binance's operations and business model become more clear,\" the analysts said.","The Binance settlement would also reinforce an ongoing shift towards regulated crypto entities and instruments, the analysts said, adding that it will help attract the interest of traditional market participants and investors.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$23 billion","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$5 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"$8 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","BITCOIN","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}