{"summary":"Project with close ties to OpenAI CEO Sam Altman taking measure to bolster trust and transparency as Worldcoin keeps growing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284123\/worldcoin-to-end-storing-users-personal-data","publishDate":"2024-03-22T09:00:02","id":11135,"type":null,"title":"Worldcoin seeks to empower users and eliminates option allowing for storage of personal data","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Although <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Worldcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248504\/worldcoin-wld-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/worldcoin.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WLD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.66%\n    <\/span><\/a> <!----><\/span><\/span> has always maintained it is highly protective of peoples' biometric data when scanning their eyeballs to prove they are human, the project is now implementing a plan designed to build additional trust.<\/span><\/span>","<span data-v-f87c67ca=\"\">With the implementation of what Worldcoin calls \"Personal Custody,\" when people sign up for a World ID, they will no longer be given the option to have their biometric data stored and encrypted. Now, instead, the biometric data \"captured by the orb and used to generate the iris code during World ID verification” will be held on people’s own personal devices — in most cases a smartphone — and users then can decide what to do with the data, including deleting it if they choose to.<\/span>","The project's personal custody plan was <a href=\"https:\/\/worldcoin.org\/blog\/announcements\/introducing-world-id-2.0\" data-v-f87c67ca=\"\">first teased<\/a> back in December when Worldcoin announced details for its World ID 2.0, dubbed \"a human passport for the internet.\"","<span data-v-f87c67ca=\"\">Tools for Humanity's Tiago Sada told The Block that the Worldcoin project has always taken privacy seriously, but views the personal custody initiative as an opportunity to bolster the level of trust felt by potential users who have yet to sign up. “Even though everything was deleted by default before, definitely now the fact that users have control over what to do with their data, definitely does give you that peace of mind, not needing to trust anyone,” he added.<\/span>","<span data-v-f87c67ca=\"\">Sada is head of product, engineering and design at Tools for Humanity, the lead <\/span><span data-v-f87c67ca=\"\">software contributor <\/span><span data-v-f87c67ca=\"\">behind the Worldcoin project. Tools for Humanity was co-founded by OpenAI CEO Sam Altman.<\/span>","<span data-v-f87c67ca=\"\">Worldcoin has signed up about 4.5 million people since launching about eight months ago, according to the <\/span><a href=\"https:\/\/worldcoin.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">project’s website<\/span><\/a><span data-v-f87c67ca=\"\">. During that time, it has been scrutinized <a href=\"https:\/\/www.theblock.co\/post\/265939\/looking-back-at-eyeball-scanner-worldcoins-tumultuous-year\" data-v-f87c67ca=\"\">several times<\/a> by different government agencies. Most recently, Spain<\/span><span data-v-f87c67ca=\"\"> <a href=\"https:\/\/www.theblock.co\/post\/282619\/amid-ban-in-spain-worldcoin-argues-it-safeguards-privacy\" data-v-f87c67ca=\"\">banned Worldcoin<\/a> for up to three months as the country’s data protection watchdog investigates the project further. Worldcoin has also come under the microscope for giving out WLD tokens to people who sign up, many of whom reside in less-developed nations.<\/span>","The WLD token's price has more than doubled since the beginning of this year.","<span data-v-f87c67ca=\"\">Previous to the rollout of World ID 2.0 and personal custody, people signing up for Worldcoin had two options: either to have their biometric data immediately deleted by the orb after being verified as human or, with the \"Data Custody\" option, users could allow the project to encrypt and store their private biometric details in \"<\/span><span data-v-f87c67ca=\"\">secure data stores.\"<\/span>","<span data-v-f87c67ca=\"\">\"Data Custody will no longer be offered at the time of your orb visit,\" Worldcoin said in a statement. Now, “the information (images, metadata and derived data) generated at the orb and used to generate the iris code during World ID verification\" will be held on peoples’ personal devices, instead of temporarily on orbs or permanently in data stores.<\/span>","<span data-v-f87c67ca=\"\">\"This approach gives [users] control over the flow of this data, not just deletion, but any future use prior to being deleted. Previously, this information was deleted by default,\" Worldcoin also said in its statement.<\/span>","<span data-v-f87c67ca=\"\">Sada, while adamant that Worldcoin has always taken user privacy seriously, said the elimination of the option to allow Worldcoin to store personal data could allay the fears of people who have yet to sign up. \"<\/span><span data-v-f87c67ca=\"\">Data did used to get deleted by default, but you sort of had to trust us partially,” Sada also told The Block. \"But now you don’t even have to do that. You and only you have control over your data … it definitely can give people more peace of mind.”<\/span>","<span data-v-f87c67ca=\"\">While Worldcoin’s personal custody move may give more people \"peace of mind\" the project is also looking to bolster transparency by making \"the core components of the Orb’s software … publicly available on GitHub,\" the project also announced on Friday.<\/span>","<span data-v-f87c67ca=\"\">\"These new open components complement the previously-released hardware and iris recognition repositories, and their public availability marks significant progress in making the Orb’s image processing transparent and its privacy claims verifiable,\" Worldcoin said in a <a href=\"https:\/\/worldcoin.org\/blog\/engineering\/worldcoin-foundation-open-sources-core-components-orb-software\" data-v-f87c67ca=\"\">blog post<\/a>. \"Today’s release includes all code on the Orb that is essential for capturing images and securely transferring them to World App.\"<\/span>","<span data-v-f87c67ca=\"\">As part of Worldcoin's \"Tech Tree\" development roadmap, the release of the orb software represents one more step towards Worldcoin’s eventual goal to make it possible for people to build their own orbs for human verification.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Humanity","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Tiago Sada","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"Data Custody","content":"ORGANIZATION"},{"type":"Sada","content":"PERSON"},{"type":"eight months ago","content":"DATE"},{"type":"Spain","content":"LOCATION"},{"type":"-0.66%","content":"PERCENT"},{"type":"Friday","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}