{"summary":"Move-to-earn fitness app StepN has denied reports that it has laid off staff. It says the claims are baseless and that it is actively hiring.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176885\/stepn-denies-layoff-reports-hints-at-new-projects","publishDate":"2022-10-13T05:20:40","id":11149,"type":null,"title":"Stepn denies layoff reports, hints at new projects","category":["GAMING AND METAVERSE"],"content":["Move-to-earn fitness app Stepn has denied reports that it has laid off staff.","Earlier this week, reports from South China Morning Post and Wu Blockchain suggested the company laid off over 100 contract workers including community moderators and ambassadors.","On Tuesday a spokesperson for the company told news outlet <a href=\"https:\/\/decrypt.co\/111809\/crypto-fitness-app-stepn-denies-layoff-reports\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Decrypt<\/a> that the claims were baseless and factually inaccurate.","\"The reality is that STEPN has parted ways with volunteer MODs who have not been active in the last few weeks and months. Regarding our staff, STEPN is actively hiring for several different roles within the company,” they said.","Stepn’s popularity has soared since its launch. On its one year anniversary in September, the Solana app revealed users had <a href=\"https:\/\/www.theblock.co\/post\/172123\/users-logged-over-67-million-miles-on-the-move-to-earn-app-stepn-since-launch\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">logged over 67 million miles<\/a> (108,017,738 kilometres) through the app since it launched. It also reported 4.72 million registered users. Since its rise, there have been questions about the company's token model and potential for sustained revenue generation.&nbsp;","In an <a href=\"https:\/\/stepnofficial.medium.com\/an-open-letter-to-the-stepn-community-118bb4696bfa\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">open letter<\/a> to the community on Oct. 11, the company hinted that changes are coming.","“STEPN was our first project; DOOAR followed soon after. Now it’s time to expand the Find Satoshi Lab family. That’s why we’re heads down building. Over the next few weeks, we will be shifting gears as we evolve our vision,” the company said.","Among the changes, the company is also <a href=\"https:\/\/www.theblock.co\/post\/167781\/as-others-flee-stepn-announces-move-to-hong-kong-scmp\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">moving its headquarters<\/a>. Initially based in South Australia, the company announced it would move to Hong Kong’s Cyberport, even as other crypto companies escape a difficult regulatory environment in the city.","The Block has approached Stepn for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Satoshi Lab","content":"PERSON"},{"type":"South China Morning Post","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Oct. 11","content":"DATE"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"South Australia","content":"LOCATION"},{"type":"Stepn","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Wu Blockchain","content":"PERSON"},{"type":"Hong Kong’s Cyberport","content":"LOCATION"}],"hashtag":["LAYOFFS"],"authors":["Callan Quinn","The Block"]}