{"summary":"The approval may be a positive precedent for crypto regulation in other countries, one expert told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286419\/gsr-secures-license-singapore","publishDate":"2024-04-04T02:22:11","id":11146,"type":null,"title":"GSR markets granted &#x27;major payment institution&#x27; license in Singapore","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crypto market maker GSR’s Singapore subsidiary has obtained the major payment institution (MPI) license from the Monetary Authority of Singapore on April 1, the company told The Block on Thursday.<\/span>","<span data-v-f87c67ca=\"\">The Singapore entity, named GSR Markets, said it is the first of its kind to obtain the full MPI license from Singapore authorities, according to<\/span><span data-v-f87c67ca=\"\"> its press release. Currently, <\/span><a href=\"https:\/\/eservices.mas.gov.sg\/fid\/institution?term=GSR\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">19 firms<\/span><\/a><span data-v-f87c67ca=\"\"> engaging in cryptocurrency services or digital payment token services <\/span><span data-v-f87c67ca=\"\">have the MPI license from Singapore, including Paxos, Blockchain.com, Circle and Coinbase.<\/span>","\"We are proud to receive the MPI license from MAS, a regulator that promotes sustainable non-inflationary economic growth, and a sound and progressive financial center,\" GSR Group CEO Jakob Palmstierna said in the release.","<span data-v-f87c67ca=\"\">The approval effectively allows GSR Markets to pursue spot over-the-counter and market making services in Singapore. In September last year, GSR Markets received the <\/span><a href=\"https:\/\/www.theblock.co\/post\/253851\/gsr-in-principle-approval-singapore-payment-institution-license?utm_source=telegram1&amp;utm_medium=social\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in-principle approval<\/span><\/a><span data-v-f87c67ca=\"\"> for the MPI license, where the company said it was grateful to the MAS for its “constructive oversight.”<\/span>","<span data-v-f87c67ca=\"\">“It’s important to note the institutionalization of a crypto market maker,” Kim Hyoung-joong, President of the Korea Fintech Society, told The Block, stating that Asian regulators haven’t been so fond of crypto market makers. “A ‘pump n’ dump’ type of market making has so far been prevalent [in crypto], but when the regulation kicks in, the market will see more traditional ways of market making which will improve its perception.”<\/span>","<span data-v-f87c67ca=\"\">Kim added that this regulatory approval in Singapore may become a positive precedent for regulatory developments in other Asian countries.<\/span>","<span data-v-f87c67ca=\"\">Singapore has recently been revising its rules for digital asset service providers in an aim to&nbsp; grow the city-state as the crypto center of Asia. Hong Kong and Japan have also been pushing or amending rules in an aim to set a clear regulatory framework for crypto companies.<\/span>","<span data-v-f87c67ca=\"\">Earlier this week, the MAS announced that it is <\/span><a href=\"https:\/\/www.theblock.co\/post\/285991\/singapore-widens-crypto-regulation-introduces-enhanced-user-protection-requirements\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">expanding its scope<\/span><\/a><span data-v-f87c67ca=\"\"> of regulated payment services to include custodial services for digital payment tokens (DPT), facilitation of the transmission of DPTs, and facilitation of cross-border money transfers between countries “even where moneys are not accepted or received in Singapore.”<\/span>","<em data-v-f87c67ca=\"\">Updated to add comments from GSR.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DPT","content":"ORGANIZATION"},{"type":"April 1","content":"DATE"},{"type":"Korea Fintech Society","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"MPI","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"September last year","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Jakob Palmstierna","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"GSR Group","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Kim Hyoung","content":"PERSON"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}