{"summary":"Ledger&#x27;s former chief of staff is eyeing a $25 million NFT fund that will acquire &quot;culturally impactful&quot; blockchain artwork.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220102\/ledger-chief-of-staff-nft-art-fund","publishDate":"2023-03-16T08:07:35","id":11144,"type":null,"title":"After leaving Ledger, former chief of staff aims to raise $25 million fund for NFT art","category":["METAVERSE & NFT"],"content":["Former Ledger exec Jean-Michel Pailhon is raising an NFT art fund, hoping to secure up to $25 million from outside investors.","An almost six-year veteran of the crypto wallet maker, Pailhon landed the chief of staff position to Ledger CEO Pascal Gauthier in November 2021 before departing last month, as <a href=\"https:\/\/www.theblock.co\/post\/208366\/ledger-ceos-chief-of-staff-departs-to-work-on-nft-digital-art-project\" data-v-f87c67ca=\"\">reported<\/a> by The Block.","Now, he's focused on setting up what he terms a \"global digital art investment fund\" that looks to bring primarily non-crypto native investors into digital art, Pailhon said over email.","Currently, most NFT investment vehicles feature heavy backing from those who already know their Meebits from their Miladys. Pailhon is aiming to reach past these web3 entrepreneurs to also attract private bankers, family offices, high-net-worth individuals and financial institutions.","\"Our mission is to bring new collectors and new long-term institutional investors into the nascent digital art asset class,\" said Pailhon, who has been in the NFT game for the last three years and has 460 NFTs to his name, according to his <a href=\"https:\/\/opensea.io\/jmpailhon\" data-v-f87c67ca=\"\">OpenSea<\/a> account.&nbsp;","As of last week, Pailhon had $2-3 million in soft commitments from private bankers and family offices and is aiming for a first close at $5 million.&nbsp;","It's not exactly a great time to be raising a crypto fund, let alone an NFT fund. Per a <span class=\"outlook-search-highlight\" data-v-f87c67ca=\"\">Galaxy<\/span> report, the final quarter of last year <a title=\"https:\/\/u22280551.ct.sendgrid.net\/ls\/click?upn=qW-2BWskbkvE8hoYkD9cNmPMTkRRLSX7qKJHx0MY6kHtwjIc-2F3pns8Zt8KDrkkgPE9ci1TV-2F3Nc6h0Ryib99rqc2rCiqLMm896-2FewOPAixw-2Ft1ZopcVyNDc01NvZl219Mqf4po_-2Bd2uvtpCB5qzKAj2uMAW-2FOAnkN30v3SsKGP6IzWssmthhMRNlQ3CG-2FYM2Jljyp9LX8rvCF4HdqkXQOmV9SRXGaCkjHY0xaKMnBX3utldLDnp-2FqoWXzuEVSIeiNCx16iBQheuxVs3rf7RT52JrleRVTkiZgwOyuru7FzXRd2W9ddkNY2UMPTJg-2FnnbmhGkFp0KsgZHrTShPQ7oa-2BKa793x-2By2zr2Cf-2FxhtH4-2B6Stlvd2m3uS-2B5GHkAvPOn-2BVxc0o8QilDCitdFsLJCJm2JK8JTKm6x1HRbk09djVuoXhNHdcVAL3OBw3BeObrm5sqNU-2B-2BAdy5DfW7L1V5n7trCfOBvNtWgjFZrWMAd2yajfydgRyjprHSgvt4A5JpXSgZSOljhVCKwSWXwnu4FfSZBD-2FfFjrDIJW5WIPus-2FDGUSiiSBWQNLoIy46IEDJcCsHeApkMw2f-2Fqdpd8QYg8TBFr0dmTK6Vtn1yH69obIAJULR5OhiLCt36MCePg90VDJu6wiHozzpavzzffQVOP2lWmcovw6KaoWl0Ta0SU790QnWtsnVuCCeCnJcTdbFVQWca-2FsDaDbnLhYCY38A0DHARZoDYAw9PmepYq-2FExBIEfSYzN0SP313wT7LYPmj9gE0WapD29-2B2M2WALNf-2BrOIL3j3xA7JbTt8jQGv2oYoXRvQRDQRcWx6IzK5yACDw5AG8bcqVvoo-2F-2BrRxy9rCBX8x5NFbRr-2F-2BLYztgDWNImPG0C7r0wVcQ-2BkdOyiMcFxgEe5scYadHryHrfNahlVL54uTtiKG15UoNlZHQXeigJlhMJsHqF3UZcO-2BEM5yp8pfjemUYwMkwB8HmdZ01jfTfcN6sQGJvXeNZKODlH8k-2BCI6y3QUwOXU4yZ63vvbDts9w2RIXK1iaiKOiKhP-2F2AXf8QD-2FShy1InZKdcMzmdvqeJ4077gYfD2RUOTHgyTQyDNntQRCtNYyE8iivj5xkZLQc9olfFhsU5aT90slxsbY23vDWb7oNC23Wz-2BpN-2BVdBGVncctrEsaZt\" href=\"https:\/\/www.galaxy.com\/research\/insights\/2022-crypto-vc-comes-down-to-earth\/\" data-v-f87c67ca=\"\">saw<\/a> the smallest amount of capital allocated to crypto VCs since the first quarter of 2021.","Pailhon recognizes that it might be complicated to onboard institutions whose internal investment policies and regulatory restrictions may prevent them from investing in crypto assets. Still, he remains upbeat that institutions that already hold physical art in their offices will come to house blockchain-minted artworks as the size and value of the digital art market balloons.&nbsp;","\"Companies active in traditional industrial sectors like banks or luxury brand companies have been building corporate art collections for decades, if not centuries,\" he said, citing LVMH's Louis Vuitton Foundation and the JPMorgan Chase Art Collection.","He believes that not only his background in <a href=\"https:\/\/www.ledger.com\/blog\/our-new-nft-collection-initiative-to-build-the-future-of-digital-art\" data-v-f87c67ca=\"\">spearheading<\/a> Ledger's NFT art push but also his personal NFT holdings, which he claims have held up \"relatively well\" in value despite the choppy market, will convince such investors to part with their cash.","\"A way for some of those companies to start their discovery journey of digital art can be achieved through an investment in our digital art fund, as it will give them exposure to the underlying asset class,\" he said. \"It will offer them a learning experience to understand the market dynamics and eventually to acquire some digital art by themselves.\"","Pailhon plans to prioritize blockchain-based artwork that he believes will remain \"culturally impactful\" in the next two decades over profile pictures, which have traditionally netted the highest sales. That could be anything from generative art to AI art to photography, he said.&nbsp;","He sees Cryptopunks as an exception to this rule, saying it would consider acquiring NFTs from the collection as they represent \"a unique moment of art, culture and technology embedded into a JPEG.\"&nbsp;","Pailhon will remain primarily based in Paris and is set to be joined by a partner in New York.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"next two decades","content":"DATE"},{"type":"final quarter of last year","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"Jean","content":"PERSON"},{"type":"the first quarter of 2021","content":"DATE"},{"type":"Louis Vuitton Foundation","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Pailhon","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last three years","content":"DATE"},{"type":"$2-3 million","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"Michel Pailhon","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["NEW VC FUNDS","NFT FUNDS"],"authors":["Tom Matsuda","The Block"]}