{"summary":"Hundreds of thousands of MLB fans are expected to snag Candy Digital&#x27;s commemorative NFT tickets next year, says CEO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265271\/crypto-unicorn-candy-digital-converts-thousands-of-baseball-lovers-into-web3-collectors","publishDate":"2023-11-30T10:53:18","id":11145,"type":null,"title":"Crypto unicorn Candy Digital converts thousands of baseball lovers into web3 collectors","category":["ART AND COLLECTIBLES"],"content":["The rampant speculation that caused NFT trading to soar and marquee sports collection NBA Top Shot to rack up more than $200 million in monthly trading during crypto's last bull run may never return, but digital collectibles startup Candy Digital hasn't lost faith that sports fans' love of their favorite teams and players can drive adoption and consumption in the web3 arena.","\"<span data-v-f87c67ca=\"\">This year we will onboard 100,000 new customers to the [Candy Digital] platform through our digital ticketing product,\" the company's CEO Scott Lawin told The Block. \"That’s the most effective way to introduce someone to the space because this is someone that is expressing their fandom by purchasing a ticket and going to a game. And they get an opportunity to get a digital asset and it records that experience.\"<\/span>","On top of selling officially-licensed Major League Baseball collectibles, Candy Digital <a href=\"https:\/\/www.mlb.com\/news\/mlb-candy-offering-new-digital-collectibles-for-2023\" data-v-f87c67ca=\"\">has been offering fans<\/a> commemorative tickets throughout this year.","Lawin predicts that in 2024, through its commemorative ticket campaign, Candy Digital will introduce another 250,000 and 500,000 consumers to digital asset ownership in 2024. He said that most people that visit Candy Digital's platform after going to a baseball game are engaging with web3 for the first time.","<span data-v-f87c67ca=\"\">\"They go to a baseball game and they get an opportunity to redeem a digital, commemorative ticket. They come to the Candy website and then see the opportunity to purchase a pack of digital trading cards,\" he added. \"They open up the pack and they get the same sort of excitement with a much more dynamic asset than a pack of cardboard.\"<\/span>","Whatever they are called, NFTs and digital collectibles have been largely transformed since the bull run sent prices and trading volumes for top-tier collections soaring. While interest in profile-picture NFTs like CryptoPunks and Bored Ape Yacht Club <a href=\"https:\/\/www.theblock.co\/post\/248692\/ethereum-nft-august-2023\" data-v-f87c67ca=\"\">has been waning<\/a> for more than a year, well-funded web3 companies like Candy Digital and Dapper Labs have continued to target sports fans with digital memorabilia NFTs.&nbsp;","Candy Digital launched its Major League Baseball NFT marketplace in early 2022, while Dapper Labs set the gold standard for sports NFTs after trading volumes for its NBA Top Shot collection exceeded $200 million in early 2021.&nbsp;","\"<span data-v-f87c67ca=\"\">Top Shot obviously kind of captured a lot of the early fire and momentum and brought a lot of people into the space. A lot of that was collector driven but a lot of it was speculative,\" said Lawin, adding that while he's confident blockchain-based digital assets will revolutionize sports memorabilia, he doesn't expect the heady days of the 2021 bull run will return any time soon.<\/span>","<span data-v-f87c67ca=\"\">\"I don’t think we’re going to flip a switch and suddenly see $200 million of Top Shots trading each month,\" he said.<\/span>","Candy Digital raised $38.5 million at the start of 2023 after <a href=\"https:\/\/www.theblock.co\/linked\/121632\/nft-startup-candy-digital-raises-100-million-in-series-a-round\" data-v-f87c67ca=\"\">previously raising<\/a> $100 million at a $1.5 billion valuation in October 2o21.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Lawin","content":"PERSON"},{"type":"$38.5 million","content":"MONEY"},{"type":"$1.5 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Scott Lawin","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"[Candy Digital","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Candy Digital","content":"ORGANIZATION"},{"type":"Major League Baseball NFT","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}