{"summary":"House Financial Services Committee Chair Patrick McHenry pushed back against criticism from bankers of stablecoin legislation he’s helped draft in a letter to the influential American Bankers Association last week. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241585\/financial-services-chair-pushes-back-on-bank-criticism-of-stablecoin-bill","publishDate":"2023-07-26T16:28:44","id":11148,"type":null,"title":"Financial Services chair pushes back on bank criticism of stablecoin bill","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry pushed back against criticism from bankers of stablecoin legislation he’s helped draft in a letter to the influential American Bankers Association last week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ABA organized two letters last week in opposition to pieces of the stablecoin framework, expected to be debated by McHenry’s committee on Thursday. The Block obtained a copy of the North Carolina Republican’s push back to that criticism. A spokesperson for McHenry did not immediately respond to a request for comment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">McHenry called the ABA’s criticism of a state approval process for stablecoin issuers “disappointing as it fundamentally misrepresents the text of the legislation.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“You and your members weighed in heavily and the committee responded, including your top priority eliminating access to the Federal Reserve’s master accounts,” McHenry continued, referring to a type of account private financial institutions can hold with the central bank. He added that stablecoin issuers would be subject to the same supervisory and enforcement standards as banks, credit unions, and trusts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In letters to the committee chair sent last week, the ABA, state bankers associations, and two other national trade associations <\/span><a href=\"https:\/\/www.theblock.co\/post\/241353\/bank-objections-over-state-provision-could-complicate-stablecoin-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">criticized parts of the stablecoin bill<\/span><\/a><span data-v-f87c67ca=\"\">, which McHenry has negotiated with his Democratic counterpart Rep. Maxine Waters, D-Calif., and the Biden administration. Buy-in from congressional Democrats and the administration is necessary for any legislation to have a realistic chance at becoming law.<\/span>","<span data-v-f87c67ca=\"\">McHenry concluded his letter to the ABA by arguing that the trade association did not mention ways that the stablecoin bill could benefit its members.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Finally, your letter is silent on the policies that will benefit financial institutions included in the bill,” wrote the Financial Services Committee chair, noting that the stablecoin bill rescinds Securities and Exchange Commission guidance around custody of digital assets, and clarifies that banks can tokenize deposits if they want to. “Banks should be able to fairly compete in the blockchain ecosystem,” he added, before continuing that he wants to continue talking to the ABA about the bill.&nbsp;<\/span>","The stablecoin bill is expected to be debated by the committee McHenry chairs tomorrow. He and and his staff are continuing last-minute negotiations with Democrats to reach a bipartisan consensus on the bill to give it enough momentum to become law. Republicans have intentionally paired the stablecoin legislation with a related but separate effort to overhaul how cryptocurrencies are treated under U.S. financial law. That Republican-led bill has garnered less interest from Democrats, though at least three Democrats on the Financial Services Committee said on Wednesday that they plan to support the market legislation.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Maxine Waters","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"McHenry’s","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"North Carolina","content":"LOCATION"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"American Bankers Association","content":"ORGANIZATION"},{"type":"ABA","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"McHenry","content":"PERSON"}],"hashtag":["HOUSE FINANCIAL SERVICES COMMITTEE"],"authors":["Colin Wilhelm","The Block"]}