{"summary":"Safe launched Core, an open-source stack that integrates account abstraction to simplify smart contract development on the Ethereum blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216198\/safe-launches-new-development-stack-called-core-with-stripe-and-gelato","publishDate":"2023-03-01T10:00:46","id":11147,"type":null,"title":"Safe releases new development stack called &#x27;Core&#x27; with Stripe and Gelato","category":["CRYPTO ECOSYSTEMS"],"content":["Safe, a Swiss-based self-custody infrastructure provider previously known as Gnosis Safe, launched Core, an open-source stack that integrates account abstraction to simplify smart contract development on the Ethereum blockchain.","The new feature separates smart contract functionality from the concept of an externally owned account such as a user wallet, making it easier for developers to create and manage them. Safe Core includes partner solutions from payments giant Stripe and decentralized finance protocol Gelato to enhance its features and simplify transaction fee and payment flow, as well as allow for fiat on-ramping.","Safe co-founder Richard Meissner believes that account abstraction is essential for onboarding new users and improving web3 usability, and thinks that Safe Core will attract more developers to build on Ethereum and contribute to the growth of the web3 ecosystem.","\"With Core, we are putting a modular stack in the hands of developers to grasp this massive opportunity,\" Meissner said. \"We have partnered with the best in the business to improve UX capabilities for on-ramping, relaying, and authentication as part of Safe Core kits.\"","The Safe team said it will run a a month-long hackathon called \"March for Account Abstraction\" to encourage developers to participate and build on Safe Core, with bounties offered by partners including Stripe, Base, Gelato, Web3Auth, Gnosis Chain, Cowswap, and Superfluid.","Safe’s smart contract wallet and custody infrastructure already secures nearly <a href=\"https:\/\/dune.com\/safe\/ethereum\" data-v-f87c67ca=\"\">$40 billion<\/a> in assets across several Ethereum-based apps.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Richard Meissner","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Gnosis Safe","content":"PERSON"},{"type":"Meissner","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Cowswap","content":"ORGANIZATION"},{"type":"Gelato","content":"LOCATION"},{"type":"Gnosis Chain","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}