{"summary":"The promotion represents another avenue famous sports and entertainment brands are trying to engage with fans and monetize their loyalty using digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202653\/lionel-messis-crypto-sponsor-socios-offering-token-holders-chance-to-snag-game-balls","publishDate":"2023-01-16T15:43:30","id":11141,"type":null,"title":"Lionel Messi’s crypto sponsor Socios offering token holders chance to snag game balls","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Socios, the company with World Cup-winner Lionel Messi as its global ambassador, is trying to score with fans by offering them a chance to win balls used to score goals. But you'll have to pay to play.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The company announced that fans who own enough tokens purchased through Socios will have the chance to win a “game-used” ball from Wednesday’s upcoming Italian Super Cup between AC Milan and Inter. To be eligible, users have to possess both enough of the requisite number of either teams’ fan token plus Socios tokens. If eligible, fans will then compete in an auction.<\/span>","<span data-v-f87c67ca=\"\">Major brands across entertainment and sports are ramping up efforts to engage with fans through digital assets as volumes for famous and artistic non-fungible token (NFTs) collections have dropped dramatically over the last several months. NFTs are viewed as a way to spur engagement by providing incentive for fans to acquire tokens that hold the potential for perks like access to special events, exclusive content or merchandise.<\/span>","<span data-v-f87c67ca=\"\">Last week, Warner Bros. Discovery <a href=\"https:\/\/www.theblock.co\/post\/201081\/game-of-thrones-nft-collection-sells-out-in-7-hours-despite-weird-avatar-hands\" data-v-f87c67ca=\"\">dropped<\/a> a “Game of Thrones” NFT collection that sold out in seven hours. Former U.S. President Donald Trump’s digital trading card <a href=\"https:\/\/www.theblock.co\/post\/201600\/new-trump-nft-collection-lets-users-buy-zoom-access-to-donald-trump\" data-v-f87c67ca=\"\">drop gave collectors<\/a> a chance to win a dinner or Zoom call with the politician and entrepreneur. <\/span>","<span data-v-f87c67ca=\"\">Socios said in a statement that after a ball has been used to score a goal during the AC Milan-Inter match, it “<\/span><span data-v-f87c67ca=\"\">will be collected by match officials” and fitted with a chip that will act “as a certificate of authenticity.” The company also said that whoever wins the ball will have their ownership authenticated with the chip to help to avoid the threat of counterfeiting. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warner Bros","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Milan","content":"LOCATION"},{"type":"AC Milan and Inter","content":"ORGANIZATION"},{"type":"Lionel Messi","content":"PERSON"},{"type":"Inter","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}