{"summary":"Canada&#x27;s Office of the Superintendent of Financial Institutions is asking banks for comments on how they should report their crypto exposure. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263829\/canadian-regulator-asks-banks-for-feedback-about-crypto-reporting-rules","publishDate":"2023-11-20T12:18:13","id":11152,"type":null,"title":"Canadian regulator asks banks for feedback about crypto reporting rules","category":["INTERNATIONAL POLICYMAKING"],"content":["Canada's banking regulator, the Office of the Superintendent of Financial Institutions (OSFI), is <a href=\"https:\/\/www.osfi-bsif.gc.ca\/Eng\/osfi-bsif\/med\/Pages\/crypto-231129-nr.aspx\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">calling<\/a> for comments about guidelines for how banks should report crypto exposure.","\"Digital innovation is transforming how we transact, manage money, and view value but poses risks to our financial system,\" the OSFI said in a <a href=\"https:\/\/www.newswire.ca\/news-releases\/osfi-seeks-feedback-on-disclosure-of-crypto-asset-exposures-892285853.html\" data-v-f87c67ca=\"\">statement<\/a>. \"Recent crypto events underscore risks of unregulated financial innovation. Public disclosures enhance transparency, comparability of data, and market discipline for a safer financial system.\"","Draft guidelines are scheduled to be published by the fall of 2024, with final rules to be communicated the following year. The effort comes as the Basel Committee on Banking Supervision is seeking feedback from internationally active banks through its own consultation.","The OSFI said it intends to combine feedback received though its consultation with developments coming from the BCBS. Specifically, the regulator asked for feedback about three questions.","\"What, if any, technical aspects of the BCBS disclosure tables and templates should be amended for banks and insurers in the Canadian context?\" it wrote. \"What key considerations should we factor in to ensure proportionality of disclosures?\"","\"What other considerations raised by the BCBS consultation should we keep in mind in developing Canadian disclosure expectations?\" the regulator continued.&nbsp;","Comments are due by Jan. 31.","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Office of the Superintendent of Financial Institutions","content":"ORGANIZATION"},{"type":"Basel Committee on Banking Supervision","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jan. 31","content":"DATE"},{"type":"OSFI","content":"ORGANIZATION"},{"type":"fall of 2024","content":"DATE"}],"hashtag":[],"authors":["Anna Baydakova","The Block"]}