{"summary":"The developers of decentralized exchange Curve Finance have released code and a whitepaper for the crvUSD stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189140\/curve-releases-whitepaper-and-official-code-for-its-stablecoin","publishDate":"2022-11-22T10:54:54","id":11157,"type":null,"title":"Curve releases whitepaper and official code for its stablecoin","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">The developers of decentralized exchange Curve Finance have released <a href=\"https:\/\/github.com\/curvefi\/curve-stablecoin\/tree\/master\/doc\" data-v-f87c67ca=\"\">code<\/a> and official documents for Curve's soon-to-be launched decentralized stablecoin called crvUSD.<\/span>","<span data-v-f87c67ca=\"\">While an official announcement from Curve is still pending, the repository published on the projects’ official GitHub account shows the project is all set to finish work on its crypto-backed stablecoin that's soft-pegged to the US dollar.<\/span>","<span data-v-f87c67ca=\"\">Per the <a href=\"https:\/\/github.com\/curvefi\/curve-stablecoin\/tree\/master\/doc\" data-v-f87c67ca=\"\">whitepaper<\/a>, authored by Curve Finance founder Michael Egorov, crvUSD will have similar functionality to MakerDAO’s stablecoin called DAI. Matching DAI, it will be overcollateralized with crypto assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The whitepaper states that users will be able to mint the stablecoin by depositing excess collateral in the form of a cryptocurrency loan in a reserve, a mechanism called a collateralized debt position (CDP).<\/span>","<span data-v-f87c67ca=\"\">The stablecoin will also rely on a novel algorithm dubbed Lending-Liquidating AMM (LLAMMA), which will work to continuously liquidate and sell the deposited collateral to better manage potential collateralization risks.<\/span>","<span data-v-f87c67ca=\"\">Egorov first <\/span><a href=\"https:\/\/www.theblock.co\/post\/158998\/curve-finance-founder-implies-a-stablecoin-is-on-its-way\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hinted<\/span><\/a><span data-v-f87c67ca=\"\"> the project was working on a stablecoin in July. The stablecoin will complement Curve DAO tokens (CRV), the native token of Curve, which are issued as rewards to liquidity providers on Curve Finance. CRV tokens can be locked to participate in governance and receive protocol revenue. Crypto-backed stablecoins account for more than <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\" data-v-f87c67ca=\"\">$7 billion<\/a> in total market capitalization, according to data aggregated by The Block.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-crypto-backed-and-algorithmic-stablecoin-supply\/embed\" title=\"Total Crypto-backed and Algorithmic Stablecoin Supply on Ethereum\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"$7 billion","content":"MONEY"},{"type":"CRV","content":"ORGANIZATION"},{"type":"Michael Egorov","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"}],"hashtag":["DAI"],"authors":["Vishal Chawla","The Block"]}