{"summary":"While PayPal said the stablecoin would be rolling out starting today, its website didn&#x27;t immediately show an option to purchase PYUSD.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243647\/paypal-stablecoin","publishDate":"2023-08-07T17:49:17","id":11151,"type":null,"title":"PayPal stablecoin faces questions about usefulness, gas fees and old tech","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">After at least two years of deliberation, development and delays, digital payment giant PayPal finally <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">launched<\/a> its own U.S. dollar stablecoin that will allow users to “<\/span><span data-v-f87c67ca=\"\">buy, sell, hold, and transfer” the token on its platform.&nbsp;<\/span><span data-v-f87c67ca=\"\">That just might not sound like much, since that's basically what people can already do with a checking account or existing PayPal account holding U.S. dollars.<\/span>","\"What can you do with PayPal USD (PYUSD) on PayPal?\" the company asked in an explainer posted on its <a href=\"https:\/\/www.paypal.com\/myaccount\/crypto\/\" data-v-f87c67ca=\"\">website<\/a>, stating that the token could be sent to eligible accounts in the U.S. without any fees. It can also be used for online shopping, just as you would use regular dollars or a credit card.","\"If you’re looking to change things up, use PYUSD in our convert feature to buy the different cryptos we support,\" the company added.","While PayPal said the stablecoin would be rolling out starting today for eligible U.S. customers, it's website didn't immediately show an option to purchase PYUSD when checked by The Block. Its website requires a user to supply a Social Security number in order to access crypto services.&nbsp;&nbsp;","The company said it will allow users to acquire PYUSD and then convert the funds into bitcoin and ether using an \"exchange rate [that] includes a spread that PayPal earns on each purchase and sale.\"","Users on social media also questioned just what the token could be used for and who might want it.","“Who would buy&nbsp;PayPal's stablecoin?”&nbsp;<a href=\"https:\/\/twitter.com\/ShieldifyAnon\/status\/1688613707587186688?s=20\" data-v-f87c67ca=\"\">asked<\/a> a self-proclaimed smart contract researcher on the social network formerly known as Twitter who goes by <a href=\"https:\/\/twitter.com\/ShieldifyAnon\" data-v-f87c67ca=\"\">@ShieldifyAnon<\/a>, pointing out, among other things, that the payment firm’s new stablecoin “uses an old version of Solidity from 2018.”","Other users including <span data-v-f87c67ca=\"\">@0xCygaar, <\/span>a software engineer who often talks about crypto on the social media platform,<span data-v-f87c67ca=\"\">&nbsp;<a href=\"https:\/\/twitter.com\/0xCygaar\/status\/1688592430315036672?s=20\" data-v-f87c67ca=\"\">raised questions<\/a> about how <\/span><span data-v-f87c67ca=\"\">PayPal’s new token <\/span><span data-v-f87c67ca=\"\">allows the “owner to pause all transfers … freeze addresses to prevent actions … [and] admins to increase the total supply at will.”<\/span>","<span data-v-f87c67ca=\"\">The decision to issue PYUSD on Ethereum raised more than few eyebrows, with some saying the choice was a watershed moment for the protocol.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“PayPal has 430 million active accounts,” Bankless Founder Ryan Sean Adams <a href=\"https:\/\/twitter.com\/RyanSAdams\/status\/1688586469370216450?s=20\" data-v-f87c67ca=\"\">posted<\/a>. “Sleep on this if you want. Ethereum is becoming the money layer of the internet.”<\/span>","<span data-v-f87c67ca=\"\">But others <a href=\"https:\/\/twitter.com\/Coop_Daniels\/status\/1688580551232684032\" data-v-f87c67ca=\"\">questioned<\/a> the strategy, considering how costly it can be to transact using Ethereum.<\/span>","<span data-v-f87c67ca=\"\">“PayPal launching a stablecoin on mainnet ETH, rather than literally dozens of rollups that cost two cents, they could have used instead, is honestly a brilliant way to ensure their own exorbitant fees look like an inconsequential speck next to the gas,” <a href=\"https:\/\/twitter.com\/divine_economy\/status\/1688570622131990528\" data-v-f87c67ca=\"\">wrote<\/a> web3 enthusiast David Phelps.<\/span>","PayPal itself seemed to acknowledge the possibility of high feels outside of its ecosystem.&nbsp;&nbsp;","\"Quick heads up on buying PYUSD though–you might find different prices and fees when you buy it outside of PayPal,\" it wrote in the explainer about the token.&nbsp;","PayPal has been active in crypto for some time and allows customers to hold cryptocurrencies such as bitcoin, bitcoin cash, ether and litecoin. In this year’s first-quarter earnings, the company revealed it was safekeeping nearly $1 billion in crypto for its customers.","Since <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/linked\/150437\/paypal-adds-new-crypto-services-including-transfers-to-other-wallets\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/linked\/150437\/paypal-adds-new-crypto-services-including-transfers-to-other-wallets\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">last year<\/a>, users have been able to transfer crypto between PayPal and other wallets.","The company&nbsp;<a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/232762\/paypal-ventures-invests-in-web3-onboarding-startup-magic\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/232762\/paypal-ventures-invests-in-web3-onboarding-startup-magic\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">has also invested<\/a> in blockchain startups including recently leading a round of investment into Magic, a digital-wallet provider that helps companies migrate customers to web3.","The Block <a href=\"https:\/\/www.theblock.co\/post\/103617\/paypal-has-held-exploratory-talks-about-launching-a-stablecoin-sources\" data-v-f87c67ca=\"\">reported<\/a> in 2021 that PayPal had made the rounds among some of the industry’s stablecoin protocol developers as it began exploring its own dollar-pegged token.","At the time, the crypto industry was riding comparatively high with billions of dollars in fresh capital pouring into the industry, and a series of disastrous bankruptcies and regulatory actions had also yet to occur. PayPal's stablecoin ambitions <a href=\"https:\/\/www.theblock.co\/post\/210710\/paypal-pauses-stablecoin-project-amid-paxos-probe-bloomberg\" data-v-f87c67ca=\"\">hit a snag<\/a> earlier this year, and it paused its plans amid <a href=\"https:\/\/www.theblock.co\/post\/210370\/paxos-facing-probe-by-new-york-regulator-coindesk\" data-v-f87c67ca=\"\">reports<\/a> about a probe of Paxos.","Despite the scrutiny, Paxos has remained a PayPal partner in the launch of the payment firm's stablecoin. It said on Monday that the partnership was a milestone for the industry.&nbsp;","\"PYUSD is the first of its kind, representing the next phase of U.S. dollars on the blockchain,\" Paxos wrote, calling it the \"world’s safest dollar-backed digital asset.\"","As expected, the news wasn't welcomed by all crypto enthusiasts, and<span data-v-f87c67ca=\"\"> Blockware Solutions Head Analyst Joe Burnett didn’t mince his words about the launch.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">The crypto community cheering on Paypal for launching a USD ‘stablecoin’ is a sign they have completely lost the plot,” he <a href=\"https:\/\/twitter.com\/IIICapital\/status\/1688620657934786560?s=20\" data-v-f87c67ca=\"\">wrote<\/a>. “Buy bitcoin. Hold it in cold storage. That is the innovation. Not ‘Dollars on blockchain by big tech.”<\/span>","<span data-v-f87c67ca=\"\">PayPal and Paxos did not immediately respond to questions about the launch of the stablecoin from The Block.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"Paxos","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Paypal","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Ryan Sean Adams","content":"PERSON"},{"type":"Blockware Solutions Head","content":"ORGANIZATION"},{"type":"David Phelps","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Joe Burnett","content":"PERSON"},{"type":"two cents","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}