{"summary":"Stablecoins that earn yield are now a reality. You can now earn interest on a stablecoin, while using it in high yielding DeFi projects or as collateral for margin trading on exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84637\/coinflex-sponsored","publishDate":"2020-11-17T14:02:11","id":11153,"type":null,"title":"CoinFLEX launches the first interest bearing stablecoin","category":["SPONSORED"],"content":["<b data-v-f87c67ca=\"\">CoinFLEX launches the first interest bearing stablecoin<\/b>","<span data-v-f87c67ca=\"\">There are over $22 billion dollars of stablecoins currently in the market that pay 0% interest. Is that a missed opportunity? Surely, there are better opportunities out there? We also see that many traders and investors seek double-digit yield from borrow-lend desks, derivatives and DeFi projects. But what risks are they taking on?<\/span>","<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">flexUSD Marks CoinFLEX’s Entrance into the Borrowing, Lending and Stablecoin Space<\/i><\/b>","<span data-v-f87c67ca=\"\">Stablecoins that earn yield are now a reality. You can now earn interest on a stablecoin, while using it in high yielding DeFi projects or as collateral for margin trading on exchanges. It is the first time these crypto native USD yields are accessible without a lockup of funds. Hold onto your private keys and still earn yield.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">CoinFLEX has announced the launch of flexUSD, an interest bearing stablecoin that will lend in CoinFLEX’s repo market and pay interest on the blockchain every eight hours. flexUSD is live on Ethereum as an ERC20 token and the Bitcoin Cash network as an SLP token.<\/span>","<span data-v-f87c67ca=\"\">flexUSD will be integrated across many DeFi platforms and the end result is that everyone will now have the same opportunities as large trading firms and institutions to participate in a wide range of interest rate and credit investment opportunities in crypto markets<\/span>","<span data-v-f87c67ca=\"\">Customers can create flexUSD on <\/span><a href=\"https:\/\/coinflex.com\/flexassets\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">coinflex.com\/flexassets<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">CoinFLEX Repo Market Traded $445M Since June Launch<\/i><\/b>","<span data-v-f87c67ca=\"\">CoinFLEX is the world’s first physically delivered cryptocurrency futures exchange. But, as of today, newly launched interest rate futures allow repo borrowers to lock in fixed rate 1 month – 12 month loans via a one-click borrowing tool. These rates will trade directly on a central limit order book, making them publicly accessible and tradable by any customer. Pretty cool?<\/span>","<span data-v-f87c67ca=\"\">CoinFLEX also plans to enter into the unsecured borrowing market through the listing of company-specific tokens to provide a transparent way for borrowers and lenders to directly transact with each other via an orderbook and the blockchain.<\/span>","<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">How to participate?<\/i><\/b>","<span data-v-f87c67ca=\"\">Prospective traders and investors can access CoinFLEX by registering online at <\/span><a href=\"https:\/\/coinflex.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/coinflex.com\/<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">About CoinFLEX<\/b>","<span data-v-f87c67ca=\"\">Founded in 2019, by Mark Lamb and Sudhu Arumugam, CoinFLEX (Coin Futures and Lending Exchange) is the world’s first physically delivered cryptocurrency futures exchange, developed to provide avenues for investors to trade and hedge cryptocurrency exposure with minimal index or price settlement risk.<\/span>","\n<span data-v-f87c67ca=\"\">More information regarding flexUSD can be found online at <\/span><a href=\"http:\/\/coinflex.com\/flexusd\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">coinflex.com\/flexusd<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>"],"entity":[{"type":"$22 billion dollars","content":"MONEY"},{"type":"Sudhu Arumugam","content":"PERSON"},{"type":"Stablecoin Space","content":"ORGANIZATION"},{"type":"Since June Launch","content":"ORGANIZATION"},{"type":"Mark Lamb","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"},{"type":"$445M","content":"MONEY"},{"type":"SLP","content":"ORGANIZATION"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}