{"summary":"Former CFTC chair J. Christopher Giancarlo advocated again for the development of a “digital dollar” in a Senate hearing focused on economic competition with China. China is widely expected to be the first major economy to issue a sovereign digital currency as early as this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/72617\/giancarlo-pitches-congress-on-piloting-a-digital-dollar-in-the-u-s","publishDate":"2020-07-22T12:58:32","id":11160,"type":null,"title":"Giancarlo pitches Congress on piloting a &#x27;digital dollar&#x27; in the U.S.","category":["CHINA"],"content":["<span data-v-f87c67ca=\"\">The development of a digital version of the U.S. dollar must entail many facets, and the best way to start would be through a series of pilot programs that examine specific applications. That’s what former Commodity Futures Trading Commission chair J. Christopher Giancarlo told the Senate banking committee’s subcommittee on economic policy in a hearing today.<\/span>","<span data-v-f87c67ca=\"\">Giancarlo, who has emerged <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/66832\/giancarlo-now-is-the-time-for-the-u-s-to-jump-into-the-digital-currency-game\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as a leading advocate for the “digital dollar”<\/span><\/a><span data-v-f87c67ca=\"\"> since his term at the CFTC ended in April 2019, testified at <a href=\"https:\/\/www.banking.senate.gov\/hearings\/us-china-winning-the-economic-competition\" data-v-f87c67ca=\"\">a hearing<\/a> focused on economic competition between the U.S. and China.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">China is widely expected to be the first major economy to issue a sovereign digital currency as early as this year, a prospect that some national security experts have suggested could pose a threat to the U.S. dollar’s dominance over the global financial system. But the question of whether the U.S. needs to follow suit is not only a geopolitical one, according to Giancarlo.<\/span>","<span data-v-f87c67ca=\"\">As he has before, Giancarlo stressed that policymakers should view the dollar as a technology in itself. “How do we enhance its technological capability in the world?” he asked. “This is what China is experimenting with today in their own currency, to make it technologically superior by making it digital, tokenizable, fractionalizable, and programmable.”<\/span>","<span data-v-f87c67ca=\"\">America needs to start experimenting too, Giancarlo said. Earlier this month, during <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/70152\/senators-digital-dollar-hearing\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a hearing of the full banking committee<\/span><\/a><span data-v-f87c67ca=\"\">, he proposed that the Department of Treasury start conducting pilots. This time, when pressed by economic policy subcommittee chair Tom Cotton, he got a bit more specific.<\/span>","<span data-v-f87c67ca=\"\">First, he said, to “future-proof” the dollar, the U.S. has to approach a potential technological upgrade in “the same way we explored space, with a series of deliberate pilot programs with each one building on the one before.” Giancarlo said the pilots should focus on issues such as privacy, financial inclusion, areas that are “underserved by banks,” wholesale payments, and international payments. “There are so many elements of this,” he said.<\/span>","<span data-v-f87c67ca=\"\">He went further: “We could do discrete programs in, say, one Fed regional area that’s focused on rural issues. We could do another one in another area focused on inner city issues. We could do another on global remittances.”<\/span>","<span data-v-f87c67ca=\"\">“There’s so much that we need to look at,” said Giancarlo. “We could gather that information on that and build something that would be durable and long-lasting.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Giancarlo","content":"PERSON"},{"type":"J. Christopher Giancarlo","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Department of Treasury","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tom Cotton","content":"PERSON"},{"type":"April 2019","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Orcutt","The Block"]}