{"summary":"The digital asset-focused financial services firm said the wider loss was related to unrealized declines on digital assets and on investments in its trading and principal investments businesses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162031\/galaxy-digitals-554-million-loss-triples-from-a-year-ago","publishDate":"2022-08-08T07:54:00","id":11162,"type":null,"title":"Galaxy Digital&#x27;s $554 million loss triples from a year ago","category":["CRYPTOCURRENCY"],"content":["Galaxy Digital reported a loss of more than $554 million for the second quarter, compared to a&nbsp;$182.9 million loss in the prior year period&nbsp;amid a tumble in crypto asset prices.","The digital asset-focused financial services firm said the wider loss was related to unrealized declines on digital assets and on investments in its trading and principal investments businesses. It was partially offset by profitability in mining.&nbsp;","Partners' Capital decreased 27% quarter-over-quarter to $1.8 billion, from $2.5 billion, as the total cryptocurrency market capitalization dropped about 56% during the quarter.","The company maintained a liquidity position of $1.5 billion, including $1 billion in cash and a net digital asset position of $474.3 million, with $256.2 million of that net digital asset position held in non-algorithmic stablecoins.","As of June 30, net digital assets3 were $474 million, compared to $910 million as of March 31. The decrease in net digital asset3 position was primarily driven by selling-out of certain liquid positions to increase its cash position, and overall decreases in digital asset prices.","\"We remain in [a] strong position to weather prolonged volatility, and to take advantage of strategic opportunities to grow Galaxy in a sustainable manner,\" said Michael Novogratz, Founder and CEO of Galaxy Digital.","Galaxy Digital Asset Management reported preliminary assets under management of nearly $1.7 billion as of June 30, a 40% decrease from the quarter ended March 31, 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"June 30","content":"DATE"},{"type":"$182.9 million","content":"MONEY"},{"type":"$474 million","content":"MONEY"},{"type":"March 31, 2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"56%","content":"PERCENT"},{"type":"$910 million","content":"MONEY"},{"type":"$554 million","content":"MONEY"},{"type":"$1.5 billion","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"$1.8 billion","content":"MONEY"},{"type":"March 31","content":"DATE"},{"type":"Michael Novogratz","content":"PERSON"},{"type":"27%","content":"PERCENT"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Galaxy Digital Asset Management","content":"ORGANIZATION"},{"type":"second quarter","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$474.3 million","content":"MONEY"},{"type":"$256.2 million","content":"MONEY"}],"hashtag":["EARNINGS"],"authors":["Christiana Loureiro","The Block"]}