{"summary":"Today&#x27;s event makes Sudoswap the latest crypto project to issue its own token with a retroactive reward.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167366\/nft-marketplace-sudoswap-unveils-governance-token-and-retroactive-airdrop","publishDate":"2022-09-02T09:15:17","id":11165,"type":null,"title":"NFT marketplace Sudoswap unveils governance token and retroactive airdrop","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">NFT marketplace Sudoswap<\/span><a href=\"https:\/\/blog.sudoswap.xyz\/sudo-distribution.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> revealed<\/span><\/a><span data-v-f87c67ca=\"\"> a new token to help transition the project to a decentralized autonomous organization, a structure in which a community of users can make collective business decisions.<\/span>","<span data-v-f87c67ca=\"\">The Sudoswap team said today that the SUDO token will be used for governance of the marketplace. The team is decentralizing the protocol to its community, something that typically involves a token for crypto projects.<\/span>","<span data-v-f87c67ca=\"\">Launched in July, <a href=\"https:\/\/www.theblockresearch.com\/sudoswap-reconceptualizing-nft-trading-160275\" data-v-f87c67ca=\"\">Sudoswap<\/a> is a rising NFT marketplace with an <a href=\"https:\/\/www.theblock.co\/post\/163497\/an-nft-market-maker-set-0-royalties-sparking-concerns-about-the-future-of-artist-compensation\" data-v-f87c67ca=\"\">automated market maker<\/a> (AMM) model similar to Uniswap. This model uses liquidity pools that allow users to instantly swap between two assets.<\/span>","<span data-v-f87c67ca=\"\">On Sudoswap, any user can create an NFT pool from a particular collection paired with ether. Such pools offer trade quotes to buyers and sellers of NFTs and can instantly swap them for ETH, or vice versa.<\/span>","<span data-v-f87c67ca=\"\">The total supply of SUDO tokens will be 60 million, a portion of which will be distributed as an airdrop to its early contributors and holders of XMON tokens, which are discussed below.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Sudoswap team allocated the 60 million SUDO tokens to be gifted across multiple user categories based on certain criteria. <\/span><span data-v-f87c67ca=\"\">The largest share of the tokens will go to those who lock the crypto token <a href=\"https:\/\/www.coingecko.com\/en\/coins\/xmon\" data-v-f87c67ca=\"\">XMON<\/a>, the native token of an NFT collection called <a href=\"https:\/\/0xmons.xyz\/#\/\" data-v-f87c67ca=\"\">0xmons<\/a> that was previously founded by the Sudoswap team.<\/span>","<span data-v-f87c67ca=\"\">Per the distribution details, 25.12 million SUDO tokens, or 41.9% of the supply, will be up for grabs for XMON token holders who lock their XMON in smart contracts to receive the airdrop. XMON token holders will have to lock their funds for three months, after which they can be withdrawn.<br data-v-f87c67ca=\"\">\n<\/span>","0xmon NFT holders will receive a 1.5% supply, or 900,000 SUDO tokens.","<span data-v-f87c67ca=\"\">The Sudoswap team also announced a retroactive airdrop for its liquidity providers (LPs), which are users who have deposited NFTs and ether to its pools. These LPs will receive a 1.5% supply of SUDO divided equally among them.<\/span>","<span data-v-f87c67ca=\"\">Based on the distribution, 15% (9 million) of the SUDO supply has been set aside for initial team members. Another 15% will be awarded to SudoRandom Labs, the core development company working on the project. These tokens allocated to team members and SudoRandom Labs will be subject to a three-year vesting period and a one-year cliff.<\/span>","<span data-v-f87c67ca=\"\">The last category to receive the tokens is the project treasury, which is set to receive 25.1% or 15.08 million tokens. These funds will be overseen by the community members for growth and expansion activities. At this time, SUDO tokens cannot be claimed and will only be unlocked after a governance vote at a future date.<\/span>","<span data-v-f87c67ca=\"\">Today's event makes Sudoswap the latest crypto project to issue its own token with a retroactive reward.&nbsp; So far this year, other projects including<\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/149464\/optimisms-governance-token-official-goes-live?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Optimism<\/span><\/a><span data-v-f87c67ca=\"\">, CowSwap and<\/span><a href=\"https:\/\/www.theblock.co\/post\/145463\/ethereum-bridge-hop-protocol-unveils-token-and-airdrop-for-early-users\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Hop Bridge<\/span><\/a><span data-v-f87c67ca=\"\"> have also unveiled governance tokens along with airdrop plans for early adopters.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"41.9%","content":"PERCENT"},{"type":"SUDO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"1.5%","content":"PERCENT"},{"type":"25.1%","content":"PERCENT"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"SudoRandom Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}