{"summary":"Binance Labs, the venture capital arm of Binance, has invested $10 million in cross-chain lending and borrowing protocol Radiant Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240713\/binance-labs-10-million-cross-chain-defi-lender-radiant-capital","publishDate":"2023-07-20T09:00:39","id":11167,"type":null,"title":"Binance Labs invests $10 million in cross-chain DeFi lender Radiant Capital","category":["VENTURE CAPITAL"],"content":["Binance Labs, the venture capital arm of crypto exchange Binance, has invested $10 million in cross-chain lending and borrowing protocol Radiant Capital.","The funding round is part of Binance Labs’ “commitment to supporting innovative projects that will lead the next era of DeFi in a chain-agnostic and user-centric manner,” according to a statement.","Radiant is built on top of LayerZero, an interoperability protocol enabling multiple blockchains to communicate with each other. LayerZero developer LayerZero Labs is also part of Binance Labs’ portfolio.&nbsp;","Radiant supports lending and borrowing across chains and currently offers multiple collateral <a href=\"https:\/\/app.radiant.capital\/#\/markets\" data-v-f87c67ca=\"\">options<\/a> on Arbitrum and BNB Chain. The Radiant DAO plans to expand the protocol’s functionality to more Ethereum-compatible chains over time, reducing the need for multiple transactions to facilitate lending, borrowing, bridging and swapping between chains, the team said. Radiant DAO's goal is to consolidate an approximate <a href=\"https:\/\/layerzero.news\/Radiant_Capital\" data-v-f87c67ca=\"\">$22 billion<\/a> of fragmented liquidity currently dispersed across the top ten alternative layers.","\"Radiant Capital's commitment to facilitating seamless cross-chain transactions for DeFi, and performance on Arbitrum and BNB Chain demonstrates its potential for driving mass adoption,\" Binance co-founder and head of Binance Labs Yi He said. \"We look forward to seeing Radiant's continued growth and further contributions to the ecosystem.\"","The funding round will fuel further product developments, including extending oracle support, expanding collateral options, deploying on the Ethereum mainnet and full LayerZero messaging support, the team added. $5 million will go to the DAO and $5 million to Radiant product development.","\"Radiant Capital's mission is to usher in a new era of DeFi focused on providing a seamless, secure and easy-to-use omnichain lending experience,” Radiant Capital core contributor George McCallan said.","Radiant is ranked the top lending protocol and the third largest overall on Arbitrum, with <a href=\"https:\/\/defillama.com\/chain\/Arbitrum\" data-v-f87c67ca=\"\">$191.7 million<\/a> in total value locked (TVL), according to DefiLlama data. It is the second largest lending protocol and eighth DeFi protocol overall on BNB Chain, with <a href=\"https:\/\/defillama.com\/chain\/BSC\" data-v-f87c67ca=\"\">$72.9 million<\/a> TVL.","<em data-v-f87c67ca=\"\">Updated with details on the funding split and McCallan's title.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"George McCallan","content":"PERSON"},{"type":"$72.9 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Binance Labs Yi He","content":"ORGANIZATION"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Radiant DAO","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$191.7 million","content":"MONEY"},{"type":"Radiant Capital","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"$22 billion","content":"MONEY"},{"type":"$5 million","content":"MONEY"}],"hashtag":["ARBITRUM","BINANCE","BNB CHAIN","LENDING","STRATEGIC INVESTMENTS"],"authors":["James Hunt","The Block"]}