{"summary":"Our lives have become increasingly digitized and improvements in technological education have led to increased scrutinization of the critical infrastructure that commonly-used internet applications are built on. Users are requesting that applications be designed to empower them, and they want to be able to efficiently move their digital accounts and data across space and time, without boundaries.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157342\/interoperability-in-web3","publishDate":"2022-07-20T09:00:04","id":11177,"type":null,"title":"Interoperability in Web3","category":["SPONSORED"],"content":["<strong data-v-f87c67ca=\"\">The Crypto Era of the Future<\/strong>","Web3, a term used to refer to the next epoch of the internet, is evolving on top of blockchain technology. Blockchain offers a new approach for data producing, distributing and processing. Interoperability refers to the interconnectedness we need to enjoy using it.","Our lives have become increasingly digitized and improvements in technological education have led to increased scrutinization of the critical infrastructure that commonly-used internet applications are built on. Users are requesting that applications be designed to empower them, and they want to be able to efficiently move their digital accounts and data across space and time, without boundaries.","Empowering users is at the core of the value propositions for Web3 &amp; interoperability.","<strong data-v-f87c67ca=\"\">Web3 &amp; Decentralization<\/strong>","To better understand Web3, it is important to understand its competitive advantage relative to Web2, which is decentralization. A system is considered centralized if it is controlled by a minority of participants. If all participants are equally contributing to the system, it is decentralized.","Centralized system may be more efficient, offer a good user experience and provide advanced services based on the data analytics of their users. However, a decentralized system can reduce the risk of leading nodes being compromised or corrupt, also known as a single-point-of-failure, making the system more robust and secure and offering users’ sovereign ownership of their data.","<strong data-v-f87c67ca=\"\">Ownership of Data<\/strong>","Decentralized systems offer users robustness, security and ownership of their data. Most popular internet applications today work on top of centralized systems and hold custody of their users’ data. This centralized architecture gives these applications the authority to control and manipulate users’ information and forces users to trust the service providers to take good custody of their assets and data.","Web3 offers an alternative by offering users the right to claim ownership of their accounts, assets and data. Real ownership of a digital asset means that there is a technological guarantee, based on cryptography, that only the owner can access it or use it. Even if a web service is storing the asset or data, they can only store it and do not have access to it.","<strong data-v-f87c67ca=\"\">Interoperability in Web3<\/strong>","Interoperability is the means of exchanging and making use of information across computer systems and software. In the case of a centralized network that offers a broad range of applications, interoperability can be achieved by enabling access permissions to centrally stored data. Users can benefit from this interoperability in various ways, such as shared account information that enables faster login across applications.","In Web3, with decentralized networks and sovereign ownership of accounts and data, users become independent of these intermediaries. Users will nevertheless continue to expect and desire the convenience that comes with a variety of applications exchanging and using their data.","In order to achieve interoperability across heterogeneous blockchain, several techniques have been developed. Here, we will present three technical solutions for cross-chain transactions, analyze their characteristics and discuss potential risks. These three solutions are the notary, hash-time lock, and relay models.","<strong data-v-f87c67ca=\"\">The Notary Model<\/strong>","The most intuitive approach for achieving interoperability across chains is to set a trusted third party, such as a notary, to coordinate the cross-chain operations by being responsible for the verification and forwarding of cross-chain transactions. Two types of notaries may be used; a single-signature notary or a multi-signature notary.","A single-signature notary, also known as a centralized notary, collects transaction data from the source chain, validates it and initiates the execution of the transaction on the target chain. It is a simple model with high processing speed. However, its disadvantage is its vulnerability to the failure or misbehavior of a single node.","","","With a multi-signature notary, a cross-chain request, initiated by ‘Account A’ in ‘Blockchain 1’ needs to be successfully verified by the majority of notaries. Once verified, the signatures are published on the corresponding transaction to be executed on ‘Blockchain 2’. In order to tolerate Byzantine faults, the cross-chain transactions can be processed only if more than two-thirds of notaries achieve consensus and sign the transaction.","<strong data-v-f87c67ca=\"\">Hash-Time Lock<\/strong>","Blockchain 2.0 has provided, for the first time, a reliable decentralized execution environment for smart contracts that automate asset management under trustless conditions. Smart contracts are automated protocols controlled by code, providing read and write functions as user interfaces, and triggering specific operations based on the users’ transactions, that operate in a trustless environment.","","","The hash time lock model is a cross-chain technology deployed by smart contracts. The specific process is as follows:","The hash time lock model effectively solves the trust problem inherent in the cross-chain process. As long as the initiator maintains confidentiality of the random number S and the time window, (T1 - T2) offers sufficient time for the responder to unlock the assets, both parties can realize a cross-chain transaction in a decentralized manner.","<strong data-v-f87c67ca=\"\">The Relay Model<\/strong>","The relay model for cross chain transactions is an abstraction of cross-chain operations where the data verification in the cross-chain process is abstracted into a consensus problem at the relay layer. A blockchain with improved scalability is developed on this abstraction layer and a third blockchain, the relay chain, then emerges for interoperability.","In the relay model, a series of relay nodes are deployed in each blockchain network, which are responsible for monitoring and synchronizing the transaction data of that blockchain to the relay chain. The consensus nodes of the relay chain verify the validity of cross-chain transactions and trigger the execution of the corresponding transactions.","","","The figure and listed steps show a typical relay model cross-chain transaction","The consensus mechanism of a relay chain determines the performance and security of the cross-chain service. Classic Byzantine fault-tolerant algorithms, such as PBFT, are able to achieve high throughput under the condition that the supermajority of nodes is correct. Improved versions of Byzantine fault-tolerant algorithms, such as HotStuff, further reduce the complexity of the communication and support a larger scale of nodes participating in consensus.","Relay chains are technically difficult to implement, as they require high levels of engineering complexity, however, they have advantages. Relay chains with smart contracts can form a cross-chain service network, with one relay chain communicating information between multiple blockchains, broadening the scope of value transfer. Poly Network is an example of a successful implementation of the cross-chain relay model.","The relay model realizes an abstraction layer for interoperability, allowing data between heterogeneous blockchains to be exchanged and validated securely. In the case of Poly Network, a relay-chain has been built for more efficient data exchange and validation. Beyond that, there is the possibility for native economies to bloom within Poly Network’s ecosystem thanks to its complete blockchain infrastructure.","<strong data-v-f87c67ca=\"\">The Need for Interoperable Blockchains<\/strong>","In crypto, there has been an ongoing debate as to whether there will be a winner-take-all scenario amongst blockchains, or whether multiple blockchains can coexist. This coexistence is formally referred to as the multichain hypothesis. In recent years, the multichain hypothesis has proven to be true.","Different infrastructure layers have been developed, adding diversity to the previous Ethereum Layer 1 monopoly, illustrated by the charts below.","<strong data-v-f87c67ca=\"\">L1 Market Share (% of Aggregate TVL)<\/strong>","","","Source:<a href=\"https:\/\/defillama.com\/chains\" data-v-f87c67ca=\"\"> Defi Llama<\/a>","These various infrastructure layers have created unique benefits for their respective communities. Interoperability across chains allows these benefits to aggregate by adding synergetic value. For the industry to continue to grow and successfully onboard the masses of internet users, synergy should be maximized. This is why the industry needs bridges such as Poly Network.","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Poly Network<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Time Lock","content":"ORGANIZATION"},{"type":"(%","content":"PERCENT"},{"type":"Defi Llama","content":"LOCATION"},{"type":"Notary Model","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Poly Network","content":"LOCATION"},{"type":"Interoperable Blockchains","content":"ORGANIZATION"},{"type":"Poly Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}