{"summary":"Previously at WhatsApp, Chin said that she was drawn to crypto due to an interest in privacy and digital identity. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205009\/algorand-foundation-hires","publishDate":"2023-01-24T09:00:34","id":11179,"type":null,"title":"Algorand Foundation poaches WhatsApp exec to lead marketing efforts","category":["PEOPLE"],"content":["The Algorand Foundation hired former WhatsApp and Nike exec Jessica Tsai Chin to steer its marketing efforts.&nbsp;","Previously head of brand for global privacy at the Meta-owned messaging app, Chin said in a written interview with The Block that she was drawn to a role in crypto due to an interest in privacy and digital identity.&nbsp;","\"Many web2 companies are having a difficult time embracing the concept of decentralization and data ownership, but there’s a huge opportunity to move in this direction,\" she said \"I believe data privacy needs to be built-in by design and on by default.\"&nbsp;","Her first role in a web3 company, Chin is joining the industry in a period of upheaval. Crypto has been rocked by the collapse of key players, notably crypto exchange FTX and hedge fund Three Arrows Capital. Last week, crypto lender Genesis <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy.&nbsp;","Crypto companies have also previously been <a href=\"https:\/\/www.theblock.co\/post\/196923\/uk-advertising-regulator-bans-crypto-nft-promotions\" data-v-f87c67ca=\"\">criticized<\/a> by advertising watchdogs and regulators alike for their marketing — as misleading claims of future returns attempted to lure in customers.&nbsp;","She sees this time of crisis as an opportunity to reshape how web3 companies market themselves even at a time when the wider non-crypto native public <a href=\"https:\/\/www.cnbc.com\/2022\/12\/07\/just-8percent-of-americans-have-a-positive-view-of-cryptocurrencies-now-cnbc-survey-finds.html\" data-v-f87c67ca=\"\">view<\/a> digital assets in a negative light.&nbsp;","\"Web3 marketing needs to truly lead the charge,\" she said. \"We need to move away from pure hype marketing and move towards a much more authentic, community and human-centered place, boldly leveling the playing field of who gets access to what.\"&nbsp;","As part of this change, she sees opportunities in featuring underrepresented voices to drive conversations around inclusion and representation, which she believes has not been widely covered yet in the web3 space.&nbsp;","\"Both at Meta and Nike, I had the opportunity to feature underrepresented voices and partner with meaningful organizations to drive visibility,\" she said. \"Everything we did drove brand and business impact but also on-the-ground impact for the communities that we serve. The web3 space is ripe for this type of conversation and real-world application.\"&nbsp;","Previously, Algorand has raised its profile with sports deals — for instance, FIFA <a href=\"https:\/\/www.theblock.co\/post\/167512\/fifa-launches-digital-world-cup-collectibles-project-on-algorand\" data-v-f87c67ca=\"\">released<\/a> its digital collectibles project on the blockchain for November's World Cup. Sales volume for the collection currently stands at <a href=\"https:\/\/www.cryptoslam.io\/fifa?tab=historical_sales_volume\" data-v-f87c67ca=\"\">more than<\/a> $400,000 total according to data from CryptoSlam, but has petered out in recent weeks following the event.&nbsp;","Chin said that while sports will remain a key part of Algorand's marketing master plan, she will also focus on highlighting DeFi and social impact projects built on Algorand.&nbsp;&nbsp;","As part of her role, Chin has already hired a head of performance and is looking to bring on a head of communications and a creative director.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Algorand Foundation","content":"ORGANIZATION"},{"type":"$400,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Jessica Tsai Chin","content":"PERSON"},{"type":"Chin","content":"LOCATION"},{"type":"FIFA","content":"ORGANIZATION"},{"type":"Chin","content":"PERSON"},{"type":"Algorand","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["MOVES"],"authors":["Tom Matsuda","The Block"]}