{"summary":"One of Compass Mining&#x27;s hosting partners in Georgia closed down two facilities after a 50% spike in power cost. The machines will be sent to Texas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167040\/compass-mining-hosting-sites-shut-down-in-georgia-due-to-50-power-spike","publishDate":"2022-09-01T11:25:53","id":11173,"type":null,"title":"Compass Mining hosting partner sites shut down in Georgia due to 50% power spike","category":["MINING"],"content":["Bitcoin mining company Compass Mining saw two of its third-party hosting facilities in Georgia shut down this week due to a 50% spike in power prices from local utility providers.","The company was informed Wednesday that the owner would close the sites, a company spokesperson said. Meanwhile, it has decided to relocate those miners to Texas in an effort \"to minimize downtime.\" <a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/01\/bitcoin-mining-middleman-compass-georgia-facilities-to-close-as-energy-prices-soar\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinDesk<\/a> covered the news earlier Thursday.","Compass Mining hosts machines from individual clients in facilities across the US and Canada. It had 15 megawatts of power capacity at the Georgia locations.","\"Client units are tentatively scheduled to be back online by September 30,\" said an email to clients on Wednesday shared by the company. \"Compass Mining will issue facility credits to compensate for hosting costs and associated downtime.\"","Customers can also choose to take back their units, instead of having them redeployed.","The Texas site was recently re-energized, according to <a href=\"https:\/\/compassmining.io\/education\/compass-mining-facility-update-august-20\/\" data-v-f87c67ca=\"\">an update on August 20<\/a> stating that the first customer miners should be deployed by August 23. The facility will have 100 megawatts and Compass' \"allocation of 25 megawatt (MW) is expected to be online by the end of September,\" the email also said.","Meanwhile, Compass is relocating 100 miners from British Columbia to its Labrador facility, also in Canada, due to its hosting partner \"not maintaining performance standards at their facilities up to what Compass requires,\" the company said. \"We made the decision to relocate these miners and they will be re-installed starting next week.\"","In the past three months, the company has tackled a lawsuit, layoffs, and the resignation of its CEO and CFO. It <a href=\"https:\/\/www.theblock.co\/post\/154356\/bitcoin-mining-firms-compass-and-dynamics-spar-over-payments-and-hostage-hardware\" data-v-f87c67ca=\"\">sued one of its other hosting providers<\/a>, located in Maine, in an effort to recover its miners after claims of missed payments. A judge eventually <a href=\"https:\/\/www.theblock.co\/post\/156896\/compass-mining-recovers-machines-from-hosting-provider-following-court-order\" data-v-f87c67ca=\"\">granted Compass access to the machines<\/a>, which the miner claimed had been held \"hostage.\"","Compass Mining's former CEO Whit Gibbs and CFO Jodie Fisher <a href=\"https:\/\/www.theblock.co\/post\/154645\/compass-mining-ceo-and-cfo-resign-as-company-cites-multiple-setbacks-and-disappointments\" data-v-f87c67ca=\"\">stepped down from their positions<\/a> in late June, with the company referring to \"multiple setbacks and disappointments\" getting in the way of its ultimate mission to \"make mining easy and accessible.\"","A few days after the announcement, the company also <a href=\"https:\/\/www.theblock.co\/post\/156439\/compass-mining-cuts-staff-by-15-reduces-salaries-for-senior-employees\" data-v-f87c67ca=\"\">cut staff by 15%<\/a> and reduced salaries by up to 50% in senior positions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Compass Mining","content":"ORGANIZATION"},{"type":"August 23","content":"DATE"},{"type":"Georgia","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"CFO","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"September 30","content":"DATE"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Compass","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"August 20","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"British Columbia","content":"LOCATION"},{"type":"Whit Gibbs","content":"PERSON"},{"type":"Jodie Fisher","content":"PERSON"},{"type":"Maine","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}