{"summary":"A division of Andreessen Horowitz, a16z crypto, has introduced two technologies, Lasso and Jolt, related to ZK proofs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244116\/a16z-crypto-zero-knowledge-proofs-lasso-jolt","publishDate":"2023-08-10T11:00:43","id":11174,"type":null,"title":"A16z crypto introduces Lasso and Jolt to enhance ZK proofs","category":["LAYER 2S AND SCALING"],"content":["The cryptocurrency-focused division of venture firm Andreessen Horowitz, a16z crypto, has unveiled Lasso and Jolt, a pair of new tools based on a type of ZK proofs called SNARKs.","SNARKs are a type of ZK proofs that can potentially facilitate scalable ZK-rollups in the Layer 2 space, which are typically seen as compute-intensive.","Lasso and Jolt are said to offer a more effective approach to SNARK design, potentially making it quicker and more comprehensible for developers, the research team at a16z crypto told The Block. The new techniques are explored in&nbsp;<a href=\"https:\/\/a16zcrypto.com\/posts\/article\/introducing-lasso-and-jolt\/\" data-v-f87c67ca=\"\">two research papers<\/a> that a16z crypto research partner Justin Thaler and the engineering team have developed.","Zero-knowledge protocols enable one party to affirm the truth of a statement to another party without revealing anything beyond the fact itself. This technology is vital in <a href=\"https:\/\/www.theblock.co\/post\/162098\/zk-rollups-likely-to-be-main-layer-2-solution-for-ethereum-says-vitalik-buterin\" data-v-f87c67ca=\"\">ZK-rollups<\/a>, a prevalent Layer 2 scaling solution within the blockchain domain.","Lasso, a16z’s main innovation of the two research papers, employs a “<a href=\"https:\/\/a16zcrypto.com\/posts\/article\/introducing-lasso-and-jolt\/\" data-v-f87c67ca=\"\">lookup argument<\/a>” mechanism that facilitates quicker zero-knowledge proofs. It matches specific inputs with corresponding outputs without disclosing extra information. “Lasso introduces a streamlined approach to verifying SNARKs, avoiding tedious hand-optimized circuits by performing lookups against massive structured tables,” the team noted.","The research team at a16z crypto said that Lasso could significantly increase the overall speed of SNARK provers, attaining a <a href=\"https:\/\/github.com\/a16z\/Lasso\/blob\/master\/src\/benches\/m1_16gb_parallel_benches.log\" data-v-f87c67ca=\"\">tenfold<\/a> performance increase compared to tools like the <a href=\"https:\/\/github.com\/privacy-scaling-explorations\/halo2\" data-v-f87c67ca=\"\">Halo2<\/a> toolchain — thereby being useful in developing faster ZK-rollups.&nbsp;","SNARKs help scale blockchains, like Ethereum, by allowing applications to produce receipts for costly computations off-chain. Despite this, the technology may remain slow and intricate for developers. Lasso seeks to enhance the efficiency of SNARKs, making them potentially more practical compared to current solutions.","Benchmark results shared by the firm highlight Lasso’s significant performance enhancement over current solutions. The team pointed to a potential “10x speedup,” with continuing optimizations that could lead to “40x” improvements. Consequently, the team has suggested that Lasso’s prover technology will outpace all existing zero-knowledge SNARK prover techniques employed by major Ethereum Layer 2 scaling solutions.","Along with Lasso, a16z crypto released Jolt, a framework designed for Ethereum Virtual Machine compatible roll-ups. It’s described as a novel method to build SNARK VMs — a virtual machine execution proved via a SNARK — that utilizes Lasso. This could allow developers to create quicker SNARK-based Layer 2 rollups using their preferred programming languages, the team added.","The Lasso codebase, written in Rust, has been made available on GitHub.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justin Thaler","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"Lasso","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["DEVELOPER TOOLS","ZKEVM"],"authors":["Vishal Chawla","The Block"]}