{"summary":"Derivatives market in the crypto world are heating up with new 2020 records.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55678\/the-force-is-strong-with-the-market-the-crypto-derivatives-market-is-heating-up","publishDate":"2020-02-12T15:31:05","id":11186,"type":null,"title":"&#x27;The force is strong with the market&#x27;: The crypto derivatives market is heating up","category":["MARKETS"],"content":["The market for derivatives tied to cryptocurrencies is heating up, according to the latest available data.","Bakkt, which rolled out its bitcoin futures product in September 2019, saw volumes for the product top $37 million – a performance record for 2020, data from <a href=\"https:\/\/skew.com\/dashboard\/bitcoin-futures\" data-v-f87c67ca=\"\">Skew<\/a> shows.","","","Rival CME Group saw open interest on its bitcoin futures increase to $314 million, another 2020 record. Its volumes hit $824 million. Futures allow traders to speculate on an underlying asset or hedge their risk in an underlying position.","To the extent that they are important risk-management tools for institutional investors, the growth of the market perhaps serves as a signal of the maturation of the digital asset market.&nbsp;","","","Elsewhere, bitcoin options providers clocked in their own records, with crypto options and futures exchange Deribit clocking in more than $200 million worth of trading for its options products. That's the highest figure for 2020 thus far.","\"The force is strong with the market,\" Emmanuel Goh, founder of skew, noted in a message to The Block. \"Plenty of signs pointing to renewed optimism.\"&nbsp;","<strong data-v-f87c67ca=\"\">Sentiment shift&nbsp;<\/strong>","The activity in the options market has been underpinned by similar action in spot cryptocurrency trading, as noted by The Block's&nbsp;<a href=\"https:\/\/twitter.com\/lawmaster\/status\/1225788992160980994\" data-v-f87c67ca=\"\">Larry Cermak<\/a>. Legitimate spot volume increased from $39.83 billion in December to $67.53 billion in January – a 70% increase and 5-month high.&nbsp;","","","To be sure, the market saw a similar volume spike play out in the second half of 2019, as noted by Goh.","At the time, CME Group experienced a record trading day of $1.725 billion in volume on June 27.&nbsp;","\"Let's see if that's a bit more sustainable this time around,\" Goh said.&nbsp;","Still, there are signs of renewed optimism in the market relative to previous rallies, some market observers tell The Block.","For example, sources say that a number of companies are eyeing new fundraising rounds. Elsewhere, token projects are engaging with meaningful players in the technology and financial worlds. And on Tuesday, Reuters reported that JPMorgan <a href=\"https:\/\/www.theblockcrypto.com\/linked\/55506\/google-cloud-hedera-hashgraph-price-jump\" data-v-f87c67ca=\"\">was in talks<\/a> to merge its blockchain unit, Quorum, with the ethereum venture and development company ConsenSys.","As for the trading world, B2C2 founder Max Boonen told The Block that he hasn't seen much selling, but institutions aren't necessarily FOMO-ing.&nbsp;","\"Feels to me that it's retail-driven with halvening narrative and virus panic,\" he said.","At press time, bitcoin was trading at $10,360, a 27.8% increase over the last month. Ethereum, meanwhile, was trading at $266.28, a 76.8% increase over the last month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$67.53 billion","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"second half of 2019","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"September 2019","content":"DATE"},{"type":"76.8%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"June 27","content":"DATE"},{"type":"$266.28","content":"MONEY"},{"type":"$824 million","content":"MONEY"},{"type":"$39.83 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$1.725 billion","content":"MONEY"},{"type":"$37 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Goh","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Emmanuel Goh","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"27.8%","content":"PERCENT"},{"type":"Max Boonen","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$10,360","content":"MONEY"},{"type":"$314 million","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}