{"summary":"Binance&#x27;s approver for financial promotions compliance within the UK has been hit with an intervention from the Financial Conduct Authority.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255619\/binances-uk-approver-hit-with-fca-restrictions-days-after-partnership-announced","publishDate":"2023-10-10T08:57:36","id":11188,"type":null,"title":"Binance’s UK approver hit with FCA restrictions days after partnership announced","category":["POLICY"],"content":["The Financial Conduct Authority has put restrictions on Binance's UK approver for financial promotions compliance. On Tuesday, <a href=\"https:\/\/www.rebuildingsociety.com\/about-us\/\" data-v-f87c67ca=\"\">Rebuilding Society<\/a> received an intervention from the FCA that restricts it from conducting <a href=\"https:\/\/www.theblock.co\/post\/240231\/fca-crypto-memes-breach-financial-promotion-rules\" data-v-f87c67ca=\"\">financial promotions<\/a> on behalf of unauthorized crypto-asset service providers.","\"The firm must not approve the content of any financial promotion for a qualifying cryptoasset for communication by an unauthorized person,\" the FCA's OIREQ requirement stated.","According to the <a href=\"https:\/\/register.fca.org.uk\/s\/firm?id=001b000000h3VbpAAE#what-can-this-firm-do-restrictions\" data-v-f87c67ca=\"\">intervention<\/a>, Rebuilding Society has until 5 p.m. BST on Wednesday to withdraw any prior financial promotion approvals it has granted to unauthorized entities. The FCA has also ordered Rebuilding Society to inform clients using its third-party financial promotions service that it cannot approve content from unauthorized persons or entities. It must also withdraw any advertisements offering its services to approve financial promotions.","The move by the UK's financial regulator comes days after <a href=\"https:\/\/www.theblock.co\/post\/255431\/coinbase-okx-and-binance-partner-with-uk-firms-as-regulations-come-into-force\" data-v-f87c67ca=\"\">Binance<\/a> announced it was using Rebuilding Society to gain financial promotions compliance within the UK. On Saturday, a Binance <a href=\"https:\/\/www.binance.com\/en-GB\/feed\/profile\/506455821\" data-v-f87c67ca=\"\">blog post<\/a> stated that to comply with the FCA's new financial promotions regime, Binance was partnering with Rebuilding Society and that it \"has FCA authorization and regulatory approval.\"","In late August, Rebuilding Society <a href=\"https:\/\/www.rebuildingsociety.com\/s21-financial-promotions-approval-service\/\" data-v-f87c67ca=\"\">announced<\/a> its new financial promotions approval service. \"We’re pleased to announce a new service for the approval of financial promotions for cryptoasset firms,\" the Leeds-based lender stated.","The FCA's new regime for crypto asset financial promotions took effect on Oct. 8. The new rules apply to crypto promotions across various media forms, from websites and social media outlets to online advertising. The regulator said unregistered crypto asset firms who fail to comply with the new financial promotions guidelines are likely to be in breach of section 21 of the UK's Financial Services and Markets Act 2000. This would be a criminal offense, punishable by up to two years imprisonment, an unlimited fine, or both.","Some regulated entities are able to authorize promotions on behalf of other crypto companies. For instance, Archax is supporting crypto exchanges Coinbase and OKX on their communications to people based in the UK.","The regime change has also impacted services like news feeds, such as on Binance's global website and Coinbase's app, which are no longer available to those in the UK.","The Block has contacted Binance, Rebuilding Society and the FCA for comment but has not received a reply as of publication time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FCA","content":"ORGANIZATION"},{"type":"2000","content":"DATE"},{"type":"BST","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Rebuilding Society","content":"ORGANIZATION"},{"type":"Oct. 8","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"5 p.m.","content":"TIME"},{"type":"Wednesday","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Leeds","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"UK's Financial Services","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["ANTI-MONEY LAUNDERING","BINANCE","CRIME","FCA"],"authors":["Brian McGleenon","The Block"]}