{"summary":"South Korea’s ruling and opposing parties are promising citizens that they will legislate new commitments that boost the local crypto economy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287185\/south-korea-crypto-election","publishDate":"2024-04-09T04:49:34","id":11182,"type":null,"title":"South Korean parties pledge support for crypto ahead of election while experts remain skeptical","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">South Korea’s ruling and opposing political parties are promising citizens that they will legislate new commitments that boost the local cryptocurrency economy, in a bid to capture votes in Wednesday’s general election.<\/span>","<span data-v-f87c67ca=\"\">“Both the ruling and opposition parties are under the illusion that if they act in favor of crypto assets, they’ll win over younger voters. They always have been,” Lee Byung-uk, a professor of digital finance at the Seoul School of Integrated Sciences and Technologies, told The Block.<\/span>","<span data-v-f87c67ca=\"\">The country’s Democratic Party, the opposition party, is pledging to enable local financial institutions to launch spot crypto <\/span><a href=\"https:\/\/www.theblock.co\/post\/278170\/south-korea-opposition-bitcoin-etf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">exchange-traded funds<\/span><\/a><span data-v-f87c67ca=\"\"> and allow retail investors to purchase those ETFs through accounts with tax exemptions. It also intends to expand tax benefits given to crypto investors, including raising the tax-deductible threshold from the current 2.5 million won ($1,845) to 50 million won.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the ruling People Power Party has made promises to the crypto sector that appear less progressive than its rival’s. Its focus lies in strengthening ongoing efforts to safeguard crypto investors, such as promising to legislate the remaining half of the country’s act on protecting crypto users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ruling conservative party’s crypto campaign further vows investors to push back taxation on crypto investments, which is currently scheduled to start in January 2025.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Crypto gains taxation in South Korea had already been postponed once, from its initial starting date of Jan. 1, 2023. <\/span><a href=\"https:\/\/www.theblock.co\/post\/284619\/south-korea-petition-delay-crypto-taxation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Local crypto investors<\/span><\/a><span data-v-f87c67ca=\"\"> argue that it needs to be pushed back further, as the government has not prepared the necessary infrastructure and safety nets for crypto trading that need to be established before a tax is levied.<\/span>","<span data-v-f87c67ca=\"\">Kim Hyoung-joong, president of local thinktank Korea Fintech Society, said that delaying the taxation or allowing spot bitcoin ETFs could easily happen if the two parties come to an agreement. A more pressing matter, however, is that most Koreans still view crypto negatively, Kim told The Block.<\/span>","<span data-v-f87c67ca=\"\">“The easiest way forward is to revise the Venture Investment Promotion Act, which currently prohibits the country from designating blockchain development firms as venture businesses,” said Kim, adding that this will help alleviate the public’s view of blockchain and crypto as a mere hotbed of illegal speculation.<\/span>","<span data-v-f87c67ca=\"\">No matter what kinds of campaign promises are made, the leading parties could easily fall into a political war that can push back crypto bills indefinitely, according to Kim.<\/span>","<span data-v-f87c67ca=\"\">Crypto-boosting proposals were proclaimed in the country’s last presidential election in 2022, where President <\/span><a href=\"https:\/\/www.theblock.co\/linked\/137172\/yoon-suk-yeol-who-pledged-to-deregulate-south-koreas-crypto-sector-wins-presidential-election\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Yoon Suk-yeol<\/span><\/a><span data-v-f87c67ca=\"\"> promised numerous changes to accommodate the growing sector, such as lifting the ban on initial coin offerings. Nevertheless, most of Yoon’s crypto campaign pledges remain unattended today.<\/span>","<span data-v-f87c67ca=\"\">“Politicians that are non-experts are sending too many wrong signals,” Lee said. “There is no consistency, no justification. They seem to only be after the votes.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lee Byung","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Seoul School of Integrated Sciences and Technologies","content":"ORGANIZATION"},{"type":"$1,845","content":"MONEY"},{"type":"Lee","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kim","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"January 2025","content":"DATE"},{"type":"Jan. 1, 2023","content":"DATE"},{"type":"Koreans","content":"LOCATION"},{"type":"Yoon Suk","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"People Power Party","content":"ORGANIZATION"},{"type":"thinktank Korea Fintech Society","content":"ORGANIZATION"},{"type":"Kim Hyoung","content":"PERSON"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION"],"authors":["Danny Park","The Block"]}