{"summary":"Coin Metrics has determined that since 2018, S9s contributions to Bitcoins hash rate has declined almost 55%. S9s decline is correlated with the production of new hardware.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63892\/report-bitcoin-antminer-s9-bitcoin-hash-rate","publishDate":"2020-05-04T13:51:04","id":1118,"type":null,"title":"Report: Antminer S9s produce ~23% of bitcoin&#x27;s current hash rate","category":["BITCOIN"],"content":["Bitmain's Antminer S9s produce around 23% of the total bitcoin hash power output, new research by Coin Metrics has found.&nbsp;","The company's research efforts assessed that S9s contributed as much as 78% of the total network hash power in 2018, when the mining hardware product was the best-seller on the market. However, that figure has seen a steady decline since then, while the network share of other miners has risen.","<span data-v-f87c67ca=\"\">Source: Coin Metrics <\/span>","The makeup of the network's total hash rate by mining rigs has been a topic of interest for miners and equipment makers because it indicates the pace at which the market is adopting new products.","What's more, the bitcoin network is set to undergo its third-ever block reward halving next week, when the per-block reward will fall from 12.5 BTC to 6.25 BTC. As such, many mining operations have upgraded their equipment to more efficient models over the past one year to six months in order to counteract the expected drop in revenue.","In March, China-based fund Spark Capital <a href=\"https:\/\/www.coindesk.com\/price-drop-casts-pall-over-bitcoin-miners-equipment-upgrades\" data-v-f87c67ca=\"\">estimated<\/a>&nbsp;that the total hash rate contributed by S9s to be around 20 to 25 percent, while at the beginning of the year, mining equipment brokerage firm Blockwares Solutions put that figure at around 50% in a conversation with The Block.&nbsp;","Instead of basing the estimation on experiences, however, Coin Metrics' research calculated S9s percentage based on the distribution of nonces. Nonces are numerical values that mining equipment randomly generates to win the right to add a block to the blockchain. Charting out the nonce distribution over time shows streaks of empty spaces, indicating that some parts of nonces are not as frequently sampled.&nbsp;","According to the research, these streaks <a href=\"https:\/\/coinmetrics.substack.com\/p\/coin-metrics-state-of-the-network-375\" data-v-f87c67ca=\"\">are likely caused<\/a> by the way S9s and S7s – another Antminer product series – sample nonces, which is not completely random. As such, the area of the empty space may be caused by S9s and S7s skipping certain ranges of nonces and can be a proxy for their usage in the network.&nbsp;","The trend spotted by Coin Metrics' research is not surprising. Over the past two years, Bitmain, MicroBT, and other mining equipment makers have all rolled out newer models that, over time, chipped away at S9s' market share.&nbsp;","At the beginning of 2019, Bitmain rolled out its Antminer S17 and T17 products, which soon became popular replacements for the S9s. The company is also set to release its latest S19 series in May, with <a href=\"https:\/\/shop.bitmain.com\/\" data-v-f87c67ca=\"\">the first batches already sold out<\/a>&nbsp;according to the company's website. Meanwhile, MicroBT, arguably the second-largest miner maker after Bitmain, just launched three new models&nbsp;<a href=\"https:\/\/www.f2pool.com\/miners?currency_code=btc#list-head\" data-v-f87c67ca=\"\">with efficiencies<\/a> similar to the S19s.&nbsp;","However, the fate of the S9s as an outdated model may not be sealed, as least not for now. As the price of bitcoin bounces back from its mid-March low and some southwest regions in China enter a rainy season, some miners could choose to stick with the S9s as the profit margin remains sustainable.","During an event appearance late last month,&nbsp;Bitmain's mainland sales manager Kun Yu also expressed the same view, advising those with access to cheap power to maintain or increase their S9 holdings.&nbsp;","\"For owners of hydropower mines: it is recommended that they pay more attention to S9K models,\" Yu said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bitmain","content":"LOCATION"},{"type":"23%","content":"PERCENT"},{"type":"78%","content":"PERCENT"},{"type":"Bitmain","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"mid-March","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Blockwares Solutions","content":"ORGANIZATION"},{"type":"Coin Metrics","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Kun Yu","content":"PERSON"},{"type":"25 percent","content":"PERCENT"}],"hashtag":["MINING"],"authors":["Celia Wan","The Block"]}