{"summary":"The Securities and Exchange Commission told a Utah court it will train staff about “the duty of accuracy and candor.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269087\/sec-admits-it-made-inaccurate-statements-in-utah-crypto-case","publishDate":"2023-12-22T12:16:22","id":11187,"type":null,"title":"SEC admits it made inaccurate statements in Utah crypto case","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The Securities and Exchange Commission admitted it made inaccurate statements in a lawsuit against crypto startup DEBT Box, but the regulator insisted that the firm's assets should still be frozen.<\/span>","<span data-v-f87c67ca=\"\">In November, Utah's top federal judge <\/span><a href=\"https:\/\/www.theblock.co\/post\/266811\/judge-grants-sec-another-week-to-explain-misrepresentations\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">criticized<\/span><\/a><span data-v-f87c67ca=\"\"> SEC lawyers over their handing of the case, demanding they provide a basis for their request for a restraining order on DEBT Box to freeze its assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Judge Robert J. Shelby ordered the SEC to explain \"false or misleading\" statements after it claimed the company was trying to move assets overseas in order to escape the regulator's jurisdiction.<\/span>","<span data-v-f87c67ca=\"\">In a response to the court on Thursday, the SEC admitted misstating some of its accusations to support its request for the restraining order, such as that DEBT Box was allegedly closing dozens of its accounts during the ongoing litigation.<\/span>","<span data-v-f87c67ca=\"\">The SEC \"fell short\" of the expectations to be accurate and candid in the court, made representations that were inaccurate, failed to correct themselves and \"make clear that certain representations were inferences from the facts… rather than directly supported factual assertions,\" it said in the response.<\/span>","<span data-v-f87c67ca=\"\">However, the agency insisted it had acted in good faith and rightfully requested the restraining order.<\/span>","<span data-v-f87c67ca=\"\">The SEC said it took measures to correct its mistakes, assigning senior attorneys from the Commission’s Denver Regional Office to supervise the case going forward. The SEC's Division of Enforcement will also conduct mandatory training for its staff&nbsp; \"about the duty of accuracy and candor and the duty to correct any inaccuracies as soon as they come to light.\"<\/span>","<span data-v-f87c67ca=\"\">The lawsuit alleges that DEBT Box defrauded thousands of investors for a total of $49 million. DEBT Box offered customers so-called \"node licenses\" to receive revenue from mining without running an actual mining operation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the SEC, DEBT Box falsely stated they had a real-world business. The regulator said DEBT Box was trying to move assets overseas in order to escape the regulator's jurisdiction and obstruct the SEC investigation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The commission obtained the restraining order earlier this year but it was dissolved in October after the court confirmed the SEC failed to sufficiently back its claims.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$49 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Commission’s Denver Regional Office","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Utah","content":"LOCATION"},{"type":"Robert J. Shelby","content":"PERSON"},{"type":"earlier this year","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["LAWSUITS","SEC"],"authors":["Anna Baydakova","The Block"]}