{"summary":"Binance and some of its executives are reportedly under scrutiny for possible money laundering and criminal sanctions violations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193988\/justice-department-weighs-charging-binance","publishDate":"2022-12-12T07:55:20","id":11195,"type":null,"title":"U.S. Justice Department weighs charging Binance and its executives: Reuters","category":["EXCHANGES"],"content":["The U.S. Justice Department is continuing to weigh up charging crypto exchange giant Binance for possible money laundering and criminal sanctions violations, according to Reuters.&nbsp;&nbsp;","It is also looking into the exchange's top executives, including CEO Changpeng Zhao (CZ), according to the <a href=\"https:\/\/www.reuters.com\/article\/idUSL8N3321X6\" data-v-f87c67ca=\"\">report<\/a>.&nbsp;Disagreements between prosecutors are holding up any potential conclusion to the criminal investigation, the report noted, citing four people familiar with the matter.&nbsp;","The investigation has been running since 2018 and spans prosecutors across three different offices, including the Money Laundering and Asset Recovery Section, the U.S. Attorney’s Office for the Western District of Washington in Seattle and the National Cryptocurrency Enforcement Team. A portion of those working on the case believe evidence justifies moving \"aggressively\" against the exchange, the report said. Others want to take more time to review the evidence.&nbsp;","Binance's law firm Gibson Dunn has held meetings with Justice Department officials in recent months, according to Reuters' sources, arguing that a criminal prosecution such as this one would put even more pressure on an already stressed crypto market. Three people said that the discussions included potential plea deals.","\"As has been reported widely, regulators are doing a sweeping review of every crypto company against many of the same issues,\" said a Binance spokesperson. \"This nascent industry has grown quickly and Binance has shown its commitment to security and compliance through large investments in our team as well as the tools and technology we use to detect and deter illicit activity.\"","The Block contacted the DOJ for comment but had not heard back before publication time.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/167025\/us-prosecutors-requested-records-on-binance-ceo\" data-v-f87c67ca=\"\">Earlier this year<\/a>, Reuters reported that prosecutors in the U.S. had requested communication records of CZ in late 2020.","The U.S. Justice Department's money laundering division asked the exchange to voluntarily hand over messages relating to its detection of illegal transactions and recruitment of U.S. customers.","Prosecutors' requests extended to any messages instructing employees that, \"documents be destroyed, altered, or removed from Binance's files\" or \"transferred from the United States.\" The request included CZ as well as 12 other executives and partners.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/fiat-exchange-volume\/embed\" title=\"Fiat Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Gibson Dunn","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"National Cryptocurrency Enforcement Team","content":"ORGANIZATION"},{"type":"U.S. Justice Department","content":"ORGANIZATION"},{"type":"Western District","content":"ORGANIZATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Lucy Harley-McKeown","The Block"]}