{"summary":"Shiba Inu will soon launch a beta for its planned Ethereum Layer 2 network called Shibarium with bone tokens used for transaction fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202516\/shiba-inu-about-to-launch-ethereum-layer-2-network-shibarium-in-beta","publishDate":"2023-01-16T06:03:04","id":11204,"type":null,"title":"Shiba Inu about to launch Ethereum Layer 2 network Shibarium in beta","category":["CRYPTO ECOSYSTEMS"],"content":["Shiba Inu developers are preparing to release the meme token’s Layer 2 network called Shibarium in beta form — with the full launch to follow not long after.","Shibarium is a planned Ethereum-based Layer 2 network for the Shiba Inu ecosystem. Transactions on the chain will be paid for using bone, the governance token of the Shiba DAO. Bone tokens will also be used to reward validators and delegators in the Shibarium network, according to the <a href=\"https:\/\/blog.shibaswap.com\/introduction-to-shibarium\/\" data-v-f87c67ca=\"\">announcement<\/a>. As such, 20 million bone tokens, currently worth $27 million, have been reserved to pay out these rewards. Shiba Inu developers say this move will improve the utility of the bone token.","Shiba Inu’s planned Layer 2 network will also utilize other Shiba Inu-based tokens like leash and the ecosystem’s native <a href=\"https:\/\/www.theblock.co\/linked\/122323\/shib-overtakes-doge-as-rival-memecoin-surpasses-market-capitalization\" data-v-f87c67ca=\"\">meme coin shib<\/a>. Shibarium transactions will trigger shib token burns, the announcement stated. Token burning results in the permanent destruction of tokens by sending them to a project’s “burn address,” thus removing them from the total circulation forever.","Layer 2 networks are built to scale up their Layer 1 counterparts by increasing transaction speeds at reduced costs while relying on the security of the base layer. Shiba stated that Shibarium, when fully built, will be able to serve several blockchain verticals including metaverse and gaming. The announcement added that its planned Layer 2 network will reduce the transaction load associated with these sectors.","“Combined, web3 and Shibarium's layer 2 blockchain technology can enable a new decentralized metaverse and gaming ecosystem, where players can interact and transact in a trustless and decentralized way and where players can own, buy and sell the digital assets they acquire,” said the Shiba Inu team.","Shiba Inu is working towards a testnet launch for Shibarium, according to the announcement. The mainnet launch will see the team integrate ShibaSwap into the Layer 2 network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"Shiba DAO","content":"ORGANIZATION"},{"type":"Shibarium","content":"PERSON"},{"type":"Shibarium","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Shiba Inu","content":"LOCATION"}],"hashtag":["DAOS","SIDECHAINS"],"authors":["Osato Avan-Nomayo","The Block"]}