{"summary":"Whinstone US and Northern Bitcoin AG have merged to set up the “largest bitcoin mining facility worldwide” in Texas\nThe facility would cover 100-acre land or “equivalent to around 57 soccer fields”\nTo be constructed in three phases, the farm would have a capacity of one gigawatt ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/47717\/two-firms-merge-to-open-100-acre-bitcoin-mining-farm-in-texas-with-a-capacity-of-one-gigawatt","publishDate":"2019-11-20T08:30:26","id":1120,"type":null,"title":"Whinstone US and Northern Bitcoin AG have merged","category":["Mining"],"content":["Whinstone US Inc., a Louisiana-based developer of high-speed data centers, and Northern Bitcoin AG, a Germany-based bitcoin mining firm, have merged to open a 100-acre bitcoin mining farm in the U.S. state of Texas.","Jointly <a href=\"https:\/\/northernbitcoin.com\/northern-bitcoin-merges-with-leading-us-competitor\/\" data-v-f87c67ca=\"\">announced<\/a> Monday, Whinstone and Northern Bitcoin said the farm would be the “largest bitcoin mining facility worldwide with a capacity of one gigawatt.” One gigawatt is equal to 1,000 megawatts.","Whinstone currently operates its own mining facilities in the Netherlands, Sweden and the U.S., while Northern Bitcoin operates its facility in Norway, per the announcement.","\"With this merger, we are catapulting ourselves faster than originally planned to the top of the world in bitcoin mining. Together, we have a dominant leadership position in this fast-growing industry and are well-positioned to benefit significantly from the future development of blockchain technology,” said Mathis Schultz, CEO of Northern Bitcoin AG.","Construction of the farm “equivalent to around 57 soccer fields” will occur in three phases, with the first phase to begin during Q1 2020, having over 300 megawatts of capacity, and the last phase is scheduled to be completed in Q4 2020.","The firms said they already have the first clients for the farm, but did not disclose them, except “two stock-listed corporations.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Texas - a new mining haven? <\/strong><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJust last month, Chinese crypto mining hardware giant <a href=\"https:\/\/www.theblockcrypto.com\/linked\/43950\/bitmain-opens-a-large-crypto-mining-farm-in-texas\" data-v-f87c67ca=\"\">Bitmain launched<\/a> a 50-megawatt farm, also in Texas, calling it “the world’s largest for bitcoin mining.”&nbsp; Bitmain's farm is constructed on a 33,000-acre land and is built in partnership with Rockdale Municipal Development District and Canadian tech firm DMG Blockchain Solutions. Bitmain said at the time it will later expand the farm to over 300 megawatts capacity.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nDigital Currency Group (DCG)-backed firm Layer1 also recently<a href=\"https:\/\/www.theblockcrypto.com\/post\/43253\/thiel-crypto-investors-pour-50-million-into-new-bitcoin-miner-aimed-in-us\" data-v-f87c67ca=\"\"> raised $50 million<\/a> to build mining chips and to run its own electricity substations in Texas. To that end, the firm bought a dozen acres of land in the city.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCurrently, <a href=\"https:\/\/arxiv.org\/pdf\/1810.02466.pdf\" data-v-f87c67ca=\"\">around 70%<\/a> of the crypto mining market is dominated by Chinese miners, which benefit from low electricity prices and easy access to mining machines produced by local manufacturers such as Bitmain and Canaan Creative. The top 5 known mining pools are also all based in China, according to blockchain.com.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nStill, according to Layer1 co-founder Alexander Liegl, running a mining farm in the U.S. has both economic and ideological significance. “I feel very strongly about this, which is you need a U.S. representative in order to create more symmetric distribution in hash power, that would definitely be a net positive for the community and the protocol,\" Liegl <a href=\"https:\/\/www.theblockcrypto.com\/post\/43253\/thiel-crypto-investors-pour-50-million-into-new-bitcoin-miner-aimed-in-us\" data-v-f87c67ca=\"\">told<\/a> The Block recently."],"hashtag":[]}