{"summary":"The NFT lending pool has negotiated with the hacker to return half of the stolen funds and keep the remainder.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154299\/hacker-returns-half-of-the-3-8-million-they-stole-from-nft-lender-xcarnival","publishDate":"2022-06-27T07:25:51","id":11201,"type":null,"title":"Hacker returns half of the $3.8 million they stole from NFT lender XCarnival","category":["HACKS"],"content":["The hacker who exploited NFT lending pool XCarnival for 3,087 ETH ($3.8 million) has returned half of the loot, <a href=\"https:\/\/twitter.com\/TalBeerySec\/status\/1541329941203226624\" data-v-f87c67ca=\"\">according<\/a> to on-chain security researcher and ZenGo co-founder Tal Be’ery.","As an NFT lending pool, XCarnival enables users to borrow funds using their collectibles as collateral for loans. XCarnival suffered a security incident on Sunday that saw the exploiter able to drain $3.8 million in ETH from the platform.","“The core issue was a vulnerability that allowed the attacker to borrow multiple times against the same NFT collateral,” Be’ery told The Block.","The hacker deposited one NFT, Bored Ape #5110, as collateral to borrow funds. Normally, the Bored Ape used as collateral should be locked up by the protocol until repayment of the loan occurs. The hacker was, however, able to withdraw the Bored Ape collateral without repaying the loan and using it to take another loan. This action was <a href=\"https:\/\/etherscan.io\/nft\/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d\/5110\" data-v-f87c67ca=\"\">repeated<\/a> several times, draining 3,087 ETH from the protocol.","XCarnival contacted the hacker after the incident via on-chain messages calling for a return of the funds. The NFT lending pool initially offered a $300,000 bounty in exchange for the stolen funds. XCarnival then increased its offer to half of the stolen amount, which the hacker <a href=\"https:\/\/etherscan.io\/tx\/0xcc3fda1e5540486de15f707ccc82a6f9c8c78e0ef3ef02e4318b3bea24ace701\" data-v-f87c67ca=\"\">obliged<\/a>.","The hacker’s <a href=\"https:\/\/etherscan.io\/address\/0xca67615bb9a9cc093e13dee3de1ca55b55ab3586\" data-v-f87c67ca=\"\">wallet<\/a> still has 1,500 ETH ($1.8 million) as of the time of publishing. The remaining 120 ETH, which was withdrawn from Tornado Cash to carry out the exploit, has been returned.","The NFT lender also promised not to pursue any law enforcement action against the hacker if they returned half of the stolen funds.","It is becoming a popular occurrence for projects to offer bug bounties to hackers responsible for stealing from them. For example, this happened to the exploiter who <a href=\"https:\/\/www.theblockcrypto.com\/linked\/150966\/attacker-snipes-20-million-op-tokens-intended-for-wintermute-loan\" data-v-f87c67ca=\"\">stole 20 million Optimism tokens<\/a> from Wintermute earlier in June and subsequently <a href=\"https:\/\/www.theblock.co\/post\/151344\/hacker-returns-17-million-op-tokens\" data-v-f87c67ca=\"\">returned 17 million<\/a> of those coins, with the two sides calling it even.","Harmony also recently <a href=\"https:\/\/www.theblock.co\/linked\/154243\/harmony-offers-1-million-bounty-for-return-of-stolen-funds\" data-v-f87c67ca=\"\">offered a $1 million bounty<\/a> for the return of the $100 million that was stolen from its Horizon bridge protocol on June 23. Harmony’s offer also includes a promise not to advocate for criminal charges against the hackers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Tal Be’ery","content":"ORGANIZATION"},{"type":"$1.8 million","content":"MONEY"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"$3.8 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$300,000","content":"MONEY"},{"type":"5110","content":"DATE"},{"type":"June 23","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}