{"summary":"The equipment hits the market when the latest date for Ethereum&#x27;s proof-of-stake switch is slated for June 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125871\/innosilicon-ethereum-miner-a11-pos","publishDate":"2021-12-01T01:57:46","id":11213,"type":null,"title":"InnoSilicon ships new Ethereum ASIC miner at 1,500 MH\/s","category":["ETHEREUM"],"content":["A new Ethereum ASIC miner is coming to the market but it appears to be not as attractive as it was initially thought to be.","Wuhan-headquartered chip maker InnoSilicon is now shipping the long-awaited Ethereum ASIC miner called A11 Pro after words of the specifications first came out earlier this year.","At the time, the expected performance was thought to be 2,000 megahashes per second (MH\/s) with a power at 2,500 watts (W). That would translate to a mining efficiency of 1.25 W per MH\/s, which could outperform the most efficient equipment on the market by 30%.&nbsp;","But based on the quotes for spot stocks of A11 Pro by multiple miner distributors and brokers in China this week, the new ASIC equipment touts an average hash rate of 1,500 MH\/s with a power of 2,350 W.","That means the average efficiency is at 1.56 W per MH\/s. It can still outperform all the equipment on the market at the moment but is 20% less efficient than what was initially anticipated.&nbsp;","The quotes from Chinese brokers and distributors are between 170,000 to 180,000 yuan, or around $27,000, per unit.&nbsp;","ASIC Miner Value, a website that tracks ASIC mining equipment on all networks, also <a href=\"https:\/\/www.asicminervalue.com\/miners\/innosilicon\/a11-pro-eth-2000mh\" data-v-f87c67ca=\"\">warns<\/a> in a banner that at least the first batch of the A11 Pro equipment shipping in November will deliver a hash rate of 1,500 MH\/s, instead of 2,000 MH\/s.","Indeed, InnoSilicon did not have a smooth launch for the A11 series of equipment.","The firm <a href=\"https:\/\/twitter.com\/Inno_Miner\/status\/1368535801605328897\" data-v-f87c67ca=\"\">said in a tweet in March<\/a> that one of its employees conducted unauthorized sales for A11 Pro with the boasted 1.25 watt per MH\/s mining efficiency and an expected delivery time between April and August this year. The employee was later fired.","\"There are recent police investigation involved in some fraud A11 pre-order sales activities. Please don't pay any account on A11 till further announcement. Bella Chen is fired and no longer with InnoSilicon,\" the firm said at the time. \"Be careful all sales of A11 are suspended.\"","Further, the A11 Pro equipment hits the market at a time when the latest date for Ethereum to switch to proof of stake is slated for June 2022. Per ASIC Miner Value's calculation, the averaged payback period for A11 Pro currently is around eight to 10 months based on Ethereum's current difficulty and prices.","The firm also hosted a launch event last week to release its own desktop graphic processing unit (GPU) chips, although it didn't give out any details on the GPU's potential performance on Ethereum mining.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"GPU","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Miner Value","content":"ORGANIZATION"},{"type":"August this year","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Wuhan","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"ASIC Miner Value","content":"ORGANIZATION"},{"type":"$27,000","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Wolfie Zhao","The Block"]}