{"summary":"Long before bulge bracket banks like Goldman Sachs made headlines about dipping their pinky toes into the crypto market, Chicago high-frequency traders","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/833\/chicago-crypto-trading-shops-are-going-on-a-hiring-spree","publishDate":"2018-09-26T17:09:15","id":11214,"type":null,"title":"Chicago crypto trading shops are going on a hiring spree","category":["MARKETS"],"content":["Long before bulge bracket banks like Goldman Sachs made headlines about dipping their pinky toes into the crypto market, Chicago high-frequency traders were taking bitcoin orders in the millions of dollars and cashing in on mouth-watering arb trades.&nbsp;","And now, despite the bear market that has gripped crypto, a number of speed traders in Chicago are looking to hire more crypto talent.","Geneva Trading, a firm with offices in Chicago, Dublin, and Singapore, is one such trader looking to build out its crypto team, according to a job ad. As part of its expansion, the firm is looking to bring on a trading team lead.","That person would be tasked with building a successful team of quantitative traders, analysts, and developers. And the person would also be required to build and maintain trading strategies relating to crypto.&nbsp;","Interestingly, Geneva was charged $1.5M by the Commodities Futures Trading Commission for regularly participating in spoofing, an illegal trading practice that can help high-speed traders manipulate a market for profit.&nbsp;<span data-v-f87c67ca=\"\">Notably, spoofing has been a major problem in crypto. But it isn't clear the traders were manipulating crypto markets.&nbsp;<\/span>","The firm is not alone in its ambitions to lure in talent.&nbsp;<span data-v-f87c67ca=\"\">DRW, also Chicago-based, is out prospecting. Despite a decline in both over-the-counter trading volumes and prices across coins, the firm is still staffing up its crypto unit Cumberland, which it launched in 2014. At last check, the company had<\/span>&nbsp;11 job postings relating to digital assets on their site, including two over-the-counter trading positions. Akuna Capital, another trading firm with offices in Chicago, is looking to hire two more cryptocurrency traders.&nbsp;","Still, the hiring spree doesn't mean that crypto trading desks are necessarily making money as easily as they once did. One trader at an aforementioned firm who declined to be identified told&nbsp;<em data-v-f87c67ca=\"\">The Block&nbsp;<\/em>that most firms are skating to where the puck might go, not to where it currently is.","\"OTC was a lucrative business last year,\" the person said. \"The question now is: Does it come back, do people give up?\"","\"It's not entirely clear what the answers are now.\"","As bitcoin was running up to $20,000 at the end of 2017, crypto traders were making easy-money on so-called arbitrage trades. Traders would buy up crypto on one venue at a lower price to then sell it on a venue on which it was trading higher. In some instances, the price differences between certain exchanges topped $1,000.","Those opportunities have since dried up.&nbsp;","\"The exchange arbitrage trade has kind of gone a way,\" one trader said. \"That is not a full business model.\"","Now, so-called quantitative strategies -- which span high-frequency and statistical arbitrage strategies -- are picking up steam, according to industry insiders.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"$1.5","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"Dublin","content":"LOCATION"},{"type":"$20,000","content":"MONEY"},{"type":"$1,000","content":"MONEY"},{"type":"Geneva","content":"LOCATION"},{"type":"Geneva Trading","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Chicago","content":"LOCATION"},{"type":"Cumberland","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}