{"summary":"Silvergate Capital Corporation said it will wind down operations and voluntarily liquidate the Silvergate Bank in accordance with applicable regulatory processes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218223\/silvergate-will-liquidate-bank-wind-down-operations","publishDate":"2023-03-08T16:37:15","id":11219,"type":null,"title":"Silvergate will liquidate bank, wind down operations","category":["COMPANIES"],"content":["Silvergate Capital Corporation said it will wind down operations and voluntarily liquidate Silvergate Bank, one of crypto's most prominent banks, raising concerns that crypto firms' access to the U.S. banking system will be further concentrated and could chill new businesses from entering the sector.&nbsp;","\"In light of recent industry and regulatory developments, Silvergate believes that an orderly wind down of bank operations and a voluntary liquidation of the bank is the best path forward,\" the firm said in a Securities and Exchange Commission <a href=\"https:\/\/d18rn0p25nwr6d.cloudfront.net\/CIK-0001312109\/4a9631da-2e92-4df5-b425-7fd5c9e91da5.html\" data-v-f87c67ca=\"\">filing<\/a>.&nbsp; \"The bank’s wind down and liquidation plan includes full repayment of all deposits. The company is also considering how best to resolve claims and preserve the residual value of its assets, including its proprietary technology and tax assets.\"","“The Department of Financial Protection and Innovation is monitoring the situation closely to facilitate the safe and expeditious voluntary liquidation of Silvergate Bank,” said California DFPI Commissioner Clothilde Hewlett. “The department is evaluating compliance with all financial laws, as well as safety and soundness obligations, and is working closely with relevant federal counterparts.” Silvergate is California state-chartered bank.","The imminent demise of a prominent crypto-friendly bank attracted the Senate Banking Committee chairman's attention. “As the impact of FTX’s collapse continues to ripple outward, today we are seeing what can happen when a bank is overreliant on a risky, volatile sector like cryptocurrencies,” Sen. Sherrod Brown, D-Ohio, said in a statement.","“I’ve been concerned that when banks get involved with crypto, it spreads risk across the financial system and it will be taxpayers and consumers who pay the price,\" he added. That’s why I am continuing to work with my colleagues in Congress and financial regulators to establish strong safeguards for our financial system from the risks of crypto.”","One of his colleagues — and outspoken crypto skeptic — on the Senate Banking Committee, Sen. Elizabeth Warren, D-Mass., was not surprised by Silvergate's liquidation. \"I warned of Silvergate's risky, if not illegal, activity — and identified severe due diligence failures,\" Warren said in a <a href=\"https:\/\/twitter.com\/senwarren\/status\/1633611272372486144?s=46&amp;t=FYGzVq-s9dFHGSUdI1mdTQ\" data-v-f87c67ca=\"\">tweet<\/a>. \"Now, customers must be made whole and regulators should step up against crypto risk.\"","This sentiment was echoed by Alex Grieve, a vice president at the Washington, D.C.-based government affairs firm Tiger Hill Partners. \"While I can’t speak to Silvergate’s risk management practices or investment decisions, at a high level the continued consolidation of crypto banking services into an increasingly smaller pool of banks does not mean that the banking system is safer — it just increases concentration risk, Grieves said. \"Bank regulators should establish clear standards for banking crypto companies, rather than vague suggestions about safety and soundness.\"","Silvergate's liquidation raises serious questions about how the sector will be regulated in the near term and how crypto firms will access the banking system, said Alex More, partner at the law firm of Carrington, Coleman, Sloman and Blumenthal. \"On one hand, legitimate questions were raised by lawmakers and litigants about Silvergate's oversight of its banking relationships with crypto clients. To the extent Silvergate had problems with its internal controls that it could not resolve, maybe it's for the best that it's choosing to wind down,\" More said. \"On the other hand, the crypto community is already hindered by limited access to the U.S. banking system and Silvergate's demise only makes this problem worse.\"","Silvergate's collapse leaves a vacuum for crypto. <b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">\"<\/b>There is nothing really stopping a bank from banking a crypto company but your bank regulator is going to come look at your books more frequently — let's say every six months instead of every 12, and that makes your life more difficult and drives up compliance costs,” said Meltem Demirors, CoinShares chief strategy officer. \"So unless a crypto firm is a really big revenue generator, the juice isn’t worth the squeeze for many banks.\"","\"The combination of Silvergate's failure and the general chill on crypto banking services may create challenges for new start ups, unknown entities, and folks experimenting on the frontier of crypto,\" added Matt Hougan, Bitwise Asset Management chief investment officer. \"In sum, this is not a good thing for crypto, but it is a good thing for crypto that it's happening now, and not four or five years ago, when crypto's connection to the traditional banking system was even narrower than it is today.\"","Added Laura Vidiella, LedgerPrime vice president of business development and strategy: \"Inevitably we need to team up with regulators and make it easier for other banks to bank crypto companies. It’s been always the case but over the past couple years there’s been so much cash flowing into the industry that we’ve lost north a little bit.\"","The La Jolla, California-based bank has taken a beating recently over its ties to FTX and Alameda Research. Coinbase, Paxos, Circle and Gemini were among the companies that distanced themselves from the bank after it <a href=\"https:\/\/www.theblock.co\/post\/216548\/silvergates-network-unravels-leaving-crypto-industry-in-search-of-new-partners\" data-v-f87c67ca=\"\">warned<\/a> the SEC that it was \"less than well-capitalized\" and was \"re-evaluating its business\" and delayed the filing of its annual report.&nbsp;","Moody's last week <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/217061\/moodys-sees-significant-governance-deficiencies-in-silvergate\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/217061\/moodys-sees-significant-governance-deficiencies-in-silvergate\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">downgraded<\/a>&nbsp; the company's long-term issuer rating for a second time and warned further rating cuts were on the table. Shortly after the rating downgrade, the bank&nbsp;<a class=\"c-link\" href=\"https:\/\/www.silvergate.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.silvergate.com\/\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">announced<\/a>&nbsp;it was closing its 24-hour money transfer system known as the Silvergate Exchange Network.","Given all of this, it's \"no surprise\" that Silvergate is liquidating, said Anthony Georgiades, co-founder of Pastel Network, an NFT-focused blockchain. \"While this voluntary liquidation is very unfortunate for the industry as a whole, it should not be used as an opportunity for regulators and legislators to ‘de-bank’ crypto,\" he said. \"We will see as it matures that certain controls will put in place to hedge risk and protect consumers, but that does not mean instituting safeguards against crypto because of its inherent risk as an asset.\"&nbsp;","<em data-v-f87c67ca=\"\">With additional reporting by Frank Chaparro, Stephanie Murray and Madhu Unnikrishnan.<\/em>","<em data-v-f87c67ca=\"\">Update: With comment from Sens. Sherrod Brown and Elizabeth Warren, and the California Department of Financial Protection and Innovation, and with comments from the industry, including from Alex Grieve, Alex More, Meltom Demirors, Matt Hougan. With links to the SEC filing and further details throughout.<\/em>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Carrington","content":"LOCATION"},{"type":"Madhu Unnikrishnan","content":"ORGANIZATION"},{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Stephanie Murray","content":"PERSON"},{"type":"Paxos","content":"LOCATION"},{"type":"California Department of Financial Protection","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Tiger Hill Partners","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bitwise Asset Management","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Alex Grieve","content":"PERSON"},{"type":"Silvergate Exchange Network","content":"ORGANIZATION"},{"type":"Grieves","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Alex More","content":"PERSON"},{"type":"Silvergate Capital Corporation","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Laura Vidiella","content":"PERSON"},{"type":"LedgerPrime","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"Blumenthal","content":"PERSON"},{"type":"Matt Hougan","content":"PERSON"},{"type":"Anthony Georgiades","content":"PERSON"},{"type":"Pastel Network","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"California DFPI Commissioner Clothilde Hewlett","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Coleman","content":"PERSON"},{"type":"Ohio","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Meltem Demirors","content":"PERSON"},{"type":"Sloman","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Meltom Demirors","content":"PERSON"},{"type":"The Department of Financial Protection and Innovation","content":"ORGANIZATION"},{"type":"Moody","content":"ORGANIZATION"},{"type":"D.C.","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}