{"summary":"The exploit was traced back to a flaw in Seneca&#x27;s smart contract approval mechanisms, leading to unauthorized fund diversion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279761\/stablecoin-protocol-seneca-hit-by-6-million-exploit-due-to-smart-contract-flaw","publishDate":"2024-02-29T01:10:41","id":1121,"type":null,"title":"Stablecoin protocol Seneca hit by $6 million exploit","category":["CRYPTO ECOSYSTEMS"],"content":["Stablecoin protocol Seneca suffered an exploit, leading to a loss of more than $6 million on Ethereum and Arbitrum networks.","The exploit was pinpointed to an issue within the protocol’s smart contract approval mechanisms — which was exploited by an unknown attacker to divert funds.","Security analysts from Blocksec identified the root cause of the breach as an “arbitrary call issue” within Seneca’s smart contracts.","The project’s contracts didn’t have code that could let the team pause it — instead, users had to revoke permissions. The stolen assets are reported to be more than 1,900 ETH ($6 million).","This vulnerability allowed the attacker to make unauthorized transfers of tokens from the project’s contract to an external addresses controlled by them. “The root cause was an arbitrary call issue, hence approvals to the vulnerable contract can be transferred out,” Blocksec CTO Lei Wu told The Block.","The Seneca team <a href=\"https:\/\/twitter.com\/SenecaUSD\/status\/1762886130561630227\" data-v-f87c67ca=\"\">acknowledged<\/a> the incident and urged users to revoke previously granted permissions in an effort to prevent further unauthorized transactions.","Seneca is a decentralized finance project that allows users to mint and borrow its stablecoin, senUSD, against other crypto assets — a stablecoin mechanism also called a collateralized debt position.","The Seneca token went down by more than 60% following the exploit — dropping from around $0.1 to under $0.04.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Seneca","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"$0.04","content":"MONEY"},{"type":"$0.1","content":"MONEY"},{"type":"Blocksec","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Blocksec CTO Lei Wu","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"60%","content":"PERCENT"}],"hashtag":["EXPLOITS"],"authors":["Vishal Chawla","The Block"]}