{"summary":"Superstate has introduced its first product — an Ethereum-based short-duration U.S. government securities fund called USTB.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275554\/robert-leshner-superstate-ethereum-tokenized-fund-ustb","publishDate":"2024-02-01T10:00:07","id":1122,"type":null,"title":"Robert Leshner&#x27;s Superstate introduces Ethereum-based tokenized fund","category":["COMPANIES"],"content":["Tokenized asset management firm Superstate has introduced its first product offering — the Superstate Short Duration U.S. Government Securities Fund, USTB.","USTB is a private fund, tokenized on the <a href=\"https:\/\/etherscan.io\/address\/0x43415eB6ff9DB7E26A15b704e7A3eDCe97d31C4e\" data-v-f87c67ca=\"\">Ethereum<\/a> blockchain, immediately available to U.S. qualified purchasers. It provides investors a compliant alternative to traditional funds, according to a statement.","The tokenized fund invests in short-duration U.S. Treasury and U.S. Agency securities. It targets the federal funds rate, with a 0.15% management fee, and is purchasable and redeemable by accepted investors via Circle’s USDC stablecoin.","“USTB is an opportunity to pilot Superstate’s fund tokenization platform, and is the first of many steps to develop regulated investment tokens,” Superstate CEO and co-founder Robert Leshner said. Leshner is also a Partner at VC firm Robot Ventures and the founder of DeFi lending platform Compound.","Superstate said the fund offers the benefit of on-chain transferable ownership — facilitated by USTB’s Ethereum-based allowlist. Peer-to-peer transactions will also be possible in the future, according to the firm.","Investors can self-custody USTB in an on-chain address of their choice, such as a single-signature, multi-signature or multi-party computation wallet. Those who do not want to custody their own assets also have the option to use the U.S.-based qualified custodian and federally chartered crypto bank Anchorage Digital Bank National Association, or BitGo, a qualified custodian and New York state chartered trust.","The fund is similar to Franklin Templeton’s on-chain U.S. Government Money Fund, launched in 2021 to become the <a href=\"https:\/\/www.theblock.co\/post\/228445\/franklin-templeton-fund-polygon\" data-v-f87c67ca=\"\">first<\/a> U.S.-registered mutual fund using a public blockchain to process transactions and record share ownership.","Superstate <a href=\"https:\/\/www.theblock.co\/post\/236966\/superstate-files-plan-to-launch-a-tokenized-municipal-bond\" data-v-f87c67ca=\"\">filed<\/a> a prospectus with the Securities and Exchange Commission for the fund in July 2023, following the announcement of raising $4 million in seed financing a month prior. “Our vision is to create an SEC registered investment product that over time, competes with stablecoins to become the reserve asset and settlement choice of crypto,” the firm said at the time.","In November, Superstate closed a <a href=\"https:\/\/superstate.co\/blog\/superstate-announces-series-a-financing\" data-v-f87c67ca=\"\">$14 million<\/a> Series A funding round co-led by Distributed Global and CoinFund.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"USTB","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$14 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Superstate Short Duration U.S. Government Securities Fund","content":"ORGANIZATION"},{"type":"0.15%","content":"PERCENT"},{"type":"Anchorage Digital Bank National Association","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Superstate","content":"ORGANIZATION"},{"type":"Robert Leshner","content":"PERSON"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"},{"type":"Circle’s USDC","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","INVESTMENT FIRMS","TOKENIZATION","USDC"],"authors":["James Hunt","The Block"]}