{"summary":"South Korea announced Wednesday that crypto criminals committing illicit market acts could face life imprisonment.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276396\/south-korea-to-enforce-tougher-crypto-law-with-potential-life-sentence","publishDate":"2024-02-07T03:47:48","id":11226,"type":null,"title":"South Korea to enforce tougher crypto law with potential life sentence","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">South Korea’s Financial Services Commission (FSC) announced Wednesday that crypto criminals committing illicit market acts could face criminal punishments, including life imprisonment, upon commencement of the country’s new crypto law on July 19.<\/span>","<span data-v-f87c67ca=\"\">The FSC said in a Wednesday <\/span><a href=\"https:\/\/www.fsc.go.kr\/no010101\/81680?srchCtgry=&amp;curPage=&amp;srchKey=&amp;srchText=&amp;srchBeginDt=&amp;srchEndDt=\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that violations of the new crypto law could lead to at least one year of imprisonment or fines ranging from three to five times the amount of illegal gains. Individuals who earned over 5 billion Korean won ($3.76 million) from such violations could face a life sentence or a penalty of double the proceeds.<\/span>","<span data-v-f87c67ca=\"\">In July 2023, the country’s lawmakers passed the “<\/span><a href=\"https:\/\/www.theblock.co\/post\/237190\/south-korean-lawmakers-pass-crypto-bill-to-protect-investors\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Virtual Asset User Protection Act<\/span><\/a><span data-v-f87c67ca=\"\">” with a one-year grace period. The legislation aims to eradicate illicit market acts, such as using undisclosed information for crypto investments, manipulating market prices and engaging in fraudulent transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The act also requires cryptocurrency service providers to safeguard over 80% of deposits in cold storage to protect user funds and enroll in insurance programs for potential user compensation in the event of security breaches.<\/span>","<span data-v-f87c67ca=\"\">The new law is part of South Korea’s two-part legislation that seeks to establish a regulatory framework for the crypto industry. The second half of the regulation, currently under development, focuses on standardizing crypto token issuance and information disclosure for investors.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"’s Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$3.76 million","content":"MONEY"},{"type":"5 billion","content":"MONEY"},{"type":"FSC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"July 19","content":"DATE"},{"type":"July 2023","content":"DATE"}],"hashtag":["ASIAN REGULATION","CRIME"],"authors":["Danny Park","The Block"]}