{"summary":"Gemini Earn offers up to 7.4% yield and supports crypto assets, including DeFi coins. The feature is available in all 50 U.S. states.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93414\/gemini-earn-interest-earning-program-up-to-7-4-yield","publishDate":"2021-02-02T07:00:23","id":11225,"type":null,"title":"Gemini launches interest-earning program called Earn","category":["EXCHANGES"],"content":["Crypto exchange Gemini has launched a new interest-earning program called Earn, which offers up to 7.4% yield.","The program, initially available for select Gemini customers, will be rolled out to all later this month, the exchange announced Tuesday. The program will be available in all 50 U.S. states, including New York.","<a href=\"https:\/\/www.gemini.com\/earn\" data-v-f87c67ca=\"\">Gemini Earn<\/a> supports all 26 crypto assets the exchange supports on its trading platform, including decentralized finance (DeFi) coins, such as Uniswap and Aave.","The highest yield (7.4%), however, is only available on Filecoin. For the rest of the supported coins, the interest rate ranges from 1.54% to 5.83%.","The most popular cryptocurrencies, bitcoin (BTC) and ether (ETH), each yield 3.05%.","Gemini rival BlockFi, on the other hand, <a href=\"https:\/\/blockfi.com\/rates\/\" data-v-f87c67ca=\"\">offers up to 6% interest rate<\/a> on bitcoin deposits and 5.25% for ether deposits. BlockFi's feature, however, supports limited coins and is not available for users based in New York.","Gemini Earn, on the other hand, appears to be riskier. \"Loans made through the Program are unsecured. You have exposure to Borrower credit risk, and Borrowers are not required to post collateral to you or to Gemini,\" <a href=\"https:\/\/www.gemini.com\/legal\/gemini-earn-program-terms-and-authorization-agreement#section-2-participation-in-the-program\" data-v-f87c67ca=\"\">read the terms of the program<\/a>.","That means users could lose all of their deposits in case a borrower defaults.","\"The Borrower is not required to custody or maintain the Loaned Digital Assets with Gemini or any other Gemini-controlled account,\" per the terms. \"Gemini will not be responsible for any Digital Assets once they leave Gemini’s custody. Loans are not insured by Gemini or any governmental program or institution.\"","BlockFi's offering has both secured and unsecured loans, according to its <a href=\"https:\/\/blockfi.com\/interest-account-terms\" data-v-f87c67ca=\"\">terms of service<\/a>.","\"We have vetted institutional lending partners, such as Genesis Global Capital,\" Gemini COO Noah Perlman told The Block, adding that these partners find borrowers and lend customers' funds in exchange for an interest payment.","\"There is a high demand for crypto among institutional borrowers who use it to fund their operations and investment strategies, so they are willing to pay competitive market rates to borrow crypto,\" said Perlman.","After the publication of this story, a Gemini spokesperson told The Block that the exchange reviews lending partners' collateralization management processes and that lenders' loans are \"sufficiently collateralized.\"","\"Additionally, on a periodic basis we will conduct an analysis of our partners' cash flow, balance sheet, and financial statements to ensure the appropriate risk ratios and healthy financial condition of our partner,\" said the spokesperson. \"Our borrowers in the Earn program will always be fully disclosed to users so they can make an informed decision to participate.\"","The launch of Gemini Earn follows the exchange's <a href=\"https:\/\/www.theblockcrypto.com\/post\/91236\/gemini-acquires-blockrize-launching-credit-card-bitcoin-btc-rewards-crypto\" data-v-f87c67ca=\"\">credit card<\/a> launch announcement last month. When asked whether Gemini is planning to become a full-fledged crypto financial services firm like BlockFi and others, Perlman told The Block: \"We will continue to provide a broad suite of financial products that blend offerings from traditional finance and the cryptocurrency industry.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Gemini","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"7.4%","content":"PERCENT"},{"type":"5.83%","content":"PERCENT"},{"type":"Gemini","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Noah Perlman","content":"PERSON"},{"type":"3.05%","content":"PERCENT"},{"type":"5.25%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"1.54%","content":"PERCENT"},{"type":"Perlman","content":"PERSON"}],"hashtag":["AAVE","BLOCKFI","GEMINI"],"authors":["Yogita Khatri","The Block"]}