{"summary":"China’s industrial ministry said it plans to formulate strategy documents to boost NFT and decentralized app development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268528\/china-nft-dapp-development-crypto-ban","publishDate":"2023-12-20T04:17:58","id":11220,"type":null,"title":"China pledges to boost NFT, dapp development despite crypto trading ban","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">China intends to encourage the development of non-fungible tokens and decentralized applications as the country continues embracing blockchain technology — despite a cryptocurrency ban. <\/span><span data-v-f87c67ca=\"\">The Ministry of Industry and Information Technology said in a <\/span><a href=\"https:\/\/www.miit.gov.cn\/zwgk\/jytafwgk\/art\/2023\/art_7eba1016ef5a4d98979b0167f38e4b35.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">document<\/span><\/a><span data-v-f87c67ca=\"\"> released on Tuesday that it plans to formulate strategy documents to clarify the development path of web3.<\/span>","<span data-v-f87c67ca=\"\">“The emphasis will be on key areas such as governance and industry, with encouragement for the exploration of new business models like NFTs and decentralized applications, expediting innovative applications and the construction of a digital ecosystem for Web 3.0,” the central government said in the document, set to address inquiries from Johnny Ng, a member of the CPPCC National Committee, the country’s top political advisory body.<\/span>","<span data-v-f87c67ca=\"\">The ministry added that it plans to launch pilots related to distributed digital identity to explore web3 digital identity authentication and management.<\/span>","<span data-v-f87c67ca=\"\">The central government’s latest encouragement towards web3 development comes after several local governments pledged to develop the metaverse industry earlier this year. Sichuan <\/span><span data-v-f87c67ca=\"\">— a southwestern Chinese province that was once a crypto mining hub prior to the country’s <\/span><a href=\"https:\/\/www.theblock.co\/post\/108916\/sichuan-orders-state-power-grid-to-cut-supply-for-26-bitcoin-mining-farms\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">mining ban<\/span><\/a><span data-v-f87c67ca=\"\"> — pledged in August that it aims to <\/span><a href=\"https:\/\/www.theblock.co\/post\/245921\/china-sichuan-metaverse-2025\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">grow its metaverse industry<\/span><\/a><span data-v-f87c67ca=\"\"> to reach a market size of 250 billion yuan ($35.1 billion) by 2025.<\/span>","<span data-v-f87c67ca=\"\">While China banned crypto trading on the mainland in September 2021, the trading of home-grown NFTs persisted but remained in a regulatory gray area.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, state-backed Blockchain-based Service Network China launched a national-level real-name decentralized identifier system in support of the country’s Ministry of Public Security research institute.<\/span>","<span data-v-f87c67ca=\"\">“China RealDID is viewed as an extension of Anicert’s Cyber Trusted Identity,” BSN said in a statement shared with The Block, adding that the system launch is a “bold step in personal data protection.” With the system, users can register or log into a commercial website with their DID addresses and private keys, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">“Despite its ban on cryptocurrencies, China’s progress in blockchain technology is noteworthy, particularly in pioneering the Real-Name Decentralized Identifier to the Web3 domain,” BSN, the developer of China’s national blockchain infrastructure, noted.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Johnny Ng","content":"PERSON"},{"type":"September 2021","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ministry of Industry and Information Technology","content":"ORGANIZATION"},{"type":"Anicert’s Cyber Trusted Identity","content":"ORGANIZATION"},{"type":"Blockchain","content":"PERSON"},{"type":"250 billion yuan","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"’s Ministry of Public Security","content":"ORGANIZATION"},{"type":"$35.1 billion","content":"MONEY"},{"type":"CPPCC National Committee","content":"ORGANIZATION"},{"type":"Service Network China","content":"ORGANIZATION"},{"type":"BSN","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["ASIAN REGULATION","DECENTRALIZED INFRASTRUCTURE","IDENTITY"],"authors":["Timmy Shen","The Block"]}