{"summary":"Coinbase has now decided to completely shut down its Borrow program for retail customers, effective November 20.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240825\/coinbase-borrow-bitcoin-loans-shut-retail","publishDate":"2023-07-20T16:59:05","id":11237,"type":null,"title":"Coinbase to fully sunset bitcoin-backed loan program for retail customers","category":["COMPANIES"],"content":["Coinbase will shut down the Borrow program for retail customers that enabled them to obtain cash loans using bitcoin as collateral.","In May, Coinbase <a href=\"https:\/\/www.theblock.co\/post\/229454\/bitcoin-coinbase-borrow\" data-v-f87c67ca=\"\">said<\/a> customers would no longer be able to take out new loans with Borrow. Now the company says loan holders have until November 20 to pay any outstanding balances or the crypto exchange will sell the bitcoin collateral to close the loans, according to an email it sent to customers that was seen by The Block.","\"We have decided to fully close Coinbase Borrow for retail users effective November 20, 2023 in order to focus our resources on the products and services that our customers care about most,\" a Coinbase spokesperson told The Block. \"We have notified impacted loan holders and are <a href=\"https:\/\/help.coinbase.com\/en\/coinbase\/trading-and-funding\/borrow\/getting-started?utm_source=Iterable&amp;utm_medium=email&amp;utm_campaign=campaign_\" data-v-f87c67ca=\"\">taking extra measures<\/a> to ensure a smooth transition for them, including providing a four month loan repayment period and access to prioritized customer support through Coinbase One.\"","Notably, the move only applies to retail customers of Coinbase and not its Prime or institutional customers.","The full termination of the Borrow program comes amid a <a href=\"https:\/\/www.theblock.co\/post\/240149\/coinbase-staking-pause-in-four-states-illustrates-regulatory-risk-berenberg\" data-v-f87c67ca=\"\">legal battle<\/a> between Coinbase and the U.S. Securities and Exchange Commission. The SEC <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">sued<\/a> Coinbase last month for failing to register with the agency and selling many tokens that are allegedly unregistered securities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"November 20","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"November 20, 2023","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Yogita Khatri","The Block"]}