{"summary":"The troubles came shortly after the company announced that Longer Tweets were now live in U.S. for subscribers of the Twitter Blue paid service.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209950\/crypto-twitter-pokes-fun-at-twitter-on-twitter-amid-reports-of-problems","publishDate":"2023-02-08T18:13:16","id":11238,"type":null,"title":"Crypto Twitter pokes fun at Twitter, on Twitter, amid reports of problems","category":["COMPANIES"],"content":["Crypto Twitter took to the social network on Wednesday afternoon to poke fun at the service run by Elon Musk amid reports of an outage that left some users unable to tweet.","\"Elon can't keep Twitter running but thinks he can take us to Mars,\" wrote crypto YouTuber Tiffany Fong.","","","While Twitter's API status page said that all systems were operational, some users reported that they were \"over the daily limit for sending Tweets.\" Downdectector.com, which tracks outages, was able to <a href=\"https:\/\/twitter.com\/downdetector\/status\/1623438908057870337\" data-v-f87c67ca=\"\">report on Twitter<\/a> that the social network had been having issues since 4:49 p.m. EST.","The troubles came shortly after the company <a href=\"https:\/\/twitter.com\/Twitter\/status\/1623411536243965954\" data-v-f87c67ca=\"\">announced<\/a> that Longer Tweets were now live in U.S. for subscribers of the Twitter Blue paid service.&nbsp;","\"Twitter may not be working as expected for some of you,\" Twitter's support account <a href=\"https:\/\/twitter.com\/TwitterSupport\/status\/1623463646444634113\" data-v-f87c67ca=\"\">tweeted<\/a> Wednesday evening. \"Sorry for the trouble. We're aware and working to get this fixed.\"","","","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"YouTuber Tiffany Fong","content":"ORGANIZATION"},{"type":"4:49 p.m.","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"evening","content":"TIME"},{"type":"afternoon","content":"TIME"},{"type":"Elon","content":"PERSON"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}