{"summary":"Circle has responded to a pubic consultation on a proposal to extend an EU financial regulator&#x27;s oversight to the cryptocurrency sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249300\/circle-recommends-tweaks-to-eu-regulators-proposed-crypto-guidelines","publishDate":"2023-09-05T16:21:39","id":11239,"type":null,"title":"Circle recommends tweaks to EU regulator&#x27;s proposed crypto guidelines","category":["POLICY"],"content":["Circle <a href=\"https:\/\/www.circle.com\/blog\/circles-response-to-the-eba-consultation-on-revised-guidelines-on-money-laundering-and-terrorist-financing-risk-factors\" data-v-f87c67ca=\"\">responded<\/a> to a pubic<a href=\"https:\/\/www.eba.europa.eu\/eba-consults-amendments-guidelines-money-laundering-and-terrorist-financing-risk-factors-include\" data-v-f87c67ca=\"\"> consultation<\/a> on a proposal from the European Banking Authority to extend the scope of its money laundering and terrorist financing guidelines to crypto-asset service providers, raising concerns about some of the terminology.&nbsp;","A point of concern raised by Circle was the use of the term \"providers of services in the crypto-assets ecosystem,\" in the EBA's proposal.","\"This term lacks the necessary precision to exclusively comprise businesses subject to regulation under MiCA in the EU,\" Circle said.","The stablecoin issuer added that the guidelines should not extend to providers that are exempt from MiCA's regulatory scope.","\"If certain EU firms fall outside of MiCA's regulatory perimeter, these should not be designated as higher risk. The fact that they are left out of EU regulations indicate that they do not warrant financial, prudential and AML regulation in the EU,\" Circle said.","Circle expressed concern that the term \"providers of services in the crypto-assets ecosystem\" is overly broad in its definition, arguing that the vagueness of the phrase could unintentionally encompass providers of technology and ancillary services, such as blockchain analytics and web infrastructure.","The new EBA guidelines need to be technology neutral and follow principles established by previously adopted EU legislation such as the Markets in Crypto-Assets Regulation and the Transfer of Funds Regulation, Circle argued.","Circle said that self-hosted wallets were not a general indicator of high-risk. The stablecoin issuer pointed to a July 2021 FATF <a href=\"https:\/\/www.fatf-gafi.org\/content\/dam\/fatf-gafi\/guidance\/Second-12-Month-Review-Revised-FATF-Standards-Virtual-Assets-VASPS.pdf.coredownload.pdf\" data-v-f87c67ca=\"\">review<\/a> that found a significant degree of variability in the data related to illicit transactions using self-hosted wallets. The USDC issuer said this revealed a&nbsp;lack of consensus on the size of the P2P sector and its associated money laundering and terrorist financing risk.&nbsp;","\"The implementation of the TFR will already address illicit finance risks when transacting with self-hosted wallets through a well-established risk-based approach,\" Circle added.","In May, the European Banking Authority launched a public consultation on amendments to its guidelines on money laundering and terrorist financing risk factors. The proposed changes would extend the scope of its guidelines to crypto-asset service providers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Banking Authority","content":"ORGANIZATION"},{"type":"EBA","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"TFR","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"\" Circle","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"FATF","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["EUROPEAN COMMISSION","EUROPEAN COUNCIL","EUROPEAN PARLIAMENT","EUROZONE REGULATION"],"authors":["Brian McGleenon","The Block"]}