{"summary":"Cryptocurrency exchanges FTX and BitMEX have committed to becoming carbon neutral through donations to carbon offsetting companies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105642\/crypto-exchanges-ftx-bitmex-offset-bitcoin-carbon-emissions","publishDate":"2021-05-21T09:23:16","id":11247,"type":null,"title":"Crypto exchanges FTX, BitMEX move to offset carbon emissions","category":["EXCHANGES"],"content":["Crypto exchange operators FTX and <a href=\"https:\/\/www.theblockcrypto.com\/daily\/45523\/bitmex-exposed-thousands-of-client-emails-but-big-otc-traders-say-theyre-unfazed\" data-v-f87c67ca=\"\">BitMEX<\/a> have committed to becoming carbon neutral through donations.","FTX CEO Sam Bankman-Fried <a href=\"https:\/\/twitter.com\/SBF_Alameda\/status\/1395477530858033154?s=20\" data-v-f87c67ca=\"\">did the math<\/a> of how much \"dirty electricity\" bitcoin, ether, and other proof-of-work coins consume to mine. The calculation considered various factors, including mining and electricity costs. Based on this calculation, Bankman-Fried came up with a ratio of $0.0026 for every $1, meaning for every $1 spent to mine a proof-of-work coin, $0.0026 worth of carbon is emitted.","To that end, FTX decided that it would donate $0.0026 for every $1 its clients pay in blockchain or gas fees to become carbon neutral.","FTX estimates that it will pay roughly $60 million in blockchain fees this year, which would imply about $150,000 in carbon offsetting costs. But given the uncertainty in the calculations, the exchange operator has decided to cover all bases by donating $1 million this year to carbon offsetting organizations, including Cool Earth.","Using the same math, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/49633\/early-bitmex-investor-sues-crypto-exchange-for-allegedly-denying-him-50m-worth-of-equity\" data-v-f87c67ca=\"\">BitMEX<\/a> <a href=\"https:\/\/blog.bitmex.com\/bitmex-commits-to-carbon-neutrality\/\" data-v-f87c67ca=\"\">said<\/a> it would also donate \"at least $0.0026 for every $1 of blockchain fees our clients pay out.\" The exchange operator did not provide any estimates of how much this would come to.","Concerns around cryptocurrency's environmental footprint recently ignited when <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104720\/tesla-stops-taking-bitcoin-payments\" data-v-f87c67ca=\"\">Tesla CEO Elon Musk said<\/a>, earlier this month, that his company would no longer accept bitcoin, citing the \"great cost to the environment.\"","But <a href=\"https:\/\/www.theblockcrypto.com\/post\/102621\/bitcoin-carbon-footprint-academic-paper\" data-v-f87c67ca=\"\">as The Block reported recently<\/a>, it is extremely challenging to measure bitcoin's carbon footprint due to its decentralized nature. It is also difficult to quantify how much of the energy the network uses is sourced from renewables.","If energy authorities in different countries could identify how many bitcoin mining farms are there in their regions, how much energy they consume and what type of energy they use, that could theoretically measure bitcoin's carbon footprint, but it's no easy task.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"$150,000","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$60 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"$0.0026","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BITCOIN","BITMEX","FTX"],"authors":["Yogita Khatri","The Block"]}