{"summary":"Blockchain gaming executives weigh in on what Epic Games decision to list Adults Only-rated titles means for the emerging sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268716\/epic-games-listing-of-adults-only-blockchain-video-games-is-a-boon-for-industry","publishDate":"2023-12-21T10:21:21","id":11243,"type":null,"title":"Epic Games listing of &#x27;Adults Only&#x27; blockchain video games is a boon for industry","category":["GAMING"],"content":["<span data-v-f87c67ca=\"\">Epic Games made a major policy change this week when it said it would list games on its online store rated \"Adults Only\" if a title is given the rating due to its utilization of blockchain technology.<\/span>","<span data-v-f87c67ca=\"\">\"'<\/span><span data-v-f87c67ca=\"\">Gods Unchained' and 'Striker Manager 3' have returned to the store after a change in our content policy regarding ratings for blockchain-based games,\" Epic Games said in a <\/span><a href=\"https:\/\/twitter.com\/EpicGames\/status\/1737200788622225625?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1737200788622225625%7Ctwgr%5E5496af7c852369e8ef118e24f6efdb839f06cd15%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.theverge.com%2F2023%2F12%2F19%2F24008602%2Fepic-games-store-adults-only-blockchain-games\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post on X<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">While \"products with 'Adults Only' ratings cannot be distributed on Epic Games Store,\" according to the company’s <a href=\"https:\/\/dev.epicgames.com\/docs\/epic-games-store\/requirements-guidelines\/content-ratings\/content-guidelines\" data-v-f87c67ca=\"\">policy guidelines<\/a>, after amending its rules, Epic Games has said it will make exceptions \"for products in cases where an [Adults Only] rating was applied solely due to the usage of blockchain or NFT technology.\"<\/span>","The move came after Epic Games at one point removed blockchain games <span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">Gods Unchained\" and \"Striker Manager 3\" from its online store because the titles had scored an \"Adults Only\" rating.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Entertainment Software Rating Board, or ESRB, is responsible for assigning ratings to video games. \"Adults Only\" deems a game suitable only for users 18 years old and above, while the next classification down, \"Mature,\" is meant for games suitable for gamers 17 years old and above. For context, titles like \"<\/span><a href=\"https:\/\/www.esrb.org\/ratings\/33073\/grand-theft-auto-v\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Grand Theft Auto V<\/span><\/a><span data-v-f87c67ca=\"\">,\" which includes <\/span><span data-v-f87c67ca=\"\">nudity and strong sexual content,<\/span><span data-v-f87c67ca=\"\"> and \"<\/span><a href=\"https:\/\/www.esrb.org\/ratings\/36876\/baldurs-gate-3\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Baldur’s Gate 3<\/span><\/a><span data-v-f87c67ca=\"\">,\" which has some nudity, are both rated \"Mature\" by the ESRB.<\/span>","<span data-v-f87c67ca=\"\">\"There has been quite a bit of tension and resistance around web3 gaming from the more traditional gaming industry,\" Justin Edwards, head of gaming at Telos, told The Block. \"This move by Epic is a step in the right direction toward mainstream acceptance and adoption, while also enhancing the legitimacy of web3 games.\"<\/span>","<span data-v-f87c67ca=\"\">Blockchain gaming, still a sector in its infancy when compared to traditional gaming, has been quick to <a href=\"https:\/\/www.theblock.co\/post\/258455\/magic-the-gathering-creators-crypto-game-lands-on-epic-game-store\" data-v-f87c67ca=\"\">celebrate<\/a> when titles have been cleared to be listed on distribution platforms like the Epic Game Store, Amazon Prime and the Apple App Store. The sector has yet to deliver a major commercial hit and still suffers from the reputation the play-to-earn title \"Axie Infinity\" helped give blockchain gaming.<\/span>","<span data-v-f87c67ca=\"\">Justin Hulog, chief studio officer at Immutable Games, which oversees \"Gods Unchained,\" appeared to take the news in stride while waxing optimistic about the future of ratings. \"We are pleased with the Epic Game Store decision to allow 'Gods Unchained' back on the platform,\" he told The Block. \"We look forward to ongoing conversations with ratings boards and distribution platforms, like Epic Games Store.\"<\/span>","<span data-v-f87c67ca=\"\">Other web3 gaming executives see the ESRB as presenting a major obstacle for web3 gaming. With web3, or blockchain games, players are meant to be able to own and trade their digital assets, which are generally NFTs.<\/span>","<span data-v-f87c67ca=\"\">\"Whether intentional or not, the ESRB is being weaponized against game developers to stifle innovation in gaming,\" <\/span><span data-v-f87c67ca=\"\">Jacobc.eth, founder and CEO of the game launcher HyperPlay, also told The Block. \"<\/span><span data-v-f87c67ca=\"\">The ESRB’s decision to classify web3 games as 'Adults Only' with a blanket policy de-platforms an entire subsection of games rather than engage with creators to understand the new technology and update its antiquated policies to encompass web3 games.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ESRB said it has not implemented a blanket policy.<\/span>","<span data-v-f87c67ca=\"\">\"<\/span><span data-v-f87c67ca=\"\">It is not a requirement that blockchain enabled games require a default 'Adults Only' rating assignment … it is entirely dependent on how said feature is implemented in the game,\" a spokesperson said by email. \"The ESRB age and content rating system assesses whether products may reward real money, prizes with real world value, or something that can be exchanged for or converted to real money (i.e., gift cards, cryptocurrency, etc.), as well as whether there is cash spent to be eligible for such rewards.\"<\/span>","<span data-v-f87c67ca=\"\">The ESRB went on to say \"it is possible that a blockchain-enabled game or app will warrant an 'Adults Only' rating category assignment due to a combination of the factors\" tied to gamers being able to receive monetary rewards.<\/span>","<span data-v-f87c67ca=\"\">Telos’ Edwards speculated that potentially the ESRB has failed to update its policy in order to better reflect the current landscape. \"<\/span><span data-v-f87c67ca=\"\">I would assume that the ESRB’s issues with blockchain gaming are related to NFTs and its perception of gambling as we saw with loot boxes and microtransactions in the past,\" he said. \"The web3 gaming sector has matured with improved products and games that are focused on good game design and game play, rather than making a quick buck.\"<\/span>","\"It's going to be up to developers like us to work with the ESRB to change the 'Adults Only' rating for web3 games,\" Mark Long, CEO&nbsp;of the first-person-shooter blockchain game \"Shrapnel\" told The Block. The \"Roblox DevEx program allows 13-year-olds to exchange earned Robux for real-world currency and its rated 'Teen.' I think it's just a matter of educating the ESRB that web3 is no different.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Entertainment Software Rating Board","content":"ORGANIZATION"},{"type":"Telos","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Epic","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Apple App Store","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Edwards","content":"PERSON"},{"type":"Immutable Games","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Justin Edwards","content":"PERSON"},{"type":"Baldur’s","content":"PERSON"},{"type":"Justin Hulog","content":"PERSON"},{"type":"ESRB","content":"ORGANIZATION"},{"type":"Gate 3","content":"LOCATION"},{"type":"Epic Games","content":"ORGANIZATION"},{"type":"Mark Long","content":"PERSON"}],"hashtag":["GAME","TRADING CARD GAMES"],"authors":["RT Watson","The Block"]}