{"summary":"Twitter has taken its &quot;most severe enforcement action&quot; against Aave founder Stani Kulechov&#x27;s account by permanently banning it.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143963\/aave-founder-stani-kulechov-twitter-account-suspended-joke","publishDate":"2022-04-28T04:57:58","id":11242,"type":null,"title":"Aave founder Stani Kulechov&#x27;s Twitter account suspended after CEO tweet","category":["STARTUPS"],"content":["Twitter permanently banned Aave founder Stani Kulechov's <a href=\"https:\/\/twitter.com\/StaniKulechov\" data-v-f87c67ca=\"\">account<\/a> on Thursday after the social media giant failed to see the funny side of a tweet.","The suspension came a day after the founder of the popular DeFi lending platform tweeted he was joining Twitter as interim CEO, causing confusion as to whether he was serious or joking.&nbsp;","","","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Twitter <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/post\/143257\/twitter-accepts-elon-musks-44-billion-takeover-offer\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">accepted<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> a $44 billion takeover offer from Elon Musk on Monday, with the Tesla CEO arguing that one of his main motivations in buying the company was to promote free speech. <\/span>\"Free speech is the bedrock of a functioning democracy, and Twitter is the digital town square where matters vital to the future of humanity are debated,\" Musk <a href=\"https:\/\/www.prnewswire.com\/news-releases\/elon-musk-to-acquire-twitter-301532245.html\" data-v-f87c67ca=\"\">said<\/a> in a statement this week.","Kulechov, who had more than 170,000 followers on Twitter, hit back against the ban in comments to The Block.&nbsp;","\"Musk has claimed that he believes Twitter should be an unregulated global town hall, and Twitter has long prided themselves on being the arbiters of public conversation,\" Kulechov said. \"But if that was truly the case, then the digital town hall would be owned by the public as well, not just hosted by a centralized force that could close their doors to people at their choosing.\"","He argued that this type of action – \"the removing of a profile and a following that one has spent years building\" — had inspired Aave to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/133390\/aave-officially-debuts-protocol-for-decentralized-social-media-dubbed-lens\" data-v-f87c67ca=\"\">launch<\/a> its own decentralized social media ecosystem in February, dubbed Lens Protocol.&nbsp;","\"A user should have full ownership over their content. That means that no centralized entity can take it away from you. With apps powered by Lens, if you do not like the policy of one platform, you can take your profile with you to another one,\" Kulechov said.&nbsp;","Since Kulechov's account suspension is permanent, he will not be allowed to create new accounts, according to <a href=\"https:\/\/help.twitter.com\/en\/rules-and-policies\/notices-on-twitter\" data-v-f87c67ca=\"\">Twitter rules<\/a>.","\"When we permanently suspend an account, we notify people that they have been suspended for abuse violations, and explain which policy or policies they have violated and which content was in violation,\" the rules say.","Violators can appeal permanent suspensions if they believe Twitter has made an error. Upon appeal, if Twitter finds that a suspension is valid, it responds to the appeal with information on the policy that the account has violated.","Kulechov didn't say whether he plans to appeal the ban.&nbsp; Twitter didn't respond to The Block's requests for comments.","<em data-v-f87c67ca=\"\">Updated 10:05 AM ET to include Kulechov's comments.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Tesla CEO","content":"ORGANIZATION"},{"type":"Musk","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Stani Kulechov","content":"PERSON"},{"type":"Kulechov","content":"PERSON"}],"hashtag":["AAVE","ELON MUSK","TWITTER"],"authors":["Yogita Khatri","The Block"]}