{"summary":"Roche Freedman has parted ways with founding partner Kyle Roche and plans to rename itself Freedman Normand Friedland.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178768\/roche-freedman-rebrands-and-parts-ways-with-kyle-roche-after-scandal","publishDate":"2022-10-20T15:03:07","id":1125,"type":null,"title":"Kyle Roche launches own crypto class action practice following hidden camera fallout","category":["LEGAL"],"content":["Kyle Roche, the lawyer at the center of an unusual hidden camera controversy, has formed his own legal practice after departing the firm he co-founded.&nbsp;","According to a filing in the Celsius bankruptcy giving notice to the court of the change, Roche now has his own practice after departing the high-profile crypto class action firm he co-founded, Roche Freedman. He will continue to represent clients in that bankruptcy.&nbsp;","Roche and his old firm, now rebranded as Freedman Normand Friedland LLP, parted ways this week Roche in the wake of controversy that saw the firm removed as interim class counsel from one of its highest profile cases.","Roche found himself at the center of a scandal last month when anonymous site Crypto Leaks published a series of videos in which he appeared to discuss an improper relationship with blockchain development firm Ava Labs. The footage, which Roche said was heavily edited, taken out of context and filmed without his consent while he was intoxicated, drew conclusions that Roche had filed cases on behalf of Ava Labs and utilized the discovery process in other class actions to benefit the firm. Both Roche Freedman and Ava Labs have vehemently denied these claims.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/166816\/attorney-files-to-withdraw-from-tether-bitfinex-tron-and-binance-suits\" data-v-f87c67ca=\"\">Roche moved to withdraw<\/a> from class action cases he led following the leaked clips. Defendants in the <a href=\"https:\/\/www.theblock.co\/post\/42299\/class-action-lawsuit-against-bitfinex-and-tether-filed-by-lawyers-who-successfully-sued-craig-wrightThe\" data-v-f87c67ca=\"\">Tether class action<\/a>, a case seeking to take exchanges to task over an alleged market manipulation scheme they say defrauded investors of $1.4 trillion, <a href=\"https:\/\/www.theblock.co\/post\/167286\/tether-asks-court-to-terminate-roche-freedman-from-class-action\" data-v-f87c67ca=\"\">called for Roche Freedman's<\/a> removal as interim class counsel in the case. Roche Freedman pushed back on those requests, saying they effectively walled off Roche from the class action group and forfeited any financial interests in the cases he once led, but were still replaced by the two remaining class firms.&nbsp;","Due to the departure of Roche, a founding partner, the firm will now be known as Freedman Normand Friedland LLP, for the firm's other partners, Edward Normand and Amos Friedland.&nbsp;","\"We are focused on continuing to provide our clients with top quality representation and are proud of the firm’s accomplishments to date,\" the firm said in a statement to The Block. \"We wish Kyle the best in his future endeavors.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Roche Freedman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Kyle Roche","content":"PERSON"},{"type":"Roche Freedman","content":"ORGANIZATION"},{"type":"Edward Normand","content":"PERSON"},{"type":"$1.4 trillion","content":"MONEY"},{"type":"Kyle","content":"PERSON"},{"type":"Freedman Normand Friedland LLP","content":"ORGANIZATION"},{"type":"Roche","content":"LOCATION"},{"type":"Roche","content":"PERSON"},{"type":"Amos Friedland","content":"PERSON"},{"type":"Roche","content":"ORGANIZATION"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}