{"summary":"Stablecoin issuer Tether held $1.5 billion in bitcoin as of the end of the first quarter, accounting for about 2% of its reserves.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231156\/tether-bitcoin-investments-profits","publishDate":"2023-05-17T08:00:07","id":11262,"type":null,"title":"Tether to invest up to 15% of its profits in bitcoin","category":["COMPANIES"],"content":["Tether, issuer of the world's largest stablecoin, will invest up to 15% of its profits in bitcoin as it shifts its reserves towards crypto and away from U.S. government debt.&nbsp;","Tether will make regular purchases and self-custody all of its bitcoin holdings, the company said in a statement. It held $1.5 billion in bitcoin as of the end of the first quarter, accounting for about 2% of its reserves. About 85% were held in cash, cash equivalents and other short-term deposits — mainly Treasury bills.&nbsp;","The news comes a few days after <a href=\"https:\/\/www.theblock.co\/post\/230241\/tether-attestation-report-q1-2023\" data-v-f87c67ca=\"\">Tether reported $1.5 billion in net profit for the first quarter<\/a>. The stablecoin issuer will now buy bitcoin on a regular basis and further increase its holdings, but it \"anticipates that the current and future BTC holdings in its reserves will not exceed the Shareholder Capital Cushion and will further strengthen and diversify the reserves.\"","Tether said it believes bitcoin is a great investment choice with a track record of \"impressive returns over the past decade.\" The price of the world's largest cryptocurrency has soared about 22,000% in the past decade. Bitcoin is currently trading at around $26,750, some 60% below its 2021 peak.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" title=\"BTC Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"The decision to invest in bitcoin, the world's first and largest cryptocurrency, is underpinned by its strength and potential as an investment asset,\" Paolo Ardoino, CTO of Tether, said in the statement. \"Bitcoin has continually proven its resilience and has emerged as a long-term store of value with substantial growth potential. Its limited supply, decentralized nature and widespread adoption have positioned Bitcoin as a favored choice among institutional and retail investors alike.\"","\"Our investment in Bitcoin is not only a way to enhance the performance of our portfolio, but it is also a method of aligning ourselves with a transformative technology that has the potential to reshape the way we conduct business and live our lives,\" Ardoino added.","Tether's USDT is the largest stablecoin in the market, with a supply of over 83 billion tokens,&nbsp;<a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"end of the first quarter","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"22,000%","content":"PERCENT"},{"type":"$26,750","content":"MONEY"},{"type":"$1.5 billion","content":"MONEY"},{"type":"60%","content":"PERCENT"},{"type":"85%","content":"PERCENT"},{"type":"83 billion","content":"MONEY"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Paolo Ardoino","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["TETHER"],"authors":["Yogita Khatri","The Block"]}