{"summary":"The U.S. military hired a crypto intelligence firm to review the threat cryptocurrencies may represent to national security and law enforcement, The Washington Post reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172678\/u-s-department-of-defense-taps-intelligence-firm-to-evaluate-crypto-threat-to-national-security","publishDate":"2022-09-24T19:47:36","id":11261,"type":null,"title":"U.S. Department of Defense taps intelligence firm to evaluate crypto threat to national security","category":["THE BLOCK"],"content":["The U.S. Department of Defense&nbsp;<a href=\"https:\/\/www.prnewswire.com\/news-releases\/darpa-launches-crypto-project-with-inca-digital-301632136.html\" data-v-f87c67ca=\"\">hired a crypto intelligence firm<\/a> to review the potential security threat of cryptocurrencies.","DARPA, the Defense Advanced Research Projects Agency, has tasked <a href=\"https:\/\/www.incadigital.com\/\" data-v-f87c67ca=\"\">Inca Digital<\/a> with developing tools to understand how crypto markets work and help crack down on the illicit uses of digital assets that could pose a risk to national security. DARPA is an independent agency of the U.S. Department of Defense, which is headquartered at the Pentagon.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The program underway here involves mapping out the cryptocurrency universe in some detail,” Mark Flood, a program manager with the agency, told <a href=\"https:\/\/www.washingtonpost.com\/business\/2022\/09\/23\/darpa-crypto-national-security\/\" data-v-f87c67ca=\"\">The Washington Post<\/a>.","Inca Digital, owned by veterans, and its government contracting entity, Inca Digital Federal, analyze data across crypto markets, blockchains, and news and social media to deliver intelligence to financial institutions, technology firms and government entities.","The firm announced a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/inca-digital-announces-series-a-funding-round-led-by-gts-venture-capital-and-galaxy-digital-301525482.html\" data-v-f87c67ca=\"\">Series A fundraise<\/a> led by Galaxy Digital and GTS Venture Capital in April. Other investors include Wedbush Capital and Menai Financial Group.&nbsp;","Inca Digital counts a wide range of government and private sector companies among its clientele including the Commodity Futures Trading Commission, crypto exchange FTX and brokerage firm Fidelity.","The news comes at a time when a number of government agencies take a closer look at the crypto market. The U.S. Treasury's Office of Foreign Assets Control (OFAC) recently sanctioned Tornado Cash for helping a North Korean organization launder more than $455 million worth of stolen cryptocurrency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pentagon","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Inca Digital Federal","content":"ORGANIZATION"},{"type":"Wedbush Capital","content":"ORGANIZATION"},{"type":"Inca Digital","content":"ORGANIZATION"},{"type":"GTS Venture Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DARPA","content":"ORGANIZATION"},{"type":"Menai Financial Group","content":"ORGANIZATION"},{"type":"Defense Advanced Research Projects Agency","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"The Washington Post","content":"ORGANIZATION"},{"type":"$455 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S. Department of Defense","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"U.S. Treasury's Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}