{"summary":"LeetSwap, a decentralized exchange built on Coinbase’s Layer 2 blockchain Base, halted trading amid fears that it has been exploited.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242402\/leetswap-bases-leading-dex-halts-trading-amid-reports-of-an-exploit","publishDate":"2023-07-31T22:24:42","id":11263,"type":null,"title":"LeetSwap, Base’s leading DEX, halts trading amid reports of an exploit","category":["CRYPTO ECOSYSTEMS"],"content":["LeetSwap, a decentralized exchange built on Coinbase’s Layer 2 blockchain Base, halted trading amid fears of an exploit.","“As our DEX is forked from Solidly, our factory had a security pause function,” <a href=\"https:\/\/twitter.com\/LeetSwap\/status\/1686190488506769408?s=20\" data-v-f87c67ca=\"\">LeetSwap tweeted<\/a> late on Monday. “We noticed that some pool liquidity might have been compromised and we temporarily stopped the trading to investigate.”","The statement came just before PeckShield, the crypto security firm, said that one of its community contributors reported that liquidity pairs on Base had been exploited for approximately 340 ETH (roughly $630,000), <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1686193494543802368?s=20\" data-v-f87c67ca=\"\">in a tweet citing on-chain data<\/a>.","“A hacker managed to exploit LeetSwap, the leading decentralized exchange on Base, to steal roughly $630,000 worth of ETH from various liquidity pairs of tokens on the DEX,” said Steven Zheng, director of research at The Block.","It has been a busy day for Base’s leading DEX. News of the trading pause comes shortly after Bald, a popular memecoin, crashed in value after its developer <a href=\"https:\/\/www.theblock.co\/post\/242225\/bald-memecoin-developer-liquidity-pull?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">pulled 6,800 ETH ($12.5 million)<\/a> from the token’s liquidity pool on LeetSwap.","Coinbase’s Base <a href=\"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers\" data-v-f87c67ca=\"\">opened its mainnet<\/a> for developers on July 13. The Layer 2 network aims to offer faster and cheaper crypto transactions, while keeping intact the security benefits of Ethereum.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July 13","content":"DATE"},{"type":"Steven Zheng","content":"PERSON"},{"type":"$630,000","content":"MONEY"},{"type":"$12.5 million","content":"MONEY"}],"hashtag":["BASE"],"authors":["Ryan Weeks","The Block"]}