{"summary":"Square, SoFi, and soon PayPal — fintechs are getting into crypto. But what&#x27;s happening in the opposite direction?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74320\/fintech-crypto-startups-offerings","publishDate":"2020-08-09T13:16:23","id":11260,"type":null,"title":"Fintechs are moving into bitcoin, but expect crypto startups to stay on their home turf","category":["OP-ED"],"content":["Square, SoFi, and soon PayPal.&nbsp;","The list of financial technology companies that have jumped on the crypto bandwagon continues to grow. And it makes sense — fintechs stand to cash in on such offerings, which can be more profitable than stock trading offerings, in some instances. It also provides fintechs with a way to expand their client base. Square's Cash App provides a great example of what a crypto offering can mean for a fintech company.&nbsp;","Earlier this week, Square's second-quarter earnings were prematurely released, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/74001\/square-q2-bitcoin-cash-app?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">showing<\/a> that it made $875 million in bitcoin revenue via Cash App. Cash App generated $17 million in bitcoin gross profit for the same period. Square's filing also showed total expenses related to its bitcoin offering stood at $858 million.","","","Such breakneck growth explains why PayPal wants to get in on the action. The firm is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72177\/paypal-has-reportedly-partnered-with-paxos-to-launch-its-crypto-service\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">reportedly<\/a> working with crypto startup Paxos on the launch of a cryptocurrency service. It's not clear when exactly the service will launch or how many coins it will ultimately support.&nbsp;","In any case, the reported move raises a good question for other fintech firms not active in crypto: What are you waiting for? My colleague Ryan Todd dove into that question in a column last month.&nbsp;","Today, I'm interested in exploring the flip side of that question. That is, what is keeping crypto companies—specifically those with large retail client bases—from diving into broader financial services by launching stock trading, high yield savings accounts, and other fintech services.&nbsp;","Indeed, it is a question the chief executive office of LMAX Group David Mercer has given some thought. His firm, which has operated in traditional FX trading since 2010, launched a crypto exchange in May 2018. In an interview with The Block, Mercer said that traditional brokers in equities should be concerned about crypto players expanding outside of their home turf.&nbsp;","\"I tell people in traditional finance, keep an eye on the crypto startups,\" Mercer said. \"They have provided market access to millions of clients and they could come after your business.\"<br data-v-f87c67ca=\"\">\n<u data-v-f87c67ca=\"\"><\/u><u data-v-f87c67ca=\"\"><\/u>","He went on:&nbsp;","\"Amazon, for instance, used to sell books. They thought people who buy books might also want to buy clothes, and so on. If I am sitting in a retail stockbroker, I'd be worried about crypto exchanges, because they already have my customer. They did the hard work of sales and marketing and client acquisition.\"","Mercer makes a good point. Coinbase's client base, for instance, was recently revealed to top 35 million. UK-based Blockchain.com boasts more than 51 million wallet accounts. While it's not clear how many of these accounts are active, these are certainly audiences that go up against the likes of Robinhood, which claims to have 13 million users on its stock trading platform.&nbsp;","Indeed, a number of crypto firms have explored offering stock trading services, including Blockchain.com, according to a person familiar with the business. BlockFi, the crypto lender and trading platform, might also consider it, according to chief executive Zac Prince. Prince said he loves the idea, noting that it is just \"a question of timing\/prioritization for us.\"","To be sure, Prince is known for being somewhat overly ambitious. Still, he said the opportunity would offer \"more diversified revenue streams, more holistic product offering and stickiness with clients.\"","Crypto firms, especially those in trading, could use some diversification—especially earlier this year. As my colleague Larry Cermak has noted in the past, crypto exchange revenues are 90% transactional. Thus, when trading volumes fall, revenues decline by just as much.&nbsp;","For much of the spring, stock trading dominated headlines, while large-cap cryptos like bitcoin and ether were trapped in the doldrums. Volumes and revenues were down across the board for crypto exchanges while brokers like Robinhood continued to add new clients and trading volumes in U.S. equities and options surged. As one crypto insider noted, \"these guys were missing out on the action.\"","Indeed, insiders say it wouldn't be that big of technology lift for a firm like Coinbase to offer trading in the top 50 names, for instance. That's something Blockchain.com has considered, according to the aforementioned source. But there are a few hurdles that such firms face that make launching stock trading more difficult than it appears.&nbsp;","eToro, which operates a stock and crypto offering in Europe, brought its crypto trading platform to the U.S. in March 2019. The firm has yet to launch stocks in the U.S. as it is still working with regulators, including FINRA, on approval. The firm secured its FINRA membership at the end of June and is still working on clearance for its CopyTrader feature, says Guy Hirsch, a managing director for eToro in the U.S.&nbsp;","\"It is much less risky to do the tech stuff,\" he said. \"It is pretty clear what needs to happen. On the compliance side, your intuition is correct, it is more complex.\"","Securing FINRA membership is no easy feat. The crypto backlog of crypto companies seeking such approval has been <a href=\"https:\/\/www.coindesk.com\/stonewalled-by-finra-up-to-40-crypto-securities-wait-in-limbo-for-launch\" data-v-f87c67ca=\"\">well-documented<\/a>.&nbsp;","For some crypto firms, the regulatory barriers make offering such products a non-starter, one executive in the space noted. It also might not make sense from a product roadmap perspective for many crypto firms, which still have yet to offer a full-scale product offering even for the crypto market, the person added.&nbsp;","\"We could sell stock to people,\" the person said. \"But do we want to do that instead of rolling out a better options market for bitcoin, or DeFi products, or margin trading?\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$875 million","content":"MONEY"},{"type":"quarter","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"March 2019","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"LMAX Group David Mercer","content":"ORGANIZATION"},{"type":"May 2018","content":"DATE"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Ryan Todd","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mercer","content":"PERSON"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Cash App","content":"ORGANIZATION"},{"type":"Zac Prince","content":"PERSON"},{"type":"Larry Cermak","content":"PERSON"},{"type":"$858 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Guy Hirsch","content":"PERSON"},{"type":"$17 million","content":"MONEY"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["FINTECH"],"authors":["Frank Chaparro","The Block"]}