{"summary":"Discover how Raft is transforming the DeFi landscape with the introduction of the R stablecoin, enabling stETH holders to borrow effortlessly.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233388\/raft-goes-after-13-billion-lsdfi-opportunity","publishDate":"2023-06-07T09:00:51","id":11278,"type":null,"title":"Raft Goes after $13 Billion LSDFi Opportunity","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">As the Liquid Staking Derivatives Finance (LSDFi) season progresses, the space continues to buzz with novel advancements. One such breakthrough is the introduction of <\/span><a href=\"https:\/\/raft.fi\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Raft<\/span><\/a><span data-v-f87c67ca=\"\">, a revolutionary LSDFi protocol offering unique features and strategic alliances. Today, we turn our focus to Raft’s latest development - the launch of the R stablecoin, the first US Dollar stablecoin collateralized solely by Lido Staked Ether (stETH).<\/span>","<span data-v-f87c67ca=\"\">Amidst the rapidly growing market cap of stETH, surpassing $13 billion, Raft has seized the opportunity to launch a lending protocol along with the R stablecoin. This launch presents a promising solution for Lido users in pursuit of capital-efficient ways to utilize their stETH. The protocol allows depositors to generate R, a decentralized USD stablecoin, using their stETH. <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"By accepting only stETH collateral, we eliminate fiat backing completely, providing R holders with peace of mind,”<\/span><\/i><span data-v-f87c67ca=\"\"> says co-founder David Garai.<\/span>","<span data-v-f87c67ca=\"\">Another unique feature of Raft coming soon is its <\/span><a href=\"https:\/\/raft.fi\/one-step-leverage\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">One-Step Leverage<\/span><\/a><span data-v-f87c67ca=\"\">, a game-changer that enables users to gain up to 11x leverage on stETH in a single transaction, higher than what any other platform currently offers. Beyond providing a higher leverage ratio, Raft also simplifies the typically complex multi-step transactions required to gain leverage on stETH through other lending platforms like Aave or Maker.<\/span>","<span data-v-f87c67ca=\"\">Raft isn't just about launching groundbreaking features; it’s also deeply invested in fostering a robust ecosystem through strategic collaborations and the active engagement of <\/span><a href=\"https:\/\/raft.fi\/frontend-operators\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Frontend Operators<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Raft is pushing the boundaries of what's possible in the LSDFi landscape, which you can try by <\/span><a href=\"https:\/\/app.raft.fi\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">borrowing R<\/span><\/a><span data-v-f87c67ca=\"\"> against your stETH. Its launch of the R stablecoin backed by stETH is a significant stride forward in the DeFi sector and demonstrates the team’s commitment to providing users with a reliable, and efficient suite of financial products. With its commitment to innovation and strategic expansion, and as we venture further into the LSDFi season, Raft is primed to set a new standard in DeFi, potentially making traditional protocols obsolete. Will the rest of the industry be able to keep up?<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Tempus<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tempus","content":"ORGANIZATION"},{"type":"Frontend Operators","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"David Garai","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$13 billion","content":"MONEY"},{"type":"Liquid Staking Derivatives Finance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}