{"summary":"The draft proposal would see Ethereum&#x27;s second-biggest DEX aggregator trial different fees with the aim of generating sustainable revenue.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261547\/dex-aggregator-cow-swaps-core-team-has-proposed-adding-fees-in-six-month-test","publishDate":"2023-11-04T14:11:12","id":11283,"type":null,"title":"DEX aggregator CoW Swap&#x27;s core team has proposed adding fees in six-month test","category":["CRYPTO ECOSYSTEMS"],"content":["CoW Swap's core development team has released a draft proposal that would see the protocol adding fees for 6 months in order to test which model is best suited for long term adoption.&nbsp;","The core developers of the protocol, which <a href=\"https:\/\/www.theblock.co\/learn\/245705\/what-are-aggregators-and-for-what-are-they-used\" data-v-f87c67ca=\"\">aggregates<\/a> other decentralized exchanges (DEX) like Uniswap and 1inch and offers MEV-resistance in order to give its users the best price, <a href=\"https:\/\/forum.cow.fi\/t\/cip-draft-testing-fee-models-for-cow-protocol\/1984\" data-v-f87c67ca=\"\">said<\/a> the aim of the test is to \"develop revenue streams that are reliable and sustainable\" by testing different fee models, including taking a percentage of the money users saved by using CoW Swap over competitors and charging a flat fee for every trade.&nbsp;","The fee revenue will accumulate to the CoW DAO, the proposal explains, and the core team will provide public notice of all current fees while the test is underway. CoW Swap's team did not reply immediately to a request for comment from The Block.&nbsp;","CoW Swap is currently the second most popular DEX aggregator on Ethereum by volume, according to data from The Block.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-aggregator-market-share\/embed\" title=\"Ethereum DEX Aggregator Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"2023","content":"DATE"}],"hashtag":["DEXS"],"authors":["Zack Abrams","The Block"]}