{"summary":"The South Korean investor community urged authorities to send the Terraform Labs co-founder to the US for &#x27;heavier punishment.&#x27;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281306\/south-korean-terra-investor-wants-do-kwon-sent-to-us","publishDate":"2024-03-08T03:30:34","id":11288,"type":null,"title":"South Korean Terra investor community wants Do Kwon sent to US, not Korea","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">A group of South Korean investors in Terra-Luna, who claim to be victims of its collapse, released a statement on Friday advocating for the extradition of Terraform Labs co-founder Do Kwon to the U.S. instead of Korea. This follows Thursday’s high court decision in Montenegro to <a href=\"https:\/\/www.theblock.co\/post\/281138\/do-kwon-to-be-extradited-to-south-korea-after-court-reverses-extradition-to-us\" data-v-f87c67ca=\"\">extradite Kwon to South Korea<\/a>.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/cafe.naver.com\/lunascam\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\">, posted on a public online forum hosting the community for Terra-Luna victims with over 2,700 members, claimed that Kwon may not receive the appropriate amount of punishment he allegedly deserves. The U.S. Department of Justice said that it will <a href=\"https:\/\/www.theblock.co\/post\/281260\/us-challenge-do-kwon-south-korea-extradition\" data-v-f87c67ca=\"\">continue to pursue<\/a> the extradition of Do Kwon from Montenegro, according to a Bloomberg report on Friday.<\/span>","<span data-v-f87c67ca=\"\">“Even if [Kwon] is sentenced in the first trial in South Korea, where rules on punishing crypto crimes have not been established, it is highly likely that the punishment would be reduced significantly in appeals and [Kwon] would be released without proper punishment,” the statement said.<\/span>","<span data-v-f87c67ca=\"\">South Korea’s maximum sentence for financial criminals typically ranges from 30 to 40 years, according to local <\/span><a href=\"https:\/\/www.edaily.co.kr\/news\/read?newsId=03457126635547584&amp;mediaCodeNo=257\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">news reports<\/span><\/a><span data-v-f87c67ca=\"\">. The U.S., however, follows a principle where the court can impose consecutive sentences for each crime a defendant is found guilty of. Hence, the potential maximum sentence Kwon could face is deemed higher in the U.S., the statement claimed.<\/span>","<span data-v-f87c67ca=\"\">For example, <\/span><a href=\"https:\/\/www.theblock.co\/post\/279487\/sbf-lawyers-prison-sentence\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Sam Bankman-Fried<\/span><\/a><span data-v-f87c67ca=\"\">, the leader of collapsed FTX exchange who was found guilty last year of defrauding investors, was given a suggested sentence of 100 years from the probation office.<\/span>","<span data-v-f87c67ca=\"\">“If Kwon Do-hyeong is released from prison after light punishment in Korea, the victims, including myself, will suffer for the rest of their lives,” said the victims in the statement, referring to the Terra co-founder by his full Korean name. “I've been waiting for years, but I don't live expecting Kwon Do-hyeong to compensate for the damage.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Terraform Labs’ algorithmic stablecoin Terra and sister cryptocurrency Luna crashed in May 2022, wiping out over $40 billion worth of market capitalization in a matter of days. Since then, U.S. and South Korean authorities have sought Kwon and Terraform Labs on charges including fraud and violations of securities laws.<\/span>","<span data-v-f87c67ca=\"\">Kwon, who has been a fugitive since the collapse, was arrested in Montenegro last March for attempting to travel with fake documents.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"$40 billion","content":"MONEY"},{"type":"Luna","content":"LOCATION"},{"type":"Kwon","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Montenegro","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Terra","content":"LOCATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["DO KWON"],"authors":["Danny Park","The Block"]}