{"summary":"The U.S. Democratic party is working on massive stimulus bill in response to the coronavirus epidemic and its economic impact.\nA version of the bill dated March 22 that has been circulating includes a passage that, if passed, would lead to the creation of a “digital dollar” to be used for providing stimulus payments.\nHowever, it remains unclear whether the digital dollar provision will make it into the final version of the bill. ","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59609\/coronavirus-stimulus-draft-digital-dollar-house-democrats","publishDate":"2020-03-23T16:11:33","id":1128,"type":null,"title":"A draft of the coronavirus stimulus bill written by House Democrats would create a &#x27;digital dollar&#x27;","category":["Technology"],"content":["A draft stimulus bill penned by House Democrats and circulating ahead of a formal published version includes a provision that would, if instituted, create a \"digital dollar.\"","To be sure, House Democrats aren't trying to create a cryptocurrency or deploy distributed ledger technology to make it happen. But according to <a href=\"https:\/\/assets.documentcloud.org\/documents\/6817441\/House-Democrats-Counterproposal-For-Stimulus.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">the draft text<\/a>, the digital dollar is defined as \"a balance expressed as a dollar value consisting of digital ledger entries that are recorded as liabilities in the accounts of any Federal [R]eserve bank; or an electronic unit of value, redeemable by an eligible financial institution (as determined by the Board of Governors of the Federal Reserve System).\"","The provision is included in a stimulus bill that runs in excess of 1,000 pages. Yet the draft, dated March 22, isn't even the latest said to be produced. House Democrats are said to be at work on one that exceeds 1,400 pages, but such a draft has not yet been released following a statement from House Speaker Nancy Pelosi on Monday afternoon.","However, it's possible that the digital dollar provision will be cut from the final version of the legislation.","A source with knowledge of the process told The Block said that the provision had raised numerous questions, including the infrastructure being in place to host the wallets in question.&nbsp;Moreover, Devron Brown, an AI and fintech counsel for the House Financial Services Committee Democrats, <a href=\"https:\/\/twitter.com\/dvrnbrwn\/status\/1242148264113254401\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">stressed in a tweet<\/a> this afternoon that \"[t]here are a few ideas floating on how to provide stimulus to people.\"","The draft bill appears to incorporate elements of <a href=\"https:\/\/tlaib.house.gov\/sites\/tlaib.house.gov\/files\/Automatic%20Boost%20to%20Communities%20Act%20.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a proposal<\/a> from Michigan Congresswoman Rashida Tlaib, dubbed the Automatic BOOST to Communities Act, that calls for the eventual, creation of \"a permanent, Treasury administered digital public currency wallet system.\"","Additionally, as CoinDesk noted <a href=\"https:\/\/www.coindesk.com\/house-stimulus-bills-envision-digital-dollar-to-ease-coronavirus-recession\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in its coverage<\/a> of the draft stimulus bill, a separate bill proposed by Democrats of the House Financial Services Committee <a href=\"https:\/\/financialservices.house.gov\/uploadedfiles\/waters_146_xml_03.23.2020.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">also includes language<\/a> for a digital dollar proposal.","Over in the U.S. Senate, Democrats and Republicans – including Trump administration officials – continue to spar over the details in a $2 trillion stimulus bill produced in that chamber. The latest procedural vote, held earlier this afternoon, <a href=\"https:\/\/www.nbcnews.com\/politics\/congress\/congress-deadlocked-over-massive-corona-virus-stimulus-bill-talks-ongoing-n1166501\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">failed amid continued divisions<\/a> over that legislation.&nbsp;","As proposed, the digital dollars would exist in a \"digital dollar wallet\" which is further defined as \"a digital wallet or account, maintained by a Federal [R]eserve bank on behalf of any person, that represents holdings in an electronic device or service that is used to store digital dollars that may be tied to a digital or physical identity.\"","The text also refers to a \"pass-through digital dollar wallet\" that \"means a digital wallet or account, maintained by a member bank on behalf of a qualified individual, where such qualified individual is entitled to a pro rata share of a pooled reserve balance that the member bank maintains at any Federal [R]eserve bank.\"","Pass-through digital dollar wallets appear to be the vehicle by which Americans would access the funds deposited by the government. The wallets would be held by Federal Reserve member banks via separate legal entities.&nbsp;","\"Member banks with total consolidated assets in excess of $10,000,000,000 shall promptly offer individuals the ability to apply, through online or telephonic means, for a pass-through digital dollar wallets,\" the text states. Such wallets, the bill goes on to say, would not be subject to account or balance-related fees, and member banks would be required to \"provide&nbsp;functionality and service levels not less favorable than those that the member bank offers for its existing transaction accounts.\"","Member banks would be reimbursed \"each calendar quarter\" for \"actual and reasonable operational costs incurred\" through the offering of such wallets. What's more, Federal Reserve banks will have the remit to let State banks and credit unions offer similar pass-through digital dollar wallet services.","On the topic of the stimulus payments themselves, the draft text indicates that payments would be made to \"qualified individuals,\" both above and below the age of 18. \"The term ‘'qualified individual’' means any individual 16 other than any nonresident alien individual,\" according to the text. Payments would be phased out \"but not below zero\" for those making more than $75,000 per year.","One thing does appear apparent in the text as it exists: the proposed stimulus payments would not necessarily be made via the pass-through digital dollar wallets. Rather, the Treasury Department and the Internal Revenue Service may also make them \"otherwise, by check.\"","As for the timing of this, the bill only states:"],"hashtag":[]}