{"summary":"Businesses are focused on the need for real-time data from vendors as they manage sanctions risks, according to a survey carried out in our State of Financial Crime 2022 report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142176\/how-can-firms-manage-sanctions-risks-in-real-time","publishDate":"2022-04-18T08:30:33","id":11284,"type":null,"title":"How Can Firms Manage Sanctions Risks in Real Time?","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Businesses are focused on the need for real-time data from vendors as they manage sanctions risks, according to a survey carried out in our<\/span><a href=\"https:\/\/complyadvantage.com\/insights\/the-state-of-financial-crime-2022\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> State of Financial Crime 2022<\/span><\/a><span data-v-f87c67ca=\"\"> report. An incredible 96% of firms said that real-time data would improve their performance in due diligence, while the number saying that it would improve their operations “significantly” rose by 15 percentage points between 2020 and 2021.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Avoiding sanctions breaches is a permanent challenge that threatens them with severe regulatory and reputational consequences. But achieving success is getting harder as western governments’ make wider use of sanctions to tackle international crises, as we see in the war in <\/span><a href=\"https:\/\/complyadvantage.com\/insights\/sanctions-on-russia-compliance-updates\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Russia and Ukraine<\/span><\/a><span data-v-f87c67ca=\"\">. It’s no surprise that access to real-time data is such a major issue, nor that so many firms are looking for better solutions.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Sanctions Risk Challenge&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Financial businesses have a fundamental legal duty to identify, block and report attempts at sanctions evasion, making accuracy one of the most important qualities of sanctions data when it comes to screening customer names and high risk transactions. Poorly curated risk data is the primary reason for the high rates of <\/span><a href=\"https:\/\/complyadvantage.com\/insights\/reduce-false-positives-aml\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">false positives<\/span><\/a><span data-v-f87c67ca=\"\"> - a figure currently believed to be around 42% across the industry. There are also the many unknown numbers of false negatives - in plain terms, breaches - which will go ‘under the wire’ and create future regulatory risks for firms.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But although businesses need accuracy, they need their sanctions data to be timely too. For regulators, speed is of the essence. The UK’s <\/span><a href=\"https:\/\/www.gov.uk\/guidance\/suspected-breach-of-financial-sanctions-what-to-do\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Office of Financial Sanctions Implementation (OFSI)<\/span><\/a><span data-v-f87c67ca=\"\"> says that firms need to report to them at “the earliest opportunity.” At the same time, businesses have a commercial duty to their customers to sustain fluid and responsive onboarding and payment systems to ensure a high quality customer experience - something which is especially important for FinTech firms seeking to differentiate on agility and responsiveness.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Pressure for Real-Time Data<\/b>","<span data-v-f87c67ca=\"\">This requirement for accurate real-time risk data is always important, but is ever more so now, as businesses face a fast evolving geopolitical environment. As our recently reissued report <\/span><a href=\"https:\/\/complyadvantage.com\/insights\/global-sanctions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Evolving Use of Sanctions<\/span><\/a><span data-v-f87c67ca=\"\"> indicates, authoritarian governments’ military aggression, human rights abuses, corruption, etc., as well as the ongoing challenges of terrorism and serious organised crime, have encouraged growing numbers of democratic states to create autonomous sanctions regimes. As we have seen in the western reaction to the Russian invasion of Ukraine, multiple countries can apply their own sanctions in a matter of days, and sometimes over a few hours, leading to a broadening and deepening of measures against at break-neck speed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Such fast moving situations are difficult to manage, and are proving even more so at the moment, because of the types of sanctions tools and risk data businesses are using. Some sanctions screening solutions for due diligence and payments - often based on decades old technology - are not real-time. Changes to sanctions lists can take a day or more to be reflected in platforms, and actual refreshed screening of data against the new lists can take even longer, driven by a set schedule of daily overnight reviews.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Tackling the Challenge<\/b>","<span data-v-f87c67ca=\"\">With advances in data collection and management, real-time updates and screening are now a real possibility. With the most sophisticated internet ‘scraping techniques’, it is feasible to pull updates not only from published sanctions lists, but from official announcements and media as well, minute by minute. With the vast data resources of cloud computing, machine learning algorithms and Application Programming Interfaces (APIs) - protocols which allow different platforms to talk to each other - it is also possible to screen continuously, allowing firms to investigate, block and report potentially sanctioned transactions as they happen. Supported by this kind of technology, businesses now have the opportunity to screen data with the confidence of knowing that they have the information they need, when they need it.<\/span>","<span data-v-f87c67ca=\"\">Learn more about sanctions trends, regimes and geopolitical hotspots in our new guide to the <\/span><a href=\"https:\/\/complyadvantage.com\/insights\/global-sanctions\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Evolving Use of Sanctions 2022<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Time Data","content":"ORGANIZATION"},{"type":"FinTech","content":"ORGANIZATION"},{"type":"15 percentage points","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"42%","content":"PERCENT"},{"type":"State of Financial Crime","content":"ORGANIZATION"},{"type":"96%","content":"PERCENT"},{"type":"Evolving Use of Sanctions 2022","content":"ORGANIZATION"},{"type":"UK’s <\/span><a href=\"https:\/\/www.gov.uk\/guidance\/suspected-breach-of-financial-sanctions-what-to-do\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Office of Financial Sanctions Implementation","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}