{"summary":"Contradicting past excuses by Sam Bankman-Fried that customer funds were not knowingly misdirected, FTX debtors said in a Monday report that Bankman-Fried and a senior lawyer lied to banks and auditors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236507\/latest-ftx-bankruptcy-report-provides-lurid-details-into-alleged-fraud","publishDate":"2023-06-26T15:02:33","id":11289,"type":null,"title":"Latest FTX bankruptcy report provides lurid details into alleged fraud","category":["POLICY"],"content":["A <a href=\"https:\/\/www.theblock.co\/post\/236474\/ftx-com-exchange-owed-customers-8-7-billion-debtors-say\" data-v-f87c67ca=\"\">new report<\/a> made in the FTX group's bankruptcy process, delivered by caretaker leadership, provides more details about allegations of commingling and misusing customer assets for the aims of the company founder Sam Bankman-Fried.","Contradicting past excuses by Bankman-Fried that customer funds were not knowingly misdirected, the debtors said in Monday’s report that Bankman-Fried and a senior lawyer for FTX, among others, lied to banks and auditors, gave false documents, and moved FTX from country to country in order to prevent the discovery of lies and alleged fraud.","The lawyer is not directly identified in the document, though a section of the report details their alleged role in deceiving “customers, banks, auditors, investors, and other third parties,” a potentially criminal act.","FTX’s bankruptcy lawyers and current CEO John Ray III, a corporate debt restructuring specialist, claim in court that Bankman-Fried and other senior executives funneled customer deposits through Alameda Research and other affiliated companies in order to mask the purpose of transactions — which also complicates efforts to repay customers.","“Because the commingling and misuse of FTX.com customer deposits occurred for several years, it is extraordinarily challenging to trace the source of funding for particular FTX Group transactions, or to differentiate between FTX Group operating funds and FTX.com customer deposits,” FTX’s caretaker leadership told the U.S. Bankruptcy Court for the District of Delaware.","In a shot at Bankman-Fried’s public defense in the wake of FTX’s collapse that he did not knowingly misuse customer funds, the report goes on to note that \"the FTX Group knew how to create a contractual agreement to separate and protect customer deposits when it suited the FTX Group to do so,” and singles out FTX Japan, one of the few solvent pieces of the failed crypto empire, as a unit of FTX that created actual safeguards for company assets.","“By contrast, and even though they were occasionally revised, the Terms of Service never stated that FTX Trading Ltd. separated and protected customer fiat currency deposits,” the report goes on to say. “Instead, in the isolated instances in which a customer inquired directly on the subject, employees lied.”","The report details additional alleged malfeasance beyond what is already public record.","An exhibit within the report repeatedly singles out \"Attorney-1,\" an unnamed FTX lawyer, for participating in and aiding allegedly fraudulent acts.","In one incident, a “less senior attorney” who had been with the FTX group of companies for less than three months raised concerns that another entity controlled primarily by Bankman-Fried, called North Dimension, had received customer assets.","“Attorney-1 responded by calling the attorney and asking him to meet in person the same day, a Saturday. When the attorney arrived to the meeting as requested, Attorney-1 fired him,” the report reads.","The report also claims that Attorney-1 helped Bankman-Fried lie to Congress during testimony before a Senate committee, and aided in the creation of a “sham agreement” to mask the source of fund transfers in order to allow FTX to continue to allegedly redirect customer assets.","According to FTX’s bankruptcy lawyers, that included drafting and backdating a fake intercompany agreement in order to deceive an external auditor in preparation for a potential initial public offering in 2021.","“While the IPO was not ultimately consummated, the FTX Group proceeded to share the false and misleading audited financials with potential investors in connection with its $400 million Series C financing that closed in January 2022,” the report claims.","FTX’s move from Hong Kong to the Bahamas was largely to avoid scrutiny into possibly illegal operations, the bankruptcy court document claims.","“In moving to the Bahamas, where they incorporated FTX DM in July 2021, the FTX Senior Executives sought to minimize any substantive change to or scrutiny of their business,” says the report.","Attorney-1 paid a “former Bahamian official” a $1 million bonus for obtaining a business license for FTX Digital Markets, the main FTX.com platform, which was located in the Bahamas. The former official obtained the license within six weeks, four less than the company had set as its goal.","The FTX group’s current leadership now alleges that FTX used the Bahamian operation to funnel at least $5.4 billion of customer assets into another corporate entity.","FTX executives also spent over $243 million in company funds to make themselves feel more at home in the Bahamas, including buying multimillion dollar properties for friends and family in addition to employees.","At the direction of Bankman-Fried and other executives, the group of companies bought over 30 properties, including the infamous six bedroom, 11,500 square foot penthouse at the Albany resort community in Nassau where the FTX owner and his lieutenants Caroline Ellison, Nishad Singh, and Gary Wang all lived.","“The FTX Group funded these real estate purchases from accounts that held commingled customer and corporate funds,” the report claims.","According to the report, despite claiming to be funded by FTX customer fees, the FTX Foundation instead drew money out of Alameda Research and North Dimension bank accounts that received FTX customer assets, which were commingled with corporate funds.","One of the grants issued using commingled funds was to further the creation of animated YouTube videos related to Effective Altruism, according to details provided in the report.","The FTX caretaker leadership says approximately $20 million from an account where customer funds were commingled was sent to Guarding Against Pandemics, a nonprofit founded by Bankman-Fried’s brother, Gabe.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"January 2022","content":"DATE"},{"type":"Albany","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"North Dimension","content":"ORGANIZATION"},{"type":"FTX Trading Ltd.","content":"ORGANIZATION"},{"type":"$5.4 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"1","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Saturday","content":"DATE"},{"type":"Guarding Against Pandemics","content":"ORGANIZATION"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Terms of Service","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"$243 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nassau","content":"LOCATION"},{"type":"Alameda Research and North Dimension","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Gabe","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"July 2021","content":"DATE"},{"type":"FTX Foundation","content":"ORGANIZATION"},{"type":"the District of Delaware","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["COURT HEARINGS","CRIME","FTX","LAWSUITS"],"authors":["Colin Wilhelm","The Block"]}