{"summary":"With the legislative calendar ticking down and the Department of Labor overtly opposed, the new bill faces long odds. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173676\/new-legislation-aims-to-expand-401k-investment-options-to-include-crypto","publishDate":"2022-09-29T10:17:45","id":11298,"type":null,"title":"New legislation aims to expand 401(k) investment options to include crypto","category":["REGULATION"],"content":["Three congressional Republicans have introduced legislation that aims to broaden the type of investments that managers of 401(k)s and other defined contribution plans can make, including into digital assets.&nbsp;&nbsp;","The Retirement Savings Modernization Act would also allow fiduciaries to recommend cryptocurrencies, or other traditional finance investments, like into hedge funds or private equity, without legal liability.&nbsp;","The legislation has the backing of three Republicans: outgoing Senate Banking Committee Ranking Member Pat Toomey (R-Pa.), Sen. Tim Scott (R-S.C.), and Rep. Peter Meijer (R-Mich.) in the House of Representatives.&nbsp;","In statements upon the bill's introduction, the three congressmen cited inflation and \"fiscal uncertainty\" as motivation for expanding retirement investment options. They also note that far more Americans rely on 401(k)s than traditional pensions for their retirements, but criticize limits on 401(k) investments as reducing overall returns compared to those traditional pensions.","<span lang=\"en-US\" data-v-f87c67ca=\"\">“Our legislation will provide the millions of American savers invested in defined contribution plans with the option to enhance their retirement savings through access to the same wide range of alternative assets currently available to savers with defined benefit pension plans,\" said Toomey in a release touting the bill.<\/span>","The bill is broader than digital assets, but Toomey in particular has established an image as a <a href=\"https:\/\/www.theblock.co\/post\/164082\/senator-claims-the-fdic-is-stonewalling-banks-that-try-to-work-with-crypto\" data-v-f87c67ca=\"\">leading crypto advocate<\/a> on the Hill. But many in government — notably the Department of Labor, which regulates retirement plans — are <a href=\"https:\/\/www.theblock.co\/post\/144303\/labor-department-has-grave-concerns-over-fidelitys-401k-bitcoin-plans\" data-v-f87c67ca=\"\">skeptical to the inclusion of crypto<\/a> in retirement plans.&nbsp;","With midterms coming at the beginning of November, legislative action has largely stalled. Toomey is not running for re-election, and Meijer lost his primary election to Republican challenger John Gibbs, so he won't be returning to the next congressional session. However, the bill's authors may look to insert their bill into a broader end-of-year tax bill.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Department of Labor","content":"ORGANIZATION"},{"type":"Mich.","content":"LOCATION"},{"type":"Meijer","content":"PERSON"},{"type":"Senate Banking Committee Ranking Member Pat Toomey","content":"ORGANIZATION"},{"type":"Pa.","content":"LOCATION"},{"type":"Peter Meijer","content":"PERSON"},{"type":"John Gibbs","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Toomey","content":"PERSON"},{"type":"Tim Scott (","content":"PERSON"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Kollen Post","The Block"]}