{"summary":"The AnubisDAO scammer has so far laundered 1,018 ETH worth $1.18 million via Tornado Cash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154004\/anubisdao-funds-move-for-the-first-time-eight-months-after-rug-pull","publishDate":"2022-06-24T06:02:44","id":11296,"type":null,"title":"AnubisDAO funds move for the first time, eight months after rug pull","category":["HACKS"],"content":["A wallet address associated with last year's suspected AnubisDAO rug pull has begun to move funds from the heist, according to an <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1540234286993133569?t=nAeKyxJ_RQyUSJvgVF0VGw&amp;s=19\" data-v-f87c67ca=\"\">alert<\/a> by PeckShield on Friday.","Etherscan data shows <a href=\"https:\/\/etherscan.io\/address\/0xb1302743acf31f567e9020810523f5030942e211#tokentxns\" data-v-f87c67ca=\"\">an address<\/a> it had tagged as AnubisDAO Liquidity Rug 3 moving a total of 1,097 ETH ($1.3 million) to another address. The <a href=\"https:\/\/etherscan.io\/address\/0x07002d0212e3d40a6e17773460579d694100b7f4#tokentxns\" data-v-f87c67ca=\"\">intermediary<\/a> address has since laundered 1,018 ETH ($1.18 million) via Tornado Cash.","AnubisDAO was a dog-themed crypto project promoted as a fork of OlympusDAO. The project raised 13,597 ETH, worth $60 million at the time, by selling its native token ANKH to investors.","However, the project saw its liquidity drained in October in a suspected rug pull, where the developers behind the project abscond with the money. The funds raised were sent to a different wallet address, which then consolidated them into the tagged address mentioned earlier. The rug pull effectively crashed the price of the ANKH token to zero as there was no liquidity for trading the coin.","Today’s fund transfers are the first from the wallet since the theft occurred 236 days ago. The tagged wallet still holds 12,500 ETH from AnubisDAO as of the time of reporting, worth $14.5 million at today’s ether price. Ether has lost 70% of its dollar value since the heist and as such the total funds siphoned now have a market value of less than $16 million.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PeckShield","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$1.3 million","content":"MONEY"},{"type":"$1.18 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"$14.5 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$16 million","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}