{"summary":"Ethereum Layer 2 scaling solution Hermez Network that uses ZK-Rollups technology for scalability has gone live.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99191\/hermez-network-mainnet-launch-ethereum-layer-2-zk-rollups","publishDate":"2021-03-24T06:00:23","id":11290,"type":null,"title":"Ethereum Layer 2 network Hermez that uses ZK-Rollups has gone live","category":["ETHEREUM"],"content":["<a href=\"https:\/\/www.theblockcrypto.com\/linked\/27639\/ethereum-2-0-phase-0-set-to-launch-on-3rd-january-2020\" data-v-f87c67ca=\"\">Ethereum<\/a> Layer 2 scaling solution Hermez Network that uses ZK-Rollups technology for scalability has gone live.","The development means Hermez's mainnet has been launched, and users can now make transfers at lower gas costs.","\"People should save around 90% of gas costs,\" Hermez's tech lead Jordi Baylina told The Block.","The current average gas fee is <a href=\"https:\/\/bitinfocharts.com\/comparison\/ethereum-transactionfees.html\" data-v-f87c67ca=\"\">about $16<\/a> per transaction. With around 90% savings, the cost would come down to about $1.5 per transaction.","Besides lower fees, Hermez also has a higher throughput than <a href=\"https:\/\/www.theblockcrypto.com\/linked\/29603\/ethereum-transaction-volumes-at-17-month-high-surpasses-1-million-daily-transactions\" data-v-f87c67ca=\"\">Ethereum<\/a>, i.e., it can process more transactions per second. <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37636\/ethereum-foundation-unveils-over-2m-in-new-grants-for-eth2-0-client-developers-and-researchers\" data-v-f87c67ca=\"\">Ethereum's<\/a> current throughput is about 15 transactions per second. Baylina said Hermez can multiply the capacity of <a href=\"https:\/\/www.theblockcrypto.com\/linked\/3075\/ethereum-developers-set-january-date-for-constantinople-upgrade\" data-v-f87c67ca=\"\">Ethereum<\/a> by 100 times.","Hermez uses <a href=\"https:\/\/www.theblockresearch.com\/scaling-blockchains-layer-2-74584\" data-v-f87c67ca=\"\">ZK-Rollups<\/a> for scalability. They help bundle hundreds of transfers into a single transaction, thereby reducing data storage and gas fees for validating transactions.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/37663\/ethereum-dex-startup-launches-app-store-to-be-the-homepage-of-the-lightning-network\" data-v-f87c67ca=\"\">Ethereum<\/a> creator <a href=\"https:\/\/vitalik.ca\/general\/2021\/01\/05\/rollup.html\" data-v-f87c67ca=\"\">Vitalik Buterin recently said that ZK-Rollups<\/a> \"will win out in all use cases\" in the medium to long term as ZK-SNARK technology improves.","As for Optimistic Rollups, Buterin said they are likely to win in the short term for general-purpose computation. At the same time, ZK-Rollups are likely to win out for simple payments and other application-specific use cases, he said.","One of the first projects to integrate with Hermez is <a href=\"https:\/\/www.theblockcrypto.com\/post\/90738\/tether-usdt-hermez-ethereum-layer-2-scaling-solution-zk-rollups\" data-v-f87c67ca=\"\">Tether,<\/a> as The Bock reported earlier this year. With Hermez's mainnet launch, Tether's USDT stablecoin is available on the network.","Besides USDT, Hermez is initially also supporting ether (ETH), wrapped bitcoin (WBTC), Dai (DAI), and Hermez token (HEZ). That means anyone using these tokens can now use the Hermez network to make transfers.","\"We will add many other tokens very soon,\" Baylina told The Block. \"Hermez is open to any ERC20 token.\"","Hermez also expects \"many exchanges and wallets\" to integrate with the network \"very soon,\" he said.","While Hermez's mainnet has launched, there is still a lot of work to do, said Baylina. That includes making Hermez \"fully decentralized.\"","Baylina said Hermez is now non-custodial but still has some centralization points. \"During the upcoming weeks, we need to fine-tune some parameters, and we hope to have very soon a fully decentralized governance less system,\" he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$1.5","content":"MONEY"},{"type":"Hermez","content":"ORGANIZATION"},{"type":"Hermez","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$16","content":"MONEY"},{"type":"Dai (DAI)","content":"PERSON"},{"type":"Baylina","content":"PERSON"},{"type":"Baylina","content":"LOCATION"},{"type":"Buterin","content":"PERSON"},{"type":"The Bock","content":"LOCATION"},{"type":"Jordi Baylina","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DAI","TETHER"],"authors":["Yogita Khatri","The Block"]}