{"summary":"Wormhole will be using AMD’s FPGA hardware accelerators to scale cross-chain messaging using zero-knowledge proofs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278338\/wormhole-amd-fpga-scaling","publishDate":"2024-02-21T09:00:03","id":11292,"type":null,"title":"Wormhole to use AMD chips for scaling &#x27;light client&#x27; proofs on interoperability platform","category":["CRYPTO ECOSYSTEMS"],"content":["Interoperability platform Wormhole will leverage AMD’s enterprise-grade FPGA hardware accelerator chips for scaling cross-chain communication. The project will make use of AMD’s Alveo U55C and U250 adaptable accelerator cards to enhance capacity for secure cross-chain messages using zero-knowledge proofs.","As a bridge solution connecting over 30 blockchains, Wormhole has embraced the integration of zero-knowledge proofs into the platform. It is developing “<a href=\"https:\/\/mta-sts.theblock.co\/post\/231139\/near-protocol-to-use-wormhole-bridge-for-cross-chain-transfers\" data-v-f87c67ca=\"\">light client<\/a>” implementations for secure transfers across different chains, using ZKPs. The goal is to create secure “corridors” between blockchains for messaging.","However, this necessitates substantial compute power for the generation and verification of proofs across networks. That’s where the AMD chips come into the picture. These FPGA chips are widely used for compute-heavy tasks like training machine learning models. Wormhole is optimizing its platform for AMD chips.","\"AMD plays a critical role in this effort by providing enterprise-grade FPGA and GPU hardware and lending deep hardware expertise to Wormhole ZK engineers to ensure efficiency and speed,” said Dan Reecer, co-founder and chief operating officer at Wormhole Foundation.","AMD’s contribution to the project extends beyond hardware provision — it will also share its expertise in hardware acceleration to improve the scalability of applications developed within the Wormhole ecosystem.","In the coming months, organizations contributing to Wormhole will start rolling out mainnet deployments of various zero-knowledge (ZK) light clients. Just last week, Wormhole revealed a <a href=\"https:\/\/twitter.com\/WormholeFdn\/status\/1758174464150553045\" data-v-f87c67ca=\"\">collaboration with Succinct Labs<\/a>, to enhance the development and performance of an Ethereum-based ZK light client.","Wormhole’s plan is to create secure communication channels across major blockchains, including Ethereum, Near, Solana, Aptos, Sui, and Cosmos. Scaling concerning proof generation and verification in the light clients will be facilitated through AMD devices.","Wormhole’s core contributors emphasize the critical importance of its product security. This stance stems from an incident in February 2022, when a security breach facilitated by a signature verification flaw in the Wormhole network on Solana led to the theft of over $320 million in ETH. Fortunately, the compromised funds were later recovered.","According to the contributors, ZK-based light clients will significantly contribute to improving the project’s security and decentralization.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$320 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Wormhole Foundation","content":"ORGANIZATION"},{"type":"FPGA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"Aptos","content":"LOCATION"},{"type":"AMD","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Dan Reecer","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["DEVELOPER TOOLS","INTEROPERABILITY"],"authors":["Vishal Chawla","The Block"]}