{"summary":"Uncorrelated Ventures has previously backed crypto projects including Compound, Cosmos, dYdX, Helium and Uniswap.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275150\/uncorrelated-ventures-315-million-crypto-software-fund","publishDate":"2024-01-30T09:43:57","id":11294,"type":null,"title":"Uncorrelated Ventures raises $315 million for crypto and software-focused fund","category":["VENTURE CAPITAL"],"content":["Bain Capital-backed VC firm Uncorrelated Ventures has raised $315 million for a new fund focusing on software and crypto, General Partner Salil Deshpande confirmed via email.","Bloomberg first <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2024-01-29\/ai-chip-startup-rebellions-gets-124-million-in-kt-led-funding\" data-v-f87c67ca=\"\">reported<\/a> the news, with Deshpande telling the outlet it was easy to find investors for the fund, adding he had \"no difficulty\" in raising the capital despite a poor 2023 for VC deals in the crypto industry.","The California-based firm will allocate around 80% of the new fund to early-stage traditional software investments and 20% to crypto startups.","Uncorrelated Ventures has previously backed crypto projects including Compound, Cosmos, dYdX, Helium and Uniswap, <a href=\"https:\/\/uncorrelated.com\/\" data-v-f87c67ca=\"\">according<\/a> to its website. \"It’s real technology with real use cases,\" Deshpande told Bloomberg. \"I think the use cases were in the past overhyped and overvalued, and it’s our job as investors to properly value them.\"","Uncorrelated Ventures was formed in 2020 following Deshpande's departure as Managing Director from Bain Capital, with $700 million in assets under management invested in over 100 companies.","Crypto venture funding dropped to multi-year lows last year in the wake of high-profile collapses and bankruptcies of firms like FTX, Celsius and Three Arrows Capital.","Funding fell to $552.8 million in Q4 2023, down over 95% from a peak of $13.5 billion in Q1 2022, the lowest level since Q3 2017, according to The Block Pro <a href=\"https:\/\/www.theblock.pro\/deals\/charts\" data-v-f87c67ca=\"\">deals dashboard<\/a>.","<span data-v-f87c67ca=\"\">Quarterly venture funding. Image: <a href=\"https:\/\/www.theblock.pro\/deals\/charts\" data-v-f87c67ca=\"\">The Block Pro<\/a>.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bain Capital","content":"ORGANIZATION"},{"type":"Uncorrelated Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"$315 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Deshpande","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$552.8 million","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"General Partner Salil Deshpande","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"$700 million","content":"MONEY"},{"type":"$13.5 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"\" Deshpande","content":"PERSON"}],"hashtag":["NEW VC FUNDS"],"authors":["James Hunt","The Block"]}