{"summary":"Stablecoins &quot;pose serious risks&quot; according to Christine Lagarde, the head of the European Central Bank, while the digital euro could strengthen the region&#x27;s &quot;monetary sovereignty.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85986\/ecb-lagarde-digital-euro-stablecoins-risk","publishDate":"2020-11-30T10:59:42","id":11295,"type":null,"title":"ECB&#x27;s Lagarde strikes bullish tone on digital euro, says stablecoins &#x27;pose serious risks&#x27;","category":["STABLECOINS"],"content":["Stablecoins \"pose serious risks\" according to Christine Lagarde, the head of the European Central Bank.","Her <a href=\"https:\/\/www.ecb.europa.eu\/press\/inter\/date\/2020\/html\/ecb.in201130~ce64cb35a3.en.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">comments<\/a> — which touched on the intersection of payments and technology — from November 30 come as the European Union moves closer toward approving the eventual creation of a wholly <a href=\"https:\/\/www.theblockcrypto.com\/post\/84404\/ecb-lagarde-hunch-digital-euro\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">digital euro<\/a>. Lagarde previously indicated that a yes-or-no decision would come in January, even as other institutions around the globe pursue <a href=\"https:\/\/www.theblockcrypto.com\/post\/75022\/a-global-look-at-central-bank-digital-currencies-full-research-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">central bank digital currency<\/a> initiatives.","As she has before, Lagarde spoke about the digital euro as a complement to physical cash. The ECB leader also stressed how the the digital euro, if implemented, would help shore up \"monetary sovereignty\" in the region.","\"It could be important in a range of future scenarios, from a decline in the use of cash to pre-empting the uptake of foreign digital currencies in the euro area,\" she said, according to the prepared remarks. \"Issuing a digital euro might become necessary to ensure both continued access to central bank money and monetary sovereignty.\"","Adopting a loftier perspective, Lagarde went on to say: \"A digital euro would also be an emblem of the ongoing process of European integration and ultimately help to unify Europe’s digital economies.\"","On the topic of crypto-assets, Lagarde had this to say:","\"The main risk lies in relying purely on technology and the flawed concept of there being no identifiable issuer or claim. This also means that users cannot rely on crypto-assets maintaining a stable value: they are highly volatile, illiquid and speculative, and so do not fulfil all the functions of money.\"","Her comments were specifically pointed when she spoke about stablecoins.","\"Although stablecoins could drive additional innovation in payments and be well integrated into social media, trade and other platforms, they pose serious risks,\" she remarked, going on to say:","\"If widely adopted, they could threaten financial stability and monetary sovereignty. For instance, if the issuer cannot guarantee a fixed value or if they are perceived as being incapable of absorbing losses, a run could occur. Additionally, using stablecoins as a store of value could trigger a large shift of bank deposits to stablecoins, which may have an impact on banks’ operations and the transmission of monetary policy.\"","Lagarde also critiqued stablecoins issued by \"global technology firms\" — a not-so-subtle reference, perhaps, to Facebook's Libra — and how they \"could also present risks to competitiveness and technological autonomy in Europe, as they would attempt to leverage their competitive advantage and control of large platforms.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"Lagarde","content":"PERSON"},{"type":"November 30","content":"DATE"},{"type":"ECB","content":"ORGANIZATION"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"Europe","content":"LOCATION"}],"hashtag":["ECB"],"authors":["Michael McSweeney","The Block"]}