{"summary":"Bitcoin option volumes reached their highest point since October 2021, back when the price of bitcoin was hovering above $60,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220887\/bitcoin-options-reach-highest-point-since-2021-amid-banking-crisis","publishDate":"2023-03-17T16:03:48","id":11303,"type":null,"title":"Bitcoin options reach highest point since 2021 amid banking crisis","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin option volumes reached their highest point since October 2021 when the price of bitcoin reach a high of over $60,000 amid a crisis in banking.","The volume of bitcoin options trading was $7.94 billion this week, according to data from The Block, as traditional financial markets are seeing significant volatility.","The market is \"pricing in looser monetary conditions,\" said Anand Gomes, co-founder at Paradigm, an institutional liquidity provider, because \"the Fed can't hike rates anymore.\"","","","<span class=\"s1\" data-v-f87c67ca=\"\">\"L<\/span>oose monetary policy means cheaper capital,\" said Gomes, \"and cheaper capital means we deploy it in higher yielding assets.\" In response \"macro sentiment has turned incredibly bullish.\"&nbsp;","According to Laura Vidiella, vice president at LedgerPrime, the reason has more to do with volatility.&nbsp;","\"High volatility and high trading volume are generally very correlated especially for liquid assets,\" she said, which is why Paradigm had record volumes this week, doing over $1 billion in a single day.","","","Another reason for the rally, Vidiella said, is that investors are buying bitcoin as a way to get their funds out of banks with a high risk of failure. \"This is a strong response to how people are hedging their exposure to fiat,\" she said.","Vidiella thinks the reaction may spur some cooperation between crypto and regulators.","\"Being stuck with financial regulation that doesn't adjust or evolve with new advancements and innovation frightens me more than trying new developments and failing in the process,\" she said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laura Vidiella","content":"PERSON"},{"type":"LedgerPrime","content":"ORGANIZATION"},{"type":"$60,000","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"$7.94 billion","content":"MONEY"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Anand Gomes","content":"PERSON"},{"type":"Gomes","content":"PERSON"},{"type":"Vidiella","content":"PERSON"},{"type":"October 2021","content":"DATE"}],"hashtag":[],"authors":["Sam Venis","The Block"]}