{"summary":"The Starknet Foundation is allocating tokens to those who contributed to the network&#x27;s development in its early days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259963\/starknet-to-hand-out-50-million-strk-tokens-to-early-ecosystem-contributors","publishDate":"2023-10-30T15:00:03","id":11301,"type":null,"title":"Starknet to hand out 50 million STRK tokens to early ecosystem contributors","category":["CRYPTO ECOSYSTEMS"],"content":["The Starknet Foundation is allocating 50 million of its yet-to-be-released STRK tokens to early ecosystem contributors.","Called the Early Community Member Program, it will reward individual contributors who encouraged technical discussion, organized Starknet-related events and regularly published Starknet-branded content, according to a blog post.","Individuals and projects will need to <a href=\"https:\/\/ecmp.starknet.io\" data-v-f87c67ca=\"\">apply<\/a> for the grant, providing details of their contributions.","\"We intend to use this opportunity and give recognition to individuals that contributed significantly to the Starknet ecosystem in various ways. Such contribution involves being a key member of an effort which hugely, and positively, impacts the ecosystem,\" the Starknet Foundation said in the blog post.","The foundation added that it will hold back some of the tokens in case it misses out on contributors. The program won't be available in the U.S. or to U.S. citizens.","Ten billion Starknet tokens <a href=\"https:\/\/medium.com\/starkware\/part-3-starknet-token-design-5cc17af066c6\" data-v-f87c67ca=\"\">have been minted<\/a> but they have not yet been made available to token holders.","These tokens <a href=\"https:\/\/www.theblock.co\/post\/254142\/ethereum-starkware-token-unlocks-delay\" data-v-f87c67ca=\"\">should be made available<\/a> on April 15, 2024. The majority of the tokens were allocated to the Starknet Foundation, while 32.9% was allocated to core contributors and 17% to investors. The ECMP program is part of the plan to distribute tokens that were allocated to the foundation. Starknet said it is not defining this distribution of tokens as an airdrop.&nbsp;","Starknet is a permissionless Layer-2 scaling solution for Ethereum.<span class=\"animating\" data-v-f87c67ca=\"\"> It uses zk-STARKs (zero-knowledge succinct argument of knowledge) proofs to achieve high throughput and low gas costs while maintaining the security of the Ethereum mainnet.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"17%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"April 15, 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"32.9%","content":"PERCENT"},{"type":"Early Community Member Program","content":"ORGANIZATION"},{"type":"Starknet Foundation","content":"ORGANIZATION"}],"hashtag":["STARKNET"],"authors":["Tim Copeland","The Block"]}