{"summary":"Near and Wormhole developers are collaborating on light client solutions that can support cross-chain bridge transfers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231139\/near-protocol-to-use-wormhole-bridge-for-cross-chain-transfers","publishDate":"2023-05-17T07:31:37","id":11317,"type":null,"title":"Near and Wormhole plan light clients for a ZK Proofs-based bridge protocol","category":["CRYPTO ECOSYSTEMS"],"content":["Developers from Layer 1 blockchain Near Protocol and Wormhole Bridge are collaborating to create light client solutions for supporting cross-chain transfers using Zero-Knowledge (ZK) proofs.","Near Protocol will integrate with Wormhole’s zero-knowledge bridge for cross-chain asset transfers, according to an announcement from Near Foundation.","Near's integration with Wormhole will make use of ZK Proofs for additional security of cross-chain transfers between Near and Ethereum. ZK Proofs allow transactions to be validated without revealing any extra transaction details. This provides a way to confirm and verify the state of transfers between Ethereum and Near blockchains securely. However, this process can be computationally heavy, necessitating the use of light client solutions, Near Foundation explained.&nbsp;","A light client is a version of a full node in a blockchain network that only downloads a fraction of the entire blockchain, while still being able to verify transactions.","Developers from both teams plan to build light client solutions that will delegate most of the computational load required for employing ZK Proofs to an off-chain layer. This strategy, the Near foundation said, will optimize storage and computational resources.","“The integration with Wormhole is aimed at bolstering our multi-chain interoperability by harnessing the power of cutting-edge Zero-Knowledge (ZK) light clients,” the foundation <a href=\"https:\/\/near.org\/blog\/near-integrates-wormhole-to-launch-zk-enabled-cross-chain-communication-with-ethereum\/\" data-v-f87c67ca=\"\">wrote<\/a>. “By offloading most of the computational load to an off-chain entity, these clients optimize storage and compute resources, paving the way for a streamlined and efficient bridging process.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Near Foundation","content":"ORGANIZATION"},{"type":"Wormhole","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}