{"summary":"Animoca Brands is planning a fund of up to $2 billion to invest in metaverse companies, which is expected to make its first investment next year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190902\/animoca-plots-2-billion-metaverse-investment-fund","publishDate":"2022-11-30T05:32:41","id":11313,"type":null,"title":"Animoca plots $2 billion metaverse investment fund: Nikkei","category":["METAVERSE"],"content":["Web3 gaming and software giant Animoca Brands is set to debut a fund of up to $2 billion to invest in metaverse companies.","The fund, named Animoca Capital, is expected to make its first investment next year, co-founder and executive chairman Yat Siu said in an <a href=\"https:\/\/asia.nikkei.com\/Editor-s-Picks\/Interview\/Blockchain-group-Animoca-to-form-metaverse-fund\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">interview<\/a> with Nikkei.","Animoca Brands is one of the most active investors in web3. It made over 60 investments in the first half of 2022, bringing its total to more than 340 as of September this year, according to <a href=\"https:\/\/www.theblockresearch.com\/animoca-brands-company-intelligence-170187\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Block Research<\/a>.","","","In addition to investments, its subsidiaries include metaverse gaming platform The Sandbox, Blowfish Studios, Grease Monkey Games and Eden Games.","The primary purpose of the fund will be to develop the ecosystem and create more opportunities for investors to access web3 companies, Siu said.","“They want more direct exposure to mid- to late-stage companies, and this is the role of a fund,” he told Nikkei.","But it will also have a focus on digital property rights, an issue known to be close to his heart. He has frequently discussed his belief that web3 features such as NFTs have the power to “free” content creators from the control of web2 tech giants and offer users more control over their data.","To that end, Animoca Brands was involved in the launch of OMA3. Its initial roster was made up mostly of companies it had links to — either through investments or partnerships — such as Alien Worlds and Dapper Labs.","It <a href=\"https:\/\/www.theblock.co\/post\/181648\/open-metaverse-alliance-membership-web3-builders\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">opened up<\/a> two membership tiers to other web3 builders earlier this month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Animoca Capital","content":"ORGANIZATION"},{"type":"Eden Games","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nikkei","content":"ORGANIZATION"},{"type":"Siu","content":"PERSON"},{"type":"Yat Siu","content":"PERSON"},{"type":"September this year","content":"DATE"},{"type":"Grease Monkey Games","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"first half of 2022","content":"DATE"}],"hashtag":["ANIMOCA BRANDS","PLAY2EARN","THE SANDBOX"],"authors":["Callan Quinn","The Block"]}