{"summary":"Blockchain.com and Crypto.com have notified those affected that they are enforcing restrictions on users connected to Russia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177184\/blockchain-com-and-crypto-com-restricting-russian-tied-accounts","publishDate":"2022-10-14T05:30:11","id":11318,"type":null,"title":"Blockchain.com and Crypto.com restricting Russian-tied accounts","category":["REGULATION"],"content":["Blockchain.com and Crypto.com have notified users that they are enforcing restrictions connected to Russia.","Blockchain.com will longer provide custodial and rewards services to Russian nationals, according to emails sent to users yesterday and seen by The Block. Notified users have until Oct. 27 to withdraw custodial funds and rewards — after which their accounts will be blocked. Rewards accruals are already blocked.","The crypto financial services company said the restrictions are a result of government sanctions recently issued by the European Union.","Crypto.com has already blocked users affected by the EU regulations from accessing the app. The emails, dated Oct. 14 and seen by The Block, do not provide any information regarding withdrawals — so it is assumed that withdrawing funds from Crypto.com is not an option.","The crypto exchange company also said the restrictions are a result of the new regulations.","The moves follow recent actions from NFT company Dapper Labs, which <a href=\"https:\/\/www.theblock.co\/post\/175639\/dapper-labs-freezes-funds-in-wallets-with-russian-ties-following-eu-sanctions-users-say\" data-v-f87c67ca=\"\">blocked<\/a> accounts tied to Russia about a week ago. The company, which created CryptoKitties and the Flow blockchain, also said its actions were a direct result of EU sanctions — <a href=\"https:\/\/www.theblock.co\/post\/175790\/dapper-labs-breaks-down-why-its-suspending-russian-accounts\" data-v-f87c67ca=\"\">adding<\/a> that while affected users cannot access or transfer their NFTs, they still own them.","The Block reached out to both Blockchain.com and Crypto.com for comment and will update accordingly.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Oct. 14","content":"DATE"},{"type":"Oct. 27","content":"DATE"}],"hashtag":["CRYPTO","SANCTIONS"],"authors":["Adam James","The Block"]}