{"summary":"OptiFi mistakenly shut down its mainnet while trying to upgrade the protocol.\nThe protocol’s funds are locked up and will remain so unless Solana validators agree to a patch that will make the protocol recoverable.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166445\/optifi-locks-up-661000-by-accidentally-shutting-itself-down","publishDate":"2022-08-30T07:23:44","id":1131,"type":null,"title":"OptiFi locks up $661,000 by accidentally shutting itself down","category":["DeFi"],"content":["OptiFi, a DeFi options trading protocol on Solana, accidentally shut down its mainnet thereby rendering $661,000 in user funds inaccessible, the project <a href=\"https:\/\/twitter.com\/p0stc4p0n3\/status\/1564442857460666369\" data-v-f87c67ca=\"\">announced<\/a> on Tuesday.","According to the team’s incident <a href=\"https:\/\/medium.com\/@OptiFi\/optifi-program-incident-report-08-29-22-d8fe6d229bad\" data-v-f87c67ca=\"\">report<\/a>, the mistake happened while trying to update the protocol’s mainnet. The team said the process took longer than expected probably due to <a href=\"https:\/\/www.theblock.co\/post\/131278\/traders-are-complaining-about-solanas-performance-raising-questions-about-its-status-as-a-wall-street-darling\" data-v-f87c67ca=\"\">network congestion on Solana<\/a>. As a result, they aborted the upgrade but not before the process created an intermediary account.","The developers then tried to reverse the creation of this intermediary account by closing the program. They used a command called “solana program close.” Unknown to the team, this command actually shuts down a protocol and freezes its tokens permanently. As such, the total value locked in the platform, <a href=\"https:\/\/defillama.com\/protocol\/optifi\" data-v-f87c67ca=\"\">amounting<\/a> to $661,000, is now locked.","“Here it turned out that we didn’t really understand the impact and risk of this closing program command line. ‘solana program close’ is actually for closing the program permanently and sending the SOL tokens in the buffer account used by the program back to the recipient wallet,” the team stated in the incident report.","OptiFi says it has learned from the incident and will take steps to prevent the same event from happening again. The Solana DeFi protocol says it will employ a “peer-surveillance approach” in future contract deployments. This approach involves using at least three participants in the process to review the steps being taken by the deployer to prevent future mistakes. OptiFi also said that it plans to compensate all affected users.","Richard Patel, a contributor on Jump Crypto’s Solana validator client Firedancer, <a href=\"https:\/\/twitter.com\/terorie_dev\/status\/1564415162408488961\" data-v-f87c67ca=\"\">proposed<\/a> a possible solution in the wake of the incident. This patch will reportedly make it possible for deleted Solana programs to be recoverable along with the funds held in such contracts.","The proposal has been pushed to the Solana GitHub repository but it is only the first step. Patel’s proposal will need to pass a technical review and then be designated as a feature (a name given to functions that the blockchain supports). The majority of Solana validators will then need to approve the feature before it can be activated on the network."],"hashtag":["SOLANA"]}