{"summary":"Last month, Celo began its pivot toward being an Ethereum Layer 2. Fantom is considering a similar move, but decries the Layer 2 terminology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243220\/fantom-optimistic-rollups-ethereum","publishDate":"2023-08-09T10:13:00","id":11329,"type":null,"title":"Fantom is exploring adding optimistic rollups to connect to Ethereum","category":["LAYER 2S AND SCALING"],"content":["Last month, Celo network proposed and approved a plan to turn its Layer 1 blockchain into a Layer 2 on Ethereum using optimistic rollups —&nbsp;a move that initially pumped its native token 18% when it was first announced.","In an <a href=\"https:\/\/www.youtube.com\/watch?v=TCDYBKLOZOQ\" data-v-f87c67ca=\"\">interview<\/a> on The Scoop, Fantom Foundation co-founder and architect Andre Cronje said that Fantom is actively considering and investigating a similar move to integrate optimistic rollups to connect the Fantom blockchain to Ethereum.","“We have been looking at Optimistic Stacks, Arbitrum Stack, all of these things to see how their canonical bridges use these proofs to be able to have [a] higher security guarantee,” Cronje said. “Are we considering one of their stacks to become our own canonical bridge? Yes, we are. And we are actively investigating that.”","Cronje confirmed that if Fantom adopts optimistic rollups and provides a full transaction history on Ethereum, then Fantom would need to pay transaction fees to write these snapshots to Ethereum.","Fantom Foundation CEO Michael Kong added that implementing Layer 2 technology in this way will allow the Fantom network to access more liquidity from the Ethereum ecosystem.","Cronje, however, doesn’t think there’s any such thing as a Layer 2 network. He prefers to see what’s typically referred to as a Layer 2 network as a sidechain and sees the optimistic rollup technology that combines them as a bridge between the two. He acknowledged it’s a semantic difference, but one he said he’s quite passionate about.","“Should we adopt — or rather, when we adopt — that bridge, does that make us a Layer 2? No, because a Layer 2 is just a sidechain,\" he said.","Cronje argued that such Layer 2 technology, like optimistic rollups, is a bridging technology that allows for native assets to move to another blockchain in a slightly more secure way. But he argued that the security this technology provides is invalidated once there are other bridges connected to the blockchains in question.","“It does make the canonical assets safer, which is awesome and that's why we're investigating it. But at the same time, if something goes wrong and people try and get their assets out, they're not really going to be able to because it's likely that those assets were already bridged out by other mechanisms. The only times it would really work is if there is a complete chain halt,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"Fantom","content":"PERSON"},{"type":"Arbitrum Stack","content":"PERSON"},{"type":"Michael Kong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Fantom","content":"ORGANIZATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"Optimistic Stacks","content":"LOCATION"},{"type":"Cronje","content":"PERSON"}],"hashtag":["ETHEREUM","OPTIMISM"],"authors":["Tim Copeland","The Block"]}