{"summary":"Decentralized exchange aggregator ParaSwap is mulling a proposal for reduced token emissions based on a social escrow system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175892\/paraswap-plots-reduced-token-emissions-with-new-social-escrow-system","publishDate":"2022-10-10T09:11:25","id":11321,"type":null,"title":"ParaSwap plots reduced token emissions with new social escrow system","category":["GOVERNANCE"],"content":["The ParaSwap community is mulling a <a href=\"https:\/\/gov.paraswap.network\/t\/psp-2-0-social-escrowed-psp-sepsp\/1003\" data-v-f87c67ca=\"\">proposal<\/a> that will change the way users earn rewards, which come in the form of native token emissions and a redistribution of transaction fees.","The proposal before the ParaSwap DAO governance forum calls for a new rewards system called social escrow. In social escrow, users earn rewards by performing actions deemed positive for the protocol. This differs from the current system where users who stake their tokens earn a portion of the fees generated by the decentralized exchange aggregator and its <a href=\"https:\/\/www.theblock.co\/post\/124312\/dex-aggregator-paraswap-launches-its-own-token-to-airdrop-150-million-psp\" data-v-f87c67ca=\"\">native token emissions<\/a>.","These socially beneficial actions include staking the platform’s native PSP token, trading on the protocol and inviting other users via referral links. Users earn a score for performing any of these actions.","According to ParaSwap founder Mounir Benchemled, social escrow drives better user participation than vote-locked escrow (where token holders lock up their tokens to receive greater voting rights). “In the social escrow model, users are encouraged to trade and participate in the governance. The more of these things they do, the higher their score, and the higher their protocol share will be,” said Benchemled.","The ParaSwap founder also said there are objective metrics for measuring these actions and rewarding users who do them. Benchemled stated that things like the number of referrals generated by a user and the volume from users who stake their tokens can be tracked.","The pivot to a social escrow system is part of a broader tokenomics change for ParaSwap. This aims to transition the protocol from its current model to one that has significantly reduced token emissions. This change will be put to a vote among members of the ParaSwap community.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mounir Benchemled","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"ParaSwap","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}