{"summary":"Jesse Powell&#x27;s comments came in response to Reddit&#x27;s decision to pull the plug on its blockchain-based reward service Community Points.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258148\/kraken-co-founder-reddit-shouldnt-destroy-value-of-community-tokens-while-offering-nothing-in-return","publishDate":"2023-10-18T09:50:58","id":11326,"type":null,"title":"Kraken co-founder: Reddit shouldn&#x27;t destroy value of community tokens while &#x27;offering nothing in return&#x27;","category":["PEOPLE"],"content":["Kraken co-founder Jesse Powell said Reddit shouldn't destroy the value of community tokens while \"offering nothing in return,\" responding to yesterday's news that the social media platform is pulling the plug on its blockchain-based reward service Community Points three years after its rollout. The move sent two related tokens crashing.&nbsp;","\"We recently made the decision to sunset the Community Points beta, including Special Memberships, by Nov. 8. At that point, you'll also no longer see Points in your Reddit Vault nor earn any more Points in your communities. Though we saw some future opportunities for Community Points, there was no path to scale it broadly across the platform,\" Reddit <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/17a33ql\/serious_sunsetting_community_points_beta_and\/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\" data-v-f87c67ca=\"\">wrote<\/a> in a message on its platform yesterday.","The decision was also attributed to regulatory issues. \"The regulatory environment has added to scalability limitations. Though the moderators and communities that supported Community Points have been incredible partners, as it's evolved, the product is no longer set up to scale,\" Reddit added.","In August, Kraken <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrencyMoons\/comments\/15krl28\/reddit_moons_and_bricks_soar_after_kraken_listing\/\" data-v-f87c67ca=\"\">listed<\/a> two Reddit community reward tokens, MOON and BRICK, causing them to soar in price. After yesterday's news, MOON plunged around 90% from $0.24 to $0.024, according to CoinGecko data, while other Reddit reward tokens dropped similarly.","<span data-v-f87c67ca=\"\">MOON\/USD price chart. Image: <a href=\"https:\/\/www.coingecko.com\/en\/coins\/moon\" data-v-f87c67ca=\"\">CoinGecko<\/a>.<\/span>","\"I personally don't see the regulatory problems but I get that it's complicated and evolving and maybe Reddit doesn't want the hassle,\" Powell <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/17a33ql\/serious_sunsetting_community_points_beta_and\/k5ae9qu\/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button\" data-v-f87c67ca=\"\">responded<\/a> on the platform. \"Reddit should at least offer a redemption path. Let people buy Collectible Avatars with the points at some ratio or something. Convert the points to Karma, give people a special badge based on holdings at time of burn. It shouldn't just be that Reddit destroys the value of the holdings while offering nothing in return.\"","Launched in 2020, Community Points were introduced to reward Reddit users for activity on the platform, such as receiving significant upvotes on comments or posts. The aim was to boost user engagement and strengthen communities.","The points users earned were Ethereum-compatible ERC-20 tokens stored in Reddit's crypto wallet, Reddit Vault, which could be spent on perks like emojis or badges. However, to address scalability issues and reduce transaction costs, the service <a href=\"https:\/\/www.theblock.co\/post\/162299\/reddits-community-points-are-migrating-to-arbitrum-nova\" data-v-f87c67ca=\"\">migrated<\/a> from Ethereum to Layer 2 Arbitrum Nova in August 2022.","\"Moving away from Points allows us to invest in products that provide value to more Redditors,\" Reddit wrote in yesterday's post. \"We’ve also launched, or are actively investing in, several products that accomplish what the Community Points program was aimed at.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit Vault","content":"LOCATION"},{"type":"90%","content":"PERCENT"},{"type":"Arbitrum Nova","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"August 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Powell","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Nov. 8","content":"DATE"},{"type":"Jesse Powell","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$0.24","content":"MONEY"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"Karma","content":"LOCATION"},{"type":"Points","content":"ORGANIZATION"},{"type":"$0.024","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["JESSE POWELL","KRAKEN"],"authors":["James Hunt","The Block"]}