{"summary":"A sophisticated attack on Ethereum led to a loss of over $25 million for a group of MEV bots trying to capture arbitrage opportunities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224482\/ethereum-mev-bots-lose-over-25-million-in-sophisticated-attack","publishDate":"2023-04-03T07:02:15","id":11328,"type":null,"title":"Ethereum MEV bots lose over $25 million in sophisticated attack","category":["CRYPTO ECOSYSTEMS"],"content":["A sophisticated exploit led to a loss of over <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1642787345366941697\" data-v-f87c67ca=\"\">$25 million<\/a> for a group of blockchain bots working to generate revenue through a process called maximal extractable value (MEV).","MEV bots operate like blockchain-based high frequency traders. They focus on using speed and the technicalities of how blockchains work to capture arbitrage opportunities. But to do so, they often have to put large amounts of money at risk (in order to manipulate prices to sufficient levels).","An attacker <a href=\"https:\/\/etherscan.io\/txs?block=16964664\" data-v-f87c67ca=\"\">compromised<\/a> some of these MEV bots on April 3, by substituting their regular transactions with malicious ones, resulting in the theft of their funds. In doing so, the attacker inflicted substantial losses on the MEV bots.","Joseph Plaza, decentralized finance trader at Wintermute, explained that the exploiter likely set \"bait\" transactions to lure the MEV bots. The attacker then replaced the initial baiting transactions with new, malicious ones, allowing them to steal the funds. To prepare for the attack, the perpetrator <a href=\"https:\/\/etherscan.io\/address\/0x687a9414b0225092d4a8b859fe813f1f637d3383\" data-v-f87c67ca=\"\">deposited<\/a> 32 ETH to become a validator 18 days before the incident.","Plaza added that the attacker probably waited until it was their turn to propose a block as a validator, which coincided with the attack. They subsequently reorganized the contents of the block and created a new one containing their malicious transactions in order to drain assets.","Smart contract developer \"3155.eth\" initially <a href=\"https:\/\/twitter.com\/punk3155\/status\/1642771856758546434\" data-v-f87c67ca=\"\">revealed<\/a> the incident on Twitter, and PeckShield subsequently <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1642787345366941697\" data-v-f87c67ca=\"\">traced<\/a> the stolen assets to three Ethereum addresses, consolidated from eight other addresses.","Flashbots, the developer of the primary MEV software used on Ethereum, known as MEV-Boost, has responded with a fix to prevent such incidents from occurring in the future.","The team has introduced a <a href=\"https:\/\/github.com\/flashbots\/mev-boost-relay\/pull\/330\" data-v-f87c67ca=\"\">feature<\/a> that instructs relayers, a trusted mediator party between block builders and validators, to publish a signed block before transmitting its contents to a proposer, a step that was previously absent. This action aims to decrease the likelihood of a malicious proposer within MEV-Boost proposing a block that deviates from what they received from a relay.","<em data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, sits on The Block's board of directors.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Twitter","content":"DATE"},{"type":"April 3","content":"DATE"},{"type":"3155","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"Joseph Plaza","content":"PERSON"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}