{"summary":"Bankman-Fried denied knowing specific details regarding the existence of the &quot;fiat@&quot; liability at the heart of the trial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259893\/sbf-paints-alternative-view-of-his-knowledge-of-the-fiat-account-in-court","publishDate":"2023-10-28T09:01:05","id":11324,"type":null,"title":"SBF paints alternative view of his knowledge of the Fiat@ account in court","category":["COMPANIES"],"content":["Sam Bankman-Fried knows he made a number of mistakes, both small and large, over his time leading crypto trading firm Alameda Research and, later, his cryptocurrency exchange FTX. In fact, Bankman-Fried planned to begin his testimony to Congress following the FTX collapse with a simple declaration, made under oath: \"I fucked up.\"&nbsp;","One of the biggest mistakes he made, Bankman-Fried testified yesterday in his trial on seven counts of fraud and conspiracy, was not having a dedicated risk team in place at FTX. \"We sure should have, but no, we did not,\" Bankman-Fried testified. He also acknowledged other oversights, like not tracking an account which took a position in MobileCoin that \"presented systematic risk to the [FTX] system and all of its platforms.\"&nbsp;","Yet, when asked by Mark Cohen, the lead attorney for his defense, whether he ever defrauded anyone or took customer funds, Bankman-Fried denied both charges.&nbsp;&nbsp;","In Bankman-Fried’s telling, he believed the funds he spent on everything from venture investments and marketing partnerships to Bahamian real estate purchases and loan repayments came from legitimate sources, mainly the profits of his multi-billion dollar companies, along with loans to Alameda Research, which Bankman-Fried owned 90% of, from third-party lenders.&nbsp;","That belief may have been based on flawed data, however, as Alameda Research had over time amassed an $8 billion debt to FTX related to the <a href=\"https:\/\/www.theblock.co\/post\/254855\/inside-the-courtroom-why-fiat-will-be-key-to-the-sbf-trial\" data-v-f87c67ca=\"\">‘fiat@’ system<\/a> — a liability that Bankman-Fried testified he was only made wholly aware of in October 2022, after the period in which most of the spending occurred.&nbsp;","Bankman-Fried’s story of the origins of fiat@ largely matches with the testimony from his former associates-turned-witnesses: at FTX’s inception, the exchange had trouble opening its own bank accounts, and thus relied on several payment processors. One such payment processor was Alameda Research; customers could wire funds to an Alameda Research-affiliated bank account which were then credited to their accounts on the FTX exchange.&nbsp;","In essence, that meant Alameda Research now owed those funds to FTX, a liability that was tracked in a database ledger entry known as \"fiat@.\" Yet Bankman-Fried denied knowing the specific details of the system, or how the liability was being tracked, even though over time it would grow to represent billions of dollars owed by Alameda to FTX.&nbsp;","\"So at the time, I wasn't entirely sure what was happening. What I believed was that either the funds were just being held in a bank account and...not used or removed, or that they were being sent to FTX in one way or another, maybe as stablecoin[s],\" Bankman-Fried testified. If Alameda was borrowing the funds, Bankman-Fried assumed \"...that would be reflected as a borrow on Alameda's info@ account,\" or the main account Alameda Research used for trading on FTX.&nbsp;","However, in reality, the fiat@ liability was being tracked separately from the info@ borrows, though it still factored into the calculation of Alameda Research’s Net Asset Value, or NAV, which represented the trading firm’s overall wealth.&nbsp;","In fact, during the summer of 2022, a bug in the fiat@ calculation led Alameda Research CEO Caroline Ellison to believe the firm was on the verge of bankruptcy. When developers Gary Wang and Nishad Singh found and fixed the bug, they informed Bankman-Fried that it stemmed from something called fiat@ related to bank deposits and withdrawals, he testified, though he denied knowing what it was at the time.&nbsp;","According to Bankman-Fried’s testimony, it wasn’t until October 2022 that he stumbled across the fiat@ entry himself, in a new database meant for non-developers to use without risking any harm to FTX’s primary database. Bankman-Fried testified he was \"very surprised\" after discovering the fiat@ liability, which was around $8 billion at the time.&nbsp;","Fiat@ had the effect of obscuring the true nature of Alameda’s borrowing. For example, in October 2022, Bankman-Fried testified that Alameda’s NAV was around $10 billion, comprising -$2 billion in borrows on info@ and, presumably, $12 billion in net other assets. In this circumstance, Alameda’s assets would need to crash by roughly 83% in order to wipe out the trading firm.&nbsp;","When taking into account the fiat@ liability, the topline NAV number would stay the same at $10 billion. However, with the liabilities now totaling -$10 billion ($2 billion from info@ plus $8 billion from fiat@), and Alameda’s remaining assets presumably amounting to $20 billion, a 50% crash in asset value would wipe out the firm —&nbsp;a crash similar in size to the one Bitcoin and many other digital assets suffered in 2022.&nbsp;","A loss of this size would be far from anomalous for Alameda Research. In fact, according to Bankman-Fried’s testimony, \"Alameda's net asset value fell from above $40 billion at the peak in late '21 to around $10 billion ultimately in June of 2022.\"","Furthermore, since the liability represented a debt to FTX, Alameda becoming insolvent would endanger not just his trading firm, but his entire empire.&nbsp;","Since Alameda’s NAV was still positive, Bankman-Fried testified that he thought the debt could be repaid, though. Given Alameda’s $10 billion NAV, \"I was of the view that Alameda had plenty in asset value to be able to cover the liability,\" Bankman-Fried testified. Bankman-Fried also offered to contribute his own FTX equity to Alameda to cover the liability. \"I was more than happy to pledge everything I had, including [his FTX equity], as security for any of Alameda's liabilities, including this one,\" Bankman-Fried said.&nbsp;","Bankman-Fried’s testimony seems to offer a sweeping defense towards many of the prosecution’s complaints of lavish spending and reckless investment; namely, that it doesn’t look as unreasonable if Bankman-Fried believed his empire was around $8 billion richer than it actually was.&nbsp;","Bankman-Fried will likely face extensive cross-examination on Monday over his knowledge of fiat@ —&nbsp;especially given that some of his answers seemingly contradict with the testimony of other witnesses.&nbsp;","Nishad Singh, for example, testified that he had overheard Bankman-Fried discussing fiat@ with FTX chief of staff Jen Chan in Dec. 2019 — far before the June 2022 incident when Bankman-Fried testified he first heard of its existence.","\"I remember discussions about the setup of <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"f5939c9481b5b3a1addb969a98\">[email&nbsp;protected]<\/a>. I think I overheard them…there was talk about how <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"57313e36231711030f7934383a\">[email&nbsp;protected]<\/a> would be incorporated into Alameda's own native sense of what their balances were, such that customer deposits made into bank accounts, plus their consideration of <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"bcdad5ddc8fcfae8e492dfd3d1\">[email&nbsp;protected]<\/a>, should always be zero,\" Singh testified.","Singh and Bankman-Fried also had different recollections of the <a href=\"https:\/\/www.theblock.co\/post\/257840\/inside-sbfs-trial-nishad-singh-said-no-but-not-often-enough\" data-v-f87c67ca=\"\">same meeting<\/a> on the balcony of their penthouse in Sep. 2022. On the topic of liabilities, Singh remembers saying, \"Well, what about what Caroline said today and Gary said today, that there's 13 billion borrowed and we can't pay it all?\" Singh also testified that Bankman-Fried responded \"Right, that. We are a little short on deliverables.\"","Bankman-Fried, meanwhile, testified about Singh, \"He said – and I don't remember it being specified more clearly than what I'm about to say – that liabilities had gotten far larger than they had used to be or then we had thought they were.\" Bankman-Fried added that Singh \"may have thrown out a number of 8 billion or so.\"&nbsp;","Bankman-Fried's direct examination will continue when the trial resumes on Monday. Cross-examination and a possible rebuttal case by the prosecution will follow.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"billions of dollars","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"October 2022","content":"DATE"},{"type":"Dec. 2019","content":"DATE"},{"type":"June of 2022","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Jen Chan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$20 billion","content":"MONEY"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Alameda’s NAV","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"June 2022","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Caroline","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"today","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"Nishad Singh","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"83%","content":"PERCENT"},{"type":"Alameda Research’s Net Asset Value","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"summer of 2022","content":"DATE"},{"type":"Gary","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"$12 billion","content":"MONEY"},{"type":"Sep. 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"Singh","content":"PERSON"},{"type":"Mark Cohen","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","Anna Baydakova","The Block"]}