{"summary":"Abracadabra DAO has unveiled a proposal for a legal framework to transition from a decentralized to a more centralized structure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238056\/breaking-the-defi-spell-abracadabra-dao-mulls-centralized-entity","publishDate":"2023-07-06T05:49:26","id":11340,"type":null,"title":"Breaking the DeFi spell: Abracadabra DAO mulls centralized legal entity","category":["GOVERNANCE"],"content":["Abracadabra DAO, the governance body behind the Magic Internet Money and Spell tokens, has unveiled a proposal for a legal framework to help bridge the centralized and decentralized worlds.","The proposal suggests appointing a trustee or attorney specializing in intellectual property rights to safeguard the DAO's trademarks and manage server expenses, with crucial decisions still governed by Spell token holders, according to a <a href=\"https:\/\/forum.abracadabra.money\/t\/aip-22-abracadabra-dao-legal-framework-bridging-worlds\/4272\" data-v-f87c67ca=\"\">post<\/a> on Abracadabra's forum yesterday.","Currently, the Abracadabra protocol relies on community members privately funding essential services like hosting and domains, the post said. However, this decentralized structure has posed challenges in defending intellectual property rights, as demonstrated by the forced migration of the DAO's blog due to a “baseless copyright claim,” the post added.","\"The proposal was posted yesterday so it is only the first step,\" an Abracadabra DAO contributor known as Romy told The Block in an email. \"[I'm] very excited to see what the community contribution is and where this will go!\"","Magic Internet Money is a USD-pegged stablecoin backed by yield-bearing crypto assets with a market cap of around <a href=\"https:\/\/www.coingecko.com\/en\/coins\/magic-internet-money\" data-v-f87c67ca=\"\">$87 million<\/a>, according to CoinGecko data. Spell is the governance token of Abracadabra’s DeFi lending platform. Its market cap stands at around <a href=\"https:\/\/www.coingecko.com\/en\/coins\/spell-token\" data-v-f87c67ca=\"\">$59 million<\/a>.","Such a move contradicts the original ethos of a decentralized autonomous organizations, though the proposal still emphasized the importance of Abracadabra’s commitment to decentralization.","“Despite our commitment to decentralization, we’ve recognized the importance of introducing a certain degree of centralized legal structure,” the post said. “The purpose here is not to disrupt the decentralized nature of Abracadabra; in fact, it’s to protect it. Every crucial decision will continue to be governed by the Spell token holders as it has always been.”","\"Bear in mind this vote is not at all to centralize anything related to MIM or Abracadabra, but simply to have a point of contact (that judging from the options can be a lawyer, an association or any other legal entity) that can represent the DAO when it has to interface itself with centralized entities such as market makers, service providers, etc,\" Romy added. \"So there is no centralization of the DAO, its operations or treasury. All it will be is adding a point of contact that the DAO can use to interface with centralized players.\"","The U.S. Commodity Futures Trading Commission's win in the <a href=\"https:\/\/www.theblock.co\/post\/234019\/cftc-wins-ooki-dao-case-setting-precedent-that-daos-can-be-held-liable\" data-v-f87c67ca=\"\">Ooki DAO<\/a> case last month set a precedent that DAOs can be held liable, adding pressure to the need for legal frameworks, even if that means sacrificing at least some level of decentralization. <a href=\"https:\/\/www.theblock.co\/post\/179986\/sushi-dao-agrees-to-implement-a-new-corporate-legal-structure\" data-v-f87c67ca=\"\">Sushi DAO<\/a> also agreed to implement a new corporate legal structure in October.","The proposed “transition of power” to the new entity will be determined through a multi-phase voting process involving Spell token holders. The first phase involves selecting the jurisdiction for the new entity, with Switzerland, Singapore, Malta and Bermuda as the proposed choices. The subsequent phases will seek to define the roles and operations of the new entity before a final vote.","The Spell token has fallen around <a href=\"https:\/\/www.coingecko.com\/en\/coins\/spell-token\" data-v-f87c67ca=\"\">3%<\/a> since the proposal was posted, according to CoinGecko.","In November, Magic Internet Money temporarily <a href=\"https:\/\/www.theblock.co\/post\/184109\/mim-stablecoin-slightly-loses-dollar-parity-amid-fears-of-partial-ftt-backing\" data-v-f87c67ca=\"\">lost<\/a> its dollar parity over fears a portion of its value was backed by FTT — the native token of the collapsed FTX crypto exchange.","<em data-v-f87c67ca=\"\">Updated with clarification and comment from an Abracadabra DAO contributor on the proposed legal entity and corrected throughout to remove reference to a project lead.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Switzerland","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"MIM","content":"ORGANIZATION"},{"type":"$59 million","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Romy","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"Abracadabra","content":"ORGANIZATION"},{"type":"Magic Internet Money","content":"ORGANIZATION"},{"type":"U.S. Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"$87 million","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"Abracadabra DAO","content":"ORGANIZATION"},{"type":"Abracadabra","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bermuda","content":"LOCATION"},{"type":"Magic Internet Money and Spell","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Malta","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["DAOS","FTX"],"authors":["James Hunt","The Block"]}