{"summary":"Cosmos Hub, the original blockchain in the Cosmos ecosystem, has created a way for other blockchains to lean on its security.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219219\/cosmos-hub-releases-replicated-security","publishDate":"2023-03-15T03:00:18","id":11342,"type":null,"title":"Cosmos Hub releases Replicated Security to draw closer to rest of ecosystem","category":["CRYPTO ECOSYSTEMS"],"content":["Cosmos Hub, the first of the Cosmos-based blockchains, released Replicated Security in a bid to position itself more centrally in the Cosmos ecosystem.","Originally called Interchain Security, this mechanism will let other blockchains drop their own validators and switch to Cosmos Hub’s security and set of validators. The new product should provide more security options for chains in the Cosmos ecosystem and boost the presence of the Cosmos Hub.","“It will allow projects to launch [application-specific blockchains] but then also be able to have the full security of the Cosmos Hub,” Jehan Tremback, product manager for the Cosmos Hub team at Informal Systems, said in an interview.","Since every application in the Cosmos ecosystem has its own blockchain, it can be expensive for each chain to maintain its own level of security. This will provide an alternative way for those chains to operate without disregarding security.","“It really leverages one of the Cosmos Hub’s big strengths. It has a high market cap and a lot of recognition, having been around the longest,” said Tremback. “Replicated Security allows the Cosmos Hub to leverage that high market cap to do something useful with it — to lend the security to other chains.”","Replicated Security will also help to make Cosmos Hub a bigger presence in the wider ecosystem and provide more use for its native atom token.","“Right now atom is a staking token but just for Cosmos Hub. With Replicated Security it’s going to become a staking token for Cosmos Hub and all the projects that are getting security from Cosmos Hub,” Tremback said.","For a blockchain to take part in Replicated Security, the team behind it will need to go through the governance process on the Cosmos Hub. This will let validators en masse decide which chains they’re willing to support. (Tremback noted that a future update should let validators select chains they want to support on a one-by-one basis — providing more flexibility).","When this happens, the stake that’s put up on Cosmos Hub will be used to secure the transactions made on the other networks that are using this system. It means Cosmos Hub validators will need to run validators for the other networks. If the validator doesn’t conform to the requirements, their stake on the Cosmos Hub could get slashed.","Such validators can use the atom they have staked on the Cosmos Hub and earn extra rewards from these other chains. These rewards will be paid out in either atom or the blockchain’s native token. Validators will need to decide whether the rewards are worth the cost of running the extra validators on the other chains.","Replicated Security is one approach targeting the need in the Cosmos ecosystem for application-specific chains to have more ways of securing their networks.","Osmosis, another chain in the Cosmos ecosystem, is pushing for its own solution called Mesh Security. This works similarly to Replicated Security but it allows for any validator set to provide security for another blockchain.","A project called <a href=\"https:\/\/www.theblock.co\/post\/215662\/babylon-to-bring-bitcoin-security-to-chains-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">Babylon<\/a> has taken quite a different approach to solving the same problem. It has looked outside the Cosmos ecosystem to Bitcoin for security. The idea here is that any chain can, through its network, have their blocks confirmed on the Bitcoin blockchain. This isn’t set to replace the blockchain’s security, but to enhance it.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tremback","content":"PERSON"},{"type":"Mesh Security","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Interchain Security","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Informal Systems","content":"ORGANIZATION"},{"type":"Jehan Tremback","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tremback","content":"ORGANIZATION"},{"type":"Cosmos Hub validators","content":"ORGANIZATION"}],"hashtag":["COSMOS","CROSS-CHAIN SWAPS"],"authors":["Tim Copeland","The Block"]}