{"summary":"The biggest takeaway was likely the prevailing bipartisanship in opposition to major banks, which played strongly in favor of the crypto industry today. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133526\/in-todays-house-hearing-congress-rejects-treasurys-proposed-stablecoin-regime","publishDate":"2022-02-08T17:35:58","id":11349,"type":null,"title":"In today’s House hearing, Congress rejects Treasury’s proposed stablecoin regime","category":["REGULATION"],"content":["The US Treasury Department's proposal for new stablecoin law is dead in the water if today's hearing before Congress is any indication.","On February 8, the House Financial Services Committee hosted Nellie Liang, the Treasury’s undersecretary for domestic finance and the driving force behind a <a href=\"https:\/\/www.theblockcrypto.com\/post\/122890\/us-treasury-releases-long-awaited-report-on-stablecoin-risk-features-request-for-new-laws\" data-v-f87c67ca=\"\">November report on stablecoins<\/a> from the President’s Working Group on Financial Markets.","The Block previously noted Liang’s <a href=\"https:\/\/www.theblockcrypto.com\/post\/132827\/house-and-senate-hearings-on-stablecoins-will-spotlight-official-behind-treasury-report-sources\" data-v-f87c67ca=\"\">unique role and expected pitch<\/a> to limit stablecoin issuance to insured depository institutions, or IDIs.","IDIs are institutions that possess FDIC insurance, which for the most part encompasses banks. Given its origins with the financial collapse and bank runs that heralded the Great Depression, FDIC insurance comes with a whole host of capital and liquidity requirements, as well as federal supervision.","The distinction, many point out, is that banks make their money by lending out client deposits. Consequently, stablecoin reserve compositions have become a major sticking point in the conversation.","As Warren Davidson (R-OH) told The Block of takeaways from the hearing: “The biggest thing I hope is that a stablecoin really depends on what’s behind a stablecoin.”","Industry players generally seek lighter-touch regulations, and this case is no exception. But alongside the industry, today’s hearing illustrated that this skepticism has become a new touchstone of bipartisanship in the House.","While there was broad consensus that stablecoins need to make disclosures and face audits, the committee broadly rejected the idea that every stablecoin issuer needs the same kind of regulation as banks. Chairwoman Maxine Waters (D-CA) even interjected between the questions of two other representatives to enjoin committee members: “Do not minimize a permissible reserve.”","Notably, Democratic briefing materials reviewed by The Block highlighted “Republicans and industry perspective,” observing that “[t]here has been a lot of bipartisanship and areas where our views will overlap.”","Central to this bipartisanship are issues of equity and, moreover, shared hostility towards the major banks that already operate as insured depository institutions.","“It occurs to me that limiting stablecoin issuance to IDIs, which have a high barrier of entry, could limit competition,” said Gregory Meeks (D-NY). “Such recommendations could have a racial equity impact.”","Jim Himes (D-CT) commented: “There is a radical difference between a stablecoin backed fully dollar-to-dollar […] and what Mr. Green memorably called investing in nothing.” He went on to ask if Liang would “agree that full IDI, bank charter regulation may not be necessary in that case.”","Himes has recently worked with Coin Center to strike new Treasury surveillance authorities from <a href=\"https:\/\/www.theblockcrypto.com\/linked\/132510\/congressman-and-crypto-lobby-scale-back-new-treasury-surveillance-authority-in-competes-act\" data-v-f87c67ca=\"\">anti-money laundering provisions in the COMPETES Act<\/a>.","In response, Liang said that stablecoin issuers would not need the same sorts of oversight, but maintained the need for IDI insurance. Effectively, her broad argument was to leave that discretion with banking regulators. The committee didn’t seem to buy it.","Patrick McHenry (R-NC), the committee’s top-ranking Republican, considered the current risk of stablecoins less than if Congress legislated them into the IDI framework. “How do they mitigate this alleged risk? They make them all banks and they give them a federal backstop. Which is completely the opposite approach.”","Ritchie Torres (D-NY), proposed that stablecoins are best regulated “not by the blunt instrument of banking regulation,” but by common-sense rules. He particularly criticized the IDI proposal on the ground that Circle, which issues USDC, was stuck in its bank charter application.","Torres, a freshman representative from the Bronx, has <a href=\"https:\/\/www.theblockcrypto.com\/post\/126866\/what-we-learned-at-congress-much-anticipated-summit-of-crypto-execs\" data-v-f87c67ca=\"\">previously spoken approvingly<\/a> of the role stablecoins can play in remittances for the many members of his constituency looking to send money to family abroad.","Perhaps most broadly, the hearing today illustrated that Democrats have become more receptive to crypto’s potential impact on the unbanked, minority communities, and cross-border transfers. That is partially thanks to the interests of a freshman class of representatives, but it is also the product of the cryptocurrency industry’s increasing engagement in Washington, DC, including presentation of the industry’s work on social justice and donation to Democratic campaigns and causes.","Liang will <a href=\"https:\/\/www.theblockcrypto.com\/linked\/133515\/treasury-official-behind-stablecoin-report-to-testify-at-senate-hearing-next-week\" data-v-f87c67ca=\"\">testify before the Senate Banking Committee<\/a> on the same report next week. But the House has a much easier time getting legislation through than the dead-locked Senate, and any legislation implementing the IDI requirement will have to originate in one of these two committees. Moreover, November midterms loom, threatening the pace of any legislation amid a more partisan environment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nellie Liang","content":"PERSON"},{"type":"Bronx","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Gregory Meeks","content":"PERSON"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"IDI","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"House","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Liang","content":"PERSON"},{"type":"February 8","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US Treasury Department","content":"ORGANIZATION"},{"type":"Green","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Warren Davidson","content":"PERSON"},{"type":"DC","content":"LOCATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"President’s Working Group on Financial Markets","content":"ORGANIZATION"},{"type":"Jim Himes","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CONGRESS","TRADFI BANKS"],"authors":["Kollen Post","The Block"]}