{"summary":"Prince Charles made the comments in the state opening of Parliament, which the Queen missed for health reasons.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145992\/queens-speech-uk-government-to-introduce-bill-to-tackle-illicit-finance","publishDate":"2022-05-10T06:50:54","id":11346,"type":null,"title":"Queen&#x27;s Speech: UK government to introduce bill to tackle illicit finance","category":["CRYPTOCURRENCY"],"content":["The UK will introduce a bill to tackle illicit finance, Prince Charles said in the Queen's Speech, as he marked the opening of Parliament.","\"A bill will be brought forward to further strengthen powers to tackle illicit finance, reduce economic crime and help businesses grow. Measures will be introduced to support the security services and help them protect the United Kingdom,\" he said.","There was no clear mention of cryptocurrencies, which were expected to be highlighted in the speech.","According to <a href=\"https:\/\/www.ft.com\/content\/b0bda4c4-def4-4816-9563-febba4834f28\" data-v-f87c67ca=\"\">reporting<\/a> by the Financial Times in February, the new bill will push forward powers for the government to seize crypto assets.","Earlier in the speech, Prince Charles said, \"Measures will also be published to create new competition rules for digital markets, and the largest digital firms. \"","The speech also highlighted a focus on the economy and on helping with the cost of living in the midst of the recent cost of living crisis. Further, the Bank of England will focus on returning inflation to its target.","The Queen’s Speech marks the start of a new Parliamentary session in the UK. The government writes and approves its content, which outlines upcoming government policy and the legislative program. This year marks a departure from tradition, however, as for the first time it was read by the Queen’s son, Prince Charles.","<em data-v-f87c67ca=\"\">This article has been updated to reference previous reporting by the FT.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Queen","content":"LOCATION"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["UK PARLIAMENT"],"authors":["Tim Copeland","The Block"]}