{"summary":"Foundry Digital has launched a dedicated marketplace called FoundryX to sell bitcoin mining machines to larger miners.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126773\/dcg-foundry-foundryx-marketplace-bitcoin-mining-machines","publishDate":"2021-12-08T09:00:08","id":11358,"type":null,"title":"DCG&#x27;s Foundry launches marketplace to sell bitcoin mining machines","category":["MINING"],"content":["Foundry Digital, a mining subsidiary of crypto conglomerate Digital Currency Group (DCG), has launched a dedicated marketplace to sell bitcoin mining machines.","<a href=\"https:\/\/foundryx.com\/\" data-v-f87c67ca=\"\">The FoundryX platform<\/a> will let users buy as well as sell bitcoin mining machines. Foundry said it has built relationships with over 200 buyers and sellers, including public mining companies, family offices, and energy companies.","The formal launch of FoundryX comes after the firm operated the service behind the scenes over the past year, Foundry's VP of business development Jeff Burkey told The Block. The firm has had sales of over $125 million this year from this business, serving customers in the U.S., Canada, and Norway, said Burkey.","FoundryX will sell both new and second-hand bitcoin mining machines, said Burkey. The platform will cater to mid-and-large-sized miners, not small at-home miners. The minimum order size for mining machines is 50 units, according to the FoundryX website.","Foundry said it currently has over 40,000 units of the latest bitcoin mining machines from Bitmain and MicroBT available for delivery through next year.","But why would miners buy machines from Foundry instead of manufacturers directly? Burkey said manufacturers have higher minimum order quantities, typically above 100 units. They also require large deposits six months or more ahead of delivery. Foundry, on the other hand, can fulfil smaller orders and has flexible payment options, he added.","\"Our goal for 2022 is to be the market leader in the $2.5 billion [crypto mining hardware] market,\" said Burkey.","The demand for FoundryX's services will increase as Chinese miners are looking to set up operations around the globe, and new players are entering the market, including energy companies and family offices, according to Burkey.","Foundry was launched in 2019. It <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97984\/dcg-foundry-bitcoin-btc-mining-pool\" data-v-f87c67ca=\"\">opened<\/a> its bitcoin mining pool to the public last year and has quickly grown to become the second-largest mining pool in the world, behind only AntPool. It <a href=\"https:\/\/btc.com\/stats\/pool?pool_mode=month\" data-v-f87c67ca=\"\">represents<\/a> nearly 15% of Bitcoin's network hash rate or computing power, according to tracker btc.com.","Last month, Foundry also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123901\/dcg-foundry-staking-service-institutions\" data-v-f87c67ca=\"\">launched<\/a> crypto staking business aimed at institutions such as exchanges, wallets, custodians, hedge funds, banks, and venture capital firms.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"Norway","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bitmain","content":"LOCATION"},{"type":"Jeff Burkey","content":"PERSON"},{"type":"Burkey","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"$125 million","content":"MONEY"},{"type":"Foundry Digital","content":"ORGANIZATION"}],"hashtag":["BITCOIN","DIGITAL CURRENCY GROUP"],"authors":["Yogita Khatri","The Block"]}