{"summary":"An NFT collector who lost a Bored Ape to OpenSea’s listing bug has sued the company demanding $1 million in damages.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135032\/nft-marketplace-opensea-hit-with-1-million-bored-ape-lawsuit","publishDate":"2022-02-22T10:29:36","id":11356,"type":null,"title":"NFT marketplace OpenSea hit with $1 million Bored Ape lawsuit","category":["NFTS"],"content":["OpenSea, the popular NFT marketplace, has been hit with a $1 million lawsuit brought by a disgruntled user who lost a Bored Ape NFT this month.","A&nbsp;collector named Timothy McKimmy is suing OpenSea in Texas for security vulnerabilities on its platform that caused his prized NFT to be sold far below fair value, according to a&nbsp;<a href=\"https:\/\/www.scribd.com\/document\/560422738\/1-1\" data-v-f87c67ca=\"\">case<\/a> filed last Friday. McKimmy’s complaint is based on a <a href=\"https:\/\/www.theblockcrypto.com\/post\/131443\/opensea-reimburses-users-sold-nfts-below-market-value-ui-issue\" data-v-f87c67ca=\"\">listing bug<\/a> that saw his Bored Ape #3475 NFT, which he bought for 55 ETH ($137,000), sold for 0.01 ETH ($26) earlier this month.","At the time of the sale, the Bored Ape Yacht Club floor price was 100 ETH ($305,000), according to data from CoinGecko. The attacker even “flipped” the NFT in question for 98.9 ETH moments later.","As part of the suit, McKimmy says OpenSea failed to address the security issues, putting users’ NFTs at risk. The plaintiff is one of several users that reported falling for the listing bug mishap.","The listing bug happened when users moved their NFTs from their wallets linked to OpenSea to a different address without canceling the previous listing. Users likely elected not to cancel the listing because the step required paying a transaction fee.","Once moved to a new wallet, users likely set a new selling price which did not cancel the listing price on the OpenSea-linked wallet. The problem arose when users moved NFTs back to their OpenSea-linked wallets, activating the previous, lower listing price. Rogue actors were then able to snipe premium NFTs for a bargain price.","McKimmy’s suit demands the return of his Bored Ape as well as damages to the tune of $1 million, arguing that Bored Apes with rarity scores lower than his have sold for 500 ETH ($1.3 million).","OpenSea has three weeks to respond to the suit. Meanwhile, the company is also dealing with the fallout from a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/134832\/opensea-is-investigating-rumors-of-a-multi-million-dollar-nft-exploit\" data-v-f87c67ca=\"\">phishing attack<\/a> that saw NFTs worth millions stolen from users last week.","<em data-v-f87c67ca=\"\">Case number 4:22-cv-00545 was filed before the Southern District of Texas (Houston Division).<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Southern District of Texas (Houston Division)","content":"ORGANIZATION"},{"type":"Timothy McKimmy","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"3475","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$1.3 million","content":"MONEY"},{"type":"$26","content":"MONEY"},{"type":"$305,000","content":"MONEY"},{"type":"McKimmy","content":"ORGANIZATION"},{"type":"Bored Ape NFT","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$137,000","content":"MONEY"},{"type":"Friday","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["Osato Avan-Nomayo","The Block"]}