{"summary":"The digital currency exchange has proposed turning over 65% of its equity to creditors, with more than 99% of creditors so far approving of the plan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172709\/coinflex-creditors-overwhelmingly-back-restructuring-plan-in-early-voting","publishDate":"2022-09-25T08:53:50","id":11350,"type":null,"title":"CoinFlex creditors overwhelmingly back restructuring plan in early voting","category":["EXCHANGES"],"content":["CoinFlex's creditors have overwhelmingly backed the Seychelles-based crypto exchange's <a href=\"https:\/\/coinflex.com\/blog\/coinflex-restructuring-proposal-and-next-steps\/\" data-v-f87c67ca=\"\">restructuring plans<\/a> in the early hours of voting on the proposals.&nbsp;","After almost five hours of voting today, tokens representing more than 99% of creditor assets had agreed to the proposed restructuring deal, according to a <a href=\"https:\/\/snapshot.org\/#\/coinflexvote.eth\/proposal\/0x7e28e921369007b8b508d01c04d84a99dcbc5eac6b44cfe01d995ce933401d4e\" data-v-f87c67ca=\"\">poll<\/a> on Snapshot.&nbsp;Voting is due to end on Tuesday.&nbsp;","CoinFlex was founded in 2019 as a platform for physically delivered futures, before pivoting its focus to build a repo market for crypto.","The exchange halted client withdrawals in June after a counterparty failed to pay a margin call. CoinFlex <a href=\"https:\/\/www.theblock.co\/post\/154616\/coinflex-ceo-accuses-investor-roger-ver-of-defaulting-on-47-million-loan\" data-v-f87c67ca=\"\">identified<\/a> this counterparty as noted crypto investor Roger Ver — although Ver denied this and said he is the one owed money. CoinFlex went on to <a href=\"https:\/\/www.theblock.co\/post\/160287\/coinflex-says-it-has-laid-off-staffers-to-cut-costs-by-50-60\" data-v-f87c67ca=\"\">lay off<\/a> staff in an effort to reduce costs, before eventually filing&nbsp; for restructuring in a Seychelles court in August.&nbsp;","Under the restructuring plans, CoinFlex's creditors will own 65% of the company's equity and employees will be allocated 15% to vest over time in a share option program. Investors in CoinFlex's Series A funding round will be wiped out, while those who took part in its Series B will remain shareholders.&nbsp;","CoinFlex's proposal also includes an agreement with the BCH alliance that would see the alliance assume responsibility of the SmartBCH Bridge. If approved, CoinFlex said the takeover would mean that “BCH on the SmartBCH network will be 1:1 redeemable for BCH via the SmartBCH Alliance.”","The exchange is just one of many crypto firms to suffer following May's collapse of the Terra ecosystem, which wiped out $40 billion in investor value in a matter of days. Hedge fund Three Arrows Capital filed for bankruptcy at the start of July and crypto lender Celsius followed a couple of weeks later.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"65%","content":"PERCENT"},{"type":"99%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"CoinFlex","content":"ORGANIZATION"},{"type":"Seychelles","content":"LOCATION"},{"type":"SmartBCH Alliance","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Roger Ver","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Andrew Rummer","The Block"]}