{"summary":"Genesis Global Trading, an institutional over-the-counter (OTC) cryptocurrency trading firm, has made its first-ever acquisition. The firm has bought out Qu Capital, a New York-based quantitative trading and research firm, to strengthen its trading technology including improved order routing and advanced execution tools.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40257\/otc-crypto-trader-genesis-makes-its-first-acquisition-qu-capital-to-strengthen-trading-technology","publishDate":"2019-09-19T09:00:01","id":11355,"type":null,"title":"OTC crypto trader Genesis makes its first acquisition, Qu Capital","category":["GENESIS"],"content":["Genesis Global Trading, an institutional over-the-counter (OTC) cryptocurrency trading firm, has made its first-ever acquisition, according to an announcement Thursday.","The firm has bought out Qu Capital, a New York-based quantitative trading and research firm, to strengthen its trading technology including improved order routing and advanced execution tools.","“This acquisition is the latest effort to bolster our technology capabilities and intellectual firepower in order to better serve clients in an increasingly competitive marketplace,” said Michael Moro, CEO of Genesis.","The firm did not disclose terms of the deal.","Qu Capital’s <a href=\"https:\/\/qu.capital\/\" data-v-f87c67ca=\"\">website<\/a> states that it focused on applying “state-of-the-art statistical techniques” to identify and trade inefficiencies across asset classes. The website does not provide any other details, except that it was acquired in 2019.","Genesis CTO, Pat DeFrancesco, said that the firm will add Qu Capital’s tools, which incorporate machine learning and other advanced technologies, into its existing technology stack and new product offerings.","While the firm did not disclose any details on the new offerings, Moro recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/29627\/genesis-global-trading-hires-4-new-executives-expands-into-europe\" data-v-f87c67ca=\"\">told The Block<\/a> that Genesis could be building an integrated platform where trading and lending can be accessed through one clickable graphical user interface. The CEO hinted at users being able to get lending rates via an application programming interface so that customers won’t have to call or email the firm.","Genesis, a Digital Currency Group company, has been taking significant steps in its development. In July, the firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/29627\/genesis-global-trading-hires-4-new-executives-expands-into-europe\" data-v-f87c67ca=\"\">strengthened<\/a> its leadership team with four new hires and announced plans of expansion into Europe. The new appointments were across legal, technology and business development functions, including the CTO.","With today’s acquisition, whether Genesis will absorb in Qu Capital’s staff, remains unclear. The firm’s LinkedIn <a href=\"https:\/\/www.linkedin.com\/company\/qu-capital\/people\/\" data-v-f87c67ca=\"\">page<\/a> lists 9 employees, including three co-founders Alex Price and Edward Yu and Lucas Schuermann, who all met at Columbia University.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe lending arm of Genesis, Genesis Global Capital, has been growing as well. The firm <a href=\"https:\/\/www.theblockcrypto.com\/daily\/33036\/genesis-hits-record-growth-in-crypto-loans-in-q2-reaching-2-3-billion-mark-since-launch\" data-v-f87c67ca=\"\">added<\/a> $746 million of cryptocurrency loans in the second quarter, bringing its total originations to $2.3 billion since launching the business in March 2018. At the time, Genesis said that it expects to witness “continued growth” for the rest of the year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Moro","content":"PERSON"},{"type":"Pat DeFrancesco","content":"PERSON"},{"type":"$2.3 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Alex Price","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Edward Yu","content":"PERSON"},{"type":"Columbia University","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Lucas Schuermann","content":"PERSON"},{"type":"March 2018","content":"DATE"},{"type":"Genesis","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$746 million","content":"MONEY"},{"type":"second quarter","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}