{"summary":"Solana and Terra were both trading up by double digits at the time of writing — a reversal from the brutal January for coins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132617\/crypto-market-stages-comeback-with-solana-terra-leading-rally","publishDate":"2022-02-01T08:09:02","id":11368,"type":null,"title":"Crypto market stages comeback with Solana, Terra leading rally","category":["BITCOIN"],"content":["After a brutal start to the year, the cryptocurrency market kicked off February in the green, with leading cryptocurrencies like Solana and Terra clocking in double-digit gains over the course of the last 24-hours.","Since yesterday, the price of bitcoin was up 4%, while ether was trading up 9.9%, according to <a href=\"https:\/\/www.coingecko.com\" data-v-f87c67ca=\"\">CoinGecko<\/a> data. The relief to the market comes after a brutal January, which saw coins hit their lowest levels since the middle of last year alongside a rout in global equity markets. Solana — which hit lows near $86 at the end of January — was up 17.82% at $107, while Terra — which hit lows near $43 last month — was trading up 11% at $52.","Solana and Terra are still down 40% and 43%, respectively, since the start of the year. Bitcoin is down about 18% year-to-date.&nbsp;","Broadly, investors fled risky assets like stocks and cryptos last month as Fed-tied anxieties grasped markets. The US Federal Reserve is set to hike rates and scale back its balance sheet in an attempt to curb inflation — a move that would remove liquidity that's helped prop up a wide-range of asset prices.","Indeed, the US stock market last month experienced the worst January since the global financial crisis, as noted by the <a href=\"https:\/\/www.ft.com\/content\/5cf5199c-5538-40b6-a059-d2c795108919?segmentId=dddf6252-6e37-bb4b-bda7-2193a3453893\" data-v-f87c67ca=\"\">Financial Times<\/a>.&nbsp;","But it looks like Fed fears are subsiding.&nbsp;","In a note to clients on Tuesday, JPMorgan said that it views the market as over-sold.&nbsp;\"The stock market is not only in correction, it is already in bear market territory without a recession in site,\" the bank's analysts wrote.&nbsp;","\"Investor sentiment is already extremely bearish with Put\/Call ratio reaching the highest level since March 2020.\"","As for the Fed specifically, the bank said (emphasis is our own):","\"<strong data-v-f87c67ca=\"\">We disagree with the current fear of a Fed policy mistake or an early end to the current cycle<\/strong> ... The current cycle is taking place in a backdrop of above average nominal GDP and EPS growth, which should allow the equity market to easily outperform cash and fixed-income over the coming years, even if one assumes some gradual de-rating.\"","If the bank is correct and Fed-tied fears soon abate, then that could serve as a tailwind for broader cryptocurrency markets. Although bitcoin has long been touted as a store of value or hedge against stock performance, cryptocurrencies — for the most part — have traded in a similar direction to stocks.&nbsp;","JPMorgan's clients are already gearing up to enter the stock market again, with 78% of surveyed clients noting that they are likely to increase their equity exposure over the coming days and weeks.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$107","content":"MONEY"},{"type":"$52","content":"MONEY"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"78%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"last 24","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"9.9%","content":"PERCENT"},{"type":"last month","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"$86","content":"MONEY"},{"type":"Terra —","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$43","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"March 2020","content":"DATE"},{"type":"18%","content":"PERCENT"},{"type":"last year","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"17.82%","content":"PERCENT"},{"type":"Solana","content":"PERSON"}],"hashtag":["BITCOIN","SOLANA"],"authors":["Frank Chaparro","The Block"]}