{"summary":"The GSR Foundation will act as a grant-making charity to support global non-profit organizations according to GSR.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212278\/gsr-pledges-10-million-to-its-philanthropic-social-impact-foundation","publishDate":"2023-02-16T04:30:27","id":11369,"type":null,"title":"GSR pledges $10 million to its philanthropic social impact foundation","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">GSR, the crypto market maker founded by former Goldman Sachs executives, will launch the GSR Foundation with a $10 million pledge the company said will be used to address technological barriers encountered by marginalized communities.<\/span>","<span data-v-f87c67ca=\"\">The GSR foundation will support nonprofit organizations around the globe and aims to correct entrenched problems in the philanthropic ecosystem that could be overcome through emerging technologies. <\/span><span data-v-f87c67ca=\"\">Participation barriers disproportionately affect a number of marginalized communities, “including BIPOC communities, women, LGBTQ+, refugees, populations within less-developed economies, and many others,” GSR said.<\/span>","<span data-v-f87c67ca=\"\">“We believe that new technologies, like blockchain and crypto, can play an important role in changing this, but this will only happen if no one is excluded from participating,” newly appointed GSR Foundation Executive Director James Newell told The Block.<\/span>","<span data-v-f87c67ca=\"\">As GSR branches into philanthropy, its labor force is shrinking. <\/span><span data-v-f87c67ca=\"\">In addition to staff reductions in October, GSR recently saw another 5% to 10% workforce decline amid layoffs and resignations due to a low January bonus, according to <\/span><a href=\"https:\/\/www.theblock.co\/post\/210136\/crypto-market-maker-gsr-makes-further-layoffs-as-bear-market-bites\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sources<\/span><\/a><span data-v-f87c67ca=\"\"> familiar with the matter.<\/span>","<span data-v-f87c67ca=\"\">“There are too many areas where traditional finance and traditional philanthropy fail communities. For example, look at how many people are un-bankable in Afghanistan, or how difficult it is to make bank transfers to populations affected by conflict,” Newell said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Whether communities are facing a lack of hardware or other difficulties, the foundation seeks to better understand “any work that challenges paradigms, uses existing technologies in new ways, or applies new technologies to longstanding problems,” he said.<\/span>","<span data-v-f87c67ca=\"\">Programs for small and large grants were formed by the foundation and it is expected that the smaller grant program will be most active in the next two years. <\/span><span data-v-f87c67ca=\"\">The foundation will shift gears to larger grants with “a higher value, lower volume approach once we have established where our funding is most impactful,” Newell said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GSR","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"GSR Foundation","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Newell","content":"PERSON"},{"type":"next two years","content":"DATE"},{"type":"Afghanistan","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"GSR Foundation Executive","content":"ORGANIZATION"},{"type":"James Newell","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$10 million","content":"MONEY"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}