{"summary":"Fractal, a primary and secondary marketplace for NFTs with utility in video games, has officially launched.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128189\/gaming-nft-platform-fractal-launches","publishDate":"2021-12-30T13:06:45","id":11370,"type":null,"title":"The gaming-focused NFT platform Fractal officially launches","category":["GAMING AND METAVERSE"],"content":["<span data-v-f87c67ca=\"\">The gaming-focused non-fungible token (NFT) marketplace Fractal —&nbsp; launched by the video game streaming platform Twitch co-founder Justin Kan and other media entrepreneurs Robin Chan, David Wurtz and Mike Angell — officially went live today.<\/span>","<span data-v-f87c67ca=\"\">Fractal is a primary and secondary market for NFTs that have utility in games, as The Block <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/127360\/twitch-co-founder-justin-kan-to-launch-a-gaming-nft-marketplace-called-fractal\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">previously reported<\/span><\/a><span data-v-f87c67ca=\"\">. Game companies can mint and drop gaming NFTs for its fans, and players can sell NFTs to each other in the peer-to-peer marketplace.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“NFT's are like the new Kickstarter. A lot of gaming companies are saying, ‘Hey, this is a great way to engage our audience and reward people who are early,” Kan told The Block. “We have an audience of highly engaged gamers who want to play games and discover new NFTs for games, then we could be the place that makes sense to mint.”<\/span>","<span data-v-f87c67ca=\"\">Game developers must apply to have digital assets sold on Fractal, which will consider the credibility of the game, the team creating it and the assets provided to Fractal during the application process, Kan said. \"These efforts protect our users and ensure they are able to make informed purchase decisions.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Fractal initially chose to run on the Solana blockchain for its low costs and high transaction speeds but intends to add multichain interoperability in the future. Fractal is currently being self-funded by its founders but intends to start raising after its launch, Kan explained, and will take Fractal will take 2% on all sales once the platform starts selling NFTs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To help kick off its launch, Fractal has partnered with Solana-based games such the Japanese-style role playing game (RPG) Aurory, the RPG Genopets, the shooter-stye game Nyan Heroes and the multiplayer online battle arena (MOBA) Solchicks.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Aside from these types of games, Kan thinks that other styles such as a massively multiplayer online (MMO) can find utility for NFTs, as there’s already the equivalent of NFTs in traditional Web2 games such as players buying skin cosmetics, guns and other in-game items.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, some gamers have been vocal against the inclusion of NFTs in games. The Ukrainian indie game developer GSC Games had to pull planned NFTs from its forthcoming title <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/127952\/backlash-leads-s-t-a-l-k-e-r-2-developers-to-pull-planned-nfts-from-forthcoming-game\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">S.T.A.L.K.E.R. 2: Heart of Chernobyl<\/span><\/a><span data-v-f87c67ca=\"\"> after backlash from its fanbase. But Kan doesn’t think the traditional gaming community’s aversion to NFTs will last.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Digital assets are clearly valuable because people would buy gold in World of Warcraft years ago because they wanted it. And so now, the question is, ‘Does looking open and accessible, programmable and owned by the users make it more valuable? I think the answer is yes. And it's just a matter of time before more and more people adopt it,” Kan says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition to serving as an NFT marketplace, Fractal intends to help companies who want to include NFTs in their games have more impactful launches and build bigger communities. To do that, Kan says Fractal will offer game companies ways to curate their NFT store both on their website and Fractal, as well as channels to communicate with players.<\/span>","<span data-v-f87c67ca=\"\">This year has already seen an uptick of companies <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/125341\/blockchain-gaming-guild-avocado-raises-18-million-from-solana-ventures-and-others\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">building out<\/span><\/a><span data-v-f87c67ca=\"\"> blockchain-based games and <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/123306\/gaming-startup-mythical-games-raises-150-million-in-series-c-round-led-by-a16z\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">venture capitalists<\/span><\/a><span data-v-f87c67ca=\"\"> eager to support them. Even prominent NFT-native projects geared up to enter the gaming space like Bored Ape Yacht Club, which is expected to <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/127304\/bored-ape-yacht-club-game-slated-to-launch-in-q2-via-animoca-brands-partnership\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launch its own video game<\/span><\/a><span data-v-f87c67ca=\"\"> in Q2 of next year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“You saw promises of a game, forthcoming game or people talking about games [in 2021], but 2022 is when the real games come out that are actually fun to play,” Kan said.<\/span>","The run-up to launch wasn't without incident, however, as a bot used on Fractal's dedicated Discord was hacked and the culprit made off with <a href=\"https:\/\/www.theblockcrypto.com\/post\/128285\/twitch-co-founders-fractal-nft-project-gets-hijacked-154000-stolen\" data-v-f87c67ca=\"\">$154,000 in solana (SOL)<\/a>. Kan later reimbursed those losses.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Mike Angell","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Kickstarter","content":"PERSON"},{"type":"$154,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"GSC","content":"ORGANIZATION"},{"type":"Robin Chan","content":"PERSON"},{"type":"Justin Kan","content":"PERSON"},{"type":"MOBA","content":"ORGANIZATION"},{"type":"Kan","content":"PERSON"},{"type":"David Wurtz","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}