{"summary":"2019 was a big year in the Zero Knowledge research space. Great advancements were made on zkSNARKs, zkSTARKs – both well-known zero knowledge proof","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52004\/look-there-where-emerging-use-cases-for-zkps-in-2019","publishDate":"2020-01-03T16:00:25","id":11377,"type":null,"title":"Look! There! Where? Emerging Use Cases For ZKPs in 2019","category":["THE BLOCK"],"content":["2019 was a big year in the Zero Knowledge research space.","Great advancements were made on zkSNARKs, zkSTARKs – both well-known <a href=\"https:\/\/www.binance.vision\/blockchain\/zk-snarks-and-zk-starks-explained\" data-v-f87c67ca=\"\">zero knowledge proof cryptography protocols<\/a>&nbsp;– universal set-ups, optimisations, and more.","Over the course of the year, new protocols like <a href=\"https:\/\/www.youtube.com\/watch?v=oTRAg6Km1os\" data-v-f87c67ca=\"\">Sonic<\/a>, <a href=\"https:\/\/eprint.iacr.org\/2019\/953.pdf\" data-v-f87c67ca=\"\">Plonk<\/a>, <a href=\"https:\/\/ethresear.ch\/t\/slonk-a-simple-universal-snark\/6420\" data-v-f87c67ca=\"\">Slonk<\/a>, <a href=\"https:\/\/eprint.iacr.org\/2019\/1047.pdf\" data-v-f87c67ca=\"\">Marlin<\/a>, <a href=\"https:\/\/medium.com\/findora\/findora-co-founders-reveal-breakthrough-zero-knowledge-discovery-2c928e69cdec\" data-v-f87c67ca=\"\">SuperSonic<\/a>, <a href=\"https:\/\/electriccoin.co\/blog\/halo-recursive-proof-composition-without-a-trusted-setup\/\" data-v-f87c67ca=\"\">Halo<\/a> and <a href=\"https:\/\/eprint.iacr.org\/2019\/1076.pdf\" data-v-f87c67ca=\"\">Fractal<\/a> were released. The month of September was dubbed SNARKtember only to be followed by SNARKtober, SNARKvember and SNARKcember…the last 2 being ruefully less catchy names, but no less jam-packed with new research.","And in tandem with these technical advancements, a host of new use-cases have emerged. Long heralded primarily as a method for enabling privacy in crypto networks, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Zero-knowledge_proof\" data-v-f87c67ca=\"\">Zero Knowledge Proofs<\/a> (ZKPs) are proving to be useful in solving a number of the ‘Big Blockchain Challenges’. In fact, today we are seeing ZKPs being proposed as a key to building effective scaling solutions, as validity proofs, for cryptographic verification or certification, as well for providing possible improvements to cross chain interoperability, storage and a host of other decentralized web components.","On the<a href=\"https:\/\/www.zeroknowledge.fm\/\" data-v-f87c67ca=\"\"> Zero Knowledge Podcast<\/a>, we interview the practitioners, researchers and engineers working on these systems on a weekly basis. Below are a few of the use-cases that have begun to emerge through these conversations.","I think by now, we all agree that true privacy is central to blockchain adoption, especially if the goal is to have enterprise, small business or even individuals use cryptocurrencies in their daily lives.","ZKPs are well-known for providing real cryptographic privacy to otherwise non-private blockchains. The first popular use of ZKPs in blockchain was to make private token balances, as well as shield transaction and general blockchain activity from outside observers. The <a href=\"https:\/\/z.cash\/\" data-v-f87c67ca=\"\">Zcash<\/a> shielded token model is probably the most well-known version of this. In Zcash, zkSNARKs allows you to move your tokens from transparent state to a shielded private state, where only you will be able to track your activity and see your balance. Within the shielded accounts, you can also transfer tokens privately.","Another more recent example is ZKP-powered mixers that live on another existing blockchain, such as <a href=\"https:\/\/tornado.cash\/\" data-v-f87c67ca=\"\">Tornado.cash<\/a> and <a href=\"https:\/\/github.com\/barryWhiteHat\/miximus\" data-v-f87c67ca=\"\">Miximus<\/a> built on Ethereum. In the Miximus case, a user makes an ETH deposit into a Smart Contract, creating a unique commitment in a Merkle tree. To withdraw the user provides a proof of their knowledge of his unique commitment (the secret) using a ZKP but does not reveal this commitment.","<a href=\"https:\/\/eprint.iacr.org\/2018\/962.pdf\" data-v-f87c67ca=\"\">ZEXE<\/a>, another purpose-built privacy protocol which also has zkSNARKs at the core of its construction, is both private and programmable and makes transaction verification constant-time. Unlike Zcash, there is no transparent (or non-private) state. A key introduction with ZEXE is the ability to offer data privacy as well as what they describe in the paper as ‘function privacy’ - that is privacy about the purpose of a transaction. With most existing ZK constructions built on Ethereum using smart contracts, it is easy to see if a particular transaction is for a private token versus for a private DAO - thus there is no function privacy.","With the Mixmus example above, there may be some additional privacy loss due to using smart contracts which can expose information about a user’s gas payments. ZEXE solves for these and uses ZKPs to attest to the correctness of the transaction without revealing the inner details on the blockchain.","The developers behind <a href=\"https:\/\/www.aztecprotocol.com\/\" data-v-f87c67ca=\"\">AZTEC protocol<\/a>, meanwhile, are also working towards providing this function privacy on pre-existing non-private networks with their work making smart contracts themselves private. The goal is to make privacy programmable and thus make private the purpose of transactions (as well as the underlying data) – even when this is happening on Layer 2.","An interesting feature of a zero knowledge proof is its ability to prove the validity of a set of data. With this in mind, new approaches to scaling were explored and attempted in 2019 using ZKPs.","These currently fall into 2 camps: (1) using off chain transaction bundles written to the mainchain using ZKPs or (2) using recursion – aka <a href=\"https:\/\/www.zeroknowledge.fm\/54\" data-v-f87c67ca=\"\">recursive SNARKs<\/a>&nbsp;– to make a chain smaller (and thus faster to verify).","In the first category, we find <a href=\"https:\/\/vitalik.ca\/general\/2019\/08\/28\/hybrid_layer_2.html\" data-v-f87c67ca=\"\">ZK Rollup<\/a>. In this Plasma-like construction, there is a batch of off-chain transactions that need to be brought on-chain validity. Unlike <a href=\"https:\/\/plasma.io\/plasma.pdf\" data-v-f87c67ca=\"\">Plasma<\/a> (or <a href=\"https:\/\/medium.com\/matter-labs\/optimistic-vs-zk-rollup-deep-dive-ea141e71e075\" data-v-f87c67ca=\"\">Optimistic Rollup<\/a>), where economic stake and game-theoretic mechanisms are used to keep parties acting correctly, the idea here is that the user is forced to prove, using a zero-knowledge proof, that its behavior is correct according to the protocol.","However, the ZK Rollup (along with other ZKP constructions built using smart contracts) does still have the disadvantage of using zkSNARKs over general-purpose computation, such as EVM execution. This is a process which remains difficult and requires a lot of resources. That said, we are already seeing the ZK Rollup model as a basis for <a href=\"https:\/\/matter-labs.io\/\" data-v-f87c67ca=\"\">Matter Labs<\/a>’ user-focused <a href=\"https:\/\/medium.com\/matter-labs\/introducing-zk-sync-the-missing-link-to-mass-adoption-of-ethereum-14c9cea83f58\" data-v-f87c67ca=\"\">zkSync<\/a> scaling protocol, being used to build decentralized exchanges (DEXs), as well as similar constructions using STARKs (instead of SNARKs) as validity proofs coming from the <a href=\"https:\/\/starkware.co\/\" data-v-f87c67ca=\"\">StarkWare<\/a> team.","The second type of scaling is done through shrinking the chain using <a href=\"https:\/\/eprint.iacr.org\/2012\/095.pdf\" data-v-f87c67ca=\"\">recursive SNARKs<\/a>&nbsp;– that is SNARKs combined and further shrunk – while being validated - by a SNARK. These SNARKs are then further ‘Snarkified’ until you have a top SNARK that proves the validity of the multitudes of SNARKs within it.","In essence, you can use this technique to compress a blockchain down to a single proof – which proves the validity of the underlying SNARKs (which in turn prove the validity of further underlying SNARKs, and so on...) making it accessible yet space efficient. <a href=\"https:\/\/o1labs.org\/\" data-v-f87c67ca=\"\">O(1)Labs <\/a>is the company working primarily on this technique, but we are seeing this technique also being experimented with at <a href=\"https:\/\/filecoin.io\/\" data-v-f87c67ca=\"\">Filecoin<\/a> and Zcash.","Another property of ZKPs (especially when combined with other techniques such as MPC) is the ability for them to provide ‘selective disclosure’.","ZKPs can prove the existence of a secret without disclosing what the secret is. Put another way, some feature\/characteristic of a secret can be disclosed as ‘true’ without revealing anything else. This selective disclosure could be incredibly useful in creating systems that are compliant.","For example, proving that some private information is the correct kind of information, that it falls in a particular range, or that it matches another set of data.","This is key if we are to design compliant cryptographic systems, or, more specifically, systems that follow some set of laws or require some sort of verification\/certification.","As a tangible example, you could use a ZKP to prove that some addresses can be found on a whitelist without revealing which addresses are being tested nor those on the whitelist. All that is disclosed is that the addresses match. But this concept can be leveraged beyond cryptocurrencies or financial systems: it could be used to improve or replace real world certification systems as well.","Companies like <a href=\"https:\/\/qed-it.com\/\" data-v-f87c67ca=\"\">Qedit<\/a> and <a href=\"https:\/\/findora.org\/\" data-v-f87c67ca=\"\">Findora<\/a> are focused on developing these systems, but we are seeing this use-case pop up across the space - especially in projects that involve more traditional enterprise customers.","The least explored (and yet highly exciting) use-case for ZKPs is that of interoperability.","Drawing on some of the features that make ZKPs useful for scaling, these remain primarily research topics at the moment, but also reveal to us an even wider scope of the potential benefits that ZKPs have. To think about how ZKPs could be used for interoperability, we look at compression of key building blocks in cross chain constructions or using the validity proof across chains.","Here are some of the questions and ideas we have been thinking about: could we use ZKPs to provide some privacy in cross chain token movement? Could we take the ‘off-chain to on-chain’ idea from ZK rollup but move tokens from one chain to another chain with ZKPs as proofs of validity? Could you use something like <a href=\"https:\/\/boltlabs.tech\/\" data-v-f87c67ca=\"\">Bolt<\/a>, which provides a private Lightning-like construction, to move things from one chain to another privately? Could ZKPs be built into a <a href=\"https:\/\/tbtc.network\/\" data-v-f87c67ca=\"\">tBTC<\/a>-like construction?","One of my favorite improved interoperability examples comes from <a href=\"https:\/\/github.com\/celo-org\/bls-zexe\" data-v-f87c67ca=\"\">Celo<\/a>. Drawing on some advancements presented in the Zexe paper, they have used ZKPs and recursion to make <a href=\"https:\/\/www.zeroknowledge.fm\/93\" data-v-f87c67ca=\"\">lightclients lighter<\/a>&nbsp;– that is, compressing down the size of lightclient so that they could potentially work on mobile. This would also have really nice benefits for cross-chain constructions, specifically those that depend on lightclients and bridges.","So to wrap up: as we look forward to the new developments in the ZK Space this coming year, we are sure to learn about even more ways we can use ZKPs to add benefits to existing blockchains, and possibly discover new characteristics of this seemingly simple but deceptively powerful cryptography.","<i data-v-f87c67ca=\"\">Thanks to Tarun Chitra, Rob Habermeier, Christopher Goes and Howard Wu for their input on this article. <\/i>","<a href=\"https:\/\/twitter.com\/AnnaRRose\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Anna Rose<\/i><\/a><i data-v-f87c67ca=\"\"> is the co-host of the<\/i><a href=\"https:\/\/www.zeroknowledge.fm\/\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"> Zero Knowledge Podcast<\/i><\/a>,<i data-v-f87c67ca=\"\">&nbsp;a show which covers Zero Knowledge research and the decentralized web. She is also the host of the bi-annual Zero Knowledge Summit<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anna Rose","content":"PERSON"},{"type":"ZEXE","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Zero Knowledge Podcast","content":"ORGANIZATION"},{"type":"Zcash","content":"PERSON"},{"type":"Plonk","content":"LOCATION"},{"type":"Christopher Goes","content":"PERSON"},{"type":"Rob Habermeier","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Merkle","content":"LOCATION"},{"type":"Plasma","content":"LOCATION"},{"type":"Marlin","content":"PERSON"},{"type":"Halo","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Big Blockchain Challenges’","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Howard Wu","content":"PERSON"},{"type":"Filecoin","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Tarun Chitra","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"},{"type":"Slonk","content":"LOCATION"}],"hashtag":["PROTOCOLS"],"authors":["Anna Rose","The Block"]}