{"summary":"Second Circuit Court of Appeals rejects appeal of defendants that schemed to take over a federal credit union to hide bitcoin transactions. The Court found that the overwhelming evidence at trial was sufficient to convict both of them of multiple counts of fraud, and given Gross’ leadership role his enhanced sentence was warranted.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34660\/convictions-for-using-federal-credit-union-to-hide-bitcoin-transactions-affirmed-by-federal-appeals-court","publishDate":"2019-08-02T17:45:05","id":1137,"type":null,"title":"Second Circuit Court of Appeals rejects appeal of defendants","category":["LEGAL"],"content":["<a href=\"https:\/\/law.justia.com\/cases\/federal\/appellate-courts\/ca2\/17-3691\/17-3691-2019-07-26.html\" data-v-f87c67ca=\"\">Link to opinion<\/a>","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.&nbsp;As always, Rosario summaries are “NMR” and Palley summaries are “SDP”.<\/em>","This is an opinion in a consolidated appeal from two defendants who were convicted of a variety of offenses including operating an illegal bitcoin exchange and conspiring to use a federal credit union for illegal purposes. Both of the appellants, i.e. the defendants who appealed their convictions, argued that the district court that heard their case made a variety of evidentiary errors, and generally speaking, improperly handled their case and conviction. The Court disagreed and affirmed the lower court’s decision. This case covers a lot of ground, let’s dig in.","Yuri Lebedev was convicted of wire fraud, bank fraud, conspiracy to commit wire fraud and bank fraud, and making corrupt payments with the intent to influence the officer of a financial institution. That’s bad. The other appellant in this case is Trevon Gross. Gross was originally convicted of receiving corrupt payments as an officer of a financial institution. Oh. As should be readily apparent, Lebedev and Gross were in cahoots, accordingly, they were both further convicted of conspiracy in violation of 18 USC 371, also known as conspiracy to defraud the United States.","What exactly did Defendants do, and why did they appeal their original convictions?","So, this is a doozy of a tale. Lebedev worked in IT at a bitcoin exchange based in Florida called Coin.mx. The exchange opened bank accounts in the name of the Collectibles Club, “which falsely purported to be a private members’ association dedicated to collecting and exchanging memorabilia.” Not a great idea. In addition, “Coin.mx also processed credit card transactions listing the Collectables Club as the merchant. Neither Coin.mx nor the Collectables Club registered with federal regulators as a money-transmitting entity or obtained state licensure for that purpose.” Definitely a bad idea.","Eventually, the leadership at Coin.mx decided to try and seek control of a credit union. In April 2014, Coin.mx approached Gross who was chairman of a credit union called HOPE FCU in New Jersey about trying to take the credit union over. In a footnote, the Court explains that “[b]y taking control of a credit union, Coin.mx no longer risked being shut down by banks that uncovered the true nature of the Bitcoin transactions. Customers could open accounts at the credit union and use their accounts to buy Bitcoins from&nbsp;Coin.mx.” It may not seem relevant yet, but Gross was also head pastor at a nearby church in New Jersey.","How does a bitcoin exchange in Florida attempt to take over a credit union in New Jersey? By agreeing to make donations to the church where the chairman of the credit union is also the head pastor, and conspiring to have the chairman get them appointed to the credit union’s board of course. Coin.mx made two $15,000 donations, and then a company called Kapcharge made a third donation of $120,000. Kapcharge was a Canadian payment processor who wanted to process ACH transactions through HOPE FCU. Eventually, as always seems to happen in these situations, there was a falling out between the parties, the regulators got suspicious, and people started getting indicted in 2016. Okay, so what was appealed?","On appeal, Lebedev argued “that there was insufficient evidence that he committed wire fraud because his role in Coin.mx’s scheme — deceiving financial institutions concerning the nature of Coin.mx’s business — did not harm or risk harming those financial institutions.” The Court disagreed explaining that “[t]he evidence at trial demonstrated that Coin.mx was a money service business that was both unlawful and carried a higher risk of fraudulent transactions,” and given that “Lebedev’s role in Coin.mx’s scheme was to disguise Coin.mx’s Bitcoin transactions through front entities such as the Collectables Club” this made it more likely institutions would process these transactions, thereby depriving them of important financial information and exposing them to risk they didn’t know about.","With respect to the bank fraud charge, the Court said “there was sufficient evidence showing that Lebedev caused false information to be sent to financial institutions to disguise the fact that their customers were transacting business with an unregistered Bitcoin exchange.” This was done “with the intent to obtain funds under those institutions’ custody and control…[and]… by approving credit-card transactions, banks advanced Coin.mx their own funds that would later be paid back by customers.” That was enough for a jury to reasonably convict Lebedev.","Gross took a different approach with his appeal and attacked the witnesses and testimony that were brought against him at trial. The first witness was an accountant and litigation consult who testified to the methods used by Gross for the accounts at the credit union. At one point the witness said FIFO (first in first out) for handling funds “made sense.” Gross claimed this amounted to giving an expert opinion, and since the accountant was not brought in as an expert witness the evidence should be thrown out. The Court wasn’t having any of that. The second challenge was against the admissibility of statements made by his co-conspirators, because Gross claimed he withdrew from the conspiracy when the dispute between the parties occurred. The Court explained that he didn’t actually withdraw, because he still maintained a relationship with the payment processor that made the third donation. There was another challenge to a government agent that testified, and Gross challenged his indictment claiming the evidence against him was so far from his charged crimes, and given the story so far you can probably deduce that the Court said no to all these things.","Gross also challenged the sentence he was given, 60 months, and the restitution he was required to pay, $126,771.82. Lebedev was given 16 months, forfeiture, and supervised release. Why did Gross get a more severe sentence? Well, the government applied a leadership enhancement, and a commercial bribes enhancement against him, which on appeal he argued both were improper. The Court didn’t buy it. Remember, Gross was the chairman of the credit union. He was essential to the scheme, and put the institution at risk. As for the restitution, Gross claimed the institution failed after his activity in the conspiracy, and the Court said but for his actions the credit union wouldn’t have been put in a position to fail.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Court","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"ACH","content":"ORGANIZATION"},{"type":"New Jersey","content":"LOCATION"},{"type":"Gross","content":"PERSON"},{"type":"USC","content":"ORGANIZATION"},{"type":"$15,000","content":"MONEY"},{"type":"FIFO","content":"ORGANIZATION"},{"type":"Yuri Lebedev","content":"PERSON"},{"type":"$126,771.82","content":"MONEY"},{"type":"Collectibles Club","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Collectables Club","content":"ORGANIZATION"},{"type":"$120,000","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"April 2014","content":"DATE"},{"type":"Florida","content":"LOCATION"},{"type":"Trevon Gross","content":"ORGANIZATION"},{"type":"Gross","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lebedev","content":"PERSON"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}