{"summary":"Moody executives laid out European regulatory guidelines from MiCA in an exclusive interview with The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175681\/moodys-executives-say-new-eu-mica-regulations-could-unleash-stablecoin-innovation","publishDate":"2022-10-08T09:01:29","id":11372,"type":null,"title":"Moody&#x27;s executives say new EU MiCA regulations could unleash stablecoin innovation","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Restrictions in new EU regulations could potentially serve as a booster to stablecoin innovations in Europe, Moody’s Global Head of DeFi and Digital Assets Fabian Astic told The Block in an exclusive interview.<\/span>","<span data-v-f87c67ca=\"\">European representatives recently <\/span><a href=\"https:\/\/www.theblock.co\/post\/174994\/the-european-council-passes-mica-eus-comprehensive-crypto-regulation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">voted<\/span><\/a><span data-v-f87c67ca=\"\"> to formalize Markets in Crypto Assets (MiCA) regulatory guidelines. Although over the past weeks various revisions of Europe’s national MiCA frameworks offered <\/span><a href=\"https:\/\/www.theblock.co\/post\/171740\/stablecoin-restriction-dropped-from-e-u-digital-asset-framework\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">differing positions<\/span><\/a><span data-v-f87c67ca=\"\"> over stablecoin regulation, ultimately, <\/span><a href=\"https:\/\/www.theblock.co\/post\/173479\/non-euro-stablecoin-transaction-cap-revived-in-mica\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">restrictions<\/span><\/a><span data-v-f87c67ca=\"\"> on non euro-backed stablecoins made their way into the regulatory guidance. The regulations introduced a €200 million (just under $194 million) cap on transactions-per-day non Euro-backed stablecoins.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With a final vote on the new legislation expected on Oct. 10, executives from global bond credit rating and research firm Moody’s Investors Service, provided The Block perspective on the forthcoming stipulations in an exclusive interview.<\/span>","<span data-v-f87c67ca=\"\">As MiCA’s earliest implementation expected in 2024, participants would have just two years to boost euro-denominated stablecoins in the region, potentially making a euro-backed coin a key player in the global crypto and DeFi space, according to Astic. But without enough euro-backed stablecoins, progress may slow down as a vast majority of today’s stablecoins are U.S dollar-backed, he warned.<\/span>","<span data-v-f87c67ca=\"\">Although a number of widely utilized dollar-backed stablecoins are engineered and deployed by web3 providers outside of the banking sector, existing traditional finance players entering the space bring with them an existing history of compliance and consumer protections that regulators may favor, Moody’s Head of DeFi and Digital Assets Strategy Rajeev Bamra said.<\/span>","<span data-v-f87c67ca=\"\">“The deployment of non-euro denominated stablecoins is important because it can either fuel the European DeFi ecosystem or it can be a real obstacle,” said Astic. “It would really depend on whether European market participants are ready to fuel the market with more euro-denominated stablecoins between now and the official implementation date.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With additional regulatory guidance, opportunities will come for known stablecoin issuers to enter the playing field as well, Bamra said. “If there is a regulatory framework or legal framework in place like the one in the EU, and then we know there are article proposals in the U.S., then that may or should potentially open up the window for all these big major stablecoins like the USDC and similar ones,” he said.<\/span>","<span data-v-f87c67ca=\"\">For now developers may be stifled by uncertainties over legalities or tax efficiency, according to Astic, who said that frameworks are a useful catalyst for innovation.<\/span>","<span data-v-f87c67ca=\"\">In terms of regulators, Bamra said, it can be a difficult challenge to promote an “atmosphere that is fair and equitable in order to encourage innovation.” The primary goals of legislation, he said, should prioritize ease of access to financial services and “ensure that society benefits from increased technological efficiency.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Digital Assets Strategy Rajeev Bamra","content":"ORGANIZATION"},{"type":"Bamra","content":"PERSON"},{"type":"Moody’s Global Head of DeFi","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Crypto Assets (MiCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Moody’s Head of DeFi","content":"ORGANIZATION"},{"type":"Euro","content":"ORGANIZATION"},{"type":"Astic","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Digital Assets Fabian Astic","content":"ORGANIZATION"},{"type":"Oct. 10","content":"DATE"},{"type":"Moody’s Investors Service","content":"ORGANIZATION"},{"type":"$194 million","content":"MONEY"},{"type":"euro","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Jeremy Nation","The Block"]}