{"summary":"Six exchanges — including Binance, Luno, Coinbase and Kraken — will have to share user data to help trace $10.7 million in stolen funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190967\/binance-coinbase-kraken-ordered-to-disclose-user-data-in-hack-probe-ft","publishDate":"2022-11-30T08:03:43","id":11388,"type":null,"title":"Binance, Coinbase, Kraken ordered to disclose user data in hack probe: FT","category":["EXCHANGES"],"content":["Six exchanges — including Binance, Coinbase, Luno and Kraken — will have to share user data to help trace $10.7 million in funds stolen from an unnamed UK-based exchange in 2020.","London’s High Court issued a court judgment demanding the handover of the data, according to a Financial Times <a href=\"https:\/\/www.ft.com\/content\/949fb302-fcb5-455e-8ba3-7e83e6337c86\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a>. Two of the six exchanges involved were not named.&nbsp;","The anonymous exchange — which has not shared its name to avoid “tipping off” the hackers — has already managed to trace $1.7 million of the funds from the hack.","The amount in question was deposited into 26 accounts on the exchanges in cryptocurrencies including bitcoin, XRP, ether and tether. It’s one of the first applications of a new law in the UK to help track assets in cyber-fraud cases, even if the companies holding the information are based overseas, according to FT.","Crypto fraud is on the rise in the country. Reported cases of crypto fraud increased by a third from Sept. 2021-Sept. 2022, according to police unit Action Fraud.","Despite the common misconception that cryptocurrencies on distributed public ledgers are anonymous, hackers risk identification due to KYC processes implemented by most major exchanges. This can include submitting ID documents as well as biometric verification.","Exchanges are complying with orders to turn over data not linked to hacks, too. In October, Coinbase <a href=\"https:\/\/www.theblock.co\/post\/79722\/uk-hmrc-coinbase-tax-data-customers\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">informed<\/a> UK-based users that it would share its data with then-His Majesty’s Revenue and Customs (HMRC) if they received more than £5,000 in cryptocurrency in the 2019\/2020 tax year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"London’s High Court","content":"ORGANIZATION"},{"type":"Sept. 2021","content":"DATE"},{"type":"Sept. 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"$1.7 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Action Fraud","content":"ORGANIZATION"},{"type":"$10.7 million","content":"MONEY"}],"hashtag":["BINANCE","COINBASE","CRIME","KRAKEN"],"authors":["Callan Quinn","The Block"]}