{"summary":"Spot bitcoin ETFs now hold nearly 90% of the daily trading volume market share, while bitcoin futures ETFs account for around 10%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282002\/spot-bitcoin-etfs-market-share-futures-etfs","publishDate":"2024-03-12T10:48:38","id":11397,"type":null,"title":"Spot bitcoin ETFs capture 90% of market share, leaving futures ETFs in the dust","category":["MARKETS"],"content":["Just two months after their introduction, U.S. spot bitcoin exchange-traded funds have captured nearly 90% of the daily trading volume market share for ETFs offering price exposure to bitcoin.","Bitcoin futures ETFs, introduced in 2021, now hold a mere 10% share.","That marks an all-time high percentage for the daily volume market share of spot bitcoin ETFs, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-vs-futures-bitcoin-etf-market-share\" data-v-f87c67ca=\"\">The Block’s Data Dashboard<\/a>. The numbers highlight investors' strong preference for direct exposure to bitcoin via ETFs over products based on bitcoin futures contracts.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-vs-futures-bitcoin-etf-market-share\/embed\" title=\"Spot vs Futures Bitcoin ETF Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Indeed, the trading volume for spot bitcoin ETFs has <a href=\"https:\/\/www.theblock.co\/post\/281965\/blackrock-ibit-spot-bitcoin-etf-200000-btc?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">remained robust<\/a> since their Jan. 11 launch, reaching a total of $113.5 billion to date. BlackRock’s IBIT, Grayscale’s GBTC and Fidelity’s FBTC funds have been the leading contributors to this volume, with IBIT and FBTC also leading in inflows. GBTC, on the other hand, has seen over $11 billion worth of outflows to date, according to BitMEX Research <a href=\"https:\/\/twitter.com\/BitMEXResearch\/status\/1767451778054807797\/photo\/1\" data-v-f87c67ca=\"\">data.<\/a>","Earlier this year, JPMorgan analysts <a href=\"https:\/\/www.theblock.co\/post\/272099\/jpmorgan-spot-bitcoin-etfs-36-billion-inflows\" data-v-f87c67ca=\"\">projected<\/a> that GBTC could see outflows of up to $13 billion in 2024, largely attributed to its 1.5% fees, which are quite high compared to other spot bitcoin ETFs. They also anticipated a surge in popularity for spot bitcoin ETFs among retail investors, with institutional investors potentially transitioning from futures-based ETFs and GBTC to spot bitcoin ETFs. The current 90% daily volume market share of spot bitcoin ETFs appears to align with the analysts' prediction.","The price of bitcoin has skyrocketed this year, currently trading at around $72,150, according to The Block’s prices page. Bitcoin has been setting new records as more money flows into spot bitcoin ETFs due to the cryptocurrency's price surge, not the other way around, according to FalconX’s head of research, David Lawant. \"If until about one week ago spot ETF inflows were driving prices, I have the impression that more recently prices are, at least to some extent, starting to also drive inflows,\" Lawant <a href=\"https:\/\/www.falconx.io\/newsroom\/crypto-markets-surge-widespread-gains-beyond-majors-btc-and-eth\" data-v-f87c67ca=\"\">said<\/a> on Friday.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"David Lawant","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"1.5%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$11 billion","content":"MONEY"},{"type":"Lawant","content":"PERSON"},{"type":"FBTC","content":"ORGANIZATION"},{"type":"Jan. 11","content":"DATE"},{"type":"$72,150","content":"MONEY"},{"type":"$113.5 billion","content":"MONEY"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"BitMEX Research","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$13 billion","content":"MONEY"}],"hashtag":["BITCOIN","BITCOIN FUTURES ETF","SPOT BITCOIN ETF"],"authors":["Yogita Khatri","The Block"]}