{"summary":"A new bill seeks to codify into law a safe harbor for digital asset issuers. \nDerived from a longstanding proposal from the SEC’s Hester Peirce, the bill was introduced by republican leadership of the House Financial Services Committee, alongside new scrutiny for SEC Chairman Gary Gensler. \nGensler will testify before the Financial Services Committee later today.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119554\/leading-republican-on-house-financial-services-committee-introduces-bill-to-establish-a-safe-harbor-for-digital-tokens","publishDate":"2021-10-05T11:29:50","id":1139,"type":null,"title":"Leading Republican on House Financial Services Committee introduces bill to establish a safe harbor for digital tokens","category":["Regulation"],"content":["SEC commissioner Hester Peirce's safe harbor for digital tokens now has some legislative backing.&nbsp;","On October 5, Patrick McHenry, the ranking member of the House Financial Services Committee, introduced the Clarity for Digital Tokens Act of 2021.&nbsp;","The bill would adapt the Securities Act of 1933 to establish a three-year safe harbor for token development teams to offer those tokens for sale without full registration as a securities offering on the condition that the network decentralizes over the course of those three years.&nbsp;","Under the terms of the bill, token issuers would have to make disclosure requirements specific to the industry. These include source code, development plans, and \"information explaining the launch&nbsp;and supply process, including the number of tokens to be issued in an initial allocation, the total number of tokens to be created, the release schedule for the tokens, and the total number of tokens outstanding.\"","Development teams looking to use the safe harbor would also have to file exit reports demonstrating sufficient decentralization.&nbsp;","The safe harbor is the statutory version of a longstanding proposal from the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101553\/sec-peirce-token-safe-harbor-update\" data-v-f87c67ca=\"\">Securities and Exchange Commission's Hester Peirce<\/a>. Following the initial coin offering boom of 2017-2018, the SEC stepped up its scrutiny of token issuance, establishing an expectation that issuers register their offerings with the commission.","Based on comments from SEC leadership, <a href=\"https:\/\/www.theblockcrypto.com\/post\/109661\/andreessen-horowitz-new-crypto-vc-hires\" data-v-f87c67ca=\"\">especially Bill Hinman<\/a>, many crypto development teams still saw a route to turn centralized offerings of tokens into decentralized networks that no longer need to register with the SEC, either as an issuer or under an exemption.&nbsp;","While Peirce's framework has not picked up steam within the SEC, law passing in Congress can change all of that. The leadership of leading industry advocates the Blockchain Association, Coin Center and the Association for Digital Asset Markets noted their support for McHenry's bill.","The bill comes just half an hour before the Financial Services Committee's hearing with SEC Chairman Gary Gensler. Also this morning, Representative McHenry released a <a href=\"https:\/\/republicans-financialservices.house.gov\/uploadedfiles\/2021-10-5_letter_to_chair_gensler.pdf\" data-v-f87c67ca=\"\">letter<\/a> to Gensler, which said \"You have made a series of concerning and apparently self-contradicting public statements regarding crypto assets and other innovative technologies.\"","In the letter, McHenry requested answers to a series of questions on the SEC's work with crypto, particularly its expectations for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/117651\/elizabeth-warren-and-gary-gensler-place-coinbase-in-oversight-crosshairs\" data-v-f87c67ca=\"\">cryptocurrency exchanges<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/119475\/circle-continues-to-face-investigation-from-secs-division-of-enforcement-filing-states\" data-v-f87c67ca=\"\">stablecoins<\/a>. In <a href=\"https:\/\/financialservices.house.gov\/uploadedfiles\/hhrg-117-ba00-wstate-genslerg-20211005.pdf\" data-v-f87c67ca=\"\">opening remarks<\/a> released in advance of today's hearing, Gensler repeated a sentiment that has become his Free Bird:&nbsp;","While the House Financial Services Committee is full of crypto advocates, Patrick McHenry's role as leader of the committee's republicans indicates greater momentum behind such legislation. While many bills looking to clarify cryptocurrency regulation have been introduced — in the Financial Services Committee and elsewhere — most have languished.&nbsp;"],"hashtag":["CONGRESS","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"]}