{"summary":"A representative for the U.S. government asked to make information of the non-individual creditors in the FTX case public, as is standard practice in bankruptcy proceedings. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189247\/ftx-creditor-information-to-remain-confidential-at-least-for-now","publishDate":"2022-11-22T13:37:45","id":11392,"type":null,"title":"FTX creditor information to remain confidential, at least for now","category":["POLICY"],"content":["A federal judge granted a preliminary request to maintain the anonymity of creditors in the FTX bankruptcy case, but noted that more information on the company's creditors could become public in the near future.","“On an interim basis I’ll enter the order allowing for the redaction of the names and addresses,” said Judge John Dorsey of the U.S. Bankruptcy Court, District of Delaware. “Everyone in the room knows the internet is wrought with potential dangers.”","A representative for the U.S. Trustee, an office within the Justice Department responsible for overseeing bankruptcy cases, argued in favor of disclosing more information on businesses that FTX or its related entities owe money than is currently available.&nbsp;","“We oppose the redaction of the names and addresses of customers who are not individuals,” said Benjamin Hackman, an attorney with the office. “There should be transparency about who those entities are, especially on the top 50 list.”","Making creditor information public is standard practice in U.S. bankruptcy proceedings, although Celsius creditors were upset after a <a href=\"https:\/\/www.theblock.co\/post\/175701\/celsius-creditors-face-fallout-from-u-s-bankruptcy-disclosure-process\" data-v-f87c67ca=\"\">similar disclosure<\/a> in that proceeding.&nbsp;&nbsp;","Lawyers for FTX and the other companies falling under its corporate umbrella argued in favor of keeping as much of the information as possible redacted. The company wanted to keep that information confidential not only due to privacy concerns, but also because it views its customer list as an asset.","“The debtors' customer list, numbering in the millions, is an asset of the estate,” argued Brian Glueckstein, a partner with Sullivan and Cromwell, which is representing FTX in the bankruptcy proceedings. “Public release of the customer list would give the debtors’ competitors a free opportunity to poach the debtors' customers and would interfere with the ability to sell assets and maximize value as these cases progress,” he continued.","Glueckstein also argued that “there are significant privacy concerns raised by the disclosure of this protected creditor information. The debtors' customer base is global. Those customers who reside in the United Kingdom and the European Union member countries have additional data privacy protections under local law.”","Despite the judge’s interim order keeping creditor information redacted, the U.S. Trustee will still have access to that information on a confidential basis. An additional hearing on the subject is expected next month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"John Dorsey","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Benjamin Hackman","content":"PERSON"},{"type":"Brian Glueckstein","content":"PERSON"},{"type":"Sullivan","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Cromwell","content":"PERSON"},{"type":"United Kingdom","content":"LOCATION"}],"hashtag":["COURT HEARINGS"],"authors":["Colin Wilhelm","The Block"]}