{"summary":"The number of daily active users on Base surpassed 100,000 for the first time yesterday as social app friend.tech gains early interest.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244333\/coinbase-l2-base-dau-friendtech","publishDate":"2023-08-11T03:54:37","id":11402,"type":null,"title":"Coinbase-incubated L2 Base sees DAU surge, boosted by friend.tech","category":["LAYER 2S AND SCALING"],"content":["The number of daily active users on the Coinbase-launched Layer 2, Base, surpassed 100,000 for the first time yesterday.","The metric topped 136,000 after reaching just under 100,000 the day prior — and is on pace to reach a new high today — according to data organized by <a href=\"https:\/\/dune.com\/tk-research\/base\" data-v-f87c67ca=\"\">TK Research<\/a> on Dune.","The surge in activity may be attributed to a new social network project called friend.tech — a Twitter-connected app that allows users to trade \"shares\" of other users. Owning a share of a user on friend.tech provides both access to that user's content, as well as the ability to message that user.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\/daily-new-unique-addresses-for-optimistic-rollups\/embed\" title=\"Daily New Unique Addresses for Optimistic Rollups\" width=\"100%\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","When asked about the choice to develop and launch on Base, friend.tech's founder — known as \"Racer\" — told The Block that, though \"most of the major L2s are pretty developer friendly, the main draw of Base was Coinbase being a trusted brand that we thought most people would feel comfortable using.\"","Base is a Layer 2 blockchain on Ethereum that aims to provide a secure, low-cost and developer-friendly way to build on-chain. It has been incubated inside the crypto exchange Coinbase and is built on the OP stack in collaboration with Optimism.","Base officially <a href=\"https:\/\/www.theblock.co\/post\/243899\/base-mainnet-onchain-summer\" data-v-f87c67ca=\"\">opened<\/a> to the public — with over 100 apps and service providers — on Aug. 9.","About friend.tech's early popularity on the still-new Base, Racer also said: \"We love the Base team; they have great energy. I think things are just getting started on there.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TK Research","content":"ORGANIZATION"},{"type":"Dune","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Racer","content":"ORGANIZATION"},{"type":"Aug. 9","content":"DATE"}],"hashtag":["BASE","COINBASE","OPTIMISM"],"authors":["Adam James","The Block"]}