{"summary":"A new report from blockchain analytics firm Chainalysis quantifies and describes cryptocurrency usage in Latin America\nEastern Asia is the number one sender of cryptocurrency to Latin America — and many of those payments are commercial transactions involving Asia-based exporters","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/76839\/cryptocurrency-eastern-asia-latin-america-trade-chainalysis","publishDate":"2020-09-03T09:42:08","id":1140,"type":null,"title":"Eastern Asia is the biggest sender of crypto to Latin America - The Block","category":["Payments and Banking"],"content":["Trade between Eastern Asia and Latin America has ballooned since the early 2000s, <a href=\"https:\/\/fas.org\/sgp\/crs\/row\/IF10982.pdf\" data-v-f87c67ca=\"\">particularly that involving China<\/a>. And that’s just counting the commerce conducted using fiat currency.","A <a href=\"https:\/\/blog.chainalysis.com\/reports\/latin-america-cryptocurrency-market-2020\" data-v-f87c67ca=\"\">new report<\/a> from Chainalysis suggests that there may be even more going on than meets the eye — thanks to cryptocurrency.","The blockchain analytics firm has recently taken up <a href=\"https:\/\/www.theblockcrypto.com\/post\/72968\/chainalysis-market-intelligence-free\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">drawing geography-related insights<\/span><\/a> about the use of cryptocurrency by combining analysis of on-chain data with analysis of other information, like web traffic analytics and interviews with local exchange operators. Today, it published a report focused on Latin America.&nbsp;","According to <a href=\"https:\/\/www.theblockresearch.com\/org-chart-chainalysis-68923\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">Chainalysis<\/span><\/a>, $25 billion worth of cryptocurrency was sent from Latin America during the past year, while the region received $24 billion worth. That makes it one of the smaller crypto markets. But the report's authors note that in the background is a booming fintech market, and that may foreshadow something similar in the cryptocurrency industry.","“Our data paired with interviews with experts in the region reveal that some of the same factors fueling Latin America’s fintech wave, such as banking access issues and the need for remittances, are driving unique patterns of cryptocurrency usage beyond the speculative&nbsp; investment common to other regions.”","According to the report, the banking access issue is driving Latin American businesses into crypto — particularly those that import from Eastern Asia.&nbsp;","Chainalyis’s data shows that Eastern Asia is the biggest sender of cryptocurrency to Latin America. Based on interviews, the firm’s researchers have concluded that “many of these payments are in fact commercial transactions between Asia-based exporters and Latin American businesses buying goods from them to sell retail at home.” In many cases, it’s to avoid the cost and headache of dealing with local banks while skirting import taxes.","The team was surprised to learn how common this crypto-denominated commerce is, “and how everyone we talked to kind of knew about it,” said Chainalysis’s head of research Kim Grauer. “We’re seeing this commercial market develop between regions and it kind mirrors the real economy.”"],"hashtag":[]}