{"summary":"BlockFi, which at one point held 5% of the supply of GBTC, currently has zero exposure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157120\/blockfi-will-no-longer-accept-gbtc-as-collateral","publishDate":"2022-07-12T11:52:25","id":11400,"type":null,"title":"UPDATE: BlockFi softens stance, says it could accept GBTC as collateral","category":["LENDING"],"content":["<strong data-v-f87c67ca=\"\">UPDATE (3:53 p.m. EST):<\/strong> A few hours after publication, a spokesperson for BlockFi told The Block the company had changed its position on accepting GBTC as collateral in the future, sharing the following statement:","<span id=\"x_gmail-m_4318295502718495039m_460683265703257437gmail-docs-internal-guid-de87d23e-7fff-0294-bd69-569df86b1581\" data-v-f87c67ca=\"\">“While we don't currently hold any positions in GBTC and are winding down a couple of loans where GBTC is part of the collateral package, we are not saying that we won't support GBTC as collateral moving forward. Like any collateral, we constantly evaluate appropriate collateral haircut ratios and aim to accept as many types of collateral that our clients hold as possible\"<\/span>","<em data-v-f87c67ca=\"\">Original story:<\/em>","BlockFi has unwound its positions in Grayscale's Bitcoin Trust, a spokesperson confirmed to The Block.","The lending platform, which made headlines earlier this month for its injection of capital from crypto exchange FTX, has managed to navigate the aftermath of Three Arrows Capital's meltdown without having to pause withdrawals while industry rivals continue to grapple with serious financial headwinds.","While BlockFi claims its exposure to Three Arrows was limited, it was heavily exposed to the Grayscale Bitcoin Investment Trust (GBTC), an investment product which saw its discount to NAV drop precipitously to more than -34% amid the fallout of the beleaguered hedge fund.&nbsp;","BlockFi has now unwound its positions in GBTC, a spokesperson for the firm said. Moving forward, it will not accept the product as collateral. The firm plans to announce this move later this week.&nbsp;","Responding to a tweet penned by CoinShare's Meltem Demirors, BlockFi CEO Zac Prince said that BlockFi \"directly holds zero GBTC.\"","\"We have a couple small loans (like sub $10M) w\/ GBTC as collateral that are in the process of winding down,\" he said.&nbsp;","Those loans have also been wound down.&nbsp;","The move is the latest by BlockFi to de-risk in an environment that has seen lenders scale back, hike rates, and generally act more conservatively.&nbsp;","It's particularly striking that BlockFi is moving on from GBTC considering it <a href=\"https:\/\/www.theblock.co\/linked\/82445\/blockfi-grayscale-bitcoin-trust-gbtc-share\" data-v-f87c67ca=\"\">once<\/a> held more than 5% of the total supply. GBTC enables traders to gain exposure to bitcoin without directly buying and holding the crypto themselves.","As <a href=\"https:\/\/www.theblock.co\/linked\/82445\/blockfi-grayscale-bitcoin-trust-gbtc-share\" data-v-f87c67ca=\"\">reported<\/a> in October 2021, Prince explained the logic for snapping up GBTC as follows: \"investment opportunities related to the product and our significant participation enables us to add value for our clients and the marketplace for liquid and illiquid GBTC shares.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"NAV","content":"ORGANIZATION"},{"type":"3:53 p.m. EST","content":"TIME"},{"type":"Zac Prince","content":"PERSON"},{"type":"Bitcoin Trust","content":"ORGANIZATION"},{"type":"-34%","content":"PERCENT"},{"type":"October 2021","content":"DATE"},{"type":"Grayscale Bitcoin Investment Trust","content":"ORGANIZATION"},{"type":"CoinShare","content":"ORGANIZATION"},{"type":"crypto exchange FTX","content":"ORGANIZATION"},{"type":"$10M","content":"MONEY"}],"hashtag":["BLOCKFI"],"authors":["Frank Chaparro","The Block"]}