{"summary":"Bybit is departing the Canadian market, following in Binance&#x27;s footsteps in the wake of regulatory developments. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232602\/bybit-follows-binance-in-departure-from-canadian-market","publishDate":"2023-05-30T16:37:21","id":11407,"type":null,"title":"Bybit follows Binance in departure from Canadian market","category":["POLICY"],"content":["Bybit has become the latest crypto exchange to depart the Canadian market, with the company following in Binance's footsteps in the wake of regulatory developments.&nbsp;","\"Bybit has made the difficult but necessary decision to pause the availability of our products and services,\" the company said in a Tuesday <a href=\"https:\/\/announcements.bybit.com\/article\/notice-on-exit-from-canadian-market-bltc1bfb8746d077fda\/#\" data-v-f87c67ca=\"\">blog post<\/a>. \"It has always been Bybit's primary objective to operate our business in compliance with all relevant rules and regulations in Canada.\"","The company, which cited the regulatory environment in the country, said it would stop accepting account opening applications by any identified Canadian residents and existing nationals on May 31.","Last December the Canadian government announced <a href=\"https:\/\/www.securities-administrators.ca\/news\/csa-provides-update-to-crypto-trading-platforms-operating-in-canada\/\" data-v-f87c67ca=\"\">new requirements for crypto firms<\/a> to operate in the country, including keeping customer assets separate from company assets, and using a third-party custodian. The government began implementing those rules in the midst of the FTX collapse, in which the firm allegedly used customer funds to plug holes in its sister company's balance sheet, created by bad investments.","The Canadian Securities Administrators also announced that they view stablecoins as possible securities or derivatives, similar to how U.S. regulators view those digital assets, and began prohibiting margin or leverage trading for any Canadian client.","Firms were told to register and comply with those rules in order to continue operations in the country.","Existing customers affected by the changes will not be able to make new deposits, enter into new contracts, or increase current positions from July 31, though they will be able to withdraw and reduce positions.&nbsp;","\"Canadian Customers who are implicated by these measures should take steps by September 30, 2023, 8AM UTC to wind down and manage their positions,\" the company said.","Binance, the worlds largest crypto exchange, said earlier this month that it would <a href=\"https:\/\/www.theblock.co\/post\/230689\/bitcoin-binance-pulling-out-of-canada\" data-v-f87c67ca=\"\">pull out<\/a> of the market because of new rules.","\"New guidance related to stablecoins and investor limits provided to crypto exchanges makes the Canada market no longer tenable for Binance at this time,\" the company <a href=\"https:\/\/twitter.com\/binance\/status\/1657099651210969088?s=20\" data-v-f87c67ca=\"\">said<\/a> on May 12. \"We put off this decision as long as we could to explore other reasonable avenues to protect our Canadian users, but it has become apparent that there are none.\"","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"July 31","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Canadian Securities Administrators","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"September 30, 2023","content":"DATE"},{"type":"May 31","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"May 12","content":"DATE"}],"hashtag":["BINANCE","FTX"],"authors":["Nathan Crooks","The Block"]}