{"summary":"The eth.link domain is now back online after Ethereum Name Service’s parent company secured an injunction from a US court.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171001\/ethereum-name-service-says-it-has-regained-control-of-eth-link-domain-name","publishDate":"2022-09-19T06:41:42","id":11406,"type":null,"title":"Ethereum Name Service says it has regained control of ‘eth.link’ domain name","category":["LEGAL"],"content":["True Names Ltd., the parent company of the Ethereum Name Service (ENS), says it has regained control of the &nbsp;web domain name “eth.link”&nbsp;after securing an <a href=\"https:\/\/domainnamewire.com\/wp-content\/eth-link-tro.pdf\" data-v-f87c67ca=\"\">injunction<\/a> from an Arizona court.","“We're delighted to report that eth.link is now back online! Our injunction was successful and the name has been returned to us,” ENS said in a <a href=\"https:\/\/twitter.com\/ensdomains\/status\/1571683432144711680\" data-v-f87c67ca=\"\">tweet<\/a> on Monday.","The company behind ENS had filed a suit against web domain registrar GoDaddy for selling the domain name to a third party, as <a href=\"https:\/\/www.theblock.co\/post\/168579\/company-behind-ethereum-name-service-files-lawsuit-over-domain-sale\" data-v-f87c67ca=\"\">previously reported by The Block<\/a>. The suit accused GoDaddy of breaching a domain name registration contract. According to the complaint filed by True Names, GoDaddy wrongfully deemed the eth.link domain registered by the plaintiff as expired, and then sold it to a third party.","The court granted True Names' motion for a preliminary injunction in the matter. As such, the court ordered the return of the eth.link domain to True Names. GoDaddy had previously sold the domain to Dynadot who then <a href=\"https:\/\/domainnamewire.com\/2022\/09\/07\/eth-link-domain-sold-for-852k-in-unique-situation\/\" data-v-f87c67ca=\"\">sold<\/a> it to DeFi aggregator Manifold Finance. The complaint also names both Dynadot and Manifold.","ENS founder Nick Johnson told The Block that the company was pleased with the outcome. “We have won the legal complaint against GoDaddy with the court granting our request for preliminary injunctive relief,” said Johnson, adding that the ruling ordered the return of the domain to True Names.&nbsp;The court ruling itself states: “To the extent ownership interest in the Domain has been sold or transferred away from Plaintiffs as the registrants, Defendants shall immediately transfer ownership in the Domain back to Plaintiffs.”","However, Manifold Finance founder Sam Bacha told The Block that the matter had not, in fact, been settled. “DNS Services were restored to ensure the domain value remains. DNS is still held in escrow per the injunction and has not been transferred to True Names. Once the court opens in the morning more information will be available after the court opens,” said Bacha. DNS stands for domain name service.","Johnson addressed this, saying: “The eth.link domain has been returned to us fully pending the outcome of the court case. Should the case not be pursued the return would effectively be permanent.”","“While we cannot rule out the possibility of future litigation from GoDaddy or others over the name, at this time it is truly returned to us and users can resume use of the service,” Johnson added.","The ENS founder said users can resume using eth.link without disruption. ENS owners use eth.link as a gateway to access their “dot eth” (.eth) ENS address as a typical browser website. They do this by adding a “dot link” (.link) to their .eth ENS on a browser tab, which causes the link to open as a normal page on a web browser.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DNS Services","content":"ORGANIZATION"},{"type":"Nick Johnson","content":"PERSON"},{"type":"GoDaddy","content":"ORGANIZATION"},{"type":"Bacha","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sam Bacha","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"ENS","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"Arizona","content":"LOCATION"},{"type":"Manifold Finance","content":"ORGANIZATION"},{"type":"True Names Ltd.","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}