{"summary":"If the UK were to treat crypto as it does gambling, traders were quick to point out that it would mean no capital gains taxes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231169\/crypto-gambling-capital-gains-tax","publishDate":"2023-05-17T12:12:28","id":1140,"type":null,"title":"UK report likening crypto to gambling has traders hyped on tax implications","category":["POLICY"],"content":["There are few phrases that strike fear into the heart of a crypto punter as much as \"capital gains tax.\"","So when the UK House of Commons Treasury Committee released a report today arguing that trading in assets like bitcoin and ether should be regulated like gambling, traders in the space were quick to point out, gleefully, that such a designation would see them protected from capital gains levies.&nbsp;","\"So zero taxes on gains? Yasss,\" <a href=\"https:\/\/twitter.com\/pitahat_\/status\/1658610853975867392?s=46&amp;t=Se54l14sCsYxHI60OfmIMA\" data-v-f87c67ca=\"\">responded one<\/a> Crypto Twitter lurker to the news.&nbsp;","\"Good thing gambling winnings not taxed in the UK,\" <a href=\"https:\/\/twitter.com\/dotsamaape\/status\/1658610620625825792?s=46&amp;t=Se54l14sCsYxHI60OfmIMA\" data-v-f87c67ca=\"\">commented another named Mellow Yellow<\/a>.&nbsp;","Those were just two of dozens of responses to the report, and they're not wrong. In the UK, gambling income is not taxed, according to tax expert Nimesh Shah, chief executive of tax and accounting advisory Blick Rothenberg. \"From a tax perspective: happy days for anyone invested in crypto because it is completely exempt from a tax perspective,\" he said.","The regulation of cryptocurrencies as gambling instruments, in the committee's view, would protect retail investors from its volatility and the risks associated with scams and illegal activity. The report echoes the <a href=\"https:\/\/www.ft.com\/content\/bb7df9d9-31bb-4b06-8478-749a37342532\" data-v-f87c67ca=\"\">view of financial services lobbying groups<\/a> in the country that have come out against a potential plan by the UK government that would bring crypto-assets within the regulatory framework of traditional finance.&nbsp;","But such a move could also protect crypto fans from unwanted tax bills — at least on paper. To be clear, the committee doesn't make policy — it simply scrutinizes legislation and makes suggestions.","\"Profits are not taxed and losses are not deductible,\" Shah said. \"If the Select Committee pushes this as gambling then the Treasury should kiss goodbye any tax benefits from people investing in cryptocurrency.\"","Industry lobby group CryptoUK raised a similar point in a statement following the release of the committee report, asking \"Does the Government really wish to exclude tens of millions of pounds in tax income from gains made by the buying and selling of unbacked crypto assets?\"","CryptoUK stands with a long list of crypto market participants that have spoken out against the select committee's recommendation. While the potential tax benefits appeal to mom-and-pop traders, the impact on the industry's reputation could set it back years.&nbsp;","“We fundamentally disagree with the Treasury Select Committee’s conclusion that crypto-assets have no intrinsic value,\" commented Blair Halliday, Kraken's UK managing director. \"It’s regrettable the committee does not support the opportunity the UK has to be a true global leader in our rapidly developing industry.\"","Daniel Howitt, CEO of crypto tax calculation service, Recap, noted in an email to The Block that regulated retail crypto trading as gambling could set back the UK as a digital asset and blockchain epicenter.","Whilst serving as finance minister, current prime minister Rishi Sunak proposed a number of measures to turn the UK in a hub for crypto, earning him <a href=\"https:\/\/www.coindesk.com\/consensus-magazine\/2022\/12\/05\/rishi-sunak-most-influential-2022\/\" data-v-f87c67ca=\"\">a spot on CoinDesk's most influential list for 2022.<\/a>&nbsp;","\"This is not a signal to the world that we understand the potential of the asset class,\" Howitt said. \"We now look disjointed with the potential for divergent regulatory approaches between government departments, including a crypto-advocating Prime Minister — it could derail these ambitions.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury Select Committee","content":"ORGANIZATION"},{"type":"UK House of Commons Treasury Committee","content":"ORGANIZATION"},{"type":"Howitt","content":"PERSON"},{"type":"Shah","content":"PERSON"},{"type":"Blick Rothenberg","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Select Committee","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Nimesh Shah","content":"PERSON"},{"type":"Government","content":"ORGANIZATION"},{"type":"Daniel Howitt","content":"PERSON"},{"type":"Blair Halliday","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Rishi Sunak","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}