{"summary":"2022 was disastrous for crypto lenders and borrowers alike. Most agree that crypto credit is in dire need of an overhaul. But what exactly needs to change?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214880\/stop-swimming-naked-reboot-crypto-lending","publishDate":"2023-02-25T04:10:10","id":11416,"type":null,"title":"How to stop swimming naked and reboot crypto lending","category":["COMPANIES"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">The perception that crypto credit markets were in any way transparent was blown out of the water last year, along with many of the sector’s biggest lenders and borrowers. Nobody knew who was swimming naked until the tide went out. Then the realization hit: They all were. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The list of crypto credit casualties — now in various states of disrepair — includes Three Arrows Capital, Genesis Global, Celsius, Voyager Digital, BlockFi, Hodlnaut and Vauld. The list goes on, and they owe creditors billions of dollars.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“The reputation of crypto lending has gotten so bad,” said Yichen Wu, CEO and co-founder of Tesseract, a Helsinki-based, institution-facing crypto yield business. “People need to understand that there are different ways of doing things.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Most people in the industry agree that crypto credit is in dire need of an overhaul. But what exactly needs to change? How will those left standing avoid the continuous contagion-crazed catastrophes that so hobbled the sector in 2022?&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Crypto is an industry fond of trumpeting the benefits of open ledgers, but last year proved crypto lending, at least, has to date been dominated by black-box operators. Lenders like BlockFi and Celsius were winning deposits from retail customers by promising attractive yields, but nobody on the outside knew how those yields were generated. There was a lot of talk of lending to institutions — but customers weren’t told much beyond that. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The unknowns were many.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Who were these mysterious institutional borrowers? What rates were they borrowing at, and what was the lender’s margin? What were the institutions doing with their borrowed funds? What was the probability they would default? Were they putting up collateral, and at what ratio? What financial disclosures were they making to lenders?&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Retail customers may not have cared to know the answers to all these questions, but they surely would have been interested to learn that Genesis — which had lent out money on behalf of Gemini Earn’s customers — <\/span><a href=\"https:\/\/www.theblock.co\/post\/158167\/crypto-lender-genesis-lent-2-36-billion-to-three-arrows-capital\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">gave $2.4 billion<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> in under-collateralized loans to 3AC. If nothing else, this represented a major concentration risk. When it filed for bankruptcy protection in January, Genesis revealed that it <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-01-20\/bankrupt-crypto-lender-genesis-owes-its-top-50-creditors-3-4-billion\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">owed<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> $3.4 billion to its top 50 creditors. Perhaps retail customers couldn’t have been given quite this level of explicit detail, given confidentiality constraints. But the information they were given clearly fell way short of fairly reflecting the risks they were taking.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">What many retail lenders were unwittingly doing — in handing over their money to the big centralized lending desks — was giving money to crypto hedge funds, according to White Star Capital general partner Sep Alavi. “What they are behind closed doors is just a hedge fund. They take on client assets and take risk with it,” he said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The high rates offered by crypto lenders were often propped up by in-house trading arms and subsidized with income from other products, agreed Alexander Höptner, the recently <\/span><a href=\"https:\/\/www.theblock.co\/post\/196130\/ousted-bitmex-ceo-alexander-hoptner-sues-exchange\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">ousted<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> CEO of crypto exchange Bitmex. “How much risk is embedded there?” he said. “How much process risk is in there and how much counterparty risk is in there?”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Customers didn’t know. In the future, they may insist on knowing.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“There needs to be more transparency in the lending and credit space,” said Alavi. “At any given time, you should be able to know where your assets are.” <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Tesseract’s Wu echoed Alavi’s stance, claiming customers are “sick and tired” of black boxes. “If you’re transparent, you can’t do crazy shit. If you do crazy shit, what are you going to tell people?”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">There appears to be a broad consensus that an infusion of radical transparency is needed for crypto lending to bounce back. What is less clear is exactly how to deliver it.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Some believe structural change is in order. The sheer number of crypto lenders that have been forced to freeze withdrawals and subsequently file for bankruptcy protection last year suggests a rethink is needed if operators are to survive future market shocks.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">David Olsson, who spent more than two years as a senior vice president at BlockFi before joining Kraken as global head of prime financing and OTC, has put together something of a manifesto. “In order to ensure we don’t experience a repeat, crypto lenders need to adopt a range of policies to ensure risk is properly managed and doesn’t grow to proportions that lead to industry-wide contagion,” he said in an emailed statement. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Policies include: extensive due diligence on prospective borrowers to ensure credit risk is identified and aggregated into the lender’s overall lending activities; segregation of funds to prevent bad loans causing contagion with the company’s broader operations; and finally loan collateralization so lenders’ risk profile is controlled and doesn’t lead to mass liquidations,” Olsson continued. Ticking all these boxes will mean slower growth, he conceded, but from a more “solid foundation.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Mauricio di Bartolomeo, co-founder and CSO at Ledn, thinks a fund structure is the way forward.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">He hopes to see lending companies offering a series of segregated funds with clearly delineated risk and return profiles. If these funds were to falter, the client would be on the hook for losses, but the management company wouldn’t go down with them. In other words, returns might well take a hit in future crises, but lenders themselves would be better able to weather the storm.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“I think you’re going to see an evolution into that kind of model, because it’s a much more scalable model, and it’s a lot more transparent, and it just contains risk a lot better for companies and for end users,” di Bartolomeo said.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Tesseract already sees itself as a “yield supermarket,” according to Wu. It offers a range of options for partners looking to generate yield for their users that includes lending, staking and DeFi-focused products — with different accounts for those with higher and lower risk appetites. “The worst thing you can do,” said Wu, “is batching a lot a different activities in one account.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">So-called proof of reserves reporting has tried to address the clarion call for more transparency in the wake of a disastrous 2022 for crypto. In theory, these reports offer a way of verifying that a crypto company has one-to-one backing for any assets it holds on behalf of customers — meaning it is less likely, if not unable, to suffer a shortfall in the event of a surge in withdrawals.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Yet though sound in theory, proof of reserves reports have been a mixed bag. Mazars produced a report for Binance late last year but subsequently paused proof of reserves work in December and erased past reports from its website, <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-12-16\/mazars-to-pause-all-work-for-crypto-clients-binance-says-lbqbamw7\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">citing<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> “concerns regarding the way these reports are understood by the public.” Armanino, a firm offering proof of reserves reports that audited FTX’s U.S. arm, also <\/span><a href=\"https:\/\/www.forbes.com\/sites\/emilymason\/2022\/12\/15\/ftx-accounting-firm-armanino-ends-crypto-audit-practice\/?sh=5710d86f362f\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">announced<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> that it would stop working with crypto clients after facing a backlash in December.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Di Bartolomeo said that despite the “explosion of demand” for proof of reserves work, “it’s not something that you can do on the turn of a dime,” as it requires buy-in from all parts of an organization. Another challenge, it would appear, is finding reputable audit firms to do the job. Binance, among others, has found the sign-off of a big four accountancy firm <\/span><a href=\"https:\/\/www.coindesk.com\/business\/2023\/02\/08\/binance-apac-head-suggests-full-audit-of-the-crypto-exchange-isnt-happening-soon-bloomberg\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">difficult<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> to come by. An executive at the exchange operator recently <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-08\/binance-signals-full-audit-for-crypto-s-biggest-exchange-remains-some-way-off?utm_source=website&amp;utm_medium=share&amp;utm_campaign=twitter&amp;sref=3REHEaVI\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">told Bloomberg<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> that a full audit is still some way off.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Another potential cure for what ails crypto credit is on-chain underwriting, a kind of due diligence that would properly harness the benefits of blockchain-based businesses. Victor van Eijk, a director at Maven 11, thinks on-chain monitoring has become increasingly important — all the more so as firms dig deeper into DeFi.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“To ensure proper risk management of the borrowers and the intended use of funds lent, credit underwriters must be able to track the exact flow of funds after the loan is issued,” he said in an emailed statement. Such disclosure is a “balancing act” between transparency and proprietary information, he said, adding that borrowers are increasingly willing to be tracked by the likes of Credora, Arkham and Nansen, in light of the events of last year.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Of course, some see DeFi itself as the answer to crypto’s credit woes. It is telling, they point out, that most of the lenders caught up in the crypto credit contagion were centralized operators. DeFi, for the most part, fared better, with only a few outfits — such as lending protocol <\/span><a href=\"https:\/\/www.coindesk.com\/markets\/2022\/12\/20\/crypto-trading-firm-auros-hit-by-ftx-collapse-discloses-provisional-liquidation\/\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Maple Finance<\/span><\/a><span data-contrast=\"none\" data-v-f87c67ca=\"\"> — suffering defaults.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Di Bartolomeo said that DeFi loans are, in general, more likely to be repaid in part because they’re usually over-collateralized, meaning borrowers are more afraid of defaulting. He still thinks that centralized crypto lenders will be able to distribute more traditional products like mortgages and credit cards better than DeFi, but concedes that protocols “will do programmatic lending better than CeFi going forward.”&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">All these ideas, however, will have little effect if lenders don’t set higher standards for themselves and for the industry.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“The blowups over the past few months have largely been the result of corporate malpractice or poor risk management, rather than anything endemic to the underlying technology,” said Kraken’s Olsson. “Businesses were overleveraged and relied on a steady stream of new depositors to fund aggressive expansion. When market sentiment soured last year, the deposit stream went into reverse and lenders faced a full-blown liquidity crisis.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Take the example of 3AC. The hedge fund came to Ledn a number of times in search of loans, but refused to produce financial information, according to di Bartolomeo. He was surprised quite how much money the now bankrupt fund was able to borrow with so cavalier an approach. Ledn ultimately chose not to lend to the 3AC; few others resisted.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“What they tried to tell us was that we were the only group that didn’t lend to them — and how could that be?” Ledn’s Di Bartolomeo said.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mauricio di Bartolomeo","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"David Olsson","content":"PERSON"},{"type":"Maven 11","content":"ORGANIZATION"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Nansen","content":"PERSON"},{"type":"Alavi","content":"PERSON"},{"type":"$3.4 billion","content":"MONEY"},{"type":"Credora","content":"LOCATION"},{"type":"Olsson","content":"PERSON"},{"type":"CSO","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Armanino","content":"ORGANIZATION"},{"type":"Kraken’s Olsson","content":"PERSON"},{"type":"Helsinki","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yichen Wu","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Sep Alavi","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Bartolomeo","content":"LOCATION"},{"type":"Tesseract","content":"ORGANIZATION"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"Bartolomeo","content":"PERSON"},{"type":"Victor van Eijk","content":"PERSON"},{"type":"Alexander Höptner","content":"PERSON"}],"hashtag":["CRYPTO BANKS AND LENDERS","THREE ARROWS CAPITAL"],"authors":["Ryan Weeks","The Block"]}