{"summary":"Researchers have described what they call the first &quot;incentive-based&quot; denial-of-service attack that targets proof-of-work blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86873\/blockchain-denial-of-service-attack-miners","publishDate":"2020-12-08T14:10:03","id":11418,"type":null,"title":"A newly-described blockchain DoS attack convinces minters to stop mining","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Researchers have found a previously unknown way to execute a denial-of-service attack on a proof-of-work blockchain system.<\/span>","<span data-v-f87c67ca=\"\">The researchers, from Cornell Tech and the Technion Israel Institute of Technology, described the attack, which they call blockchain denial of service (BDoS) in <\/span><a href=\"https:\/\/arxiv.org\/pdf\/1912.07497.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a new academic paper<\/span><\/a><span data-v-f87c67ca=\"\"> they presented on October 20 at the 2020 ACM SIGSAC Conference on Computer and Communications Security.<\/span>","<span data-v-f87c67ca=\"\">They say that a BDoS is the first type blockchain attack that “exploits the reward mechanism to discourage miner participation.”<\/span>","<span data-v-f87c67ca=\"\">Traditional DoS attacks tend to target the web servers of organizations like banks, media companies, or internet infrastructure providers. The attacker bombards the servers with spam traffic, overloading it and making it unable to serve legitimate requests.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But a DoS attack is more difficult against a decentralized network. According to the authors, a DoS attack has never been successfully executed against a prominent cryptocurrency system. <\/span>","<span data-v-f87c67ca=\"\">Before the new research, it was thought this would require that the attacker obtain at least <a href=\"https:\/\/www.theblockcrypto.com\/daily\/79206\/mit-pool-detective-blockchains\" data-v-f87c67ca=\"\">51% of the network’s mining capacity<\/a>.&nbsp;<\/span><span data-v-f87c67ca=\"\">According to the researchers, the BDoS attack they’ve discovered would theoretically be able to “grind (Bitcoin’s) blockchain to a halt with significantly fewer resources” — as little as 21% of the network’s mining power (as of March 2020).<\/span>","<span data-v-f87c67ca=\"\">The attack works by targeting the system’s reward system in a way that discourages miner participation. Specifically, the attacker publishes a proof to the blockchain that signals to other miners that the attacker holds a mining advantage.<\/span>","<span data-v-f87c67ca=\"\">The researchers found that what they define as “rational” miners will stop mining if they detect that they are at a disadvantage. “If the profitability decrease is significant enough so that all miners stop mining, the attacker can stop mining too,” they write. “The blockchain thus grinds to&nbsp; a complete halt.”<\/span>","<span data-v-f87c67ca=\"\">The study authors add: “We find that Bitcoin’s vulnerability to BDoS increases rapidly as the mining industry matures and profitability drops.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to <a href=\"https:\/\/webee.technion.ac.il\/people\/ittay\/\" data-v-f87c67ca=\"\">Ittay Eyal<\/a>, a senior lecturer at Technion who co-authored the study, BDoS attacks are different from a type of attack called selfish mining, in which the attacker manipulates the system to get more than their fair share of rewards. In a BDoS attack, the attacker’s aim is to take down a proof-of-work cryptocurrency rather than reap rewards.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Eyal said the findings of the study pertain specifically to Bitcoin, but that’ it’s likely there are similar attacks against Ethereum. The researchers have not gathered any concrete results on this yet, he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">They are also trying to continue characterizing the BDoS attack. “We still have many open questions,” said Eyal. “What’s the minimum possible cost for an attack? What kind of mitigations are there?” <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Technion Israel Institute of Technology","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"October 20","content":"DATE"},{"type":"Technion","content":"LOCATION"},{"type":"Cornell Tech","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"March 2020","content":"DATE"},{"type":"Eyal","content":"PERSON"},{"type":"Ittay Eyal","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"SIGSAC Conference on Computer and Communications Security","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Saniya More","The Block"]}