{"summary":"The SEC chair declined to give a direct opinion on pending bitcoin ETF applications but repeated concerns about fraud and manipulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241820\/gensler-raises-concerns-about-fraud-and-manipulation-when-asked-about-bitcoin-etfs","publishDate":"2023-07-27T15:09:51","id":11415,"type":null,"title":"Gensler mentions fraud and manipulation when asked about bitcoin ETFs","category":["EXCHANGES"],"content":["Securities and Exchange Commission Chair Gary Gensler expressed skepticism about the crypto marketplace when asked about pending applications for spot bitcoin exchange-traded fund <a href=\"https:\/\/www.theblock.co\/post\/239602\/sec-acknowledges-bitwises-spot-bitcoin-etf-refiling\" data-v-f87c67ca=\"\">applications<\/a> in a televised <a href=\"https:\/\/www.bloomberg.com\/news\/videos\/2023-07-27\/sec-s-gensler-on-ai-stock-market-plans-and-crypto-video\" data-v-f87c67ca=\"\">interview<\/a> on Thursday.","Though he made clear he would not make a direct statement until the full five-member commission could consider the recent wave of filings, spurred by investing giant <a href=\"https:\/\/www.theblock.co\/post\/237978\/blackrock-ceo-larry-fink-sees-bitcoin-as-digitizing-gold\" data-v-f87c67ca=\"\">BlackRock<\/a> and largely based around surveillance sharing agreements with Coinbase, Gensler raised concerns about general fraud and manipulation in the crypto industry when asked for his thoughts about the ETF applications in an interview with Bloomberg Television.","“There’s a lot of noncompliance in this field,” Gensler said, remarking on the combinations of different market functions that can occur on crypto trading platforms that are prohibited in traditional financial exchanges for conflict of interest and investor protection reasons. “The platforms themselves, where trading is occurring of various crypto tokens, though some of it comes under the securities laws, currently they’re not necessarily compliant with those time-tested protections against fraud and manipulation.”","The comments may signal that <a href=\"https:\/\/www.theblock.co\/post\/237299\/spot-bitcoin-etf-could-still-face-significant-hurdles-experts-say\" data-v-f87c67ca=\"\">regulatory hurdles<\/a> related to concerns about transparency and manipulation in the underlying market likely remain for bitcoin ETFs, despite renewed investor enthusiasm. The SEC notably filed a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-102\" data-v-f87c67ca=\"\">major enforcement case against Coinbase<\/a> last month over several parts of the company's business, and in a separate lawsuit accused Binance, the world's largest crypto trading platform, of secretly <a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" data-v-f87c67ca=\"\">betting against its own customers<\/a>, among other allegations.","Gensler declined to directly answer questions about his thoughts about digital asset-related legislation <a href=\"https:\/\/www.theblock.co\/post\/241812\/historic-crypto-market-bill-approved-to-advance-to-full-us-house\" data-v-f87c67ca=\"\">advancing this week on Capitol Hill<\/a>, though he repeated his long-held belief that existing securities laws are clear for the industry, despite what the commission chair sees as widespread breaking of those laws.&nbsp;","The SEC head has repeatedly said he prefers to keep his conversations with elected officials private. Two congressional Republicans working on digital asset legislation publicly pressed Gensler for \"<a href=\"https:\/\/www.theblock.co\/post\/240548\/republicans-want-productive-engagement-from-gensler-on-crypto-bills\" data-v-f87c67ca=\"\">productive engagement<\/a>\" on their legislative efforts last week, while the SEC has been seen to be <a href=\"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill\" data-v-f87c67ca=\"\">slow-walking requested technical assistance<\/a> on a complicated crypto market structure bill voted on this week by two House committees. Gensler, meanwhile, has drawn public criticism from the industry that wants to see new rules more tailored to its assets.","Though SEC lawyers previewed their likely argument in the event of an appeal of the <a href=\"https:\/\/www.theblock.co\/post\/240368\/lawmaker-urges-sec-to-refocus-crypto-efforts-after-ripple-decision\" data-v-f87c67ca=\"\">split decision<\/a> in their case against Ripple Labs over XRP earlier this month, Gensler also demurred when <a href=\"https:\/\/www.theblock.co\/post\/240676\/gensler-declines-to-say-if-or-when-the-sec-might-appeal-ripple-decision\" data-v-f87c67ca=\"\">asked about the case<\/a>, repeating a longstanding policy of not commenting on specific ongoing enforcement actions.","Staff needs to present their case to the majority Democrat commission for a vote in order to formally make the appeal, though SEC lawyers told a judge in the same federal court district as the Ripple decision to ignore that ruling after it was invoked in a separate enforcement case involving Terraform Labs and the company's former head Do Kwon in a <a href=\"https:\/\/www.theblock.co\/post\/241027\/sec-lawyers-preview-likely-ripple-appeal-in-case-against-do-kwon\" data-v-f87c67ca=\"\">clear signal that appeal is likely<\/a>.","“The capital markets really wouldn’t work without cops on the beat and rules of the road,” said Gensler in Thursday's interview. “We’re part of these well-regulated markets.”","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Bloomberg Television","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BINANCE","COINBASE","CRIME","CZ","DO KWON","FTX","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","LAWSUITS","SEC"],"authors":["Colin Wilhelm","The Block"]}