{"summary":"In the wake of a rare blood moon lunar eclipse, FTX CEO Sam Bankman-Fried shocked the crypto universe on Tuesday with an announcement that the exchange he founded had agreed on a “strategic transaction,” which effectively would see his non-U.S. business sold to his global rival Binance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184423\/ftxs-bankman-fried-gets-binance-bailout-in-stunning-reversal-of-fortune","publishDate":"2022-11-08T16:54:21","id":11424,"type":null,"title":"FTX’s Bankman-Fried gets Binance bailout in stunning reversal of fortune","category":["EXCHANGES"],"content":["In the wake of a rare blood moon lunar eclipse, FTX CEO Sam Bankman-Fried shocked the crypto universe on Tuesday with an announcement that the exchange he founded had agreed on a “strategic transaction,” which effectively would see his non-U.S. business sold to his global rival Binance.","The deal came just one day after he said the exchange and its assets were “<a href=\"https:\/\/www.theblock.co\/post\/183680\/ftx-fine-bankman-fried-binance-work-together\" data-v-f87c67ca=\"\">fine<\/a>,” and capped a weekend of speculation about the health of its native FTT token and balance sheet of sister trading firm <a href=\"https:\/\/www.theblock.co\/post\/183570\/binance-to-sell-ftx-token-holdings-alameda-ceo-says-leaked-balance-sheet-is-incomplete?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Alameda Research<\/a>.","But things were not fine. While crypto markets were initially buoyed by the news, the day soon turned <a href=\"https:\/\/www.theblock.co\/post\/184362\/crypto-markets-plummet-after-binance-ftx-deal-frightens-investors\" data-v-f87c67ca=\"\">blood red<\/a>, with bitcoin declining 12.4% in the past 24 hours, according to CoinGecko. Ether declined 18.4% over the same period, spurring some market chatter of a “Lehman-like collapse.”","While Bankman-Fried accused an unnamed competitor of “trying to go after us with false rumors” <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1589598284322328579\" data-v-f87c67ca=\"\">on Monday<\/a>, he struck a conciliatory tone on Tuesday and promised that the exchange’s customers would be protected.","“Things have come full circle, and FTX.com’s first, and last, investors are the same,” Bankman-Fried wrote in a <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1590012124864348160\" data-v-f87c67ca=\"\">thread<\/a> on Twitter. “Binance has shown time and again that they are committed to a more decentralized global economy while working to improve industry relations with regulators. We are in the best of hands.”","The deal marked a stunning reversal for the high-flying crypto-billionaire known for his lobbying efforts and status as a liquidity provider of last resort in his own right after bailing out Voyager Digital and BlockFi, while bemoaning “third-tier exchanges” in the wake of the Three Arrows Capital collapse in June. The move triggered widespread speculation about how the fallout would not only affect Bankman-Fried's reputation in the industry, but the stability of the broader ecosystem overall.","Binance CEO Changpeng “CZ” Zhao — who set the chaos into motion over the weekend by saying his exchange would sell its FTT tokens — <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1590013613586411520\" data-v-f87c67ca=\"\">confirmed the deal<\/a> and said FTX had asked for help.","“There is a significant liquidity crunch,” he wrote in a Twitter <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1590013613586411520\" data-v-f87c67ca=\"\">thread<\/a>. “To protect users, we signed a non-binding LOI, intending to fully acquire FTX.com.”","The sale is subject to due diligence, which Zhao said would begin in the coming days. On Monday, he <a href=\"https:\/\/www.theblock.co\/post\/183894\/binances-cz-says-hes-building-not-fighting-amid-ftx-tensions\" data-v-f87c67ca=\"\">rejected depictions<\/a> of a tiff between the two exchanges and “conspiracy theories” alleging he had somehow orchestrated the chain of events.","“Sorry to disappoint, but I spend my energy building, not fighting,” he <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1589695564400455680\" data-v-f87c67ca=\"\">wrote<\/a> a day before the news of the buyout came. The Block <a href=\"https:\/\/www.theblock.co\/post\/184251\/ftx-agrees-to-strategic-transaction-with-binance\" data-v-f87c67ca=\"\">reported earlier<\/a> on Tuesday that FTX had been looking to raise outside capital at a valuation of $10 billion to $20 billion prior to announcing the deal with Binance.","The trouble for FTX took an ominous turn on Sunday after Binance <a href=\"https:\/\/www.theblock.co\/post\/183570\/binance-to-sell-ftx-token-holdings-alameda-ceo-says-leaked-balance-sheet-is-incomplete?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">said it would sell<\/a> the position in FTT it acquired when it sold its stake in FTX last year. The move followed a CoinDesk report that Alameda held $3.66 billion in \"unlocked FTT,\" and traders had worried about the impact of a declining price that has now plunged about 81% in the past week to $4.95, according to CoinGecko.","The Block <a href=\"https:\/\/www.theblock.co\/post\/184176\/ftx-appears-to-have-stopped-processing-withdrawals-on-chain-data-show\" data-v-f87c67ca=\"\">first reported<\/a> on Tuesday morning that FTX had appeared to stop processing client withdrawal requests at about 9:00 a.m. ET, based on an analysis of on-chain data. Reuters subsequently <a href=\"https:\/\/www.theblock.co\/post\/184315\/ftx-effectively-paused-withdrawals-ceo-sam-bankman-fried-tells-employees\" data-v-f87c67ca=\"\">reported<\/a> that FTX.com had effectively paused withdrawals, with around $6 billion in net outflows in the days leading up to Tuesday.","“Opaque balance sheets and uncertainty are causing chaos in the crypto markets,” Gartner web3 analyst Avivah Litan said by email, characterizing the issues at FTX as a “disaster.”","“The unpleasant surprise is that the market thought SBF was better than this — and expected him to have managed FTX risk more effectively,\" Litan said. \"This may cause irreversible damage to Sam’s reputation though it’s too early to say.”","Crypto Twitter, meanwhile, was rife with speculation about the potential impact on other exchanges, possible antitrust action and the general state of the altcoin ecosystem.","“This is all a Ponzi scam,” Twitter user Jim Lewis, who frequently posts on Twitter under the moniker Wall Street Silver&nbsp;<a href=\"https:\/\/twitter.com\/WallStreetSilv\/status\/1590022207065194499\" data-v-f87c67ca=\"\">wrote<\/a>, referencing Binance’s Zhao. “He slams their value with a vague announcement on why he is selling their junk token, now he is going to buy them out.”","Technology author Eric Newcomer pointed out that Sequoia had invested in a $420 million round that valued FTX at $25 billion in 2021, while a consortium with Paradigm invested $400 million at a $32 billion valuation in 2022.","“And now it's selling in a fire sale?” <a href=\"https:\/\/twitter.com\/EricNewcomer\/status\/1590020873528004609\" data-v-f87c67ca=\"\">he wrote<\/a> on Twitter. “This is a truly crazy event in startup world. Dot-com bust level event.”","Neither FTX or Binance immediately responded to requests for comment. The Commodity Futures Trading Commission is watching the situation, but spokesperson Steven Adamske <a href=\"https:\/\/www.theblock.co\/post\/184354\/ftx-implosion-has-u-s-regulators-on-watch\" data-v-f87c67ca=\"\">told The Block<\/a> that \"any regulatory issues right now are unclear.”","Swan Bitcoin CEO Cory Klippsten, a Bitcoin enthusiast who has predicted other major crypto collapses this year, pointed to the risks of any centralized business.","“All it takes is a little bit of momentum for every trader in crypto to believe it could be a great trade to short all of their positions into oblivion,” he wrote on Telegram. “All of these centralized businesses with large piles of altcoins on their balance sheets are literally confidence games. They are inherently fragile, susceptible to a Lehman-like collapse at any time.”","Pascal Gauthier, CEO of Paris-based Ledger, said the news reaffirmed the importance of crypto custody.","“People have a legitimate reason to worry about the security of their digital assets if one of the world’s largest centralized exchanges ends up in financial difficulties,” he said in a statement. “The message has never been more urgent: If you don’t own your keys, you don’t own your crypto, regardless of whatever reassurances are published in the coming days.\"","<em data-v-f87c67ca=\"\">With additional reporting from RT Watson, Colin Wilhelm, Kari McMahon, Tim Copeland, Jeremy Nation and Adam Morgan McCarthy.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Avivah Litan","content":"PERSON"},{"type":"Sam’s","content":"PERSON"},{"type":"Lehman","content":"LOCATION"},{"type":"$25 billion","content":"MONEY"},{"type":"18.4%","content":"PERCENT"},{"type":"81%","content":"PERCENT"},{"type":"Kari McMahon","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$4.95","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Gartner","content":"ORGANIZATION"},{"type":"Cory Klippsten","content":"PERSON"},{"type":"$420 million","content":"MONEY"},{"type":"Paris","content":"LOCATION"},{"type":"RT Watson","content":"PERSON"},{"type":"Tim Copeland","content":"PERSON"},{"type":"Litan","content":"PERSON"},{"type":"Steven Adamske","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$20 billion","content":"MONEY"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Sunday","content":"DATE"},{"type":"Eric Newcomer","content":"PERSON"},{"type":"Jeremy Nation","content":"ORGANIZATION"},{"type":"Adam Morgan McCarthy","content":"PERSON"},{"type":"9:00 a.m. ET","content":"TIME"},{"type":"$10 billion","content":"MONEY"},{"type":"12.4%","content":"PERCENT"},{"type":"$3.66 billion","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"$6 billion","content":"MONEY"},{"type":"morning","content":"TIME"},{"type":"Bankman","content":"PERSON"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Jim Lewis","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE","CZ","FTX","SAM BANKMAN-FRIED"],"authors":["Nathan Crooks","The Block"]}