{"summary":"&quot;Meta would be one step closer to its ultimate goal of owning the entire &#x27;Metaverse,&#x27;&quot; the FTC&#x27;s complaint says. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159926\/us-antitrust-watchdog-sues-to-stop-facebook-from-monopolizing-the-metaverse","publishDate":"2022-07-27T16:33:59","id":11423,"type":null,"title":"US antitrust watchdog sues to stop Facebook from monopolizing the metaverse","category":["FACEBOOK"],"content":["The US antitrust regulator is suing Facebook to stop it from dominating the metaverse.","On July 27, the Federal Trade Commission (FTC) <a href=\"https:\/\/www.ftc.gov\/news-events\/news\/press-releases\/2022\/07\/ftc-seeks-block-virtual-reality-giant-metas-acquisition-popular-app-creator-within?utm_source=govdelivery\" data-v-f87c67ca=\"\">filed<\/a> suit to stop Facebook from acquiring Unlimited and its virtual reality fitness app, Supernatural. \"The agency alleges that Meta and Zuckerberg are planning to expand Meta’s virtual reality empire with this attempt to illegally acquire a dedicated fitness app that proves the value of virtual reality to users,\" the FTC said in a release.","\"Meta would be one step closer to its ultimate goal of owning the entire 'Metaverse,'\" the FTC's complaint said.&nbsp;","The complaint details Facebook's acquisition of virtual reality companies, going back to its purchase of Oculus back in 2014. It said:&nbsp;&nbsp;","\"As Meta fully recognizes, network effects on a digital platform can cause the platform to become more powerful — and its rivals weaker and less able to seriously compete — as it gains more users, content, and developers. The acquisition of new users, content, and developers each feed into one another, creating a self-reinforcing cycle that entrenches the company’s early lead.\"","The acquisition is scheduled to take place at midnight on August 1.&nbsp;","The FTC's complaint appears to have redacted a number of adjectives positively describing the market position of Supernatural, Facebook, or any of its apps and acquisitions.&nbsp;","The FTC has long taken issue with Facebook's business practices, <a href=\"https:\/\/www.ftc.gov\/news-events\/news\/press-releases\/2020\/12\/ftc-sues-facebook-illegal-monopolization\" data-v-f87c67ca=\"\">suing<\/a> the firm for similar behavior in the app economy in 2020. That was well before Facebook changed its name to Meta and announced a pivot to focus its <a href=\"https:\/\/www.theblock.co\/linked\/130974\/meta-nft-report\" data-v-f87c67ca=\"\">work in the metaverse<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"midnight","content":"TIME"},{"type":"Federal Trade Commission (FTC","content":"ORGANIZATION"},{"type":"FTC","content":"ORGANIZATION"},{"type":"Zuckerberg","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"July 27","content":"DATE"},{"type":"August 1","content":"DATE"},{"type":"2020","content":"DATE"}],"hashtag":["FTC"],"authors":["Kollen Post","The Block"]}