{"summary":"The Pepe memecoin has made millionaires on paper, with its price skyrocketing over the past month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229791\/pepe-coin-price-whales-profit","publishDate":"2023-05-08T12:22:53","id":11422,"type":null,"title":"Pepe whales are sitting on paper profits worth more than $90 million","category":["MARKETS"],"content":["Pepe, a memecoin styled on the <a href=\"https:\/\/www.theblock.co\/post\/229726\/pepe-coin-price-slide-whale-loss\" data-v-f87c67ca=\"\">Pepe the Frog cartoon<\/a>, has made some crypto traders millions — at least on paper — as its price skyrocketed since launching last month.","The top 15 pepe whales — large holders of the tokens — are collectively sitting on potential profits that currently total $92.6 million, <a href=\"https:\/\/twitter.com\/lookonchain\/status\/1655527153793122304?s=20\" data-v-f87c67ca=\"\">according to onchain data analyzed by Lookonchain<\/a>. While the whales have sold some holdings, they still hold over 38 trillion pepe coins, or around 9% of its total supply, Lookonchain said.","The profits result from simple math. The whales paid an average of $0.0000000853 per token, and the current price of the coin is around $0.00000224. That's a lot of zeros, but it adds up to a gain of 2,526%, according to CoinGecko data.","Two of the top 15 whales are sitting on paper profits of over $11 million each, with the rest seeing gains between $2.9 million and $6.9 million, according to Lookonchain. One of the whales, however, has their address blacklisted, meaning they'll likely never be able to cash out.","Meme coin trading <a href=\"https:\/\/dune.com\/j1002\/meme-narrative-craze\" data-v-f87c67ca=\"\">volumes are soaring, led by pepe<\/a>. Last month, <a href=\"https:\/\/www.theblock.co\/post\/225328\/dogecoin-dives\" data-v-f87c67ca=\"\">Dogecoin<\/a> saw volatility after Elon Musk temporarily replaced the blue Twitter bird icon with an image of the doge dog.&nbsp;","","","While most of the profits are yet to be realized, Lookonchain data shows that three of the whales have sold pepe tokens with actual proceeds totaling between $1 million and $4 million. Some still appear to be HODLing, though, with six of the whales having yet to sell a single pepe token.","Trading strategies also appear to be quite diverse, too. The biggest whale currently holds 4.91 trillion tokens and has only cashed out about 5.1 billion for a total of $20,024. The next largest whale currently holds 4.76 trillion tokens but has sold 1.75 trillion tokens for a cool $4.2 million.","Pepe, which claims to be \"the most memeable memecoin in existence,\" was launched on April 15. The coin has no association with cartoonist Matt Furie, who created the Pepe the Frog cartoon character.","\"This token is simply paying homage to a meme we all love and recognize,\" <a href=\"https:\/\/www.pepe.vip\/\" data-v-f87c67ca=\"\">the pepe coin's website states<\/a>. \"$PEPE is a meme coin with no intrinsic value or expectation of financial return. There is no formal team or roadmap. The coin is completely useless and for entertainment purposes only.\"","Despite the warning, crypto enthusiasts have lapped up the coin and traded it massively. Pepe is currently the 53rd largest crypto token, with a<a href=\"https:\/\/www.theblock.co\/post\/229676\/pepe-memecoin-tops-1-billion-market-cap-even-as-binance-flags-lack-of-utility\" data-v-f87c67ca=\"\"> market cap<\/a> of over $940 million, <a href=\"https:\/\/www.coingecko.com\/en\/coins\/pepe\" data-v-f87c67ca=\"\">according to CoinGecko data<\/a>.","","","Steven Zheng, research director at The Block, said the current memecoin frenzy is similar to past NFT and DeFi waves, where early adopters made substantial profits from relatively small investments. “Unlike the two previous waves of DeFi and NFT, however, this time, the promotion of utility has been put on the back burner for pure unadulterated speculation,” Zheng said.","“The memecoin mania will end with a handful of winners and the copycats will fade into irrelevance,” he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2,526%","content":"PERCENT"},{"type":"$11 million","content":"MONEY"},{"type":"$6.9 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$20,024","content":"MONEY"},{"type":"Steven Zheng","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$92.6 million","content":"MONEY"},{"type":"Zheng","content":"PERSON"},{"type":"Lookonchain","content":"PERSON"},{"type":"$4.2 million","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"$0.00000224","content":"MONEY"},{"type":"Dogecoin","content":"PERSON"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$PEPE","content":"MONEY"},{"type":"$2.9 million","content":"MONEY"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"$0.0000000853","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"April 15","content":"DATE"},{"type":"$940 million","content":"MONEY"},{"type":"Matt Furie","content":"PERSON"},{"type":"Lookonchain","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}