{"summary":"Fetch.ai, a blockchain platform that uses artificial intelligence to help people automate tasks, unviled $40 million in new funding from DWF Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223623\/fetch-ai-funding-250-million-valuation-dwf-labs","publishDate":"2023-03-29T11:10:04","id":11438,"type":null,"title":"Fetch.ai announces fresh funding at a $250 million valuation","category":["DEALS"],"content":["Fetch.ai, a blockchain platform that uses artificial intelligence to help people automate tasks, said it has raised $40 million in new funding from DWF Labs.","Almost half of that amount has already been invested by DWF, Fetch.ai founder and CEO Humayun Sheikh told The Block in an interview. The rest will be invested in the next month, Sheikh said, adding that initial talks with DWF began in late January.","The funding is a mix of equity and Fetch.ai (FET) tokens at a combined valuation of around $250 million, Sheikh said. He declined to comment on DWF's vesting period for the token part of the investment but said the web3 investment firm, which is also a market maker, is not and will not be a market maker for FET as part of the deal.","With fresh capital from <a href=\"https:\/\/www.theblock.co\/post\/223353\/so-col-funding-irene-zhao-web3-social-platform\" data-v-f87c67ca=\"\">DWF<\/a>, Cambridge, UK-based Fetch.ai is looking to grow its ecosystem, especially in Asia.","\"DWF is quite active in the Asian community, building developer communities around the different projects it is investing in,\" Sheikh said. \"We need to bring in more developers and launch applications, so DWF's proposition fits our plan. DWF will support us with that over the next 12 to 24 months.\"","Given the rise of AI tools, such as OpenAI's chatbot ChatGPT, Sheikh expects a brighter future for the Fetch.ai ecosystem. Current AI tools don't help perform routine tasks, Sheikh said, adding that Fetch.ai will be a \"game changer.\"","Fetch.ai was founded in 2017. One of its main products under development is a decentralized machine learning AI model called Colearn, where multiple parties can build and train AI models to perform tasks on the Fetch network. The other is called Autonomous Economic Agents, which can be integrated into apps like ChatGPT to complete tasks or linked with the Fetch wallet to execute transactions.","\"What we are trying to do is bring automation so people don't have to interact with too many applications. So life is a lot simpler by performing tasks from one place,\" Sheikh said. \"We are opening up our infrastructure to developers to build different applications so users can enjoy the automation journey in a decentralized fashion.\"","There are currently 68 people working for Fetch.ai. The startup isn't looking to immediately grow that headcount as it's more focused on expanding its developer community, Sheikh said.","To that end, Fetch.ai could raise another funding round soon, Sheikh said, adding that the startup is currently in talks with investors. Fetch.ai previously raised $21.6 million in funding, including an initial exchange offering, or <a href=\"https:\/\/www.theblock.co\/linked\/13355\/fetch-ai-ico-sells-out-in-about-10-seconds\" data-v-f87c67ca=\"\">IEO,<\/a> on Binance in 2019.","The FET token is up around 12% on the day at about $0.38, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/fetch-ai\" data-v-f87c67ca=\"\">CoinGecko<\/a>. Its fully diluted valuation stands at about $418 million.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Sheikh","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$250 million","content":"MONEY"},{"type":"Sheikh","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"Humayun Sheikh","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"$21.6 million","content":"MONEY"},{"type":"Autonomous Economic Agents","content":"ORGANIZATION"},{"type":"$418 million","content":"MONEY"},{"type":"Cambridge","content":"LOCATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"$0.38","content":"MONEY"},{"type":"UK","content":"LOCATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","STRATEGIC INVESTMENTS"],"authors":["Yogita Khatri","The Block"]}