{"summary":"Former Google and Activision Blizzard executive Daniel Alegre spoke about his ambitions for Yuga Labs in his first public appearance as CEO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228839\/yuga-labs-new-ceo-daniel-alegre-plan-for-web3-domination","publishDate":"2023-04-28T14:39:10","id":11434,"type":null,"title":"Yuga Labs new CEO wants Otherside to be web3&#x27;s &#x27;front door&#x27;","category":["COMPANIES"],"content":["In his first public appearance as CEO of Yuga Labs, Daniel Alegre may have said web3 isn’t a game of kill or be killed, but he did more or less imply he wants his company to sit head and shoulders above its rivals.","<b data-v-f87c67ca=\"\"><\/b><span data-v-f87c67ca=\"\">“What I want Yuga to be is the front door to web3,” Alegre said on Friday at CoinDesk's Consensus conference in Austin, Tx. “The transformation is gonna happen. It’s happening obviously in art, it’s happening in digital consumption and obviously gaming but it’s going to expand into so many different areas of industry. Otherside is that entry way into web3.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","Web3 is envisioned as the next phase of the internet that is blockchain-powered and decentralized. Otherside, a virtual world where users will be able to come together online to socialize and play games, is Yuga’s “big bet” in web3 Alegre said.","Alegre, although named <a href=\"https:\/\/www.theblock.co\/post\/196139\/bayc-yuga-labs-ceo-activision-blizzard\" data-v-f87c67ca=\"\">Yuga’s new CEO<\/a> back in December, only took over a few weeks ago. He was formerly an executive at Google and then Activision Blizzard.","<span data-v-f87c67ca=\"\">Otherside is by most estimations already one of web3’s biggest success stories. Otherdeeds, the non-fungible tokens that serve as certificates of ownership for plots of land on Otherside, have <a href=\"https:\/\/www.theblock.co\/post\/223913\/bored-ape-metaverse-wash-trading\" data-v-f87c67ca=\"\">generated more than $1.1 billion in trading<\/a>, according to The Block Research.<\/span>","<span data-v-f87c67ca=\"\">Virtual plots of land on The Sandbox, which from day one billed itself as a web3, metaverse platform that would serve a similar purpose to Otherside, has yielded about $300 million in trading volume, also according to The Block Research.<\/span>","After declaring he wanted Yuga’s Otherside platform to be web3’s “front door,” Alegre then said that doesn't mean he's angling to be the “biggest in the space.” Instead, the CEO said he’s willing to “embrace third parties who can actually follow with the vision that we have and bring them onto [Otherside].”","<span data-v-f87c67ca=\"\">Yuga has been valued at $4 billion after being founded in 2021.<\/span>","<span data-v-f87c67ca=\"\">“This is not a winner take all environment,” he added, before returning to early comments about wanting to make it easier for people to be part of the Yuga Labs community. “My mission is to make web3 as easily available and bring great content creators and the economy together.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel Alegre","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Alegre","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Tx","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Activision Blizzard","content":"ORGANIZATION"},{"type":"” Alegre","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"$1.1 billion","content":"MONEY"}],"hashtag":["YUGA LABS"],"authors":["RT Watson","The Block"]}