{"summary":"The Indian government is said to be levying a complete ban on crypto. Existing investors will reportedly get a 3-6 month transition period.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94740\/india-to-ban-crypto-investment-completely-report","publishDate":"2021-02-12T04:00:17","id":11433,"type":null,"title":"India to ban cryptocurrency investment completely: Report","category":["CRYPTOCURRENCY"],"content":["The Indian government is said to be levying a complete ban on cryptocurrency investment.","BloombergQuint <a href=\"https:\/\/www.bloombergquint.com\/business\/intent-on-ban-india-to-give-transition-time-to-crypto-investors-bq-exclusive\" data-v-f87c67ca=\"\">reported<\/a> the news on Thursday, citing an unnamed \"senior Finance Ministry official.\" The ban won't be imposed overnight, according to the official, who said the government would give a three-to-six month transition period for existing investors to liquidate their investments.","Since India's central bank doesn't back cryptocurrencies, the government will ban their usage in all forms through a law that will be introduced in Parliament, said the official. The ban would also restrict crypto trading via foreign exchanges, per the report.","India's crypto law will be modeled on China's crypto regime, which has effectively banned crypto trading, according to the official. China, however, has only banned fiat-to-crypto trading since 2017. Crypto-to-crypto trading is still allowed in the country.","India's <a href=\"https:\/\/www.theblockcrypto.com\/post\/94290\/india-crypto-bill-finance-ministry-thakur-sitharaman-comments\" data-v-f87c67ca=\"\">proposed \"The Cryptocurrency and Regulation of Official Digital Currency Bill, 2021\"<\/a> is listed for introduction in the ongoing Budget session of Parliament, which concludes on April 8, with a recess between February 15 and March 8.","The bill seeks to prohibit all \"private cryptocurrencies\" in India. The definition of private cryptocurrencies and the final text of the bill is not known yet. Still, India's finance Minister Nirmala Sitharaman earlier this week <a href=\"https:\/\/www.theblockcrypto.com\/post\/94290\/india-crypto-bill-finance-ministry-thakur-sitharaman-comments\" data-v-f87c67ca=\"\">suggested<\/a> that private cryptocurrencies include all digital currencies apart from those issued by a central bank.","According to the official quoted above, the proposed bill \"will be soon sent to the Union Cabinet for approval.\"","Earlier this week, India's junior finance minister Anurag Thakur also <a href=\"https:\/\/www.theblockcrypto.com\/post\/94290\/india-crypto-bill-finance-ministry-thakur-sitharaman-comments\" data-v-f87c67ca=\"\">said<\/a> that the bill \"is being finalized and would be sent to the cabinet soon.\"","<a href=\"https:\/\/www.theblockcrypto.com\/daily\/68133\/india-crypto-ban-revived-report\" data-v-f87c67ca=\"\">As The Block has previously <\/a><a href=\"https:\/\/www.theblockcrypto.com\/daily\/68133\/india-crypto-ban-revived-report\" data-v-f87c67ca=\"\">reported<\/a>, the legislative process is lengthy in India. Once a bill is moved for consultation in the cabinet, it goes through various ministries for feedback. Once this process concludes, the bill then moves to Parliament. The Parliament has its own approval processes, including getting nods from the Lok Sabha (House of the People) and the Rajya Sabha (Council of States). Once the bill passes the Parliament, it then goes to the president of India for a final signature.","However, if the cabinet wants a specific bill to get passed, it can go for the ordinance route. Ordinances enable the Indian government to take immediate legislative action. Last week, there were <a href=\"https:\/\/www.theblockcrypto.com\/post\/94290\/india-crypto-bill-finance-ministry-thakur-sitharaman-comments\" data-v-f87c67ca=\"\">reports<\/a> that the government is likely to pass a cryptocurrency bill via ordinance.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Finance Ministry","content":"ORGANIZATION"},{"type":"February 15","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Union Cabinet","content":"ORGANIZATION"},{"type":"Anurag Thakur","content":"PERSON"},{"type":"Rajya Sabha (Council of States)","content":"ORGANIZATION"},{"type":"Parliament","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"April 8","content":"DATE"},{"type":"March 8","content":"DATE"},{"type":"Nirmala Sitharaman","content":"PERSON"},{"type":"Lok Sabha (House","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN","CRYPTO"],"authors":["Yogita Khatri","The Block"]}