{"summary":"AptosLaunch, a crypto startup that will offer a platform for Aptos-based projects to launch their tokens before an exchange listing, is finalizing a funding round, two sources tell The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183007\/aptoslaunch-token-round-fundraising","publishDate":"2022-11-04T10:40:38","id":11439,"type":null,"title":"AptosLaunch on course to raise $2 million in token round: Sources","category":["VENTURE CAPITAL"],"content":["AptosLaunch, a crypto startup offering a platform for Aptos-based projects to launch their tokens before an exchange listing, is on course to raise about $2 million in a token round.&nbsp;","The company was looking to raise $1.8 million via a simple agreement for future tokens (SAFT) involving AptosLaunch's native ALT token but ultimately received commitments of more than $18 million, two people with direct knowledge of the matter told The Block.","Still, the firm is looking to stick close to its original target and is currently deciding which investors to finalize for the deal, the sources said. AptosLaunch declined to comment when reached.","AptosLaunch was set up in September by three pseudonymous founders named PC, ProfessorZundapp and Loco, according to a project summary document obtained by The Block. The project began raising funds last month.","<a href=\"https:\/\/www.theblock.co\/post\/173036\/aptos-lures-solana-developers-tired-of-eating-glass\" data-v-f87c67ca=\"\">Aptos<\/a> is a new Layer 1 blockchain co-founded by Mo Shaikh and Avery Ching, both former Meta employees who worked on the social media giant's Diem blockchain. Aptos launched its mainnet late last month.","Aptos has more than 65 projects across different verticals on the network, <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-aptos-ecosystem-162141\" data-v-f87c67ca=\"\">according to The Block Research<\/a>. A number of new Aptos-based projects have also raised funds in recent weeks, including <a href=\"https:\/\/www.theblock.co\/post\/177279\/parafi-backs-thala-labs-6-million-raise-to-build-defi-stack-on-aptos-exclusive\" data-v-f87c67ca=\"\">Thala Labs<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/180477\/race-capital-leads-aptos-wallet-martians-3-million-raise-exclusive\" data-v-f87c67ca=\"\">Martian<\/a> and Souffl3.","While AptosLaunch is currently <a href=\"https:\/\/forum.aptoslabs.com\/top\" data-v-f87c67ca=\"\">the most discussed project<\/a> to date in the ecosystem, it's not the only launchpad on Aptos. Several others, including Aptos Launcher, AptosBase and AptPad, are building similar platforms, according to Aptos.Systems.","AptosLaunch argues that it is distinct from other launchpads because of its \"innovative\" insurance feature, according to a pitch deck obtained by The Block. This optional tool claims to offer some protection if a user purchases a token that subsequently falls in value, with users who opt in contributing to a fund to cover the cost.&nbsp;&nbsp;","The startup will also offer staking services and support NFT projects, the pitch deck shows. More than 40 Aptos-based projects have shown interest in launching their tokens via AptosLaunch, according to one of the sources.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"Mo Shaikh","content":"PERSON"},{"type":"Aptos Launcher","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"$1.8 million","content":"MONEY"},{"type":"$18 million","content":"MONEY"},{"type":"Avery Ching","content":"PERSON"}],"hashtag":["APTOS"],"authors":["Yogita Khatri","The Block"]}