{"summary":"Cryptocurrency exchange OKEx says it will resume the peer-to-peer (P2P) fiat-to-crypto trading tunnel, which had been disabled","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81793\/okex-resuming-p2p-fiat-trading-for-chinese-yuan","publishDate":"2020-10-21T00:12:55","id":11446,"type":null,"title":"OKEx is resuming peer-to-peer fiat trading for Chinese yuan","category":["EXCHANGES"],"content":["Cryptocurrency exchange OKEx said in an <a href=\"https:\/\/www.okex.com\/support\/hc\/en-us\/articles\/360050830632-Resumption-of-P2P-Trading\" data-v-f87c67ca=\"\">announcement<\/a> on Wednesday that it will resume the peer-to-peer (P2P) fiat-to-crypto trading tunnel for Chinese yuan, Vietnamese dong, and Indian rupee, starting from 20:00 Hong Kong Time on October 21.","OKEx disabled the P2P fiat-to-crypto trading interface after it <a href=\"https:\/\/www.theblockcrypto.com\/post\/81406\/crypto-exchange-okex-withdrawal-issues-investigation\" data-v-f87c67ca=\"\">announced<\/a> the suspension of withdrawal of crypto assets on the platform last Friday, saying that it was \"out of touch\" with a private key holder who was \"cooperating with a public security bureau in investigations where required. At the moment, OKEx's P2P fiat trading page shows no active bid or ask quotes for any crypto assets against fiat currencies.&nbsp;","Typically, OKEx functions as an escrow to facilitate fiat-to-crypto trading on its platform in a P2P, or over-the-counter (OTC), fashion. Third-party OTC merchants on OKEx can post bid or ask prices for a certain cryptocurrency against a supported fiat currency, such as Chinese yuan.","A buyer, for instance, can then wire Chinese yuan to an OTC merchant through either AliPay, WeChat Pay or bank transfer and then OKEx will credit the newly-purchased crypto to the buyer's account as an internal transfer that doesn't require on-chain transactions. Similarly, users can also end each other assets directly via off-chain internal transfers as long as they have each other's unique ID on the exchange.","This has been the only fiat on-ramp and off-ramp for Chinese crypto traders since September 2017, when the People's Bank of China ordered exchanges in the country to stop supporting direct fiat on-ramp services.","However, since OKEx users can't withdraw their assets for the time being, some have been trying different ways to get their funds out of the exchange. Since there's no direct interface for P2P bids and asks, users have also taken their quotes outside of the exchange, to other communication channels.&nbsp;","Given the uncertainty of when OKEx can resume withdrawals, <a href=\"https:\/\/twitter.com\/bigmagicdao\/status\/1318585747255930881\" data-v-f87c67ca=\"\">several<\/a> <a href=\"http:\/\/weibointl.api.weibo.com\/share\/179201201.html?weibo_id=4562186556410912\" data-v-f87c67ca=\"\">users<\/a> are posting on social media that crypto assets on OKEx such as USDT and BTC are being sold at a 10% - 20% discount in the P2P fashion.&nbsp;","Such efforts have apparently led OKEx to ban some user accounts. The exchange said in a <a href=\"https:\/\/twitter.com\/OKEx\/status\/1318603996244840448\" data-v-f87c67ca=\"\">tweet<\/a>:","\"Multiple accounts have triggered our risk management system. As a result, those accounts have been automatically banned for internal transfers. To ensure the safety of your assets, we'd like to remind users not to engage in unauthorized platforms.\"","OKG Technology, a Hong Kong-listed company that's controlled by OKEx's founder Xu Mingxing, <a href=\"https:\/\/www1.hkexnews.hk\/listedco\/listconews\/sehk\/2020\/1018\/2020101800037.pdf\" data-v-f87c67ca=\"\">said<\/a> on October 18 that it was notified by its legal counsel that Xu \"is presently under an investigation\" by China's police enforcement and the company can't reach Xu directly to confirm that information.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hong Kong Time","content":"LOCATION"},{"type":"People's Bank of China","content":"ORGANIZATION"},{"type":"October 18","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"October 21","content":"DATE"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Xu Mingxing","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"last Friday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"September 2017","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}