{"summary":"Indian crypto exchange CoinSwitch Kuber raises $25 million in Series B funding from Tiger Global, a Coinbase investor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102573\/indian-crypto-exchange-coinswitch-kuber-25-million-series-b-tiger-global","publishDate":"2021-04-22T05:30:23","id":11449,"type":null,"title":"Indian crypto exchange CoinSwitch Kuber raises $25 million in Series B funding from Tiger Global","category":["VENTURE CAPITAL"],"content":["Indian crypto exchange CoinSwitch Kuber has raised $25 million in a Series B funding round.","The round was backed by a single investor — Tiger Global Management — marking its first investment in an Indian crypto firm. Tiger invested at a valuation of over $500 million, said CoinSwitch.","CoinSwitch's Series B comes just three months after it raised <a href=\"https:\/\/www.theblockcrypto.com\/post\/90983\/coinswitch-kuber-15-million-series-a-ribbit-capital-paradigm\" data-v-f87c67ca=\"\">$15 million in Series A<\/a> led by Ribbit Capital and Paradigm. When asked why raised again so soon, Sharan Nair, the chief business officer of CoinSwitch, told The Block that the exchange is witnessing a \"hyper-growth\" stage and needed funds to \"quickly scale and attain greater growth and reach to the likes of Coinbase.\"","It is worth noting that&nbsp;<a href=\"https:\/\/medium.com\/@cointopper\/coinbase-gets-an-investment-boost-of-500-million-from-tiger-global-valuation-increases-to-8-bc0f32b06438\" data-v-f87c67ca=\"\">Tiger Global is an investor in Coinbase<\/a> who poured in $500 million in the U.S. crypto exchange operator in October 2018. Nair told The Block that Tiger would provide its expertise to CoinSwitch as it did to Coinbase on its growth plans.","With fresh capital at hand, CoinSwitch looks to scale its platform from technology and security viewpoints, grow its team and its user base.","CoinSwitch claims to have 4.5 million users currently and aims to onboard 10 million more users by the end of this year. As for growing its team, the exchange looks to more than double its headcount from current around 135 to around 300 in the near future, Nair told The Block.","\"We are hiring in tech and product functions mostly,\" he said.","CoinSwitch also plans to set aside a \"substantial sum\" towards brand building and increasing awareness around cryptocurrencies. Further, the exchange looks to offer trading in other asset classes. When asked if equity is on the list, Nair told The Block that \"most common asset classes\" are under consideration, but the plan is still \"very early in the evaluation stage.\"","\"We would explore more asset classes so users can diversify their investments in the right balance,\" he said.","The Series B brings CoinSwitch's total funding to date to over $40 million and its post-money valuation to $525 million, Nair told The Block.","CoinSwitch's raise comes at a time when <a href=\"https:\/\/www.theblockcrypto.com\/post\/94740\/india-to-ban-crypto-investment-completely-report\" data-v-f87c67ca=\"\">India is reportedly looking to ban cryptocurrency usage<\/a>. Nair <a href=\"https:\/\/www.theblockcrypto.com\/daily\/97559\/indias-crypto-exchanges-optimistic-reports-crypto-ban\" data-v-f87c67ca=\"\">recently told The Block<\/a> that CoinSwitch is hoping the Indian government won't take such a move, but it is \"preparing for the worst.\"","If a ban is enacted, \"the only option we would have left is to move our base and serve a different country altogether,\" he told The Block last month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Tiger Global Management —","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"$40 million","content":"MONEY"},{"type":"Nair","content":"PERSON"},{"type":"Tiger","content":"ORGANIZATION"},{"type":"Ribbit Capital","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"CoinSwitch","content":"ORGANIZATION"},{"type":"Sharan Nair","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"$25 million","content":"MONEY"},{"type":"$525 million","content":"MONEY"},{"type":"CoinSwitch Kuber","content":"ORGANIZATION"}],"hashtag":["SERIES B","TIGER GLOBAL"],"authors":["Yogita Khatri","The Block"]}