{"summary":"Much wow.  That&#x27;s how some cryptocurrency traders are likely thinking of recent action in Dogecoin markets after a wild week for the meme crypto. The","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70824\/here-are-the-numbers-behind-tiktoks-crazy-dogecoin-moment","publishDate":"2020-07-08T16:50:27","id":11440,"type":null,"title":"Here are the numbers behind TikTok&#x27;s crazy Dogecoin moment","category":["CRYPTOCURRENCY"],"content":["Much wow.&nbsp;","That's how some cryptocurrency traders are likely thinking of recent action in Dogecoin markets after a wild week for the meme crypto. The price of the coin, originally founded as a joke, has soared as TikTok users attempt to pump it to $1 from its sub-penny price. As the dust starts to settle, we take a look at some of the numbers behind what Bloomberg has <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-07-08\/tiktok-takes-on-crypto-with-dogecoin-soaring-40-in-24-hours?srnd=cryptocurrencies&amp;sref=w3vFo7gi\" data-v-f87c67ca=\"\">called<\/a> the \"Dogecoin Challenge.\"","As the Doge mania gripped crypto markets, trading volumes among venues supporting the crypto soared to $27M—22 times the average daily trading volume in 2020. There was a 600% increase from July 6 to July 7.&nbsp;","","","Indeed, a spike in volumes has been coupled with a spike in searches, according Google Trends, which analyzes the popularity of top search terms over time. Google searches for \"dogecoin\" reached the top popularity score of 100 on July 7.","Source: Google, The Block Research","Visits to Dogecoin's Wikipedia page have also skyrocketed. Prior to Tuesday's spike, the page averaged approximately 730 views per day. Tuesday's view count hit 5,700.","Source: Wikipedia, The Block Research","Finally, Dogecoin's blockchain itself has felt the repercussions of the mania. Value settled on the network hitting yearly highs of nearly $20M—close to seven times the average daily value settled on the network.","Source: Coin Metrics, The Block Research","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 7","content":"DATE"},{"type":"July 6","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"600%","content":"PERCENT"},{"type":"Google","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$27M","content":"MONEY"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$20M","content":"MONEY"},{"type":"Wikipedia","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Google Trends","content":"ORGANIZATION"}],"hashtag":["DOGECOIN"],"authors":["Frank Chaparro","The Block"]}