{"summary":"Yuga Labs announced it will stop working with NFT marketplaces that “don’t support royalties for all creators.”\nThe company’s move does not include its Bored Ape Yacht Club and Mutant Ape Yacht Club brands, the two collections that account for the vast majority of Yuga Labs’ royalties and trading volume.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279184\/yuga-labs-protects-nft-royalties-ahead-of-magic-edens-ethereum-marketplace-launch","publishDate":"2024-02-26T14:45:20","id":1144,"type":null,"title":"Yuga Labs protects NFT royalties ahead of Magic Eden&#x27;s Ethereum marketplace launch","category":["NFT Marketplaces"],"content":["In a move that may be more symbolic than consequential for now, top NFT studio Yuga Labs announced it will no longer support marketplaces that don't honor creators' royalties.","The decision comes on the eve of Magic Eden launching its Ethereum marketplace on Tuesday.","\"Yuga and Magic Eden are taking a big step forward to bring us back to a creator led web3. In sync with the marketplace launch, tomorrow we will be sunsetting our support for marketplaces that don't support royalties for all creators,\" the company <a href=\"https:\/\/twitter.com\/yugalabs\/status\/1762178404030218655\" data-v-f87c67ca=\"\">posted to X<\/a> on Monday. \"This means that our collections with a royalty filter will only be traded on marketplaces that respect creator royalties.\"","The move comes more than a year after Blur managed to capture the majority of NFT trading volume. This success was largely predicated on that marketplace <a href=\"https:\/\/www.theblock.co\/post\/255274\/how-blurs-low-royalty-fee-helped-decimate-yuga-labs-revenue\" data-v-f87c67ca=\"\">doling out generous incentives<\/a> while also introducing a radically reduced royalty structure. OpenSea, the leading marketplace up until that point, later followed suit, lowering its royalty fees in the hopes of competing with Blur.&nbsp;","The lower royalty structure coupled with declining trading volumes for NFTs caused Yuga Labs's revenues to decline significantly last year. Then in November, Magic Eden announced it had <a href=\"https:\/\/www.theblock.co\/post\/261542\/magic-eden-yuga-labs-launching-ethereum-nft-marketplace-to-enforce-royalties\" data-v-f87c67ca=\"\">partnered with Yuga Labs<\/a> in order to launch a marketplace for Ethereum NFTs that is contractually obligated to enforce creator royalties.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/share-of-nft-marketplace-volume\/embed\" title=\"Share of Ethereum NFT Marketplace Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While the Yuga Labs announcement may some day prove to be a seminal moment, for now, its decision may not have much of an impact in dollar terms. The company is not ending support for its two top collections by trading volume, Bored Ape Yacht Club and Mutant Ape Yacht Club.","\"The vast majority of royalty generating NFTs from Yuga Labs’ collection fall under the Bored Ape Yacht Club and Mutant Ape Yacht Club brand, which are not impacted by this change,\" said Steven Zheng, research analyst at The Block Research. \"Thus, this update doesn’t move the needle much, in terms of royalty revenue, for Yuga Labs, but does incentivize the team to build out and provide value to its Otherside collections.\"","Yuga Labs <a href=\"https:\/\/news.yuga.com\/collections-with-royalty-filters\" data-v-f87c67ca=\"\">posted a list<\/a> of the collections that, going forward, will only trade on marketplaces that protect the payment of royalties. The brands Yuga Labs intends to protect include several Otherside collections, which are tied to the company's metaverse platform currently under development, and some Moonbirds NFTs, a collection Yuga Labs <a href=\"https:\/\/www.theblock.co\/post\/277905\/bored-apes-creator-yuga-labs-acquires-proof-takes-over-moonbirds-nft-brand\" data-v-f87c67ca=\"\">recently acquired<\/a>.","&nbsp;"],"hashtag":["MAGIC EDEN"]}