{"summary":"Polymer Labs, building an Ethereum L2 to provide interoperability-as-a-service, has raised $23 million in Series A funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274043\/ethereum-polymer-labs-raises-funding","publishDate":"2024-01-23T10:00:03","id":11448,"type":null,"title":"Ethereum Layer 2 developer Polymer Labs raises $23 million in Series A funding","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">Polymer Labs, which is building an <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.15%\n    <\/span><\/a> <!----><\/span><\/span> Layer 2 network to provide interoperability-as-a-service to Ethereum and its rollups, has raised $23 million in a Series A funding round.<\/span>","Blockchain Capital, Maven 11 and Distributed Global co-led the round, with Coinbase Ventures, Placeholder, Digital Currency Group, North Island Ventures and Figment Capital participating, Polymer Labs said Tuesday.","It isn't clear when Polymer began raising for the round and when the project closed; co-founder Peter Kim declined to comment on the timeline. He also declined to comment on the structure of the round and whether it was an equity, token, or equity-plus-token-warrants round, as well as on valuation.","Polymer's Series A round comes nearly two years after it raised $3.6 million in seed funding. The project's Ethereum interoperability infrastructure is under development, and it plans to launch the testnet by March, Kim said.","Polymer Labs is building an \"Ethereum interoperability hub,\" first to connect Ethereum and its rollups and then all blockchains with the goal of establishing the next generation of the internet.","The current <a href=\"https:\/\/www.theblock.co\/learn\/251459\/what-is-a-layer-2\" data-v-f87c67ca=\"\">Layer 2 networks<\/a> and interoperability token bridges are widely used but have been susceptible to hacks, Polymer said, adding that its Layer 2 rollup will enable protocols on different chains to \"communicate efficiently and securely without introducing new trust assumptions, enhancing the functionality of a wide range of blockchains.\"","Polymer utilizes <a href=\"https:\/\/www.theblock.co\/learn\/249525\/what-is-cosmos-and-how-does-it-work-a-beginners-guide-to-atom-cryptocurrency\" data-v-f87c67ca=\"\">the Inter-Blockchain Communication (IBC) protocol<\/a>, the Cosmos standard for blockchain interoperability, and the Optimism Stack for its hub. Any developer building any web3 application on any chain will eventually be able to use its interoperability tool, Polymer said.","With fresh capital in hand, Kim looks to expand the current team of about 30 members by hiring across functions, including business development and engineering. Polymer also aims to launch its mainnet sometime this year, \"depending on testnet performance,\" Kim said.","Polymer said its team has had professional working experience at firms including Google, Citadel, McKinsey, Amazon, Verizon, EY, and Uber.","\"While many bridges have prioritized go-to-market and business development, we emphasize the importance of building the right solution for the long term,\" Kim said. \"Most of our engineering team members were brought on outside of crypto — more senior developers with experience specifically around scaling the infrastructure for the internet in web2.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polymer","content":"ORGANIZATION"},{"type":"Verizon","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Amazon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kim","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"$3.6 million","content":"MONEY"},{"type":"McKinsey","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"-1.15%","content":"PERCENT"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Peter Kim","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"North Island Ventures","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$23 million","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Polymer Labs","content":"ORGANIZATION"},{"type":"Citadel","content":"LOCATION"}],"hashtag":["COSMOS","ETHEREUM","OPTIMISM","SERIES A"],"authors":["Yogita Khatri","The Block"]}