{"summary":"Yung-Chang Chiang, a Taiwan lawmaker, said that he hopes to propose the draft act for first reading by the end of November, if not sooner.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255132\/taiwan-hopes-to-propose-special-crypto-law-by-end-of-november-lawmaker","publishDate":"2023-10-06T05:09:43","id":11453,"type":null,"title":"Taiwan hopes to propose special crypto law by end of November: lawmaker","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Taiwan lawmakers are hoping to propose a draft special law for first reading by the end of November in an attempt to prevent regulatory arbitrage as concerns surrounding offshore exchanges mount.<\/span>","<span data-v-f87c67ca=\"\">Yung-Chang Chiang, a member of the Legislative Yuan, Taiwan’s parliament, told The Block today in an interview that a dedicated crypto asset act is necessary to regulate crypto firms. He argued that the asset class diverges in many ways from a traditional financial product and should be overseen by a separate special law.<\/span>","<span data-v-f87c67ca=\"\">Chiang held a public hearing at the parliament today to discuss the draft proposal with virtual asset services providers, legal experts and academics.<\/span>","<span data-v-f87c67ca=\"\">While Taiwan’s <\/span><span data-v-f87c67ca=\"\">Financial Supervisory Commission last week <\/span><a href=\"https:\/\/www.theblock.co\/post\/252915\/taiwan-releases-guidelines-for-crypto-exchanges-restricts-offshore-exchanges-unless-compliant\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">released guidelines for the crypto sector<\/span><\/a><span data-v-f87c67ca=\"\"> to form its own self-supervisory rules through a <\/span><a href=\"https:\/\/www.theblock.co\/post\/252884\/taiwans-crypto-industry-prepares-to-form-association-ahead-of-new-regulation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">potential industry association<\/span><\/a><span data-v-f87c67ca=\"\">, such measures lack legal enforceability, the lawmaker said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In this case, under the authority of this special law, regulatory authorities can impose administrative penalties on operators who violate these self-regulation rules. Without such a special law, the regulators would lack the ability to impose penalties,” Chiang added.<\/span>","<span data-v-f87c67ca=\"\">The special law proposed by Chiang would require all crypto platforms operating in Taiwan to apply for a permit. If they failed to, regulators could order them to cease operations.<\/span>","<span data-v-f87c67ca=\"\">Currently, Taiwan has required virtual asset services providers to comply with anti-money laundering laws since the FSC <\/span><a href=\"https:\/\/law.fsc.gov.tw\/LawContent.aspx?id=GL003218&amp;kw=%e8%99%9b%e6%93%ac%e9%80%9a%e8%b2%a8%e5%b9%b3%e5%8f%b0%e5%8f%8a%e4%ba%a4%e6%98%93%e6%a5%ad%e5%8b%99%e4%ba%8b%e6%a5%ad%e9%98%b2%e5%88%b6%e6%b4%97%e9%8c%a2%e5%8f%8a%e6%89%93%e6%93%8a%e8%b3%87%e6%81%90%e8%be%a6%e6%b3%95\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced<\/span><\/a><span data-v-f87c67ca=\"\"> anti-money laundering rules in July 2021. Otherwise, the crypto industry remains largely unregulated.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There are still many crypto platforms that have a presence in Taiwan but have yet to declare AML compliance with the FSC,” Chiang said, adding that there’s little regulators can do if there’s no special law in place.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Chiang explained that it’d be unlikely for the special law to go through three readings during the current legislative session, which is expected to conclude by the end of this year. “An election is coming up, and the current legislative session focuses more on reviewing the government’s budget,” Chiang said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Taiwan’s FSC may also propose its own version of the special crypto law, but that would likely occur mid-2024 at the earliest, according to Chiang. “It's hard to say exactly when the special law will be enacted, but it should likely occur sometime after the middle of 2024.”<\/span>","<span data-v-f87c67ca=\"\">Damien Ho, representative of global partnerships of Binance, said at the same hearing that many crypto platforms in Taiwan still struggle to get access to suitable banking services. <\/span>","<span data-v-f87c67ca=\"\">Although the FSC’s banking bureau has previously asked banks to avoid treating crypto platforms as highly risky firms, “in reality we still face many difficulties interacting with banks,” Ho said.<\/span>","<span data-v-f87c67ca=\"\">“We also boldly suggest that the Taiwan government should encourage some private or public banks to become more crypto-friendly and handle [crypto firms’] relevant business,” Ho added. “This can help crypto businesses develop in a more regulated and effective manner.”<\/span>","<span data-v-f87c67ca=\"\">Binance did not immediately respond to a request for comment about its banking setup in Taiwan.<\/span> <span data-v-f87c67ca=\"\">The Block reported in August that Binance, the world’s largest crypto exchange, is <\/span><a href=\"https:\/\/www.theblock.co\/post\/244320\/binance-is-applying-to-get-registered-in-taiwan-for-aml-compliance-sources\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">applying to get registered in Taiwan for AML compliance<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Binance is not regulated in Taiwan, the exchange has formed a local entity named “Binance International Limited Taiwan Branch (Seychelles),” according to the Department of Commerce’s <\/span><a href=\"https:\/\/findbiz.nat.gov.tw\/fts\/query\/QueryBar\/queryInit.do?banNo=94042691\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">database<\/span><\/a><span data-v-f87c67ca=\"\">. The registration information showed that the government approved Binance’s company registration on May 12, 2023, with a registered capital of NT$30 million ($933,000) in Taiwan.<\/span>","<span data-v-f87c67ca=\"\">At the public hearing today, Winston Hsiao, cofounder and Group CRO of Taipei-based crypto exchange XREX, said that compliance is a must for the crypto industry but it needs to be done “step-by-step.”<\/span>","<span data-v-f87c67ca=\"\">“If we must discuss the special law at this stage, we hope that the law could regulate crypto platforms by their sizes,” Hsiao said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Small-scale entities should be regulated by the self-supervisory rules formulated by the industry association after registration, according to Hsiao. For large-scale entities, they should get a permit, under the special law, and perhaps apply for other relevant financial licenses, he added.<\/span>","Yung-Chang Chiang, a member of the Legislative Yuan, spoke at a public hearing on Oct. 6. Image: the Legislative Yuan","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 6","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Taiwan","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Chiang","content":"ORGANIZATION"},{"type":"FSC","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"May 12, 2023","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Department of Commerce","content":"ORGANIZATION"},{"type":"NT$30 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Taipei","content":"LOCATION"},{"type":"Hsiao","content":"PERSON"},{"type":"Damien Ho","content":"PERSON"},{"type":"$933,000","content":"MONEY"},{"type":"Binance","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Seychelles","content":"LOCATION"},{"type":"Winston Hsiao","content":"PERSON"},{"type":"Chang Chiang","content":"PERSON"},{"type":"Binance International Limited Taiwan Branch","content":"ORGANIZATION"},{"type":"Chiang","content":"PERSON"},{"type":"Taiwan’s <\/span><span data-v-f87c67ca=\"\">Financial Supervisory Commission","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"}],"hashtag":["ASIAN PARLIAMENTS","ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}