{"summary":"SEC Chair Gary Gensler said Wednesday that agency staff is continuing to review multiple applications for spot bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258226\/sec-chair-gensler-says-agency-staff-doing-work-on-multiple-bitcoin-etf-filings","publishDate":"2023-10-18T13:15:51","id":11451,"type":null,"title":"SEC Chair Gensler says agency staff &#x27;doing work&#x27; on multiple bitcoin ETF filings","category":["COMPANIES"],"content":["Securities and Exchange Commission Chair Gary Gensler didn't provide too many new details on Wednesday when asked about the status of multiple applications for spot bitcoin ETFs the agency is reviewing, but he did say staff is continuing its review.","\"I'm not going to pre-judge,\" he said in an <a href=\"https:\/\/twitter.com\/JSeyff\/status\/1714674199795544412\" data-v-f87c67ca=\"\">interview<\/a> with <a href=\"https:\/\/www.youtube.com\/watch?v=TV2-UJWwMiE\" data-v-f87c67ca=\"\">Bloomberg TV<\/a>. \"The staff is doing work on those multiple filings.\"","Gensler declined to comment when asked about the next steps in the regulator's ongoing case against <a href=\"https:\/\/www.theblock.co\/post\/258206\/grayscale-chief-legal-officer-says-spot-bitcoin-etf-is-a-matter-of-when-not-if\" data-v-f87c67ca=\"\">Grayscale Investments<\/a> after it decided not to appeal a court ruling last month. He also wouldn't say if the agency would potentially approve a single fund or wait to approve everything in a group, should such an approval come.","The SEC&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/253506\/sec-moves-to-again-delay-decision-on-valkyrie-spot-bitcoin-etf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">last month<\/a> instituted additional proceedings to determine whether proposed spot bitcoin ETFs from big name asset managers including BlackRock, Invesco, Valkyrie and Fidelity should be approved or disapproved, in apparent additional delays that will add at least another month to the review processes underway.&nbsp;","\"What we have in front of us, just so that the viewing public understands, we have not one, but multiple, I think it's eight or ten filings that the staff, and ultimately the Commission, is considering,\" he said. \"When an asset manager is seeking to take something public, these exchange traded products need to register with the SEC, and they go through a filing, somewhat similar to going public, like an IPO.\"","\"And so it's really the work of our Division of Corporation Finance that gives feedback, our Division of Trading and Markets of course looks at the filings,\" he continued. \"This is a time tested process that goes back decades. The staff of the SEC, it's called the Disclosure Review Team, but in that group, they respond and give feedback to potential issuers.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bloomberg TV","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Division of Corporation Finance","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Disclosure Review Team","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Nathan Crooks","The Block"]}