{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27217\/two-companies-with-similar-names-face-legal-battle-for-their-domain","publishDate":"2019-06-14T13:00:40","id":11456,"type":null,"title":"Two companies with similar names face legal battle for their domain","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","<em data-v-f87c67ca=\"\">As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".<\/em>","This is a case of a blockchain company enforcing its trademark rights against a non-blockchain company. As you might recall, not that long ago the Crypto Caselaw Minute&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-29-3-28-2019-1347d8ab2e52\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/crypto-caselaw-minute\/crypto-caselaw-minute-29-3-28-2019-1347d8ab2e52\" data-v-f87c67ca=\"\">covered the inverse scenario<\/a>&nbsp;where an established firm was suing a blockchain startup. The times they are a changing. Okay, what are the particulars here, and is Ownum suing itself? No.","Ownum,&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">LLC<\/em>&nbsp;is an Ohio-based blockchain company that is developing products and services for managing titles to vehicles, birth and death records, as well as other vital and\/or governmental records. Ownum, LLC has four different operating units: CHAMPtitles, Vital Chain, DigiCredits, and Tech Tags. Apparently, Ownum, LLC started out as CHAMPtitles, for which they own a trademark, and then on May 11, 2018 they officially changed their company name to Ownum. May 28, 2018, they file for a trademark on the word Ownum, and on January 15, 2019, the USPTO issued a Notice of Allowance for the Ownum mark directed to software solutions for managing the aforementioned types of documents. The complaint is filled with about six pages of evidence showcasing the Ownum trademark in various press releases, social media postings, and other items to hammer home the association of the name Ownum with the Ownum business lines.","Ownum,&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Inc.<\/em>&nbsp;is a Delaware based corporation that sells software that helps people manage their medications. Ownum, Inc. was incorporated March 7, 2019, and is the owner of the domain name ownum.com. That domain name is where all the trouble here began.","Generally speaking, trademark law exists to identify the source of goods and services. It is an ancient body of law tracing back to the practice of craftsman affixing their own personal marks on their wares as a Proof of Origin™. In our current age an owner of a trademark has certain rights in that mark, and is able to bring a cause of action against others when they are engaging in practices that may cause cause confusion amongst consumers, as well as activities that might dilute the mark, or diminish its value.","Returning to the domain name issue, allegedly Ownum, LLC had a business meeting recently where the potential partner thought that Ownum, LLC was in the medication business because they had visisted ownum.com. In April, Ownum, LLC approached Ownum, Inc. to buy the domain name, and put them on notice of Ownum, LLC’s trademark, Ownum. Ownum, Inc. did not respond to that request, but when Ownum, LLC approached them again in May 2019 Ownum, Inc. demanded $1,000,000 for the ownum.com domain. That’s a lot. Negotiations were not fruitful, and now there is a lawsuit.","Ownum, LLC is alleging that Ownum, Inc. registered the domain name in bad faith with the intent to play off the publicity surrounding Ownum, LLC, that the value of their Ownum trademark is diminished\/diluted, and that Ownum, Inc. is also violating their rights in a CHAMPtitles trademark, because of a design on the Ownum, Inc. website. Ownum, LLC is asking the court to grant a preliminary and permanent injunction to stop Ownum, Inc. from using the Ownum name, as well as seeking damages and any profits that Ownum, Inc. received as part of using the name.","Now, you may be asking yourself, why didn’t Ownum, LLC already own the ownum.com domain? Great question! They instead own the domain ownum.io. Oops. Gobble up as much of that digital real estate when you start\/rebrand your company, so you can avoid the headache of a lawsuit later on.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ownum,&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Inc.","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"Ownum","content":"PERSON"},{"type":"$1,000,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Ownum","content":"LOCATION"},{"type":"Inc.","content":"ORGANIZATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Ohio","content":"LOCATION"},{"type":"March 7, 2019","content":"DATE"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Ownum, Inc.","content":"ORGANIZATION"},{"type":"May 28, 2018","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"May 11, 2018","content":"DATE"},{"type":"Palley","content":"PERSON"},{"type":"Tech Tags","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"May 2019","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"January 15, 2019","content":"DATE"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}