{"summary":"Bitcoin&#x27;s price briefly dipped below $29,000 for the first time in a month on Monday amid headwinds from expected rate hikes this week at the Federal Reserve and the European Central Bank.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241087\/bitcoin-price-falls-ahead-of-anticipated-fed-and-ecb-rate-hikes","publishDate":"2023-07-24T12:42:02","id":11458,"type":null,"title":"Bitcoin price falls ahead of anticipated Fed and ECB rate hikes","category":["MARKETS"],"content":["Bitcoin's price briefly dipped below $29,000 for the first time in a month on Monday amid headwinds related to expected rate hikes this week at the <a href=\"https:\/\/www.theblock.co\/post\/207663\/federal-reserve-raises-interest-rates-by-25-basis-points-as-expected\" data-v-f87c67ca=\"\">Federal Reserve<\/a> and European Central Bank.","The price of the world's largest crypto currency fell 2.9% over the past 24 hours to $29,044 at 12:22 p.m. in New York, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","On Wednesday, the <a href=\"https:\/\/www.theblock.co\/post\/221220\/what-fed-interest-rate-decision-means-for-crypto\" data-v-f87c67ca=\"\">Federal Open Market Committee<\/a> will announce its next rate decision, with analysts expecting a hike of 25 basis points to bring its target range to 5.25-5.50%. On Thursday, the ECB is expected to raise rates by 25 basis points to 4.25%.","Investors will pay close attention to the wording of the Fed's post-rate decision statement. Should hawkish sentiments persist, bitcoin's consolidation around the $29,000 mark might face downward pressure.","\"Bitcoin headwinds emerge from the anticipated rate hikes from both the Federal Reserve and the European Central Bank this week,\" Jeff Feng, co-founder of Sei Labs, told the Block. \"These monetary adjustments, though typical counter-inflationary measures, could indirectly challenge bitcoin's attractiveness as an inflation hedge.\"","However, Feng added the expectations could already be priced in by savvy market participants.","\"The recent data showing better-than-expected inflation numbers has the potential to result in a more positive outlook on the market, possibly reinvigorating bullish sentiment in both the crypto and tech stock sectors, despite the rate hikes,\" he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Jeff Feng","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2.9%","content":"PERCENT"},{"type":"ECB","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"5.50%","content":"PERCENT"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"12:22 p.m.","content":"TIME"},{"type":"New York","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"4.25%","content":"PERCENT"},{"type":"$29,000","content":"MONEY"},{"type":"$29,044","content":"MONEY"}],"hashtag":["CRYPTO"],"authors":["Brian McGleenon","The Block"]}