{"summary":"Crypto derivatives exchange FTX has launched its equity token today, which can be purchased via bitcoin and other payment methods \nOne equity token costs $2, and the minimum purchase size is $250,000\nFTX CEO Sam Bankman-Fried told The Block that the equity token helps small investors to get a stake in the company","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56865\/crypto-derivatives-exchange-ftx-is-selling-its-equity-for-bitcoin-and-other-payment-methods","publishDate":"2020-02-25T03:45:19","id":1145,"type":null,"title":"Crypto derivatives exchange FTX is selling its equity for bitcoin and other payment methods","category":["Exchanges"],"content":["Crypto derivatives exchange FTX has today launched its equity token, which represents an ownership stake in FT Trading Ltd, the Antigua-based owner of FTX.","One equity token costs $2, and the minimum purchase size is $250,000, FTX <a href=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/360039744492-FTX-Equity\" data-v-f87c67ca=\"\">announced<\/a> Tuesday. The sale of the token is expected to end between March 1 and 7, depending on supply and demand.","FTX CEO Sam Bankman-Fried told The Block that the equity token helps small investors to get a stake in the company, as the minimum purchase size via the standard route is $2.5 million.","Last week, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/56519\/crypto-derivatives-exchange-ftx-15-million-1-billion\" data-v-f87c67ca=\"\">The Block exclusively reported<\/a> that FTX is seeking to raise as much as $30 million in an equity round at a $1 billion valuation. Accordingly, the soft cap of the equity token sale is $30 million, Bankman-Fried told The Block today, adding that the hard cap could top $50 million.","There is, however, no maximum investment cap for small investors, he said.","<strong data-v-f87c67ca=\"\">Strings attached<\/strong>","But there are various terms and conditions attached to the FTX equity token. Firstly, it is currently not tradeable on any exchanges and is not withdrawable. FTX said it would \"strongly\" consider the trading of the token \"over the next few years.\" It is, however, unlikely that the token will begin trading as it would require licenses in multiple jurisdictions.&nbsp;","Secondly, the token does not give the same voting rights as equity shares in FT Trading Ltd. And lastly, while the token does provide ownership of the FTX exchange, leveraged tokens and potential white labels of FTX, it does not grant ownership of FTX's \"utility token\" FTT or any potential onshore U.S. operations.","Users should, therefore, read all terms in detail before clicking on the purchase option. The token can be bought via FTX wallet, and the supported methods are U.S. dollar, bitcoin (BTC), FTT and other tokens. Selling equity for bitcoin is quite an unprecedented move. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThere is also a small discount of 1% for purchasing with FTT, Bankman-Fried told The Block, meaning that users could end up getting the equity token for $1.98‬ versus $2.","Notably, the equity token is not available to residents of the U.S. and other prohibited jurisdictions.","<strong data-v-f87c67ca=\"\">'Significant' expansion plans<\/strong>","Hong Kong-based FTX launched operations in early 2019 and appears to be growing fast. According to data from Skew, the exchange is currently ranked seventh in terms of open interest.","FTX has \"significant\" expansion plans ahead, Bankman-Fried told The Block last week. \"We're looking to expand more generally into tokenized products and trading, and expand to many markets at once, including significant parts of east and southeast Asia and Eastern Europe,\" he said.","It remains to be seen how much FTX ends up raising via its equity token sale. Last August, the exchange raised $8 million via FTT token sale. Following that sale, FTX raised \"tens of millions\" in an equity round from Binance in December.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhen asked why investors would prefer equity over the FTT token, Bankman-Fried told The Block last week: \"FTT has more short-term liquidity whereas equity has a larger ultimate economic stake in the company.\""],"hashtag":["FTX","SAM BANKMAN-FRIED","TOKENS"]}