{"summary":"The NFT lending platform wants to incentivize liquidators to bid on NFT collateral from bad debt positions placed on auction.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164828\/nft-lender-benddao-begins-vote-to-change-protocol-amid-liquidity-crisis","publishDate":"2022-08-22T12:06:01","id":11450,"type":null,"title":"NFT lender BendDAO begins vote to change protocol amid liquidity crisis","category":["GOVERNANCE"],"content":["The BendDAO community is currently <a href=\"https:\/\/snapshot.org\/#\/benddao.eth\/proposal\/0x055c065c8f088b123590d904786d2b7511f9520cee06b2fb93b5b9fcbd62790b\" data-v-f87c67ca=\"\">voting<\/a> to make short-term changes to the non-fungible token (NFT) lending platform as the project tries to navigate a brewing liquidity crisis.","“We are sorry that we underestimated how illiquid NFTs could be in a bear market when setting the initial parameters […] After a comprehensive review and discussion, it’s time to make a proposal to help ETH depositors to build confidence,” the proposal stated.","BendDAO is an NFT lending platform. Lenders deposit ether (ETH) to earn interest and borrowers can obtain loans using their NFTs as collateral.","BendDAO supports seven major NFTs as collateral, including Bored Ape Yacht Club, Mutant Ape Yacht Club, CryptoPunks, Azuki and CloneX. Several borrowers have defaulted on their loans due to the rising interest rates for loans on the platform and the <a href=\"https:\/\/www.theblock.co\/post\/164811\/youve-been-punkd-cryptopunks-takes-top-pricing-spot-from-bored-apes\" data-v-f87c67ca=\"\">declining floor price value<\/a> of their NFTs.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/floor-price-of-art-and-collectibles-nfts\/embed\" title=\"Floor Price of Popular NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Lenders worried about the project’s health have withdrawn their funds from the platform. The NFTs put up as collateral for defaulted loans are now in danger of liquidation. Some items are already up for <a href=\"https:\/\/www.benddao.xyz\/app\/auction\/loans-in-auction\" data-v-f87c67ca=\"\">auction,<\/a> but the demand is minimal.","There are a few reasons for the low demand. For one, BendDAO’s protocol mandates starting bids that are higher than the value of the debt and 95% of the floor price of the underlying NFT collateral. Secondly, liquidators in the auction must also lock up their ETH for 48 hours. Both parameters are not attractive to liquidators as the value of the debt can be higher than the floor price, making the deal unviable.","Today’s vote, which will end on Tuesday, is looking to change these parameters. The vote has called for a 5% reduction in the liquidation threshold on a weekly rolling basis. This change will begin with 85% on August 30 up until 70% on September 20.","This threshold refers to the spread between the floor price and the starting bid that liquidators can place when an NFT from a defaulted loan goes into auction. The vote also called for the auction lock-up period to be reduced from 48 hours to 4 hours.","Early voting figures are indicating support for the vote. BendDAO community members with 20 million veBEND tokens in total have voted in favor of the proposal and this amounts to 98% approval for the protocol changes.","BEND is the protocol’s native token and veBEND is the staked version of the token that gives voting rights to the holder. The vote will pass if those in support can amass up to 47 million veBEND tokens in the polls.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 20","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"August 30","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"98%","content":"PERCENT"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"95%","content":"PERCENT"}],"hashtag":["LENDING"],"authors":["Osato Avan-Nomayo","The Block"]}