{"summary":"Security Alliance provides a 24\/7 emergency hotline for crypto cyber crime victims, legal protection for white hat hackers and more.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277541\/paradigms-white-hat-hacker-samczsun-spearheads-crypto-security-operation-called-security-alliance","publishDate":"2024-02-14T13:32:12","id":11465,"type":null,"title":"Paradigm&#x27;s white hat hacker Samczsun spearheads crypto security operation called Security Alliance","category":["SECURITY"],"content":["A white hat hacker pseudonymously known as <a href=\"https:\/\/www.paradigm.xyz\/team\/samczsun\" data-v-f87c67ca=\"\">Samczsun<\/a>, who is also Head of Security at the crypto venture firm Paradigm, has created a new crypto security operation.&nbsp;","The <a href=\"https:\/\/securityalliance.org\/\" data-v-f87c67ca=\"\">Security Alliance<\/a>, also known as SEAL Org, allows crypto users affected by a hack or other security incident access to a 24\/7 emergency hotline. The platform also gives white hat hackers legal protection when rescuing funds under active exploit and provides web3 developers free red team exercises, which simulate an adversarial cyber attack against an organization's systems to ascertain vulnerabilities and prepare efficient responses.","\"It all started from the Nomad hack,\" Samczsun <a href=\"https:\/\/twitter.com\/samczsun\/status\/1757784867163832397\" data-v-f87c67ca=\"\">explained<\/a> in a Wednesday social media thread. Nomad is a crypto bridge that experienced a <a href=\"https:\/\/www.theblock.co\/post\/160851\/nomads-190-million-bridge-exploit-drew-hacking-feeding-frenzy-of-300-addresses\" data-v-f87c67ca=\"\">$190 million<\/a> exploit, comprised of hundreds of bad actors, in August 2022.&nbsp;","\"The war room was stressful, and the security community collectively looked back and wondered, 'how did we get to a point where random people felt comfortable stealing money from the bridge, but white hats felt it was too risky to intervene?'\" Samczsun continued.","<span class=\"s1\" data-v-f87c67ca=\"\">Donors and partners for Security Alliance include the Ethereum Foundation, a16z crypto, Paradigm, Vitalik Buterin, Filecoin Foundation, Coinbase, Dragonfly, Framework, Electric Capital and others, according to its website.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$190 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Samczsun","content":"LOCATION"},{"type":"August 2022","content":"DATE"},{"type":"Filecoin Foundation","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Paradigm","content":"LOCATION"},{"type":"Security Alliance","content":"ORGANIZATION"},{"type":"Head of Security","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Dragonfly","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["MK Manoylov","The Block"]}