{"summary":"The sale, hosted by Sotheby&#x27;s Hong Kong, will go live on July 9. Buyers have the option of paying in Ether, Bitcoin or fiat. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/109136\/sothebys-diamond-auction-bitcoin-ether","publishDate":"2021-06-21T11:00:36","id":11468,"type":null,"title":"Sotheby&#x27;s to accept crypto for extremely rare diamond valued at $10-15M","category":["CRYPTOCURRENCY"],"content":["Remember that age-old saying about diamonds being a girl's best friend?","Luxury auction house Sotheby's might just flip that notion over its head because it's auctioning off a 101-carat diamond to just about anybody, provided you have as much as $15 million dollars – be it in ether, bitcoin or traditional currency – to spare.","That's the price the auction house estimates its \"101.38-carat pear-shaped flawless diamond\" will fetch in an auction it is hosting early next month.&nbsp;","According to Sotheby's, this is the first time a physical object this valuable will ever be publicly offered for purchase with cryptocurrency.","100-carat diamonds are considered extremely rare, particularly those that are pear-shaped. This diamond, which Sotheby's is calling \"The Key 10138,\" is the second-largest pear-shaped diamond to appear on the public market.&nbsp;","The diamond will be auctioned off in a single-lot live sale at Sotheby's Hong Kong on July 9. The gem will be on public display at Sotheby's Hong Kong gallery for one week leading up to the auction.&nbsp;","Chairman of Sotheby’s Asia Patti Wong called the upcoming sale a \"truly symbolic moment.\"","\"The most ancient and emblematic denominator of value can now, for the first time, be purchased using humanity’s newest universal currency,\" she said in a statement.","“Over the past year, we’ve seen a voracious appetite for jewels and other luxury items from collectors across the globe. Increasingly that demand is coming from a younger, digitally native generation; many of whom are in Asia,\" said Josh Pullan,&nbsp; managing director of Sotheby's global luxury department.&nbsp;","The diamond will be the \"highlight\" of the auction house's Luxury Edit series in Hong Kong, which will include jewelry, watches, handbags, and rare sneakers.","According to Pullan, accepting payments in Ether and Bitcoin is part of the auction house's \"commitment to innovation.\"&nbsp;","Indeed, this is hardly the first time Sotheby's has hosted an auction that involves blockchain technology in some way. &nbsp;The auction house sold its&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/100683\/sothebys-nft-auction-pak-artist\" data-v-f87c67ca=\"\">first NFT<\/a> by anonymous digital artist Pak in April, and its second NFT just two weeks ago, selling a rare CryptoPunk for nearly <a href=\"https:\/\/www.theblockcrypto.com\/post\/108186\/rare-alien-cryptopunk-fetches-11-8-million-in-sothebys-auction\" data-v-f87c67ca=\"\">$12 million<\/a>. And on June 23, Sotheby's is auctioning off an NFT of the World Wide Web's original source code.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sotheby","content":"ORGANIZATION"},{"type":"July 9","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Josh Pullan","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$15 million dollars","content":"MONEY"},{"type":"Sotheby's","content":"ORGANIZATION"},{"type":"Asia Patti Wong","content":"PERSON"},{"type":"two weeks ago","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Pullan","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"June 23","content":"DATE"}],"hashtag":["BITCOIN","CRYPTO"],"authors":["Saniya More","The Block"]}