{"summary":"The case against the &quot;Razzlekhan&quot; rapper accused of laundering bitcoin will include classified information, according to a new court order.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188601\/razzlekhan-bitcoin-laundering-case-to-include-classified-information","publishDate":"2022-11-19T13:41:39","id":11462,"type":null,"title":"‘Razzlekhan’ bitcoin laundering case to include classified information","category":["LEGAL"],"content":["The story of the “Razzlekhan” rapper who allegedly laundered billions in stolen bitcoin with her husband has taken another twist: The trial will include classified information.","A district court judge signed a protective order in the case, indicating it will involve “classified national security information” that can only be accessed by people with security clearance.","“The Court finds that this case will involve classified national security information, the storage, handling, and control of which, by law or regulation, requires special security precautions, and access to which requires a security clearance and a need-to-know,” the filing says.","Heather Morgan, known by her rapper name “Razzlekhan,” and her husband and co-defendant Ilya Lichtenstein, are accused of laundering $4.5 billion in stolen bitcoin. The pair were <a href=\"https:\/\/www.theblock.co\/linked\/133499\/us-government-seizes-3-6-billion-in-bitcoin-tied-to-2016-hack-of-crypto-exchange-bitfinex\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">arrested<\/span><\/a> in February and charged with conspiracy to commit money laundering and conspiracy to defraud the United States. The accusations are tied to the 2016 hack of crypto exchange Bitfinex.","The new classified information filing, known as a Classified Information Procedures Act Protective Order, was signed by U.S. District Court for the District of Columbia Chief Judge Beryl Howell. The order covers information that has been classified by the Executive Branch as “secret,” “top secret” or “sensitive compartmented information.”","The order designated Daniella Medel as the classified information security officer in the case and named several alternate officers who can provide security arrangements. Unauthorized use or disclosure of classified information could violate criminal law, the order warned.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"“Razzlekhan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"The Court","content":"ORGANIZATION"},{"type":"$4.5 billion","content":"MONEY"},{"type":"Heather Morgan","content":"PERSON"},{"type":"Beryl Howell","content":"PERSON"},{"type":"Daniella Medel","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"the District of Columbia","content":"ORGANIZATION"},{"type":"Ilya Lichtenstein","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}