{"summary":"Research and development firm Delphi Labs and the Astroport Foundation have rolled out a inscriptions platform for the Cosmos Hub network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273343\/delphi-labs-astroport-foundation-introduce-asteroid-protocol-enabling-inscriptions-on-cosmos-hub","publishDate":"2024-01-18T07:36:23","id":11460,"type":null,"title":"Delphi Labs introduces Asteroid protocol, enabling inscriptions on Cosmos","category":["CRYPTO ECOSYSTEMS"],"content":["Research and development firm Delphi Labs and the Astroport Foundation have rolled out a inscriptions platform for the Cosmos Hub network, named Asteroid.","Inscriptions are a novel way to embed data onto blockchains without native support for smart contracts. Asteroid uses Cosmos transaction call data for inscribing new tokens into existence called “CFT-20s.”","Asteroid contributors released the first CFT-20 token, <a href=\"https:\/\/asteroidprotocol.io\/app\/tokens\" data-v-f87c67ca=\"\">Asteroids (ROIDS)<\/a>, as a proof of concept on Tuesday. The token — with a total supply of 100 million — was inscribed quickly by users within a few hours. Each ROIDS token is trading at $0.045, giving it a $4.5 million market capitalization at the time of writing.","According to Delphi Labs, Cosmos inscriptions via Asteroid open doors for various applications beyond tokenization and into data storage. It also provides a “metaprotocol” framework that can allow additional apps to be developed.","“The biggest thing people are missing with Asteroid is that it is designed to be a generalized metaprotocol framework,” <a href=\"https:\/\/twitter.com\/lukedelphi\/status\/1747611968041607492\" data-v-f87c67ca=\"\">noted<\/a> Delphi Labs CTO Luke Saunders. “Images and tokens are just the first two use cases, but much more is possible.”","In addition to Asteroid, Delphi Labs backs two DeFi platforms — Astroport and Mars Protocol — within the Cosmos ecosystem.","Inscriptions were introduced in early 2023 with the Ordinal protocol, which allows users to inscribe data — such as NFTs and images — onto individual satoshis on the Bitcoin blockchain.","Over the second half of 2023, inscriptions rapidly <a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why\" data-v-f87c67ca=\"\">expanded<\/a> to Ethereum Virtual Machine (EVM)-compatible chains like BNB Smart Chain, Polygon, Arbitrum, Avalanche, and Fantom.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delphi Labs","content":"ORGANIZATION"},{"type":"Luke Saunders","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Delphi Labs CTO","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$4.5 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Fantom","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Astroport Foundation","content":"ORGANIZATION"},{"type":"$0.045","content":"MONEY"},{"type":"second half of 2023","content":"DATE"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}