{"summary":"The VC firm released the new index alongside its similarly named State of Crypto report, which highlights what it sees as trends shaping the blockchain sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225539\/a16z-state-of-crypto-index","publishDate":"2023-04-11T09:03:44","id":11466,"type":null,"title":"a16z unveils &#x27;state of crypto&#x27; index as part of its look at the industry in 2023","category":["COMPANIES"],"content":["a16z Crypto, the web3 investment arm of Andreessen Horowitz, unveiled its new \"State of Crypto\" index, which paints a rosier picture of the nascent market than most price charts offer.&nbsp;","The venture investor, which has backed companies and projects such as dYdX, LazerZero and Dapper Labs, released the new index alongside its similarly named State of Crypto report.","The index factors in several so-called adoption and innovation parameters, including the number of active developers, mentions of crypto in academic research, and volumes across decentralized exchange venues. It doesn't include more unsavory data points like bankruptcies, blockchain hacks, or regulatory enforcement actions.","While the price of bitcoin is down some 55% off its highs clocked in during 2021, a16z's index declined by 25%. Looking at specific parameters, the number of active developers has declined by 25% from all-time highs, while the number of transactions across blockchains declined from 1.3 billion to around 1.17 billion—a decline of just 10%.","","","<em data-v-f87c67ca=\"\">Source: a16z crypto<\/em>","To be clear, not all parameters hold steady, with the number of wallet users and volumes across decentralized exchanges down sharply from last year.","Still, <a href=\"https:\/\/a16z.com\/\" data-v-f87c67ca=\"\">a16z<\/a> — which has a vested interest in making the <a href=\"https:\/\/www.theblock.co\/post\/196118\/a16zs-chris-dixon-on-the-state-of-the-crypto-market-exclusive\" data-v-f87c67ca=\"\">crypto market<\/a> appear robust — is attempting to illustrate the dichotomy between market cycles and product cycles, according to the firm's chief technology officer Eddy Lazzarin.&nbsp;","\"Speculative cycles work differently than product cycles,\" Lazzarin said in an interview.\"If there is a product cycle and compounding tech progress then you should be able to see data that underpins that reality.\"","Lazzarin pointed to the \"radical acceleration\" of Ethereum scaling solutions and zero-knowledge systems, the cryptographic tools that verify information without revealing the information's exact nature.","\"We’re seeing decades-in-the-making work on 'zero knowledge' systems advance at a staggering pace, unlocking blockchain scalability and a new category of privacy-protecting applications,\" a16z noted in press materials.&nbsp;","","","<em data-v-f87c67ca=\"\">Source: a16z crypto<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1.17 billion","content":"MONEY"},{"type":"Lazzarin","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Eddy Lazzarin","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"55%","content":"PERCENT"},{"type":"\"State of Crypto\"","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}