{"summary":"Malaysia Securities Commission has taken enforcement action against Huobi Global and its CEO Leon Li for operating illegally in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231664\/huobi-malaysia-enforcement-action","publishDate":"2023-05-22T04:52:16","id":11471,"type":null,"title":"Huobi Global told to stop operations in Malaysia by Securities Commission","category":["COMPANIES"],"content":["The Securities Commission (SC) of Malaysia ordered Huobi Global Limited to wind down operations in the country as it had been operating its crypto exchange without registration. The SC took action against both Huobi and its CEO Leon Li for operating illegally in Malaysia.","\"This decision comes after concerns about the platform's compliance with local regulatory requirements and protecting investors' interests,\" <a href=\"https:\/\/www.sc.com.my\/resources\/media\/media-release\/sc-takes-enforcement-action-against-huobi-global-for-illegally-operating-dax-in-malaysia\" data-v-f87c67ca=\"\">the regulator said Monday<\/a>. It added that operating a digital asset exchange without being registered is an offense under section 7(1) of the Capital Markets and Services Act 2007.","The Malaysian SC said Huobi must disable its website and mobile apps in the country as well as cease any advertisements to Malaysian investors. \"Leon Li, as the CEO, has also been specifically ordered to ensure that the above directives are carried out,\" the regulator said. The SC urged Huobi's Malaysian users to withdraw all their investments from the platform and close their accounts.","Justin Sun, founder of Tron and \"advisor\" to Huobi, told The Block that Huobi currently does not operate in Malaysia. He added that Leon isn't the CEO of Huobi and the company currently doesn't have a CEO role.","\"In response to recent reports, we would like to clarify that the situation outlined pertains to the previous Huobi entity and former shareholders. This is not associated with the current Huobi platform, which adheres to strict regulatory compliance globally,\" Sun said of the SC enforcement action. \"We're committed to providing a safe, secure, and compliant trading environment for our users worldwide.\"","In October 2022, <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Huobi <a href=\"https:\/\/www.theblock.co\/post\/175691\/huobi-will-be-acquired-by-hong-kong-based-about-capital-management\" data-v-f87c67ca=\"\">announced<\/a> that<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> “the controlling shareholder” of the company had agreed to sell its stake to Hong Kong-based investment company About Capital Management’s M&amp;A fund. While Huobi did not name the controlling shareholder, the news came after reports that claimed Leon was seeking a buyer for his nearly 60% stake in the company and was asking for at least $1 billion. While reports claimed that Sun, who clearly has a significant role in the exchange, was the real buyer of the exchange, he <a href=\"https:\/\/www.theblock.co\/post\/175867\/justin-sun-denies-being-real-buyer-of-huobi-stake-sale-exclusive\" data-v-f87c67ca=\"\">continues<\/a> to deny this.<br data-v-f87c67ca=\"\">\n<\/span>","The SC enforcement action comes as Sun <a href=\"https:\/\/www.theblock.co\/post\/231526\/justin-sun-houbi-memecoins\" data-v-f87c67ca=\"\">aims to revitalize Huobi by listing memecoins<\/a>. Sun recently also <a href=\"https:\/\/www.theblock.co\/post\/231057\/justin-sun-huobi-founder-brother-ht-token\" data-v-f87c67ca=\"\">accused<\/a> Li's younger brother Li Wei of receiving millions of free Huobi (HT) tokens and profiting $7.45 million in the process. Sun wants Wei to return the profit and wants to destroy his remaining tokens as he has no role to play in Huobi's development.","Founded in 2013, Huobi is the fourth largest crypto exchange in the world by trading volumes, <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\">according to The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Li Wei","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Malaysia","content":"LOCATION"},{"type":"Leon Li","content":"PERSON"},{"type":"2007","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"October 2022","content":"DATE"},{"type":"$7.45 million","content":"MONEY"},{"type":"Securities Commission (SC","content":"ORGANIZATION"},{"type":"Huobi Global Limited","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"About Capital Management","content":"ORGANIZATION"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Leon","content":"PERSON"},{"type":"Huobi","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Huobi","content":"PERSON"}],"hashtag":["CRIME","HTX","LAWSUITS"],"authors":["Yogita Khatri","The Block"]}