{"summary":"Shares are down 9% following the news of the lawsuit on Friday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196395\/silvergate-shares-slide-after-lawsuit-accuses-the-bank-of-playing-an-integral-role-in-ftx-fraud","publishDate":"2022-12-19T14:21:04","id":11478,"type":null,"title":"Silvergate shares slide after lawsuit accuses the bank of playing an &#x27;integral&#x27; role in FTX fraud","category":["COMPANIES"],"content":["Silvergate shares <a href=\"https:\/\/www.theblock.co\/post\/195893\/class-action-lawsuit-claims-silvergate-played-role-in-ftx-fraud\" data-v-f87c67ca=\"\">slumped<\/a> 9% following the announcement of a lawsuit against the bank for its alleged \"integral\" role in Sam Bankman-Fried's FTX exchange.&nbsp;","The stock is trading near an all-time low. Peer crypto stocks were also lower, with Robinhood down 5.9% and Coinbase lower by 3.7% at 2:12 p.m. ET.","The lawsuit, which is seeking class action status, argues that the crypto bank is liable in the alleged fraud at the collapsed FTX exchange because it maintained accounts for the collapsed exchange and sister trading firm Alameda Research, aiding and abetting breach of fiduciary duty.","Filed in the U.S. District Court for the Southern District of California, the lawsuit claims Silvergate had \"plain sight\" of crimes being committed because of the numerous accounts it held for FTX Ltd., FTX US and Alameda.","FTX founder and former CEO Sam Bankman-Fried was arrested on Dec. 12 in the Bahamas on charges that include wire fraud, wire fraud conspiracy, securities fraud, securities fraud conspiracy and money laundering.","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"5.9%","content":"PERCENT"},{"type":"3.7%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"2:12 p.m. ET","content":"TIME"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"the Southern District of California","content":"ORGANIZATION"},{"type":"Dec. 12","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FTX Ltd.","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}