{"summary":"Over 18,000 qualified participants will receive 22.3% of HAI&#x27;s governance token KITE on Feb. 12 through the airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276100\/stablecoin-protocol-hai-to-have-airdrop-ahead-of-mainnet-launch-on-optimism","publishDate":"2024-02-06T12:02:02","id":11484,"type":null,"title":"Stablecoin protocol HAI to have airdrop ahead of mainnet launch on Optimism","category":["CRYPTO ECOSYSTEMS"],"content":["The decentralized stablecoin and lending protocol HAI will have an airdrop next week prior to its mainnet launch on Optimism.&nbsp;","HAI will disseminate 22.3% of its governance token KITE to 18,034 qualified wallets, according to a statement. The airdrop will occur on Feb. 12, ahead of HAI launching on Optimism Mainnet on Feb. 20. Qualified users include Reflexer Protocol users, individuals who used the HAI testnet and Optimism governance participants holdings over 50 $OP who voted more than once, HAI founder Ameen Soleimani explained.&nbsp;","HAI is pinned to numerous decentralized crypto assets rather than fiat currency. It's a fork of RAI, a non-pegged Ethereum-based stablecoin born from the protocol Reflexer Finance. Reflexer lets people deposit crypto assets as a collateral to mint RAI, which stays stable via <a href=\"https:\/\/www.theblock.co\/post\/205078\/vitalik-buterin-closes-seven-month-short-trade-on-rai-token-netting-92000\" data-v-f87c67ca=\"\">algorithm<\/a>.","\"With HAI launching on Optimism, users receive all the benefits of RAI’s robust and resilient<br data-v-f87c67ca=\"\">\nsystem, but with the speed, scale and usability of Optimism,\" said Luke Hamilton, co-founder<br data-v-f87c67ca=\"\">\nof HAI. \"In this new era of truly decentralized stablecoins, HAI’s unique controlled-peg<br data-v-f87c67ca=\"\">\nmechanism will create the next generation of decentralized currency, resistant to economic<br data-v-f87c67ca=\"\">\nshifts and human error.\"","In addition to being a stablecoin protocol, HAI is a lending platform and DAO. KITE holders may determine which collateral types are included on the platform, change protocol parameters and take part in auctions.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Feb. 20","content":"DATE"},{"type":"Reflexer Finance","content":"ORGANIZATION"},{"type":"$OP","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"HAI","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Feb. 12","content":"DATE"},{"type":"Ameen Soleimani","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"22.3%","content":"PERCENT"},{"type":"Luke Hamilton","content":"PERSON"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}