{"summary":"After a large drop on Dec. 6, bitcoin mining difficulty is bound for a significant increase on Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195531\/bitcoin-mining-jumps-3-27-after-substantial-dip-what-does-luck-have-to-do-with-it","publishDate":"2022-12-19T10:22:10","id":11487,"type":null,"title":"Bitcoin mining jumps 3.27% after substantial dip. What does luck have to do with it?","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin mining difficulty in October <a href=\"https:\/\/www.theblock.co\/post\/175900\/bitcoin-mining-difficulty-jumps-to-all-time-high-levels\" data-v-f87c67ca=\"\">had its highest spike since last summer<\/a>, when China cracked down on the industry and forced mining firms to flee to other countries. Meanwhile, <a href=\"https:\/\/www.theblock.co\/post\/192142\/terms-service\" data-v-f87c67ca=\"\">its lowest ebb since then<\/a> was just a few days ago.&nbsp;","Now it's back up by 3.27%, according to the latest adjustment posted Monday by <a href=\"https:\/\/btc.com\/stats\/diff\" data-v-f87c67ca=\"\">BTC.com<\/a>. Why the yo-yoing? The reasons aren't completely clear to industry experts.","A probable explanation is the switching on and off of machines depending on spot energy prices and profitability, with more efficient models also being deployed. But it also might be a case of luck, said Daniel Frumkin, director of research at Braiins.","\"My theory is that the 'capitulation' that appeared to happen in the last epoch (leading to the Dec. 6 adjustment) was greatly overstated and it was really just a very 'unlucky' period of variance,\" he told The Block.","The difficulty adjustments are based on what is the average block time for that epoch, meaning the period in between. So it takes longer to mine those blocks, the network will assume that the hashrate has dropped and accordingly lower the difficulty.","In greater detail: Let's say you have 10% of the total network hashrate. That means you should be mining 10% of the blocks. However, due to the probabilistic nature of mining, you could be unlucky and only mine 5% just as you could be lucky and mine 15%, Ethan Vera, COO of Luxor, a bitcoin mining software company that runs a mining pool, said.","In theory, the entire industry could be lucky or unlucky. With the same amount of total network hashrate, it could hit 140 blocks one day and 150 blocks the next.","Vera said that while it's \"very likely\" that luck did have an effect on the 7.32% drop a few days ago, it's also very hard to know for certain \"what impact of the difficulty adjustment is coming from luck versus what is coming from actual right network hashrate changes.\"","Frumkin said the real-time hashrate was above 250 EH\/s for the entire month of November (unlike hashrate estimates), which is why he believes that the drop that happened on Dec. 6&nbsp;wasn't from that much hashrate coming offline. \"It could have just been an unprecedented event where there really was just bad luck by multiple pools all at the same time.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"It's also true that some miners were shutting off,\" Frumkin said. \"There's new hashrate coming on by more efficient miners and then there's hashrate going off.\"","\"Any time there’s extreme volatility in the price (of bitcoin), the same could be found with hashrate,\" said Kevin Zhang, senior vice president at mining pool Foundry. \"Recently, we had a really dynamic scenario of an immense amount of newer gen (higher efficiency) ASIC’s being deployed coupled with large miners capitulating with bankruptcies.\"","&nbsp;Miners without a fixed power agreement are at the whim of market prices and \"energy is really driving a lot of people's decisions,\" said Riot CEO Jason Les.","And although there is \"a lot of short-term variability in hashrate that's driven by spot energy prices,\" over the next six months hashrate will likely keep growing as companies continue to deploy efficient machines, Marathon's CEO Fred Thiel said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Frumkin","content":"PERSON"},{"type":"Ethan Vera","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Jason Les","content":"PERSON"},{"type":"Fred Thiel","content":"PERSON"},{"type":"7.32%","content":"PERCENT"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"3.27%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"Kevin Zhang","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Dec. 6","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"Daniel Frumkin","content":"PERSON"},{"type":"Luxor","content":"LOCATION"},{"type":"China","content":"LOCATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}