{"summary":"U.S.-based Borderless Capital accelerating LatAm expansion while adding CTF Capital&#x27;s proprietary trading technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284544\/borderless-captial-acquires-quant-firm-ctf-capital-plans-latam-hq-in-argentina","publishDate":"2024-03-26T08:31:05","id":11483,"type":null,"title":"Borderless Capital acquires quant firm CTF Capital, plans LatAm HQ in Argentina","category":["MERGERS & ACQUISITIONS"],"content":["U.S.-based, crypto-focused investment manager Borderless Capital announced it has acquired quant trading firm CTF Capital in an effort to ramp up its expansion into Latin America while adding \"AI-driven strategies and advanced quant trading methodologies,\" the company said in a statement.","Assets managed by CTF Capital will be folded into Borderless Capital's \"flagship\" $100-million, open-ended hedge fund, the statement said. <a href=\"https:\/\/www.theblock.co\/post\/245693\/borderless-capital-leads-6-million-seed-round-for-microchain-startup-linera\" data-v-f87c67ca=\"\">Borderless Capital<\/a> manages more than $500 million across five venture funds.","\"CTF Capital specializes more in using machine learning, AI indicators ... and at the same time participate in some different opportunities within blockchain, for example, participating in the inefficiencies of on-chain markets,\" Borderless Capital co-founder and Managing Partner David Garcia told The Block. \"All of that capacity and those skills and expertise was something that we were always looking to expand into, but we didn't have the time to build a team, build a platform, build the software.\"","The two firms did not disclose the value of the acquisition, citing security concerns ahead of traveling to and opening Borderless Capital's new Latin American headquarters in Argentina. According to the statement, Borderless Capital has invested in more than 200 companies and protocols since 2018.","Garcia, who is from Argentina, said, \"CTF Capital has a huge concentration of both portfolio companies and limited partners from Latin America, a region we always wanted to expand into.\"","He also said the two firms have been discussing the acquisition for months.","CTF Capital is a Nassau-based, quantitative trading and asset management company that has worked with Borderless Capital for more than three years, according to Garcia. The quant firm launched its own crypto hedge fund in 2018.","\"In 2019, we saw the [way] to differentiate ourselves from other crypto hedge funds was to invest in technology and to develop that technology inside,\" CTF Capital CEO&nbsp;Brian Prilick told The Block. As part of the acquisition, Prilick is transitioning into a new role as a partner at Borderless Capital.","Prilick also said that in 2019, CTF Capital \"started working as market makers for these decentralized exchanges where there wasn't much activity, transactionally, nor other market makers.\" Eventually, CTF Capital developed a proprietary platform offering three different products: high-frequency trading, AI and machine learning strategies for high- and low-frequency trading, and on-chain strategies.&nbsp;","By CTF Capital folding its assets under management into Borderless Capital's flagship fund, the firm's investors will be able to participate in larger-volume trades, according to Prilick.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Garcia","content":"PERSON"},{"type":"CTF Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Nassau","content":"LOCATION"},{"type":"$500 million","content":"MONEY"},{"type":"Argentina","content":"LOCATION"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"David Garcia","content":"PERSON"},{"type":"CTF","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Brian Prilick","content":"PERSON"}],"hashtag":["PRIVATE COMPANY M&AMP;A"],"authors":["RT Watson","The Block"]}