{"summary":"The new study indicates that crypto investment by institutional investors and wealth managers is poised to increase this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280617\/institutional-crypto-investment-poised-increase","publishDate":"2024-03-05T08:06:25","id":11488,"type":null,"title":"Institutional crypto investment poised to increase this year, study finds","category":["INSTITUTIONAL INVESTORS"],"content":["Research by London-based <a href=\"https:\/\/www.theblock.co\/linked\/52971\/fidelity-digital-assets-to-provide-custody-for-london-based-nickel-digital-asset-management\" data-v-f87c67ca=\"\">Nickel Digital<\/a> showed that institutional investors and wealth managers with crypto holdings plan to boost their crypto investments in the year ahead as their short and long-term outlook on the sector turns more favorable.","\"The robust performance of the sector, coupled with the SEC's approval of spot bitcoin ETFs, was anticipated to augment optimism within the sector, but the number of respondents intending to elevate their investments in crypto is still remarkable,\" Nickel Digital Founding Partner Anatoly Crachilov said.","Data collected by <a href=\"https:\/\/www.theblock.co\/post\/188294\/nickel-digital-has-around-12-million-stuck-on-hobbled-crypto-exchange-ftx\" data-v-f87c67ca=\"\">Nickel Digital<\/a> showed that around 74% of institutional investors and wealth managers with digital asset exposure plan to increase their allocations this year. According to Nickel Digital's new research, approximately 87% of surveyed institutional participants expressed that current investment opportunities in the sector appear attractive, with 20% specifically stating they find them very appealing.","The research said that the outlook among institutional participants becomes even more positive in the long term, with 92% rating investment opportunities in the crypto sector as attractive over five years, including 41% rating them as very attractive.","The research findings added that 13% of professional investors in the U.S., the UK, Germany and other countries, with total assets under management of approximately $816 billion, intend to \"dramatically\" increase their allocations to digital assets.","<span data-v-f87c67ca=\"\">Chart showing institutional interest in the crypto sector by category. Image: Nickel Digitel Asset Management.<\/span>","Regarding the category of institutional investors most likely to increase their allocations into crypto, sovereign wealth funds and pension funds were identified as the most probable candidates for heightened investment. \"Sovereign wealth funds, pension funds, family offices, wealth managers and hedge funds all expected to increase investment over the short and medium term,\" Crachilov said.","The Nickel Digital founding partner added that the findings are in contrast to last year when research detected there was still nervousness among institutions about committing to the market.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"92%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$816 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"\" Nickel Digital Founding Partner Anatoly Crachilov","content":"ORGANIZATION"},{"type":"87%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Crachilov","content":"PERSON"},{"type":"74%","content":"PERCENT"},{"type":"41%","content":"PERCENT"},{"type":"Nickel Digital","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Germany","content":"LOCATION"},{"type":"London","content":"LOCATION"},{"type":"Nickel Digitel Asset Management","content":"ORGANIZATION"}],"hashtag":["ASSET MANAGERS","HEDGE FUNDS","SOVEREIGN WEALTH FUNDS","WEALTH MANAGERS"],"authors":["Brian McGleenon","The Block"]}