{"summary":"Copper, the crypto custodian, is working on an investment round that will raise its valuation to more than $1 billion.\nThe fintech firm recently hired former chancellor Philip Hammond as a senior advisor.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121517\/uk-crypto-firm-copper-raise-500-million","publishDate":"2021-10-20T14:15:41","id":1148,"type":null,"title":"UK crypto firm Copper set to raise up to $500 million","category":["Capital Markets"],"content":["British crypto startup Copper is working on a fundraise of up to $500 million, according to three people familiar with the matter.","The investment will value Copper at more than $1 billion, vaulting it to unicorn status — a term reserved for privately-held tech startups with valuations upwards of a billion dollars. It is not yet clear exactly what the valuation will be.&nbsp;","The company is expected to announce the fundraise before the end of the year, but the round has not yet closed, nor has a lead investor been earmarked, according to sources.","Copper declined to comment.","Copper has already raised $75 million through an extended Series B round earlier this year. The <a href=\"https:\/\/www.theblockcrypto.com\/linked\/105168\/crypto-custodian-copper-closes-50-million-series-b-raise\" data-v-f87c67ca=\"\">first $50 million tranche<\/a> of that transaction came in May and was led by Dawn Capital and Target Global, with participation from Illuminate Financial Management. British billionaire and former Brevan Howard CEO Alan Howard then <a href=\"https:\/\/www.theblockcrypto.com\/linked\/108095\/alan-howard-25-million-investment-london-crypto-custodian-copper\" data-v-f87c67ca=\"\">invested another $25 million<\/a> in the business in June.","Aside from fundraising, Copper recently announced <a href=\"https:\/\/www.theblockcrypto.com\/post\/120218\/former-chancellor-philip-hammond-uk-digital-assets-risk-finance\" data-v-f87c67ca=\"\">the appointment of former Chancellor of the Exchequer Philip Hammond<\/a> as a senior advisor to the business. The Conservative Party politician — who served as Chancellor from 2016 to 2019 — will provide strategic advice to the startup as it expands internationally, as well as promote the United Kingdom as a digital assets hub.","In a recent interview with The Block, Hammond said that the dialogue among U.K. policymakers needs to shift “from talking about digital assets to implementing a legal framework that enables firms to embrace them.”","Founded in 2018, Copper uses multi-party computation (MPC), an emerging cryptographic method for securing private keys, to help guard crypto holdings against cybercrime.","Copper’s signature product, ClearLoop, is a system that connects cryptocurrency exchanges together in to enable instant, offline trade settlements. The company also offers payment settlement and prime brokerage services."],"hashtag":[]}