{"summary":"The breach may be related to a similar third-party security incident disclosed by analytics firm Nansen yesterday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252675\/opensea-tells-users-to-rotate-api-keys-after-third-party-security-breach","publishDate":"2023-09-23T15:53:31","id":11495,"type":null,"title":"OpenSea tells users to rotate API keys after third-party security breach","category":["NFT MARKETPLACES"],"content":["<span data-v-f87c67ca=\"\">NFT marketplace OpenSea disclosed that one of its third-party vendors “experienced a security incident that may have exposed information” regarding users’ API keys in an email to some users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company noted that the security incident was not expected to affect any programs that utilize an OpenSea API key, but that if external parties use one of the exposed keys, it could affect rate and usage limits. OpenSea plans on sunsetting existing keys by Oct. 2, according to the <\/span><a href=\"https:\/\/x.com\/ZackDAbrams\/status\/1705653507020247474?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">email<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">OpenSea did not disclose how many users were affected by the breach or what information besides API keys may have been exposed. OpenSea did not immediately return a request for comment from The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The disclosure comes shortly after a similar notice from crypto analytics firm Nansen, which disclosed yesterday that one of its third-party vendors was compromised, leading to the loss of emails, password hashes and some blockchain addresses.<\/span><span data-v-f87c67ca=\"\">The breach impacted 6.8% of Nansen’s users, who had their emails exposed, according to a <\/span><a href=\"https:\/\/twitter.com\/nansen_ai\/status\/1705137387838574904?s=46&amp;t=oHf46otX4Di1EPF3Xc_kDA\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post on X<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"6.8%","content":"PERCENT"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 2","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["Zack Abrams","The Block"]}