{"summary":"Binance is &#x27;narrowing down&#x27; the individual or group behind the BSC Token Hub cross-chain bridge exploit, CEO Changpeng Zhao told CNBC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179362\/binance-honing-in-on-bsc-token-hub-hacker-cnbc","publishDate":"2022-10-24T08:19:41","id":11491,"type":null,"title":"Binance honing in on BSC Token Hub hacker: CNBC","category":["HACKS"],"content":["Binance is \"narrowing down\" the individual or group behind the BSC Token Hub cross-chain bridge exploit that saw a loss of approximately $570 million earlier this month, the crypto exchange's CEO, Changpeng Zhao, <a href=\"https:\/\/www.cnbc.com\/2022\/10\/24\/binance-narrowing-down-identity-of-hacker-behind-bnb-crypto-hack-ceo.html\" data-v-f87c67ca=\"\">told<\/a> CNBC.","Binance's search is being aided by law enforcement.&nbsp;“We’re still actually chasing … helping [authorities] to chase the bad players, working with law enforcement around the globe,” Zhao told the business news channel. “Working with law enforcement is one of the ways that we can try to make the space safe.”","Zhao also noted that, \"in this particular instant, law enforcement gave us some tips of who they think it might be,\" claiming \"we’re actually narrowing down.”","The exploit itself <a href=\"https:\/\/www.theblock.co\/post\/175403\/bnb-smart-chain-halted-amid-potential-bridge-exploit\" data-v-f87c67ca=\"\">occured<\/a> on a cross-chain bridge, or a bridge that allows cryptocurrency users to transfer their crypto assets to different blockchains. During the event, Zhao asked validators to temporarily suspend BSC.","Coordination between validators and the updating of node operators ultimately contained the issue.","Binance is the leading cryptocurrency exchange by volume, by a large margin, for both spot and derivatives trading — according to <a href=\"https:\/\/www.theblock.co\/post\/179310\/binance-dominates-spot-derivative-crypto-trading\" data-v-f87c67ca=\"\">data<\/a> from The Block Research.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this month","content":"DATE"},{"type":"BSC Token Hub","content":"ORGANIZATION"},{"type":"$570 million","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"}],"hashtag":["BINANCE","CZ"],"authors":["Adam James","The Block"]}