{"summary":"Crypto wallet provider Blockchain.com has lost yet another Wall Street veteran. Breanne Madigan, a former Goldman Sachs executive, has left Blockchain.com","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/24946\/blockchain-com-loses-goldman-sachs-veteran-to-ripple","publishDate":"2019-05-28T18:11:01","id":11492,"type":null,"title":"Blockchain.com loses Goldman Sachs veteran to Ripple","category":["INSTITUTIONAL INVESTORS"],"content":["<span data-v-f87c67ca=\"\">Crypto wallet provider Blockchain.com has lost yet another Wall Street veteran.<\/span>","<span data-v-f87c67ca=\"\">Breanne Madigan, a former Goldman Sachs executive, has left Blockchain.com for Ripple, Blockchain.com communication lead Patrick Sutton confirmed to The Block. Her exit followed that of Jamie Selway, previously global head of institutional markets at the firm.<\/span>","<span data-v-f87c67ca=\"\">Upon joining Blockchain.com as head of institutional sales and strategy, Madigan was tasked to carry out the firm’s ambition to attract institutional investors. The crypto wallet service's <a href=\"https:\/\/blog.blockchain.com\/2018\/06\/28\/blockchain-launches-institutional-product-blockchain-principal-strategies\/\" data-v-f87c67ca=\"\">original plan<\/a><\/span><span data-v-f87c67ca=\"\">&nbsp;was to build an institution-oriented platform that integrates over-the-counter trading, custody and exchange business. To this end, Blockchain.com <\/span><a href=\"https:\/\/blog.blockchain.com\/2018\/08\/01\/welcome-jamie-selway-blockchains-new-global-head-of-institutional-marketsuntitled\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">also poached Jamie Selway from Wall Street broker ITG <\/span><\/a><span data-v-f87c67ca=\"\">a few months after Madigan. <\/span>","<span data-v-f87c67ca=\"\">Little news has been heard about the firm’s institutional investment platform since then, although it did launch the OTC desk earlier this year and has an active custody service, Sutton said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In comparison, Ripple appears to have a shot at cracking the institutional market. The payments startup <\/span><a href=\"https:\/\/ripple.com\/insights\/q1-2019-xrp-markets-report\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported a 54% quarterly surge<\/span><\/a><span data-v-f87c67ca=\"\"> in its direct institutional sales of XRP in Q1, totaling $61.93 million.<\/span>","<span data-v-f87c67ca=\"\">It is against this backdrop that Madigan shifted her post. Prior to joining Blockchain.com, Madigan served as head of institutional wealth services at Goldman Sachs, where she helped oversee a record $1.49 trillion total assets in 2017. Madigan had been with the Wall Street firm for over 13 years before she pivoted to the crypto business, according to her LinkedIn profile. Madigan told The Block that she will continue the effort to bring more institutional investors to crypto at Ripple.&nbsp;<\/span>","“I am thrilled to confirm that I have joined Ripple to lead the Global Institutional Markets team,\" said Madigan. \"This is an exciting time to be joining the Ripple team, helping to foster mass adoption of digital assets and transforming global payments systems across the world.”","As lucrative as institutional investments could be, many crypto firms find it difficult to break into this market. <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/09\/the-inside-story-of-the-coinbase-crypto-og-and-wall-street-guard-power-struggle\/\" data-v-f87c67ca=\"\">Coinbase has experienced a similar shift <\/a>from Wall Street to crypto professional traders this year, after encountering pushback from the former, who are still highly cautious about entering into the new asset class. However, with the entrance of big financial service firms like Fidelity, it is likely that other big names will soon follow suit.&nbsp;","Although both Selway and Madigan left, Blockchain.com's institutional sales team is currently led by yet another Wall Streeter, Charles McGarraugh, formerly at Goldman Sachs as global head of metals trading.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Patrick Sutton","content":"PERSON"},{"type":"Wall Streeter","content":"PERSON"},{"type":"Breanne Madigan","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"54%","content":"PERCENT"},{"type":"Sutton","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Charles McGarraugh","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Madigan","content":"PERSON"},{"type":"$1.49 trillion","content":"MONEY"},{"type":"Jamie Selway","content":"PERSON"},{"type":"$61.93 million","content":"MONEY"},{"type":"ITG","content":"ORGANIZATION"},{"type":"Selway","content":"PERSON"}],"hashtag":[],"authors":["Celia Wan","The Block"]}