{"summary":"Zac Prince is CEO of BlockFi, which helps crypto investors manage digital assets and grow their net worth through services such as Bitcoin loans. Frank Chaparro and Ryan Todd discuss the complexity of crypto loans and the future of the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/32006\/zac-prince-blockfi","publishDate":"2019-07-17T16:09:08","id":11498,"type":null,"title":"A conversation with Zac Prince, Founder, CEO, BlockFi","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from The Scoop, The Block's new podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#d0a0bfb4b3b1a3a490a4b8b5b2bcbfb3bbb3a2a9a0a4bffeb3bfbd\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"60100f040301131420140805020c0f030b03121910140f4e030f0d\">[email&nbsp;protected]<\/span><\/a>. Transcript available soon.<\/em>","<a href=\"https:\/\/twitter.com\/blockfizac?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Zac Prince<\/a> is CEO of BlockFi, which helps crypto investors manage digital assets and grow their net worth through services such as Bitcoin loans. Frank Chaparro and Ryan Todd discuss the complexity of crypto loans and the future of the industry.","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK9493613041\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Good morning everyone. This is a very special episode of The Scoop. Very early episode of the Scoop. This is actually probably the earliest I've ever gotten to the office, I got here at seven forty five. Joined by my colleague Ryan Todd and our very special guest the CEO of BlockFi, the crypto, Ether, Bitcoin lending company based almost down the street from us Zac Prince. Thanks so much for joining us.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Glad I could wake you up early Frank.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> No this is incredible. Feels good. I've got my coffee, I've got my energy, I've got Ryan Todd. I'm very excited for the conversation today. So let's get started. When we first, I remember it's funny the first time we met. It was also very early in the morning. We didn't really meet. We met digitally but I was heading back from Cape Cod -- five o'clock in the morning got into a major fight with my ex-girlfriend, needed a distraction and Zac Prince pops up in my inbox about a 50 some odd million dollar fund raise -- their Series A and he said we want to give you the scoop.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> The punchline is I was I was a Frankie Scoops fanboy on Twitter and I'm like how am I going to get Frank's attention. I could send him a note a week before the announcement. That's not that exciting. I want to ping him like the morning before it's going to hit the wire at 9:00 a.m. and tell him if he gets on this he can have a lead on it actually getting released publicly. And you just took it right in.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I had nothing else to do it's like a three hour bus ride.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> You're like done, so then 8:00 a.m. it was up on Business Insider.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That must have been a year ago now. A lot's been going on with your company...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Exactly a year ago.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You've expanded into new assets, you've expanded into new businesses or lines of business. Walk us through a little bit what the journey has been like over the past year.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Sure so yeah I mean it's been great. So when we secured that lending capital we really started growing and this is summer of 2018. So we were growing towards the end of the bear market but we were ramping up loan origination volume, ramping up customers, growing the team and then we launched a second product at the beginning of this year. Our strategy has always been to have a diversified set of products that we make available to a kind of niche customer base of cryptocurrency investors which we think is going to be one of the more valuable customer segments that that exist in the future. And so we launched our second product in March of this year which is basically a crypto savings account so you can deposit Bitcoin or Ether, earn interest on that paid out monthly compounds just like in traditional accounts of that nature and that product really took off. We onboarding thousands of customers in the first two weeks since launching, the rate of growth on that has continued to accelerate. We also now have tailwinds for one of the first times from a macro crypto market perspective since BlockFi has been operational so we've seen a lot of organic growth. We've seen a lot of referral growth and it's been great. We're going to continue down this path of launching new products that are relevant to this customer segment that we target. And it's really exciting.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> There was literally a perfect time to release a interest on crypto paying account like bottom of the market pay out interest, you have all these new customers, they're getting their bitcoin or Ether paid back and that's worth a lot more if they've held it. Probably you've seen those customers completely onboard it and staying with the product.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah. Yeah absolutely. I mean I think we've seen a couple of things I think some of those customers have converted into also using our loan product which they may or may not have known about ahead of time. They've also become kind of like brand advocates for us. I think we had a lot of brand equity that maybe we weren't capturing that much when all we did was loans because that product isn't relevant to 100% of people that own crypto it's maybe relevant to you know 5-10% of people that own crypto.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How did the client base match up between those two products?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> The interest account is much bigger. So roughly 10% is what we're seeing right now so out of every hundred people that are on the platform, all hundred of them are interested in earning interest and about 10 of them will borrow money at some point in time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How are the two connected? Are the funds sort of commingled or are they separate in terms of...?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> We custody them at the same place but we have two different subsidiary entities, two separate kind of holding accounts for the different product lines. And then we do a lot of things too from a customer experience perspective. Let those two products interplay with each other so if you have an interest account with BlockFi you might receive a message in your dashboard or in an email that says did you know you could borrow up to this much money at this rate and you can do it in two clicks and have the money in your account today? And for someone that has a loan especially as prices are appreciating their loan becomes very over collateralized pretty quickly when you have a 200 percent-ish gain in bitcoin this year and so we've we've given our clients the ability to just auto sweep that over collateralization in their loan into an interest account and what we'll be doing more stuff like that over time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What's going on behind the scenes of the of the savings account. Obviously you guys are putting that money to work somehow crypto is already risky as it is. There's no types of insurances that we have in traditional markets like Civic or FDIC. How do clients know that their money is safe and is there transparency around what you guys are doing with it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah there's certainly transparency in terms of the structure that we're using to generate that interest. And it's simply that we're lending bitcoin and ether and bitcoin and ether denominated transactions to institutional borrowers. We did a kind of strategic fundraise for four million dollars in December of last year with participants like Susquehanna, Fidelity, Akuna Capital, CMT and we're pretty strict around disclosing who we actually have relationships with and who we actually are lending to. But it's firms like those and we have a counterparty risk assessment framework and an entire team that manages those relationships and monitors the financials and issues margin calls and requires different levels of collateralization depending on who's borrowing from us and similar to the USD lending that we do, we've never had a loss, we've never had a late payment. We're probably you know more conservative...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You've never had a late payment from any of your institutional clients on the borrowing side?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Or our retail clients on the USD side. I mean most of the time we're holding more money from the borrower than we've actually lent them. So what better incentive could there be to you know make your payments on time and in general just you know pay back. So it's it's something we're gonna be expanding further. You know I think over time as you add diversification to these types of lending pools specifically on the crypto side. Like right now it's primarily institutional trading and institutional investing in terms of who we're facing when we lend crypto as you see more adoption and more utility created with crypto assets we could start to lend to different types of businesses whether that's A.T.M. companies or remittance businesses anything that's using cryptocurrency and crypto rails as their kind of primary method of transacting and as a result they have a balance sheet need for it could be a potential borrower to date these transactions have been you know large eight nine figures and so we haven't really gone down into that corporate segment of the market but over time we certainly will.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You mentioned that before we turn on the mics that there one two three phases that you're looking at for this company.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> The three phases of BlockFi. I think I wrote a blog post about it seven saying it so much recently but yes the three phases are.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Walk us through it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yes. So they're related to you know kind of how big our addressable market is and also what products we're delivering. So we think of what we have today as being in Phase 1 and we're about to migrate into Phase 2 and in Phase 1 we have products that are only relevant to someone who already owns Bitcoin or another crypto asset that's supported on BlockFi's platform so you have the ability to borrow against it you have the ability to earn interest on it. In phase two, we're gonna expand our addressable market to include people who don't own cryptocurrency yet and also offer some more functionality to the clients that are already on our platform and already owned cryptocurrency. And we're going to launch the ability to buy and sell and we think we'll do that in a somewhat novel way: with a bit more of a wealth management or robo advisor field versus a pure exchange where it's oriented around trading and then we're gonna launch a crypto rewards credit card so that a normal you know credit card hopefully we can replace your Chase Sapphire or you know Citi cashback card with something that earns you 1.5% cash back in bitcoin and we're really excited to market that product because we think there's a lot of fun stuff you could do with it that could attract people who who have been on the margin. I mean you're seeing this theme with companies like Lolli where if you can replace earning crypto for you know earning dollars in a way that's super low risk for the user then that's a great mechanism to get someone from not owning any bitcoin into owning bitcoin and you know credit cards is such a logical place to do that. You've seen a lot of things in the crypto space with debit cards which I think haven't seen great adoption because the transaction fees are really high and people don't actually want to spend their bitcoin. So we think a credit card will be really good at that and that's basically phase two and then we also think there's also going to be this phase 3 where today the majority of our clients are U.S. based and we will be more focused on international expansion. We'll target a few specific markets, translate our web site and then we think there'll be some interesting data plays and the data plays will come, one from just the lending and debt and credit markets that we're operating in. So for example helping to create or creating a bitcoin interest rate curve and the other data opportunity that we think we'll see over time with increased adoption especially internationally is the ability to help with credit scoring in markets where you know they don't have like a FICO credit scoring system and large credit reporting agencies like we do in the US. So that's the trajectory that we're on we've released we've released a new product on pretty much a six month cadence since securing that last round of funding. And hopefully we'll we'll stay on that cadence and so we'll have some buy sell functionality launching before the end of this year and then and then a credit card around the midway point of next year.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How many coins will you be able to buy and sell?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> TBD. I think we're we're more focused on you know bitcoin than anything else. Bitcoin is 90 percent of our of our current business. We also do things today with Ether, Litecoin and Z cash and GUSD the Gemini dollar. So we're definitely going to expand that. But but we have no intention of becoming like a Binance or somewhere else or Bittrex where they're they're really good at 50 plus assets. I don't think we'll go that far down market.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you balance these two different customer bases, institutional folks, you're dealing with retail folks. How do you serve both of them while keeping an eye on competitors that really have focused in on on one of those customer segments for like for example like a Genesis level trading is highly institutional. How do you convince clients that you could pull away from them that you're just as institutionally savvy?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah. I think it's one part you know org structure and then another purchase prioritization of resources so we have a team at BlockFi that's focused exclusively on our institutional relationships whether that's the relationship management the day to day trading or the risk assessment. And then we have a separate team that's more oriented around the retail or individual or small business side of things. And right now our product efforts so like what our product team is is designing for our tech team to build have been focused primarily on the retail side enabling someone to come to our website and get a loan without talking to someone unless they want to and that whole process taking less than 30 minutes end to end. In the future from a prioritization perspective we'll be putting a bit more product and technical resources also towards the institutional side of things. The good news is the core infrastructure that we've built is really applicable to both you know making a U.S. dollar loan secured by bitcoin isn't that different than making a bitcoin loan secured by U.S. dollars in terms of what that core engine needs to do and what that core user wants to see when they're interacting with the platform. And we also work with companies like Genesis. So in the traditional debt and credit markets there's concepts like the interbank lending rates. And so something like that I think could emerge in the cryptocurrency space as well over time where there's some transactions in a certain level of of trust and communication that exists between some of the larger providers of these types of products and services in the crypto market. And then you're ultimately competing for clients sometimes but a lot of clients are actually incentivized to have relationships with multiple counterparty so that they spread the risk around as well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I know on the on the rare curve, all the different types of derivatives products that are coming out, is that going to help set that curve. Like how would you actually back into the curve?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> The challenging part about it right now is is term so the crypto markets are obviously very volatile. A lot of the you know perpetual swap type products adjust their their rates on 8 hour or 12 hour 6 hour basis so that that doesn't really help you to build a curve that goes out three months or six months or one year. Because if you're actually trying to trade that and you know a one year interest rate curve moves around from contango to backwardation in a 24 hour period like that is contango. That's crazy. It makes it makes people who participate in traditional markets like their their mind explodes you know. And so I think those platforms are in a really good position to help build that market. There was an announcement somewhat recently from Arthur Hayes and BitMEX that they're considering to start issuing no coupon bonds with a little bit of term. They're looking at it. Yes. So there's a couple of different ways that this could be created. You know the bond market is one. If you use gold as an analogy there used to be before interest rates went to zero this concept of of the the gold forward rate I think it was Go flow or something like that as a gold offer forward rate or something and it was around for quite a quite a while and then when interest rates in the US went to zero it kind of stopped existing because it was built off of the future as interest rate curve. But I think you'll start to see something like that could get built for Bitcoin as well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So let's take a step back and kind of look at how BlockFi is examining getting into this corner of the market right, it sounds somewhat unusual for a retail or what people might know or listeners who might know your firm through the retail lending portion of the business might be confused about you guys getting involved in what could be impactful to derivatives market. So for those folks let's sort of walk them through how you're approaching that side of the business.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> We're not focused on that right now. So we think of that as something that falls into Phase 3 for us which we're at least a year away from. And it could be that in the interim other market participants take this effort a lot farther than than we have. So you know one thing we've we've tried to participate in as has been the efforts that Messari is doing around building some of these interest rate indexes and we're basically a willing participant for anyone who says we want to build a rate curve where we want to start to kind of aggregate some of this data. So I think right now that's the extent of our of our efforts. We basically raise our hand and say you know if you need some help we can give you some data points we'll give you our perspective. I think it's most likely that we end up being a component of some type of index anyways.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And leading the charge. You mentioned before we started, that you draw a lot of your inspiration from SoFi, \"Fi\" at the end. But there's also other things that you've you've...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Early investor. You said you know people that work there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is that the traditional markets parallel you would make for your firm if you were explaining it to someone in an elevator pitch?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> It is and we get the question all the time of OK so you're a bank and it's like no we're a fintech company. There are a lot of fintech companies like SoFi we fall back on that example because you know Flori and I come from the online lending industry most recently and so if I was the company that built the most enterprise value and was really the market leader to emerge from that space and what they did that was really smart was they started with a you know a high value customer segment which initially was people who graduated from Ivy League schools and they said well we'll refinance your student loans at a better rate than anyone else. And then they expanded to include non Ivy League schools but still with just the student loan refi product and then after they had built up a really large base of customers they started expanding their product into initially mortgages and then into wealth management. They're about to add the ability to hold crypto into their wealth management platform and they're also either already launched or are launching soon a hybrid checking savings account. So I think one of the big learnings from other fintech companies is that there's there's a lot of IP for financial services built up in that relationship that you have with your customer. And if you can do a good job of messaging what your company is about if you can do a good job of creating products that you know add value and are super easy to use and are somewhat differentiated from what else is out there in the market. And then if you can sell more than one product to the same customer of your marketing economics get better your ROI and LTV economics get better and you have to stick your relationship with that client. And if that can be at the core of what you're building that objective, your incentives are really well aligned with your client base. And then if you take it back to the crypto market it's it's in a lot of ways it's the polar opposite of DeFi which is interesting. DeFi it's like we don't want to know who you are. We don't have any of your data and they have this advantage of being able to take a customer from anywhere in the world and not not having that roadblock right. Like I don't need your ID. Every customer on our platform we need to get their ID. I think we need both. I think it's I think it's potentially revolutionary in game changing that we now have that ability also. It's just not the DNA of BlockFi. We think of you know each client relationship as being really important. We want to know who that client is we want to know what activity they're doing on their platform what their birthday is you know maybe we start sending people a bottle of wine on their birthday. I don't know. We haven't done that yet but those are the types of things that create that you do affinity","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You gave me this example when we first met. SoFi -- I didn't know this but when you would sign up they would send you a bottle of olive oil or wine or something along those lines. That might build customer relationships which I think is insanely valuable for for lending and fintech in general.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> All we've done so far is T-shirts. But I think we're gonna be able to up our game soon.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Given Bitcoin it's up now 100 percent.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Has that changed anything. The run up in terms of?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> It certainly makes the day to day a lot easier when you you know go to bed at night and then wake up in the morning and all of your clients are 15% richer overnight and you have you know more media attention. The greater interests in the sector and frankly you feel a little bit validated you know saying in the summer of 2017 that we were going to lend money secured by the value of someone's Bitcoin raised a lot of eyebrows and people thought it was going to be super risky and we were destined to just blow up and lose a lot of money. We also said we weren't going to raise funds via an ICO which a lot of investors that we talked to in the middle of the ICO boom they're like oh you're you're an idiot. Like why are you not raising money via an ICO, We're like well we don't think it adds any value to the customer relationship. We're building a long term business and they're like yea cool see you later","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Do you still get that like what makes you different than Celsius or Nexo or these other token based lending platforms because we get it on our end and I just think...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do you see any value in the token in those business models?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> I think it's it's really really hard to create value in the token in that type of business model. I think there will be exceptions to the rule like Binance and others. But an exchange is so much more transactional and can generate such a larger amount of quick revenue versus a lending business where you're taking payments over time. And so I think it's really I think it's really hard. I don't think the performance of the lending ICO sector tokens has helped his interest in the tokenized and that's just confusing. From a user experience perspective I remember thinking like Okay you want me to you want me to buy your token with my money so that I can borrow money from you secured by my bitcoin and then pay you a lower interest rate because I already bought your token like somewhere in there you're just slapping your head going this doesn't make any sense. I feel like I'm getting bamboozled like you're giving me a loan just secured by my bitcoin just you know let me give you the bitcoin and then you give me the loan. But yeah I mean we get we get the question a lot. I think at the end of the day if people have good intentions they're not doing a scam. I think that all development in the sector is probably a net positive it's still very early and we need as many smart people working on good concepts as possible.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> But how do you explain the value prop of your firm relative to your competitors","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> DeFi, I know you mentioned that earlier.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah I mean everything in financial services usually starts from a rates perspective especially when it comes to lending so we you know we focus on always understanding where other rates are in the market and you know we strive to always have the best rates. Secondarily I think for DeFi there's a lot of structural things that we do differently. So you know on Friday when we were thinking of recording this podcast the market looked one way and it's gone down quite a bit over the weekend and there's been some good talk about liquidations on different t five platforms and all of the DeFi platforms as far as I'm aware charge a liquidation penalty partially to incentivize liquidity showing up on their platform.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> It's high it's like 5 to 13% at times.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah. And we you know we would never do that. We've we have had to sell collateral in a couple of instances primarily in November of 2018. But we do a couple of things one we have a lot of notifications we have a tighter maximum LTV ratio than all of the DeFi platforms which I think is partially driven by the fact that we can just build access to liquidity we don't need to make liquidity come to us.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Tighter being lower so tighter meaning...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah like if you're I think the max collateralization is like 140% 130% on a lot of the DeFi platforms and we're 120 110 and then we still offer flexibility there for example if if a transaction happens that someone wants to unwind and depending on which way the market went there's a couple different ways you could unwind it and kind of restore their position will we do that. And so you know it's just it's just a just a different approach. Lower fees tighter ratios we've got access to more liquidity because we can go through KYC AML onboarding with an institutional OTC desk or an institutional market maker which require that. And so we're not just looking at decentralized exchanges for our liquidity when we need it or you know needing to incentivize liquidity to come to us we can go get it. We can have access to institutional liquidity and we can also do various types of hedging which sometimes makes sense and sometimes don't depending on which way the futures markets or derivatives markets are going for example.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How does BlockFi fit into that? How can you sort of or how can exchanges or other crypto companies leverage BlockFi to offer new services to their clients?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> So we we've spent we've spent a lot of time working on partnerships we've announced quite a few big ones just in recent memory. We partnered with CASA, Luno, Delphi Digital. No major exchange partnerships to to announce as of yet. The exchange one is particularly interesting. So we think we think partnerships are important we think it's great to be able to offer users on one platform access to more services in that same environment that they're used to interacting with. With exchanges it depends on how they want to design their system. So a Bitfinex on the lending side has been largely peer to peer whereas by Binance I don't think is is a peer to peer setup and other exchanges depending on how they're regulated may not be able to offer lending directly. Also all of the exchange lending that's taken place to date has been fundamentally different than the majority of the lending that BlockFi does in that we're kind of offering liquidity access lines or portfolio lines of credit where you can borrow money off of the exchange environment or outside of the trading environment in your bank account. But there are lots of things that we could do there and that we're exploring doing there whether it's being a funder in a peer to peer designed construct which we haven't done yet but we might consider doing over time integrating to offer a wealth front portfolio line of credit type of experience on different crypto exchanges or you know potentially helping to design and offer a margin trading program as well. I've seen this in other industries I've always worked in you know kind of high growth new technology areas and partnering can be incredibly value accretive not only to the companies but also the customers. So it's something we're a big believer in.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Is that hard to integrate via like a tech solution into someone else's platform hoook in and then start issuing credit? Is that something that's easy to pull off. What's kind of a roadblock there?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> The answer is It depends on what kind of integration you want to you want to do. So to give two examples there's the concept of just like a marketing partnership where I'll write about you you write about us. We have some information and we have links that maybe offer discounted access to services from the other partner. That's pretty easy.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> That's like what you got going on with CASA.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> That's what we have going on with CASA right now exactly. That's pretty easy to to set up and then there's you know the other end of the spectrum where there's a portfolio line of credit program powered by a bank integrated into the wealth front dashboard where you can access it by clicking two or three times and signing a document and then it's done you now have a line of credit powered by this bank. That's a different level of integration and then you know actually powering a margin trading function would be an even an even deeper level of integration.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You see that on the horizon for this year?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> I'd say it's a coin flip","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Like somewhere in phase 2, phase 3 maybe I don't know is that phase 2 for you?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> 2.5.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah I think it's coming.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Okay. Interesting. Very very suspicious. You heard it here first on the Scoop. Tell us a little bit about your background for listeners who might not be familiar with Mr. Zac Prince. You've been in tech for a while. You're from Texas.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah we were listening to some Texas country music before we started recording. I grew up in Texas. I was a I was a nationally ranked tennis player on the junior circuit and then put myself through school.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> I mean it's like the longest Wimbledon ever. It was incredible. Yeah I was yelling at the TV. You know I was rooting for Federer. So yea I grew up playing tennis. I was a you know kind of pseudo online professional poker player throughout throughout college which enable me to come out of school with no debt which was nice but it also enabled like the flourishing of of some immaturity that that it was out. And then I graduated in May of 2009 I always thought I would work in finance but that wasn't the best time to be looking for a job in the financial industry. So I ended up getting a job with this ad tech startup called Admeld here in New York City an Admeld was one of the pioneers of like online advertising exchanges. So when the world was moving from you know Pepsi calling the New York Times and saying We'll buy five thousand ads for this price and they they transacted with each other into a world where advertisers could target specific users rather than just a specific Web site. And there was a concept of bidding against other advertisers for these impressions. Admeld was one of the first exchanges we did really well. I was there for about three years I kind of climbed through the organizational ranks and then we were acquired by Google at the time it was like the sixth largest Google acquisition and now it's not even the top 25 but there's a little of it is a little over 400 million. And then I would then I started the North American entity of another ad tech company called Sociomantic that was based in Germany here. After staying at Google for less than a year and then I moved into online lending so more relevantly for BlockFi I did two different stints at online lending companies. One, Orchard which was basically a middleware layer for the online lending industry. We aggregated data and provided technology solutions to institutional investors that wanted to buy loans or lend to the lending clubs and so FIES and Prospers of the world are in business development there for like three years and then while I was there I started writing a blog on the side about fintech because I became like the guy out of my friend group who people would say should invest in commercial real estate loans online. I do this robo advisor stuff and I knew all of these companies and oftentimes you know I had set up a partnership with them at Orchard. So I just started writing it all down so that I could send people a link instead of talking about it over and over again. And that's what led me to Bitcoin and I was working on that blog I found Coinbase found Bitcoin in 2014 bought some sold it after it doubled and then bought back in at a higher price in 2015. And then in 2016 I left Orchard and started working at a consumer lending business that basically offered point of sale financing to online retailers for consumers that had bad credit scores or a thin credit file because they're young or international and that company -- our entire sales pitch was how many declines do you get from a firm every month and somebody would say oh it's about fifty thousand and we'd say well we can approve 75 percent of those. And then that was going really really well. But the crypto market started to draw an increasing amount of my attention and I was talking about it at home and my wife is like you're talking about this too much. Go find some other people to talk with it about like you need to start going to meet ups or something and so I did. I just got really excited like early 2017 and and decided that I had to find a way to build in this industry. And then after talking with Flori about it we just decided to start a company.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What are some of that if you look back at your time in traditional online lending versus BlockFi before we hop down we were we were talking about the difficulties of just securing real estate or securing you know different services that any lending business would at a higher cost but what what are the biggest differences between the two from the perspective of running the business itself.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> You know I think in the in the traditional online lending industry you are definitely facing concern or reservations from people in the early days of that space because you weren't a bank and you were doing everything with technology and what did that mean and how could you how could you lend as safely as you could with all of your traditional processes and procedures through a Web site. Making a decision in a loan in less than five minutes or less than 10 minutes. Like how could that work. But the core product was a product that it existed forever. Like you were making consumer loans or real estate loans. I mean this was all stuff that was very well-defined and had long track records and debt capital markets. It was just that the banks had had stopped being as active in a lot of those sectors. What's different in cryptocurrency is that you have all of those same considerations that online lending or other fintech companies go through in terms of the need for compliance in terms of the need to raise different types of capital versus just like a you know software type startup and needing you know really kind of specialized employees that that largely get that experience from banks or traditional financial institutions on your team to build these things. What's different is that you know cryptocurrency one I think has a much larger addressable market. So if you're setting up a you know an online consumer lender in the U.S. 1. it's saturated 2. your addressable market is a lot smaller 3. the only thing that's really unique about that is that you're doing it on the Internet instead of through a bank branch whereas with cryptocurrency And Bitcoin you've got global scale built in at the foundational level you have something that could truly disrupt parts of the financial structure that that have existed you know for hundreds of years in modern times or whatever. And the regulation is a lot less clear. Yeah it's it's a lot less clear. And it's it's a lot more of a moving target like the regulatory questions were figured out in online lending there's basically a question of you know do some of the peer to peer lenders need to be broker dealers or not. That was decided and lending club and prosper you know had a broker dealer arm. So they were the only ones that could sell the loans to retail and then everybody else didn't sell any loans to retail unless it was accredited only but in crypto I think there's still I mean there's questions about what are some of these assets securities or not.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What does that mean for your business?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> You know we've we've been we're a follower not a leader in terms of supporting any new crypto asset. For the type of stuff that we're doing I mean look at what happened on Poloniex with you know they were doing they were doing margin lending with clams and they ended up having to socialize a loss as a result. And so you know the biggest inputs to our risk models are liquidity and volatility. And so as we go down the you know the market cap stack liquidity goes down as well. And so these are riskier assets and we approach everything from a risk management first view. So for those reasons and just you know our belief that there isn't that much more business to gain versus just supporting bitcoin and ether, it just hasn't been a priority.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You mentioned the the global scale aspect of being able to offer these types of loans. We talked about this before as well the regulatory arbitrage of being able to provide funding into all these different regions without having to have a presence there. Is that something you guys think about and talk about a lot and are there considerations also like how the rate environments are in some of these regions and whether that makes the product more attractive for consumers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah a ton I mean to answer the first question about rate environment I mean for someone in for example a Latin American country...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Might be worthwhile talk about how they derive the rate?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> How we derive the rate? So how we derive the rate when we're lending USD is largely a function of our cost of capital which is driven by institutional relationships that we have. For example the one we announced when I was pinging you for the exclusive with Galaxy Digital where we have a 50 million dollar pool of committed capital from Galaxy that can be used. That can be used to finance our loans and that has a cost of capital associated with it so they're expecting a certain rate of return. And then we have other relationships like that one. And so you know kind of the blended cost there is the largest input to what we're charging people to borrow from BlockFi.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> And they just lend out higher hopefully?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah. Exactly. And then the same thing on the on the interest account or crypto lending side of things there's a rate that will pay to depositors and there's a rate that we charge when we're lending it out and you know our objective is to is for that to be a positive spread. And that's how we make money. The the interesting rate dynamics globally are if you're in a country for example Latin where inflation is high. As a result the cost of borrowing is high. Credit availability is low for consumers to use an asset like Bitcoin as a mechanism to get the same cost of funding denominated in dollars. You know that someone in a in a you know in the U.S. could get is really really powerful and then the other on the other end of the spectrum in Europe or Japan or more now developed economies they have a negative, a negative yield environment now to be able to earn interest on an asset on the same on the same playing field.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You have money on my investment, that's insane!","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah I mean you know 2 percent interest is something to really high five about in Japan. And so you know having something that you can price based on U.S. dynamics but then deliver globally is really powerful. And then on the regulatory arbitrage point if you wanted to set up a consumer lending business in Brazil for example you would need to secure capital probably denominated in Reals you would need to get whatever license exists or may not exist for a company to be able to offer loans in that market and then you would need to have local banking and payment processing partners that enabled you to deliver the money and collect payments back. But because we're using blockchain rails assuming we're comfortable with the risk of of conducting that regulatory arbitrage in any of these markets if we can just turn on. Our KYC requirements under U.S. regs and our KYC data providers support international consumers. There's actually nothing from a U.S. regulatory perspective that would prevent you from offering a financial product to a citizen of Venezuela. They're actually not sanctioned. All right. People that work for the government are sanctioned and it might be really hard to get a good identity verification for someone from Venezuela but from a U.S. perspective you know that's okay. And then in terms of those local partners for banking or payment processing Well you don't actually need them because you're using blockchain based assets. They send you bitcoin you send them stable coin or the other way round. I mean that's it's incredibly powerful. I think I think that the global accessibility component and the level of equality that you can potentially derive from that in terms of global market participants having access to to a unified market is really really powerful and something that you know in the space we should we should talk about more. So I think that's a more fun thing for potential new participants to hang their hat on then you know macro economics are shaky the world's going to blow up you should own Bitcoin, I'm like ah that's not the feel good things. Let's talk about the good stuff. Let's talk about the you know the feel good things. I think that's going to be more of a of a onboarding force than than the scary things because in my experience if I talk about the scary stuff people like shut down they're like I don't want to hear that man. That sounds really scary. Well let's let's not go down that path. You know.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Two points on that front. I guess the first thing is so you've seen firsthand blockchain based lending at least from crypto standpoint. Are there other asset classes that you could see this technology kind of fusing into. I know that Mike Cagney ex-SoFi CEO his company figure, does he lock loans, home equity lines of credit.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yep.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Does this kind of speak to the potential of that type of product and others?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> I think they're a little bit different. So like you know the way BlockFi is using blockchain is primarily to support these new unique assets whether it's Bitcoin or or stable coins. Whereas Figure is is using blockchain as a technology stack. And I think that could work. But I still struggle and this is probably just because I'm not a technologist but I don't know what the benefit is of using a blockchain versus just getting all of the different data components in a certain workflow to use the same system. I don't know what the benefit of the blockchain is and so when I think about it for lending it's like OK I just need the loan originator, the loan servicer the customer service team who's always dealing with you know exceptions to to certain you know payment behaviors. The capital markets like warehouse facility and then also the ratings agencies and the reporting component of securitizations. I just need all of them to record their data in the same place. Yeah that could be Salesforce right. Like just put it all in the same place and have all of them trust that the other person in that workflow chain is not lying. I don't know that blockchain actually helps with that. If it's if it's if it's a buzz word that enables you to hold people's feet to the fire and say No no no no we're putting this on the blockchain now so you have to do it. We're all doing this then then that's great but I don't think I don't think the core technology is that differentiated for that use case versus you know a database from Oracle.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> And then the second was a follow up to your feel good story. One of the first things that jumped out to me when I was reading the Libra white paper was how they're gonna really look to have businesses and other people come on in and build services on top of that stack should it come to be. And one of the first companies that jumped out of my mind was BlockFi potentially looking to offer levered denominated loans globally. Would that be something that would be of interest to your firm?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah I mean I think I think it's interesting to us. I think it's it's probably really interesting to Libra too or or frankly anyone that's you know launching a new asset even if it was a you know stable coin backed by a different reserve currency to have a financial service provider you know offer these types of products and services on it. I'm so curious to see what happens to Libra from a regulatory perspective.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I'll let you know.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Frank had a Scoop over the weekend I read. You know I read the whole thing. I don't think it's unlikely for that to pass. I mean you've got the you've got the banking lobby you've got the regulators who are kind of annoyed with big tech anyways. They're already so powerful. I mean selfishly I'm all for them getting bigger because I have a lot of exposure in my you know Robin Hood account or whatever. I just I just don't I just don't I don't know how you get that approved and you actually have the ability to leverage...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Everyone buys in.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I mean this this this is the most unifying force on the Hill right now. Just this pure hatred inside.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Bipartisan. It's so easy for them to just be like, we're gonna say no to this right? Like I don't care if I hate you and we're at the polar opposite ends of the aisle.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So Facebook is always a good place to end any any conversation especially these days and with the hearings coming up, what do you see happening? You see the government just coming in and saying this isn't this isn't going to go?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> For me I don't think they're gonna be able to launch Libra in the way that they initially conceived it. Maybe they'll be able to launch some version of it maybe not.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What changes do you think will have to be made? Interestingly it's been communicated to me that with the folks on the Hill there's an annoyance that it's based in Geneva. The association itself, for reasons of why is innovation going overseas?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Every big country is going to say no no no no just tokenize the dollar or tokenize the euro like you want to do this thing do it with just our currency like you're not the IMF, you're Facebook but what I think is great and way more relevant for BlockFi is that this is sparking conversations about Bitcoin that so highlight what's unique about Bitcoin that you know you've got that...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> It got Donald Trump to tweet about.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Donald Trump tweeted about it. You've got that guy from CNBC and you're like watching you're watching him in real time go through the five stages of becoming a bitcoin maximalist and that's so great to see. So it gives you such this this perfectly stark comparison to make versus bitcoin and I think a lot of people are gonna go. Alright well now I kind of get the bitcoin thing because it's not controlled by Facebook and it's not controlled by government and so so it's made me you know more bullish than I ever have been on where we're headed.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Where we headed? One hundred thousand?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Yeah Hundred thousand no time frame. Definitely.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Thanks Zac, CEO of BlockFi. Thanks so much for stopping by.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Zac Prince<\/span><\/strong> Thanks for having me guys. Keep up the great work."," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zac Prince<\/span><\/strong> Yeah","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Like","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"200 percent","content":"PERCENT"},{"type":"CMT","content":"ORGANIZATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Flori","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ivy League","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"CASA","content":"ORGANIZATION"},{"type":"Todd<\/span><\/strong> Everyone","content":"ORGANIZATION"},{"type":"Chaparro<\/span><\/strong> Thanks Zac","content":"PERSON"},{"type":"Litecoin","content":"PERSON"},{"type":"Zac Prince<\/span><\/strong> Frank","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"8:00 a.m.","content":"TIME"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"Frank","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"summer of 2018","content":"DATE"},{"type":"Luno","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Federer","content":"PERSON"},{"type":"13%","content":"PERCENT"},{"type":"summer of 2017","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"Zac Prince<\/span><\/strong> Yep","content":"PERSON"},{"type":"Citi","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Does","content":"PERSON"},{"type":"today","content":"DATE"},{"type":"Ryan Todd<\/span><\/strong> Early","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Given Bitcoin","content":"PERSON"},{"type":"100 percent","content":"PERCENT"},{"type":"Japan","content":"LOCATION"},{"type":"November of 2018","content":"DATE"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"90 percent","content":"PERCENT"},{"type":"New York City","content":"LOCATION"},{"type":"50 million dollar","content":"MONEY"},{"type":"Ryan Todd<\/span><\/strong> It","content":"PERSON"},{"type":"9:00 a.m.","content":"TIME"},{"type":"IMF","content":"ORGANIZATION"},{"type":"Zac Prince<\/span><\/strong> Donald Trump","content":"PERSON"},{"type":"Akuna Capital","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Ryan Todd<\/span><\/strong> You","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"AML","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> DeFi","content":"PERSON"},{"type":"Ryan Todd","content":"PERSON"},{"type":"2 percent","content":"PERCENT"},{"type":"LTV","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Galaxy","content":"LOCATION"},{"type":"four million dollars","content":"MONEY"},{"type":"140% 130%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Frankie Scoops","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Susquehanna","content":"LOCATION"},{"type":"Lolli","content":"PERSON"},{"type":"Zac Prince<\/span><\/strong> TBD","content":"ORGANIZATION"},{"type":"400 million","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"Pepsi","content":"ORGANIZATION"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"Orchard","content":"ORGANIZATION"},{"type":"Robin Hood","content":"PERSON"},{"type":"May of 2009","content":"DATE"},{"type":"Venezuela","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"Brazil","content":"LOCATION"},{"type":"Zac Prince","content":"PERSON"},{"type":"Geneva","content":"LOCATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> Tighter","content":"PERSON"},{"type":"Cape Cod","content":"LOCATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"75 percent","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Mike Cagney","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"March of this year","content":"DATE"}],"hashtag":["BLOCKFI"],"authors":["Frank Chaparro","Ryan Todd","The Block"]}