{"summary":"Ankex, a new hybrid crypto exchange incubated by DeFi infrastructure firm Qredo, announced its launch today.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190507\/qredo-incubated-hybrid-crypto-exchange-breaks-cover","publishDate":"2022-11-29T05:00:32","id":11494,"type":null,"title":"Qredo-incubated hybrid crypto exchange breaks cover: Exclusive","category":["DEFI"],"content":["Ankex, a new hybrid crypto exchange incubated by DeFi infrastructure firm Qredo, announced its launch today. &nbsp;","Qredo builds decentralized tools that help DeFi outfits with settlement, custody and shifting assets between blockchains. Its support for Ankex comes amid <a href=\"https:\/\/www.coindesk.com\/layer2\/2022\/11\/11\/ftx-showed-the-problems-of-centralized-finance-and-proved-the-need-for-defi\/\" data-v-f87c67ca=\"\">growing demand<\/a> for decentralized services, following the spectacular demise of the centralized crypto empire directed by former FTX boss Sam Bankman-Fried.","The Panama City-based Ankex aims to embody the benefits of both decentralized and centralized exchanges — namely, DeFi-style self-custody services combined with a superior user experience.","Traders on Ankex will house their assets in Qredo’s “Vaults,” according to an announcement. These accounts use multi-party computation (MPC) to split and scatter customers’ private keys across data centers. Those centers are managed by Qredochain, Qredo’s Layer 2 network.","“Given the events of recent weeks, there is a new appetite for sophisticated exchange capabilities without the need to trust a third party or cede control of your assets,” said an unnamed Ankex representative in a written statement.","Asked about Ankex’s key personnel, a spokesperson for Qredo said the company has an independent team and wants to “avoid hierarchies,” meaning that for now it has a number of unnamed contributors only.","In its announcement, Ankex promised real-time verification of proof-of-reserves across all exchange participants, as well as comprehensive proof-of-liquidation reporting — features that have been <a href=\"https:\/\/www.theblock.co\/post\/187240\/exchanges-rushed-to-show-proof-of-reserves-its-not-enough\" data-v-f87c67ca=\"\">widely called for<\/a> following the shocking collapse of FTX.","Ankex was incubated by Qredo Ventures, the investment arm of the business that it <a href=\"https:\/\/www.qredo.com\/blog\/ventures\" data-v-f87c67ca=\"\">unveiled<\/a> in a blog post in September. Qredo said its goal was “to foster the development of complementary projects that can grow alongside us and feed back into our own evolution.” The crypto sector has produced <a href=\"https:\/\/www.theblockcrypto.com\/news+\/160796\/crypto-startups-are-becoming-vcs-their-backers-are-not-amused?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">a significant number<\/a> of early-stage-startups-turned-venture-capitalists this year — a trend experts attribute to the need to foster creativity within newly-formed digital ecosystems.","Qredo itself <a href=\"https:\/\/www.theblock.co\/post\/132899\/crypto-startup-qredo-fundraise-tapiero\" data-v-f87c67ca=\"\">raised $80 million<\/a> in a Series A round in February, valuing it at $460 million. Hedge fund veteran Dan Tapiero’s 10T Holdings led the raise.","In the wake of FTX’s collapse, which has wrought widespread chaos across the crypto industry, Qredo appears to be one of the few operators sitting pretty. Josh Goodbody, Qredo’s COO, told The Block the startup has seen a surge in activity off the back of the FTX debacle. New account activity has risen 197% week-on-week; a record of more than 1,000 new custody clients came on board in the week of Nov. 6; wallet balances are up 70%; and weekly transaction volume has risen 625% week-on-week since early November, up to $3.37 billion today.","“It is incredible that in the midst of a deep crypto and TradFi bear market that a company like Qredo can show improving revenue metrics,” said Tapiero, CIO and managing partner of 10T Holdings — which contributed a full $40 million of Qredo’s Series A round. “Decentralized custody is a possible way forward for many in the space after the FTX fraud.”","Alex Svanevik, CEO of data analytics firm Nansen, pointed to a spike in volume on Uniswap — the non-custodial, DeFi exchange — as another indicator of shifting demand in the crypto sector. He also highlighted <a href=\"https:\/\/pro.nansen.ai\/stablecoin-master\" data-v-f87c67ca=\"\">a corresponding rush<\/a> to withdraw stablecoins from centralized exchanges.","Ankex is expected to go live next year, according to today’s announcement. A waitlist for would-be customers opened today.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\/embed\" title=\"DEX Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CIO","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"$40 million","content":"MONEY"},{"type":"Qredo Ventures","content":"ORGANIZATION"},{"type":"Nov. 6","content":"DATE"},{"type":"625%","content":"PERCENT"},{"type":"Panama City","content":"LOCATION"},{"type":"Nansen","content":"PERSON"},{"type":"Qredo’s COO","content":"PERSON"},{"type":"10T Holdings","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Dan Tapiero","content":"PERSON"},{"type":"$460 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Alex Svanevik","content":"PERSON"},{"type":"Qredo","content":"PERSON"},{"type":"Tapiero","content":"PERSON"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Josh Goodbody","content":"PERSON"},{"type":"197%","content":"PERCENT"},{"type":"MPC","content":"ORGANIZATION"},{"type":"$3.37 billion","content":"MONEY"}],"hashtag":["DEXS","UNISWAP"],"authors":["Ryan Weeks","The Block"]}