{"summary":"EtherFi manages over 1.07 million ETH, amounting to approximately $3.8 billion in user deposits, holding lead in the liquid restaking market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287477\/etherfi-maintains-leads-in-liquid-restaking-niche-with-over-3-8-billion-in-deposits","publishDate":"2024-04-10T01:38:22","id":115,"type":null,"title":"Etherfi maintains lead in liquid restaking niche with over $3.8 billion in deposits","category":["CRYPTO ECOSYSTEMS"],"content":["Etherfi continues to lead the liquid restaking market, managing over 1.07 million ETH, which translates to roughly $3.8 billion in user deposits.","Etherfi enables users to access restaking yields via EigenLayer, highlighting its role in the growing niche.","Liquid restaking has experienced notable growth this year, driven largely by increased deposits on EigenLayer, which intends to utilize ETH deposits to strengthen third-party protocols. This, in turn, boosts the total value locked in LRTs, with Etherfi holding a considerable portion of this value.","While Etherfi leads liquid restaking, other protocols also contribute hugely to the market. These include Renzo at $2.9 billion, Puffer at $1.4 billion, Kelp with over $840 million, Swell with $345 million, and Eigen at $340 million, according to The Block's <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/ethereum-liquid-restaking-total-value-locked\" data-v-f87c67ca=\"\">data dashboard<\/a>.","Restaking allows users to employ their staked ETH — or a corresponding liquid staking token — on platforms like EigenLayer for restaking purposes. EigenLayer then allocates this ETH to support other Ethereum-based applications, termed “actively validated services”, thereby broadening Ethereum’s security framework.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/restaking\/ethereum-liquid-restaking-total-value-locked\/embed\" title=\"Ethereum Liquid Restaking Total Value Locked\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Liquid restaking offers the benefit of engaging with EigenLayer’s services while maintaining liquidity and accessibility of users’ ETH capital. These protocols continue to accept ether deposits, restake them, and issue derivative tokens, offering users additional incentives to participate in the ecosystem, which includes LRTs and EigenLayer’s rewards programs.","LRT protocols also provide an alternative means for users who don’t have 32 ETH (used for native or direct restaking) to access the platform. This explains why the top LRT protocols have <a href=\"https:\/\/www.theblock.co\/post\/285822\/liquid-restaking-platforms-jump-to-near-8-billion-in-total-value-locked?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">accumulated<\/a> assets totaling $9.7 billion, accounting for over two-thirds of EigenLayer’s $13 billion TVL.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.4 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$3.8 billion","content":"MONEY"},{"type":"$9.7 billion","content":"MONEY"},{"type":"$2.9 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LRT","content":"ORGANIZATION"},{"type":"Eigen","content":"ORGANIZATION"},{"type":"$340 million","content":"MONEY"},{"type":"$840 million","content":"MONEY"},{"type":"$13 billion","content":"MONEY"},{"type":"$345 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["RESTAKING"],"authors":["Vishal Chawla","The Block"]}