{"summary":"Spot tokens are minted using ampl as collateral that is split into tranches with the token designed to tend toward the CPI-adjusted dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193230\/ampleforth-developer-debuts-ethereum-based-inflation-resistant-token","publishDate":"2022-12-08T10:00:18","id":11508,"type":null,"title":"Ampleforth developer debuts Ethereum-based inflation-resistant token","category":["CRYPTO ECOSYSTEMS"],"content":["Fragments, the developer behind blockchain protocol Ampleforth, has launched an inflation-resistant token called spot in an effort to attract DeFi investors worried by rising prices.","Spot is the latest project designed using&nbsp;<a href=\"https:\/\/www.button.finance\/\" data-v-f87c67ca=\"\">Buttonwood<\/a>, according to a statement, and is closely related to Ampleforth's native token ampl. Buttonwood is an Ethereum-based smart contract set that provides the building blocks for designing DeFi protocols.","The ampl token is a rebase coin designed to keep its price closely to the CPI-adjusted U.S. dollar. CPI stands for consumer price index and the CPI-adjusted dollar is $1 adjusted for inflation. Ampl does this by using the CPI-adjusted dollar to calculate daily supply adjustments for the rebase. This supply adjustments lead to the amount of ampl tokens in user wallets increasing or decreasing depending on the level of demand. In this way, demand does not drive the price of the ampl token.","The spot token serves as a freely redeemable claim on a basket of on-chain collateral backed by the ampleforth token. Since spot is backed by ampl, the price of 1 spot token should also tend toward the CPI-adjusted dollar.&nbsp;","Yet Fragments CEO Evan Kuo claims that it's different from a traditional stablecoin. \"SPOT is a different kind of stablecoin that isn't pegged to anything,\" Kuo stated, adding, \"The price of spot is determined by the market. Its value is the collateral for which it can be redeemed.\"","Kuo also claimed that spot is immune to bank runs as was the case for projects like Terra’s UST stablecoin. Spot is designed to unwind to zero users, without the need for external intervention like bailouts, the announcement stated. This design means that spot can be overpriced but not undercollateralized and as such, can survive a situation where users rush to withdraw and sell the collateral.","The spot token is backed by <a href=\"https:\/\/www.theblock.co\/post\/73394\/ampleforths-ampl-token-market-cap-declines\" data-v-f87c67ca=\"\">ampl tokens<\/a> that are tranched and bundled into a collateral set. Tranching refers to the pooling of assets with different risk profiles into a single set. There are two tranches in the spot token design — a junior tranche and a senior tranche — the former is more exposed to supply changes in ampl while the latter is less so.","The Buttonwood protocol is responsible for splitting the ampl-backed collateral into two tranches. Apart from being more or less volatile than ampl, each tranche also has different ratios and maturity dates. The tranche ratio refers to the amount of volatility inherent in each category while the maturity date signifies when each tranche can be exchanged for the underlying ampl token backing.","Users can begin to mint spot tokens given Thursday’s launch, according to the announcement. To do this, they can deposit ampl into the available tranches. Users can also redeem their spot tokens for the corresponding percentage of the underlying ampl collateral that backs their holdings.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Evan Kuo","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ampleforth","content":"LOCATION"},{"type":"$1","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}