{"summary":"Crypto venture investor Vance Spencer took to Twitter Monday to outline how the industry writ large may not fully appreciate the bullish forces at play in the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238771\/frameworks-vance-spencer-thinks-crypto-market-sentiment-is-still-catatonic","publishDate":"2023-07-10T16:39:47","id":11501,"type":null,"title":"Framework&#x27;s Vance Spencer thinks crypto market sentiment is still &#x27;catatonic&#x27;","category":["MARKETS"],"content":["Crypto venture investor Vance Spencer took to Twitter on Monday to outline how the industry writ large may not fully appreciate the bullish forces at play in the market.","The co-founder of Framework Ventures <a href=\"https:\/\/twitter.com\/pythianism\/status\/1678435417828507648?s=20\" data-v-f87c67ca=\"\">noted<\/a> that market sentiment \"remains catatonic,\" namely because a number of crypto native firms are still \"nursing their wounds\" from the previous year while TradFi firms remain underexposed.&nbsp;","The comments come as a wide range of asset managers prepare to enter the market with new spot bitcoin exchange-traded funds, which Spencer expects to hit the market by the end of the year even though they have yet to be approved by regulators. It's a development he believes will open the door to \"ETF opportunities for other cryptoassets.\"","\"Crypto is in a far better place than anyone gives it credit for,\" Spencer said. \"History is on our side; we are replacing the financial system with software that nobody and everybody controls. Excited for the next few years and decades.\"","Speaking on Ethereum, Spencer said that the blockchain's successful transition to proof-of-stake from proof-of-work has caught the attention of major banking firms.","\"The economics of the ETH have been noticed by major banks, and research reports have started to trickle out,\" he wrote. \"There are 3 DeFi apps that are tracking to $100M of ARR this year (in a bear market), and 1-2 of those have a line of sight to $1Bn of 95% margin ARR (in a bull market).\"","The price of cryptoassets like ether are up significantly from all-time lows but still down more than 50% of the highs. Increased prices in various tokens have also yet to translate into a more active private market, with venture activity still stuck in the doldrums.&nbsp;","As previously <a href=\"https:\/\/www.theblock.co\/post\/238681\/web3-venture-funding-dropped-80-in-first-quarter\" data-v-f87c67ca=\"\">reported<\/a> by The Block, web3 venture funding plummeted in the first quarter of 2023, down 80% from the same period a year earlier.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"first quarter of 2023","content":"DATE"},{"type":"$1Bn","content":"MONEY"},{"type":"95%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Spencer","content":"PERSON"},{"type":"$100M","content":"MONEY"},{"type":"ARR","content":"ORGANIZATION"},{"type":"Vance Spencer","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}