{"summary":"At the weekend, someone bought paradigm.eth for $1.5 million. Only it wasn’t the VC firm Paradigm and there was some unusual activity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120211\/the-mystery-of-a-1-5-million-ethereum-name-purchase","publishDate":"2021-10-12T05:18:48","id":11509,"type":null,"title":"The mystery of a $1.5 million Ethereum name purchase","category":["ETHEREUM"],"content":["On October 9, an unknown wallet purchased the Ethereum name paradigm.eth for 420 ETH ($1.5 million), the largest such sale by a long way.","At first, observers speculated that it was the crypto-focused VC firm Paradigm, which has investments in a range of projects from centralized companies like Coinbase, BlockFi, Chainalysis, to DeFi projects like Compound, dYdX, Euler.&nbsp;","Yet the firm told Bradley Millegan, director of operations at the Ethereum Name Service, that it <a href=\"https:\/\/twitter.com\/BrantlyMillegan\/status\/1447295476957687816\" data-v-f87c67ca=\"\">was not behind the purchase<\/a> — begging questions as to who the mystery buyer is and what was the purpose of the massive sale.","Ethereum names are human-readable names like <i data-v-f87c67ca=\"\">example.eth<\/i> that can be associated with blockchain addresses to make it easier to send and receive crypto payments. Rather than sending money to a long and complicated Ethereum address, you just use the .eth name. Ethereum names can also be connected to other information, like email addresses and a Twitter account.","What we know is that the wallet had been bidding on paradigm.eth for months, making smaller offers. It wasn’t until the weekend that the previous owner of the Ethereum name accepted the offer.","But it appears to be some kind of prank or joke purchase. As Millegan <a href=\"https:\/\/twitter.com\/BrantlyMillegan\/status\/1447246131436601348\" data-v-f87c67ca=\"\">pointed out<\/a>, the Ethereum name’s records were set to some bizarre links. For a start, the buyer set the email to <a href=\"\/cdn-cgi\/l\/email-protection#5231332037372021123f31363d3c333e36217c313d3f\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"1a797b687f7f68695a77797e75747b767e6934797577\">[email&nbsp;protected]<\/span><\/a> — a bit of a long-running joke in the cryptosphere —&nbsp;before setting the associated image to the SushiSwap logo.&nbsp;","Other strange elements include the Twitter account pointing to VC firm a16z and the GitHub link to YFI founder Andre Cronje’s GitHub. Plus the description shows up as, “Skate on the Paradigm and shift it when I feel like.”","As one Twitter commentator <a href=\"https:\/\/twitter.com\/EnlightenedLime\/status\/1447248995882049537\" data-v-f87c67ca=\"\">pointed out<\/a>, “If this is a troll, it has to be the most expensive troll ever, right?”","Millegan acknowledged that the sale could be some kind of wash trading. This is the idea that somebody could be selling the name to themselves in order to make it look like a really expensive trade, while in reality they would be just shuffling money between their own wallets.","But this doesn’t particularly explain the previous bids that weren’t accepted (unless this was part of a strategy) and even if that was the case, they would have had to stump up some heavy fees to the NFT marketplace OpenSea where the sale was made — some $37,500.","If the sale was legitimate — even if for a prank — then it would rank in the upper echelons of highest domain name sales in history.&nbsp;","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bradley Millegan","content":"PERSON"},{"type":"$1.5 million","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Millegan","content":"PERSON"},{"type":"Chainalysis","content":"LOCATION"},{"type":"Euler","content":"PERSON"},{"type":"October 9","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"YFI","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum Name Service","content":"ORGANIZATION"},{"type":"$37,500","content":"MONEY"},{"type":"Andre Cronje","content":"PERSON"}],"hashtag":["CRYPTO","ETHEREUM"],"authors":["Tim Copeland","The Block"]}