{"summary":"The Block explores what&#x27;s to come for the Markets in Crypto Assets regulatory framework in the EU.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139404\/what-now-for-europes-landmark-crypto-regulatory-overhaul","publishDate":"2022-03-27T13:11:32","id":11514,"type":null,"title":"What now for Europe’s landmark crypto regulatory overhaul?","category":["POLICY"],"content":["The passage of the Markets in Crypto Assets, or MiCA, regulation out of the European Parliament’s ECON Committee last week generated a tornado of news coverage, including at The Block.","Particularly, language billed as a “bitcoin ban” kept <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137653\/new-amendments-on-eu-crypto-legislation-put-forward-that-could-limit-proof-of-work-cryptocurrencies\" data-v-f87c67ca=\"\">re-entering various drafts<\/a> of the legislation, which would in turn leak to the public.","While this threat was eye-catching, the narrative largely neglected the broader significance of MiCA and its passage out of committee, partly due to overarching unfamiliarity with European Union policymaking.","One could be forgiven for thinking that the European Parliament’s last version of MiCA is effectively law already. The reality is that the new regulation has a long road ahead of it.","It’s also far more significant than just the proffered proof-of-work restrictions.","Despite concerns that Green and Left members would challenge the bill in the plenary session, it passed without issue on March 24. The bill’s rapporteur — effectively, its sponsor and central advocate in Parliament — is Dr. Stefan Berger. Berger tweeted of the bill’s success, noting that the proof-of-work “ban” that had caused such a stir would not re-enter.","<a href=\"https:\/\/twitter.com\/hashtag\/MiCA?src=hash&amp;ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">#MiCA<\/a>: Gute Nachricht! Mein Mandat wird NICHT gechallenged. Ich werde nun in die Trilog-Verhandlungen gehen mit der Position, dass es keinen <a href=\"https:\/\/twitter.com\/hashtag\/PoW?src=hash&amp;ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">#PoW<\/a>-Ban geben wird. Das EU-Parlament gibt mir Rückenwind &amp; zeigt Innovationskraft \/1","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","While that is true for the purposes of MiCA, the PoW debate in the EU is not resolved. Part of Berger’s negotiation over MiCA within the ECON committee involved shunting the concerns over PoW’s energy use into the EU’s coming Taxonomy for Sustainable Finance.","As for MiCA itself, the regulation is now entering into trilogue debates, which is the backstage jockeying between the European Commission, European Council and Parliament itself. The Commission is the EU’s executive branch but plays a bigger formal role in the development of law than most. The Council, which unites the heads of each of the EU’s member states, sets general priorities rather than writing law.","The three do not formally publish their back and forth, which means that observers will likely be dependent on periodic leaks, much like what happened within the ECON Committee.","Forming the basis of these debates will be the three distinct templates for MiCA that each has already put forward, of which Parliament’s was just the last.","Many observers, hearing that Parliament has passed its version, interpret that as meaning that it is about to become law. That’s not true: It will enter into the back-and-forth between Parliament and the other entities. However, as EU Crypto Initiative co-founder Marina Markezic put it: “Nothing that is not in one of the three drafts will be in the final version.”","The Commission’s <a href=\"https:\/\/eur-lex.europa.eu\/legal-content\/EN\/TXT\/?uri=CELEX%3A52020PC0593\" data-v-f87c67ca=\"\">proposal<\/a> came first, all the way back in 2020, forming the basis of all subsequent work. The Council finalized its <a href=\"https:\/\/www.consilium.europa.eu\/media\/53105\/st14067-en21.pdf\" data-v-f87c67ca=\"\">proposal<\/a> last November, a significantly truncated form of policymaking that puts out more of a line-item wishlist than a full law. By comparison, the Parliament’s version is sprawling.","The three bodies, while having distinct roles, have been in conversation for the whole arc of MiCA’s development. Indeed, relative to the executive branch of most federal systems, the European Commission plays an outsized role in the legislative process — imagine if the US Treasury wrote and published the first draft of stablecoin legislation, for example.","However, these bills feature significant differences. Crypto industry observers generally found the Council’s version to be more restrictive but more solidly written than Parliament’s.","The function of the trilogues is to reconcile these disparate versions of law. And that’s not a short process.","“The trilogues are by nature a horse-trading process,” said Chris Hayes, a longtime lobbyist who recently moved to the Celo Foundation. “The Parliament made much more significant edits on the Commission proposal than the Council did.”","After those trilogues, the three branches hold a final vote to determine the fate of their agreement. But while the perimeters of their discussion are largely limited to their various versions of those texts, they encompass a lot of ground.","The fact is that EU lawmaking is a time-consuming process. Time is, consequently, a major factor in the key distinctions between the three visions for MiCA.","The European Commission’s version, for example, makes no mention of DeFi, which only captured the investing world’s attention at the end of 2020. NFTs are similarly absent. The European Council’s proposals mention the two subjects in only one passage each,","It was only during late-stage negotiations on the European Parliament’s ECON committee that MiCA overtly named DeFi, but it was in the context of a special carve-out for a fairly generous definition of decentralized autonomous organizations, or DAOs. That late-stage version attempted to expand the list of people able to offer a cryptocurrency in the EU to be:","“A legal entity established in the Union, a natural person having its residence in the Union, or other entity established or having seat in the Union and subject to the rights and obligations of the Union, or a decentralised autonomous organisation.”","The final passed version, however, is limited to a legal entity.","Another area of MiCA that the crypto industry may find especially concerning is the regulation’s posture towards stablecoins, which it calls “asset-referencing tokens.” Much of the stablecoin language clearly reflects the era of regulatory anxiety triggered by Facebook’s announcement of Libra in June 2020","“In their mind, all stablecoins are Libra,” said Faustine Fleuret. Fleuret, who leads French trade association ADAN, lamented that Parliament’s version basically requires a stablecoin issuer to be a bank. “This is a topic where things get worse and worse with time.”","The stablecoin debate is remarkably similar to <a href=\"https:\/\/www.theblockcrypto.com\/post\/134352\/treasury-official-touts-the-flexibility-of-bank-charters-for-stablecoin-issuers-during-senate-hearing\" data-v-f87c67ca=\"\">one happening in the US<\/a>, with the key difference being that US Congress seems resistant to the Treasury’s push to limit stablecoin issuance to banks.","Unlike the US, MiCA sets out the prohibition of interest-earning in stablecoins, with the Parliamentary version reading, plainly:","“Issuers of asset-referenced tokens or crypto-asset service providers shall not provide for interest or any other benefit related to the length of time during which a holder of asset-referenced tokens holds asset-referenced assets.”","That is, however, less aggressive than the Council’s version, which does not include the “length of time” note.","One key change in Parliament is that the latest MiCA sets aside algorithmic stablecoins from being defined as asset-referencing tokens, potentially saving decentralized stablecoins from having to get licensing.","And while the most recent language of MiCA did indeed get rid of the <a href=\"https:\/\/blockworks.co\/eus-crypto-bill-mica-heads-to-a-monday-vote-without-proof-of-work-ban\/\" data-v-f87c67ca=\"\">much-touted “Bitcoin ban,”<\/a> that subject is not off the table in trilogues. The only question is whether the parties who introduced it will want to spend the political capital necessary to bring it back.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ECON Committee","content":"ORGANIZATION"},{"type":"European Parliament’s ECON Committee","content":"ORGANIZATION"},{"type":"Union","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Union policymaking","content":"ORGANIZATION"},{"type":"Council","content":"ORGANIZATION"},{"type":"March 24","content":"DATE"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"Sustainable Finance","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Parlament gibt mir Rückenwind &amp; zeigt Innovationskraft \/1","content":"ORGANIZATION"},{"type":"Parliament","content":"LOCATION"},{"type":"Marina Markezic","content":"PERSON"},{"type":"MiCA","content":"PERSON"},{"type":"European Council and Parliament","content":"ORGANIZATION"},{"type":"Chris Hayes","content":"PERSON"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"EU Crypto Initiative","content":"ORGANIZATION"},{"type":"June 2020","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Green","content":"ORGANIZATION"},{"type":"Union","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Stefan Berger","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Berger","content":"PERSON"},{"type":"European Parliament’s ECON","content":"ORGANIZATION"},{"type":"US Congress","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Parliament —","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Faustine Fleuret","content":"PERSON"}],"hashtag":[],"authors":["Kollen Post","The Block"]}