{"summary":"Those hopeful that Hong Kong becomes a promised land for crypto can expect a clearer picture of regulatory demands as soon as next month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228567\/hong-kong-crypto-exchange-license-regulation","publishDate":"2023-04-27T03:16:02","id":11525,"type":null,"title":"Hong Kong regulators to unveil crypto exchange license guidelines in May","category":["POLICY"],"content":["Those hopeful that Hong Kong becomes a promised land for crypto can expect a clearer picture of regulatory demands in the region as soon as May.","Hong Kong’s Securities and Futures Commission intends to publish guidelines on its licensing regime for crypto exchanges in the coming month, according a Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-04-27\/hong-kong-sfc-to-issue-crypto-exchange-license-guidelines-in-may\" data-v-f87c67ca=\"\">report<\/a> that referenced comments made by the watchdog’s Chief Executive Officer Julia Leung at an unidentified event.","Leung also said at the event on Thursday that a consultation process that fed into the regulatory framework got more than 150 responses.","The Block <a href=\"https:\/\/www.theblock.co\/post\/213218\/hong-kong-lift-ban-retail-crypto-trading\" data-v-f87c67ca=\"\">reported<\/a> on Feb. 20 that authorities in Hong Kong were planning to lift a ban on retail trading of cryptocurrencies. At that time, the SFC also put operators on notice that all trading platforms would need to be licensed by June 24, or cease operations. The SFC said at the time that it was looking “to strike a better balance between investor protection and market development.”","Developments toward a more crypto-friendly regime in Hong Kong have been hailed across the industry — all the more so with authorities in Singapore believed to be taking a harder line following the collapse, last year, of the Terra blockchain and Three Arrows Capital, the hedge fund. Both outfits had at least part of their operations based in Singapore.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"’s Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Julia Leung","content":"PERSON"},{"type":"Feb. 20","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Leung","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"June 24","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Ryan Weeks","The Block"]}