{"summary":"BitDAO is set to become an anchor partner for AfricaDAO, an investment fund that wants to drive web3 adoption in Africa.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162698\/bitdao-to-fund-africadao-with-20-million-for-web3-adoption-in-africa","publishDate":"2022-08-10T07:20:20","id":11528,"type":null,"title":"BitDAO to fund AfricaDAO with $20 million for web3 adoption in Africa","category":["GOVERNANCE"],"content":["The BitDAO community has <a href=\"https:\/\/twitter.com\/BitDAO_Official\/status\/1557243995075579904\" data-v-f87c67ca=\"\">voted<\/a> in favor of a proposal to provide $20 million in funding to bootstrap a new decentralized autonomous organization called <a href=\"https:\/\/africadao.world\/\" data-v-f87c67ca=\"\">AfricaDAO<\/a>.","BitDAO, <a href=\"https:\/\/www.theblock.co\/linked\/108602\/bitdao-raise-peter-thiel-alan-howard-defi\" data-v-f87c67ca=\"\">formed in 2021<\/a>, aims to promote global crypto adoption by providing grants to projects and also supporting web3-based research and development efforts. AfricaDAO is a new investment fund created to accelerate web3 development in Africa.","Data from the voting <a href=\"https:\/\/snapshot.org\/#\/bitdao.eth\/proposal\/0x39cf0e816b696213b93e8602b3f903299f5c43995b493198b82a10e7be2c4eb0\" data-v-f87c67ca=\"\">page<\/a> shows the vote ended on Tuesday with unanimous approval from all participants. The vote saw participation from 38 wallet addresses that contributed 181 million BIT tokens (BitDAO’s native coin) in support of the proposal.","AfricaDAO’s venture investment strategy will focus on three main areas: funding rounds for African companies, investments in web3 talents on the continent and support for web3-based educational initiatives in Africa. According to the AfricaDAO proposal <a href=\"https:\/\/drive.google.com\/file\/d\/116m5tMxQ3Dhmd7DrgRF_dlURPYZpFruq\/view?usp=sharing2\/view?usp=sharingS8c9gwfU1ndIhXF6PNZrMs-G\/view?usp=sharingODqYJsyf800AqxQ\/view?usp=sharing\" data-v-f87c67ca=\"\">document<\/a>, 90% of its funds will go toward investments in target companies while 5% will be used to support African web3 talents. The remaining 5% will be split between investments in web3 education and covering the DAO’s operational expenses.","AfricaDAO has already drawn $105 million in soft commitments from several partners. BitDAO’s $20 million of funding, which is subject to legal review, will see it become an anchor partner of AfricaDAO. Other partners include Polygon and Synthetix, among others.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Africa","content":"LOCATION"},{"type":"$105 million","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}