{"summary":"The founding trio of crypto investment platform Bitpanda has quietly set up an investment vehicle.\nFounded in May last year per Austrian company register documents, it invested in crypto custodian Copper during its Series B round. \nDubbed Diamond Hand Ventures according to Austrian company filings, it has also invested in blockchain developer tooling startup Tatum, payments startup Payable, and Consola Finance. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181677\/bitpandas-founders-launch-their-own-venture-capital-firm-exclusive","publishDate":"2022-11-03T11:11:21","id":1153,"type":null,"title":"Bitpanda&#x27;s founders launch their own investment vehicle: Exclusive","category":["Venture Capital"],"content":["The founders of crypto investment platform Bitpanda have quietly set up an investment vehicle, following in the footsteps of other fintech founders who have set up similar side hustles.&nbsp;","Austrian company registers show that founding trio Eric Demuth, Paul Klanschek and Christian Trummer applied to set up a firm named Diamond Hand Ventures in May of last year.","Filings from Companies House, the UK business register, also show that it participated in crypto custodian Copper's <a href=\"https:\/\/www.theblock.co\/linked\/105168\/crypto-custodian-copper-closes-50-million-series-b-raise\" data-v-f87c67ca=\"\">$50 million<\/a> Series B round in the same month.&nbsp;","So far, it has also invested in blockchain developer tooling startup <a href=\"https:\/\/tatum.io\/tatum-investment\" data-v-f87c67ca=\"\">Tatum<\/a>, payments startup <a href=\"https:\/\/businesscloud.co.uk\/news\/fintech-raises-5-4m-to-modernise-business-payments\/\" data-v-f87c67ca=\"\">Payable<\/a>, and Consola Finance, a web3 accounting platform, according to a Bitpanda spokesperson who confirmed the new firm to The Block. Demuth has made angel investments in French fintech Finary and inclusion startup Talking Hands.&nbsp;","The new entity should be characterized as a special purpose vehicle as it allows the founders to make angel investments, the spokesperson said. It shouldn't be described as a venture capital firm as it won't take outside capital, they added.&nbsp;","\"They started investing as angels, but now the founders have a company that handles these transactions,\" Jacob Kobler, Consola founder and former crypto product lead at Bitpanda, said in an interview. \"It's super small and if you Google the name, you will see another venture capital firm with the same name.\"&nbsp;","Another firm named Diamond Hand Ventures does indeed <a href=\"https:\/\/www.diamondhandsventures.com\/\" data-v-f87c67ca=\"\">exist<\/a> — but this is not related to the Bitpanda founders' vehicle, the company's spokesperson confirmed.&nbsp;","The vehicle follows in the footsteps of other billionaire fintech founders who have set up investment firms. In May, Revolut founder Nik Storonsky <a href=\"https:\/\/www.forbes.com\/sites\/iainmartin\/2022\/05\/17\/revolut-ceo-nik-storonsky-to-launch-ai-led-venture-capital-fund\/?sh=34b384096224\" data-v-f87c67ca=\"\">launched<\/a> a venture capital fund. Powered by artificial intelligence, the new venture is called QuantumLight Capital and most recently <a href=\"https:\/\/www.theblock.co\/post\/170360\/revolut-founder-nik-storonsky-hires-ceo-for-his-ai-powered-vc-firm\" data-v-f87c67ca=\"\">hired<\/a> a CEO to lead its investments.&nbsp;","Checkout.com CEO Guillaume Pousaz founded his family office Zinal Growth in August last year. It <a href=\"https:\/\/www.theblock.co\/linked\/149384\/checkout-com-founder-backs-defi-platform-alloy-in-3-million-pre-seed-round\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">backed<\/a> DeFi platform Alloy in a $3 million pre-seed round in May.&nbsp;In March this year, The Block <a href=\"https:\/\/www.theblockcrypto.com\/news+\/138080\/inside-flat-capital-the-little-known-investment-company-founded-by-klarna-ceo-sebastian-siemiatkowski\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">interviewed Hanna Wachtmeister<\/a>, who helms Flat Capital, which is Klarna founder Sebastian Siemiatkowski's investment vehicle.&nbsp;","Bitpanda itself has encountered difficulties amid the current crypto bear market,&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/154137\/investment-platform-bitpanda-lays-off-730-employees\" data-v-f87c67ca=\"\">cutting<\/a> roughly a third of its workforce in June. It has since <a href=\"https:\/\/www.theblock.co\/post\/167952\/crypto-investment-app-bitpanda-adds-commodities-trading\" data-v-f87c67ca=\"\">continued<\/a> to roll out new products such as commodities trading.&nbsp;","<em data-v-f87c67ca=\"\">Correction: This story has been updated after a spokesperson for Bitpanda clarified the nature of the investment vehicle.&nbsp;<\/em>"],"hashtag":[]}