{"summary":"Curio Research has raised $2.9 million to support its development of blockchain gaming based on user-generated content. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209815\/bain-capital-crypto-backs-curio-research","publishDate":"2023-02-21T07:06:34","id":11539,"type":null,"title":"Bain Capital Crypto backs gaming firm creating on-chain diplomats","category":["METAVERSE & NFT"],"content":["Curio Research raised $2.9 million in seed funding as it sets out to change the mechanics of how users interact with blockchain-based games, beyond the financial incentives it says have driven the space so far.&nbsp;","Founded in 2022 by engineers and gamers Kevin Zhang and Yijia Chen, <a href=\"https:\/\/www.curio.gg\/\" data-v-f87c67ca=\"\">Curio’s<\/a> on-chain games are powered entirely by smart contracts. These enable a new way of multiplayer computation that allows all participants to contribute to what they call a \"shared universe\" of code and data. This, they say, leads to games built almost entirely by players.","“Despite the tremendous growth and innovation we have seen in the on-chain gaming space, we haven’t seen that many innovations that would truly differentiate the on-chain gameplay experience from that of traditional games,” said Chen in a company statement.","The round was led by Bain Capital Crypto, with participation from TCG Crypto, Formless Capital, Smrti Lab, Robot Ventures and various angel investors, according to the release.","The money will be used mainly to expand the team, with a focus on hiring blockchain engineers, a micro-economist, game designers and a client engineer, who will work on how the game looks and feels. Curio will also look to hire an art director and a community manager. Zhang and Chen are both fluent in Chinese, so there is the potential for expanding their search beyond the English-speaking market and into China.&nbsp;","The company's first game, Treaty, is an on-chain strategy game where users can write and deploy smart contracts. These so-called \"Treaties\" allow them to draft rules around how they interact with other players in the game, almost like a social contract.&nbsp;","Players are essentially on-chain diplomats, a company <a href=\"https:\/\/blog.curio.gg\/introducing-treaty\/\" data-v-f87c67ca=\"\">blog post<\/a> states.","A treaty could be a NATO-style agreement where upon joining and membership payment you’re forbidden from attacking other committee members. Or a national bank that issues USDC-backed tokens, forcing your trading partners who’ve signed to strictly use your national currency next time they swap in an in-game marketplace. It could be a profit-sharing agreement, letting guild leaders tax guild members every time they harvest resource ERC-20 tokens while ensuring members’ safety by issuing them advanced weaponry. It could even be a marketplace itself that restricts swap access to designated treaty members and awards special game-specific bonuses.","A screenshot of gameplay","Players are free to build any tooling, infrastructure or application they wish, such as custom asset marketplaces, lending primitives, guilds and more. This will involve developing the backend with user-generated content and composability in mind, the team said.&nbsp;","\"The type of content that the user created is in some ways no different than the type of content that we are creating. And they're both treated equally as part of the core game experience,\" said Zhang in an interview.","To be sure, getting to a point where users building content without specific coding skills will not be easy.&nbsp;How the tooling evolves will be a gradual process, will be partially dependent on how the tooling for the Ethereum blockchain develops, and will partly shape the future of the game.","\"You can take what other people have done and improve it,\" said Zhang. \"I think the remixing there is really powerful.\"","\"It's very likely that we'll have NFTs, which are the building block of the game,\" Chen added. These NFTs could be a source of revenue, bringing in money through primary and secondary sales. The team is also thinking about having a tax on in-game transactions to bring in cash, but that would also be down the line.&nbsp;","So far, Curio has had between 200 to 300 players trial the game, with the feedback gleaned informing its next iteration.&nbsp;","In addition to developing games, Curio is building in-house custom infrastructure that will allow on-chain games to be more accessible.","For now, Curio is a fully-crypto game, with no fiat onramp built in. This could be added at a later date, the team said. A native token is not currently part of the roadmap.&nbsp;","Curio's backing follows a flurry of funding for projects in the NFTs and gaming subsector — the most <a href=\"https:\/\/www.theblock.pro\/research\/january-blockchain-funding-recap-209442\" data-v-f87c67ca=\"\">popular subsector<\/a> in terms of percentage of total funding since August 2021, according to The Block Research.","Last month, crypto gaming platform Oh Baby Games <a href=\"https:\/\/www.theblock.co\/post\/206950\/oh-baby-games-comes-out-of-stealth-announcing-6-million-funding-round\" data-v-f87c67ca=\"\">raised<\/a> a $6 million seed round as it emerged from stealth. In the same month, Neopets Meta, the web3 version of the popular virtual pet game, also <a href=\"https:\/\/www.theblock.co\/post\/203724\/neopets-meta-raises-4m-in-funding-from-polygon-ventures-blizzard-avalanche\" data-v-f87c67ca=\"\">raised<\/a>&nbsp;a $4 million round.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Curio Research","content":"ORGANIZATION"},{"type":"Yijia Chen","content":"PERSON"},{"type":"Chen","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"NATO","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"Formless Capital","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Neopets Meta","content":"ORGANIZATION"},{"type":"$2.9 million","content":"MONEY"},{"type":"Kevin Zhang","content":"PERSON"},{"type":"TCG Crypto","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Zhang","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["PLAY2EARN","SEED &AMP; PRE-SEED"],"authors":["Lucy Harley-McKeown","The Block"]}