{"summary":"Hong Kong is unlikely to introduce a government-backed stablecoin, according to a senior researcher at OKG.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238112\/government-backed-hong-kong-stablecoin-is-unlikely-says-senior-researcher-at-okg","publishDate":"2023-07-06T11:49:31","id":11530,"type":null,"title":"Government-backed Hong Kong stablecoin is unlikely, says senior researcher at OKG","category":["POLICY"],"content":["Hong Kong is unlikely to introduce a government-backed stablecoin, claimed according to a senior researcher at OKG.","On Tuesday, a Hong Kong University of Science and Technology <a href=\"https:\/\/wublock.substack.com\/p\/a-proposal-for-hong-kong-to-issue?sd=pf\" data-v-f87c67ca=\"\">paper<\/a> advocated for a government-issued HKD stablecoin to compete with dollar-denominated coins. However, Jason Jiang, senior researcher at OKG, said it is unlikely the Hong Kong government will issue a HKD stablecoin backed by government foreign reserves, \"given the existence of the digital HKD and the uncertain regulatory framework for stablecoins.\"","\"There is little mention of it in the official statements from the Hong Kong government, instead, the government encourages innovative practices such as digital HKD and tokenized deposits,\" he told The Block.","Jiang thinks the Hong Kong Monetary Authority will continue to execute their digital Hong Kong dollar in three stages, while accelerating the formulation of a stablecoin regulatory framework.","The academic proposal had argued a privately issued HKDG <a class=\"glossary-only-link\" href=\"https:\/\/beincrypto.com\/learn\/what-is-stablecoin\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">stablecoin<\/a> could not compete with U.S. dollar-denominated stablecoins, hence the need for backing by government reserves. In addition, it stated the coin would improve the Hong Kong dollar’s cross-border liquidity and increase transaction efficiency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"OKG","content":"ORGANIZATION"},{"type":"Hong Kong University of Science and Technology","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jason Jiang","content":"PERSON"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["CBDCS","CRYPTO"],"authors":["Brian McGleenon","The Block"]}