{"summary":"DYdX Foundation discussed a transition of the v3 governance token to become the native asset of the dYdX Chain. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243270\/dydx-evaluates-transitioning-token-to-native-asset-of-upcoming-layer-1-chain-on-cosmos","publishDate":"2023-08-04T10:56:02","id":11538,"type":null,"title":"DYdX evaluates transitioning token to native asset of chain on Cosmos","category":["COMPANIES"],"content":["DYdX Foundation, the non-profit behind the decentralized derivatives exchange, discussed transitioning the governance token of dYdX version 3 to serve as the native asset for the upcoming dYdX Chain, which is currently in the <a href=\"https:\/\/www.theblock.co\/post\/236997\/dydx-to-launch-public-testnet-of-cosmos-based-chain-on-july-5\" data-v-f87c67ca=\"\">test phase<\/a>.","A decision may be made through governance by the dYdX community at a later date, depending on if and when the dYdX Chain is deployed.","\"The dYdX community could elect to use DYDX, the governance token of dYdX v3, as the Layer token of the dYdX Chain (if and when deployed after mainnet release),\" dYdX Foundation <a href=\"https:\/\/dydx.foundation\/blog\/exploring-the-future-of-dydx\" data-v-f87c67ca=\"\">wrote<\/a> in an official blog post.&nbsp;","Founded in 2018, dYdX is currently the largest decentralized derivatives exchange with trading volume of nearly <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/dydx_perpetual\" data-v-f87c67ca=\"\">$600 million<\/a> over the last 24 hours, according to CoinGecko data.","As the chain gears up for its debut with the release of version 4 later this year, the potential functions of its native asset — which may encompass staking, governance, and rewards — are under evaluation.","The dYdX community may consider a proposal to transition the token from its current status as an ERC-20 token on Ethereum to its own Cosmos SDK-based network, according to dYdX Foundation .","“If such as election were to materialize, given that DYDX is an Ethereum-based ERC-20 token, the DYDX token would need to be migrated from Ethereum to dYdX Chain,” the foundation wrote.&nbsp;","<em data-v-f87c67ca=\"\">Correction: A previous version of the article cited the dYdX team instead of dYdX Foundation.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"20","content":"DATE"},{"type":"dYdX Foundation","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}