{"summary":"Pontem has raised $6 million in a funding round co-led by Faction and Lightspeed Venture Partners.\nThe capital will be used to enable developers to build apps that are both Ethereum Virtual Machine and Move-compatible.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271967\/pontem-raises-6-million-to-enable-ethereum-move-compatible-apps","publishDate":"2024-01-11T12:00:05","id":1154,"type":null,"title":"Pontem raises $6 million to enable Ethereum and Move-compatible apps","category":["Venture Capital"],"content":["Web3 product development studio Pontem has raised a $6 million financing round, co-led by Faction and Lightspeed Venture Partners.&nbsp;","Participants in the round also include Pantera Capital, Aptos Foundation, Wintermute, Altonomy, Shima Capital and Kraken Ventures, among others.","Pontem plans on deploying the funds to enable developers to build apps that are both Ethereum Virtual Machine and Move-compatible — expanding the usage of the Move programming language beyond the Aptos and Sui blockchains.","\"We aim to deploy this influx of capital to increase usage of Move beyond Aptos and Sui, empowering dapp teams with a programming language that enables devs to add new features that support the security and scalability needed for mass adoption,\" Pontem co-founder Alejo Pint said in a statement. \"Vendor lock into the EVM is only a temporary problem. We aim to solve this problem on Ethereum to enable Web2 devs to more easily and confidently enter the space.\"","\"Pontem is building critical primitives for the Move ecosystems,\" Faction Partner Banafsheh Fathieh said. \"Pantera is excited to be investing into Pontem and help fuel the Move and Aptos ecosystem. We believe the team has been doing a tremendous job of building the necessary financial and technical infrastructure to bring consumers and developers to the decentralized web,\" Pantera Capital Managing Partner Paul Veradittakit added.","This latest funding round brings Pontem's total raised capital to $10.5 million, following a $4.5 million raise in June 2021 via a private token sale led by Mechanism Capital and Kenetic Capital, alongside Delphi Ventures and Animoca Brands.","Pontem's technology was originally developed by Aptos team members. Aptos is a relatively new Layer 1 blockchain based on the Move programming language developed at Meta — composed of people from Facebook’s now shut-down Diem stablecoin project.","Move is a Rust-derived programming language designed for creating secure and efficient smart contracts. Unlike the EVM that utilizes the Solidity language, the Move VM aims to enhance throughput via parallel processing. Pontem also argues that Move is more appealing for Web2 developers from traditional finance and tech sectors looking to build in Web3 as they are already accustomed to similar static-type languages.","The capital is earmarked for developing Move Virtual Machine products on EVM-compatible blockchains like Ethereum, including the new Move-based Layer 2 Lumio — an optimistic rollup on Ethereum that leverages alternative Layer 1s like Aptos to process transactions.","Pontem claims products already deployed on Aptos, including the Pontem Wallet and Liquidswap DEX, have garnered 40,000 weekly active users and up to $1 million in daily volume, respectively.","Pontem also said it plans to add support for the Solana Virtual Machine and other blockchain languages in the future.","<span class=\"c-mrkdwn__highlight\" data-v-f87c67ca=\"\"><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer<\/i><\/span><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">: Evgeny Gaevoy, the founder and CEO of&nbsp;<\/i><span class=\"c-mrkdwn__highlight\" data-v-f87c67ca=\"\"><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Wintermute<\/i><\/span><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">, previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/i>"],"hashtag":["APTOS","ETHEREUM","SUI"]}