{"summary":"Bitcoin call options are concentrated above a strike price of $60,000 for June&#x27;s end-of-month expiry, according to Deribit data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278471\/bitcoin-call-options-cluster-above-60000-indicating-post-halving-bullish-sentiment-analyst-says","publishDate":"2024-02-21T15:46:31","id":11545,"type":null,"title":"Bitcoin call options cluster above $60,000 indicating post-halving bullish sentiment, analyst says","category":["MARKETS"],"content":["According to one analyst, bitcoin options are signaling a bullish sentiment post-halving, evidenced by the strike positioning and put-call ratio for the end-of-month expiry in June.","\"The June expiry is a good gauge for halving sentiment and our charts shows much more upside positioning. The put-call ratio is significantly lower in June, at 0.28 versus 0.55 for March, and strike positioning is also higher,\" Deribit Chief Commercial Officer Luuk Strijers told The Block.","A put-call ratio of less than 1 implies bullish sentiment, indicating more interest in potential upside (calls). In contrast to this, a put-call ratio greater than 1 typically suggests bearish sentiment, indicating more interest in downside protection (puts).&nbsp;","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.0084%\n    <\/span><\/a> <!----><\/span><\/span> call options concentrate above a strike price of $65,000 for June's, post-halving, end-of-month expiry. Image: Deribit.<\/span><\/span>","Strijers highlighted Deribit <a href=\"https:\/\/metrics.deribit.com\/options\/BTC\" data-v-f87c67ca=\"\">data<\/a> for June's end-of-month expiry, following <a href=\"https:\/\/www.theblock.co\/post\/276201\/bitcoins-price-decline-has-been-exacerbated-by-miners-selling-reserves-ahead-of-halving-bitfinex-says\" data-v-f87c67ca=\"\">bitcoin's expected halving event<\/a> in April, which could see the market experience supply-side pressure due to reduced BTC rewards to miners. For the June 28 expiry, the Deribit charts show a cluster of call options for strike prices from $60,000 to $75,000.","The concentration of bitcoin calls at the $60,000 strike price and above suggests that a significant proportion of market participants have a particular interest or expect that the price of bitcoin will rise above this level.","For the upcoming March quarterly and end-of-month expiry, Strijers also observed a large concentration of call options at a strike price of $60,000. However, he suggested that a slightly different motivation is at play in this case. \"In March, some traders might be speculating on volatility moves upwards, as we approach the halving,\" he said.","Strijers said call optionsare relatively overbought for expiries occurring around and after bitcoin's expected April halving event. By \"overbought,\" he is referring to increased demand for call options compared to put options in these months.","\"The put-call skew is clearly changing after March expiry indicating calls are relatively overbought post halving indicating bullish expectations,\" Strijers said.","<span data-v-f87c67ca=\"\">The put-call skew from February to December 2024. Image: Deribit.<\/span>","The next Bitcoin halving, slated for April this year, will cut the miners' reward for validating and adding new blocks to the blockchain by 50%.","This halving event, which occurs roughly every four years or after every 210,000 blocks mined, aims to reduce the block reward. The previous halving in 2020 decreased the reward from 12.5 bitcoin to 6.25 bitcoin.","After approximately 840,000 blocks are mined, the upcoming halving will further reduce the block reward from 6.25 BTC to 3.125 BTC per block. This built-in feature of the Bitcoin protocol helps manage the new bitcoin supply, gradually making it scarcer.","Bitcoin was changing hands for $51,023 at 3:07 p.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-02bbd79b=\"\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>. The&nbsp;<a href=\"https:\/\/www.theblock.co\/indices\/top\/277090\/gmci-30-gm30\" data-v-02bbd79b=\"\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">GM 30 Index<\/a>, representing a selection of the top 30 cryptocurrencies, slipped 2.36% to 111.35 in the past 24 hours.","<span data-v-f87c67ca=\"\">Bitcoin decreased by over 1% in the past 24 hours. Image: The Block.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GM","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"April this year","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"June 28 expiry","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"3:07 p.m. ET","content":"TIME"},{"type":"April","content":"DATE"},{"type":"$51,023","content":"MONEY"},{"type":"$65,000","content":"MONEY"},{"type":"$60,000","content":"MONEY"},{"type":"2.36%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Strijers","content":"PERSON"},{"type":"March quarterly","content":"DATE"},{"type":"December 2024","content":"DATE"},{"type":"June","content":"DATE"},{"type":"$75,000","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"+0.0084%","content":"PERCENT"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}