{"summary":"Police arrested ACE founder David Pan and 13 other suspects and seized assets worth at least $6.4 million, local media reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270429\/founder-of-major-taiwanese-crypto-exchange-ace-arrested-for-alleged-fraud-report","publishDate":"2024-01-04T11:38:44","id":11543,"type":null,"title":"Founder of major Taiwanese crypto exchange ACE arrested for alleged fraud: report","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">The founder of ACE Exchange, one of the largest crypto exchanges in Taiwan, was arrested on Wednesday on suspicion of orchestrating fraud, local media Liberty Times <a href=\"https:\/\/news.ltn.com.tw\/news\/society\/breakingnews\/4542019\" data-v-f87c67ca=\"\">reported<\/a>. The police seized assets worth at least NT$200 million ($6.4 million) in illegal gains.<\/span>","<span data-v-f87c67ca=\"\">David Pan, the founder of ACE, was reportedly arrested along with 13 other suspects for alleged fraud. Pan and a co-conspirator surnamed Lin are accused of collaborating for three years, using false advertisements on social media to lure investors into putting money into worthless cryptocurrencies, including MOCT, according to the report.<\/span>","<span data-v-f87c67ca=\"\">The police on Wednesday raided multiple locations in Taiwan, including the office of ACE Exchange, and seized NT$111.52 million ($3.6 million) cash from Lin’s residence, the report said. The police also seized cryptocurrencies worth over NT$100 million, bringing the total seized assets to over NT$200 million, according to the report.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">An ACE Exchange spokesperson told The Block that the arrested suspects are not ACE employees. The spokesperson added that although Pan founded the company, he stopped participating in daily operations in 2022. ACE Exchange is currently cooperating with the police investigation as a witness, the spokesperson noted.<\/span>","<span data-v-f87c67ca=\"\">Following the news of the alleged fraud involving its founder, ACE Exchange — which listed MOCT in 2019 — plans to delist the MOCT-TWD trading pair on Jan. 8. The spokesperson said that many token holders had previously redeemed their tokens for various coupons for meals or hotel accommodations.<\/span>","<span data-v-f87c67ca=\"\">Established in 2018, ACE is one of the largest crypto exchanges in Taiwan, alongside BitoGroup and MaiCoin. In a <\/span><a href=\"https:\/\/helpcenter.ace.io\/hc\/zh-tw\/articles\/27214143164953--ACE%E7%8E%8B%E7%89%8C%E6%B3%95%E5%B9%A3%E5%8A%A0%E5%AF%86%E8%B2%A8%E5%B9%A3%E4%BA%A4%E6%98%93%E6%89%80%E8%81%B2%E6%98%8E%E7%A8%BF-\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> released on Thursday addressing the news, ACE explained that the exchange regularly conducts market reviews to assess listed tokens, and those that fail to meet the criteria would be delisted. <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"NT$111.52 million ($3.6 million","content":"MONEY"},{"type":"David Pan","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"NT$100 million","content":"MONEY"},{"type":"Taiwan","content":"LOCATION"},{"type":"Jan. 8","content":"DATE"},{"type":"NT$200 million ($6.4 million","content":"MONEY"},{"type":"MaiCoin","content":"ORGANIZATION"},{"type":"NT$200 million","content":"MONEY"},{"type":"Liberty Times","content":"ORGANIZATION"},{"type":"ACE Exchange","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"TWD","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","ASIAN REGULATION","CRIME"],"authors":["Timmy Shen","The Block"]}