{"summary":"MoonPay, the crypto payments business, has appointed former Coinbase UK boss Zeeshan Feroz as chief growth officer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97884\/ex-coinbase-chief-feroz-moonpay","publishDate":"2021-03-11T03:39:21","id":11541,"type":null,"title":"Ex-Coinbase UK chief Zeeshan Feroz joins MoonPay","category":["BITCOIN"],"content":["MoonPay, the crypto payments business, has appointed former Coinbase UK boss Zeeshan Feroz as chief growth officer.","Feroz stood down as CEO of Coinbase UK in August of last year and told The Block in a recent interview that he has since been advising a number of crypto businesses. He <a href=\"https:\/\/www.theblockcrypto.com\/post\/93458\/former-coinbase-uk-boss-joins-crypto-payments-group-advisor\" data-v-f87c67ca=\"\">joined crypto banking services firm BCB Group<\/a> as an advisor in February.","Launched in 2019, MoonPay builds payments infrastructure for crypto, helping other firms build smooth “on-and-off-ramps” for converting fiat currencies into crypto and vice-versa, and supporting a number of payment methods – from card payments to <a href=\"https:\/\/www.theblockcrypto.com\/daily\/92950\/europe-open-banking-uk-crypto-wallet-payments\" data-v-f87c67ca=\"\">open banking-enabled account-to-account transfers<\/a>.","“We’re democratising this key infastrucutre to bring more mainstream adoption to the space,” Ivan Soto-Wright, MoonPay’s co-founder and CEO, told The Block. “MoonPay is your passport to the world of crypto and the crypto economy.”","Already active in more than 160 countries with around 250 corporate partners including wallet operators Bitcoin.com and ZenGo, Feroz will oversee MoonPay’s continued expansion and sniff out new revenue streams.","Asked how MoonPay would fend off the likes of Visa, which <a href=\"https:\/\/www.ledgerinsights.com\/visa-anchorage-bank-customers-trade-digital-assets-first-boulevard\/\" data-v-f87c67ca=\"\">recently began<\/a> working with crypto bank Anchorage to enable other firms to begin offering crypto trading, Feroz said MoonPay is differentiated in that it offers “a complete package”. For businesses wanting to add crypto trading, MoonPay handles identity verification in accordance with local Know Your Customer (KYC) rules, payments from fiat into crypto, and conversion through partnerships with various exchanges.","MoonPay has not raised any external investment to date, but said in a press release that it grew revenues by over 1,000% over the past 12 months (without disclosing exact figures). Soto-Wright told The Block the firm, which is already profitable, has been mostly bootstrapped this point – though he added that it has made use of credit facilities to help aid its growth.","On March 10, MoonPay unveiled a new non-fungible token (NFT) product, offering crypto firms a suite of payment tools for launching an NFT marketplace. NFTs have exploded in popularity recently, particularly in the art and collectibles sector, in which hundreds of thousands of dollars at a time are being spent. &nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"Anchorage","content":"LOCATION"},{"type":"1,000%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"MoonPay","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Coinbase UK","content":"ORGANIZATION"},{"type":"Ivan Soto","content":"PERSON"},{"type":"Feroz","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"BCB Group","content":"ORGANIZATION"},{"type":"March 10","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Wright","content":"PERSON"},{"type":"MoonPay","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}