{"summary":"Aevo is also switching to Celestia in the near term and planning to add yield strategies and incentives going ahead.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274039\/aevo-intends-to-open-up-its-rollup-for-other-protocols-to-build-on-it","publishDate":"2024-01-23T10:10:02","id":11542,"type":null,"title":"Aevo intends to open up its rollup for other protocols to build on it","category":["CRYPTO ECOSYSTEMS"],"content":["Derivatives platform Aevo intends to open up its Ethereum-based rollup to support other protocols, in a bid to expand its ecosystem.","<span data-v-f87c67ca=\"\">\"The primary angle here is we are currently built on our own rollup — but Aevo exchange is currently the only app on this rollup,\" <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ribbon Finance <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248518\/ribbon-finance-rbn-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/RBN_64x64.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">RBN<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.86%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Julian Koh told The Block. \"Our plan is basically to open this up for other [developers] as well and build an ecosystem around our exchange.\"<\/span>","Aevo is a platform for options and derivatives trading. It operates on its own rollup, which is a Layer 2 network built using the OP Stack and running on top of the Ethereum blockchain. The platform is also switching in the near term to use Celestia to store some of its transaction data in a move to save costs.","Expanding its rollup is part of a roadmap that Koh <a href=\"https:\/\/twitter.com\/juliankoh\/status\/1748008190326034631\" data-v-f87c67ca=\"\">said on X<\/a> will be unveiled over the next few weeks. He noted on X that the project will be taking an aggressive approach when it comes to growth.","Ribbon Finance, a protocol built around vaults, originally launched Aevo as a separate platform but decided to <a href=\"https:\/\/gov.ribbon.finance\/t\/rgp-33-merge-ribbon-finance-into-aevo\/709\" data-v-f87c67ca=\"\">merge the projects<\/a> under the Aevo branding in July 2023. An Aevo token will be launched as part of the rebrand, with RBN token holders set to be migrated to it at a 1:1 exchange rate.","After the rebrand, Aevo is planning to introduce an incentive program with the goal of increasing the platform’s metrics, Koh said.","Aevo has already seen steady growth in the last few months. It has nearly reached $50 million in value locked in its smart contracts and is currently seeing around $640 million of weekly volume, <a href=\"https:\/\/defillama.com\/protocol\/aevo\" data-v-f87c67ca=\"\">according to DefiLlama<\/a>.","Koh attributes this in part to the platform's yield-bearing balances. When a user deposits their crypto to the platform, it's sent to MakerDAO to generate yield. The user is given a derivative token to trade on the Aevo platform, which they can redeem for the underlying assets. This allows traders to see their capital generate yield while using it for trading.","Aevo is planning to move further into yield offerings, taking a leaf from Ribbon Finance. In the first quarter of this year, it hopes to launch yield strategies, offering the platform's users the option to put their crypto in various set ups designed to generate a return. With these strategies, the tokens will be locked up and not available for trading.","A key focus for Aevo that may have helped drive up demand has been listing tokens for pre-launch trading. This is where a token is known to be on the way soon, often in the form of an airdrop, and typically where recipients know their expected allocation in advance. By supporting pre-launch trading, this lets traders hedge against their airdrops or try to lock in certain prices.","\"I think each subsequent pre-launch market that we have launched has gotten more and more traction, more users, more attention, just more general interest in trading them. So, I think there's a strong market fit every time we launch a new pre-launch market because [they generate] a lot of attention and people do want to speculate on these things before they go live,\" Koh said.","He added that some of the projects can launch at multi-billion dollar valuations, creating opportunities for those who want to speculate on what the market is going to be beforehand. He noted that Jupiter was the biggest example of this, with its pre-launch valuation rising from $1 billion to highs of $8 billion. \"We try to target the most hyped airdrops or the most hyped token launches,\" he said.","While such trading accounts for a small percentage of the exchange’s volume, Koh said that these markets generate a lot of attention and help to bring new traders to its platform.&nbsp;","As for the recent launches of <a href=\"https:\/\/www.theblock.co\/tag\/spot-bitcoin-etf\" data-v-f87c67ca=\"\">spot bitcoin ETFs<\/a> in the U.S., Koh said that it doesn't particularly impact the decentralized exchange space right now as the latter's volumes are small compared to centralized exchanges. He said the ETFs will enable some institutions to get exposure to crypto but they were never coming to DeFi anyway. Instead, he said the way to find growth will be to encourage crypto traders using centralized exchanges to try out their decentralized counterparts — something that the incentives program will look to target.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$640 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Ribbon Finance <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248518\/ribbon-finance-rbn-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/RBN_64x64.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">RBN","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"-1.86%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Julian Koh","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Koh","content":"PERSON"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"Ribbon Finance","content":"ORGANIZATION"},{"type":"Aevo","content":"PERSON"},{"type":"RBN","content":"ORGANIZATION"},{"type":"first quarter of this year","content":"DATE"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"},{"type":"$8 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["DERIVATIVES","DEXS","ETHEREUM"],"authors":["Tim Copeland","The Block"]}