{"summary":"Nearly 1.1 million ether — worth $2 billion — in accumulated rewards will be available for withdrawal after Shapella, according to on-chain estimates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225906\/ethereum-rewards-liquid-shapella","publishDate":"2023-04-12T09:14:21","id":11551,"type":null,"title":"Ethereum rewards worth over $2 billion will be liquid five days after Shapella","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">More than 1.1 million ether — worth $2 billion — in accrued validator rewards will be available to be claimed, according to on-chain <a href=\"https:\/\/wenmerge.com\/\" data-v-f87c67ca=\"\">estimates<\/a>, following Ethereum's Shapella upgrade set to take place today.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Shapella will finally allow users and validators to access their staked ETH, which has been inaccessible since Ethereum <a href=\"https:\/\/www.theblock.co\/linked\/86179\/eth2-beacon-launch-staking\" data-v-f87c67ca=\"\">introduced<\/a> its staking layer, the beacon chain, in December 2020. The upgrade will enable regular depositors, independent validators and those utilizing staking service providers to access rewards accumulated over the past two years. These rewards will be paid out in \"partial withdrawals\" representing 6% of the total 18 million ETH currently staked on the network.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Two <a href=\"https:\/\/www.theblock.co\/post\/225655\/ethereum-shapella\" data-v-f87c67ca=\"\">withdrawal options<\/a> will be available through the Shapella upgrade: partial and full. Partial withdrawals will be distributed to validators automatically, maintaining their validator balance at 32 ETH. In contrast, full withdrawals involve closing the validator and recovering the entire staked balance.<\/span>","<span data-v-f87c67ca=\"\">With each Ethereum block, partial withdrawals will automatically be sent to up to 16 validators every 12 seconds. <\/span><span data-v-f87c67ca=\"\">However, not all rewards will be claimed immediately. Only validators with a <a href=\"https:\/\/notes.ethereum.org\/@launchpad\/withdrawals-faq#:~:text=mechanism%20is%20complete.-,Q%3A%20What%20are%200x00%20and%200x01%20withdrawal%20credentials%20prefixes%3F,currently%20either%200x00%20or%200x01%20.\" data-v-f87c67ca=\"\">\"0x01\" withdrawal credential<\/a> will participate in the automatic process when receiving the said rewards. <\/span>","<span data-v-f87c67ca=\"\">Only 44% have registered to claim these partial withdrawals, according to a <a href=\"https:\/\/insights.glassnode.com\/the-week-onchain-week-15-2023\/\" data-v-f87c67ca=\"\">report<\/a> by crypto analytics firm Glassnode. This suggests that the remaining validators will not automatically receive these rewards unless they change their credentials after the upgrade goes live. In a hypothetical scenario where all validators sign up to receive these rewards, the process would take around five days for the current 562,000 validator entities, Glassnode estimated.<\/span>","<span data-v-f87c67ca=\"\">Also, the impact of the above partial withdrawals is separate from full withdrawals. Regarding full withdrawals or exits after Shapella, Ethereum will permit a daily limit of 1,800 validators to completely un-stake, allowing up to <a href=\"https:\/\/www.theblock.co\/post\/225655\/ethereum-shapella\" data-v-f87c67ca=\"\">57,600 ETH ($109 million)<\/a> in full withdrawals per day. <\/span><span data-v-f87c67ca=\"\">This equates to a maximum of 288,000 ETH in the first five days. <\/span><span data-v-f87c67ca=\"\">This 1,800 limit is enforced due to a churn rate that is intended to prevent excessive un-staking since only eight validators per epoch can request to exit the network and close their stake.<\/span>","<span data-v-f87c67ca=\"\">Considering both partial and full withdrawals, around 1.4 million ETH ($2.6 billion) will be accessible or liquid within the first five days after Shapella. However, this figure represents the maximum liquid ether that could theoretically be withdrawn, and the actual amount of withdrawn and potentially sold ether will be determined at the time.<\/span>","<span data-v-f87c67ca=\"\">Glassnode <a href=\"https:\/\/insights.glassnode.com\/the-week-onchain-week-15-2023\/\" data-v-f87c67ca=\"\">estimated<\/a> that 170,000 ETH ($317 million) may be sold by validators in the week following Shapella, which it believes could have an \"acceptable impact\" on the price of ether.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2020","content":"DATE"},{"type":"6%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$109 million","content":"MONEY"},{"type":"Shapella","content":"PERSON"},{"type":"44%","content":"PERCENT"},{"type":"$2.6 billion","content":"MONEY"},{"type":"$317 million","content":"MONEY"},{"type":"Glassnode","content":"PERSON"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}