{"summary":"The SEC released an investor alert on Tuesday that warned would-be investors about the risk involved with initial exchange offerings or IEOs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/52957\/sec-warns-investors-about-investing-in-initial-exchange-offerings","publishDate":"2020-01-14T12:12:08","id":11559,"type":null,"title":"SEC issues warning about investing in initial exchange offerings","category":["REGULATION"],"content":["The SEC released an investor alert on Tuesday that warned would-be investors about the risk involved with initial exchange offerings or IEOs.","<a href=\"https:\/\/www.sec.gov\/oiea\/investor-alerts-and-bulletins\/ia_initialexchangeofferings\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">The release<\/a>, published by the Office of Investor Education and Advocacy, advised investors to \"be cautious if considering an investment in an IEO\" because promises around such offerings \"can be used improperly to entice investors with the false promise of high returns in a new investment space.\"","Notably, the SEC said that \"IEOs may be conducted in violation of the federal securities laws and lack many of the investor protections of registered and exempt securities offerings.\"","On the question of whether an IEO constitutes an offering of securities, the agency drew a line to its assessment of initial coin offerings, or ICOs, and the circumstances under which offered tokens might be considered securities. The SEC stated:","\"As in the case of ICOs, depending on the facts and circumstances of the offering, the offering may involve the offer and sale of securities.&nbsp; This means the IEO may be subject to&nbsp;registration&nbsp;requirements that apply to offerings under the federal securities laws.&nbsp; Among other things, registration means that the company offering the digital asset has to provide important disclosures about itself, its business, the digital asset offered, and the terms of the offering to investors.\"","Other areas of focus include whether a platform that offers them is a securities platform or a broker-dealer and whether investors can buy into IEOs conducted by companies that are based overseas.","\"Any offering purporting to avoid the federal securities laws because it is occurring on an overseas trading platform but otherwise allows persons from the United States to invest is a red flag,\" the agency noted.","Recent announcements from industry players about upcoming IEOs include <a href=\"https:\/\/www.theblockcrypto.com\/daily\/52625\/bitcoindotcom-50-million-exchange-token-sale\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Bitcoin.com<\/a>, which according to published documents wants to raise $50 million. In the materials, the firm stressed that the token would not be made available in the U.S.&nbsp;","In September, Coinbase's head of institutional sales in Asia <a href=\"https:\/\/www.theblockcrypto.com\/linked\/39292\/crypto-exchange-coinbase-could-soon-launch-an-ieo-platform\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">indicated<\/a> that the crypto exchange startup is considering an entry into the IEO space.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Office of Investor Education","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"IEO","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["SEC"],"authors":["Michael McSweeney","The Block"]}