{"summary":"Crypto liquidity provider B2C2 has launched a new derivative product\nIt allows clients to trade gold against bitcoin\nB2C2’s founder and CEO, Max Boonen, told The Block that clients can trade an ounce of gold priced in bitcoin, and settled in bitcoin","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42742\/in-first-crypto-market-maker-b2c2-launches-a-gold-derivative-settled-in-bitcoin","publishDate":"2019-10-10T03:00:18","id":1155,"type":null,"title":"In first, crypto market maker B2C2 launches a gold derivative, settled in bitcoin","category":["Bitcoin"],"content":["B2C2, a cryptocurrency liquidity provider and an over-the-counter (OTC) trading firm based in London, has launched a new gold derivative product, which is priced and settled in bitcoin (BTC).","Claiming to launch the cryptocurrency market’s “first” such product, B2C2 said the gold-bitcoin derivative will allow institutional clients to trade gold synthetically via its OTC trading unit, B2C2 OTC Ltd, which is licensed and regulated by the U.K.'s Financial Conduct Authority (FCA).&nbsp;","“Clients trade an ounce of gold (minimum trade size) priced in bitcoin, and the derivative is settled in bitcoin,” Max Boonen, founder and CEO of B2C2, told The Block. The current <a href=\"https:\/\/goldprice.org\/gold-price.html\" data-v-f87c67ca=\"\">price<\/a> of gold per ounce is around $1,500.","Synthetic trading allows traders to take a short or long position without actually buying or selling an underlying asset. “The benefit of trading gold (or bitcoin) in a derivative form (synthetically) is that it’s simpler to trade than the cash underlier for a variety of operational reasons, and typically represents the majority of activity in the product\/asset,” said Boonen.","The gold-bitcoin derivative is a result of demand from its clients, said B2C2. “The clients we are seeing demand from are those who have their own user base of traders and macro hedge funds,” Boonen told The Block, adding that the product is available to “<a href=\"https:\/\/www.handbook.fca.org.uk\/handbook\/COBS\/3\/6.html\" data-v-f87c67ca=\"\">eligible counterparties<\/a>” and “<a href=\"https:\/\/www.handbook.fca.org.uk\/handbook\/COBS\/3\/5.html\" data-v-f87c67ca=\"\">professional clients<\/a>” as defined by the FCA.","Gold has soared in 2019, as investors fear recession and are anxious about the impact of the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/38196\/investors-up-their-gold-holdings-for-3rd-consecutive-month-amid-trade-war-risks\" data-v-f87c67ca=\"\">U.S.-China trade war<\/a>, among other macroeconomic factors such as central bank rate cuts.","“The current macro environment, dominated by uncertainty over economic growth and inflation, is prompting central banks to rethink monetary policy and market participants to reassess the likely path of interest rates. Conflicting narratives abound, fuelling market activity, and we expect demand to only grow for ways to gain and manage exposure to deflationary assets such as gold and bitcoin,” said Boonen.","Notably, not only bitcoin but the derivative product also allows clients to settle trades in other tokens, including recently-launched <a href=\"https:\/\/www.theblockcrypto.com\/post\/38553\/paxos-embraces-gold-pegged-crypto-as-sea-change-in-gold-trading\" data-v-f87c67ca=\"\">PAX Gold<\/a> (PAXG), a gold-pegged token by stablecoin issuer Paxos. “We are agnostic as to which of the major tokens our clients choose to use to settle their trades with us, be it Paxos Gold or another. These tokens will give them access to the underlying metal since they correspond to ownership of physical gold in vaults,” Boonen told The Block.","Looking ahead, B2C2 is planning to launch more products, but only where it has a “clear edge,” to do, Boonen told The Block, adding: “We are an electronic market-making firm first and foremost. We expect to continue expanding our offering beyond cryptocurrencies.” B2C2 currently also offers trading in six “large-cap” cryptocurrencies - bitcoin (BTC), ether (ETH), XRP, litecoin (LTC), EOS and bitcoin cash (BCH)."],"hashtag":["DERIVATIVES","XRP"]}