{"summary":"Kollider&#x27;s derivatives exchange, which uses Bitcoin’s Lightning Network, was launched to the public Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180083\/derivatives-exchange-kollider-launches-publicly-after-a-2-35-million-seed-round","publishDate":"2022-10-26T14:34:17","id":11564,"type":null,"title":"Derivatives exchange Kollider launches publicly after a $2.4 million seed round","category":["EXCHANGES"],"content":["Crypto firm Kollider publicly launched its derivatives exchange Wednesday after raising $2.35 million in seed funding in 2021.","The round was led by investment firm Lemniscap, with participation from Castle Island Ventures, Polychain Capital, Alameda, Pfeffer Capital, Okex and others, the company <a href=\"https:\/\/blog.kollider.xyz\/announcing-kolliders-launch\/\" data-v-f87c67ca=\"\">said<\/a>.","The exchange uses Bitcoin’s Lightning Network, allowing users to open and close their positions on the exchange directly from their Lightning wallets.","\"We believe that Kollider’s Lightning-native exchange is the fastest and easiest way to trade on the market today,\" the company said.","Users can add capital — as little as a single sat — to their positions over the Lightning Network and don't need to pre-fund their account. One bitcoin equals 100 million sats.&nbsp;","\"This improves capital efficiency and ensures that users are only taking counterparty risk with their funds when they have an open position,\" the company said.","The firm has built two versions of their product: The more simple-to-use Kollider Lite and the full-feature interface Kollider Pro. It has also introduced Kollider Synthetic Stablecoins and a browser-based Lightning Network wallet.","Kollider had previously raised $375,000 in a pre-seed round in 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"Castle Island Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pfeffer Capital","content":"ORGANIZATION"},{"type":"$2.35 million","content":"MONEY"},{"type":"Kollider Synthetic Stablecoins","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Bitcoin’s Lightning Network","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$375,000","content":"MONEY"},{"type":"2020","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Catarina Moura","The Block"]}