{"summary":"DeFi platform pNetwork was attacked for 277 bBTC — a version of wrapped bitcoin — yesterday.\nIt has offered a $1.5 million bounty for the funds to be returned.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118060\/defi-pnetwork-hack-wrapped-bitcoin-12-million-lost","publishDate":"2021-09-20T05:23:14","id":1156,"type":null,"title":"Hacker steals $12 million in wrapped bitcoin from DeFi platform pNetwork","category":["DeFi"],"content":["pNetwork, a cross-chain decentralized finance (DeFi) protocol, announced late Sunday that it suffered an attack and lost 277 pBTC (worth over $12 million at current prices).","pBTC is a version of wrapped bitcoin in the pNetwork ecosystem. Wrapped bitcoin is a token on a smart contract blockchain that is backed by an equivalent amount of bitcoin. It's created so that the bitcoin can be used in DeFi protocols, to generate yield for instance. In this case, the pBTC exists on various blockchains, including Ethereum and Binance Smart Chain (BSC).","pNetwork did not detail how the attack took place but <a href=\"https:\/\/twitter.com\/pNetworkDeFi\/status\/1439690593211490324?s=20\" data-v-f87c67ca=\"\">said<\/a> a hacker was able to leverage a bug in its codebase and drained pBTC from the BSC blockchain. \"The other bridges were not affected. All other funds in the pNetwork are safe,\" it added.","The bug has been identified and a fix has been proposed for review, said pNetwork. It expects the bridges to be back up in approximately 12 hours.","pNetwork said it will offer a $1.5 million bug bounty to the attacker if they return the stolen funds. \"Finding vulnerabilities is part of the game unfortunately, but we all want DeFi ecosystem to continue growing, returning funds is a step in that direction,\" it said.","The price of pNetwork’s governance token PNT, which runs on Binance Smart Chain, has <a href=\"https:\/\/www.coingecko.com\/en\/coins\/pnetwork\" data-v-f87c67ca=\"\">dropped<\/a> over 18% in the past 24 hours, according to CoinGecko. PNT is currently priced at around $0.97.","As a cross-chain DeFi platform, pNetwork validators help to move assets from one blockchain to another. They do so using wrapped tokens, which they call \"pTokens.\" The network <a href=\"https:\/\/p.network\/ptokens\" data-v-f87c67ca=\"\">supports<\/a> pTokens on seven blockchains: Ethereum, BSC, EOS, Polygon, Telos, xDAI, and Ultra."],"hashtag":[]}