{"summary":"Ren Protocol still holds $15 million of funds, even though the network is likely about to stop at any moment now.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196040\/ren-protocol-shutdown-likely","publishDate":"2022-12-19T06:08:26","id":11560,"type":null,"title":"Ren Protocol&#x27;s imminent shutdown likely, $15 million still at risk","category":["CRYPTO ECOSYSTEMS"],"content":["Ren Protocol may shut down at any moment, taking $15 million of funds remaining on the network with it — hence the project’s <a href=\"https:\/\/twitter.com\/renprotocol\/status\/1604205168530161665\" data-v-f87c67ca=\"\">warnings<\/a> on Twitter.","What’s unique here is that the project’s team doesn’t know exactly when the network will stop functioning. This is because the wrapped bitcoin-focused project was acquired in February 2021 by the now-collapsed trading firm Alameda Research. It appears that Alameda was controlling the infrastructure behind the network — separately from its node operators —&nbsp;and the team doesn’t have all the information.","“We don't know exactly when, depends on when infrastructure [shuts] down which we aren't in control of, could be in the next few days, or a week or two, we don't know [at the moment] but trying to figure out,” said Maximilian Roszko, ecosystem advocate at Ren protocol, in the project’s Discord channel.","The network supports tokens wrapped from other blockchains. Chief among them is renBTC, a tokenized version of bitcoin on the Ethereum blockchain. If Ren goes down, these tokens won’t necessarily have any value, and they won’t be able to be sent back to their original chains to unlock the collateral.&nbsp;","As a result, Ren has <a href=\"https:\/\/www.theblock.co\/post\/193274\/alameda-backed-ren-warns-users-of-losses-as-it-plans-to-wind-down-protocol\" data-v-f87c67ca=\"\">warned<\/a>&nbsp;users to send these tokens back to their respective chains to unlock this collateral before the network suddenly shuts down. Yet, despite these warnings, more than $15 million of renBTC remains on Ethereum and is at risk of getting stuck.","Roszko said the team wouldn’t have access to any funds when the network gets shut down. That said, it could be theoretically restarted in the future, which might allow for a recovery process.","When asked whether the node operators on the network could force a manual restart, Roszko said this was not possible due to Alameda’s involvement.","<b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Disclaimer:<\/i><\/b><i data-v-f87c67ca=\"\"> Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Maximilian Roszko","content":"PERSON"},{"type":"Roszko","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"February 2021","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Ren","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["ASSETS","DERIVATIVES","INTEROPERABILITY","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}