{"summary":"Digital Currency Group&#x27;s mining subsidiary Foundry is colocating 14,000 bitcoin miners at U.S. mining farm Compute North.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90997\/dcg-foundry-14k-bitcoin-miners-institution","publishDate":"2021-01-13T11:10:03","id":11576,"type":null,"title":"DCG&#x27;s Foundry will colocate 14,000 bitcoin mining machines in U.S. with focus on institutional buyers","category":["BITCOIN"],"content":["Foundry, the mining subsidiary of Digital Currency Group, has said it's partnering with a U.S. mining farm to colocate 14,000 bitcoin ASIC miner — a move that will focus in part on institutional buyers.&nbsp;","On Wednesday, Foundry said it will supply 14,000 WhatsMiner M30S units it procured from Shenzhen-based manufacturer MicroBT. As part of the deal, U.S. mining farm operator Compute North will allocate 47 megawatts of capacity to power up the machines beginning in the first quarter of 2021.","Foundry will retain an undisclosed portion of the hosted miners for its own use and plans to sell the remaining operating machines on Compute North's shelves to institutional investors.","The goal, according to the firm, is to streamline the pre-stage process for institutions so that they don't have to deal with issues such as negotiating bulk preorders from manufacturers, shipment logistics and sourcing facilities to host the machines. \"This partnership will further strengthen our relationship as we make bitcoin mining more accessible to institutional investors and businesses in North America,\" said Foundry CEO Mike Colyer.","The two companies said that once the machines come online, investors can buy the operating miners from Compute North's shelves either with full payments or via loans issued by Foundry, with the machines serving as collateral.&nbsp;","Once fully deployed, the 14,000 units would be able to generate around 1.2 million terahashes per second (TH\/s) of computing power, accounting for about 0.8% of bitcoin network's current total. At bitcoin's current mining difficulty, that amount of hash rate could potentially produce roughly 7.5 bitcoin in 24 hours, though factors such as luck and variance may shift those figures in practice.","Foundry did not disclose the initial cost of their procurement of the 14,000 units. MicroBT launched the model in early 2020 at $2,000 per unit.","But bitcoin's price rally in recent months has sent the prices of spot stocks for bitcoin mining equipment to new heights. For example, the spot inventory of MicroBT's WhatsMiner M31S, a less advanced model than M30S, is <a href=\"https:\/\/whatsminer.net\/product\/m31s-76t-44w-ship-now\/\" data-v-f87c67ca=\"\">being quoted<\/a> by the manufacturer's distributors at nearly $4,000 per unit.","The colocation deal follows MicroBT's <a href=\"https:\/\/www.microbt.com\/message\/news_detail\/27.html?locale=en\" data-v-f87c67ca=\"\">announcement<\/a> last September that it has set up its first offshore factory to scale up the supply chain for the North American market. Part of the partnership was that Foundry would be the entity financing hardware and first in line to receive new batches of MicroBT's M30S.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compute North","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"North America","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"0.8%","content":"PERCENT"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"the first quarter of 2021","content":"DATE"},{"type":"$2,000","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$4,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Mike Colyer","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}