{"summary":"As the blockchain and virtual asset space continues to grow with the rise of cutting-edge applications, large companies and institutional investors are tapping into the space","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120964\/huobi-trust-hong-kong-provides-safe-secure-custody-services-as-digital-asset-landscape-evolves","publishDate":"2021-10-20T09:00:14","id":11579,"type":null,"title":"Huobi Trust Hong Kong Provides Safe, Secure Custody Services As Digital Asset Landscape Evolves","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">As the blockchain and virtual asset space continues to grow with the rise of cutting-edge applications, large companies and institutional investors are tapping into the space. As of now, <\/span><span data-v-f87c67ca=\"\">there are more than ten thousand currencies in the global digital money market, and the total crypto market value has exceeded USD2 trillion. MicroStrategy CEO Michael Saylor also expressed that Bitcoin would continue to appreciate and he boldly predicted that the market value of Bitcoin would reach USD 100 trillion one day.<\/span>","<span data-v-f87c67ca=\"\">But the crypto landscape does present some challenges. Financial services are heavily regulated around the world, and each region has its own compliance standards and guidelines to meet. From <\/span><a href=\"http:\/\/com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Binance<\/span><\/a><span data-v-f87c67ca=\"\"> to <\/span><a href=\"https:\/\/www.reuters.com\/article\/us-crypto-currencies-bittrex\/bittrex-virtual-currency-license-rejected-by-new-york-financial-regulator-idUSKCN1RM24Q\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bittrex,<\/span><\/a><span data-v-f87c67ca=\"\"> many crypto companies bear the brunt and even had their licenses revoked in certain circumstances when the compliance requirements were not met. For global crypto institutions looking to provide custody solutions for clients around the world, the obstacles are particularly apparent.&nbsp;<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Providing compliant, customizable custodian services&nbsp;<\/b>","<span data-v-f87c67ca=\"\">To ensure they trade and invest crypto in a regulatory-compliant environment, many institutional investors look to custody service providers for a diversified array of compliant and customizable custodian services. Being backed and supported by Huobi Technology Holdings Limited (“<\/span><b data-v-f87c67ca=\"\">Huobi Tech<\/b><span data-v-f87c67ca=\"\">”) (stock code: 1611. HK), a company listed on the Main Board of The Stock Exchange of Hong Kong Limited which is dedicated to becoming a one-stop virtual asset service platform, Huobi Trust Hong Kong aims to provide asset custody, wealth management, private customization, family trust services, and more.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“As a registered trust company under the common law system in Hong Kong, we aim to become the leading virtual asset trust service provider in the world,” said Lily Zhang, CFO of Huobi Tech.<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Earning trust through transparency<\/b>","<span data-v-f87c67ca=\"\">Gaining the trust of virtual asset owners is another important element of crypto custody. Without the recognition of an <\/span><a href=\"https:\/\/advisory.kpmg.us\/content\/dam\/advisory\/en\/pdfs\/2020\/kpmg-cracking-crypto-currency.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">independent third party,<\/span><\/a><span data-v-f87c67ca=\"\"> it’s hard for institutional investors to evaluate whether their custody provider is offering the best options in their clients’ interest.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To attain this transparency, custody providers normally rely on attestation reports and certifications. But what’s more important than the third-party documents is that, custody providers must demonstrate a continuing commitment to improving their risk management protocols.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a registered trust company in Hong Kong, Huobi Trust Hong Kong is fully licensed and compliant with the requirements under the Anti-Money Laundering and Counter-Terrorist Financing Ordinance (Cap. 615 of the laws of Hong Kong) and has obtained the Hong Kong Trust and Company Service Provider (TCSP) license (TCSP Licence No.: TC007494). As such, its daily operations must abide by the relevant Hong Kong regulations as well as the AML\/CTF requirements, which precludes the company from money laundering, terrorism financing, and other serious risks that custody providers would possibly face.<\/span>","<span data-v-f87c67ca=\"\">“We realize transparency is the key to building trust with our clients, so we do our due diligence in this area,” Zhang said.&nbsp;<\/span>","&nbsp;","<b data-v-f87c67ca=\"\">Making security a priority&nbsp;<\/b>","<span data-v-f87c67ca=\"\">One of the biggest concerns for institutional investors is the risk of cyberattacks. Since the theft of 850,000 bitcoins by Mt. Gox in 2013, crypto service providers have been facing different level of security pressure. In 2020 alone, hackers have stolen more than USD120 million in the crypto space. In August 2021, hackers took advantage of Bilaxy's security vulnerabilities and stole more than USD21 million worth of cryptocurrency.<\/span>","<span data-v-f87c67ca=\"\">With an in-depth knowledge of best practices in security, Huobi Trust Hong Kong says it remains focused on cyber threats prevention and client assets protection via its in-house security infrastructure and a time-tested risk control framework. Huobi Trust Hong Kong offers products and services designed and built for asset protection including Globally-Distributed Multi-signature Cold Wallets, effectively improves the security level of customers’ asset storage; and much more.<\/span>","<span data-v-f87c67ca=\"\">“As the virtual asset space is evolving, we will continue to improve our product offerings in trust and custody services and ensure that the safety and security of our client’s assets always come first.” added Zhang.<\/span>","<span data-v-f87c67ca=\"\">As crypto regulations continue to evolve, it is imperative that institutional investors—and all investors for that matter—and their custody providers adhere to the compliance regulations and prioritize the security of their assets in a volatile environment. While the crypto space is ripe for many opportunities, there are also significant risks that must be mitigated in order to ensure the most secure user experiences possible.&nbsp;<\/span>","<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\">For more information on Huobi Trust Hong Kong, visit: <\/span><a href=\"https:\/\/www.huobihktrust.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/www.huobihktrust.com\/<\/span><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hong Kong Trust and Company Service","content":"ORGANIZATION"},{"type":"Zhang","content":"ORGANIZATION"},{"type":"Main Board of The Stock Exchange of Hong Kong Limited","content":"ORGANIZATION"},{"type":"CFO of Huobi Tech","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"Lily Zhang","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"1611","content":"DATE"},{"type":"CTF","content":"ORGANIZATION"},{"type":"Huobi Technology Holdings Limited (“<\/span><b data-v-f87c67ca=\"\">Huobi Tech","content":"ORGANIZATION"},{"type":"Bittrex","content":"LOCATION"},{"type":"Zhang","content":"PERSON"},{"type":"Huobi Trust Hong Kong","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Bilaxy","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}