{"summary":"Louis Vuitton is deepening its work with NFTs via a branded mobile game.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142276\/louis-vuitton-releases-new-nfts-as-fashion-brands-continue-experiments-in-gaming","publishDate":"2022-04-17T10:18:37","id":11583,"type":null,"title":"Louis Vuitton releases new NFTs as fashion brands continue experiments in gaming","category":["STARTUPS"],"content":["Luxury fashion brand Louis Vuitton is moving ahead with its experimentation with non-fungible tokens (NFTs) with the introduction of PFP (profile pic) inspired NFT rewards in its stand-alone mobile app game <i data-v-f87c67ca=\"\">Louis: The Game<\/i>.","The game was first introduced in August 2021. Players enter a world where they can dress up their brand-inspired avatar named Vivienne and run around collecting postcards that teach them about the brand's 200-year history. The company has added new quests and new NFT rewards to the app, according to <a href=\"https:\/\/www.voguebusiness.com\/technology\/louis-vuitton-to-release-new-nfts\" data-v-f87c67ca=\"\">Vogue Business<\/a>, who first reported the news.","Players who collect a certain number of free NFTs in the game will have a chance to qualify for an NFT raffle, which runs until August 4 (as one of the postcards in the game reveals, that day is Louis Vuitton’s birthday.) Players have a chance to win one of 10 new NFTs that feature Vivienne in a range of different looks, which will be portable across multiple platforms like a PFP.","<span data-v-f87c67ca=\"\">Screenshot of avatar Vivienne from<em data-v-f87c67ca=\"\"> Louis: The Game<\/em>.<\/span>","The NFTs are made in collaboration with Beeple’s startup Wenew Labs, which also worked with sister company Possible, and minted from Louis Vuitton’s Ethereum wallet.","Luxury and fashion brands have been increasingly experimenting with NFTs and blockchain gaming, with the hope of attracting Gen Z consumers, a group that has an<a href=\"https:\/\/www.millennialmarketing.com\/wp-content\/uploads\/2018\/01\/Barkley_WP_GenZMarketSpend_Final.pdf\" data-v-f87c67ca=\"\"> estimated spending power <\/a>of up to $143 billion.","Last month, dozens of companies – from luxury brands like Dolce &amp; Gabbana to fast fashion brands like Forever 21 – took over the virtual streets and runways of Decentraland for the first-ever <a href=\"https:\/\/www.theblockcrypto.com\/post\/139904\/inside-the-first-ever-metaverse-fashion-week\" data-v-f87c67ca=\"\">metaverse fashion week<\/a>. The metaverse, often described as the next phase of the internet, is<a href=\"https:\/\/www.bloomberg.com\/professional\/blog\/metaverse-may-be-800-billion-market-next-tech-platform\/\" data-v-f87c67ca=\"\"> estimated<\/a> to be an $800 billion market opportunity, according to Bloomberg Intelligence.","Sources focused on this area contend that digital fashion is becoming one of the fashion industry’s biggest growth opportunities.","“Really what it’s about, when we look at virtual environments, is it’s the future of social media,” said Charles Hambro, CEO and co-founder of Geeiq, in an interview with The Block. Geeiq consults brands on how to identify and optimize metaverse and gaming partnerships.","Hambro says many fashion brands approach Geeiq with the intention of connecting with audiences in an authentic way that meets consumers where they are. Other brands reach out because they don’t want to miss out on what some of the largest luxury brands are already doing.","Despite the buzz around the loosely defined “metaverse,” <a href=\"https:\/\/www.pipersandler.com\/1col.aspx?id=6217\" data-v-f87c67ca=\"\">research<\/a> published by Piper Sandler, a consumer research firm, shows that only about half of 7,100 teens surveyed in the U.S. are interested in the concept. While 26% of teens own a VR headset, only 5% use it daily, according to the report obtained by The Block.","Nonetheless, experiments have shown promising results. <i data-v-f87c67ca=\"\">Louis: The Game<\/i>, which is free to download and doesn’t require any additional equipment, has had 2 million app downloads, the company told <a href=\"https:\/\/www.voguebusiness.com\/technology\/louis-vuitton-to-release-new-nfts\" data-v-f87c67ca=\"\">Vogue Business<\/a>. Similarly, nearly 7 million people have visited Nike’s Roblox store, according to Nike President and CEO John Donahoe, in their March 2022 <a href=\"https:\/\/s1.q4cdn.com\/806093406\/files\/doc_financials\/2022\/q3\/NIKE-Inc-Q3FY22-UNOFFICAL-Transcript.pdf\" data-v-f87c67ca=\"\">earnings call<\/a>.","Gucci, an early mover into NFT fashion, had 19 million visitors on Roblox, said Robert Triefus, Executive Vice President and Chief Marketing Officer of Gucci, in an <a href=\"https:\/\/www.mckinsey.com\/~\/media\/mckinsey\/industries\/retail\/our%20insights\/state%20of%20fashion\/2022\/the-state-of-fashion-2022.pdf\" data-v-f87c67ca=\"\">interview<\/a> with McKinsey.","On its face, the exploration of virtual spaces and goods is seen as a positive one for the fashion industry, coming after years of supply chain disruptions and fluctuations in consumer spending since the start of the COVID-19 pandemic.&nbsp;","But how fashion can take advantage of this area is still not well understood. Even some of the biggest names and players in the space are skeptical about the potential.","Louis Vuitton’s parent company LVMH’s own chief executive Bernard Arnault said in a January <a href=\"https:\/\/seekingalpha.com\/article\/4482311-lvmh-moet-hennessy-louis-vuitton-societe-europeennes-lvmhf-ceo-bernard-arnault-on-q4-2021\" data-v-f87c67ca=\"\">earnings call<\/a> that he was cautious about a potential metaverse “bubble,” pointing to the burst of the dot com bubble in the early 2000s.","François Pinault, the founder of Kering, an LVMH competitor, is optimistic, saying the metaverse will be a “disruptive” opportunity, during the company’s <a href=\"https:\/\/www.kering.com\/en\/finance\/publications\/\" data-v-f87c67ca=\"\">earnings call<\/a> in February. Pinault pointed to the potential of NFTs as a way to authenticate physical goods, and the possible role of smart contracts to track secondary sales (a current pain point for the industry.)","Gucci, owned by Kering, has been heavily focused on this front, with a dedicated team working on virtual experiences.","“When it comes to NFTs, it’s going to require a lot more time to understand what they represent in terms of customer experience or value-add,” said Gucci’s Triefus in the McKinsey interview. “But you’ve seen a significant number of brands within the sector saying, okay, we believe that NFTs have relevance, we’re not 100 percent sure yet what that relevance is but we’re going to pilot [this], we’re going to experiment and have some learnings and insights as a result.”","For Gucci, the metaverse isn’t just a good short-term marketing opportunity, he says. In the future, he expects it to become a “very significant” driver of revenue growth.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Robert Triefus","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"August 2021","content":"DATE"},{"type":"McKinsey","content":"ORGANIZATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"François Pinault","content":"PERSON"},{"type":"Louis","content":"LOCATION"},{"type":"Wenew Labs","content":"ORGANIZATION"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Louis Vuitton","content":"PERSON"},{"type":"Vogue Business","content":"ORGANIZATION"},{"type":"Louis Vuitton","content":"LOCATION"},{"type":"Gucci","content":"ORGANIZATION"},{"type":"$143 billion","content":"MONEY"},{"type":"August 4","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Bernard Arnault","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Charles Hambro","content":"PERSON"},{"type":"100 percent","content":"PERCENT"},{"type":"March 2022","content":"DATE"},{"type":"$800 billion","content":"MONEY"},{"type":"Triefus","content":"PERSON"},{"type":"Dolce &amp; Gabbana","content":"ORGANIZATION"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Vivienne","content":"PERSON"},{"type":"26%","content":"PERCENT"},{"type":"John Donahoe","content":"PERSON"},{"type":"Piper Sandler","content":"PERSON"},{"type":"2000s","content":"DATE"}],"hashtag":["GUCCI"],"authors":["Anushree Dave","The Block"]}