{"summary":"Social protocol Stars Arena paid a bounty to recover 90% of funds that were taken during a security exploit last week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256090\/hacker-returns-90-of-stolen-funds-to-stars-arena-following-exploit","publishDate":"2023-10-12T06:02:00","id":11580,"type":null,"title":"Hacker returns 90% of stolen funds to Stars Arena following exploit","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Avalanche <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248368\/avalanche-avax-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Avalanche_Circle_RedWhite_Trans.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AVAX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.13%\n    <\/span><\/a> <!----><\/span><\/span>-based social protocol Stars Arena has recovered approximately 90% of the funds lost during a security exploit last week. This recovery was made possible through a successful negotiation with the individual responsible for the attack, the team confirmed.<\/span>","Stars Arena encountered a major exploit on Oct. 7 that led to the loss of funds locked in its smart contract. Security analysts at PeckShield estimated the size of the exploit to be around 266,104 AVAX coins, worth <a href=\"https:\/\/www.theblock.co\/post\/255337\/stars-arena-drained-of-2-9-million-in-avax-tokens-funds-in-user-wallets-are-safe\" data-v-f87c67ca=\"\">$2.9 million<\/a> at that time. As a result, the value locked within the app fell to zero.","The breach was attributed to a reentrancy issue, enabling attackers to sell platform tickets — which grant access to individual chat rooms — for inflated prices. In the aftermath of this security lapse, Stars Arena issued a warning on X, advising users against depositing any more funds.","Stars Arena said it struck an agreement with the hacker. As per the agreement, the hacker would return about 90% of the stolen funds in return for a 10% bounty. From the 266,104 AVAX that were taken, the hacker has returned 239,493 AVAX across two distinct transactions. For this act, the hacker received a bounty of 27,610 AVAX (currently worth $250,000), <a href=\"https:\/\/twitter.com\/starsarenacom\/status\/1712192197443883453\" data-v-f87c67ca=\"\">according to the team<\/a>.","Stars Arena operates as a forked iteration of <a href=\"https:\/\/www.theblock.co\/post\/255279\/friendtech-developers-rake-in-nearly-20-million-since-august-launch\" data-v-f87c67ca=\"\">FriendTech<\/a>, an application that facilitates the purchase or sale of influencer profile tokens granting access to an individual’s chat room.","The pricing of these tokens follows a bonding curve, meaning they become pricier as their demand increases. Transaction fees on such platforms are relatively steep as there’s a 10% fee on every time the token is sold. Half of this total fee is allocated to the project’s team as revenue, and the other half is distributed to users whose tokens are traded.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$2.9 million","content":"MONEY"},{"type":"$250,000","content":"MONEY"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"-0.13%","content":"PERCENT"},{"type":"Oct. 7","content":"DATE"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Stars Arena","content":"ORGANIZATION"}],"hashtag":["AVALANCHE","EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}