{"summary":"Visa has ended its partnership with cryptocurrency exchange FTX after it filed for Chapter 11 bankruptcy protection.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186753\/visa-ends-crypto-debit-card-partnership-with-ftx","publishDate":"2022-11-14T12:38:08","id":11592,"type":null,"title":"Visa ends crypto debit card partnership with FTX","category":["FINANCE FIRMS"],"content":["Payments company Visa has terminated its partnership with FTX amid the cryptocurrency exchange's ongoing collapse.&nbsp;","\"The situation with FTX is unfortunate and we are monitoring developments closely,\" a Visa spokesperson told The Block. \"We have terminated our global agreements with FTX and their U.S. debit card program is being wound down by their issuer.\"","In October, the cryptocurrency exchange announced that it was <a href=\"https:\/\/www.theblock.co\/post\/175494\/ftx-to-launch-visa-debit-card-in-40-new-countries\" data-v-f87c67ca=\"\">launching<\/a> a Visa debit card in more than 40 countries, rolling out in Latin America to start.","\"We're excited to partner with leading crypto exchanges like FTX to bring more flexibility and ease-of-use to the way people use their crypto — unlocking the ability to use a crypto balance to fund purchases anywhere Visa is accepted,\" said Visa head of crypto Cuy Sheffield in a statement at the time.&nbsp;","Other companies have also sought to distance themselves from the embattled cryptocurrency exchange after last week's events, which culminated in FTX filing for Chapter 11 bankruptcy protection.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"crypto Cuy Sheffield","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FINTECH","FTX","PAYMENTS"],"authors":["Tom Matsuda","The Block"]}