{"summary":"Normally reserved for verified business, plugged-in Crypto Twitter individuals were sporting gold checks and square profile pictures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224952\/crypto-twitter-gold-checks","publishDate":"2023-04-05T03:47:18","id":11597,"type":null,"title":"Crypto Twitter&#x27;s run of gold checks comes to an end (for now)","category":["TECH"],"content":["If you’re plugged into the crypto-focused corner of Twitter — lovingly or not-so-lovingly known as Crypto Twitter — you may have noticed various individuals sporting a shiny gold checkmark and square profile picture.&nbsp;","Not anymore.","While gold checkmarks and square profile pictures are typically reserved for verified companies, plugged-in Crypto Twitter individuals from all corners of the crypto-sphere had been displaying them in recent days. But how?","“The move from square to circular profile pics online signify the emasculation of digital identities,” <a href=\"https:\/\/twitter.com\/YOJIMBO_KING\/status\/1224561095005933568\" data-v-f87c67ca=\"\">explained<\/a> one account, satirically.","But the real answer is much more straightforward: they were temporary affiliates for IDEX, a perpetual futures focused decentralized exchange.&nbsp;","By simply asking the right people, users could generate the following notification: “As part of Twitter’s Verified Organizations, IDEX (@idexio) has added you as an affiliate.” This status came with a coveted gold check and a square profile picture.","<span data-v-f87c67ca=\"\">Users added as affiliates for IDEX received a verification notification. Source: Twitter<\/span>","However, the fun run ended abruptly overnight when Twitter stopped it and removed IDEX’s verified status.","According to Pancakesbrah, who works in growth and business development for IDEX, the decentralized exchange “technically broke no terms” — and will reapply on the grounds that it only played within the rules.","“Best day on Crypto Twitter for me and IDEX, by far,” Pancakesbrah told The Block. “No regrets. All positive.”","<em data-v-f87c67ca=\"\">Updated with an image of the affiliate verification notification.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"IDEX","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pancakesbrah","content":"LOCATION"}],"hashtag":["DEXS","SOCIAL MEDIA","TWITTER"],"authors":["Adam James","The Block"]}