{"summary":"NFT marketplace OpenSea has awarded a couple of ethical hackers with $200,000 as bounty rewards for finding critical bugs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173294\/nft-marketplace-opensea-pays-200000-bounty-to-two-ethical-hackers","publishDate":"2022-09-28T06:02:27","id":11596,"type":null,"title":"NFT marketplace OpenSea pays $200,000 bounty to two ethical hackers","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">OpenSea has paid $200,000 in bounty rewards to two ethical hackers who discovered separate critical vulnerabilities in the NFT marketplace in the last ten days. Each hacker was individually rewarded $100,000.<\/span>","<span data-v-f87c67ca=\"\">The first was paid to<\/span> <a href=\"https:\/\/twitter.com\/hacker_\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Corben Leo<\/span><\/a><span data-v-f87c67ca=\"\">, a security expert and chief marketing officer at security firm Zellic, who said that he received $100,000 on Monday for having discovered a critical OpenSea vulnerability via the bug bounty platform HackerOne.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Had it not been found, the critical bug could have been potentially exploited by malicious hackers to steal assets, Leo told The Block. \"It was a vulnerability affecting their web services. It would've allowed an attacker to compromise OpenSea's infrastructure,\" he said.<\/span>","<span data-v-f87c67ca=\"\">Another anonymous whitehat hacker, who goes by <\/span><a href=\"https:\/\/twitter.com\/nix_eth\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nix<\/span><\/a><span data-v-f87c67ca=\"\">, told The Block that OpenSea also rewarded them $100,000 for reporting another critical vulnerability on 19 September, though Nix did not provide additional details.<\/span>","<span data-v-f87c67ca=\"\">“The vulnerability report and any details around it are confidential,” Nix said. This bug was also flagged on the HackerOne platform.<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for OpenSea confirmed to The Block that these bounties were genuine, adding that respective patches to the vulnerabilities have been issued. They said that the firm was satisfied in seeing the bounty program with HackerOne working as intended.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;“We’re pleased to see the community’s engagement with this program, and even more excited that our average response and patch times have gotten much faster since the program’s launch in October 2021,” the spokesperson said.<\/span>","OpenSea is the largest NFT marketplace on Ethereum in terms of daily volume. But the platform has previously faced user interface issues that have resulted in a loss of user assets.","<span data-v-f87c67ca=\"\">To deal with these issues, OpenSea entered a program with HackerOne, a crowdfunded ethical hacking platform designed to help companies discover and fix basic vulnerabilities before they can be misused.<\/span>","As part of the program, OpenSea offers bounty rewards in tiers according to how serious the threat is. For instance, a \"low\" level SeaPort (OpenSea's smart contract) bug can earn a whitehat up to $1,000, while a \"critical\" one can lead to a prize of up to $3,000,000. The bug bounty program from OpenSea is still live on HackerOne.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zellic","content":"PERSON"},{"type":"$3,000,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Corben Leo","content":"PERSON"},{"type":"$1,000","content":"MONEY"},{"type":"October 2021","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Nix","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Nix","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"last ten days","content":"DATE"},{"type":"Leo","content":"PERSON"}],"hashtag":["OPENSEA"],"authors":["Vishal Chawla","The Block"]}