{"summary":"The conclusion of the first season of the points program is set to coincide with the launch of deBridge’s token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287240\/debridge-unveils-points-program-upcoming-token-launch","publishDate":"2024-04-09T08:05:04","id":116,"type":null,"title":"deBridge unveils points program ahead of upcoming token launch","category":["BRIDGES"],"content":["Cross-chain interoperability protocol deBridge has kicked off the first season of its points program in a step toward its upcoming token launch.","deBridge is retroactively distributing points to over 200,000 existing users who have collectively paid $2.3 million in fees based on past activity, according to the team. This includes partner projects such as Jupiter, Solflare, Zeta Markets, Banana Gun and Birdeye that have integrated the deBridge protocol within their applications.","“The program rewards past loyalty through multiples on past and future activity while encouraging and incentivizing new users to experience deBridge’s near-instant settlement, deep liquidity and tight spreads on native bridge transfers,” the team added.","deBridge points are designed as part of a growth initiative, intending to decentralize governance power to the community as it moves toward launching the deBridge token.","The launch of deBridge’s native token is set to follow the first season of points. However, the project did not disclose the specific criteria for the program, a date for the proposed token launch, nor how the accumulation of points would convert to any token allocation when asked by The Block.","In February, Solana decentralized exchange aggregator Jupiter put forward three “OG” Solana projects to potentially become the <a href=\"https:\/\/www.theblock.co\/post\/276741\/jupiter-lfg-launchpad-token-candidates\" data-v-f87c67ca=\"\">next tokens<\/a> to launch on its new LFG launchpad — of which deBridge was highlighted as one of the candidates.","While the specific details are yet to be announced, the deBridge token could launch on Jupiter’s LFG platform upon the conclusion of the points program’s first season. However, that will be decided by a Jupiter community governance vote.","deBridge differs from the current popular bridging model in which users lock a token on one chain and receive an equivalent wrapped asset on another — one of the most common <a href=\"https:\/\/www.theblock.co\/post\/163612\/why-are-cross-chain-bridges-prime-targets-for-hackers-and-what-can-we-do-about-it\" data-v-f87c67ca=\"\">bridge vulnerabilities<\/a> exploited in the industry.","Instead, deBridge is designed to enable liquidity transfer directly between chains, removing the need to lock assets, reducing complexity and improving transfer efficiency.","deBridge claims to have settled nearly <a href=\"https:\/\/x.com\/deBridgeFinance\/status\/1771210525348946215?s=20\" data-v-f87c67ca=\"\">$1 billion in volume<\/a>, onboarded 112,000 new users and collected over $1.4 million in fees over the past three months.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Zeta Markets","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LFG","content":"ORGANIZATION"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"$2.3 million","content":"MONEY"},{"type":"$1.4 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"OG” Solana","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY","TOKENS"],"authors":["James Hunt","The Block"]}