{"summary":"The firm wants to provide traditional services in the metaverse as it appears to double down on digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197928\/fidelity-files-for-metaverse-trademarks-in-latest-crypto-push","publishDate":"2022-12-26T15:18:33","id":11609,"type":null,"title":"Fidelity files for metaverse trademarks in latest crypto push","category":["COMPANIES"],"content":["Fidelity has <a href=\"https:\/\/tmsearch.uspto.gov\/bin\/showfield?f=doc&amp;state=4810:o2nxk8.7.1\" data-v-f87c67ca=\"\">filed<\/a> three U.S. <a href=\"https:\/\/tmsearch.uspto.gov\/bin\/showfield?f=doc&amp;state=4810:o2nxk8.8.1\" data-v-f87c67ca=\"\">trademark<\/a> applications to provide services in the metaverse and other virtual worlds in its latest step into the realm of digital assets.&nbsp;","The firm wants to provide its traditional services in alternate realities, according to the <a href=\"https:\/\/tmsearch.uspto.gov\/bin\/showfield?f=doc&amp;state=4810:o2nxk8.9.1\" data-v-f87c67ca=\"\">filings<\/a>. The applications mention NFTs and NFT marketplaces, virtual real estate investing, crypto trading and metaverse investment services.&nbsp;&nbsp;","Fidelity has been quicker to embrace digital assets than most other large investment companies and in October said it was planning 100 more crypto hires to expand its digital asset team to 500. The firm <a href=\"https:\/\/www.theblock.co\/post\/190286\/ready-to-trade-fidelity-finally-opens-retail-crypto-accounts\" data-v-f87c67ca=\"\">opened<\/a> up commission-free retail crypto trading accounts in November after first announcing a waiting list.","The firm has received some pushback. Three U.S. senators last month asked it to reconsider a decision to allow retirement plan participants to invest in bitcoin, saying the industry has become increasingly \"volatile, tumultuous and chaotic.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"October","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}