{"summary":"The New York Office of the Attorney General (NYOAG) recently filed a brief in a New York Appellate Court on December 4, responding to an appeal by","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50492\/nyag-continues-pushing-for-its-case-against-bitfinex-calling-its-argument-forfeited-and-meritless","publishDate":"2019-12-13T15:45:48","id":11603,"type":null,"title":"NYAG continues pushing for its case against Bitfinex, calling its argument “forfeited and meritless”","category":["LEGAL"],"content":["The New York Office of the Attorney General (NYOAG) recently filed a brief&nbsp;in a New York Appellate Court on December 4, responding to an appeal by Bitfinex and describing the exchange's arguments as “backward,” “forfeited,” and “meritless.”","The appeal arises out of an underlying investigation by the NYOAG of Bitfinex under New York's Martin Act into potential securities and commodities fraud by the exchange. &nbsp;The state argues that it has broad authority under the statute to investigate potential wrongdoing in or concerning New York state, including the production of documents and witnesses, in aid of an investigation, prior to a decision being made on the institution of formal legal proceedings. &nbsp;","Among other things, NYOAG has <a href=\"https:\/\/iapps.courts.state.ny.us\/fbem\/DocumentDisplayServlet?documentId=vIexA1b0spKOnK_PLUS_ZUGTJ3A==&amp;system=prod\" data-v-f87c67ca=\"\">suggested<\/a>&nbsp;that Bitfinex might be illicitly using the reserves of the Tether stablecoin–originally claimed to be backed one-to-one by U.S. dollars—to fill a financial hole of $850 million.&nbsp;The state obtained a Court order against Bitfinex to prevent further cash reserve depletion and requiring Bitfinex to produce documents. &nbsp;Bitfinex appealed the Order and this response brief is to Bitifinex's appeal.","The state argues that Bitfinex's basic logic is wrong, and misperceives the power granted by the Martin Act and the purpose that the statute serves:","\"a fundamental misconception pervades all of respondents’ arguments. Respondents appear to believe that they are entitled to halt an OAG investigation based on their forecasted objections to what they think OAG will claim in a future lawsuit. Supreme Court correctly recognized that respondents’ argument is backward. The purpose of § 354 is to uncover facts to support OAG’s future, unfiled claim. The law is clear that OAG need not definitively establish a violation of New York law at this stage. Quite the opposite: under binding precedent, OAG need have only a reasonable basis to believe that the subject violated New York law and is subject to OAG’s jurisdiction.\"","In short, this case is not about whether Bitfinex did or did not violate the law. Instead, it is about the power of the NYOAG to investigate potential violations and gather evidence in the course of such an investigation. &nbsp;","Another argument raised by Bitfinex is that it does not have sufficient contacts with New York to be subject to personal jurisdiction in the state. &nbsp;Here, the NYOAG points to evidence that the exchange's Chief Strategy Officer was based in New York and \"assisted New York customers with trading activity[.]\" Furthermore, the lower court found that New York customers were able to use the exchange until \"at least January 30, 2017.\" &nbsp;Also, the [lower] court also found that respondents had a presence in New York because they loaned tethers to a New York–based firm and opened bank accounts with and used services from New York–based banks.\" &nbsp;Finally, there was evidence that \"a professional trading firm repeatedly accessed the Bitfinex platform from New York, as late as 2019.\"","\"Eight months have now passed since Supreme Court issued the § 354 order, and respondents continue to evade producing the core materials that would establish (or disprove) their liability,\" the NYOAG observes. \"No principle of law or rule of procedure allows a subject of an investigation to refuse to comply with that investigation in the face of a lawful court order.\" &nbsp;Whether the appellate court agrees with NYOAG remains to be seen.","In a blog post on its <a href=\"https:\/\/tether.to\/tether-files-reply-brief-in-new-york-appeal\/?__cf_chl_jschl_tk__=fbf5bf44a86700c2e79f2e6cff236d6e804f9d61-1576271388-0-Ab47q8S-RLUj4DIop2NSPE-55nyvnfVsXE_YrvFi8J4kZI0l3B1GXJlMH4f1tJDrKPtJIRCJ2IiUhI2qQ-E7ZDAeFV8PQnhYaPbTObXrB9VGSec-MVsEOc4Uij3Y2uti1xencEqAi_7jck7YO-dgWLWlBOKyrAI0Omr1tgBy6gVPxdh7QiLPUApIIE4ZiEZX2AWGBGjjdsue0DznlLhQ_uKSpQk9I8pF4ScU-QlU9gtFx7okW9PoNG4BNHGQifm1pvcJlr8pl-wWQZ6mQbenBMQ3HL_AxtBnv3V1M1zf3P2SQJB63KwOaQ4PkN1gVYlIQw\" data-v-f87c67ca=\"\">website<\/a>, Tether responded to NYOAG's brief, claiming that the state \"offers a highly misleading factual presentation\" and fails to identify any victims of the exchange.","\"At the end of the day, the Attorney General has not identified any victim in this whole proceeding, because there is not,\" Tether added. \"Holders of tethers are entitled to redeem them for exactly what they paid for them – no more and no less – and Tether has had no issue satisfying redemption requests to anyone, even after the New York Attorney General’s incendiary case.\"","&nbsp;A loss here by either side could potentially be taken up on appeal to New York's highness court, the New York Court of Appeals.","<a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=PGPA0A4fPa9gWHml\/J5wEQ==\" data-v-f87c67ca=\"\">Link to NYOAG brief<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"January 30, 2017","content":"DATE"},{"type":"New York Court of Appeals","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York state","content":"LOCATION"},{"type":"Supreme Court","content":"ORGANIZATION"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"$850 million","content":"MONEY"},{"type":"December 4","content":"DATE"},{"type":"NYOAG","content":"ORGANIZATION"},{"type":"Bitifinex","content":"ORGANIZATION"},{"type":"New York Office","content":"ORGANIZATION"},{"type":"OAG","content":"ORGANIZATION"},{"type":"New York Appellate Court","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block","The Block"]}