{"summary":"Block CEO Jack Dorsey led a $6.2 million seed funding round for Mummolin&#x27;s OCEAN — a decentralized Bitcoin mining pool project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265120\/jack-dorsey-seed-round-decentralized-bitcoin-mining-pool-ocean","publishDate":"2023-11-29T05:56:40","id":11608,"type":null,"title":"Jack Dorsey leads $6.2 million seed round for Bitcoin mining pool OCEAN","category":["DEALS"],"content":["Mummolin, Inc. has raised a $6.2 million seed funding round led by Block CEO Jack Dorsey to support the launch of OCEAN — a decentralized Bitcoin mining pool — and other mining decentralization projects.","Accomplice, Barefoot Bitcoin Fund, MoonKite, NewLayer Capital and the Bitcoin Opportunity Fund also participated in the round, according to a statement.","OCEAN announced the raise at the Future of Bitcoin Mining Conference yesterday, set against the backdrop of a 150-year-old repurposed hydroelectric dam in rural South Carolina, which utilizes excess energy for Bitcoin mining.","OCEAN aims to help miners regain autonomy and decision-making power over more complex processes in mining operations, and is designed to be non-custodial, transparent and permissionless.","\"The intention is to disintermediate to the greatest extent possible. Pools have become trusted third parties whose permission we have required for activating soft forks and deciding what gets into the blockchain in addition to taking custody of all newly generated coins,\" OCEAN's Global Head of Sales, pseudonymous Bitcoin Mechanic, said. \"By offering transparency and a mechanism for miners to be paid directly by Bitcoin itself, we make the network radically more robust.\"","Mummolin was co-founded by long-time Bitcoin Core developer Luke Dashjr. The Wyoming-based company is the successor to the Eligius Bitcoin mining pool Dashjr founded — a popular zero-fee mining pool that operated from 2010-2017.","\"The role of mining pools must change for Bitcoin to exist as a truly decentralized currency,\" Dashjr said in the statement. \"OCEAN is a new type of pool that enables miners to be truly miners again. We are launching as the most transparent pool and also the only non-custodial pool where miners are the recipients of new block rewards directly from Bitcoin.\"","\"OCEAN is solving a problem for Bitcoiners that I think all of us feel — further centralization of mining pools that could plague Bitcoin, and how that risks a bunch of Bitcoin attributes that we hold dear,” Dorsey added.","\"When I see a project that is good for Bitcoin broadly, and that's also good for me and my companies personally, it becomes a simple decision for me and I'm happy to be a part of it,\" Dorsey said.","Barefoot Mining, OCEAN's first customer, said the new pool would bring some badly needed diversity to Bitcoin mining. \"In my opinion, this is the most significant new company announcement in the Bitcoin world over the past few years,” Barefoot Mining CEO Bob Burnett said. “The new pool will bring new features and some badly needed diversity to the mining world.\"","Two centralized Bitcoin mining pools, AntPool and Foundry USA, currently dominate hashrate distribution, with an estimated combined market share of over 55% of the total Bitcoin hashrate, according to Blockchain.com.","However, it is important to note that these pools are made up of numerous geographically dispersed Bitcoin miners with the flexibility to redirect their mining power to different pools at any time.","<span data-v-f87c67ca=\"\">Bitcoin mining hashrate distribution. Image: <a href=\"https:\/\/www.blockchain.com\/explorer\/charts\/pools\" data-v-f87c67ca=\"\">Blockchain.com<\/a>.<\/span>","On Monday, Bitcoin mining firm DEMAND <a href=\"https:\/\/bitcoinmagazine.com\/business\/demand-launches-worlds-first-stratum-v2-bitcoin-mining-pool\" data-v-f87c67ca=\"\">launched<\/a> the first Bitcoin mining pool that operates on Stratum v2 — another initiative designed to bolster the decentralization of the Bitcoin mining ecosystem.","OCEAN said it plans to introduce additional Bitcoin mining decentralization improvements in 2024.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"2010","content":"DATE"},{"type":"South Carolina","content":"LOCATION"},{"type":"Bitcoin Mechanic","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Eligius Bitcoin","content":"PERSON"},{"type":"Mummolin, Inc.","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Dorsey","content":"PERSON"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$6.2 million","content":"MONEY"},{"type":"Wyoming","content":"LOCATION"},{"type":"Bob Burnett","content":"PERSON"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Dashjr","content":"PERSON"},{"type":"NewLayer Capital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Future of Bitcoin Mining Conference","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["James Hunt","The Block"]}