{"summary":"The so-called &#x27;FTX Accounts Drainer&#x27; is swapping its ether stack for bitcoin — and putting downward pressure on the price of ether in the process.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188624\/ether-under-pressure-as-ftx-accounts-drainer-cashes-out-for-bitcoin","publishDate":"2022-11-20T07:36:56","id":1160,"type":null,"title":"Ether under pressure as &#x27;FTX Accounts Drainer&#x27; cashes out for bitcoin","category":["BRIDGES"],"content":["After consecutive days of swapping cryptocurrencies drained from FTX for ether, the so-called \"FTX Accounts Drainer\" is now swapping its ether stack for bitcoin — and putting downward pressure on the price of ether in the process.","Earlier Sunday, the exploiter&nbsp;<a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1594293061030653952\" data-v-f87c67ca=\"\">swapped<\/a> about 5,000 ether for 347 renBTC — a form of wrapped bitcoin on Ethereum that can be redeemed for native bitcoin — according to blockchain tracker PeckShieldAlert. The drainer then followed with another <a href=\"https:\/\/twitter.com\/peckshieldalert\/status\/1594296349704728576?s=46&amp;t=6sF3ddczcCBQpPOBVbxF7g\" data-v-f87c67ca=\"\">swap<\/a> of roughly the same amount for 344.53 renBTC.","The exploiter next began <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1594296725711499264\" data-v-f87c67ca=\"\">bridging<\/a> the newly swapped renBTC out of Ethereum via Ren's BTC Gateway — effectively cashing out of the Ethereum blockchain in favor of native bitcoins.","As of 7 a.m. ET, about 45,000 ether had been sold. As of 7:20 a.m. ET, transactions were still taking place in real time.","The relentless selling from the FTX account drainer has put downward pressure on the price of ether, which has dropped almost 5% since the selling began. It has fallen through $1,200 and is currently trading at around $1,160.","Despite the heavy selling, the wallet <a href=\"https:\/\/etherscan.io\/address\/0x59abf3837fa962d6853b4cc0a19513aa031fd32b\" data-v-f87c67ca=\"\">labeled<\/a> \"FTX Accounts Drainer\" on Etherscan remains the 37th largest holder of ether — after being in the top 30 before the selling began. The drop follows <a href=\"https:\/\/twitter.com\/CertiKAlert\/status\/1594289021030731778\" data-v-f87c67ca=\"\">transfers<\/a> of approximately 50,000 ETH to a wallet beginning with 0x866E, which is conducting ether-to-renBTC swaps.","The identity of the FTX drainer remains unknown. While many say a hacker was able to drain the funds from the embattled exchange — which has filed for Chapter 11 bankruptcy protection — others speculate that the suspicious outflow of funds was an inside job.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"7 a.m. ET","content":"TIME"},{"type":"Alameda","content":"LOCATION"},{"type":"$1,160","content":"MONEY"},{"type":"7:20 a.m. ET","content":"TIME"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1,200","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","FTX"],"authors":["Adam James","The Block"]}