{"summary":"BNB Chain team said its governance will vote on whether to freeze and auto-burn exploited funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175503\/bnb-chain-governance-to-decide-what-will-happen-to-hacked-funds","publishDate":"2022-10-07T08:00:30","id":11617,"type":null,"title":"BNB Chain governance to decide what will happen to hacked funds","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">The BNB Chain is now back up and <\/span><a href=\"https:\/\/www.theblock.co\/post\/175437\/biance-bnb-chain-is-back-up-after-bridge-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">running<\/span><\/a><span data-v-f87c67ca=\"\"> after it was halted for several hours to investigate a large bridge exploit.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Thursday, an unknown hacker seized almost $560 million in BNB from the network's cross-chain bridge, called BSC Token Hub. Of this amount, the hacker transferred more than $100 million to other chains, according to security firm SlowMist. Almost <a href=\"https:\/\/debank.com\/profile\/0x489a8756c18c0b8b24ec2a2b9ff3d4d447f79bec\" data-v-f87c67ca=\"\">$430 million<\/a> in BNB tokens was held in the perpetrator's address on BNB Chain.<\/span>","<span data-v-f87c67ca=\"\">The hacker took advantage of a security bug to forge \"security proofs\" that enabled the ability to withdraw the bridge's locked funds. These proofs were needed to verify all withdrawal requests on the bridge.<\/span>","<span data-v-f87c67ca=\"\">In response to the exploit, the team halted the blockchain, ordering all of its 44 validators (including 26 active validators) to stop operations. This was done in an effort to prevent the hacker from making any further moves and try to take back control of funds that remained on BNB Chain, it noted in a <\/span><a href=\"https:\/\/www.bnbchain.org\/en\/blog\/bnb-chain-ecosystem-update\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog update<\/span><\/a><span data-v-f87c67ca=\"\"> today.<\/span>","<span data-v-f87c67ca=\"\">\"It was not that easy as BNB Smart Chain has 26 active validators at present and 44 in total in different time zones. This delayed closure, but we were able to minimize the loss,\" the team said.<\/span>","<span data-v-f87c67ca=\"\">While the BNB Chain has already stopped funds held in the hacker's wallet from being moved, the project will conduct a governance vote to formalize the decision and make a final call on what to do with those funds.<\/span>","<span data-v-f87c67ca=\"\">In the same blog post, the team said that it will conduct on-chain governance votes to decide whether to freeze funds in the hacker's address on BNB Chain and whether to \"auto-burn\" the tokens.<\/span>","<span data-v-f87c67ca=\"\">Furthermore, BNB Chain’s governance will vote on announcing a bounty for \"catching hackers\" where 10% of recovered funds would be granted as a reward. Finally, it aired plans for a white hat bug bounty program that would pay up to $1 million for each security&nbsp; bug found on BNB network, including the exploited bridge.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$560 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"BSC Token Hub","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"$430 million","content":"MONEY"}],"hashtag":["BNB CHAIN"],"authors":["Vishal Chawla","The Block"]}