{"summary":"Camp Network, a Layer 2 blockchain, has raised $4 million in a seed funding round. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286100\/camp-network-raises-4-million-in-seed-funding-round","publishDate":"2024-04-02T12:03:16","id":11614,"type":null,"title":"Camp Network raises $4 million in seed funding round","category":["LAYER 2S AND SCALING"],"content":["Camp Network, a modular Layer 2 blockchain, has raised $4 million in a seed funding round as it gears up to launch its mainent.","Maven 11 led the round that included participation from OKX, Protagonist, Inception Capital, Paper Ventures, HTX, Moonrock Capital and Eterna Capital. Angel investors such as the founders of Eigen Layer, Sei Network and Selini also contributed funds.&nbsp;","The funds will support the network's buildout ahead of its mainnet rollout in June. In addition, 20 active teams within the Camp Network ecosystem will receive funds to grow their ranks. The network's testnet is launching this month.&nbsp;","“This investment will propel Camp Network’s mission to redefine the future of onchain consumers and further develop our ecosystem for any consumer use case,” James Chi said in a statement Tuesday.&nbsp;","Camp Network is focused on creating a decentralized network of services geared toward the music, media and entertainment industries. The network uses off-chain engagement data from social and streaming apps to help consumer-focused groups develop monetized strategies for virtual content.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Inception Capital","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Selini","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"James Chi","content":"PERSON"},{"type":"Eigen Layer","content":"ORGANIZATION"},{"type":"Sei Network","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Eterna Capital","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Moonrock Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Elizabeth Napolitano","The Block"]}