{"summary":"The bridge will tokenize Bitcoin so it can be used on Avalanche&#x27;s DeFi protocols.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153744\/avalanche-introduces-bitcoin-bridge-as-core-wallet-feature","publishDate":"2022-06-23T08:11:18","id":11613,"type":null,"title":"Avalanche introduces Bitcoin bridge as Core wallet feature","category":["DEFI"],"content":["Ava Labs has launched a new bridge solution allowing users to directly transfer funds between Bitcoin network and <a href=\"https:\/\/www.theblock.co\/linked\/141911\/ava-labs-avalanche-raising-350-million-5-25-billion-valuation-report\" data-v-f87c67ca=\"\">Avalanche<\/a>, a high performance Layer 1 blockchain that offers compatibility with the Ethereum Virtual Machine.","On Wednesday, Ava Labs <a href=\"https:\/\/twitter.com\/avalancheavax\/status\/1539639648758255617\" data-v-f87c67ca=\"\">released<\/a> the Avalanche-Bitcoin bridge as part of its new browser-based web3 wallet called Core. The bridge will tokenize the top crypto asset as an Avalanche-based token called BTC.b, allowing it to be used on Avalanche's DeFi protocols including Platypus and TraderJoe.","The bridging process works by locking up an amount of bitcoin and issuing an equivalent number of tokens on Avalanche, a process called wrapping. The team claims that the wrapping setup on the bridge is non-custodial, unlike other popular Ethereum-based tokenized bitcoin solutions, including <a href=\"https:\/\/www.theblock.co\/post\/107540\/1-3-of-bitcoins-supply-has-now-been-wrapped-onto-ethereum\" data-v-f87c67ca=\"\">wrapped bitcoin<\/a> (WBTC).","For every WBTC that exists on Ethereum, there is a bitcoin that is held in a centrally controlled smart contract, which some critics believe exposes users to counter-party risk and trust issues. Ava Labs claims its bridge does not have the same issues.","\"We are still wrapping BTC to BTC.b. The difference is that we are starting with native BTC (instead of wrapped WBTC on Ethereum), then wrapping the asset on Avalanche to BTC.b,\" a spokesperson from Ava Labs told The Block.","The bridge's browser extension page <a href=\"https:\/\/chrome.google.com\/webstore\/detail\/core\/agoakfejjabomempkjlepdflaleeobhb\" data-v-f87c67ca=\"\">says<\/a> the bridge relies on Intel SGX (Software Guard Extensions), the same technology used in Avalanche's bridge connecting with Ethereum. In the future, this bridge will also give bitcoin users access to Avalanche subnets such as DeFi Kingdoms and Swimmer, as well as other blockchain networks like Ethereum.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ava Labs","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Intel","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AVALANCHE","BITCOIN"],"authors":["Vishal Chawla","The Block"]}