{"summary":"Galois Capital, a crypto hedge fund that had half of its assets trapped on the collapsed crypto exchange FTX, is reportedly set to shut down and return its remaining money to investors.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213166\/crypto-hedge-fund-galois-capital-shuts-after-getting-caught-up-in-ftx-saga-ft","publishDate":"2023-02-20T01:59:58","id":11611,"type":null,"title":"Crypto hedge fund Galois Capital shuts after getting caught up in FTX saga: FT","category":["COMPANIES"],"content":["Galois Capital, a crypto hedge fund that had half of its assets trapped on the collapsed crypto exchange FTX, is reportedly shutting down and returning its remaining money to investors.","\"Given the severity of the FTX situation, we do not think it is tenable to continue operating the fund both financially and culturally,\" Kevin Zhou, co-founder of Galois Capital, wrote in documents seen by the <a href=\"https:\/\/www.ft.com\/content\/a06b77bc-52ac-4901-98d7-8c567449262e\" data-v-f87c67ca=\"\">Financial Times<\/a>. \"Once again I'm terribly sorry about the current situation we find ourselves in.\"","Galois Capital&nbsp;<a href=\"https:\/\/twitter.com\/Galois_Capital\/status\/1627579151052902400\" data-v-f87c67ca=\"\">confirmed<\/a> the shutdown in a Twitter thread, saying, \"it is true that our flagship fund is shutting down.\"","\"In spite of that, I am proud to say that although we lost almost half our assets to the FTX disaster and then sold the claim for cents on the dollar, we are among the few who are closing shop with an inception-to-date performance which is still positive,\" the thread read.&nbsp;","FTX filed for bankruptcy protection in November after being unable to meet customer withdrawal requests, leaving a million creditors in the lurch. Galois Capital could have <a href=\"https:\/\/www.theblock.co\/post\/186306\/crypto-hedge-fund-galois-capital-says-half-of-funds-stuck-on-ftx-ft\" data-v-f87c67ca=\"\">had<\/a> around $100 million stuck on the exchange, according to an FT report at the time. Zhou had warned investors that it would take a few years to recover \"some percentage\" of the funds.","The FT reported Monday that Galois had sold its bankruptcy claims for 16 cents on the dollar.","Galois's closure will see investors receive 90% of the money not trapped on FTX, per the report. The remaining 10% will reportedly be temporarily held back until discussions with the administrators and auditor are finalized.","\"This entire tragic saga starting from the luna collapse to the 3AC [Three Arrows Capital] credit crisis to the FTX\/Alameda failure has certainly set the crypto space back significantly,\" wrote Zhou in the documents seen by FT. \"However, I, even now, remain hopeful for crypto's long-term future.\"","\"Crypto will endure,\" tweeted Galois Capital. \"These setbacks are temporary and will come to pass.\"","<em data-v-f87c67ca=\"\">Updates with Galois Capital's tweets&nbsp;<\/em>","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Kevin Zhou","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"FT","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"16 cents","content":"MONEY"},{"type":"Galois Capital","content":"ORGANIZATION"},{"type":"Galois","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}