{"summary":"Dapper Labs rolled out promotional NFT drops to coincide with Super Bowl as NFL All Day has generated about $10 million since September.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276959\/nft-of-tom-brady-sells-for-40000-ahead-of-super-bowl-drops-promoted-by-joe-montana-john-elway","publishDate":"2024-02-10T12:28:34","id":11627,"type":null,"title":"NFT of Tom Brady sells for $40,000 ahead of Super Bowl drops promoted by Joe Montana, John Elway","category":["NFT COLLECTIONS"],"content":["Dapper Lab's NFL All Day digital collectibles brand appears to have entered into Super Bowl weekend with a bit of momentum.","First off, the web3 firm's sports themed, digital-collectible brand known as NFL All Day issued promotional packs of NFTs during the professional football league's playoffs in January, which seems to have helped the collection score a couple high-profile sales including a non-fungible token featuring Tom Brady, which sold for over $40,000, according to the company. A similar NFT featuring quarterback Aaron Rodgers also fetched $34,000, Dapper Labs also said.","While NFL All Day — digital collectibles of video highlights people can trade on an open marketplace — has never taken off to the extent that Dapper Labs' first sports-themed NFT collection NBA Top Shot did, which in late 2021 generated hundreds of millions of dollars in <a href=\"https:\/\/www.cryptoslam.io\/nba-top-shot?headerPeriod=all&amp;tab=historical_sales_volume\" data-v-f87c67ca=\"\">monthly sales volume<\/a>, the professional football-inspired collection has registered nearly $10 million in cumulative sales since the NFL's regular season began in September, according to <a href=\"https:\/\/www.cryptoslam.io\/nfl-all-day?tab=historical_sales_volume&amp;headerPeriod=all\" data-v-f87c67ca=\"\">CryptoSlam! data<\/a>.","Dapper Labs is now attempting to take advantage of the Super Bowl hoopla by advertising promotional drops to coincide with America's biggest sporting event. Releasing NFTs that feature famous moments in the careers of all-time great, Super Bowl winning quarterbacks like Joe Montana and John Elway, Dapper Labs also succeeded in convincing the two Hall of Fame inductees to promote the digital collectibles. Both Montana and Elway appeared in promos posted to <a href=\"https:\/\/twitter.com\/NFLALLDAY\" data-v-f87c67ca=\"\">NFL All Day's X account<\/a>.&nbsp;&nbsp;","The Super Bowl airs on Sunday and will be played between the San Francisco 49ers and Kansas City Chiefs in Las Vegas. The football game, and the festivities surrounding it, have long been considered one of the largest, if not the largest, marketing opportunity in the U.S. each year.","It's worth noting that Dapper Labs, along with Montana and Elway, steers away from the use of the acronym for non-fungible tokens (NFT) when promoting the collections. The term \"NFT\" acquired a <a href=\"https:\/\/www.theblock.co\/post\/225338\/rolling-stones-nfts-digital-certificates-of-authenticity\" data-v-f87c67ca=\"\">bad reputation<\/a>, in some people's eyes, during the downturn in crypto. Dapper Labs' success in convincing sports legends to promote its digital products, which are minted on the Flow blockchain, could alone be considered a victory for the Web3 space.&nbsp;","Whether it was fair or not, sports teams and players who took money from crypto-related organizations came under fire during crypto's downturn and the collapse of FTX, a company that generously paid sports stars to endorse its exchange before it went bankrupt and millions of users could not access their funds.","Dapper Labs partnered with the National Football League and NFL Players Association to launch NFL All Day in 2022.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Aaron Rodgers","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"National Football League","content":"ORGANIZATION"},{"type":"Elway","content":"PERSON"},{"type":"Tom Brady","content":"PERSON"},{"type":"$34,000","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Montana","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Hall","content":"PERSON"},{"type":"NFL","content":"ORGANIZATION"},{"type":"John Elway","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Las Vegas","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"NFL All Day","content":"ORGANIZATION"},{"type":"NFL Players Association","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Joe Montana","content":"PERSON"},{"type":"Kansas City Chiefs","content":"LOCATION"},{"type":"$40,000","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}