{"summary":"There&#x27;s a new Ethereum-based stablecoin protocol in town, and its creator believes that the strategy it will employ to maintain parity with the U.S.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63913\/liquity-a-new-ethereum-based-lending-protocol-promises-a-fully-redeemable-stablecoin","publishDate":"2020-05-04T15:01:05","id":11624,"type":null,"title":"Liquity, a new Ethereum-based lending protocol, promises a fully redeemable stablecoin","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">There's a new <a href=\"https:\/\/www.theblockcrypto.com\/post\/66363\/former-dharma-and-harbor-employees-launch-ethereum-based-art-marketplace\" data-v-f87c67ca=\"\">Ethereum-based<\/a> stablecoin protocol in town, and its creator believes that the strategy it will employ to maintain parity with the U.S. dollar will make the system more capital-efficient and less risky than its predecessors.<\/span>","<span data-v-f87c67ca=\"\">Called <a href=\"https:\/\/www.liquity.org\/\" data-v-f87c67ca=\"\">Liquity<\/a>, the system was designed by <\/span><a href=\"https:\/\/twitter.com\/LiquityOrg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Robert Lauko<\/span><\/a><span data-v-f87c67ca=\"\">, a former blockchain researcher at the decentralized cloud startup Dfinity. Lauko is also the CEO of a new startup, also called Liquity, unveiled today.<\/span>","<span data-v-f87c67ca=\"\">To mint the protocol's stablecoin, called LQTY, borrowers will have to deposit much less collateral than is required by existing systems like MakerDAO, which Lauko attributes to the protocol’s ability to \"instantly liquidate\" risky loans, and a novel redemption mechanism that minimizes the need for governance.<\/span>","<span data-v-f87c67ca=\"\">Protocols like MakerDAO let users deposit cryptocurrency-denominated collateral to take out loans denominated in U.S. dollar-pegged stablecoins. To account for the volatility of the crypto-collateral, they typically require users to deposit significantly more value in crypto than they borrow in stablecoins, which in MakerDAO are called DAI.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MakerDAO takes ETH, Basic Attention Tokens (BAT), and <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/63818\/wrapped-bitcoin-added-as-dai-collateral-type-to-defi-lending-protocol-maker\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Wrapped Bitcoin (wBTC)<\/span><\/a><span data-v-f87c67ca=\"\"> as collateral, and requires users to \"overcollateralize\" their DAI by 150%. It also takes USDC, and in that case,&nbsp;<\/span><a href=\"https:\/\/blog.makerdao.com\/usdc-approved-by-maker-governance-as-the-third-collateral-type-of-the-maker-protocol\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">requires a 125% ratio<\/span><\/a><span data-v-f87c67ca=\"\">. If the value of a loan's underlying collateral drops below that threshold, it triggers a liquidation process. The collateral from liquidated loans is then sold at a minimum 3% discount via auction in order to raise DAI and cover the outstanding debt. A 10% liquidation penalty is also applied with the aim of incentivizing debtors so that they'll maintain a healthy collateralization ratio.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Lauko argues that auctions are not efficient enough, because they take too much time and depend on finding buyers on the spot. A sudden and steep market crash in March spotlighted these shortcomings. There was so little competition during MakerDAO's collateral auctions during the downturn that many were won with zero-bids, leaving the system with <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/61797\/maker-foundation-class-action-lawsuit-black-thursday\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">millions of dollars worth of unaccounted-for debt<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">His answer to that is Liquity's automatic and \"instant\" liquidation process.&nbsp; The first priority in the event of liquidation will be to cover the debt using a so-called \"stability pool\" – basically a fund into which users can deposit LQTY at any time. When loans are liquidated, LQTY tokens in the pool can be burned to clear the debt. As a reward, those who have deposited LQTY into the stability pool stand to earn a portion of the collateral from the liquidated positions.<\/span>","<span data-v-f87c67ca=\"\">If there isn't enough LQTY in the stability pool to cover all the undercollateralized loans, the protocol automatically redistributes the remaining undercollateralized debt and its associated collateral to other borrowers. The more collateral someone has, the more debt and collateral they will receive from the liquidated positions.<\/span>","<span data-v-f87c67ca=\"\">Liquity's liquidation scheme will still require on-chain transactions, where it could potentially run into congestion. Nonetheless, Lauko says the system lets Liquity set its minimum collateral ratio much lower than MakerDAO, at 110%. \"You need less margin to get the same stability,\" he says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The differences don't stop there. Crucial to MakerDAO is a recurring \"stability fee\" that borrowers must pay. The community uses on-chain voting to stipulate the fee rate and uses the proceeds to manage the supply of DAI and maintain its peg. Liquity won't have to charge any recurring fees, says Lauko, thanks to a redemption mechanism that will let LQTY holders at any time redeem their stablecoins for an amount of ETH equal to the dollar value of the redeemed LQTY.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The protocol achieves this by using the LQTY to repay the riskiest loans in the system and then transferring the corresponding ETH collateral to the redeemer. There will be no net loss for the borrower whose loan gets automatically repaid because they will only lose in collateral what they have gained in debt, says Lauko.<\/span>","<span data-v-f87c67ca=\"\">The ability to redeem LQTY like this sets a \"hard price floor,\" he says. In a scenario where LQTY is trading for under&nbsp; $1.00, arbitrageurs can profit by redeeming LQTY for ETH and selling ETH for a greater dollar value than stablecoins they redeemed. \"This would very quickly stabilize the peg,\" argues Lauko, since it would increase demand for LQTY. Thanks to this system, there is no need for governance, he says. (It's important to note, however, that the redemption feature will not solve the problem if LQTY is ever trading above $1.00.)<\/span>","<span data-v-f87c67ca=\"\">The system will not be completely fee-less, however. There will be a redemption fee, which will be \"algorithmically adjusted\" according to the rate at which redemptions are occurring at a given time. There will also be a one-time \"issuance fee\" for minting stablecoins, which will also be adjusted based on the rate of redemptions.<\/span>","<span data-v-f87c67ca=\"\">Lauko says Liquity has not yet decided on which oracle service it will use to keep track of the U.S. dollar value of ETH. That decision will likely be closely watched in the DeFi community because, depending on their setup, oracles can be seen as central points of failure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among the early hires for Liquity is Ashleigh Schap, who previously worked on business development for MakerDAO. Schap was one of a number of high-profile departures last year <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/20826\/inside-maker-dao-leadership-conflict-over-direction-fuels-multiple-departures-as-it-eyes-launch-of-ats\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">amid a conflict between the project's leaders<\/span><\/a><span data-v-f87c67ca=\"\"> over who should control its development fund.<\/span>","<span data-v-f87c67ca=\"\">Lauko says his team is now wrapping up the development of the system's core functionality and plans to have it audited soon. Liquity has already raised a small pre-seed round in Switzerland, where it is based, and now the firm is looking to raise more, says Lauko, so that it can subject Liquity to in-depth economic modeling and \"make sure that that this holds up to the expectations.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"LQTY","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Lauko","content":"PERSON"},{"type":"Robert Lauko","content":"PERSON"},{"type":"125%","content":"PERCENT"},{"type":"DAI","content":"ORGANIZATION"},{"type":"110%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"150%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$1.00","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"Ashleigh Schap","content":"PERSON"}],"hashtag":[],"authors":["Mike Orcutt","The Block"]}