{"summary":"Coinbase&#x27;s heavy traffic coincided with bitcoin reaching $64,000 and millions in liquidations today. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279682\/coinbase-restabilized-after-heavy-traffic-caused-0-balance-glitch","publishDate":"2024-02-28T16:03:40","id":11626,"type":null,"title":"Coinbase restabilized after heavy traffic caused $0 balance glitch","category":["EXCHANGES"],"content":["Crypto exchange Coinbase is stabilizing its platform after a technical error showed customer balances as $0.&nbsp;","The glitch was due to a heavy load of traffic, the firm's CEO Brain Armstrong <a href=\"https:\/\/twitter.com\/brian_armstrong\/status\/1762933446194901140?s=20https:\/\/twitter.com\/brian_armstrong\/status\/1762933446194901140?s=20\" data-v-f87c67ca=\"\">explained<\/a> on the social media platform X. \"We had modeled a ~10x surge in traffic and load tested it. This exceeded that number. It's expensive to keep services over-provisioned, but we'll need to keep working on auto-scaling solutions, and killing any remaining bottlenecks. Thank you for bearing with us.\"","Though degraded site performance continues on <a href=\"https:\/\/www.theblock.co\/post\/279371\/coinbase-asset-recovery-tool-bnb-smart-chain-polygon\" data-v-f87c67ca=\"\">Coinbase<\/a>, the firm <a href=\"https:\/\/status.coinbase.com\/\" data-v-f87c67ca=\"\">noted<\/a> in a status report at 3:15 p.m. ET that it continues \"to see improvement in customer trading on platform. Customer login has recovered and we’re seeing intermittent improvements in sends. Due to continued heightened traffic some customers may still see errors in receives and with some payment methods.\"","The exchange noted earlier in the day that it was aware of the glitch showing $0 customer balances and issues buying and selling assets, adding that customer assets are safe. The Block confirmed the technical error in Coinbase's app.","Heavy traffic on Coinbase coincided with the price of bitcoin surging near $64,000, coinciding with millions of <a href=\"https:\/\/www.theblock.co\/post\/279652\/bitcoin-price-whipsaws-around-60000-while-etfs-see-record-volumes-this-is-officially-a-craze\" data-v-f87c67ca=\"\">liquidations<\/a>, The Block previously reported. The last time the token broke past $60,000 was in October 2021.&nbsp;","Many <a href=\"https:\/\/www.theblock.co\/post\/269714\/coinbase-changes-head-of-custody-amid-rush-for-spot-bitcoin-etf-approval\" data-v-f87c67ca=\"\">institutional<\/a> issuers of spot bitcoin ETFs, such as BlackRock and Grayscale Investments, tapped Coinbase as their crypto custodian. However, Nate Geraci, president of investment advisor The ETF Store, told The Block that spot bitcoin ETF issuers weren't affected.&nbsp;","\"There are no apparent issues with Coinbase’s institutional custody solutions, so this wouldn’t impact spot bitcoin ETFs,\" Geraci said. \"My expectation is that spot bitcoin ETF issuers who rely solely on Coinbase will work to diversify their custodial relationships – but I don’t view today’s events as any sort of catalyst for that. I believe using multi-custodians was always the goal.\"&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$60,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"3:15 p.m. ET","content":"TIME"},{"type":"$0","content":"MONEY"},{"type":"October 2021","content":"DATE"},{"type":"CEO Brain Armstrong","content":"ORGANIZATION"},{"type":"Nate Geraci","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Geraci","content":"PERSON"},{"type":"$64,000","content":"MONEY"}],"hashtag":["COINBASE"],"authors":["MK Manoylov","Sarah Wynn","The Block"]}