{"summary":"On April 5th, RootData, a leading Web3 asset data platform, announced the completion of a $1.25 million seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286668\/rootdata-secured-1-25-million-seed-funding-round-to-build-a-more-interactive-web3-asset-data-layer","publishDate":"2024-04-05T09:01:05","id":1162,"type":null,"title":"RootData Secured $1.25 Million Seed Funding Round to Build a More Interactive Web3 Asset Data Layer","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">On April 5th, <\/span><a href=\"https:\/\/www.rootdata.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">RootData<\/span><\/a><span data-v-f87c67ca=\"\">, a leading Web3 asset data platform, announced the completion of a $1.25 million seed funding round. The round was led by NLVC, with participation from Boyaa Interactive (00434.hk), Bonfire Union Ventures (a fund under Mask Network), Sending Labs, Skyland Ventures, GoPlus, Basics Capital, Rebase D. Ventures, UniSat, SeeDAO, and individual investors including Gavin, founder of Orbiter Finance, Shawn Shi, co-founder of Alchemy Pay, and Jackson, co-founder of 0xScope. The funding will primarily be used for product development and market expansion.<\/span>","<span data-v-f87c67ca=\"\">Launched in early 2022, RootData’s mission is to simplify Web3 investments by creating a structured and visualized system of on-chain and off-chain Web3 data. Starting with investment and financing data, RootData has subsequently developed a suite of features including a project library, an institution library, a personality library, a tag atlas, and an ecosystem atlas, aiding users in efficiently searching for project information. Based on hundreds of thousands of user search data, RootData’s recently launched hot list module has already become a market indicator.<\/span>","<span data-v-f87c67ca=\"\">To manage the vast and complex data, RootData has developed an intelligent data processing system for data collection and cleaning over nearly a year. By combining process-oriented manual information processing and entry mechanisms, RootData has established the most credible off-chain data system in the Web3 industry, with data being actively used by prominent media such as The Wall Street Journal, Coindesk, Cointelegraph,Decrypt, and hundreds of industry KOLs.<\/span>","<span data-v-f87c67ca=\"\">Currently, RootData is increasingly focusing on on-chain data, allowing users to view real-time holdings, as well as large transfer dynamics of these on-chain entities, on the homepages of projects, institutions, and individuals. Thanks to the rich off-chain information, the on-chain data on RootData generally possesses higher readability and contextual information, thus enhancing user reading efficiency.<\/span>","<span data-v-f87c67ca=\"\">RootData has also encapsulated its rich and accurate data into APIs to provide services externally. Any third-party partner pages can integrate RootData data, such as project investors, financing amounts, detailed introductions, social media links, etc., avoiding the cumbersome process and manpower investment of maintaining large amounts of project data while significantly improving user experience. Currently, the number of RootData API customers has exceeded 30, covering various scenarios including task platforms, media, wallets, AI robots, etc.<\/span>","<span data-v-f87c67ca=\"\">Moving forward, RootData will further focus on the organic integration of on-chain and off-chain data, continuously iterate product functions and experiences, and explore diversified monetization scenarios, such as primary and secondary market transactions, membership models, etc.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tony, a partner at NLVC, expressed that the RootData team has impressive data aesthetic capabilities and strong execution power. The spontaneous word-of-mouth virality from many users is remarkable, and there’s good reason to believe that RootData will become an important entry point for many into the Web3 industry.<\/span>","<span data-v-f87c67ca=\"\">Suji, founder of Mask Network, mentioned that RootData has become an essential product for his daily work. As a seasoned user, he can see that the RootData team has strong product evolution capability, believing that RootData will eventually become a new gateway to Web3 assets.<\/span>","<span data-v-f87c67ca=\"\">David, founder of Boyaa Interactive (00434.hk), stated that RootData’s product boasts an excellent data structure and smooth user interaction experience, which helps enhance investment decision efficiency and capture investment signals.<\/span>","<span data-v-f87c67ca=\"\">“This funding round represents investors and the market’s full recognition of RootData’s achievements over the past year. We will continue to commit to providing users with a more interactive product experience, becoming a trusted data layer in the Web3 field,” said Pan, co-founder of RootData.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by RootData<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NLVC","content":"ORGANIZATION"},{"type":"Cointelegraph","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"David","content":"PERSON"},{"type":"Rebase D. Ventures","content":"ORGANIZATION"},{"type":"Bonfire Union Ventures","content":"ORGANIZATION"},{"type":"Basics Capital","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jackson","content":"PERSON"},{"type":"RootData","content":"ORGANIZATION"},{"type":"Mask Network","content":"ORGANIZATION"},{"type":"Skyland Ventures","content":"ORGANIZATION"},{"type":"Suji","content":"PERSON"},{"type":"Boyaa Interactive","content":"ORGANIZATION"},{"type":"RootData API","content":"ORGANIZATION"},{"type":"Orbiter Finance","content":"ORGANIZATION"},{"type":"Shawn Shi","content":"PERSON"},{"type":"April 5th","content":"DATE"},{"type":"$1.25 million","content":"MONEY"},{"type":"Gavin","content":"PERSON"},{"type":"Decrypt","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}