{"summary":"A federal judge approved Voyager to make up to $1.9 million in retention payments to key employees whose identities will also be sealed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165783\/voyager-approved-to-pay-up-to-1-9-million-in-bonuses-to-retain-employees","publishDate":"2022-08-25T13:16:53","id":11623,"type":null,"title":"Voyager approved to pay up to $1.9 million in bonuses to retain employees","category":["LEGAL"],"content":["A federal judge has signed court orders allowing crypto lender Voyager to pay up to $1.9 million to specific employees for remaining with the firm and sealing their identities as well.","The so-called \"key employee retention plan\" or KERP allows Voyager to make payments to certain non-insider employees it sees as crucial to its operations and potential to re-emerge from bankruptcy successfully. Voyager argued those employees' compensation has changed in recent months as their equity depreciated.","\"The departure of the Debtors’ key employees during these chapter 11 cases would destroy value, harm the Debtors’ restructuring process, and adversely affect the Debtors’ ability to operate in the ordinary course upon emergence,\" said Voyager in its request for the funds.","Those cash rewards would cap at $1.9 million to 38 non-insiders performing essential accounting, cash and digital asset management, IT infrastructure, legal, and other critical functions. However, at a <a href=\"https:\/\/www.coindesk.com\/policy\/2022\/08\/24\/crypto-lender-voyager-can-pay-employees-retention-bonuses-us-judge-rules\/\" data-v-f87c67ca=\"\">hearing<\/a> yesterday, counsel told Judge Michael Wiles the amount would be closer to $1.6 million for more than 30 employees, as some have left the company. The names of those receiving the payout will also be sealed per a companion order.&nbsp;","During that hearing, Voyager counsel confirmed no senior management positions counted among the employees receiving the retention money.&nbsp;","Voyager <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">entered<\/a> Chapter 11 bankruptcy proceedings in early July after halting activity on its platform. Since then, it has been winding its way through the process and recently received <a href=\"https:\/\/www.theblock.co\/post\/161661\/voyager-approved-to-return-270-million-in-cash-deposits-to-customers\" data-v-f87c67ca=\"\">approval<\/a> to return $270 million in cash deposits to customers.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.9 million","content":"MONEY"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$270 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"KERP","content":"ORGANIZATION"},{"type":"Michael Wiles","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}