{"summary":"The U.S. tax agency said it plans to define most NFTs as a collectibles, akin to gems and cards, until the “further guidance is issued.” ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221622\/irs-to-formalize-tax-treatment-of-nfts-as-collectibles-similar-to-other-art","publishDate":"2023-03-21T12:57:56","id":11636,"type":null,"title":"IRS to formalize tax treatment of NFTs as collectibles, similar to other art","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Internal Revenue Service and the Treasury Department want feedback on the treatment of NFTs as collectibles for tax purposes.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The IRS said it plans to treat NFTs like collectibles, akin to gems, stamps, alcoholic beverages and art, in a <a href=\"https:\/\/www.irs.gov\/newsroom\/irs-issues-guidance-seeks-comments-on-nonfungible-tokens\" data-v-f87c67ca=\"\">notice<\/a> released on Tuesday. The IRS also plans to define NFTs as a collectible until the “further guidance is issued.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Accountants have recommended treating NFTs as collectibles for tax purposes since they substantially grew in popularity two years ago, the IRS guidance would formalize that tax treatment, placing NFTs in the same tax category as physical art, like paintings and sculptures.&nbsp;<\/span>","The U.S. tax agency notes in its release seeking comment that, \"Generally, collectibles also do not have as advantageous capital-gains tax treatment as other capital assets.\"","<span class=\"s1\" data-v-f87c67ca=\"\">NFTs that certify ownership of a physical property would be scrutinized with a 'look-through' analysis, the agency added, meaning the IRS will view the NFT as an analogue for the underlying asset it certifies. If that asset is a collectible, like a gem, the NFT will be taxed that way. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">NFT creators are subject to other taxes, like capital gains and personal income.&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">Cryptocurrencies themselves are currently taxed as property in the U.S., meaning they fall under the capital gains tax rate when sold or transferred.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Treasury and IRS asked for comments on questions such as whether there are concerns with applying the “look-through analysis” and what other NFT-related guidance would be helpful, among other questions. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Comments are due June 19. &nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"June 19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"popularity two years ago","content":"DATE"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["IRS"],"authors":["Sarah Wynn","The Block"]}