{"summary":"The dYdX Chain will allocate all accrued fees to its network validators and stakers, while tokens will need to be staked to vote on governance matters.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259766\/dydx-chain-to-distribute-all-network-fees-to-validators-and-stakers","publishDate":"2023-10-27T09:00:03","id":11639,"type":null,"title":"DYdX Chain to distribute all network fees to validators and stakers","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The dYdX Chain will allocate all accrued fees to its network validators and stakers, in addition to expanding the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248448\/dydx-dydx-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/hjnIm9bV.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">DYDX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.35%\n    <\/span><\/a> <!----><\/span> token’s capabilities on the version 4 platform.<\/span>","As of 1 p.m. EST yesterday, the <a href=\"https:\/\/www.theblock.co\/post\/259658\/dydx-chain-officially-launches-on-mainnet-as-standalone-cosmos-layer-1\" data-v-f87c67ca=\"\">alpha mainnet<\/a> of the dYdX Chain became operational, with validators creating the genesis block. This marked a notable phase transition for the decentralized derivatives platform.","In a latest update, the dYdX Foundation confirmed the extended utility of the DYDX token in version 4, emphasizing its vital role in bolstering network security and governance. The token will be staked to network validators, and all protocol fees — including both USDC trading fees and DYDX-denominated gas fees — will be channeled to these validators and stakers.","A spokesperson for the dYdX Foundation clarified that the chain’s security incentives would not rely on token inflation as seen in other blockchains; instead, it will be funded through fees collected in USDC and distributed to validators and stakers.","The mechanism for fee distribution will be managed via the <a href=\"https:\/\/docs.cosmos.network\/main\/build\/modules\/distribution\" data-v-f87c67ca=\"\">Cosmos x\/distribution module<\/a>, providing a efficient system for fee allocation on the network. This is to ensure fees are handed out more evenly among validators and stakers.","Tokens will need to be staked to be used in the blockchain's governance system. Validators receive the voting power of tokens staked with them, unless the token owner decides to vote on a proposal themselves.","The activation of the dYdX alpha mainnet marks the first phase in transitioning to dYdX version 4 and its new, community-governed Layer 1 blockchain. Built on the Cosmos SDK, the dYdX Chain employs the CometBFT consensus algorithm.","At the present alpha stage, the mainnet is aimed at primarily stress-testing the network and onboarding validators. A subsequent beta launch is planned, pending approval from a community governance vote, that will eventually enable trading on the network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"+0.35%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Cosmos SDK","content":"ORGANIZATION"},{"type":"1 p.m. EST yesterday","content":"TIME"},{"type":"dYdX Foundation","content":"ORGANIZATION"}],"hashtag":["ASSETS","DERIVATIVES","DEXS","STAKING"],"authors":["Vishal Chawla","The Block"]}