{"summary":"Ryder Ripps’ defense counsel rejected Yuga Labs&#x27; claims in a follow-up filing earlier this week, as the legal dispute drags on.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282098\/yuga-labs-requests-court-sanction-ryder-ripps","publishDate":"2024-03-12T23:40:08","id":11646,"type":null,"title":"Yuga Labs requests court sanction on Ryder Ripps for destroying private keys in ‘bad faith’","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">In the latest of the Yuga Labs’ legal dispute against artist Ryder Ripps and his partner Jeremy Cahen, the NFT studio behind the popular Bored Ape Yacht Club (BAYC) NFT collection requested a U.S. court to sanction Ripps for allegedly destroying private keys for his wallets containing RR\/BAYC NFTs deliberately to “thwart” the court injunction, according to a filing last week.<\/span>","<span data-v-f87c67ca=\"\">“Given Mr. Ripps’ bad-faith destruction of his private keys, misleading declaration, and continued misrepresentations to Yuga Labs and the Court, the Court should exercise its inherent power and hold Mr. Ripps in contempt,” Yuga Labs said in the <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/63458882\/467\/yuga-labs-inc-v-ripps\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/63458882\/469\/yuga-labs-inc-v-ripps\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">response<\/span><\/a><span data-v-f87c67ca=\"\"> filed Monday, the defendants requested the court to reject Yuga Labs’ sanction request. The filing said that Ripps’ counsel had reached out to Yuga Labs’ counsel, contrary to the company’s filing last week. It also alleged that Ripps complied with the October injunction in full, except for the orders tied to wallets which he lost access to.<\/span>","<span data-v-f87c67ca=\"\">The two parties have been in a long-running dispute surrounding Ripps and Cahen’s creation, RR\/BAYC NFTs, which the <\/span><a href=\"https:\/\/www.theblock.co\/post\/259711\/ryder-ripps-must-pay-yuga-labs-nearly-1-6-million-over-copyright-infringement-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">court saw as an infringement<\/span><\/a><span data-v-f87c67ca=\"\"> of Yuga Labs’ Bored Ape Yacht Club trademark in a decision last October. The Oct. 25 injunction ordered Ripps and Cahen to relinquish any NFTs infringing intellectual property.<\/span>","<span data-v-f87c67ca=\"\">A California district court made a <\/span><a href=\"https:\/\/www.theblock.co\/post\/275909\/ryder-ripps-must-pay-yuga-labs-9-million-after-lawsuits-final-judgment\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">final judgment on Feb. 3<\/span><\/a><span data-v-f87c67ca=\"\"> in favor of Yuga Labs and required Ripps and Cahen to burn any remaining RR\/BAYC NFTs or hand them over to Yuga for them to be destroyed within two weeks, the filing said.<\/span>","<span data-v-f87c67ca=\"\">According to the <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/63458882\/467\/yuga-labs-inc-v-ripps\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\">, it was only on Feb. 21 that Ripps disclosed that he had destroyed private keys for the wallets containing those NFTs in December last year. Ripps explained that the action was to prevent any further inadvertent engagement with the wallet that may be seen as a violation of the court injunction.<\/span>","<span data-v-f87c67ca=\"\">“Mr. Ripps’ actions only further harm Yuga Labs by frustrating the purpose of the Court’s injunction,” Yuga Labs said in the filing. “To be clear, simply deleting private keys only means that Mr. Ripps can no longer access the infringing NFTs in his wallets—he still owns the NFTs, and they are still associated with him.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs added that Ripps could recover access to his NFTs if he possesses physical or digital backups of his private keys. The NFT studio further questioned the validity of Ripps’ explanation, saying that he continued to use one or more wallets tied to RR\/BAYC after the initial court injunction date of Oct. 25.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Court","content":"ORGANIZATION"},{"type":"Feb. 21","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Cahen","content":"PERSON"},{"type":"December last year","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Yuga Labs’ Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Ryder Ripps","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"Jeremy Cahen","content":"PERSON"},{"type":"Ripps","content":"PERSON"},{"type":"Oct. 25","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Feb. 3","content":"DATE"}],"hashtag":["BAYC","COURT HEARINGS","YUGA LABS"],"authors":["Danny Park","The Block"]}