{"summary":"Following the recent, Shapella upgrade, Ethereum developers are now making progress on the next upgrade — referred to as &quot;Cancun-Deneb.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227746\/ethereum-shapella-cancun-deneb","publishDate":"2023-04-22T10:16:58","id":11640,"type":null,"title":"Ethereum devs make progress on Cancun-Deneb upgrade after Shapella","category":["LAYER 1S"],"content":["On Thursday, Ethereum core developers convened to plan code modifications for the blockchain's consensus layer in preparation for the next upgrade after Shapella, Cancun-Deneb.","After activating the <a href=\"https:\/\/www.theblock.co\/post\/227057\/ethereum-shapella-first-week-deposits-withdrawals-burn\" data-v-f87c67ca=\"\">Shapella upgrade<\/a> earlier this month — which introduced validator withdrawals — developers are now making progress on the next upgrade, referred to as \"Cancun-Deneb,\" expected to occur later this year.&nbsp;","To make Ethereum cheaper for users, the upgrade will implement new changes across Ethereum's two mainnet layers: the execution layer, which handles smart contract execution, and the consensus layer, focused on blockchain consensus via staking.","To provide clarity, the upgrade for the execution layer will be called Cancun. The consensus layer upgrade will be named Deneb — thus giving the combined upgrade its name, Cancun-Deneb.","The most significant change anticipated in Ethereum's Cancun-Deneb upgrade later this year will be Ethereum Improvement Proposal (EIP) 4844, also known as \"<a href=\"https:\/\/www.theblock.co\/post\/189829\/ethereum-core-developers-signal-support-for-proto-danksharding\" data-v-f87c67ca=\"\">proto-danksharding.<\/a>\" EIP-4844 seeks to augment Ethereum's scalability beyond the current capabilities of Layer 2 solutions.","EIP-4844 aims to bring temporary storage and retrieval of off-chain data by Ethereum nodes to address the data and storage demands of blockchain applications. If this is successfully activated, EIP-4844 is expected to lower the cost of transactions on Layer 2 rollup solutions, including Optimism and Arbitrum, compared to their current rates.","During the call, developers announced that a fifth multi-client devnet to test EIP 4844 is set to be launched in the following week, as <a href=\"https:\/\/www.galaxy.com\/research\/insights\/ethereum-all-core-developers-consensus-call-107\/\" data-v-f87c67ca=\"\">noted<\/a> by Christine Kim, the vice president of research at Galaxy Digital, who attended the developers' meeting. Notably, EIP-4844 has already been tested on four other devnets.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/top-20-gas-consuming-smart-contracts-30d\/embed\" title=\"Top 20 Gas Consuming Smart Contracts (30D)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"Cancun","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Shapella","content":"LOCATION"},{"type":"Deneb","content":"ORGANIZATION"},{"type":"Christine Kim","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","ETHEREUM","OPTIMISM","POLYGON"],"authors":["Vishal Chawla","The Block"]}