{"summary":"When The Merge takes place, disgruntled miners are intending to fork the blockchain to keep it as it is. But it’s unlikely to work.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168007\/the-merge-a-look-at-the-miner-led-ethereum-fork-that-might-happen","publishDate":"2022-09-08T08:55:24","id":11649,"type":null,"title":"The Merge: A look at the miner-led Ethereum fork that might happen","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Next week, Ethereum will go through The Merge, an upgrade that changes its proof-of-work consensus mechanism to proof of stake, in order to help the network be more energy efficient.<\/span>","<span data-v-f87c67ca=\"\">The upgrade from proof of work to proof of stake is the result of years of development effort and has backing from the Ethereum community. <\/span><span data-v-f87c67ca=\"\">But even though there is broader enthusiasm for sunsetting the proof of work consensus, not everyone is happy with The Merge.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A group of Ethereum miners are planning to create a forked chain where miners can continue their operations. Miners will operate this chain separately from the proof-of-stake one. While an official announcement of the fork hasn’t happened yet, here are the key details of what might take place.<\/span>","<span data-v-f87c67ca=\"\">The discussion for this miner-led fork started in July with<\/span><a href=\"https:\/\/www.theblock.co\/post\/160462\/as-the-ethereum-merge-approaches-a-key-miner-is-pushing-a-proof-of-work-fork\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> Chandler Guo<\/span><\/a><span data-v-f87c67ca=\"\">, an influential Chinese miner, who proposed a hard fork the main Ethereum chain. “I fork Ethereum once, I will fork it again,” Guo <\/span><a href=\"https:\/\/twitter.com\/ChandlerGuo\/status\/1552384442580312071\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote <\/span><\/a><span data-v-f87c67ca=\"\">on Twitter. The fork, he claimed, would allow miners to continue operations even after Ethereum’s transition rather than be forced to move to other chains.<\/span>","<span data-v-f87c67ca=\"\">Reportedly, Guo and his supporters — who are largely <a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1564295584701612032\" data-v-f87c67ca=\"\">remaining anonymous<\/a> — have been working to carry out this fork of the Ethereum network. According to a <a href=\"https:\/\/medium.com\/@ETHW\/ethw-core-an-open-letter-to-the-ethereum-community-1-9-b8549b62e6e\" data-v-f87c67ca=\"\">blog post<\/a> by the ETHPoW team, this planned fork may happen within September, around the same time as The Merge.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Recently, the ETHPoW team stated how it has started to prepare for the fork. It has tweaked the Ethereum client software Geth to remove the \"difficulty bomb.\" This mechanism was designed by Ethereum core developers to make it much harder to mine blocks, preventing miners from interrupting The Merge.<\/span>","<span data-v-f87c67ca=\"\">In addition, the team has launched a testnet called <\/span><a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1563104108457779200\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Iceberg<\/span><\/a><span data-v-f87c67ca=\"\"> for testing the fork code. It has <\/span><span data-v-f87c67ca=\"\">created a chain ID and remote call procedure (RPC) servers for app frontends to function and connect to the blockchain. Finally, the team <a href=\"https:\/\/twitter.com\/EthereumPoW\/status\/1561815027169931266\" data-v-f87c67ca=\"\">claims<\/a> to have added replay protection, reducing the risk of transactions applying equally on both chains — something that would have been a big security risk.<\/span>","<span data-v-f87c67ca=\"\">With the coming fork, anyone who owns tokens on the Ethereum blockchain will have a version of ether tokens on both blockchains. That doesn't mean the tokens will have equal value — they may well be worthless on one of the chains. This will include NFTs.<\/span>","<span data-v-f87c67ca=\"\">The forked chain will contain all smart contracts copied from the mainnet at the time of the fork, which, in practice, may allow its developers to recreate Ethereum-based applications. But the fork won't bring along any of the developers that built these applications, nor will they be there to maintain them. This has raised concerns that any forks of Ethereum have low chances of success.<\/span>","<span data-v-f87c67ca=\"\">“If Ethereum forks (such as a proof of work chain splitting off), the “state” of Ethereum won’t transfer with it. Every stablecoin and DeFi application on the fork is likely to fail immediately,” Compound co-founder Robert Leshner <\/span><a href=\"https:\/\/twitter.com\/rleshner\/status\/1559727112319377408\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter.<\/span>","<span data-v-f87c67ca=\"\">Plus, many crypto projects won’t be backing the miner-led fork.<\/span>","<span data-v-f87c67ca=\"\">Stablecoin issuers — Tether, Circle, and Frax — have said they will not support ETHPoW. These firms stated that their stablecoins will neither be issued or redeemed on these chains. <\/span>","<span data-v-f87c67ca=\"\">Yet another <a href=\"https:\/\/www.theblock.co\/amp\/post\/166940\/opensea-commits-to-solely-supporting-nfts-on-proof-of-stake-ethereum-blockchain\" data-v-f87c67ca=\"\">announcement<\/a> came from OpenSea in which the NFT marketplace said did not <\/span><span data-v-f87c67ca=\"\">plan to accommodate the ETHPoW fork. It confirmed that NFTs on the chain will not be serviced on its platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A similar comment was made by Yuga Labs, the creator of Bored Apes Yacht Club NFT collection. The NFT creator clarified that it would not recognize copied versions of its NFTs on the ETHPoW fork.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"In line with the broader Ethereum community, in the event of a viable PoW fork, Yuga intends to only recognize NFTs on the PoS ETH chain as subject to the relevant NFT license and eligible for Yuga-offered utility,\" Yuga Labs <\/span><a href=\"https:\/\/twitter.com\/yugalabs\/status\/1560035176562016262\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">commented<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">As forked proof-of-work ETH comes into existence, its native asset will have to be freshly listed on crypto exchanges. Last month,&nbsp; Poloniex and MEXC <\/span><a href=\"https:\/\/www.theblock.co\/post\/162019\/three-crypto-exchanges-are-letting-traders-bet-on-tokens-for-anticipated-ethereum-fork\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">became<\/span><\/a><span data-v-f87c67ca=\"\"> the first spot exchanges to list ETHPoW in advance in the form of IOU tokens.<\/span>","<span data-v-f87c67ca=\"\">Currently, the IOU is trading <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/ethereum-pow\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">around $35<\/span><\/a><span data-v-f87c67ca=\"\">, a value that may radically differ from the actual spot price of the asset when it launches.&nbsp;<\/span><span data-v-f87c67ca=\"\">Over-the-counter trading firm Paradigm has <\/span><a href=\"https:\/\/www.paradigm.co\/blog\/ethereum-merge-crypto-derivatives?utm_campaign=q3_22_eth_merge&amp;utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">estimated<\/span><\/a><span data-v-f87c67ca=\"\"> the ETHPoW fork will trade at $18 or 1.2% of ETH’s market price after its launch. At this price, ETHPoW would amount to a market capitalization of $2.1 billion.<\/span>","<span data-v-f87c67ca=\"\">Other traders <\/span><a href=\"https:\/\/twitter.com\/bobbyong\/status\/1566616599674597376\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">have started<\/span><\/a><span data-v-f87c67ca=\"\"> borrowing ETH in the hope that they can repay it after the fork and sell any value of the forked ETH tokens — if there is any.<\/span>","<span data-v-f87c67ca=\"\">This has resulted, however, in lending protocols like Aave holding discussions to pause borrowing of ETH until after the fork —&nbsp;in order to dissuade this strategy. Per a community <\/span><a href=\"https:\/\/governance.aave.com\/t\/arc-aave-ethpow-fork-risk-mitigation-plan\/9438\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussion<\/span><\/a><span data-v-f87c67ca=\"\">, excessive borrowing could lead to an excessive utilization of ETH deposits, something that could impact the health of the protocol.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$35","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Yuga","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"},{"type":"1.2%","content":"PERCENT"},{"type":"$18","content":"MONEY"},{"type":"Guo","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Bored Apes Yacht Club NFT","content":"ORGANIZATION"},{"type":"Chandler Guo","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Robert Leshner","content":"PERSON"},{"type":"$2.1 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}