{"summary":"Documents filed in beleaguered crypto lender Celsius’ chapter 11 bankruptcy, which it declared late last night, have revealed a $1.2 billion hole in its balance sheet. ","author":["Lucy Harley-McKeown","Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157647\/celsius-bankruptcy-documents-claim-1-2-billion-balance-sheet-gap","publishDate":"2022-07-14T15:25:25","id":1165,"type":null,"title":"Celsius bankruptcy documents claim $1.2 billion balance sheet gap","category":["Lending"],"content":["Beleaguered crypto lender Celsius has claimed a $1.2 billion hole in its balance sheet, according to new documents filed as part of its newly declared <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Chapter 11 bankruptcy<\/a> in New York.","Chapter 11 bankruptcy allows a company to continue operations while meeting its obligations to indebted parties. This is usually executed by proposing a plan of reorganization to be approved by creditors and overseen by a legal team.","The documents, filed on Thursday by CEO Alex Mashinsky and the company's law firm Kirkland &amp; Ellis, show that the official committee of unsecured creditors likely includes \"mostly users.\" The firm reported $5.5 billion in total liabilities and $4.3 billion in assets.&nbsp;","The company said has worked to \"unwind\" most of its open loans and cease asset deployment services until further notice before commencing with the filing of Chapter 11. It chose to do this due to the volatility of the crypto market.&nbsp;","As of the petition date, the company has unwound nearly all of its DeFi loans and what it called \"the FTX loan,\" with only one loan remaining in an amount of approximately $3.2 million collateralized by $6.6 million in digital assets, it said.&nbsp;","As of July 10, the company held 410,421 staked ETH (stETH), and as a result, approximately $467 million of the Company’s ETH, based on the market value of ETH, is illiquid, but is earning an approximate 5% APY pending the Merge, it added.&nbsp;","The documents also state that on June 27, 2022, crypto hedge fund Three Arrows Capital (3AC) was ordered by a court in the British Virgin Islands to commence liquidation proceedings.","According to the filing, Celsius has a $40 million claim against 3AC, which, it said is \"significantly less than the amount some other companies in the industry, such as Voyager, BlockFi and <a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/blockchain.com\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/Blockchain.com\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Blockchain.com<\/a>, have against 3AC.\"","The company's CFO Rod Bolger, who joined in February, appears to have left. The filing lists Chris Ferraro as its new CFO. According to Ferraro's LinkedIn he joined Celsius in March following a sabbatical. He had previously completed a near 18-year stint at JP Morgan.","The filing confirms news of legal proceedings between StakeHound and custody tech service Fireblocks over lost keys to more than 38,000 Ethereum tokens, including 35,000 of Celsius' Ether.","Apart from its main business, Celsius also mines bitcoin through its subsidiary Celsius Mining, which took out up to $750 million in intercompany credit from Celsius. As of May 31, the outstanding balance on that loan was $576 million.","According to the document, Celsius believes that the mining operations will generate enough assets to pay off the loan and “provide revenue for the company in the future.” Celsius owns $720 million in “mining assets,” according to the document.","That side of the business is producing 14.2 BTC a day, which translates to around $292,520 based on bitcoin’s current price of around $20,600, according to TradingView.","Founded in 2017 by Alex Mashinsky and Daniel Leon, Celsius offered retail investors attractive returns on their crypto holdings under the slogan \"unbank yourself.\" The company, which moved its headquarters from London to New Jersey last year, had grown to manage more than $10 billion in assets and claimed more than 1.7 million users.&nbsp;","But this year's crypto market slide left Celsius insolvent, and on June 12 it&nbsp;<a href=\"https:\/\/www.theblock.co\/linked\/151522\/crypto-lending-firm-celsius-pauses-withdrawals-and-transfers-citing-market-conditions\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">froze<\/a>&nbsp;client withdrawals, transfers and swaps.","As The Block&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/154368\/celsius-seeks-show-of-client-support-as-lawyers-push-for-chapter-11-bankruptcy\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a>&nbsp;last month, Celsius's lawyers had been pushing for it to enter Chapter 11 bankruptcy for a while — while the company's executives attempted to avoid it at all costs. The firm had instead sought a show of support from app users to help win the internal argument.","Amid the tension, the Wall Street Journal&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/156805\/celsius-hires-new-restructuring-lawyers-to-help-navigate-its-options-wsj\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a>&nbsp;this week that Celsius had replaced its legal advisers.&nbsp;","Since halting withdrawals in June, Celsius's woes have mounted — with state regulators in the US&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/157252\/vermont-regulator-joins-multistate-investigation-into-celsius\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reportedly<\/a>&nbsp;lining up to investigate its business practices.","This week, the Vermont Department of Financial Regulation said Celsius's representations about the safety of customer funds were \"untrue” and accused the company of engaging in an “unregistered securities offering” by offering cryptocurrency interest accounts to retail investors.&nbsp;","The state of Celsius's finances has scared off potential saviors. The Block&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/155069\/ftx-walked-away-from-celsius-deal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a> last month that crypto exchange giant FTX looked at making a deal with the troubled firm but ultimately walked away after finding a $2 billion hole in its balance sheet."],"hashtag":[]}