{"summary":"Bitcoin&#x27;s drop below the $43,000 mark comes as BTC faces downside pressure from miners selling their reserves on the market, analysts said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276201\/bitcoins-price-decline-has-been-exacerbated-by-miners-selling-reserves-ahead-of-halving-bitfinex-says","publishDate":"2024-02-06T09:31:54","id":11650,"type":null,"title":"Bitcoin&#x27;s price decline has been exacerbated by miners selling reserves ahead of halving, Bitfinex says","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.26%\n    <\/span><\/a> <!----><\/span><\/span>'s price has pulled back below the $43,000 mark, as the digital asset faces downside pressure from miners selling their reserves on the market.<\/span>","\"Much of the recent price falls in bitcoin, particularly following the approval of spot bitcoin ETFs by the SEC, can be attributed to selling by bitcoin miners, who used the run up in BTC as a catalyst to exit, or leverage, their positions,\" Bitfinex analysts said in a <a href=\"https:\/\/blog.bitfinex.com\/wp-content\/uploads\/2024\/02\/Bitfinex-Alpha-90.pdf\" data-v-f87c67ca=\"\">report<\/a> on Tuesday.","The report noted that <a href=\"https:\/\/www.theblock.co\/post\/266512\/why-bitcoin-miners-are-unlikely-to-fight-a-moral-battle-over-ordinals\" data-v-f87c67ca=\"\">miners<\/a> have been motivated to sell in preparation for this year’s upcoming <a href=\"https:\/\/www.theblock.co\/post\/272350\/bitcoin-halving-now-just-100-days-away\" data-v-f87c67ca=\"\">halving<\/a>, which will see their bitcoin rewards reduce and hence their business profitability decline.","\"Selling now provides the capital for miners to upgrade infrastructure and is a reminder of the significant influence on market liquidity and price discovery that miners have,\" the Bitfinex analysts added.","According to the report, miner reserves of bitcoin dropped significantly shortly after <a href=\"https:\/\/www.theblock.co\/post\/275735\/blackrock-spot-bitcoin-etf-gbtc-daily-volume\" data-v-f87c67ca=\"\">spot bitcoin ETF<\/a> approvals. \"Last week saw the largest outflows from miner wallets ever recorded, and more selling could be imminent,\" the report added.","The next bitcoin halving will likely occur in April of this year, and the event will reduce the reward that miners receive for validating and adding new blocks to the blockchain by 50%.","The halving occurs approximately every four years, or after every 210,000 blocks are mined. The last halving occurred in 2020, when the block reward was reduced from 12.5 bitcoin to 6.25 bitcoin.","The next halving will occur after the mining of approximately 840,000 blocks, leading to a further reduction in the block reward, from the current 6.25 BTC to 3.125 BTC per block. This mechanism is programmed into the bitcoin protocol and is intended to control the supply of new bitcoins, making it more scarce over time.","The world's largest cryptocurrency by market capitalization decreased by over 1% in the past 24 hours to $42,920 at 8:34 a.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.","<span data-v-f87c67ca=\"\">The price of bitcoin fell on Tuesday by over 1%. Image: The Block.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Last week","content":"DATE"},{"type":"$43,000","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"+0.26%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"8:34 a.m. ET","content":"TIME"},{"type":"1%","content":"PERCENT"},{"type":"$42,920","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":["BITCOIN","CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}