{"summary":"ECB board member Fabio Panetta addressed Columbia University today about &quot;the Wild West of crypto finance&quot; and the need for global coordination.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143308\/ecb-member-calls-for-tougher-coordinated-global-regulation-for-crypto","publishDate":"2022-04-25T11:54:51","id":11656,"type":null,"title":"ECB board member calls for tougher, coordinated global regulation for crypto","category":["REGULATION"],"content":["A board member of the European Central Bank is advocating crypto regulation be aligned across the world to mitigate a potentially massive collapse.&nbsp;&nbsp;","Executive Board Member Fabio Panetta addressed Columbia University today about \"the Wild West of crypto finance.\" <a href=\"https:\/\/www.ecb.europa.eu\/press\/key\/date\/2022\/html\/ecb.sp220425~6436006db0.en.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">In his remarks<\/a>, he said crypto requires a heavier regulatory burden since it has yet to deliver on its promised philosophy of truly decentralized, trustworthy money.","\"Crypto-assets are bringing about instability and insecurity – the exact opposite of what they promised,\" he said. \"They are creating a new Wild West.\"","That means unifying standards between crypto and the traditional finance sector, and in some cases, setting the bar even higher for crypto.","At $1.3 trillion, the crypto market is now larger than the sub-prime mortgage market was at the time of its collapse, and according to Panetta, they share \"strikingly similar dynamics.\"","For that reason, regulators must respond now, he said, especially considering the growth of a number of \"unbacked\" sectors of crypto, like some decentralized finance assets.","\"This strong appeal of crypto-assets, especially unbacked ones, is a cause for concern given the lack of fundamentals, the number of recent scandals, their use in illegal activities and the high volatility of their prices,\" he said. \"All this points to unsound underlying market dynamics.\"","Panetta also cited energy and environmental concerns over proof-of-work mining as well as crypto's potential use as a tax evasion and sanctions evasion tool.","\"So crypto-assets are speculative assets that can cause major damage to society,\" he said. \"At present they derive their value mainly from greed, they rely on the greed of others and the hope that the scheme continues unhindered. Until this house of cards collapses, leaving people buried under their losses.\"","For the most part, this means holding crypto-assets to traditional financial system standards. That includes implementing Financial Action Task Force (FATF) <a href=\"https:\/\/www.theblockcrypto.com\/post\/122372\/fatf-final-crypto-guidance-defi-nft\" data-v-f87c67ca=\"\">standards<\/a>, aligning tax reporting for crypto with the wider financial system and perhaps implementing higher taxes for crypto activities seen as potentially harmful for the environment, like proof of work.","Panetta also advocated for additional mandatory disclosure and transparency requirements for crypto firms and the strengthening of public authorities to detect illicit trades and emerging threats.","He pointed out that the growth of the crypto sector shows a wider hunger for better financial infrastructure, and central banks must respond with faster retail payment systems and the issuance of central bank digital currencies.","Panetta touted the work of the EU on its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/142220\/european-commission-receives-more-than-10000-public-comments-amid-digital-euro-consultation\" data-v-f87c67ca=\"\">digital euro<\/a> and the European Commission's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137720\/europes-landmark-crypto-bill-passes-parliamentary-committee-with-wide-majority\" data-v-f87c67ca=\"\">Regulation of Markets in Crypto-Assets<\/a>, which recently passed through its parliamentary committee. The crypto framework would unify standards for crypto firms in the EU. But Panetta hopes to go further:","\"We need to focus more on unbacked crypto-asset activities that are undertaken without service providers. In addition, we cannot afford to leave on-chain peer-to-peer payments unregulated, as they can be used to circumvent any regulation. Finally, if we really want to harmonise supervision significantly across all EU Member States, the new European AML Authority should supervise the riskiest crypto-asset providers.\"","But those standards will only be effective if they are \"matched by ambitious measures implemented by our international peers,\" said Panetta.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fabio Panetta","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Columbia University","content":"ORGANIZATION"},{"type":"AML Authority","content":"ORGANIZATION"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"Panetta","content":"PERSON"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"Panetta","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Financial Action Task Force","content":"ORGANIZATION"}],"hashtag":["CRYPTO","ECB","EUROPEAN COMMISSION"],"authors":["Aislinn Keely","The Block"]}