{"summary":"Revolut, the $5.5bn neo-bank, is set to lose a handful of veteran department heads who have been with the startup since its early days.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97309\/neo-bank-revolut-loses-four-department-leads","publishDate":"2021-03-05T08:22:28","id":11664,"type":null,"title":"Neo-bank Revolut loses four department leads","category":["FINTECH"],"content":["Revolut, the unicorn neo-bank, is set to lose a handful of veteran department heads who have been with the financial technology startup since its early days.","Among those departing is Chad West, Revolut’s outspoken director of global marketing and communications since April 2017. West told The Block he will be joining a new startup in a couple of months, but declined to say which.","“Super hard decision to leave, but it’s time for a new challenge, and a trip back to my startup roots!” he added.","Vaidas Adomauskas, head of Revolut’s business product, and head of support Inna Grynova have also left the company. Irina Nicoleta Scarlat, global head of growth, is set to leave. Scarlat and Grynova had been at the firm for three years and three and a half years, respectively.","Revolut is currently in the process of “rebasing” some roles within the company, which involves filling certain positions with experienced, external candidates and effectively downgrading existing staff. But a person close to the company said the four departures are natural moves and stressed that they are not related to the rebasing process.","In <a href=\"https:\/\/irinascarlat-com.cdn.ampproject.org\/c\/s\/irinascarlat.com\/revolut-journey\/amp\/\" data-v-f87c67ca=\"\">a blog post<\/a> on her departure, published March 5, Scarlat said she would be taking a sabbatical of at least three months after working relentlessly over the past few years – including up until the moment she gave birth to a son, and shortly afterwards.","“Saying that my Revolut experience has been rewarding would be an understatement. I feel incredibly lucky to have been part of Revolut’s growth journey,” she wrote.","“However, three years on the rocketship feel like dog years in normal time. This is the true reason why the median tenure in a tech startup is two years. I feel like I’ve run a marathon with the speed of a sprint. I know way too well what this means and I’ve learnt to listen to the signals that I receive from my body and mind.”","Scarlat, who began her tenure at Revolut as country manager for Romania, oversaw a period of rapid growth for the London-based company. Revolut recently surpassed 15 million users globally, up from around 1 million when she joined, according to the website. It has a staff of more than 2,000 people, with <a href=\"https:\/\/www.revolut.com\/en-US\/careers\" data-v-f87c67ca=\"\">another 500 open roles<\/a> on its careers portal.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Irina Nicoleta Scarlat","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"three years and three and a half years","content":"DATE"},{"type":"Romania","content":"LOCATION"},{"type":"Inna Grynova","content":"PERSON"},{"type":"Scarlat","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"sprint","content":"ORGANIZATION"},{"type":"April 2017","content":"DATE"},{"type":"March 5","content":"DATE"},{"type":"Grynova","content":"PERSON"},{"type":"Chad West","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}