{"summary":"A crypto course founder targeted his students to get them to invest in his crypto hedge fund, which turned out to be a scheme, the SEC said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275823\/sec-charges-founder-of-online-crypto-course-who-targeted-students-to-invest-in-nonexistent-hedge-fund","publishDate":"2024-02-02T14:28:29","id":1166,"type":null,"title":"SEC charges founder of online crypto course who targeted students to invest in nonexistent hedge fund","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The founder of an online crypto course targeted his students to get them to invest in a crypto hedge fund he said would use artificial intelligence to generate returns, according to charges brought by the Securities and Exchange Commission.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The founder, who had held onto investors' money in bitcoin, subsequently lost those funds after his digital wallet was hacked, the SEC said in a statement on Friday. The agency charged American Bitcoin Academy founder Brian Sewell, 51, and his firm Rockwell Capital Management with fraud, resulting in a settlement without either admitting or denying the charges.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sewell encouraged his students to invest in the Rockwell Fund, the hedge fund he said would use AI and crypto related trading strategies to generate returns. Sewell received about $1.2 million from 15 students but never ended up launching the fund.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Among other things, he falsely claimed that his investment strategies would be guided by his own ‘artificial intelligence’ and ‘machine learning’ technology which, like the fund itself, never existed,” said Gurbir S. Grewal, director of the SEC’s Division of Enforcement, in a statement.&nbsp; “Whether it’s AI, crypto, DeFi or some other buzzword, the SEC will continue to hold accountable those who claim to use attention-grabbing technologies to attract and defraud investors.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rockwell Capital Management will pay $1.6 million and Sewell will pay $223,229 to settle the SEC's charges, according to the agency's statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC said Sewell emailed students a 16-slide investor pitch deck, which the SEC said had many misrepresentations and omissions about the fund.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In that pitch deck, Sewell said he had earned degrees in data science at John Hopkins University and Stanford University, which the SEC said was false.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sewell also told investors that he had managed a crypto hedge fund before, and had turned $250,000 into $9 million.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Sewell’s representations were false. As Sewell well knew, he had no prior experience managing a hedge fund,\" the SEC said in its complaint.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"American Bitcoin Academy","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$1.6 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$223,229","content":"MONEY"},{"type":"Sewell","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1.2 million","content":"MONEY"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Rockwell Capital Management","content":"ORGANIZATION"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"$9 million","content":"MONEY"},{"type":"Brian Sewell","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"},{"type":"John Hopkins University","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}