{"summary":"Cega raised $5 million in a seed extension round led by Dragonfly Capital. The Solana-based derivatives protocol focused on exotic options is set to launch on Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222998\/solana-derivatives-protocol-cega","publishDate":"2023-03-27T12:00:25","id":11668,"type":null,"title":"Solana-based derivatives protocol Cega raises $5 million to expand on Ethereum","category":["DEALS"],"content":["Cega, a DeFi derivatives protocol focused on exotic options, raised $5 million in a new funding round led by&nbsp;Dragonfly Capital that also saw participation from Pantera Capital and Robot Ventures.","The seed extension round was realized via a Simple Agreement for Future Equity plus token side letter, Cega co-founder and CEO Arisa Toyosaki said in an interview. She declined to comment on the valuation but said it was an up round, meaning it was more than Cega's last valuation of $60 million.","The latest round brings Cega's total funding to date to $9.3 million. It raised $4.3 million last March.","Cega is a&nbsp;<a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/solana\" data-v-f87c67ca=\"\">Solana<\/a>-based derivatives protocol focused on exotic options structured products. While regular options allow users to buy or sell an underlying asset at a specific price and time, exotic options, on the other hand, are more customized and have additional conditions attached to them.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nToyosaki said Cega's exotic options are carefully designed that help traders earn \"safer yields in volatile market environments.\" The company offers principal protection against severe market movements of up to a 90%, she added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"A very popular strategy on Cega is you are betting that in the next 27 days that neither bitcoin nor ether will fall more than 50%. And if you are right, which like 90% of the time you are, you would be able to get 12% APY,\" Toyosaki said.","Cega's protocol went live last June and has seen a peak total value locked of around $50 million, Toyosaki said, adding that the collapse of the FTX exchange saw massive withdrawals. Cega's current <a href=\"https:\/\/app.cega.fi\/\" data-v-f87c67ca=\"\">TVL<\/a> stands at $6.3 million, according to its website.","The main reason for the fundraise was to expand its protocol on&nbsp;<a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\" data-v-f87c67ca=\"\">Ethereum<\/a>, Toyosaki said, adding it will launch new products there including leveraged options. The launch on Ethereum is scheduled for next week.","As part of the expansion, Cega will keep its Solana-based products in \"maintenance mode,\" meaning its existing products will continue to be available on Solana. The availability of new products on Solana, however, will depend on factors including volume.&nbsp;","Cega will also launch a new market-making entity called&nbsp;<a href=\"https:\/\/www.trasmobian.xyz\/\" data-v-f87c67ca=\"\">Tras Mobian<\/a>&nbsp;next week that will focus on both vanilla and exotic crypto derivatives.","\"The new, separate entity is so far funded by proprietary trades as I had quite a successful last year,\" Toyosaki said. Cega currently employs 15 people, and the new entity has already hired a small team, she added.","Given its expertise in exotic options, Cega also plans to launch white-label services in the future to develop strategies for other centralized and decentralized platforms, said Toyosaki.","Cega also has plans to launch a token in the future, Toyosaki said, declining to comment on the timeline.","\"We do look to compensate early users,\" she said, adding that&nbsp;Cega also plans to support other blockchains, especially DeFi-native chains.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Arisa Toyosaki","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Simple Agreement for Future Equity","content":"ORGANIZATION"},{"type":"$4.3 million","content":"MONEY"},{"type":"12%","content":"PERCENT"},{"type":"$6.3 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Pantera Capital and Robot Ventures","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Cega","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$60 million","content":"MONEY"},{"type":"Toyosaki","content":"PERSON"},{"type":"$9.3 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DEXS","SEED &AMP; PRE-SEED","SMART CONTRACTS"],"authors":["Yogita Khatri","The Block"]}