{"summary":"Bitcoin miner Marathon reported a net loss of $191.6 million in the second quarter of 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162165\/bitcoin-miner-marathon-reports-second-quarter-net-loss-of-191-6-million","publishDate":"2022-08-08T16:35:35","id":11666,"type":null,"title":"Energy, weather problems helped push bitcoin miner Marathon to $191.6 million net loss","category":["MINING"],"content":["Bitcoin miner Marathon saw a net loss of $191.6 million in the second quarter of 2022, a significant jump from a $13 million net loss in the first quarter. Revenues fell 51.8% to $24.9 million.","The company reported that it \"finally\" got the green light to energize miners hosted with Compute North in West Texas, its CEO Fred Thiel said on Monday.","\"Energization delays, maintenance and weather issues in Montana, and an approximately 56% decline in the price of bitcoin during the quarter, severely impacted our bitcoin production and financial results,\" Thiel said in a statement.","Marathon produced 707 bitcoin between April and June, representing a 44% decrease from the first quarter of 2022. The bitcoin mining company was affected by a storm that hit Hardin, Montana in early June and <a href=\"https:\/\/www.theblock.co\/post\/154660\/montana-storm-knocks-75-of-marathons-active-crypto-mining-fleet-offline\" data-v-f87c67ca=\"\">knocked 75% of its mining fleet offline<\/a>. It also recorded an impairment charge of $127.6 million.","Thiel stressed that Marathon had to contend with some unique challenges in the second quarter (energy delays in Texas and downtime in Montana) on top of the macro environment that has shrunk margins for miners — increased energy prices and a decline in bitcoin's value. The company estimated that it mined 45% less bitcoin in the second quarter due to the effects of the storm in Montana.","Deploying miners at the Compute North facility will be a \"complex process that will occur in stages\" of 20 megawatts, Thiel said on the company's earnings call. At this point, about 9,700 miners have gone online and the company expects to deploy all 68,000 rigs (representing 6.8 EH\/s) at the 280-megawatt bitcoin mining facility by the end of the third quarter of this year.","Marathon renegotiated its hosting agreement with Compute North so that it could participate in curtailment programs with Electric Reliability Council of Texas (ERCOT). \"Some of our peers in the industry have recently demonstrated there are times when it can be more profitable to sell electricity back to the grid than it is to mine Bitcoin,\" Thiel said.","Bitcoin miner Riot announced last week that it got <a href=\"https:\/\/www.theblock.co\/post\/161226\/riot-mined-28-less-bitcoin-in-july-and-earned-9-5-million-in-power-credits\" data-v-f87c67ca=\"\">$9.5 million in power credits in July<\/a> from cutting power by 11,717 megawatt-hours. That value was higher than what it could have generated in mining revenues, the company's CEO said.","As of July 31, Marathon held 10,127 BTC (with a market value of $236.3 million). It recently <a href=\"https:\/\/www.theblock.co\/post\/160884\/bitcoin-miner-marathon-secures-additional-100-million-loan\" data-v-f87c67ca=\"\">secured a $100 million bitcoin-backed loan<\/a> with Silvergate Bank and refinanced a previous $100 million loan with the same firm.","The company said it's still on target to hit 23.3 EH\/s in capacity by 2023. However, it is upgrading some of its mining fleet so that 66% percent of that hash rate come from S19 XP rigs, which are 30% more efficient. \"By converting to these machines, we are decreasing our electricity cost on a per terahash basis,\" Thiel said.","The miner <a href=\"https:\/\/www.theblock.co\/post\/158342\/bitcoin-miner-marathon-secures-new-200-megawatt-hosting-deal\" data-v-f87c67ca=\"\">closed a deal last month with hosting provider Applied Blockchain<\/a> that will secure the company additional energy capacity of at least 200 megawatts, with the option to increase it to 270 megawatts.","<em data-v-f87c67ca=\"\">This story has been updated with company comments after the second-quarter earnings call.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$191.6 million","content":"MONEY"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"West Texas","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"$13 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"56%","content":"PERCENT"},{"type":"44%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"Thiel","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"quarter","content":"DATE"},{"type":"51.8%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Montana","content":"LOCATION"},{"type":"$127.6 million","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"Compute North","content":"ORGANIZATION"},{"type":"July 31","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"second quarter of 2022","content":"DATE"},{"type":"Fred Thiel","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"first quarter of 2022","content":"DATE"},{"type":"$9.5 million","content":"MONEY"},{"type":"Texas","content":"LOCATION"},{"type":"first quarter","content":"DATE"},{"type":"66% percent","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"Hardin","content":"PERSON"},{"type":"\" Thiel","content":"ORGANIZATION"},{"type":"$24.9 million","content":"MONEY"},{"type":"$236.3 million","content":"MONEY"},{"type":"Electric Reliability Council of Texas (ERCOT)","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["EARNINGS"],"authors":["Catarina Moura","The Block"]}