{"summary":"Tron commits to weekly infusions to facilitate one to one withdrawals for TRX, BTT, JST, SUN, and HT tokens on sinking FTX exchange.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185498\/tron-ftx-broker-deal-for-customers-to-withdraw-certain-tokens","publishDate":"2022-11-10T13:33:53","id":11682,"type":null,"title":"Tron, FTX broker deal for customers to withdraw certain tokens","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Troubled crypto exchange FTX will allow customers to withdraw TRX, BTT, JST, SUN, and HT tokens to external wallets on a 1:1 ratio, after it announced weekly capital infusions in an agreement with Tron.<\/span>","A deal brokered between Tron and FTX will soon facilitate withdrawals on the struggling exchange.","On FTX, 1:1 withdrawals for digital assets including TRX, BTT, JST, SUN, and HT tokens will be enabled for external wallets following an agreement with Tron, FTX&nbsp;<a class=\"c-link\" href=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/10739365280276-FTX-Announcement-Regarding-the-Tron-Credit-Facility\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/help.ftx.com\/hc\/en-us\/articles\/10739365280276-FTX-Announcement-Regarding-the-Tron-Credit-Facility\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">announced<\/a>.","<span data-v-f87c67ca=\"\">The deal is expected to go live at <\/span><span data-v-f87c67ca=\"\">18:30 UTC (1:30 p.m. EST) FTX said, and deposits will depend on factors including withdrawal demand and Tron’s funding capacity. Exact figures for future capital infusions will be determined on a weekly basis, and each week such injections are to occur at 14:00 UTC (9:00 a.m. EST).<\/span>","<span data-v-f87c67ca=\"\">FTX said it would disable Tron deposits for all users for the duration of the injections, constraining future deposits of the tokens to the Tron team itself.<\/span>","<span data-v-f87c67ca=\"\">“By providing a set schedule of the amount of tokens to be introduced into the market and the corresponding time, our goal is to provide more clarity to the market allowing users to make better informed decisions,” said FTX, adding that the enabled markets “may experience high levels of volatility.”<\/span>","<span data-v-f87c67ca=\"\">FTX asked users to ensure they understand the arrangement with Tron and ramifications of any associated risks before they trade.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-total-marketcap\/embed\" title=\"Crypto Total Marketcap\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The collapse of FTX shocked crypto markets, following news that Binance would back out of a deal to save the sinking exchange, as the total crypto market cap dipped below $1 trillion, data from The Block Research show.","<span data-v-f87c67ca=\"\">FTX faces likely bankruptcy if it cannot fill an $8 billion hole.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1:30 p.m. EST","content":"TIME"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"9:00 a.m. EST","content":"TIME"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$1 trillion","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["FTX"],"authors":["Jeremy Nation","The Block"]}