{"summary":"The Starknet Foundation revealed a distribution plan for its native token — with nearly 1.3 million wallets eligible for rewards.\nThis includes early users of ecosystem dapps, network contributors, Ethereum builders and open-source developers from outside web3.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277379\/starknet-strk-token-distribution-plan","publishDate":"2024-02-14T02:57:02","id":1168,"type":null,"title":"Starknet unveils STRK token distribution plan to nearly 1.3 million wallets","category":["Layer 2s and Scaling"],"content":["The Starknet Foundation has unveiled its native token distribution plan, with nearly 1.3 million wallets eligible for a reward — including early users of ecosystem dapps, network contributors, and others. The foundation’s provisions unit will publish its official outline of the STRK allocation today and allow users to check if they qualify for distribution.","Starknet is an Ethereum Layer-2 network that leverages a ZK-Rollup solution for scaling decentralized applications. The token will help decentralize and govern the network, according to a statememt.","“The STRK Token was born so that STARK-based scaling can happen in a more decentralized way. The token design helps Starknet to be run and managed by the community, and Provisions is a powerful means to achieve this,” said Diego Oliva, CEO of Starknet Foundation.","On February 20, the distribution will allow some 1.297 million wallets to claim the <a href=\"https:\/\/www.theblock.co\/post\/270922\/starknet-approves-vote-to-add-ability-to-use-strk-token-for-paying-transaction-fees\" data-v-f87c67ca=\"\">STRK token<\/a>. They will have four months — until June 20 — to claim. The total distribution includes more than 700 million STRK tokens — or 7% of the total supply of 10 billion tokens.","“Members of the community have been battle testing STARK-based technology since StarkEx went live in 2020, and we’re glad that many of those who interacted with StarkEx-powered dApps like dYdX, ImmutableX, Rhinofi, and Sorare are being recognized today,” said core contributor Eli Ben-Sasson, the cryptographer who co-invented the tech behind Starknet.","Besides early users of Starknet and StarkEx, Ethereum contributors — including members of the Protocol Guild, EIP authors, and solo stakers — and open-source developers from outside web3 are eligible to claim the token.","Overall, more than half a million Starknet wallets and over 600,000 StarkEx ones are eligible. Additionally, 137,000 open-source developers and 19,000 ETH stakers also made the cut, according to eligibility data shared with The Block.","The criteria for user eligibility for the distribution were based on a November snapshot that looked at the amount of transactions and how often users interacted with the network. The criteria included $100 in cumulative value transacted, over five transactions, and activity in separate time intervals, although these are separate conditions.","Provisions that oversaw the token distribution plan is one of the many community initiatives by Starknet contributors. Others include the <a href=\"https:\/\/www.theblock.co\/post\/267180\/starknet-fees-devonomics\" data-v-f87c67ca=\"\">devonomics<\/a> program launched in December and upcoming <a href=\"https:\/\/www.theblock.co\/post\/266724\/starknet-foundation-plans-to-distribute-1-8-billion-tokens-as-rewards-transaction-rebates\" data-v-f87c67ca=\"\">rebates<\/a> and subsidies to incentivize ecosystem activity."],"hashtag":["STARKNET"]}