{"summary":"The U.S. Treasury Department published an illicit finance risk assessment report focused specifically on DeFi. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225237\/defi-risk-assessment","publishDate":"2023-04-06T10:54:53","id":11686,"type":null,"title":"U.S. Treasury publishes DeFi-focused illicit finance risk assessment","category":["POLICY"],"content":["The U.S. Treasury Department on Thursday published its first illicit finance risk assessment report focused specifically on <a href=\"https:\/\/www.theblock.co\/post\/224699\/defi-dominance-bitcoin-xrp\" data-v-f87c67ca=\"\">decentralized finance<\/a>, or DeFi.&nbsp;","<a href=\"https:\/\/home.treasury.gov\/system\/files\/136\/DeFi-Risk-Full-Review.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The 42-page report<\/a> states that \"actors like the Democratic People’s Republic of Korea (DPRK), cybercriminals, ransomware attackers, thieves, and scammers are using DeFi services to transfer and launder their illicit proceeds\" and notably contends that DeFi services that would be subject to the Bank Secrecy Act \"fail to comply with AML\/CFT obligations, a vulnerability that illicit actors exploit.\"","The report goes on to state:","\"A lack of a common understanding among industry participants of how AML\/CFT obligations may apply to DeFi services exacerbates this risk. In some cases, industry providers may purposefully seek to decentralize a virtual asset service in an attempt to avoid triggering AML\/CFT obligations, without recognizing that the obligations still apply so long as the provider continues to offer covered services.\"","At the same time, the authors acknowledge that illicit finance via DeFi and crypto remains small in comparison to activities conducted with government-issued or fiat currency.","As the report notes: \"Still, as previously noted in the 2022 NRAs, this risk assessment recognizes that most money laundering, terrorist financing, and proliferation financing by volume and value of transactions occurs in fiat currency or otherwise outside the virtual asset ecosystem via more traditional methods.\"","While the Treasury acknowledges the development of industry services like blockchain analytics, the report's authors argue that they \"do not sufficiently address the identified vulnerabilities on their own.\"","\"[T]he U.S. government should also seek to further promote the responsible innovation of compliance tools for the industry, an avenue many in the private sector are already pursuing,\" the authors note.&nbsp;","A Treasury official had previously teased the report's release last month, as <a href=\"https:\/\/www.coindesk.com\/policy\/2023\/03\/14\/us-treasury-poised-to-release-view-on-how-defi-used-in-illicit-finance\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CoinDesk<\/a> reported at the time.&nbsp;","<em data-v-f87c67ca=\"\">Updated with additional information.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"DPRK","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"CFT","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}