{"summary":"Crypto traders beware: a leaked draft of the European Commission&#x27;s new taxation directive seeks to close the &quot;regulatory gap&quot; over taxation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192150\/eu-crypto-taxation-leaked-proposal","publishDate":"2022-12-06T07:16:47","id":11697,"type":null,"title":"Crypto taxes could bring in $2.5 billion for the EU, leaked draft suggests","category":["POLICY"],"content":["Crypto traders beware: the European Union may have a tax surprise in store.","<span data-v-f87c67ca=\"\">A European Commission proposal for taxing crypto estimates that taxes on crypto assets could raise as much as €2.4 billion ($2.5 billion), <\/span><span data-v-f87c67ca=\"\">a leaked draft obtained by The Block suggests. <\/span><span data-v-f87c67ca=\"\">The proposal, which is scheduled for adoption in the Commission this week, claims to close the “regulatory gap” and remove tax evasion opportunities for crypto investors as well as ensure member states avoid a tax shortfall.<\/span>","<span data-v-f87c67ca=\"\">Crypto service providers in the EU will need to report to national tax authorities, according to the draft, which<\/span><span data-v-f87c67ca=\"\"> defines crypto assets as those “issued in a decentralized manner, as well as stablecoins, and certain non-fungible tokens.” For rules to apply, a crypto asset must be used as means of payment or investment, with possible exceptions for “a limited network and certain utility tokens.”<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for the European Commission said they couldn't confirm or deny any details in the document.<\/span>","Defining the taxable event in crypto markets is likely to remain a challenge as negotiations on the proposal develop in the EU institutions. But by targeting service providers in the directive, authorities will have easier access to the necessary information from crypto users as the Commission looks to minimize the “administrative burden” for the industry.&nbsp;","As the proposal is a directive in contrast to a regulation — as is the case for matters of taxation in the EU — member states will have the freedom to decide how to implement the provisions. It also aligns with internationally recognized standards for reporting on crypto taxation as <a href=\"https:\/\/www.theblock.co\/post\/175953\/oecd-releases-final-plan-to-crack-down-on-international-tax-evasion-using-crypto\" data-v-f87c67ca=\"\">defined<\/a> in the Organization for Economic Co-operation and Development report published in October.","<span data-v-f87c67ca=\"\">An older version of the document obtained by The Block shows that the directive would have applied to both centralized and decentralized platforms. However the latest version removes this distinction, stating that the rules apply to regulated crypto-assets service providers.<\/span>","This draft proposal sweeps crypto assets into the EU's series of Directives on Administrative Co-operation, which outlines how member states need to report certain information for taxation purposes. Since direct taxation policy is not harmonized across the bloc, the tax reporting directives make sure that citizens don't evade taxation in other countries.","The document indicates that the some rules would start applying as early as 2025, with most coming into force in 2026.","<em data-v-f87c67ca=\"\">Benjamin Robertson contributed reporting for this story.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"Benjamin Robertson","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Organization for Economic Co-operation and Development","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"EU","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["EUROPEAN COMMISSION","EUROZONE REGULATION"],"authors":["Inbar Preiss","The Block"]}