{"summary":"Blockchain analytics firm Elliptic has added support for privacy coins Zcash (ZEC) and Horizen (ZEN). The move will allow Elliptic’s clients to monitor “unshielded” transactions in the two privacy coins in order to detect and prevent any illicit activity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/69961\/elliptic-adds-support-for-privacy-coins-zcash-and-horizen-to-its-blockchain-monitoring-platform","publishDate":"2020-06-30T09:01:11","id":11690,"type":null,"title":"Elliptic adds support for privacy coins Zcash and Horizen to its platform","category":["LAYER 1S"],"content":["Blockchain analytics firm Elliptic has added support for privacy coins Zcash (ZEC) and Horizen (ZEN).","The <a href=\"https:\/\/www.elliptic.co\/our-thinking\/achieving-aml-and-sanctions-compliance-with-privacy-coins\" data-v-f87c67ca=\"\">move<\/a> will allow Elliptic’s clients to monitor “unshielded” transactions in the two privacy coins in order to detect and prevent any illicit activity, and therefore, meet their anti-money laundering and compliance obligations.","Elliptic co-founder and chief scientist Tom Robinson told The Block that the firm is focused on tracking privacy coin transactions and addresses that are visible on blockchains. “We are not seeking to defeat the privacy-enhancing functionality that these assets offer...This means that we have no plans to provide our capabilities on the likes of monero [XMR], where all transactions are private by default,” said Robinson.","Some crypto transactions cannot be traced on a blockchain — be it bitcoin transactions from a mixer or any monero transaction, said Robinson. Coins like ZEC and ZEN have opt-in privacy features.&nbsp;","When asked why Elliptic added support for ZEN since volumes are low in that counter, Robinson said both Zcash and ZEN are built on the Bitcoin architecture, which made the process easier.","The support for ZEC and ZEN has been added to Elliptic Navigator, the firm’s transaction screening tool, and Elliptic Lens, its wallet screening tool, Robinson told The Block. Crypto trading and lending platform Genesis will be an immediate user of the new program, said Elliptic.","The firm's support of privacy coins comes within days of a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/67653\/chainalysis-zcash-dash-compliance\" data-v-f87c67ca=\"\">similar move<\/a> by rival Chainalysis, which added support for Zcash and Dash. Robinson told The Block that rival products that offer Zcash support have focused on providing \"manual investigations capabilities,” whereas Elliptic’s products are designed to “help automate the compliance process and help crypto businesses save time and money.”","Privacy coins have been under regulatory scrutiny lately and several exchanges <a href=\"https:\/\/www.theblockcrypto.com\/post\/39724\/okex-korea-delisting-all-privacy-coins-including-monero-zcash-and-dash-as-these-violate-fatfs-travel-rule\" data-v-f87c67ca=\"\">moved to delist them<\/a>, including OKEx Korea, Upbit and CEX.io. But regulators shouldn’t consider privacy coins having any higher risk than bitcoin, Robinson told The Block.","“Enhanced privacy can be achieved in both bitcoin (mixers, coinjoins) and Zcash (shielded addresses),” said Robinson, adding that Zcash, in fact, has been seen to be used \"to a far lesser extent than bitcoin in illicit commerce.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Bitcoin remains the crypto-asset of choice for criminals, due to the ease with which it can be acquired and converted back into fiat currency,\" said Robinson.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Robinson","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Zcash","content":"PERSON"},{"type":"ZEN","content":"ORGANIZATION"},{"type":"ZEC","content":"ORGANIZATION"},{"type":"Tom Robinson","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}