{"summary":"NBA’s Sacramento Kings has partnered with blockchain software development studio ConsenSys to release a sports gear auction platform built on the Ethereum","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53129\/nbas-sacramento-kings-partner-with-consensys-to-launch-sports-gear-auctions-on-ethereum","publishDate":"2020-01-15T15:00:00","id":11691,"type":null,"title":"NBA&#x27;s Sacramento Kings partner with ConsenSys to launch sports gear auctions on Ethereum","category":["LAYER 1S"],"content":["NBA’s Sacramento Kings has partnered with blockchain software development studio ConsenSys to release a sports gear auction platform built on the Ethereum blockchain.","Launched on Jan. 15, the new system utilizes the Consensys-backed supply chain platform, <a href=\"https:\/\/treum.io\/\" data-v-f87c67ca=\"\">Treum<\/a>, to authenticate every auctioned item and establish a transparent audit trail recording the gear’s entire transaction history as well as any future sale, loan, or showroom exhibition of the gear, according to a press statement shared with The Block.","The system’s first live auction, featuring Kings guard Buddy Hield’s game-worn jersey, will take place today, starting just before the tip-off of tonight’s Dallas Mavericks vs. Sacramento Kings game and running through 11:59 p.m. PT.","Fans can participate via the team’s <a href=\"https:\/\/kings.bidlive.auction\/\" data-v-f87c67ca=\"\">website<\/a>. Proceeds will go to Hurricane Dorian relief efforts, according to the press release.","The highest bidder will receive the gear, a Certifications of Authority, as well as a digital token containing the item’s historical and future records.","ConsenSy's latest partnership with the Kings aims to use blockchain to bring the element of authenticity to America’s sports memorabilia market, which according to sports memorabilia database Collectable.com, boasts an estimated value of <a href=\"https:\/\/www.forbes.com\/sites\/davidseideman\/2018\/09\/19\/tech-entrepreneur-determines-first-true-estimate-of-sports-memorabilia-market-5-4-billion\/#5002780652e8\" data-v-f87c67ca=\"\">$5.4 billion<\/a> per year.","In 2014, the Kings became the first NBA team to accept bitcoin as payment. In 2018, it founded a charity called MiningForGood to mine cryptocurrency and donate the money to community workforce training programs.","Last year, the team <a href=\"https:\/\/www.nba.com\/kings\/blog\/sacramento-kings-partner-cryptokaiju-launch-first-physical-crypto-collectible-professional\" data-v-f87c67ca=\"\">partnered<\/a> with CryptoKaiju to launch a limited-edition crypto collectible and <a href=\"https:\/\/www.nba.com\/kings\/news\/sacramento-kings-and-blockparty-launch-nbas-first-blockchain-driven-token-power-predictive\" data-v-f87c67ca=\"\">started<\/a> the NBA’s first blockchain-powered gaming app.","“We have integrated blockchain technology into our business across multiple platforms, including our reward program, and now our fans will have the opportunity to securely purchase authentic game-worn merchandise in real-time using an innovative blockchain-based solution,” Sacramento Kings chief technology officer Ryan Montoya said in a statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Certifications of Authority","content":"ORGANIZATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"Kings","content":"PERSON"},{"type":"Ryan Montoya","content":"PERSON"},{"type":"11:59 p.m.","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"$5.4 billion","content":"MONEY"},{"type":"Jan. 15","content":"DATE"},{"type":"Sacramento Kings","content":"LOCATION"},{"type":"Dallas Mavericks vs. Sacramento Kings","content":"ORGANIZATION"},{"type":"” Sacramento Kings","content":"ORGANIZATION"},{"type":"Treum","content":"LOCATION"},{"type":"Kings guard Buddy Hield","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}