{"summary":"Bitcoin was trading around $17,300, up 0.3%.\nAltcoins led losses while memecoin shiba inu jumped 5%.\nCoinbase rose following its latest round of layoffs. ","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200374\/bitcoin-steady-around-17250-as-altcoins-dip-coinbase-jumps-on-job-cuts","publishDate":"2023-01-10T10:11:46","id":1169,"type":null,"title":"Bitcoin steady around $17,250 as altcoins dip, Coinbase jumps on job cuts","category":["Markets"],"content":["Bitcoin and ether held onto gains as altcoins traded lower, while traditional markets rose modestly. Coinbase popped following its latest layoff announcement.&nbsp;","Bitcoin was trading around $17,270 at 9:45 a.m. EST, up 0.1% over the past 24 hours, according to TradingView data.&nbsp;","Ether traded about $1,334, adding 0.6%, while altcoins like Ripple's XRP and Polygon's MATIC traded lower, falling by 1.4% and 2.3%, respectively. Solana's SOL and Polkadot's DOT both shed 2.3%.","Dog-themed memecoins had a mixed 24 hours. Dogecoin fell 1.2%, while shiba inu jumped 5%.","WOO Network's token jumped 20% following the release of its latest tokenonmics.","The S&amp;P 500 was little changed while the Nasdaq was up 0.3%.","Coinbase jumped more than 3% after announcing job cuts affecting about 20% of its workforce.","Investment bank Needham remains positive on Coinbase, saying the move was necessary. The firm maintained a price target of $73 for the stock and a buy rating.&nbsp;","\"We view the cost reductions as a positive for the stock and a necessary step given the uncertain volume picture in 2023,\" analysts wrote in a note, adding there is still potential for fallout from the FTX collapse and \"remain cautious on volumes for the first half of 2023.\"","Silvergate, which announced layoffs of its own last week, gained about 3%.","Block and MicroStrategy were trading lower.","Shares in Grayscale's bitcoin trust (GBTC) were trading at a discount to the net asset value (NAV) of 38.5% on Monday.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/structured-products\/premium-of-gbtc\/embed\" title=\"Daily GBTC Premium\/Discount to NAV\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>&nbsp;"],"hashtag":[]}