{"summary":"BitGo celebrated the launch of a new crypto hybrid this week, Wrapped Bitcoin — and it could point to a new opportunity for the firm known for its sleepy","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9617\/bitgos-wrapped-bitcoin-has-launched-and-now-the-firm-is-eyeing-new-tokenization-opportunities","publishDate":"2019-01-30T19:59:29","id":11703,"type":null,"title":"BitGo launches &quot;Wrapped Bitcoin&quot; as it eyes new tokenization opportunities","category":["BITCOIN"],"content":["BitGo celebrated the launch of a new crypto hybrid this week, Wrapped Bitcoin — and it could point to a new opportunity for the firm known for its sleepy custody business.&nbsp;","To put it simply, Wrapped Bitcoin is an ethereum-based token that is backed one-to-one by a regular bitcoin. Similarly to how certain stable coins (which are tokens backed one-to-one by fiat currency) aim to offer the best of both crypto and fiat, Wrapped Bitcoin aims to function as a token that represents the value of bitcoin and offers the functionality of an ethereum token.","Trading of the new crypto is underway and BitGo is responsible for minting the new coins and storing the bitcoin reserves backing it. The use cases for Wrapped Bitcoin span the pedantic landscape of crypto, including collateral for decentralized lending as well as decentralized exchanges. \"People prefer the economics behind bitcoin, but there are, frankly, a lot of cool things you can do on ethereum,\" Rob&nbsp;<span class=\"qu\" tabindex=\"-1\" role=\"gridcell\" data-v-f87c67ca=\"\"><span class=\"gD\" data-hovercard-id=\"rob.paone@fluidity.io\" data-hovercard-owner-id=\"22\" data-v-f87c67ca=\"\">Paone, Growth Lead at AirSwap, one platform supporting trading of the new token, told The Block.<br data-v-f87c67ca=\"\">\n<\/span><\/span>","For instance, Wrapped Bitcoin effectively enables so-called decentralized exchanges, which only support trading between ethereum tokens, to support bitcoin pairs. That could open up decentralized exchanges to much needed liquidity, BitGo CTO Ben Chan said in an interview.","<strong data-v-f87c67ca=\"\">BitGo's future<\/strong>","At first glance, it might appear unusual that BitGo is playing such an active role in the project given that Wrapped Bitcoin doesn't necessarily support its core custody business. Still, Chan said the firm's role in the project could support its ambitions in tokenization down the road.&nbsp;","\"In the long term we have a vision in which digital assets drive the global economy,\" he said. Chan noted other firms are reaching out to BitGo about \"wrapping\" other currencies and assets. \"From a platform perspective, the platform we built can support stocks, bonds, and so on.\"","Still, he said it would be a while before the firm can create tokenized representations of U.S. equities, citing regulatory hurdles.&nbsp;","<em data-v-f87c67ca=\"\">This post has been updated to include Paone's most up to date title at AirSwap.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Paone","content":"PERSON"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Rob&nbsp;<span class=\"qu\" tabindex=\"-1\" role=\"gridcell\" data-v-f87c67ca=\"\"><span class=\"gD\" data-hovercard-id=\"rob.paone@fluidity.io\" data-hovercard-owner-id=\"22\" data-v-f87c67ca=\"\">Paone","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Ben Chan","content":"PERSON"},{"type":"Chan","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wrapped Bitcoin","content":"ORGANIZATION"},{"type":"AirSwap","content":"ORGANIZATION"},{"type":"Wrapped Bitcoin","content":"PERSON"}],"hashtag":["TOKENIZATION"],"authors":["Frank Chaparro","The Block"]}