{"summary":"Wired’s piece on the measures Coinbase takes to secure cryptocurrencies contains some irony : The financial institutions that cryptocurrencies were","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269\/on-private-key-custody","publishDate":"2018-08-30T17:18:51","id":11704,"type":null,"title":"On private key custody","category":["HACKS"],"content":["<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Wired’s<\/em>&nbsp;piece on&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.wired.com\/story\/coinbase-physical-vault-to-secure-a-virtual-currency\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.wired.com\/story\/coinbase-physical-vault-to-secure-a-virtual-currency\/\" data-v-f87c67ca=\"\">the measures Coinbase takes to secure cryptocurrencies&nbsp;<\/a>contains some irony&nbsp;: The financial institutions that cryptocurrencies were created to circumvent are the same ones that now protect them.","While members of the crypto community continue to recite the phrase “not your keys, not your bitcoin,” realistically the general population&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">will<\/em>&nbsp;need custody solutions. In fact, legally, institutional investors are required to secure their clients’ assets with qualified custodians.","Part of the beauty of bitcoin is that it gives you the option of securing your own money. Those that want to become monetary sovereign individuals have that choice. Those that don’t will also have that choice. Of course, in a perfect world of sovereign individuals, everyone would properly secure their own money. In the real world, however,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.cnbc.com\/2017\/12\/20\/man-lost-127-million-worth-of-bitcoins-and-city-wont-let-him-look.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.cnbc.com\/2017\/12\/20\/man-lost-127-million-worth-of-bitcoins-and-city-wont-let-him-look.html\" data-v-f87c67ca=\"\">humans aren’t very good<\/a>&nbsp;at securing their money.","It is understandable that experienced members of the crypto community do not want to risk their wealth by trusting a third party. There are obvious concerns when letting a third party manage your private keys. When you give another entity full control over your private keys, your wealth is dependent on their trustworthiness. Who is to say Coinbase’s security team will not conspire to steal your private keys? Nevertheless, as Bitcoin adoption continues to scale, one can’t assume that every novice investor could adequately manage their private keys.","In the short term, custodial services offered by companies like&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.coinbase.com\/vault?locale=en-US\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.coinbase.com\/vault?locale=en-US\" data-v-f87c67ca=\"\">Coinbase<\/a>&nbsp;and&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/xapo.com\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/xapo.com\/\" data-v-f87c67ca=\"\">Xapo<\/a>&nbsp;will be crucial for newcomers. Many are not yet comfortable managing their own money yet wish to explore bitcoin and cryptocurrencies. In the long term, as these new folks educate themselves on the importance of private key control, we will see a shift to semi-custodial services offered by the likes of&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/keys.casa\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/keys.casa\/\" data-v-f87c67ca=\"\">Casa<\/a>&nbsp;and self-custody via hardware wallets.","All in all, custodial services are a net positive for the community. It will take time to educate all users on the importance of private key management, and custodial services are a good compromise until we get there.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Casa","content":"ORGANIZATION"}],"hashtag":[],"authors":["Steven Zheng","The Block"]}