{"summary":"CleanSpark is looking to acquire between 50-75 megawatts of  either greenfield sites or acquisitions in order to meet its growth target of 16 EH\/s by the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210393\/cleanspark-2023-buying-spree-continues-as-company-seeks-to-add-50-75mw","publishDate":"2023-02-09T18:41:48","id":11700,"type":null,"title":"CleanSpark 2023 buying spree continues as company seeks to add 50-75MW","category":["CRYPTO INFRASTRUCTURE"],"content":["CleanSpark is looking to acquire between 50-75 megawatts of&nbsp; either greenfield sites or acquisitions in order to meet its growth target of 16 EH\/s by the end of 2023.","The company expects to keep buying machines by leveraging current spot market prices, adding to the thousands of miners it scooped up last year, it said during its most recent quarterly earnings call Thursday.","\"We also expect to shift our strategy when the time is right and look towards future contracts,\" CEO Zach Bradford said. \"We believe the tides are starting to shift and locking in prices for large orders will begin to be part of our strategy in the coming months.\"","CleanSpark adjusted its hashrate guidance for the end of 2023 in December, down from 22.4 EH\/s due to build-out delays from its infrastructure partner.","The planned expansion at the two facilities CleanSpark recently acquired in Georgia will bring the company's hashrate to 14 EH\/s, with 2 EH\/s left to fill.","Bradford said that it is \"looking at a lot of opportunities in a lot of regions,\" but has a strict set of criteria that includes access to low-cost power in the long term. The spike in energy prices last year was a major pain point for miners without locked-price power contracts, combined with the decline in bitcoin's value.","In order to help pay for these plans, Bradford said the company will propose to increase the number of shares authorized for issuance from 100 million to 300 million.","\"It is not required that we ever issue them. Rather, this proposal gives us the flexibility to use equity for targeted growth,\" Bradford said.","And although the company also expects to keep using some of its bitcoin mined to fund growth and operations, Bradford said he intends to see the balance of bitcoin grow in the near term.","CleanSpark beat expectations of a $31.3 million loss <a href=\"https:\/\/www.theblock.co\/post\/210281\/bitcoin-miner-cleanspark-beats-estimates-posts-29-million-loss\" data-v-f87c67ca=\"\">with<\/a> a net loss of $29 million and narrowly missed its revenue estimates.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zach Bradford","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$29 million","content":"MONEY"},{"type":"$31.3 million","content":"MONEY"},{"type":"Georgia","content":"LOCATION"},{"type":"75","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Bradford","content":"PERSON"},{"type":"100 million","content":"MONEY"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}