{"summary":"Tron founder Justin Sun withdraws billions of dollars worth of liquidity from DeFi lending platform Aave&#x27;s lending pools.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122570\/justin-sun-withdraws-billions-of-dollars-worth-of-crypto-from-aaves-lending-pools","publishDate":"2021-10-29T12:51:45","id":11706,"type":null,"title":"Justin Sun withdraws billions of dollars worth of crypto from Aave&#x27;s lending pools","category":["CRYPTOCURRENCY"],"content":["Tron founder Justin Sun has withdrawn billions of dollars worth of crypto from DeFi lending platform Aave's lending pools, according to <a href=\"https:\/\/twitter.com\/FrankResearcher\/status\/1454113698214289415\" data-v-f87c67ca=\"\">blockchain data<\/a>.","As a result, this has removed a significant amount of liquidity from the platform, triggering much higher interest rates.","The withdrawals may be a result of concerns over recent tweets between members of the Yearn community and those in the Aave camp. During a Twitter standoff, members of the Yearn community implied that Aave was vulnerable to a potential exploit.","Yearn founder Andre Cronje tweeted earlier Friday that \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Aave is vulnerable to the same exploit\" as the one that <a href=\"https:\/\/www.theblockcrypto.com\/post\/122241\/ethereum-defi-protocol-cream-finance-hacked-for-115-million\" data-v-f87c67ca=\"\">impacted Cream Finance<\/a> on Wednesday, which resulted in the theft of $130 million worth of tokens.<\/span>","\"M<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">aybe don't bad mouth other projects while sitting on an 11 figure vulnerability,\" <a href=\"https:\/\/twitter.com\/bantg\/status\/1453982648834068480\" data-v-f87c67ca=\"\">tweeted<\/a> Yearn core developer banteg. Banteg <a href=\"https:\/\/twitter.com\/bantg\/status\/1454100011722084356\" data-v-f87c67ca=\"\">later specified<\/a> that he believed the exploit has very specific liquidity requirements and was possible for 160 days in the past but is not currently viable.<\/span>","Following the disclosures and the resulting fallout, Aave founder Stani Kulechov <a href=\"https:\/\/twitter.com\/StaniKulechov\/status\/1454002649569939457\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweeted<\/a> that the crypto community should stick together. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Lets work together, support each other and most importantly win together,<\/span>\" he wrote.","Following the Twitter spat, Aave acknowledged that there have been concerns over a possible exploit for when xSUSHI is used as collateral in the Aave protocol. It is unclear if this is the same vulnerability to which the Yearn developers alluded.","Aave claims that it ran simulations that showed any attackers trying this exploit approach would end up losing money. Despite this, Aave has highlighted a proposal that has been made to disable functions related to xSUSHI as a precuationary measure.","Aave token holders are currently able to <a href=\"https:\/\/app.aave.com\/#\/governance\/44-QmNVWrrm3ieyRRVD4f77zdxrvSUj1W4HDCojLKNcxmVQhr\" data-v-f87c67ca=\"\">vote on the proposal<\/a> through its governance platform.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aave","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Cream Finance","content":"ORGANIZATION"},{"type":"$130 million","content":"MONEY"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["AAVE","JUSTIN SUN"],"authors":["Tim Copeland","The Block"]}