{"summary":"Nexus Mutual, the London-based decentralized finance (DeFi) crypto coverage company, has resolved two vulnerabilities on its platform following disclosures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/56891\/defi-startup-nexus-mutual-resolves-two-vulnerabilities-will-pay-7000-in-bug-bounties","publishDate":"2020-02-25T12:20:28","id":11705,"type":null,"title":"DeFi startup Nexus Mutual resolves two vulnerabilities, will pay $7,000 in bug bounties","category":["DEFI"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nexus Mutual, an Ethereum-based discretionary cover startup, has quietly resolved two vulnerabilities on its platform.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">One vulnerability could have potentially put part of the funds in Nexus Mutual at risk, the firm's CTO Roxana Danila&nbsp;<\/span><a class=\"_e75a791d-denali-editor-page-rtfLink\" href=\"https:\/\/medium.com\/nexus-mutual\/responsible-vulnerability-disclosure-ece3fe3bcefa\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;in a blog post published on Tuesday.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The vulnerability, found by security researcher Samczsun, was similar to a recent bug that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56134\/defi-lending-protocol-bzx-exploited-a-portion-of-eth-lost\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">ultimately affected<\/a> the bZx team's project. In the Nexus Mutual case, the vulnerability could have allowed an attacker to exchange ether (ETH) for DAI on the Uniswap exchange.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nexus Mutual's funds are currently held in DAI and ETH, and it was relying on Oraclize to trigger a rebalance via Uniswap. Simply put, the vulnerability allowed any third party to trigger a treasury rebalance at any time. After receiving Samczsun's report, Nexus Mutual \"killswitched the system's interaction with Uniswap.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"In the short term, if claims in DAI are to be paid, we'll raise a governance proposal to transfer the required ETH to the Advisory Board multi-sig, exchange them for DAI, and pay the claim. Long term, we're looking to integrate with a manipulation-resistant DEX, and are currently evaluating options,\" Danila said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">She acknowledged that the <a href=\"https:\/\/www.theblockcrypto.com\/post\/56207\/bzx-attacked-again-645k-in-eth-estimated-to-be-lost\" data-v-f87c67ca=\"\">recent bZx attacks<\/a> should have been a \"huge red flag\" for Nexus Mutual as well, \"but we were overwhelmed by our product being put to its first real test to successfully pay a claim.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Another vulnerability, found by blockchain developer and researcher Mudit Gupta, was related to the governance system utilized by Nexus Mutual.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">In the system, certain actions are automatically executed if a proposal is accepted. The system uses categories to define which action should be executed. However, categories only define the smart contract on which the action should be executed, Gupta told The Block. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The actual function to be called in that smart contract is part of the proposal. This can lead to situations where an attacker can masquerade their proposal as belonging to a 'safe' category but actually call an 'unsafe' function through the proposal,\" said Gupta.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Gupta went on to explain that in Nexus Mutual's governance system, some categories allowed the advisory board members to take certain actions unilaterally. For example, there was a category to start an emergency pause. It required only a single \"yes\" vote to succeed and be executed. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"It looks safe from the face of it since it is supposed to pause the system in emergencies and the system can be unpaused at a later stage. However, due to the fact that the system does not verify what function is being called via the proposal, an attacker would've been able to craft a proposal that upgraded the Nexus Mutual's smart contracts to a malicious version instead of starting an emergency pause,\" he explained.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nexus Mutual has temporarily resolved the bug now by modifying all categories. Danila said the \"permanent fixes are in the final stages of development and will be put in place in a few days.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nexus Mutual categorized the vulnerability found by Gupta as a \"medium severity issue,\" while the one found by Samczsun has been categorized as a \"high severity issue.\"&nbsp;<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">In light of their responsible disclosures, Gupta and Samczsun will receive bounties of $2,000 and $5,000, respectively, Danila said. She stressed that none of the vulnerabilities have been exploited and no funds have been compromised. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Advisory Board multi-sig","content":"ORGANIZATION"},{"type":"Gupta","content":"PERSON"},{"type":"Nexus Mutual","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$5,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Samczsun","content":"PERSON"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"CTO Roxana Danila","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$2,000","content":"MONEY"},{"type":"Danila","content":"PERSON"},{"type":"Mudit Gupta","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DAI","UNISWAP"],"authors":["Yogita Khatri","The Block"]}