{"summary":"A CryptoPunk was mistakenly sold for less than a cent today, even though it was last sold for $69,000.\nSomeone even paid an Ethereum miner $57,000 to ensure that they were the one to snap the Punk up.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113546\/mistake-sees-69000-cryptopunk-sold-for-less-than-a-cent","publishDate":"2021-08-04T11:15:32","id":1170,"type":null,"title":"Mistake sees $69,000 CryptoPunk sold for less than a cent","category":["NFTs"],"content":["A CryptoPunk valued above $69,000 was sold for less than a cent today, in what appears to be a costly mistake.&nbsp;","CryptoPunks are a collection of 10,000 NFTs, featuring pixelated faces of humans, apes, zombies and aliens. The CryptoPunk in question was Punk 3860, a male Punk with a cigarette, big shades, a shadow beard and a mohawk. It was last sold for $69,369 on July 29.&nbsp;","<a href=\"https:\/\/twitter.com\/jonjonclark\/status\/1422866622554021889\" data-v-f87c67ca=\"\">According<\/a> to Jonathan Clark, co-founder of DeFi platform Float Capital, the owner intended to sell the Punk in a whitelisted sale for under a cent —&nbsp;but instead, made it available on the open market. This meant that anybody watching the market closely could have seen the listing go live and snap the Punk up.&nbsp;","In this case, however, someone made sure that they beat everyone to the punch. According to blockchain data, the buyer spent 22 ETH ($57,000) to bribe an Ethereum miner to prioritize the inclusion of their transaction in a block. They did so using the communication protocol Flashbots, which is commonly used <a href=\"https:\/\/www.theblockcrypto.com\/daily\/111790\/will-ethereum-miners-become-time-bandits-and-reorganize-the-blockchain\" data-v-f87c67ca=\"\">to extract MEV<\/a>.","There have been a few other bids for the NFT, although some of them may have been competing bids trying to buy it before it was sold. The max bid so far is 35 ETH ($91,000).","The buyer has put the NFT for sale for 52 ETH ($131,000). If somebody chooses to buy it at that price, the original buyer will end up with a profit of $74,000."],"hashtag":["ETHEREUM"]}