{"summary":"Suberra, a payments infrastructure for web 3, has announced their new non-custodial crypto debit card. The Suberra card allows users to spend their cryptocurrency from anywhere for anything, while also getting rewarded for their spending with up to 1% cashback.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228351\/suberra-unveils-new-crypto-debit-card-that-lets-you-spend-crypto-anywhere-from-your-non-custodial-wallet","publishDate":"2023-04-27T09:00:29","id":11712,"type":null,"title":"Suberra unveils new crypto debit card that lets you spend crypto anywhere from your non-custodial wallet","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Quick take:&nbsp;<\/span>","<a href=\"https:\/\/suberra.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Suberra<\/span><\/a><span data-v-f87c67ca=\"\">, a payments infrastructure for web 3, has announced their new non-custodial crypto debit card. The Suberra card allows users to spend their cryptocurrency from anywhere for anything, while also getting rewarded for their spending with up to 1% cashback. With this new product, Suberra aims to make cryptocurrency more accessible and usable for everyday transactions.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Spend crypto easily anywhere&nbsp;<\/b>","<span data-v-f87c67ca=\"\">The Suberra card is designed to meet the needs of the growing number of people who want to use their cryptocurrency for everyday purchases. Whether you're buying groceries, paying for a taxi, or booking a flight, the card makes it easy to spend your cryptocurrency anywhere.<\/span>","<span data-v-f87c67ca=\"\">\"We're thrilled to bring the Suberra card to market,\" said Edison Lim, CEO of Suberra. \"We believe that everyone should have the freedom to use their cryptocurrency wherever and whenever they want, and our card makes that possible.\"<\/span>","<span data-v-f87c67ca=\"\">The Suberra card is perfect for travelers. With competitive rates, users can travel globally and spend with ease. Whether you're in Paris or Tokyo, the Suberra card is accepted at most merchants worldwide.<\/span>","<b data-v-f87c67ca=\"\">Funds within your control<\/b>","<span data-v-f87c67ca=\"\">Besides the convenience and accessibility of the Suberra card, users can rest assured that their funds are stored in a secure non-custodial wallet. Non-custodial simply means you hold your own assets directly, without the need for a third party. Users have control over their private keys and can manage their assets independently, leading to a greater degree of security and privacy.<\/span>","<span data-v-f87c67ca=\"\">To use the Suberra card, users will hold stablecoins that will be debited on-chain whenever users attempt to pay with the card. If the stablecoin balance runs low, you can also set up an auto-convert that will swap your tokens like ETH into stablecoins that you can use to spend.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Join the waitlist for early access<\/b>","<span data-v-f87c67ca=\"\">Suberra’s crypto debit card will be released in the second half of the year. Those interested can sign up <\/span><a href=\"https:\/\/suberra.com\/card\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\"> for the waitlist for early access. Signing up is free, and you will be among the first to know when the card is available.<\/span>","<b data-v-f87c67ca=\"\">Payment Links for subscriptions and one-time payments<\/b>","<span data-v-f87c67ca=\"\">In addition to the launch of the new crypto debit card, Suberra has also recently launched <\/span><a href=\"https:\/\/suberra.com\/blog\/sell-easily-without-a-website-with-product-payment-links\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Payment Links<\/span><\/a><span data-v-f87c67ca=\"\"> for subscriptions and one-time payments. Payment Links are the fastest and easiest way for businesses and individuals to start accepting crypto payments for products or subscriptions easily without needing a website or a single line of code.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is ideal for things like event tickets, online merchandise, e-commerce stores, subscriptions or paid memberships, etc. Users will be able to pay in USDC on popular blockchains like Avalanche, Polygon and Arbitrum conveniently via the link.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Payment Links can be created from the <\/span><a href=\"https:\/\/suberra.com\/blog\/introducing-the-merchant-dashboard\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Suberra dashboard<\/span><\/a><span data-v-f87c67ca=\"\">, which is <\/span><span data-v-f87c67ca=\"\">a comprehensive platform that offers a range of features that make it easy for users to manage everything at once. You will be able <\/span><span data-v-f87c67ca=\"\">to view your revenue and customer transaction history, create and manage your subscriptions and products, and also invite team members for collaboration.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">You can start creating your own Payment Links with zero fees <\/span><a href=\"https:\/\/merchant.suberra.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<b data-v-f87c67ca=\"\">Turning its mission into reality&nbsp;<\/b>","<span data-v-f87c67ca=\"\">With the launch of the Suberra crypto debit card and Payment Links, Suberra is making it easier than ever for businesses and individuals to use cryptocurrency for everyday transactions. Suberra’s mission is to make it possible to accept or spend cryptocurrency from anywhere for anything.<\/span>","<b data-v-f87c67ca=\"\">Stay in touch <\/b><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stay tuned for more updates by following <\/span><a href=\"https:\/\/twitter.com\/SuberraProtocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Suberra on Twitter<\/span><\/a><span data-v-f87c67ca=\"\"> or sign up for their <\/span><a href=\"https:\/\/suberra.com\/newsletter\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">mailing list<\/span><\/a><span data-v-f87c67ca=\"\">.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Suberra <\/i><i data-v-f87c67ca=\"\">and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tokyo","content":"LOCATION"},{"type":"Suberra","content":"PERSON"},{"type":"Edison Lim","content":"PERSON"},{"type":"the second half of the year","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Suberra","content":"LOCATION"},{"type":"Paris","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1%","content":"PERCENT"}],"hashtag":[],"authors":["Sponsored","The Block"]}