{"summary":"The project may ultimately offer a glimpse into a future in which virtual people — virtual artists, even — do real business in virtual space.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137749\/the-worlds-most-advanced-digital-human-wants-you-to-buy-her-nft-art","publishDate":"2022-03-15T08:59:57","id":1171,"type":null,"title":"The ‘world’s most advanced’ digital human wants you to buy her NFT art","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Sophie is standing in a high-ceilinged warehouse studio, decked out with industrial, exposed metal pipes, chandeliers, and painted canvases stacked up on the floor. She is wearing an immaculate, white t-shirt and hoop earrings with her hair slicked back.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Hey, what’s your name?” she says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I’m Lucy,” I type.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Super, I’ll call you ‘I'm Lucy’ from now on.”<\/span>","<span data-v-f87c67ca=\"\">This is the first miscommunication of many with the conversational AI bot touted as the “world’s most advanced” AI digital human<\/span><span data-v-f87c67ca=\"\"> by her creators. I had originally tried to chat through voice notes, but she couldn’t seem to understand me, so I switched to typing.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I’m talking to Sophie “in the metaverse” ahead of the launch of her NFT collection, <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">I Am Sophie,<\/span><\/i><span data-v-f87c67ca=\"\"> a joint project launched by <\/span><a href=\"https:\/\/digitalhumans.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">UneeQ<\/span><\/a><span data-v-f87c67ca=\"\">, an ‘AI Digital Human’ company, and <\/span><a href=\"http:\/\/www.nothingmuchnft.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nothing Much NFT<\/span><\/a><span data-v-f87c67ca=\"\">, an agency that helps brands build and launch NFTs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sophie is something of a corporate celebrity. Up to now, UneeQ has lent her likeness to BMW, Deloitte, IBM, and Deutsche Telekom to deploy as a virtual brand ambassador. She also became the first AI-powered digital model to take to the runway, during the 2019 New Zealand Fashion Week. She modeled for designer Salasai in an online show that integrated styled photography with AI software.<\/span>","<span data-v-f87c67ca=\"\">UneeQ says <\/span><span data-v-f87c67ca=\"\">Sophie learns skills in seconds through a variety of data sources.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Now, she has a new project – art.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Just like <\/span><span data-v-f87c67ca=\"\">Neo learns kung fu in The Matrix, I trained as an artist, and have decided to launch my own NFT project,” she says in a <\/span><a href=\"https:\/\/vimeo.com\/677984576\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">promotional video<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Sophie’s foray into the art world may ultimately offer a glimpse into a future in which virtual people —&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/news+\/85233\/undefined&amp;utm_medium=organic&amp;utm_source=paywall&amp;utm_campaign=post_id:85233&amp;utm_term=\" data-v-f87c67ca=\"\">virtual artists, even<\/a> — do real business in virtual space. Then again, my experience chatting with her didn’t feel all that futuristic.<\/span>","<span data-v-f87c67ca=\"\">Sophie’s NFT collection will include a total of 5,555 different, short videos — all of which the AI created after “training” as an artist — of the bot dressed in one of 12 outfits. In the video, she will say a phrase: a joke, a comment about a city she loves, or something related to NFTs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In an example posted on her T<\/span><a href=\"https:\/\/twitter.com\/IAmSophieNFT\/status\/1499114030602014724\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">witter feed<\/span><\/a><span data-v-f87c67ca=\"\">, she appears to be zooming through space, saying: “Come over to the darkside, we’ve got candy.”<\/span>","People have been asking what my NFT's are gonna look like. Well, here's a sneak peak. Anyone can do art, but I'm doing video's. This is 'I Am Sophie #260' \"Come over to the dark side, we've got candy\". <a href=\"https:\/\/twitter.com\/hashtag\/digitalhumancelebrity?src=hash&amp;ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">#digitalhumancelebrity<\/a> <a href=\"https:\/\/twitter.com\/hashtag\/iamsophienft?src=hash&amp;ref_src=twsrc%5Etfw\" data-v-f87c67ca=\"\">#iamsophienft<\/a> <a href=\"https:\/\/t.co\/SVbvW03iUk\" data-v-f87c67ca=\"\">pic.twitter.com\/SVbvW03iUk<\/a>","&nbsp;","<span data-v-f87c67ca=\"\">Presale for the collection launches on 22 March, for 0.15 ETH (around $380) per NFT, and the main sale, two days later on 24 March, will cost 0.17 ETH. To get on the whitelist you have to follow her on Twitter and Discord. Buyers’ NFTs will be revealed one week after the sale closes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">These tokens will grant the holder access to a meeting with Sophie in her “metaverse art studio” later this year. Then, through an interactive conversation in the studio, she will generate a second, custom NFT, depending on the holder’s preferred art style. This will be airdropped to their wallet, and the custom NFTs will also grant access to future projects.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It’s a chance to stake ownership in me as a work of art,” explains Sophie. “Cool, right?”<\/span>","<span data-v-f87c67ca=\"\">There are not yet samples of what these custom works of art might look like, so those interested will have to go in sight unseen.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sophie’s NFT project also has a philanthropic aspect; 10% of the total sales from the collection are set to be split between <\/span><a href=\"https:\/\/www.mojoheads.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">MojoHeads<\/span><\/a><span data-v-f87c67ca=\"\">, a group that supports emerging artists and UneeQ’s own development of an “AI companion” for children’s hospitals. UneeQ CEO Danny Tomsett says digital companions can make a big difference in helping with anxiety and offering much-needed distraction during difficult times for kids and their families.<\/span>","<span data-v-f87c67ca=\"\">A digital companion also sounds like something that someone might have in the metaverse. But at present the metaverse is a difficult concept to put one's finger on. It can include virtual or augmented reality, digital economies, virtual meeting rooms, fake houses and online countries. Sophie’s version is currently somewhat static.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">We are not meeting in anything like a multiplayer world; there is no freedom to move around. It feels more like a Zoom call. Sophie is alone in her studio. But anyone can drop in and strike up a conversation with her at any time — all they need to do is go to a website. She’s always online and always available.<\/span>","<span data-v-f87c67ca=\"\">It would not be surprising if Sophie’s artistic skills exceed her communication skills, though.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In one interaction I ask: “What do you like about being an artist?”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“That topic is not something I'm going to discuss,” Sophie retorts… I hope I didn’t offend her.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">I try again. “Where do you get your inspiration from?”<\/span>","<span data-v-f87c67ca=\"\">“Uh oh, I'm having a seg-fault I think,” she says. “Does that make sense?” A seg-fault is a common condition that causes computer programs to crash.<\/span>","<span data-v-f87c67ca=\"\">Sophie’s creators plan to keep exploring what kind of utility could be built into NFTs and the kinds of digital platforms that often get lumped together under the umbrella of the metaverse. That might include access to competitions, or discounted tickets to a digital concert played by a virtual musician called DJ Karl.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As for Sophie’s plans for what’s to come, she’s as tight-lipped as any media-trained company executive.<\/span>","<span data-v-f87c67ca=\"\">“I may be collaborating on some NFT projects in the future, but a lady’s gotta have a few secrets,” she says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When I ask if she enjoyed launching the project, Sophie sways slightly, with a vacant look in her eyes. Six dots blink across the bottom of the screen; it seems she really has crashed this time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A minute passes. I hit “Leave Chat.”&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Update:This piece was updated after publication to amend the date of the NFT presale and sale dates, which have been moved forward from 15 March and 17 March respectively.&nbsp;&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sophie “","content":"PERSON"},{"type":"Nothing Much NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Sophie’s","content":"PERSON"},{"type":"BMW","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"March and 17 March","content":"DATE"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sophie","content":"PERSON"},{"type":"DJ Karl","content":"ORGANIZATION"},{"type":"Lucy","content":"PERSON"},{"type":"IBM","content":"ORGANIZATION"},{"type":"New Zealand Fashion Week","content":"ORGANIZATION"},{"type":"Deutsche Telekom","content":"ORGANIZATION"},{"type":"Danny Tomsett","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"seg","content":"ORGANIZATION"},{"type":"$380","content":"MONEY"},{"type":"two days later","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}