{"summary":"In an interview with The Block, Revolut&#x27;s Nik Storonsky gave further detail into the long-rumored &quot;Revcoin&quot;.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147768\/revoluts-planned-native-token-will-reward-customer-loyalty-storonosky-says","publishDate":"2022-05-19T07:50:37","id":11711,"type":null,"title":"Revolut&#x27;s planned native token will reward customer loyalty, Storonsky says","category":["FINTECH"],"content":["Revolut's planned native crypto token will aim to reward customers for their loyalty, CEO Nik Storonsky said in an interview, in which he also shared details on the neobank's forthcoming non-custodial wallet.","Speaking to The Block at the Finance FWD conference in Hamburg, Storonsky said the long-rumored native token — which some have <a href=\"https:\/\/www.theblockcrypto.com\/post\/145443\/revoluts-new-crypto-head-departs-as-it-gears-up-for-digital-assets-push\" data-v-f87c67ca=\"\">dubbed<\/a> \"Revcoin\" — will function in a similar way to airline Air Miles programs, where users earn rewards based on how often they use the service.","\"It definitely won't be a stablecoin,\" he said. \"The goal is to make loyalty tradable.\"&nbsp;","Separately, Storonsky said the company is building a non-custodial wallet, where users are entrusted with the seed phrase and private key and empowered to link to other decentralized wallets.","Revolut currently only offers customers the option to host crypto in a custodial wallet, where the private keys are managed by a third party and bitcoin is the only token that can be withdrawn <a href=\"https:\/\/www.revolut.com\/en-US\/news\/revolut_launches_public_beta_for_bitcoin_withdrawals_\" data-v-f87c67ca=\"\">to a user's external wallet<\/a>. Storonsky confirmed <a href=\"https:\/\/www.reuters.com\/technology\/revolut-ceo-eyes-expansion-into-mortgages-crypto-wallets-2022-04-26\/\" data-v-f87c67ca=\"\">earlier reports<\/a> that the financial app will add staking, deposits and withdrawals, and lending to its custodial wallet offering.","The non-custodial wallet will function both as a separate standalone app and as an option within the Revolut in-app hub, where a plethora of features from pet insurance to hotel booking to remittances are already available.&nbsp;","There are plans to add support for non-fungible tokens (NFTs) to the wallet but this is currently \"deprioritized,\" according to the Revolut founder.","\"We want to start with the basics,\" he said.&nbsp;","Giving further details into how the wallet will look, the billionaire Revolut founder said that while it will function similarly to MetaMask, he wants to make it as simple as possible for the user. That means the complexity of different blockchain networks and bridges that some crypto-native wallets make visible will be hidden.&nbsp;","\"We want to make sure that people can just transfer crypto in the same way they do with bank accounts,\" he explained.&nbsp;","He did note, however, that it will likely initially launch as a single-chain wallet.&nbsp;","\"Initially we'll launch on Ethereum but going forward after that we will make it multichain,\" he says, with Revcoin following a similar trajectory.","When asked if the above details were a direct confirmation of Revolut's plans for a native token, Storonsky remained coy.&nbsp;","\"We're working on many things,\" he said, adding that it will be launched \"hopefully one day\".&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Revcoin","content":"PERSON"},{"type":"Air Miles","content":"ORGANIZATION"},{"type":"Storonsky","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nik Storonsky","content":"PERSON"},{"type":"Hamburg","content":"LOCATION"},{"type":"the Finance FWD","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}