{"summary":"Going into The Merge, miners are cautiously optimistic that there will be opportunities for mining beyond Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168380\/whats-left-for-ethereum-gpu-miners-after-the-merge","publishDate":"2022-09-12T08:55:59","id":11715,"type":null,"title":"What’s left for Ethereum GPU miners after The Merge?","category":["THE MERGE"],"content":["<span data-v-f87c67ca=\"\">Profits from Ethereum mining drove prices of graphics processing units (GPU) well above their suggested retail price last year. Now, as <a href=\"https:\/\/www.theblock.co\/category\/the-merge\" data-v-f87c67ca=\"\">The Merge<\/a> date looms close, the question of what will happen to all those machines and the miners operating them remains open.<\/span>","<span data-v-f87c67ca=\"\">Once the blockchain’s consensus mechanism switches from proof of work to proof of stake (estimated to happen between Sept. 14 and 15), Ethereum miners won’t need GPUs to verify blocks of transactions.<\/span>","<span data-v-f87c67ca=\"\">Unlike Bitcoin mining, which has become more industrial and consolidated, most of the Ethereum network is still made up of small-scale and individual miners. They will likely have the hardest time profiting from other proof-of-work coins like Ethereum Classic, Ravencoin or Ergo.<\/span>","<span data-v-f87c67ca=\"\">Based on the current economics, only about 100 terahash per second (TH\/s) of the Ethereum network will be able to “find a home,” in other blockchains, according to an estimate from Ethan Vera, COO of Luxor, which runs an Ethereum mining pool. That means that as much as around 90% of the network would “basically have no use for GPUs in crypto mining.”<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereums-hash-rate-daily\/embed\" title=\"Ethereum's Hash Rate (TH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Within a more competitive post-Merge market, Vera expects only those with very efficient equipment and access to low-cost power will be able to compete.<\/span>","<span data-v-f87c67ca=\"\">“Based on our analysis, we think that you have to have sub $0.03 (per kilowatt hour) and new generation GPUs,” Vera said. “Anyone above that, which is the majority of residential areas across at least North America, would have a hard time competing.”<\/span>","<span data-v-f87c67ca=\"\">Canadian Bitcoin and Ethereum miner Hive Blockchain said last week that it would <\/span><a href=\"https:\/\/www.theblock.co\/post\/168044\/crypto-miner-hive-blockchain-testing-other-gpu-mineable-coins-ahead-of-the-merge\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">start testing other GPU minable coins<\/span><\/a><span data-v-f87c67ca=\"\"> as it strategizes how to optimize the 6.5 TH\/s of Ethereum mining capacity it currently has. Based on its power cost of $0.03 per kilowatt-hour, the company said it is \"well positioned to navigate the market ahead.\"<\/span>","Although Hive already mines ETC, it is not completely lifting the veil on its post-Merge plans. \"Which coins, and when to mine them, will be part of our competitive edge so we will not broadcast this information,\" the company said over email.","GPU mining represents 16% of Hive's total energy capacity. \"If it is clear that BTC mining earns substantially more $\/KWHR (dollars per kilowatt-hour) we would pursue expanding the BTC fleet,\" Hive also said.","BIT Mining, which uses ASICs instead of GPUs to mine ETH, is also keeping some secrecy around its strategy.","\"Part of what makes the event so exciting has been the speculation in the lead up, the fact that it is likely to shake up the entire space and the many questions which remain unanswered,\" it said. \"One possible outcome as the merge quickly approaches, is that our ETH ASIC machines are capable of being transferred to ETC mining since it utilizes the same algorithm.\"","<span data-v-f87c67ca=\"\">As the hash rate from the Ethereum network flows over to other blockchains after The Merge, the profitability of mining other coins will likely plummet.<\/span>","<span data-v-f87c67ca=\"\">Mark D’Aria, CEO of Bitpro, a retailer of used GPUs, said that there has been some misguided optimism in regards to the future of GPU mining and that a majority of small miners are “completely unaware of how dependent they are on Ethereum.”<\/span>","<span data-v-f87c67ca=\"\">“They think they are just going to mine something else and the profits are going to be similar. But the fact of the matter is that Ethereum is 95% of the total income,” he said. “Everything else is going to get absolutely crushed (...) What individual miners will be taking away will be pennies when it used to be dollars (...) and everyone is going to be pretty much unprofitable until people start turning off.”<\/span>","<span data-v-f87c67ca=\"\">In a guide about <\/span><a href=\"https:\/\/2miners.com\/blog\/end-of-the-ethereum-mining-when-what-to-mine-next-with-gpu-transition-to-pos-explained\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">what to mine after The Merge<\/span><\/a><span data-v-f87c67ca=\"\">, Ethereum pool 2Miners said that choosing Ethereum Classic, Ravencoin, and Ergo is the “safest post-Merge strategy.” <\/span>","<span data-v-f87c67ca=\"\">EthereumPOW — the potential fork — on the other hand, is still a \"dark horse,\" it also said. \"They don’t have a strong community and the developers are not that active. We’ll see how it goes very soon.\"<br data-v-f87c67ca=\"\">\n<\/span>","BIT Mining said that \"in the event of a successful fork of ETH surrounding the merge,\" its miners are prepared to keep mining ETH on the forked chain. \"Again, these are just two of the many possible outcomes we’ve prepared for,\" it added.","<span data-v-f87c67ca=\"\">Over email, 2Miners added that as “an old, well-known coin, presented on nearly all crypto exchanges,” ETC could grow stronger.<\/span>","<span data-v-f87c67ca=\"\">While miners who leave Ethereum for Ethereum Classic will add some value to the ETC ecosystem, Vera doesn’t think it will be enough to support that much more hash rate. “It's a long way to go to get the rest of the 90%,” he said.<\/span>","<span data-v-f87c67ca=\"\">Promoting the existence of a “healthy ecosystem” with DeFi apps, NFTs and stablecoins built on top of it could be a way to increase profitability, Vera argued. “Grants are interesting to start with, but long term, you need to incentivize people through philosophical and belief means rather than financial. (...) You want a network where people actually want to come and build on it rather than only getting paid for it.”<\/span>","<span data-v-f87c67ca=\"\">It’s possible but not certain that coins like ETC and Ravencoin could grow to a much larger size D’Aria said.<\/span>","<span data-v-f87c67ca=\"\">“This has never really been tested before. Nothing like this is ever remotely happened,” he said. “Some people make the argument that miners are just extracting value from the system. They mine the coins they sell immediately and they're pushing the price down. I don't think that's the case. (...) I think miners have always been like a grassroots kind of support.”<\/span>","<span data-v-f87c67ca=\"\">The value of ETC has gone up by roughly 37% since August 24, when the final dates of the Merge were announced, and as much as 140% since mid-July, <\/span><a href=\"http:\/\/oindesk.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according to data from TradingView<\/span><\/a><span data-v-f87c67ca=\"\">. “I think that’s no accident,” D’Aria said about ETC’s rising price, which was around $40 at the time of publication.<\/span>","","","While EthereumPoW is another contender, he reckoned ETC will ultimately attract the most miners, especially given that the former was “ill-prepared.” Still, among the top coins, miners are looking at just over $1 million in revenue per day, compared to around $20 million from Ethereum.","An individual Ethereum miner who goes by daylon.eth on Twitter told The Block that he plans to mine ETC, RVN and possibly $FLUX or $ERGO, depending on how profitable each of them becomes. He currently pays about $0.08 per kilowatt hour and “prioritizes low energy consumption.”","“I started mining because I enjoy it as a hobby. Profitability is my main consideration, however, I actually never sold 99% of my mined $ETH for fiat,” that user said. “I mine for a hobby and not to support myself financially, so in the worse case scenario I will just sell my GPUs later. Preferably if\/when there is another bull market for mining hardware”","Another user, by the handle j_crypto_2015 (who goes by J. W.), said the plan was to mine Ethereum Classic, but definitely not any other forked tokens — alluding to EthereumPoW, a proposed <a href=\"https:\/\/www.theblock.co\/post\/163229\/ethpow-team-says-its-miner-led-ethereum-fork-is-inevitable\" data-v-f87c67ca=\"\">fork on the Ethereum blockchain<\/a> after The Merge.&nbsp;","“If mining ETC is not profitable, the rigs will be paused and on hold. But I won’t dump them, 'cause it definitely won’t be only me facing this issue,” he said.","D’Aria argued that many players in the industry have little incentive to be brutally honest about the future of Ethereum mining — from GPU mining YouTube channels to hardware manufacturers. “They're not going to tell you ‘hey, in two months, this is probably going to be worthless.’” He said that the company posted an article laying out the math on GPU mining after the merge and got \"an extraordinarily negative reaction,\" with some people accusing them of being \"doomsayers\" to get people to sell GPUs.","Mining rewards for GPU miners could fall up to five times or maybe a little more, said a spokesperson from 2Miners — but likely not 20 times, as some might argue. “That kind of drop will keep some mining facilities profitable. The rest would just go away from the market,” the company said. “The crypto mining market is self-regulated. If there is profit the mining continues. Nobody mines without a profit.”","D’Aria estimated that there are around $10 to $20 billion worth of GPUs on miners’ hands, based on hash rate, while Vera points to roughly $7.9 billion. As far as the market for them goes, D’Aria expects to see prices plunge 5% to 10% a week \"for quite a while,\" keeping in line with the <a href=\"https:\/\/www.theblock.co\/post\/144954\/a-look-at-the-trends-driving-down-gpu-prices-and-what-this-means-for-ethereum-miners\" data-v-f87c67ca=\"\">trend from the past few months<\/a>.&nbsp;","“People that were going to sell their GPU sold them already. The people that were going to wait and see are now waiting and seeing,” he said “My inbox is probably going to explode the day of The Merge and suddenly everyone's going to want to sell me a million GPUs and I'm not going to know how to price them.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$ETH","content":"MONEY"},{"type":"Ravencoin","content":"PERSON"},{"type":"Ethan Vera","content":"PERSON"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$7.9 billion","content":"MONEY"},{"type":"Ethereum for Ethereum Classic","content":"ORGANIZATION"},{"type":"August 24","content":"DATE"},{"type":"Vera","content":"PERSON"},{"type":"$FLUX","content":"MONEY"},{"type":"Sept. 14","content":"DATE"},{"type":"Ergo","content":"ORGANIZATION"},{"type":"140%","content":"PERCENT"},{"type":"Bitpro","content":"LOCATION"},{"type":"$20 billion","content":"MONEY"},{"type":"37%","content":"PERCENT"},{"type":"J. W.)","content":"PERSON"},{"type":"Luxor","content":"LOCATION"},{"type":"$40","content":"MONEY"},{"type":"fiat","content":"ORGANIZATION"},{"type":"North America","content":"LOCATION"},{"type":"$\/KWHR (dollars","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"99%","content":"PERCENT"},{"type":"GPU","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Ethereum miner","content":"ORGANIZATION"},{"type":"$0.03","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"ERGO","content":"ORGANIZATION"},{"type":"ETC","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"Ethereum miner Hive Blockchain","content":"ORGANIZATION"},{"type":"Ethereum Classic","content":"ORGANIZATION"},{"type":"$0.08","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}