{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/13186\/nvidia-shareholder-brings-lawsuit-against-nvidia-officers","publishDate":"2019-02-23T16:11:38","id":11714,"type":null,"title":"Nvidia shareholder brings lawsuit against Nvidia officers","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Yang v. Huang, et al., 3:19-cv-00766 (N.D. Cal. February 12, 2019)[NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","We’ve written a lot about class action lawsuits. Typically, the cases we covered involved companies that did, or tried to do, an ICO. Usually, things go south, people lose money, and you know the drill. This case is sort of like a class action lawsuit. It's a shareholder derivative lawsuit against the corporate officers of Nvidia brought by one of its shareholders on behalf of Nvidia. Huh? Yep.","Yuju Yang owns Nvidia stock and is suing the corporate directors of Nvidia for violating their duties to the company. Basically, in a shareholder derivative lawsuit the shareholder (that’s Yang) can sue on behalf of the corporation if the corporation has a valid cause of action, but is not pursuing the cause of action for some reason. Here, Yang is suing the corporate officers of Nvidia for mismanagement of the company, and related not-so-good stuff. So, what does any of this have to do with crypto?","Nvidia, for those of you who don’t already know, makes graphics processing units, or GPUs. The company is one of the two main GPU manufacturers, along with AMD, and has been doing its thing for 25 years now. GPUs are great for video games, but it turns out they can also be great for mining cryptocurrency, and that is where things get interesting with respect to this lawsuit.","There is something called “the business judgment rule” in corporate law. Essentially, judges don’t want to spend time second-guessing decisions made by businesses that are, well, business decisions. Put another way, in lawsuits against corporate officers the court will assume that the officers acted in the best interests of the corporation unless proven otherwise. Here, Yang, is suing the corporate officers of Nvidia alleging that they violated their duties and cost the company money in an egregious manner. The corporate officers will inevitably respond that, no they didn’t violate their duties, and instead they were making informed decisions that they believed were in the best interest of the company.","The specific allegations at issue in this suit concern Nvidia targeting the burgeoning cryptocurrency mining market starting in or around Aug. 10, 2017, up to the present day. As alleged in the lawsuit “the Individual Defendants made and\/or caused the Company to make false and misleading statements indicating that the Company could withstand the volatility of the cryptocurrency market, specifically through their computer gaming customer demand, and effectively navigate the cryptocurrency market.” In addition, the plaintiff alleges that Nvidia was perfectly capable of managing their inventory, which was allegedly “connected little if at all to customers purchasing its GPUs for cryptocurrency related purposes.” On Nov. 15, 2018, Nvidia said that it expected a $2.7 billion drop in revenue for the next quarter. Whoops.","Yang also alleges that the officers were selling their shares in the company during a boom in the stock price driven by crypto-related sales, and that the officers forced the company to buy back shares at inflated prices that they knew were inflated, because of their alleged misrepresentations related to crypto. Oh, and for good measure Yang threw in a blurb about two pending securities fraud lawsuits involving the corporate officers. Man, there is a lot going on in this case. It will be fascinating to see how the defendants respond that, no, in fact they were making informed decisions concerning the focus on crypto and their bullishness was a totally reasonable business decision. Maybe it was, maybe it wasn’t?","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","<em data-v-f87c67ca=\"\">Image Credit: <a href=\"https:\/\/www.shutterstock.com\/image-photo\/santa-clara-california-usa-march-29-1100202230?src=8ltoxF9P-aP5Atx6ScY6qw-1-5\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Shutterstock\/JHVEPhoto<\/a><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 12, 2019","content":"DATE"},{"type":"Aug. 10, 2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"next quarter","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Yang","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"AMD","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Yang v. Huang","content":"PERSON"},{"type":"Nov. 15, 2018","content":"DATE"},{"type":"N.D. Cal","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}