{"summary":"European Central Bank President Christine Lagarde has said that bitcoin is &quot;highly speculative&quot; and needs to be regulated.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91014\/bitcoin-highly-speculative-needs-to-be-regulated-ecb-lagarde","publishDate":"2021-01-13T05:40:24","id":11716,"type":null,"title":"Bitcoin is &#x27;highly speculative&#x27; and needs to be regulated, says ECB&#x27;s Lagarde ","category":["BITCOIN"],"content":["European Central Bank (ECB) President Christine Lagarde has said that bitcoin is \"highly speculative\" and needs to be regulated.","Speaking at the Reuters Next conference on Wednesday, Lagarde said bitcoin has conducted \"some funny business and some interesting and totally reprehensible money laundering activity.\"","\"And there has to be regulations and this has to be applied and agreed upon,\" at a global level, said Lagarde.","\"If there is an escape, that escape will be used,\" she said. \"So I think [...] global cooperation and multilateral action is absolutely needed, whether it is initiated by the G-7, moved into the G-20 and then enlarged [...] The FATF [Financial Action Task Force] is clearly an organization that has expanded in that respect.\"","Lagarde also spoke about central bank digital currencies (CBDCs) at the conference. She said the ECB just yesterday <a href=\"https:\/\/www.theblockcrypto.com\/post\/79653\/european-central-bank-report-digital-euro\" data-v-f87c67ca=\"\">concluded a consultation<\/a> of the general public about the digital euro, and it has received the \"highest level of responses\" to the consultation.","\"No less than 8,000 people have actually logged in and responded to the many questions that were on that questionnaire concerning a digital euro,\" said Lagarde. \"So we are moving on. We are not charging on because it's an area where we need to be very careful and where we need to have a system that is secure, that is safe, that responds to Europeans' demand.\"","Lagarde did not provide a specific timeline for the launch of the digital euro, but said it is going to take \"a good chunk of time to make sure that we have something that is safe.\"","\"It's really hard to say because things in the fintech world are moving super-fast, so we need to really not just be alert, but we need to be to be running safely,\" she said, adding that she hopes the digital currency won't take more than five years.","The president further <a href=\"https:\/\/www.theblockcrypto.com\/post\/77562\/digital-euro-existing-systems-ecb\" data-v-f87c67ca=\"\">reiterated<\/a> that the digital euro would not eliminate banknotes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reuters Next","content":"ORGANIZATION"},{"type":"Central Bank (ECB","content":"ORGANIZATION"},{"type":"Lagarde","content":"PERSON"},{"type":"FATF [Financial Action Task Force","content":"ORGANIZATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Christine Lagarde","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"7","content":"DATE"},{"type":"20","content":"DATE"}],"hashtag":["BITCOIN","CBDCS","ECB"],"authors":["Yogita Khatri","The Block"]}