{"summary":"A judge has denied a motion to dismiss the wire fraud charges against former OpenSea employee Nathaniel Chastain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179111\/judge-denies-former-opensea-employees-motion-to-dismiss-fraud-case","publishDate":"2022-10-21T17:53:06","id":11723,"type":null,"title":"Judge denies former OpenSea employee&#x27;s motion to dismiss fraud case","category":["NFTS"],"content":["A judge in the Southern District of New York has denied a motion to dismiss the wire fraud charges against former OpenSea employee Nathaniel Chastain.","A grand jury <a href=\"https:\/\/www.theblock.co\/linked\/149685\/former-head-of-product-for-opensea-indicted-after-insider-trading-scandal\" data-v-f87c67ca=\"\">indicted<\/a> Chastain after the former OpenSea head of product allegedly purchased and sold non-fungible tokens (NFTs) he knew would be listed on the marketplace's homepage – a scheme the DOJ alleges was akin to turning a profit using insider information.","Chastain filed <a href=\"https:\/\/www.theblock.co\/post\/164825\/former-opensea-employee-accused-of-insider-trading-files-motion-to-dismiss-indictment\" data-v-f87c67ca=\"\">a motion to dismiss<\/a> in August, arguing NFTs constitute neither securities nor commodities and that wire fraud charges alleging front-running require trading in those categories.&nbsp;","District Judge Jesse Furman formally disagreed in a memorandum and order today, denying the motion to dismiss the indictment and saying the argument \"is wholly without merit.\"&nbsp;","\"No court has suggested, let alone held, that conviction in such a case requires trading in securities and commodities,\" Furman wrote.","A footnote within the opinion says that, at most, Chastain's argument suggests the term \"insider trading\" may be misleading and if so, the appropriate action would be to strike the phrase from the indictment rather than dismissing the indictment altogether.","Chastain's legal team <a href=\"https:\/\/www.theblock.co\/post\/174566\/opensea-employee-accused-of-fraud-wants-to-subpoena-the-nft-marketplace\" data-v-f87c67ca=\"\">filed a separate motion<\/a> earlier this month requesting the court strike the term from the case and bar the government from using it in the future. The defense team also filed to subpoena Chastain's former employer and throw out evidence related to a search of his home.&nbsp;","The next conference in the case is scheduled for Oct. 27 at 11 a.m. in New York.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Chastain","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Jesse Furman","content":"PERSON"},{"type":"Oct. 27","content":"DATE"},{"type":"Nathaniel Chastain","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["OPENSEA"],"authors":["Aislinn Keely","The Block"]}