{"summary":"British government no longer plans to require senders share the personal information of beneficiary&#x27;s when making a crypto transfer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153142\/uk-government-walks-back-from-controversial-crypto-data-collection-plan","publishDate":"2022-06-20T14:07:34","id":11727,"type":null,"title":"UK government walks back from controversial crypto data collection plan","category":["DATA"],"content":["<span data-v-f87c67ca=\"\">The UK government on Monday walked back from plans to collect personal information from private crypto wallets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Last July, the UK Treasury office released a consultation document on cryptocurrencies which stated that financial standards should be consistent across all financial services — including cryptocurrency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1004603\/210720_SI_Consultation_Document_final.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">document<\/span><\/a><span data-v-f87c67ca=\"\"> proposed that people that wished to send funds to private crypto wallets would need to collect the recipient's personal identification when doing so.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This was in reference to the Financial Action Task Force (FATF) standards — aimed at preventing money laundering and the funding of terror activities — which require the sender and recipient of funds to be identified properly.<\/span>","<span data-v-f87c67ca=\"\">Under this rule, transfers below a certain threshold — the July 2021 document proposed this to be £1,000 — would require limited information. Anything above this threshold would require the sender to provide more personal information about the beneficiary.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Instead of requiring the collection of beneficiary and originator information for all unhosted wallet transfers, cryptoasset businesses will only be expected to collect this information for transactions identified as posing an elevated risk of illicit finance,” <\/span><a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1083351\/MLRs_SI_2022_-_Consultation_Response_final.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according<\/span><\/a><span data-v-f87c67ca=\"\"> to the amended release on Monday.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"FATF","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Financial Action Task Force","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}