{"summary":"Executives at Blur, OpenSea, Orange Comet and Magic Eden are generally bullish amid speculation Amazon is getting into selling NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219473\/game-changer-amazons-rumored-nft-platform-embraced-by-blur-opensea-and-orange-comet","publishDate":"2023-03-14T12:40:59","id":11724,"type":null,"title":"‘Game changer’: Amazon’s rumored NFT platform embraced by Blur, OpenSea and Orange Comet","category":["COMPANIES"],"content":["When the biggest retailer in the world hints that it might get into the NFT game, tongues naturally start wagging.","From the looks of it, many of the NFT space’s top players are on board with Amazon joining the fray, curious to see how one of web2’s biggest success stories fares with its expansion into web3 and blockchain technology.","“This will be a game-changer in the NFT, digital collectibles space,” said Dave Broome, CEO of Orange Comet, the prolific NFT studio behind collections tied to high-profile individuals and intellectual property like Academy-award winning actor Anthony Hopkins, NBA legend Scottie Pippen and AMC’s “The Walking Dead” television series.","“Having a company like Amazon enter with a marketplace not only helps to legitimize NFTs … it offers an opportunity to onboard the masses into web3,” he said.","While much of the early hype surrounding the digital-asset market emerged during a frothy bull run in which traders bought and sold pricey, artistic NFTs from collections like CryptoPunks, Bored Ape Yacht Club and Doodles, it has been more established companies like <a href=\"https:\/\/www.theblock.co\/post\/215750\/starbuckss-web3-odyssey-is-seeing-early-signs-of-success-bofa-says\" data-v-f87c67ca=\"\">Starbucks<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/179797\/reddit-avoids-crypto-lingo-shows-how-to-take-nfts-mainstream\" data-v-f87c67ca=\"\">Reddit<\/a> that appear to be leading the way in luring first-time blockchain adopters over to web3. With Amazon possessing more than 300 million active users worldwide, few companies, if any, have the potential to onboard more people new to blockchain.","<span data-v-f87c67ca=\"\">Speculation about Amazon’s plans began as early as last <\/span><a href=\"https:\/\/www.theblock.co\/linked\/141971\/amazon-ceo-andy-jassy-says-amazon-could-sell-nfts-in-the-future\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">year<\/span><\/a>,<span data-v-f87c67ca=\"\"> after Amazon CEO Andy Jassy said the company might consider selling NFTs. Since then, separate <\/span><a href=\"https:\/\/blockworks.co\/news\/amazon-nft-marketplace-web3\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reports<\/span><\/a><span data-v-f87c67ca=\"\"> have outlined how the company’s NFT platform could work, where it might initially be available, and what type of digital assets it might offer.<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Part of Anthony Hopkins NFT collection.<\/em>","<span data-v-f87c67ca=\"\">Amazon, however, has not officially confirmed the speculation. The company also declined to comment when asked about <\/span><a href=\"https:\/\/en.thebigwhale.io\/article\/nfts-amazon-lancera-sa-plateforme-le-24-avril\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">one report<\/span><\/a><span data-v-f87c67ca=\"\"> which stated Amazon was prepared to launch the NFT platform by next month.<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">For many NFT industry leaders, it’s only a matter of time before Amazon — a commercial behemoth where consumers can buy practically anything — formally begins dealing in NFTs. Tens of billions of dollars in trading has already been created in recent years. OpenSea, the world’s largest NFT marketplace by dollar volume, has transacted almost 12.8 million ETH (currently more than $20 billion) since being founded in 2017, according to The Block Research.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"Ethereum NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe> <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Blur CEO Pacman said he views Amazon joining the NFT space as “positive” although demurred when asked about what the impact might be. <\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">Whenever new paradigms develop, it’s rare for established institutions to navigate them effectively,” the executive, whose legal name is <\/span><span data-v-f87c67ca=\"\">Tieshun Roquerre, said<\/span><span data-v-f87c67ca=\"\">. “Non-tech companies did not win as the web gained traction … I would be surprised if web2 companies make something compelling in web3.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Blur's NFT marketplace has been gaining ground on market leader OpenSea. Based on current ETH conversion rates, Blur has handled more than $3 billion in trading since launching in October, <\/span><span data-v-f87c67ca=\"\">according to The Block Research.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">At OpenSea, the company's chief business officer Shiva Rajaraman, is upbeat about Amazon’s foray into blockchain and web3.<\/span>","<span data-v-f87c67ca=\"\"> \"We’re excited about the momentum with leaders like Amazon, and look forward to seeing what use cases they focus on, “ he said. “More experimentation to learn what works and can scale, is beneficial to all of us.\"<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><b data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">As the NFT market has matured, the use cases are multiplying rapidly, including functioning as access to customer rewards programs, like with Starbucks, or <a href=\"https:\/\/www.livenationentertainment.com\/2022\/08\/ticketmaster-launches-new-capability-to-issue-digital-collectible-nfts-to-fans-before-during-or-after-an-event-with-over-5-million-nfts-already-minted-on-the-flow-blockchain\/\" data-v-f87c67ca=\"\">offering concertgoers<\/a> “<\/span><span data-v-f87c67ca=\"\">digital keepsakes,” like Ticketmaster allows event organizers to issue. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">For many leaders in digital assets, however, gaming has the greatest potential for unlocking revenue, more than any other vertical. Gamers <\/span><span data-v-f87c67ca=\"\">buying and selling digital artifacts they can use when playing their favorite titles could be worth several billions of dollars each year given the size of the video game market.<\/span>","<span data-v-f87c67ca=\"\">Amazon could be well positioned to take advantage of any NFT-gaming boom. The company owns Twitch, a streaming platform wildly popular among video game lovers. <\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">Given [Amazon’s] deep connection with games through Twitch, we could see a big win for web3 gaming,\" <\/span><span data-v-f87c67ca=\"\">said Magic Eden’s Chief Gaming Officer Chris Akhavan. Magic Eden is an NFT marketplace that currently plays a key role in web3 gaming, helping to facilitate the trading of in-game NFTs.<\/span>","<span data-v-f87c67ca=\"\">Use cases aside, Amazon’s biggest contribution might end up being the lending of credibility to an area dominated by first-time CEOs running fledgling companies, some of which, like FTX, have failed spectacularly and thus tarnished blockchain's reputation. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAdditionally, Amazon's approach could also help to distinguish NFTs from cryptocurrency, argues Orange Comet's Broome, who worked as a successful Hollywood producer before co-founding a blockchain startup in 2021.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">The only way to grow the web3 gaming and NFT, digital collectibles space is to bring the masses in,” Broome said. “Amazon’s rumored marketplace … will help to differentiate a crypto exchange like FTX, from a blockchain web3 project.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Broome","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Shiva Rajaraman","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"Orange Comet","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Pacman","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"several billions of dollars","content":"MONEY"},{"type":"$20 billion","content":"MONEY"},{"type":"Ticketmaster","content":"ORGANIZATION"},{"type":"Academy","content":"LOCATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Anthony Hopkins","content":"PERSON"},{"type":"Anthony Hopkins NFT","content":"ORGANIZATION"},{"type":"Dave Broome","content":"PERSON"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Andy Jassy","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Chris Akhavan","content":"PERSON"},{"type":"Scottie Pippen","content":"PERSON"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}