{"summary":"As bicoin miners struggle with declining profits and access to capital, two new funds targeting the industry were announced in the past week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172122\/the-markets-fundamentally-changed-why-crypto-firms-are-moving-to-offer-loans-to-bitcoin-miners","publishDate":"2022-09-29T17:22:33","id":1172,"type":null,"title":"&#x27;The market&#x27;s fundamentally changed&#x27;: Why crypto firms are moving to offer loans to bitcoin miners","category":["MINING"],"content":["If the past week is any indication, efforts are ramping up to offer loan capital to bitcoin miners as they contend with a difficult business climate.","Icebreaker Finance, which announced a <a href=\"https:\/\/www.theblock.co\/post\/171275\/maples-icebreaker-finance-launches-300-million-lending-fund-for-bitcoin-miners\" data-v-f87c67ca=\"\">$300 million lending pool for bitcoin miners last week<\/a>, is targeting a subset of the market and looking for stability over time in power costs.","\"We don't see this pool providing some kind of index exposure to the whole market,\" the company's CEO and founder Glyn Jones told The Block. \"What we're looking for is businesses are going to be resilient through a wide range of market conditions.\"","Another <a href=\"https:\/\/www.theblock.co\/post\/173075\/bitdeer-to-invest-in-lending-fund-for-bitcoin-miners-report\" data-v-f87c67ca=\"\">lending fund specifically geared towards bitcoin miners was announced<\/a> this week, coming at a time when the industry is struggling with slimmer operating margins. The first $50 million investment comes from none other than bitcoin mining firm Bitdeer. Bitdeer chairman Jihan Wu is seeking to raise an additional $200 million from outside investors.","\"The fund size is 250M and the returns will depend on the hashrate price when the market recovers in the next bull run,\" said Matt Linghui Kong, the CEO of Bitdeer Group. \"Interest is expected from institutions that are open to opportunities in mining and riding the market cycle, but don't have direct access or operational expertise, for e.g. alternative investment funds, family offices and venture capital.\"","Icebreaker's Jones referred to miners that can still manage to generate enough cash flow in a market with suppressed bitcoin pricing and elevated hash rates. Production costs — energy in particular — stick out as an important factor and miners with long-term power contracts at a fixed rate can offer more security for the term of the loan.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"The market's fundamentally changed,\" Jones said. \"If I go back six months ago, there were a lot of lenders in the space. Market pricing was I think extremely aggressive (...) Not really reflecting the risks being embodied.\"","The rates that Icebreaker Finance is now offering (15% to 20%, with 12 to 18 months maturity) are on the higher end at least compared to other loans seen this year from public miners — for example, <a href=\"https:\/\/www.theblock.co\/linked\/139638\/bitcoin-miner-iris-energy-secures-71-million-in-equipment-financing\" data-v-f87c67ca=\"\">Iris Energy in March<\/a> (11% interest rate from NYDIG), <a href=\"https:\/\/www.theblock.co\/linked\/145064\/argo-secures-up-to-70-6-million-in-loans-for-texas-mining-facility\" data-v-f87c67ca=\"\">Argo Blockchain in May<\/a> (12% from NYDIG), <a href=\"https:\/\/www.theblock.co\/post\/153294\/bitfarms-gives-up-3000-btc-to-pay-down-100-million-loan-from-galaxy-digital\" data-v-f87c67ca=\"\">Bitfarms in June<\/a> (12% from Galaxy Digital), <a href=\"https:\/\/www.theblock.co\/post\/160884\/bitcoin-miner-marathon-secures-additional-100-million-loan\" data-v-f87c67ca=\"\">Marathon in July<\/a> (with a variable interest rate then priced at 7.25% from Silvergate Bank). Bitdeer did not disclose more details about how it will structure deals.","Yet interest rates for public miners have generally trended downward since January 2020, according to data compiled by public relations firm BlocksBridge in its <a href=\"https:\/\/www.getrevue.co\/profile\/BlocksBridge\/issues\/miner-weekly-why-lending-rates-have-been-declining-1370966\" data-v-f87c67ca=\"\">Miner Weekly newsletter<\/a>. It also points out that other variables included in the loan terms should be taken into consideration.","\"Most of the loans we analyzed had a maturity term ranging from 24 to 36 months while several were short-term bridge notes, lasting from 1 to 6 months,\" the newsletter said. \"Some of the loans also included specific covenants on a borrower’s financial health like coverage ratios, which provided additional color on how TradFi organizations evaluate mining companies.\"","","","Icebreaker's interest rates reflect current market conditions, where the hashrate is reaching record highs while the coin is down 70% from its record price, said Strahinja Savic, head of data and analytics at FRNT Financial.","\"The possibility of bitcoin moving lower means that lenders in the mining space are being extremely cautious. There is plenty of risk right now,\" Savic said.","Savic went on to highlight a \"solvency crisis\" in the crypto space, which recent legal moves in the sector demonstrate.","Bitcoin mining hosting provider Compute North <a href=\"https:\/\/www.theblock.co\/post\/172246\/compute-north-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filed for Chapter 11 bankruptcy last week<\/a>. Compute North's CFO said in a corresponding court filing that the firm “has been unable to maintain sufficient liquidity to bring planned projects in development online and pay all of its obligations on a current basis.\"","The firm has between $100 million-$500 million both in estimated liabilities and estimated assets, according to the filing. It is <a href=\"https:\/\/www.theblock.co\/post\/172477\/compute-north-sued-two-months-before-declaring-bankruptcy\" data-v-f87c67ca=\"\">facing at least one lawsuit from one of its creditors, NBTC Limited<\/a>.","The industry saw some of the biggest public miners sell large portions of their bitcoin holdings, especially in June, as the cryptocurrency plunged, putting pressure on bitcoin-backed loans.","Some of those companies had historically maintained a policy of holding on to the bitcoin they mined. Yet <a href=\"https:\/\/www.theblock.co\/post\/153294\/bitfarms-gives-up-3000-btc-to-pay-down-100-million-loan-from-galaxy-digital\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Bitfarms sold 3,000 BTC<\/a>&nbsp;in June to pay down a $100 million bitcoin-backed loan from Galaxy, while&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/156304\/argo-sold-637-bitcoin-in-june-in-an-effort-to-strenghen-its-balance-sheet\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Argo sold 637 BTC<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/156056\/cleanspark-sold-nearly-all-339-bitcoin-it-mined-in-june\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CleanSpark 328 BTC<\/a>.","\"The company made the strategic decision to derisk the liability of the bitcoin-backed loan and reduce our exposure,\" said Argo CEO Peter Wall during the company's second-quarter earnings call. \"We didn’t want to get into a position where we had to liquidate our bitcoin at very low prices.\"","Regardless, Argo is still \"well placed to be able to access the debt markets,\" CFO Alex Appleton said, adding that the company has changed its debt profile. It recently <a href=\"https:\/\/www.theblock.co\/post\/145257\/argos-texas-flagship-facility-has-been-energized\" data-v-f87c67ca=\"\">started energization at its flagship site in Texas<\/a>, after securing millions in financing for the expansion over the past year. \"You can’t use your machines as collateral until you actually have them in your possession. You can’t use infrastructure until you have it built,\" he said.","Even as miners were deleveraging earlier in the summer, Marathon — which has refrained from selling its bitcoin — <a href=\"https:\/\/www.theblock.co\/post\/160884\/bitcoin-miner-marathon-secures-additional-100-million-loan\" data-v-f87c67ca=\"\">closed a new $100 million term loan<\/a> with Silvergate Bank in July and refinanced an existing $100 million revolving line of credit.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jones","content":"PERSON"},{"type":"7.25%","content":"PERCENT"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"Matt Linghui Kong","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"CleanSpark 328 BTC","content":"ORGANIZATION"},{"type":"January 2020","content":"DATE"},{"type":"May","content":"DATE"},{"type":"FRNT Financial","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Galaxy Digital)","content":"ORGANIZATION"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"Strahinja Savic","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"Peter Wall","content":"PERSON"},{"type":"Glyn Jones","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"quarter","content":"DATE"},{"type":"Bitdeer","content":"PERSON"},{"type":"Icebreaker Finance","content":"ORGANIZATION"},{"type":"Silvergate Bank)","content":"ORGANIZATION"},{"type":"six months ago","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"Compute North","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bitdeer Group","content":"ORGANIZATION"},{"type":"Alex Appleton","content":"PERSON"},{"type":"11%","content":"PERCENT"},{"type":"CFO","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"$500 million","content":"MONEY"},{"type":"Galaxy","content":"LOCATION"},{"type":"Savic","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Jihan Wu","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}