{"summary":"&quot;I love Celo&#x27;s mobile-first global approach,&quot; Morgan Beller told The Block. &quot;It&#x27;s really like Venmo for crypto.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94012\/celo-stablecoin-morgan-beller-advisor","publishDate":"2021-02-05T17:09:19","id":11734,"type":null,"title":"Morgan Beller says stablecoin project Celo is like &#x27;Venmo for crypto&#x27;","category":["STABLECOINS"],"content":["Morgan Beller, a former co-creator of Libra — now known as Diem — has joined the stablecoin project Celo as an advisor.","Beller quit Diem last September and joined venture capital firm NFX as a general partner. In her advisory role at Celo, Beller aims to help the project on initiatives like adoption and developer strategies, she told The Block in an interview.","\"I love Celo's mobile-first global approach,\" Beller told The Block. \"It's really like Venmo for crypto.\"","Venmo is a mobile payment service owned by PayPal and allows people to transfer funds within the U.S. Celo, on the other hand, helps users share Celo dollars (cUSD), each pegged to track one U.S. dollar.","Celo is a decentralized stablecoin project focused on payments as a use case, especially for the unbanked and underbanked communities. The project was launched in March last year and helps exchange money via a mobile phone. According to <a href=\"https:\/\/www.coinbase.com\/price\/celo-dollar\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Coinbase<\/a>, the Celo Dollar possess a market capitalization of around $33 million, with roughly $104,000 in volume during the past 24 hours.","Beller's new advisory role comes as the ecosystem for stablecoins — and the <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">outstanding supply<\/a> of said coins — continues to grow. It remains an ecosystem dominated by USDT, the stablecoin issued by Tether, though stablecoins such as USDC, BUSD and DAI have expanded their <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/stablecoins\/share-of-total-stablecoin-supply\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">market share<\/a>.","The conversation around privately-issued stablecoins arguably exploded into public view when the now-renamed Libra made its public debut. Introduced in June 2019 and backed by Facebook and other firms, Diem has yet to launch, having faced significant regulatory scrutiny in the wake of its unveiling. The project has since revised its initial approach, brought in a range of traditional finance veterans to guide the association that oversees its development, and, to some extent, turned its gaze to the nascent world of central bank digital currencies, or CBDCs (Beller declined to talk about the project in the interview).","<strong data-v-f87c67ca=\"\">'Grasroots stablecoin movement'<\/strong>","The potential for stablecoins to solve real problems for people is what attracts Beller to the industry the most, Beller said. That includes people in countries where their national currencies suffer from \"tremendous inflation,\" and are a \"terrible store value,\" as well as jurisdictions in which governments can seize accounts and the money inside them, said Beller.","Beller said she sees Celo more than Venmo for crypto because beyond just sending and receiving funds, it also acts as a \"store of value.\" \"It's giving them a savings account, and it's giving them security,\" she said.","Still, most stablecoins today are used for trading arbitrage, said Beller.","\"So it's in the hands of a few people, but really big volumes, so this is like top-down. I see Celo really as the bottom-up, grassroots stablecoin movement where it's small balances by a lot of people.\"","<strong data-v-f87c67ca=\"\">Stablecoin growth and looking ahead<\/strong>","Beller also spoke to the general timing of the emergence of stablecoin platforms like Celo and the broader global context within which this growth is occurring.","\"I think that their timing was a blessing to the people who need it the most and that we're in a global pandemic, remittances are very expensive, both as far as cost and as far as time is considered,\" said Beller. \"So Celo has been helping people send remittances for less than one cent fees during the pandemic, which you know, it gives you goosebumps.\"","Looking ahead, Beller said that \"Celo has big future plans, really big plans,\" though she did not disclose specific details. In the interview, she highlighted <a href=\"https:\/\/www.theblockcrypto.com\/linked\/91851\/defi-payments-protocol-celo-digital-euro\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a new euro-pegged stablecoin<\/a> that Celo is planning to launch.","Both Diem and Celo have some common investors, like Andreessen Horowitz (a16z) and Coinbase Ventures. Beller previously worked for a16z.","When asked if NFX has invested in or has plans to invest in Celo, Beller said since NFX invests in early-stage startups, Celo is \"just outside of the investment criteria of the fund.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beller","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Celo","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Celo","content":"PERSON"},{"type":"March last year","content":"DATE"},{"type":"$104,000","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"NFX","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Diem —","content":"ORGANIZATION"},{"type":"June 2019","content":"DATE"},{"type":"Celo dollars","content":"MONEY"},{"type":"one cent","content":"MONEY"},{"type":"Morgan Beller","content":"PERSON"},{"type":"$33 million","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}