{"summary":"A CFTC commissioner is looking to counter criticism of the commission&#x27;s ability to regulate crypto markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173418\/cftcs-pham-calls-for-new-office-focused-on-retail-traders-with-eye-to-crypto-protections","publishDate":"2022-09-28T11:46:36","id":1173,"type":null,"title":"CFTC&#x27;s Pham calls for new office focused on retail traders, with eye to crypto protections","category":["THE BLOCK"],"content":["Commodity Futures Trading Commissioner Caroline Pham has proposed a new 'Office of Retail Advocate' for the CFTC, one that could factor into a broader push by leadership at the agency to more directly oversee crypto markets.&nbsp;","\"If there are areas of the financial system that are apparently outside and unregulated, such as a 'shadow' crypto financial system — shadow banking 3.0 — then the appropriate response is to bring them inside,\" said Pham, in a <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/opapham5\" data-v-f87c67ca=\"\">speech<\/a> given at an event hosted by blockchain project Corda in London yesterday, the latest stop in a digital asset outreach tour. \"And while Congress continues its work on developing legislation, there may be other ways as well to make sure the CFTC and others are exercising the full extent of their existing market oversight, supervisory, and enforcement authorities.\"","Pham cited in particular, \"the crypto crash, risk management failures, and substantial retail losses,\" as reason to launch a new office focused on retail investors at the agency.&nbsp;The CFTC commissioner also pointed to CFTC enforcements and current retail investor educational efforts as efforts to expand upon with the office.&nbsp;","The CFTC's push for more authority over crypto markets has picked up steam in Congress, particularly for legislation in the <a href=\"https:\/\/www.theblock.co\/post\/170439\/cftc-chair-asks-senators-for-more-authority-in-crypto-markets\" data-v-f87c67ca=\"\">Senate Agriculture Committee<\/a> that oversees the commission. The legislation could see a committee <a href=\"https:\/\/www.theblock.co\/post\/170481\/bill-broadening-cftcs-crypto-power-could-get-vote-soon-author-says\" data-v-f87c67ca=\"\">vote soon<\/a> to grant the commission more direct oversight power over crypto markets, though it's unclear whether that legislation could gain enough support to see a vote in the entire Senate before this current Congress ends.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Corda","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Senate Agriculture Committee","content":"ORGANIZATION"},{"type":"Caroline Pham","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CFTC","SEC"],"authors":["Kollen Post","The Block"]}