{"summary":"Twitter CEO Jack Dorsey for the first time has publicly said that bitcoin will be a &quot;big part&quot; of the company&#x27;s future.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112299\/bitcoin-big-part-twitter-future-ceo-jack-dorsey","publishDate":"2021-07-23T04:48:28","id":11735,"type":null,"title":"Bitcoin will be a &#x27;big part&#x27; of Twitter&#x27;s future, says CEO Jack Dorsey","category":["BITCOIN"],"content":["Twitter CEO Jack Dorsey has said that bitcoin will be a \"big part\" of the company's future. This is the first time Dorsey has publicly spoken in such depth about how the world's largest cryptocurrency could be integrated into Twitter's products.","On Twitter's second-quarter 2021 earnings conference call on Thursday, Dorsey <a href=\"https:\/\/investor.twitterinc.com\/events-and-presentations\/event-details\/2021\/Twitter-Second-Quarter-2021-Earnings-Conference-Call\/default.aspx\" data-v-f87c67ca=\"\">said<\/a> bitcoin is the \"best candidate\" to become the \"native currency\" of the internet and that it will mean \"people and companies can freely trade goods and services anywhere on the planet.\"","\"If the internet has a native currency, a global currency, we are able to move so much faster with products such as Super Follows, Commerce, Subscriptions, Tip Jar, and we can reach every single person on the planet because of that instead of going down a market-by-market-by-market approach,\" Dorsey explained.","\"I think this is a big part of our future. I think there is a lot of innovation above just currency to be had, especially as we think about decentralizing social media more and providing more economic incentive. So I think it's hugely important to Twitter and to Twitter shareholders that we continue to look at the space and invest aggressively in it,\" he added.","Dorsey went on to say that Twitter is not alone to think in that direction. He gave an example of Facebook and its crypto project Diem (formerly Libra), saying that \"there's an obvious need for this, and appreciation for it. And I think that an open standard that's native to the internet is the right way to go, which is why my focus and our focus eventually will be on bitcoin.\"","Bitcoin enables speed, more innovation, and opens up entirely new use cases, according to Dorsey.","Dorsey has been a staunch supporter of bitcoin. His other company, payments firm Square, already bets big on crypto. Square's Cash App, which allows users to buy and sell bitcoin, generated $3.51 billion in bitcoin revenue during the first quarter of this year and $75 million in bitcoin gross profit during the same period.","Square also holds bitcoin on its balance sheet and recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/110916\/jack-dorsey-square-bitcoin-hardware-wallet\" data-v-f87c67ca=\"\">committed<\/a> to building a bitcoin hardware wallet. Plus Square has its own crypto team, Square Crypto, which works on bitcoin development kits and other open-source code.","Bitcoin reminds Dorsey of the \"early internet,\" he said at the recent \"B-Word\" conference — <a href=\"https:\/\/www.theblockcrypto.com\/post\/112158\/elon-musk-says-spacex-owns-bitcoin-and-he-owns-ethereum-in-jack-dorsey-talk\" data-v-f87c67ca=\"\">alongside Tesla CEO Elon Musk<\/a>. \"It's deeply principled, it's weird as hell [and] it's always evolving. It just reminded me of the internet as a kid,\" Dorsey said.","Dorsey eventually hopes that bitcoin will create or help create \"world peace.\"","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Besides bitcoin, Twitter is also focused on decentralization, Dorsey said on the earnings call. Twitter is pursuing an initiative called <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Bluesky<\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\" to build up an \"open, decentralized standard for social media.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commerce","content":"ORGANIZATION"},{"type":"$75 million","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Square Crypto","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Dorsey","content":"PERSON"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"quarter 2021","content":"DATE"},{"type":"$3.51 billion","content":"MONEY"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["BITCOIN","TWITTER"],"authors":["Yogita Khatri","The Block"]}