{"summary":"Mastercard plans to unveil a fresh software solution to assist banks and card issuers in combating crypto-related fraud.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174610\/mastercard-to-combat-crypto-fraud-with-new-tool","publishDate":"2022-10-04T03:52:04","id":11737,"type":null,"title":"Mastercard to combat crypto fraud with new tool: CNBC","category":["PAYMENTS AND BANKING"],"content":["Mastercard plans to unveil a fresh software solution to assist banks and card issuers in combating crypto-related fraud, CNBC <a href=\"https:\/\/www.cnbc.com\/2022\/10\/04\/mastercard-deepens-crypto-push-with-tool-for-preventing-fraud.html\" data-v-f87c67ca=\"\">reported<\/a> today, citing the company.&nbsp;","Dubbed Crypto Secure, the new software makes use of artificial intelligence algorithms — with a reliance on on-chain data, powered by Mastercard-acquired blockchain-security startup CipherTrace — to assess crypto exchange-related risk on Mastercard's network.","Crypto Secure offers banks and card issuers a dashboard that aims to visually detail whether or not a crypto-related activity is suspicious, and to what degree. Notably, the system itself does not take action — only the card issuer may intervene.","Despite widespread declines in cryptocurrency prices, crypto-related fraud remains common — and regulators continue to scrutinize the industry. Senior U.S. regulators are asking Congress to pass multiple laws strengthening rules for the blockchain and digital asset industry. The European Union, meanwhile, has its own Markets in Crypto-Assets (MiCA) <a href=\"https:\/\/www.theblock.co\/post\/173479\/non-euro-stablecoin-transaction-cap-revived-in-mica\" data-v-f87c67ca=\"\">rules<\/a> in the global spotlight.","In late August, Rep. Raja Krishnamoorthi, D-III, <a href=\"https:\/\/www.theblock.co\/post\/166555\/congressman-calls-on-crypto-exchanges-and-regulators-to-account-for-fraud-and-scams-in-crypto\" data-v-f87c67ca=\"\">called<\/a> on U.S. federal regulators and top cryptocurrency exchanges to take stock and account for their fraud-combating policies.","Authorities' continued focus on crypto-related fraud has helped provoke similar moves from Mastercard's competitors.","Last month, fraud detection platform Sardine <a href=\"https:\/\/www.theblock.co\/post\/171156\/visa-and-consensys-back-fraud-detection-platform-sardines-52-million-raise\" data-v-f87c67ca=\"\">closed<\/a> a $51.5 million Series B round led by Andreessen Horowitz (a16z), with participation from, among others, Visa.","In similar news, web3 firewall provider Blowfish <a href=\"https:\/\/www.theblock.co\/post\/174039\/paradigm-leads-crypto-firewall-provider-blowfishs-11-8-million-raise\" data-v-f87c67ca=\"\">closed<\/a> an $11.8 million Paradigm-led funding round last week.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Raja Krishnamoorthi","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"$11.8 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"$51.5 million","content":"MONEY"},{"type":"Crypto","content":"LOCATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Adam James","The Block"]}