{"summary":"Almost 255,000 Reddit Collectible Avatars were minted on Saturday, a record that beat the more than 200,000 mints on both Aug. 30 and Aug. 31.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191984\/reddit-digital-collectible-minting-hits-all-time-high","publishDate":"2022-12-04T09:37:12","id":11732,"type":null,"title":"Reddit Collectible Avatar minting hits all-time high","category":["ART AND COLLECTIBLES"],"content":["Almost 255,000 Reddit Collectible Avatars were minted on Saturday, a new record that surpassed the more than 200,000 mints on both Aug. 30 and Aug. 31.","It brings the total number of Collectible Avatars — the term Reddit uses for its Polygon-based NFTs — in circulation to about 4.4 million, according to data from <a href=\"https:\/\/dune.com\/polygon_analytics\/reddit-collectible-avatars\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">@polygon_analytics on Dune<\/a>.&nbsp;","","","Used as avatars on Reddit’s social networking platform, the polygon-based Collectible Avatars have been lauded as a successful introduction of NFTs to mainstream consumers. Having already introduced tokenized community points last year, Reddit <a href=\"https:\/\/www.theblock.co\/post\/156297\/reddit-is-releasing-blockchain-based-avatars-just-dont-call-them-nfts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">announced<\/a> its avatar plans in July.","The company took pains to distance the offering from NFTs and crypto. The pieces sell for a fixed price rather than being auctioned and can only be paid for with fiat currencies. Its statement made no mention of NFTs.","The strategy appears to have paid off. While some of the Collectible Avatars have made their way onto secondary markets like OpenSea and had their floor prices soar, most holders acquire them through minting on Reddit.","To date, there's only been about 40,000 recorded sales despite the millions of collectibles minted. More than 3.4 million holders have just one collectible in their wallets.&nbsp;","","","Reddit partners with independent artists to release each collection. Five sets were responsible for the record mints on Saturday: The Singularity (98,000), Aww Friends (57,000), Meme Team (39,000), Reddit Cup 2022 (34,000) and Drip Squad (28,000).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"Drip Squad","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Reddit Collectible Avatars","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Collectible Avatars","content":"ORGANIZATION"},{"type":"Aug. 30","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"Aug. 31","content":"DATE"}],"hashtag":["NFT ARTISTS"],"authors":["Callan Quinn","The Block"]}