{"summary":"The European Parliament&#x27;s report for bespoke NFT policy has been scrapped as MEP Eva Kaili faces corruption charges over alleged Qatari bribes. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197369\/european-parliaments-nft-push-derailed-by-qatargate-bribery-scandal","publishDate":"2022-12-22T09:53:40","id":11736,"type":null,"title":"European Parliament&#x27;s NFT push derailed by Qatargate bribery scandal","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The Qatargate bribery scandal roiling Brussels has derailed the European Parliament’s push for legislation on NFTs.<\/span>","The Parliament's <span data-v-f87c67ca=\"\">report on NFTs was withdrawn following the arrest and criminal charge of former vice president of the European Parliament, Eva Kaili, for allegedly accepting bribes from Qatari officials,<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">according to the office of Dan Nica, an MEP <\/span><span data-v-f87c67ca=\"\">who redistributed the rest of Kaili’s files as she was <\/span><a href=\"https:\/\/www.theblock.co\/post\/194538\/european-parliament-eva-kaili\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">suspended<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;from her political group.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Before her arrest, Kaili, a member of the Parliament’s Socialists and Democrats group, was preparing to <\/span><a href=\"https:\/\/www.theblock.co\/post\/180000\/nfts-need-custom-regime-eu-parliaments-draftsperson-upcoming-report\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">lead<\/span><\/a><span data-v-f87c67ca=\"\"> a report outlining bespoke policy for NFTs. The initiative was meant to address a policy gap, as NFTs were ultimately largely left out of the comprehensive Markets in Crypto-Assets (MiCA) regulation. It would have incentivized the European Commission to follow through with a legislative proposal.<\/span>","<span data-v-f87c67ca=\"\">Kaili was one of the Parliament's leading voices on crypto and considered an ally of the industry. She is now accused of accepting Qatari bribes to illegally influence Parliament in one of the biggest corruption scandals in the institution’s recent history. A Belgian federal court on Thursday ruled that Kaili would remain in jail for another month, though she has the right to appeal the decision within the next 24 hours. If she does so a Brussels Court of Appeals hearing will take place within 15 days.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Greek politician was one of four people <\/span><a href=\"https:\/\/www.politico.eu\/article\/mep-kaili-charged-with-corruption-by-belgian-prosecutors-reports\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">charged<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;after police confiscated a stash of €600,000 ($635,000) in cash on Dec. 9. Alongside her are her partner Francesco Giorgi, a policy advisor in the EP, and his former boss Pier Antonio Panzeri, who are connected through work in an NGO called Fight Impunity. Charges against Kaili include corruption, money laundering and taking part in criminal organization.<\/span>","<span data-v-f87c67ca=\"\">Kaili admitted she asked her father to hide a suitcase full of cash before she was arrested, Politico <\/span><a href=\"https:\/\/www.politico.eu\/article\/eva-kaili-qatargate-corruption-father-european-parliament-innocence\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> on Tuesday, citing her lawyer, who alleges her innocence.<\/span>","<span data-v-f87c67ca=\"\">Kaili has had a long track record in tech since her election to the EP in 2014, having helped shape its first files on blockchain in 2016. She was the most educated MEP when it came to digital finance, a person close to the matter told The Block, wondering who will now be able to deliver on the agenda.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">More recently, she was a draftsperson on the decentralized ledger technology pilot project, which will <\/span><a href=\"http:\/\/s-up-for-tokenized-securities-pilot\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launch<\/span><\/a><span data-v-f87c67ca=\"\"> in March. <\/span>She was also active in discussions on other files under the EU’s 2020 Digital Finance Package, which includes most notably the MiCA regulation as well as a cybersecurity act <a href=\"https:\/\/www.theblock.co\/post\/185360\/eu-parliament-passes-cybersecurity-legislation-for-crypto-and-fintech-firms\" data-v-f87c67ca=\"\">implicating<\/a> fintech firms.","<span data-v-f87c67ca=\"\">Kaili would host discussions bringing crypto industry representatives into the Parliament and regularly made appearances speaking at crypto-centered conferences supporting innovation in the sector. For the EU crypto policy bubble, some sources say her absence will be felt.<\/span>","<span data-v-f87c67ca=\"\">On the other hand, Kaili’s departure from Parliament might not leave a big impact, a policy lead at a crypto exchange told The Block. There are other MEPs who will become more active, especially from the parliamentary groups which led negotiations on MiCA. However, the industry will need to find a new pro-innovation ally in the Socialists and Democrats group, they said.<\/span>","<span data-v-f87c67ca=\"\">Players in the sector are cautious about speaking out to avoid turning the story into another crypto scandal. The industry is in a precarious position following a series of collapses of big firms in the space. Most recently, the fallout of crypto exchange FTX in November led to the criminal indictment of founder Sam Bankman-Fried. The ongoing saga is a siren for regulators who are <a href=\"https:\/\/www.theblock.co\/post\/190659\/policymakers-crank-the-heat-on-new-eu-crypto-laws-in-ftx-hearing\" data-v-f87c67ca=\"\">calling<\/a> to address the matter of crypto regulation more urgently.<\/span>","<span data-v-f87c67ca=\"\">European policymakers decided that Kaili would be <\/span><a href=\"https:\/\/www.theblock.co\/post\/194538\/european-parliament-eva-kaili\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">removed<\/span><\/a><span data-v-f87c67ca=\"\"> from her vice president responsibilities in a near-unanimous vote on Dec. 13. The S&amp;D group and her affiliated Greek national party Pasok suspended her membership shortly after her arrest on Dec. 9.<\/span>","<span data-v-f87c67ca=\"\">Kaili remains a so-called non-attached member of Parliament, as she is no longer affiliated with a political group. As an elected official, she cannot be removed from office before the end of the five-year mandate in 2024.<\/span>","<span data-v-f87c67ca=\"\">According to existing procedures, non-attached members are provided with a secretariat to assist with administrative work, an EP spokesperson confirmed. It is up to national authorities to decide to terminate the mandate, unless an MEP resigns.<\/span>","<em data-v-f87c67ca=\"\">Update: story updated to clarify contents of the Digital Finance Package, and with additional details of the outcome of Kaili's Thursday pre-trial hearing.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Brussels Court of Appeals","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Dan Nica","content":"PERSON"},{"type":"Brussels","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Francesco Giorgi","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Dec. 9","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"Pasok","content":"ORGANIZATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Digital Finance Package","content":"ORGANIZATION"},{"type":"Antonio Panzeri","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Dec. 13","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Eva Kaili","content":"PERSON"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"Kaili","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"NGO","content":"ORGANIZATION"},{"type":"$635,000","content":"MONEY"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}