{"summary":"Dharma, the Ethereum-based peer-to-peer lending platform, told The Block it is sunsetting the first version of its product and building a new platform connected to Compound Protocal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/37947\/dharma-relaunches-platform-offering-fixed-rates-on-the-compound-protocol","publishDate":"2019-08-29T13:00:32","id":11733,"type":null,"title":"Dharma will launch platform: Offering New Fixed Rates Service","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Count this among the most notable business recalibrations of the decentralized finance space to date.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Dharma, the Ethereum-based peer-to-peer lending platform, told The Block it is sunsetting its existing product, and will instead focus efforts on building a new platform connected to <\/span><a href=\"https:\/\/compound.finance\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Compound<\/span><\/a><span data-v-f87c67ca=\"\">. Building on Compound is striking since Dharma and Compound were ostensibly competitors in the decentralized lending space, both competing for volumes and liquidity, somewhat akin to Prosper shutting down and then building products on LendingClub.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The pivot comes after months of slowing growth on Dharma. Loan origination fell from $6.9 million in April 2019 to $1.0 million in June, according to data from <\/span><a href=\"https:\/\/loanscan.io\/loans#borrow-volume\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Loanscan<\/span><\/a><span data-v-f87c67ca=\"\">. And despite a solid uptick in July, on August 7 the San Francisco based entity announced it would pause new deposits and loans on its platform. Meanwhile, Compound has seen originations on its platform increase from $12 million in May to $43 million in July.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Fixing the delay problem<\/b>","<span data-v-f87c67ca=\"\">Similar to version 1, Dharma “Version 2” will also enable borrowing and lending at fixed interest rates, although to start, it will only offer lending. However, rather than offering a platform built on its own proprietary smart contracts, Dharma users will tap into Compound’s liquidity pool. This enables “instant matching”, with lenders earning interest immediately on deposit.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, the lack of instant matching has been a major complaint among Dharma v1 users as lenders have often faced long wait times before being matched due to a lack of borrower demand, missing out on interest accrual. With lending rates for stablecoins currently hovering around double-digit APRs, this delay leaves money on the table for users.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Here come the swaps<\/b>","<span data-v-f87c67ca=\"\">Still, Dharma v2 is not as simple as users engaging with Compound's liquidity pool through an intuitive interface. Since Compound issues variable loans, Dharma will serve as a middle-man of sorts, issuing interest rate swaps to keep the loans issued via Compound's liquidity pool fixed at a certain interest rate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For instance, if Compound variable lending rates currently offer 15% APR, Dharma could pay a fixed rate of 10% — which is appealing for folks who want a guaranteed rate over a longer period of time— pocketing the 5% spread. Of course, there are plenty of scenarios where industry rates shift against Dharma’s favor – if Compound’s lending rates suddenly drop to 5%, Dharma will lose 5% of the loan value. <\/span>Brendan Forster, co-founder of Dharma, <span data-v-f87c67ca=\"\">told The Block that while there is no hedging mechanism in place to offset that rate risk, the firm has brought people in who have experience structuring swap instruments and is confident it can execute efficiently.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A market commentator told The Block that Dharma’s decision to move into the swap origination space may be turbulent considering the lack of industry understanding as to the main driving forces of rates and, simultaneously, the natural development of interest rate swap secondary markets, which may price out Dharma’s monopoly position.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I don’t quite understand how they can 1) price these swaps correctly 2) compete against market forces,” the person said. “It’s rather surprising that they have not learnt from lessons of Version 1, where they tried to fight the market and ultimately the market won.”&nbsp;&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Regulatory hurdles?<\/b>","<span data-v-f87c67ca=\"\">The new structure also raises questions about whether Dharma would effectively be operating as <\/span><a href=\"https:\/\/www.investopedia.com\/terms\/s\/swap-execution-facility-sef.asp\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a swap execution facility<\/span><\/a><span data-v-f87c67ca=\"\">, which would mean it would have to be registered with the Commodities Futures Trading Commission (CFTC).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Forster told The Block interpreting the new platform in this way is \"the wrong framing.\"<\/span>","<span data-v-f87c67ca=\"\">\"It's not a marketing component of the product,\" he said.\"And so we're not really selling fixed interest rate swaps to users. What we're selling to users is the ability to borrow or lend out at a fixed rate.\"<\/span>","<span data-v-f87c67ca=\"\">\"We've done the regulatory analysis required, \" he added. \"What's important here is the positioning of the product, not the underlying mechanism.\"<\/span>","<span data-v-f87c67ca=\"\">Of course, that would be up for the CFTC to decide.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Dharma hopes to eventually monetize its platform through origination fees and\/or spreads on the swaps. Unlike Version 1, it will not subsidize rates for borrowers and lenders. <\/span>","<em data-v-f87c67ca=\"\">With contributions from Matteo Leibowitz, Steven Zheng, and Matthew Yamamoto<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Compound","content":"ORGANIZATION"},{"type":"$6.9 million","content":"MONEY"},{"type":"$12 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$43 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Steven Zheng","content":"PERSON"},{"type":"Loanscan","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"Dharma","content":"ORGANIZATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"$1.0 million","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"August 7","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Brendan Forster","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"LendingClub","content":"ORGANIZATION"},{"type":"Commodities Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Dharma","content":"LOCATION"},{"type":"Matthew Yamamoto","content":"PERSON"},{"type":"April 2019","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}