{"summary":"Sen. Elizabeth Warren, D-Mass., slammed the SEC for approving spot bitcoin ETFs and called for AML rules to be urgently applied to crypto. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272158\/elizabeth-warren-slams-sec-over-decision-to-allow-spot-bitcoin-etfs-says-crypto-needs-to-follow-money-laundering-rules","publishDate":"2024-01-11T17:33:44","id":11741,"type":null,"title":"Elizabeth Warren slams SEC over decision to allow spot bitcoin ETFs, says crypto needs to follow anti-money laundering rules","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Elizabeth Warren, D-Mass., slammed the Securities and Exchange Commission for approving spot bitcoin exchange-traded funds and called for anti-money laundering rules to be urgently applied to crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Senate Banking Committee member, who historically has not been a fan of crypto, criticized the agency's move to approve 11 spot bitcoin ETFs in a Thursday <a href=\"https:\/\/twitter.com\/SenWarren\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">post<\/span><\/a> on X.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"The <\/span><span class=\"s1\" data-v-f87c67ca=\"\">@SECgov<\/span><span class=\"s3\" data-v-f87c67ca=\"\"> is wrong on the law and wrong on the policy with respect to the Bitcoin ETF decision,\" Warren said. \"If the SEC is going to let crypto burrow even deeper into our financial system, then it's more urgent than ever that crypto follow basic anti-money laundering rules.\"<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Warren has been pushing to advance her Digital Asset Anti-Money Laundering Act over the past year and has gained <a href=\"https:\/\/www.congress.gov\/bill\/118th-congress\/senate-bill\/2669\/cosponsors?s=1&amp;r=1&amp;q=%7B%22search%22%3A%22Digital+asset+anti-money+laundering+act+2023%22%7D\" data-v-f87c67ca=\"\">support<\/a> from 19 other senators, including Sen. Lindsey Graham, R-S.C. Most of the cosponsors are Democrats. The bill <\/span><span class=\"s4\" data-v-f87c67ca=\"\">aims to extend Bank Secrecy Act requirements including know-your-customer rules to miners, validators, wallet providers and others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Other crypto-friendly lawmakers have supported the SEC's move to approve spot bitcoin ETFs and said it underscored the need for their legislation.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It will provide millions of Americans with easier access to crypto assets and allow them to benefit from professional managers and more competitive fees,\" Sen. Cynthia Lummis, R-Wyo., said on Wednesday on X, while pushing for her bill with Sen. Kirsten Gillibrand, D-N.Y., to rein in crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry, R-N.C., also called for legislation in a X post on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"While legislation to provide clarity and certainty for digital assets remains necessary, the steps taken today are a significant improvement over the SEC's track record of regulation by enforcement,\" McHenry said.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mass.","content":"LOCATION"},{"type":"N.Y.","content":"LOCATION"},{"type":"Bitcoin ETF","content":"ORGANIZATION"},{"type":"Warren","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wyo.","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Lindsey Graham","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"McHenry","content":"PERSON"}],"hashtag":["SEC","SENATE BANKING COMMITTEE","SPOT BITCOIN ETF"],"authors":["Sarah Wynn","The Block"]}