{"summary":"Bitcoin miner CleanSpark funded growth and operations in july by selling 426 BTC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161020\/bitcoin-miner-cleanspark-sold-426-btc-in-july","publishDate":"2022-08-03T06:00:51","id":11746,"type":null,"title":"Bitcoin miner CleanSpark sold 426 BTC in July","category":["MINING"],"content":["Bitcoin miner CleanSpark generated roughly $8.8 million from the sale of 426 BTC&nbsp; in July, based on an average bitcoin price of $20,768. The company expects to use the proceeds to fund its own growth and operations, it said in its most recent monthly update.","CleanSpark announced the purchase of 2,861 mining rigs between June and July, leveraging favorable market conditions to secure a better deal. Last month it <a href=\"https:\/\/www.theblock.co\/post\/157567\/cleanspark-doubles-down-on-discounted-bitcoin-mining-rigs\" data-v-f87c67ca=\"\">acquired 1,061 Whatsminer M30S machines<\/a>, increasing its total hash rate by 93 petahashes per second (PH\/s).","\"We are seeing unprecedented opportunities in this market,\" said Zach Bradford, CEO of CleanSpark. \"We believe that our operational strategy focused on efficiency, up-time and execution will allow these metrics to continually improve.”","As of July 31, CleanSpark had 30,450 miners in its fleet with a total hash rate of 2.9 EH\/s.","The company mined 384 BTC in July and held 519 in its reserves by the end of the month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 31","content":"DATE"},{"type":"$8.8 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Zach Bradford","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$20,768","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}