{"summary":"CME Group issued a counter-argument to U.S. Treasury Secretary Steven Mnuchin&#x27;s comments on the potential shortening of trading hours.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59017\/cme-group-u-s-treasury-secretary-mnuchins-comments-on-shorter-trading-hours-make-no-sense","publishDate":"2020-03-17T17:12:52","id":11745,"type":null,"title":"CME Group: U.S. Treasury Secretary Mnuchin&#x27;s comments on shorter trading hours &#x27;make no sense&#x27;","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">Derivatives trading firm CME Group has issued a critical response to U.S. Treasury Secretary Steven Mnuchin’s comments on potentially shortening trading hours in the U.S., claiming that shorter hours “make no sense” and could actually increase market volatility.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At a Tuesday press conference, Mnuchin <\/span><a href=\"https:\/\/www.cnbc.com\/2020\/03\/17\/treasury-secretary-mnuchin-says-financial-markets-will-stay-open-but-could-shorten-trading-hours.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> the administration “absolutely believe[s] in keeping the markets open,” but a shortening of trading hours could take place “if that’s something they need to do.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In response to Mnuchin’s statement, CME Group chairman and CEO Terry Duffy issued a <\/span><a href=\"https:\/\/markets.businessinsider.com\/news\/stocks\/cme-group-statement-on-u-s-treasury-secretary-mnuchin-proposal-to-shorten-trading-hours-1029005784\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that argued the financial market needs to remain open at normal hours in order to properly manage risk.<\/span>","<span data-v-f87c67ca=\"\">\"We were quite surprised to hear Secretary Mnuchin say he is coordinating with the New York Stock Exchange on possible shortened trading hours, even though he has not reached out to all cash equity and futures markets including CME Group and Nasdaq,” said Duffy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Shorter hours make no sense.” he continued. “Financial markets are critical to managing risk and ensuring the resilience of the U.S. and global economies. Therefore, they must remain open, especially during this unprecedented crisis when news, information and events are changing at such a rapid pace.”<\/span>","<span data-v-f87c67ca=\"\">Highlighting the global nature of the current market turmoil, Duffy contended that shortening trading hours in the U.S. would not properly address volatility and might even have the opposite effect.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Markets are global, so shortening U.S. hours would not decrease volatility,” he said. “Rather, it could actually increase as investors turn to other venues outside the U.S. when developments occur.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The statement also outlined two measures that the administration can undertake as an alternative solution. First, it can include only the 7% and 13% circuit breaker downside limits so that equity markets can halt trading sooner in times of rapid decline. Second, it can require all exchange-traded funds (ETF) to follow the same circuit breaker rules.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Many ETFs are highly illiquid and are able to trade without being subject to the same standards as equity futures and cash markets,” the statement said. “Bringing ETFs in line with all other markets will reduce price gaps and soften market spikes at the beginning of each trading day.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Duffy","content":"PERSON"},{"type":"Mnuchin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"13%","content":"PERCENT"},{"type":"Steven Mnuchin","content":"PERSON"},{"type":"Terry Duffy","content":"PERSON"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}