{"summary":"The Ethereum bridge is AirDAO’s second cross-chain bridge as the network alreadyhas a BNB Smart Chain bridge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182643\/airdao-launches-ethereum-cross-chain-bridge-for-its-layer-1-network","publishDate":"2022-11-03T09:35:55","id":11740,"type":null,"title":"AirDAO launches Ethereum cross-chain bridge for its Layer 1 network","category":["DEFI"],"content":["AirDAO, the decentralized autonomous organization that governs the Ambrosus Layer 1 network, <a href=\"https:\/\/blog.airdao.io\/airdao-launches-its-ethereum-bridge-52ad156b4630\" data-v-f87c67ca=\"\">launched<\/a> an Ethereum bridge for its blockchain ecosystem.","It's the second cross-chain bridge enabled by AirDAO on the Ambrosus chain and will enable users to move supported crypto tokens from the Ethereum network to its own. The ecosystem already has a BNB Smart Chain bridge.","The cross-chain bridges are among a slew of new features released by AirDAO for the Ambrosus chain. The DAO has also enabled token swaps via a decentralized exchange called FirepotSwap and staking.","Cross-chain bridges have become targets of <a href=\"https:\/\/www.theblock.co\/post\/156038\/how-a-fake-job-offer-took-down-the-worlds-most-popular-crypto-game\" data-v-f87c67ca=\"\">sophisticated cyberattacks<\/a> in recent times. Hackers have stolen over $2.5 billion from cross-chain bridges in the last two years.","These incidents currently account for more than half of all DeFi-related crypto thefts, leading to debates about improving bridge security. Some of the major bridge hacks include the <a href=\"https:\/\/www.theblock.co\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\">Ronin<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/114045\/at-least-611-million-stolen-in-massive-cross-chain-hack\" data-v-f87c67ca=\"\">Poly Network<\/a> attacks that saw a combined total of over $1 billion stolen.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"last two years","content":"DATE"},{"type":"Poly Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}