{"summary":"Link to lawsuit A new 8 count federal court lawsuit in Seattle names Stox Technologies and Moshe Hogeg as defendants. Plaintiff claims that he purchased","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48681\/stox-token-sale-proceeds-used-to-buy-israeli-soccer-team-new-federal-court-lawsuit-says","publishDate":"2019-11-29T09:28:59","id":11743,"type":null,"title":"Stox token sale proceeds used to buy Israeli soccer team, new federal court lawsuit says","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">Snyder V. Stox Technologies Ltd Et Al<\/em>., D. W.D. Wash,&nbsp;3:19cv6132, 11\/25\/2019","New federal court lawsuit accuses Stox crypto token issuer of using investor money to buy soccer team and fund eponymous blockchain research lab at Israeli university,","Lawsuit is filed on a <em data-v-f87c67ca=\"\">pro se <\/em>basis (by an individual, not represented by a law firm).","Source says that several token lawsuits involving defendant Moshe Hogeg have been resolved in 7 figure settlements.","<a href=\"https:\/\/www.scribd.com\/document\/437493708\/Stox-Complaint\" data-v-f87c67ca=\"\">Link to lawsuit<\/a>","A new 8 count federal court lawsuit in Seattle names Stox Technologies and Moshe Hogeg as defendants.&nbsp;Plaintiff claims that he purchased Stox Tokens in reliance on statements made in the Stox whitepaper but was damaged to the tune of $435,000 when the Defendants flooded the market with Stox tokens, \"causing a drastic and unpredictable loss in value of the currency.\"&nbsp;","Plaintiff says that the losses weren't just to him, but that investors in the U.S. and all over the world were defrauded out of hundreds of millions of dollars.&nbsp; Plaintiff also alleges that profits from token sales by Mr. Hogeg were used \"to fund numerous expensive purchases, including $19 million to acquire land in Tel Aviv in one of the most expensive residential real estate transactions in Israel's history, $7.2 million for his acquisition of Beitar Jerusalem, one of Israel's top soccer clubs, and a $1.9 million donation to Tel Aviv University, who together have joined to launch the Hogeg Blockchain Research Institute.\"","","","The lawsuit alleges that the Stox token sale was part of an ongoing pattern of conduct and that \"in November 2019 Moshe Hogeg launched another ICO for BLOCKTV hoping to raise an additional $6Million.\"&nbsp; (NB -- BlockTV describes the sale as an IEO, not an ICO, which has led some wags to start singing \"tomayto, tomahtoe, potatyo, tomahtoe, let's call the whole thing off.\")&nbsp;","What's my take? First, congratulations to this plaintiff for having the frigging moxie to go at it alone and turn out a not terrible lawsuit. &nbsp;It's better than some of I've seen and good for you for not waiting around for someone to take your case on contingency.&nbsp; Second, though, lawyers will tell you that a person who represents themselves has a fool for a lawyer. There are some exceptions here but while there is a lot of smoke in the lawsuit -- and some fairly serious allegations about fraud and underlying criminality -- there are also difficult jurisdictional issues that will need to be resolved and, also, the causes of action are a hot mess.","","","Forget the fact that there is a typo in the caption (it's declaratory, not declatory).&nbsp; There are 8 counts here, including RICO, with underlying securities claims as the predicate wrongs. Let me just say that securities claims are hard enough after the PSLRA without having to monkey around with the elements of a RICO claim. &nbsp;Without a professional (and even with one), this case has some challenges, including biting off more than maybe you want to chew.","Challenges aside, I'm told by an off the record source with knowledge of prior lawsuits involving Hogeg and token sales that several were settled for 7 figures.&nbsp; So pleading problems aside, perhaps that is the angle here. &nbsp;It seems quite likely, regardless, that if not settled immediately, this case will be subject to some immediate motion to dismiss practice (after the Plaintiff effects overseas service of the defendants, which is also a ton of fun and takes some time).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tel Aviv University","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"11\/25\/2019","content":"DATE"},{"type":"November 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$6Million","content":"MONEY"},{"type":"Snyder V. Stox Technologies Ltd Et Al","content":"ORGANIZATION"},{"type":"$7.2 million","content":"MONEY"},{"type":"Hogeg","content":"PERSON"},{"type":"Stox Technologies","content":"ORGANIZATION"},{"type":"Moshe Hogeg","content":"PERSON"},{"type":"$19 million","content":"MONEY"},{"type":"D. W.D. Wash","content":"PERSON"},{"type":"$435,000","content":"MONEY"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Tel Aviv","content":"LOCATION"},{"type":"Beitar Jerusalem","content":"PERSON"},{"type":"Israel","content":"LOCATION"},{"type":"$1.9 million","content":"MONEY"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"Hogeg Blockchain Research Institute","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}