{"summary":"After it was revealed that Justin Sun would receive nearly 6% of the airdrop, Ether.Fi announced upcoming changes to the distribution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282962\/ether-fi-announces-airdrop-will-adjust-token-allocation-following-community-complaints","publishDate":"2024-03-16T15:09:11","id":11742,"type":null,"title":"Ether.fi announces airdrop, will adjust token allocation following community complaints","category":["CRYPTO ECOSYSTEMS"],"content":["Ether.fi, the largest liquid restaking protocol on Ethereum, has announced plans for its upcoming airdrop of governance tokens.","The token, named ETHFI, will have a total supply of 1 billion tokens, with an initial circulating supply of 115.2 million tokens. The airdrop's first stage, entitled Season 1, will release 6% of the total token supply and covers behavior up to March 15. Season 2 will release 5% of the remaining tokens and covers behavior from March 15 to an unspecified future date. The remaining tokens will be split between investors, partnerships, core contributors, and the protocol's treasury, according to the protocol's <a href=\"https:\/\/x.com\/ether_fi\/status\/1769002596201611571?s=20\" data-v-f87c67ca=\"\">tokenomics distribution<\/a>.&nbsp;","Ether.fi gave a <a href=\"https:\/\/etherfi.medium.com\/announcing-ethfi-the-ether-fi-governance-token-8cae7327763a\" data-v-f87c67ca=\"\">variety of criteria<\/a> for airdrop eligibility, including holding eETH, referring a friend to the protocol, or participating in the protocol's Early Adopter Program. \"Whale wallets\" will need to wait 3 months in order to claim their tokens, while smaller wallets will be able to claim instantly, according to Ether.fi's announcement.&nbsp;","Following the announcement, community members noticed that Justin Sun, the <a href=\"https:\/\/www.theblock.co\/post\/279423\/justin-sun-says-he-owns-1-6-billion-of-bitcoin-with-bizarre-screenshot-of-htx-wallet\" data-v-f87c67ca=\"\">controversial founder of TRON<\/a>, would apparently receive nearly 3.5 million tokens out of the initial 60 million token allocation following a deposit of 20,000 eth <a href=\"https:\/\/etherscan.io\/advanced-filter?fadd=0x22162DbBa43fE0477cdC5234E248264eC7C6EA7c&amp;tadd=0x308861A430be4cce5502d0A12724771Fc6DaF216&amp;qt=1\" data-v-f87c67ca=\"\">two days ago,<\/a> blockchain data shows.","After widespread complaints on the part of Ether.fi's community members, Ether.Fi founder Mike Silagadze announced on Discord that more tokens would be airdropped to community members, with details to follow. Silagadze also defended Sun's allocation, <a href=\"https:\/\/x.com\/ZackDAbrams\/status\/1769077175641117162?s=20\" data-v-f87c67ca=\"\">writing<\/a>, \"Just because someone came in with a huge deposit doesn't mean we are going to change the rules on them and screw them over. We appreciate Justin's support and will honor the rules of the campaign we set out.\"","Powered by the restaking protocol EigenLayer, Ether.fi has over $3 billion in total value locked, <a href=\"https:\/\/defillama.com\/protocol\/ether.fi\" data-v-f87c67ca=\"\">according<\/a> to crypto data platform DeFi Llama, a value over twice the size of its nearest competitor. Ether.Fi recently <a href=\"https:\/\/www.theblock.co\/post\/279586\/ethereum-liquid-restaking-protocol-ether-fi-closes-a-27-million-investment-round\" data-v-f87c67ca=\"\">announced<\/a> $27 million in venture funding raised, split between a SAFE and a Series A, The Block previously reported.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"1 billion","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 15","content":"DATE"},{"type":"Ether.fi","content":"ORGANIZATION"},{"type":"Mike Silagadze","content":"PERSON"},{"type":"Justin","content":"PERSON"},{"type":"DeFi Llama","content":"PERSON"}],"hashtag":["AIRDROP","PROTOCOLS","RESTAKING"],"authors":["Zack Abrams","The Block"]}