{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/6359\/lawsuit-against-craig-wright-claims-1-million-bitcoin","publishDate":"2019-01-04T09:15:06","id":11758,"type":null,"title":"Lawsuit against Craig Wright claims 1 million bitcoin","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is below.<\/em>","There are four billion reasons to read this week’s CCM. Palley looks at a Florida case that deals with the alleged misappropriation of $4 Billion USD in bitcoin, Rosario writes up a new lawsuit filed in federal court in NY that concerns a crypto investment scheme gone wrong, and finally we are lucky to have another guest post from attorney Andrés Chomczyk who gives us the 411 on a bad case for crypto from the Chilean Supreme Court. (As always, Rosario summaries are “NMR” and Palley summaries are “SDP”, and for this week our guest summary is labeled “ACH.”)","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter: <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter: <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes. (Picture credit: <a href=\"https:\/\/pixabay.com\/en\/adirondack-adirondack-chair-3814584\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Pixabay<\/a>; CC0 Creative Commons)<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Kleiman v. Wright, №18-CV-80176, 2018 U.S. Dist. LEXIS 216417 (S.D. Fla. Dec. 27, 2018) [SDP]<\/strong><\/em>","<a href=\"https:\/\/www.courtlistener.com\/docket\/6309656\/68\/kleiman-v-wright\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Link to opinion<\/a>","This opinion involves a lawsuit over ownership of more than a million bitcoin. (If like me you still think in dirty old fiat currency that’s about 4 Billion Dollars at current exchange rates, or nearly 5 percent of the total 21 million bitcoin that will ever exist). It dives deep into esoteric questions of civil procedure, the mechanics of dispute resolution between parties in different countries, and a crypto-existential question that will be the primary focus of this summary: what is bitcoin for purposes of saying that someone stole yours? Is it money? Something else? And why does it matter?","First, some background. The dispute itself goes back to the early days of bitcoin and involves a fella named Craig Wright, who made news in recent years by claiming that he was the inventor of Bitcoin and then backing off of that claim not too long after. To say that Mr. Wright is controversial in Bitcoin and cryptocurrency circles would be an understatement.","Mr. Wright is the defendant in this lawsuit. There are two plaintiffs, the estate of David Kleiman and a company called W&amp;K Defense Research LLC (“W &amp; K”). Mr. Kleiman died in April 2013. The Court describes the relationship between Mr. Wright and Mr. Kleiman and the nubbin of the dispute as follows:","<em data-v-f87c67ca=\"\">Dave and Craig met in or around 2003. Their relationship centered around their mutual interest in cyber security, digital forensics, and the future of money. Around 2008, Dave and Craig began to speak about ways to use peer-to-peer file sharing to solve issues in cryptography. The Amended Complaint alleges that for the next several years, Dave and Craig worked together in developing Bitcoin, and that through their collaboration they mined over a million bitcoins together. These bitcoins were stored in specifically identifiable bitcoin wallets, over which Craig now asserts ownership.<\/em>","The word “identifiable” is going to be key, as we will see below.","Plaintiffs allege that Dave Kleiman created intellectual property on his own and through W &amp; K and that the Estate and\/or W &amp; K own all of this IP. There is some dispute as to Mr. Wright’s role in the creation of W &amp; K.","After Mr. Kleiman died, the Plaintiffs allege that Wright “unlawfully and without permission took control of the bitcoins from the Estate and from W&amp;K once he had exclusive possession over the private keys necessary to own, move, or sell the bitcoins belonging to Dave and\/or W&amp;K.”","Because this post is called Crypto Caselaw Minute, not hour, I am going to skip over some really interesting back story involving Australian judgments and a long section of the opinion that deals with the doctrine of forum non convenience and something called international abstention. There’s also some interesting dicta on forks, noting that the dispute actually involves not just the original bitcoin but forked stuff too (e.g., bitcoin cash I am looking at you). Summarizing this stuff quickly before I get to existential issues adverted to at the outset: the court dismissed a couple of claims for statute of limitations reasons but refused to dismiss this lawsuit entirely, so this FOUR BILLION DOLLAR BITCOIN LAWSUIT will continue.","One of the claims that is being allowed to continue is a claim for conversion. Conversion is an intentional tort — specifically, it’s a cause of action that you can bring against someone if they wrongly assert dominion over your property. Say that your neighbor Satoshi wrongfully takes your deckchairs — you could sue him for conversion in order to recover the value of the chairs. That’s right — value of the chairs, not the chairs themselves. See, conversion is a legal remedy where you get damages. If you want to get the chairs themselves you’d sue for detinue or a relative of that equitable cause of action, and get the court to order the chairs themselves to be returned.","It’s usually hard to win on a claim for conversion of money because well, the stuff all looks the same — it’s fungible. In order to succeed under Florida law, the Court says that you have to show “(1) specific and identifiable money; (2) possession or an immediate right to possess that money; (3) an unauthorized act which deprives plaintiff of that money; and (4) a demand for return of the money and a refusal to do so.”","Here, the court held that plaintiffs had sufficiently alleged a claim for conversion of bitcoin under Florida law:","<em data-v-f87c67ca=\"\">Whether or not bitcoin is “money” for the purposes of a conversion claim, the Court agrees with the Plaintiffs that they have sufficiently (and with specificity) alleged a claim for conversion. In regards to the bitcoin’s specificity and identity, Plaintiffs have alleged that the bitcoin blockchain is “a giant ledger that tracks the ownership and transfer of every bitcoin in existence and that every [ bitcoin wallet and the number of bitcoin inside that particular wallet can be identified on the blockchain by referring to its “public key.” Further Plaintiffs claim that the bitcoin at issue were “stored in specifically identifiable bitcoin wallets.” Defendant also argues that Plaintiffs have failed to “allege exactly how many bitcoins Dave Kleiman supposedly owned at any time in the past.” Plaintiffs, however, have directly alleged that Defendant admitted that Dave owned at “least 300,000 of the 1,000,000+ bitcoins allegedly held in trust.” The Plaintiffs have also alleged that the bitcoins were transferred to trusts located in “Seychelles, Singapore, and [the] UK.”<\/em>","In short, the existential question of “what is bitcoin, really, man?” looks like it didn’t matter to this court. What mattered is that — money or not — it could be identified with particularity. My friend Drew Hinkes (<a href=\"https:\/\/twitter.com\/propelforward?lang=en\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@propelforward<\/a> on twitter), who happens to be a Florida lawyer, pointed out to me that on this reasoning and under Florida law even if Bitcoin is money if you can identify the UTXO’s, you can probably make out a claim for conversion. So … maybe it doesn’t matter if bitcoin is or isn’t money.","This lawsuit involves a substantial dispute and will be allowed to go forward. I’m confident we will see more caselaw and more precedent from it. And when that happens you can be sure we’ll cover here.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"W&amp;K Defense Research LLC","content":"ORGANIZATION"},{"type":"Chilean Supreme Court","content":"ORGANIZATION"},{"type":"Estate","content":"ORGANIZATION"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"S.D. Fla","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"5 percent","content":"PERCENT"},{"type":"Dec. 27, 2018","content":"DATE"},{"type":"Andrés Chomczyk","content":"PERSON"},{"type":"Craig","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"April 2013","content":"DATE"},{"type":"2003","content":"DATE"},{"type":"CC0 Creative Commons)","content":"ORGANIZATION"},{"type":"Dave","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"2018 U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Satoshi","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"W &amp; K.","content":"ORGANIZATION"},{"type":"David Kleiman","content":"PERSON"},{"type":"“Seychelles","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"Wright","content":"PERSON"},{"type":"Kleiman v. Wright","content":"PERSON"},{"type":"Kleiman","content":"PERSON"},{"type":"Dave Kleiman","content":"PERSON"},{"type":"$4 Billion","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}