{"summary":"Binance&#x27;s CEO said the industry is &quot;healthier&quot;now, but did not mince words when it came to discussing FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190013\/binances-zhao-says-industry-is-healthier-after-a-nasty-year","publishDate":"2022-11-25T13:21:14","id":11752,"type":null,"title":"Binance’s Zhao says industry is ‘healthier’ after a ‘nasty’ year","category":["EXCHANGES"],"content":["Binance CEO Chanpeng Zhao said the industry is in a \"healthier\" place after a \"nasty\" 2022, and he expects better things in 2023.","\"I would expect recovery,\" Zhao said at a Binance event in Athens. \"So, I think 2022 was a really nasty year, the last six month was like too much has happened. Now the industry is healthier.\"","He declined, however, to make any specific predictions. \"The trick for us is to monitor the industry and then whatever is trending we try to support it,\" Zhao said.","The CEO, who launched a recovery fund for troubled crypto companies in the wake of FTX's collapse, did not mince words when it came to his former competitor.","\"FTX is more like Madoff. It's lying, it's ponzi,\" Zhao said. \"Just because FTX happened, doesn't mean every other business is bad.\"&nbsp;","Binance earlier today <a href=\"https:\/\/www.theblock.co\/post\/189946\/binance-releases-proof-of-reserves-system-starting-with-bitcoin\" data-v-f87c67ca=\"\">released<\/a> its proof-of-reserves system, starting with bitcoin, in order to show that the exchange is healthy and solvent. For bitcoin, Binance has provided a snapshot of account balances and the exchange's bitcoin reserves. It claims it has 582,485 bitcoin in its reserves, while its users have a net balance of 575,742 bitcoin — giving it a margin of 6,743 bitcoin. It also provided a link for Binance users to verify their own bitcoin on the exchange.","Zhao said Binance is in a solid position and focused on growing the market rather than making money.","\"We have enough revenue today,\" he said. \"We do not try to maximize profits. We want to be sustainable.\"","He also noted that startup valuations a year ago were astronomical and have since settled back down to reasonable levels.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chanpeng Zhao","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Athens","content":"LOCATION"},{"type":"Zhao","content":"PERSON"},{"type":"Madoff","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Christiana Loureiro","The Block"]}