{"summary":"Twitter has suspended the account affiliated with the Voyager creditor committee, which has regularly posted updates for customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171488\/voyager-creditor-committee-twitter-account-suspended","publishDate":"2022-09-20T17:18:08","id":11751,"type":null,"title":"Voyager creditor committee Twitter account temporarily suspended","category":["POLICY"],"content":["As the Voyager auction closes its sixth day with no reported winner, the Twitter account tasked with keeping customers in the loop appears to have been suspended.&nbsp;","The Twitter account appeared back online later on Tuesday, with no explanation for why it had been temporarily suspended.","As of late afternoon on Tuesday, the profile page affiliated with the Committee of Unsecured Creditors, <a href=\"https:\/\/twitter.com\/VoyagerUCC\" data-v-f87c67ca=\"\">@VoyagerUCC,<\/a> contained a notice saying the account had been suspended. Jason Raznick, founder of Voyager creditor Benzinga and a member of the Committee of Unsecured Creditors said he is aware of the suspension and the committee's counsel, the law office of McDermott, Will &amp; Emery, are looking into the issue.","\"Even though the account may not be live, we are still hard at work, trying to move this process forward,\" said Raznick.","Twitter and counsel for the Voyager UCC did not immediately respond to request for comment.&nbsp;","The Voyager Unsecured Creditor Committee represents the interests of customers and creditors in the bankruptcy process. Since Voyager entered Chapter 11 proceedings in July, the group has been the main point of contact between those seeking the return of their funds and the court. The committee has held public calls with Voyager leadership, \"Ask Me Anything\" forums on Reddit and regularly tweeted updates on the case.","The committee plays a major role in the bankruptcy process, which will determine who gets paid out of the assets left from the broke company.&nbsp;","The type of proposal Voyager wants at this point in the process remains unclear.&nbsp; The company has <a href=\"https:\/\/www.theblock.co\/post\/159387\/voyager-document-says-ftx-alameda-proposal-has-misleading-or-outright-false-claims\" data-v-f87c67ca=\"\">fought<\/a> with crypto exchange FTX for publicly circulating a <a href=\"https:\/\/www.theblock.co\/post\/159209\/ftx-alameda-propose-early-liquidity-plan-for-voyager-digital-customers\" data-v-f87c67ca=\"\">proposal for the exchange to provide early liquidity to Voyager customers,<\/a> and asserting that FTX's offer was more generous than others. Counsel called the proposal a \"low ball offer\" and sought to dispel notions that FTX was a frontrunner in the bidding process.&nbsp;","Since the auction began in the offices of law firm Kirkland &amp; Ellis last week, <a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/16\/binances-attempt-to-buy-voyager-digitals-assets-complicated-by-national-security-concern-source\/\" data-v-f87c67ca=\"\">reports<\/a> have circulated that Binance is among the parties attempting to lodge a proposal and the firm has faced pushback over concerns that the U.S. government would have qualms with the transaction.&nbsp;","<em data-v-f87c67ca=\"\">Editor's Note: This piece has been updated to reflect that the @VoyagerUCC account was restored.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Benzinga","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Voyager UCC","content":"ORGANIZATION"},{"type":"Jason Raznick","content":"PERSON"},{"type":"McDermott, Will &amp; Emery","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Raznick","content":"PERSON"},{"type":"Kirkland &amp; Ellis","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Voyager Unsecured Creditor Committee","content":"ORGANIZATION"},{"type":"late afternoon","content":"TIME"},{"type":"Binance","content":"PERSON"}],"hashtag":["TWITTER"],"authors":["Aislinn Keely","The Block"]}