{"summary":"Nomura’s Laser Digital and WebN Group have unveiled Libre — a fund tokenization protocol powered by Polygon technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271230\/nomura-laser-digital-unveils-polygon-powered-libre-protocol-brevan-howard","publishDate":"2024-01-10T05:00:04","id":1175,"type":null,"title":"Nomura&#x27;s Laser Digital unveils Polygon-powered Libre protocol for Brevan Howard funds","category":["INFRASTRUCTURE"],"content":["WebN Group and Laser Digital today unveiled Libre, an institutional web3 protocol powered by Polygon technology.","Laser Digital is the crypto arm of financial services firm Nomura, while WebN Group is an incubation hub for fintech and web3 innovators, backed by Laser Digital and Brevan Howard co-founder Alan Howard.","Utilizing asset tokenization and smart contracts, Libre is designed for the regulatory-compliant issuance and management of alternative investments, according to a statement. The protocol is built using the Polygon Chain Development Kit (<a href=\"https:\/\/www.theblock.co\/post\/247873\/polygon-labs-chain-development-kit\" data-v-f87c67ca=\"\">CDK<\/a>), which enables the development of purpose-built, zero knowledge-powered Layer 2 blockchains on Ethereum.","“We are thrilled to see Libre select Polygon CDK’s scalability and security to revolutionize the alternative investments space,” Polygon founder Sandeep Nailwal said. “Libre demonstrates the immense potential of blockchain technology to unlock new opportunities for investors globally.\"","Libre founder Dr. Avtar Sehra has been working on real-world asset tokenization since 2014, first on Bitcoin, then Ethereum, having previously founded the UK FCA-licensed tokenization platform Nivaura. Additional use cases for the protocol include services such as collateralized lending and automated rebalancing of private investment portfolios.","\"While our MVP objective is to increase AUM by launching the primary issuance service and driving distributor integrations, we are also working closely with our partners and clients on our 2024 product roadmap, which includes collateralized lending and automated portfolio rebalancing — building the future of wealth APIs,\" Sehra said.","Libre is scheduled to go live in Q1 2024, with investment management firms Brevan Howard and Hamilton Lane set to become the first issuers to use the platform amid growing interest from the industry to leverage blockchain technology to enhance the ways in which alternative asset funds can be distributed and accessed.","\"We believe that tokenization has the potential to revolutionize the way investments are managed and traded, and are focused on strategically partnering with other leading firms to improve compliance and streamline access to the private markets through initiatives like Libre,” Hamilton Lane Head of Digital Assets Victor Jung said.","“The tokenization of funds allows us to offer investors a new way to access our strategies, providing them with optionality, and further develops our platform to serve client needs. It is for this reason that we have been deeply involved in Libre,” Brevan Howard Head of Strategy Natalie Smith added.","Libre is not the only project working on the tokenization of funds. In November, JPMorgan’s Onyx <a href=\"https:\/\/www.theblock.co\/post\/263109\/jpmorgan-apollo-axelar-oasis-pro-provenance-blockchain-interoperability\" data-v-f87c67ca=\"\">teamed up<\/a> with asset and wealth managers WisdomTree and Apollo, blockchain technology providers Avalanche, Oasis Pro, Provenance Blockchain and Biconomy, plus interoperability solutions LayerZero Labs and Axelar on a blockchain interoperability proof-of-concept for investment-portfolio management. The project is designed to enable fund managers to tokenize, purchase and rebalance real-world asset positions across multiple blockchains.","In the same month, ​​SC Ventures, the investment and innovation arm of Standard Chartered, <a href=\"https:\/\/www.theblock.co\/post\/263035\/standard-chartered-sc-ventures-tokenization-libeara\" data-v-f87c67ca=\"\">launched<\/a> a tokenization platform called Libeara. Last week, SGD Delta Fund, a tokenized Singapore-dollar government bond fund, received an <a href=\"https:\/\/www.theblock.co\/post\/270304\/moodys-rates-first-fund-to-use-standard-chartered-units-tokenization-platform\" data-v-f87c67ca=\"\">AA rating<\/a> from Moody's after becoming the first fund to use Libeara.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Hamilton Lane","content":"PERSON"},{"type":"Hamilton Lane Head of Digital","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"SC Ventures","content":"ORGANIZATION"},{"type":"Brevan Howard","content":"ORGANIZATION"},{"type":"Alan Howard","content":"PERSON"},{"type":"Libre","content":"LOCATION"},{"type":"WebN Group","content":"ORGANIZATION"},{"type":"Victor Jung","content":"PERSON"},{"type":"UK FCA","content":"ORGANIZATION"},{"type":"SGD","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Laser Digital","content":"ORGANIZATION"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"WebN Group and Laser Digital","content":"ORGANIZATION"},{"type":"MVP","content":"ORGANIZATION"},{"type":"Sehra","content":"PERSON"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Onyx","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Moody","content":"ORGANIZATION"},{"type":"Brevan Howard Head of Strategy Natalie Smith","content":"ORGANIZATION"},{"type":"Provenance Blockchain","content":"PERSON"},{"type":"Brevan Howard","content":"PERSON"},{"type":"Avtar Sehra","content":"PERSON"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","INVESTMENT FIRMS","POLYGON","TOKENIZATION"],"authors":["James Hunt","The Block"]}