{"summary":"Seeking 30% of gas fees related to NFT transactions, Apple blocked a version of Coinbase Wallet that let users to send them from iOS devices.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191520\/apple-disables-version-of-coinbase-wallet-over-nft-gas-fees","publishDate":"2022-12-01T13:41:14","id":11756,"type":null,"title":"Apple disables version of Coinbase Wallet over NFT gas fees","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Apple opted to block the latest version of Coinbase Wallet that would allow users to send one another NFTs, according to Coinbase. <\/span>","<span data-v-f87c67ca=\"\">The version of the app was shut down as Apple wants to take a 30% cut from gas fees for NFT transactions.<\/span>","<span data-v-f87c67ca=\"\">Apple blocked the latest version of Coinbase Wallet until a feature that allows users to send NFTs over iOS is disabled, according to the exchange.<\/span>","<span data-v-f87c67ca=\"\">“Apple’s claim is that the gas fees required to send NFTs need to be paid through their In-App Purchase system, so that they can collect 30% of the gas fee,” Coinbase said in a tweet <a href=\"https:\/\/twitter.com\/CoinbaseWallet\/status\/1598354819735031809?s=20&amp;t=NSxFIFD5aO-cFC6KAVX5Uw\" data-v-f87c67ca=\"\">thread.<\/a>&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If Apple does intend to take 30% of gas fees related to any blockchain transactions it would need to integrate a Web3 interface on its operating system, which iOS currently does not appear to support.<\/span>","<span data-v-f87c67ca=\"\">“For anyone who understands how NFTs and blockchains work, this is clearly not possible,\" Coinbase said. \"Apple’s proprietary In-App Purchase system does not support crypto so we couldn’t comply even if we tried.\"<\/span>","<span data-v-f87c67ca=\"\">“This is akin to Apple trying to take a cut of fees for every email that gets sent over open Internet protocols,” the company continued, adding that users who hold NFT wallets on an iPhone will now have a more difficult time transferring that digital asset.<\/span>","<span data-v-f87c67ca=\"\">MetaMask developer and former Apple software engineer Dan Finlay publicly condemned Apple’s decision, likening it to an Orwelian foil.<\/span>","<span data-v-f87c67ca=\"\">“Oh I'll absolutely stand in solidarity here, I assume MM and every other wallet is next. I'm ready to dump the Apple ecosystem. The 30% tax is an abuse of monopoly. @tim_cook has donned the Big Brother screen,” he tweeted.<\/span>","<span data-v-f87c67ca=\"\">Apple and Coinbase did not immediately respond to <\/span>requests for comment from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Dan Finlay","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"30%","content":"PERCENT"}],"hashtag":["COINBASE","WALLET MAKERS","WALLETS"],"authors":["Jeremy Nation","The Block"]}