{"summary":"Why did an anonymous wallet spend 1.5 BTC in order to write 9 MB of data to Bitcoin? Since the data is encrypted, we may never know.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270792\/someone-spent-66000-to-inscribe-data-onto-bitcoin-no-one-knows-what-it-says","publishDate":"2024-01-07T18:29:13","id":11759,"type":null,"title":"Someone spent $66,000 to inscribe data onto Bitcoin. No one knows what it says.","category":["CRYPTO ECOSYSTEMS"],"content":["Over the course of 332 transactions, an <a href=\"https:\/\/www.ord.io\/bc1pnp6sdnzv3cve6jptw3vkpqtek3r6fmratjgnflpqngnmp5lkxztqzwd0th\" data-v-f87c67ca=\"\">anonymous wallet<\/a> spent about 1.5 BTC, worth about $66,000 at current prices, to inscribe almost <a href=\"https:\/\/twitter.com\/ord_io\/status\/1743768753991500155\" data-v-f87c67ca=\"\">9 megabytes of encrypted data<\/a> onto the Bitcoin blockchain.&nbsp;","The most expensive transactions cost thousands of dollars each in fees, though most of the transactions were closer to $200. However, as the data remains encrypted, no one has yet been able to read the inscribed data.&nbsp;","The X account of Ordinals explorer Ord.io <a href=\"https:\/\/twitter.com\/ord_io\/status\/1743768753991500155\" data-v-f87c67ca=\"\">posted<\/a> about the inscription, leading to jokes, speculation, and Rickrolls from X users speculating on the motive behind the actions.&nbsp;","The process was enabled through the Ordinals protocol, which ascribes data to certain satoshis — the smallest unit of a Bitcoin. Ordinals are commonly used to store art directly on-chain, though all types of data can be inscribed, including encrypted text.&nbsp;","The inscription isn't the only apparently strange use of the Bitcoin blockchain recently. An anonymous wallet recently <a href=\"https:\/\/www.theblock.co\/post\/270748\/someone-sent-1-2-million-of-bitcoin-to-the-genesis-wallet-mined-by-satoshi-nakamoto\" data-v-f87c67ca=\"\">sent $1.2 million<\/a> to the Genesis wallet mined by Satoshi Nakamoto. Funds from Satoshi's wallets haven't moved since 2010, meaning the money is most likely irretrievable.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"2010","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$200","content":"MONEY"},{"type":"$1.2 million","content":"MONEY"},{"type":"$66,000","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Zack Abrams","The Block"]}