{"summary":"A group of Genesis creditors have rejected the deal agreed in February, parent company Digital Currency Group said. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228128\/genesis-creditors-reject-restructuring-plan","publishDate":"2023-04-25T08:20:22","id":11766,"type":null,"title":"Genesis creditors reject previously agreed bankruptcy restructuring plan","category":["COMPANIES"],"content":["A group of Genesis creditors rejected the restructuring deal agreed in February, throwing the months-long bankruptcy process into turmoil, parent company Digital Currency Group said.&nbsp;","\"More than two months after all parties agreed to a comprehensive settlement that was submitted by Genesis Capital to the bankruptcy court, a group of Genesis Capital's creditors have reneged and raised all new demands,\" DCG said in a tweeted <a href=\"https:\/\/twitter.com\/DCGco\/status\/1650819334372048897\" data-v-f87c67ca=\"\">statement<\/a>. \"We do not know if the hundreds of thousands of individual creditors are aware of this development, but the latest maneuver will prolong the court process.\"","The crypto lender <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">filed<\/a> for bankruptcy protection in January after failing to recover from the financial hit inflicted by last year's collapses of the hedge fund Three Arrows Capital and the crypto exchange giant FTX. The firm had halted withdrawals in November, days after FTX's demise.&nbsp;","Genesis and DCG <a href=\"https:\/\/www.theblock.co\/post\/209145\/genesis-gemini-and-dcg-reach-agreement-in-bankruptcy-court\" data-v-f87c67ca=\"\">reached<\/a> a deal with their creditors two months ago. Reports <a href=\"https:\/\/www.theblock.co\/post\/209023\/dcg-and-genesis-branches-agree-on-a-restructuring-plan-coindesk\" data-v-f87c67ca=\"\">suggested<\/a>&nbsp;the agreement included proposals to wind down the Genesis loan book and sell the company's bankrupt entities.&nbsp;","Genesis owes over $3.6 billion to its top 50 creditors, including claims from Gemini, the exchange founded by the Winklevoss twins.","\"DCG remains committed to reaching a fair outcome for all and while we look forward to a constructive mediation process, we will have to weigh any new demands against the concessions we've previously made,\" the company said in today's statement.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.6 billion","content":"MONEY"},{"type":"DCG","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"Winklevoss twins","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Andrew Rummer","The Block"]}