{"summary":"Financial services giant State Street has partnered with crypto custodian Gemini Trust for a new digital assets trial \nA State Street spokesperson told The Block that the trial will examine reporting scenarios of bitcoin and ether.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50820\/state-street-ties-up-with-gemini-trust-to-examine-reporting-process-of-bitcoin-and-ether","publishDate":"2019-12-17T07:51:32","id":1176,"type":null,"title":"State Street ties up with Gemini Trust to examine reporting process of bitcoin and ether","category":["Custody"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Financial services giant State Street has partnered with cryptocurrency custodian Gemini Trust for a new digital assets trial.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Announced Tuesday, State Street – which has over $32 trillion in client assets under custody and nearly $3 trillion in assets under management –&nbsp;<a href=\"https:\/\/newsroom.statestreet.com\/press-release\/corporate\/state-street-and-gemini-launch-digital-asset-pilot\" data-v-f87c67ca=\"\">said<\/a> the trial, “the first of its kind,” will examine reporting scenarios for digital assets. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The firm will track a reporting process for two cryptocurrencies – bitcoin (BTC) and ether (ETH) – that are held for a user in Gemini's custody service, a State Street spokesperson told The Block.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“It allows the user to consolidate the reporting of their digital assets serviced by Gemini, an independent digital asset custodian, with their traditional assets serviced by State Street,” per the announcement.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">State Street further said that the trial could be adapted to report holdings of other cryptocurrencies, such as security tokens, at some point.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“There is small, but growing demand from our clients for solutions of this type and many technical, operational, regulatory, and legal considerations to be addressed. That is why we have opted for an open model, and started a pilot with Gemini as an established, regulated player in the digital asset space,” Ralph Achkar, managing director of digital product development and innovation at State Street, said in a statement.<\/span>","“Simply put, users of this pilot will now be able to benefit from consolidated reporting with State Street; and leverage Gemini’s capabilities for holding their digital assets while State Street holds their traditional assets,\" Achkar said in a follow-up statement. \"The indirect benefit is that a large financial institutions, such as State Street in this instance, are beginning to form pilot programs that are specifically looking at how to address needs within the institutional digital assets space.”","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">State Street already <a href=\"https:\/\/gemini.com\/dollar\/\" data-v-f87c67ca=\"\">acts<\/a> as the custodian of U.S. dollars that correspond to the Gemini dollar stablecoin (GUSD). \"With trillions of dollars in assets under management, State Street will never compromise on security — and neither will we,\" said Tyler Winklevoss, CEO of Gemini in Tuesday's announcement.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">State Street is working on \"a number of proof of concepts,\" Jay Biancamano, State Street’s managing director of digital product and development, recently <a href=\"https:\/\/www.theblockcrypto.com\/daily\/44713\/state-street-the-2-7-trillion-custodian-is-quietly-diving-into-crypto-but-dont-expect-bitcoin-custody\" data-v-f87c67ca=\"\">told The Block<\/a> in a podcast episode of The Scoop. <\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">“Ones that are a bit more nascent include ideas like issuance and tokenization of existing assets, whereas the earlier POCs are more of a learning process for existing process, these latter ones are new opportunities,\" he added.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nState Street appears to have taken a new direction with its crypto and blockchain strategy. The custodian bank is <a href=\"https:\/\/www.coindesk.com\/state-street-slashes-dlt-developer-team-as-bank-rethinks-blockchain-strategy\" data-v-f87c67ca=\"\">reportedly<\/a> focusing more on use cases such as tokenizing stocks and bonds, rather than the development side of blockchain as it laid off over 100 blockchain developers earlier this month. <br data-v-f87c67ca=\"\">\n<\/span>","<i data-v-f87c67ca=\"\">This article has been edited for&nbsp;clarity.<\/i>"],"hashtag":["GEMINI"]}