{"summary":"The Bitski wallet, available on iOS and as a browser extension, is built for crypto natives and newcomers to web3 said Bitski.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213838\/a16z-backed-bitski-launches-digital-currency-wallet","publishDate":"2023-02-22T08:00:48","id":11763,"type":null,"title":"A16z backed Bitski launches digital currency wallet","category":["WEB3"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Bitski wallet, available on iOS and as a browser extension, is built for crypto natives but also for newcomers to blockchain by allowing them to onboard with an email and password, Bitski said.<\/span>","Bitski today rolls out a new wallet targeting crypto natives and newcomers alike.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Backed by major <a href=\"https:\/\/www.theblock.co\/linked\/47041\/bitski-raises-1-8m-seed-round-to-develop-crypto-wallet-infrastructure\" data-v-f87c67ca=\"\">investors<\/a> such as A16z, Galaxy Digital and Kindred Ventures,&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">Bitski brings to Ethereum users an option to set up logins via email and password, similar to services like the Wax Cloud wallet on the Wax blockchain, and Dapper wallet on Flow Blockchain. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Bitski wallet, which features both an iOS and browser extension, gives every user “a Bitski Vault Wallet and has the ability to import their existing wallets,” Bitski CEO and co-founder, Donnie Dinch, told The Block.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The vault is designed to make crypto wallets more accessible to non-crypto natives, according to Dinch.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Bitski Vault wallets are hosted in our hardware-security modules. Keys never leave hardware and all transactions are signed in hardware. This allows users to traverse web3 seamlessly without needing to become key-management experts,” Dinch said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In addition to the vault, the wallet also features self-custody support.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“When a Bitski user imports a self-custody wallet, it is securely stored on the device they’re imported on,” said Dinch.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The wallet also features a transaction simulator that Bitski said will help users to avoid being the target of phishing scams and a number of other features including a transaction feed, alerts for price changes as well as on and off chain activity, and a decentralized application browser.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dinch","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Donnie Dinch","content":"PERSON"},{"type":"Kindred Ventures","content":"ORGANIZATION"},{"type":"Bitski","content":"PERSON"},{"type":"Bitski Vault","content":"PERSON"},{"type":"Bitski Vault Wallet","content":"ORGANIZATION"}],"hashtag":["WALLETS"],"authors":["Jeremy Nation","The Block"]}