{"summary":"The Commodity Futures Trading Commission&#x27;s Caroline Pham is proposing a limited pilot program in an effort to regulate cryptocurrencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249822\/cftc-commissioner-caroline-pham-proposes-pilot-program-to-regulate-crypto","publishDate":"2023-09-07T14:35:24","id":11768,"type":null,"title":"CFTC Commissioner proposes pilot program to regulate crypto","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Commodity Futures Trading Commission’s Caroline Pham proposed a limited pilot program in an effort to regulate cryptocurrencies.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In line with our previous pilot initiatives, I am optimistic that this approach will ensure the integrity of our markets and impartial access, foster liquidity and competition, address potential conflicts and risks, and prevent fraud, abusive practices, and manipulation,\" CFTC Commissioner Pham said on Thursday during an <a href=\"https:\/\/www.cato.org\/events\/staying-ahead-curve-crypto-regulation-competitiveness\" data-v-f87c67ca=\"\">event<\/a> hosted by libertarian think tank the Cato Institute.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Pham is one of five commissioners at the agency, with Democrat Rostin Behnam as chair. Pham along, with CFTC Commissioner Summer Mersinger, were nominated by President Joe Biden last year to fill Republican seats.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The pilot program would first set up a roundtable of stakeholders, and then the agency would propose and adopt rules around registration requirements and risk management, Pham said. At the end, the agency would examine the data and then consider whether a permanent change would be made to its rules, she said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"My proposal shares the undeniable goal of helping keep the U.S. ahead of the curve—a goal I am sure we all share,\"&nbsp;Pham said on Thursday. \"As I have said before, my approach to any challenge is to get all the information, learn as much as possible, and then find pragmatic solutions, with an eye toward making policy that is informed and practical.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Pham has led multiple digital asset initiatives at the CFTC, including the creation of a Digital Asset Markets subcommittee to make recommendations around governance and risk as well as proposing a regulatory framework for digital assets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">News of the program comes as some lawmakers are working on legislation to regulate crypto, including one bill teed up for a vote in the full House of Representatives that aims to overhaul<\/span><span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;crypto market regulation in part by creating a pathway for a digital asset to transition from being a security investment to a commodity.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Caroline Pham","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Pham","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"Cato Institute","content":"ORGANIZATION"},{"type":"CFTC Commissioner Summer Mersinger","content":"ORGANIZATION"},{"type":"Digital Asset Markets","content":"ORGANIZATION"}],"hashtag":["CFTC","HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","SENATE AGRICULTURE COMMITTEE","SENATE BANKING COMMITTEE","SENATE FINANCE COMMITTEE"],"authors":["Sarah Wynn","The Block"]}