{"summary":"Near Protocol&#x27;s Illia Polosukhin says the Web3 space will see a transition from centralized exchanges to the decentralized and non-custodial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285565\/chain-abstraction-near-protocol","publishDate":"2024-03-29T03:56:41","id":11777,"type":null,"title":"Chain abstraction key to mainstream adoption of crypto, says Near Protocol co-founder","category":["CRYPTO ECOSYSTEMS"],"content":["Chain abstraction could induce the next transition of the crypto space and Web3, necessary for mainstream adoption, <span data-v-f87c67ca=\"\">Near Protocol co-founder Illia Polosukhin said <\/span>during an interview with The Block at the BUIDL Asia conference in Seoul, South Korea.","Chain abstraction involves application developers enhancing the end-user experience by defragmenting the complex technological layers of Web3. This concept abstracts blockchain away from the user experience. For example, in a blockchain network such as Near, users create and recover accounts using email addresses instead of writing down complex seed phrases.","<span data-v-f87c67ca=\"\">“The idea is that blockchains must be abstracted away from the user so they are not barriers to entry or participation,” said Polosukhin.&nbsp;<\/span>","However, there may be a few issues to consider. During a fireside chat at BUIDL, Ethereum creator Vitalik Buterin raised a potential pain point of chain abstraction: as various chains become interconnected into a larger ecosystem, there could be a systemic risk of “desensitization” to security issues.","While Polosukhin did acknowledge that end-users might become even less aware of the security risks in chain abstraction, the Web3 space is still expected to move towards more decentralized, secure systems.","<span data-v-f87c67ca=\"\">“There are sophisticated counterparties that actually provide liquidity, doing routing and all of the work that is required to understand the layout and complexities of every chain, they are the ones who care,” Polosukhin said. “They are the ones who will be pushing for decentralization, for security, and if they see that something is not, they'll just not service that.”<\/span>","Buterin himself stressed the importance of <a href=\"https:\/\/www.theblock.co\/post\/284908\/vitalik-buterin-account-abstraction\" data-v-f87c67ca=\"\">account abstraction<\/a>, which refers to the concealment of more technical details of on-chain applications for user-friendliness, yet remains heavily focused on providing both security and convenience.","On Wednesday, the Near Foundation launched <a href=\"https:\/\/www.theblock.co\/post\/284678\/near-foundation-chain-signatures\" data-v-f87c67ca=\"\">Chain Signatures<\/a>, a protocol that will allow users to sign transactions on third-party blockchains from a single Near account. Chain Signatures is live on Near’s testnet, with its mainnet launch expected by early May.","<span data-v-f87c67ca=\"\">“We’ll see a transition from centralized exchanges to more use of non-custodial, decentralized applications,” the Near founder said. “Users will have access to everything in one, you know, you’ll have multichain DEXs, lending, interacting with NFTs, and all kinds of experiences.”<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the Near co-founder said that blockchain technology can help prevent potential issues following the growth of artificial intelligence.<\/span>","<span data-v-f87c67ca=\"\">“AI will be used for malicious purposes. It’s just an eventuality, and we cannot stop that,” Polosukhin told The Block. Last year, it was <\/span><a href=\"https:\/\/en.yna.co.kr\/view\/AEN20231019000600315\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> that the U.S. government said that North Korea and other countries are looking into utilizing AI technology to write malicious software to enhance their illegal cyber activities.<\/span>","<span data-v-f87c67ca=\"\">“So what we can do, we can use cryptography and blockchains to defend and to provide some kind of content verification, content reputation system to protect us,” the Near co-founder told The Block.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Near Foundation","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"BUIDL Asia","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Near Protocol","content":"ORGANIZATION"},{"type":"Illia Polosukhin","content":"PERSON"},{"type":"Seoul","content":"LOCATION"},{"type":"Polosukhin","content":"PERSON"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE"],"authors":["Danny Park","The Block"]}