{"summary":"The Infinex platform will enable perpetual trading on the Ethereum Layer 2 network Optimism, and it will operate in tandem with Synthetix.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239654\/synthetix-is-building-a-perpetuals-trading-platform-to-rival-cexs","publishDate":"2023-07-14T11:09:56","id":11773,"type":null,"title":"Synthetix is building a perpetuals platform &#x27;Infinex&#x27; to rival CEXs","category":["CRYPTO ECOSYSTEMS"],"content":["Synthetix, a protocol for decentralized synthetic assets, is planning to launch Infinex, a perpetual contracts trading front end site, in a move to rival centralized exchanges directly.&nbsp;","The founder of Synthetix, Kain Warwick, <a href=\"https:\/\/mirror.xyz\/kain.eth\/NHmuyvkRPXB4ck7R38v_ityer-VMZAaIwLGHu1hIDtE\" data-v-f87c67ca=\"\">noted<\/a> in a blog post that Infinex wants to tackle challenges typically associated with CEXs, aiming to provide the efficiency of a centralized platform without sacrificing security. Infinex will enable trades on Optimism, the Ethereum Layer 2 network. The platform will operate alongside Synthetix, which has close to <a href=\"https:\/\/defillama.com\/protocol\/synthetix\" data-v-f87c67ca=\"\">$500 million<\/a> in deposits locked on the protocol.","\"It is time to take on centralized exchanges,\" Warwick <a href=\"https:\/\/twitter.com\/kaiynne\/status\/1679839675387891714\" data-v-f87c67ca=\"\">said<\/a> on the announcement.","Infinex will release alongside Synthetix V3, the project’s forthcoming decentralized derivatives protocol, later this year. A beta testing phase is currently in progress, and interested users can join a waiting list on the Infinex website.","The registration process on Infinex will resemble that of a centralized exchange, requiring only a username, password, and email, Warwick wrote. It will assign a unique margin address to each user upon deposit for on-chain verification — a mix of decentralized trading with certain centralized elements for user experience.","Rather than having its own native token, Infinex’s governance will be managed through the <a href=\"https:\/\/www.theblock.co\/post\/231936\/synthetix-founder-proposals\" data-v-f87c67ca=\"\">Synthetix token<\/a>. Warwick indicated that the platform plans to generate revenue through multiple mechanisms, including trading fees and fees from SNX liquidity provision.","Perpetual contracts, often referred to as \"perpetuals\" in the crypto industry, are a type of futures contract. Unlike traditional futures contracts, which carry an expiration date, perpetual contracts do not expire. These contracts are one of the most popular types of derivatives in the crypto sector. Currently, dYdX leads this niche, with over <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/dydx_perpetual\" data-v-f87c67ca=\"\">$2.2 billion<\/a> in trading volume over the past 24 hours.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$500 million","content":"MONEY"},{"type":"Warwick","content":"PERSON"},{"type":"Kain Warwick","content":"PERSON"},{"type":"Synthetix","content":"PERSON"},{"type":"Synthetix","content":"LOCATION"},{"type":"$2.2 billion","content":"MONEY"},{"type":"2023","content":"DATE"}],"hashtag":["ASSETS","DERIVATIVES","DEXS"],"authors":["Vishal Chawla","The Block"]}