{"summary":"Bitstamp is targeting women and older investors by emphasizing its reliability. \nThe exchange also hopes to expand in the US by offering “Bitstamp as a service.”","author":["Andrew Rummer","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141389\/bitstamp-sees-opportunity-in-underserved-next-wave-of-crypto-investors","publishDate":"2022-04-09T07:52:31","id":1177,"type":null,"title":"Bitstamp sees opportunity in &#x27;underserved&#x27; next wave of crypto investors","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">Bitstamp, one of the oldest crypto exchanges in the business, is pinning its future on solid customer service and reliability as it targets “underserved” audiences including women and older investors.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The exchange is pushing its “market-leading” uptime, openness with regulators and ability for users to call its customer service phone line, CEO Julian Sawyer and Robert Zagotta, head of Bitstamp’s US division, said in an interview during the Bitcoin 2022 conference in Miami this week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“A couple of years ago it was pioneers — both institutional or retail guys — and they would put up with anything to get in,” said Zagotta, who joined Bitstamp from rival Kraken last July. “But this next several waves of adoption, they have different expectations.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Luxembourg-based exchange, which was founded in 2011 and <\/span><a href=\"https:\/\/blog.bitstamp.net\/post\/bitstamp-acquired-nxmh\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">acquired<\/span><\/a><span data-v-f87c67ca=\"\"> by private equity firm NXMH in 2018, only <\/span><a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\/fiat-exchange-market-share\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">controls<\/span><\/a><span data-v-f87c67ca=\"\"> about 2% of the market for spot trading between crypto and fiat, compared with about 27% by market leader Coinbase. As it seeks to win market share, Bitstamp is keen to reach an older, more cautious demographic — and eager to highlight that it’s one of only four exchanges awarded a AA-rating by Cryptocompare.&nbsp;<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/fiat-exchange-market-share\/embed\" title=\"Fiat Exchange Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">“These people are just trying to diversify their portfolio and they're going to care more about what is AA versus somebody who's operating out of some offshore location,” Zagotta reckons.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the past year, the exchange has doubled its number of women clients and increased the average age of users from 37 to 39.<\/span>","<span data-v-f87c67ca=\"\">“Women, I think, have been underserved when it comes to the crypto world, and it just so happens that — for a variety of reasons — that's one of the fastest-growing demographics on Bitstamp,” Zagotta said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bitstamp caters to both retail and institutional clients. Still, Sawyer notes that while institutional trades account for about 80% of volume, this translates to only about 45% of revenue because they pay lower fees than retail. The company generated 54.5 million euros ($59 million) in sales in 2020, leading to a pretax profit of 20.8 million euros, according to its most recent set of accounts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As well as growing by attracting more conservative investors, Bitstamp also sees opportunities to expand by ramping up its operations in the US.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For several years the exchange has been running back-end crypto trading functions for financial services firms in Europe. The company now hopes to start offering a similar product in the US market — and has branded it “Bitstamp as a service.”<\/span>","<span data-v-f87c67ca=\"\">“There's a lot of demand from our US prospects, who are saying, ‘we want to have this capability. We're doing something else in financial services. Our customers are asking us for crypto. How do we do this to compete?’” Sawyer said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He said Bitstamp is unable to share the names of the European companies it currently serves, although future contracts they sign will allow more transparency.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Despite so many exchanges competing for market share, Zagotta said we’re not likely to see much merger-driven consolidation in the sector just yet.<\/span>","<span data-v-f87c67ca=\"\">“The level of innovation that's happening in this space right now is still just so eye-wateringly fast. And so I think the consolidation phase might get pushed out. Because there's just so many fronts open that companies and entrepreneurs are making advancements on,” he said.<\/span>"],"hashtag":["BITSTAMP"]}