{"summary":"Yesterday&#x27;s news from Japan about a major crypto exchange hack was noteworthy in a couple of ways. First, at $60M the Zaif theft makes the all-time top","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/625\/the-resilience-of-bitcoin","publishDate":"2018-09-20T17:44:31","id":11772,"type":null,"title":"The resilience of bitcoin","category":["BITCOIN"],"content":["Yesterday's news from Japan about <a href=\"https:\/\/cointelegraph.com\/news\/japanese-cryptocurrency-exchange-hacked-59-million-in-losses-reported\" data-v-f87c67ca=\"\">a major crypto exchange hack<\/a> was noteworthy in a couple of ways. First, at $60M the Zaif theft makes the all-time top five exchange hacks. Small potatoes compared to the billion in tokens stolen from Coincheck ($533M) and Mt. Gox ($460M) but significant money nevertheless. Second, what's noteworthy is how little impact the news had on the price of bitcoin.","","","You can clearly see the \"oh no!\" decline from around $6300 to trades approaching $6100. But the snapback rally to $6500 was almost instant. And perhaps more significantly, as this post was written bitcoin was actually trading&nbsp;<em data-v-f87c67ca=\"\">above<\/em> the price before news from Japan broke about the exchange hack.","Compare this result to the recent rumor about <a href=\"https:\/\/www.theblockcrypto.com\/2018\/09\/05\/not-quite-yet-the-worlds-money\/\" data-v-f87c67ca=\"\">Goldman Sachs delaying its plans for crypto trading<\/a>. That sent the bellwether crypto spiraling down without a corresponding \"relief rally\" occurring immediately. Indeed, bitcoin sits around 10% below the levels it was at just two weeks ago. But perhaps even more intriguingly than the comparison between the two news events is that a significant theft of coins was unimportant. As we discussed there at&nbsp;<em data-v-f87c67ca=\"\">The Block<\/em> recently, two Yale <a href=\"http:\/\/www.nber.org\/papers\/w24877.pdf\" data-v-f87c67ca=\"\">economists studying what moves the bitcoin price<\/a> found that hacks were among the most significant negative indicators going.&nbsp;","It's certainly possible that we are past the point where a \"mere\" $60M theft impacts the value of a $100B currency. And the Goldman moment reminds us that bitcoin&nbsp;<em data-v-f87c67ca=\"\">isn't<\/em> immune to what is perceived as significant news. But it's worth considering that the cryptocurrency has a resilience that most do not fully appreciate at this point.&nbsp;","It's reasonable to argue that interest in -- and attention around -- bitcoin was never higher than late last year as the price of one token marched to and beyond $20,000.","","","Of course, it took less than two months for 70% of that value to be erased, with bitcoin plummeting to around $6000. What happened next? In truth, a great deal. Bitcoin topped $11,000 in March and nearly broke $10,000 in May. By June, the $6000 \"floor\" had been breeched and yet July saw a 40% rise from there to $8400+. To call this period&nbsp;<em data-v-f87c67ca=\"\">stable<\/em> would wildly overstate what stability looks like in a typical currency, commodity, or security.","But for bitcoin, there's a strong case to be made that nothing in the long-term trend toward increasing value has changed much -- at least not yet. Buyers from a year ago are sitting on gains &gt;50%. Buyers from two years ago? They're up more than 900%.&nbsp;","A critic might call us out for selectively picking data that suits the narrative. But here's all of 2017:","","","The real cherry-picking would be to look just at the last two months to conclude that buying bitcoin was risky. Sure, the folks who entered the market in December are sitting on paper losses -- if they didn't time the top perfectly or trade brilliantly on the way down. But perhaps another chart will help here:","","","That's every day of 2016. Notice anything interesting? Literally 100% of buyers from that era would have made a killing had they sold&nbsp;<em data-v-f87c67ca=\"\">at any point in the last 12 months<\/em>. You want to find real investor pain? Perhaps this one-year look from August 2013 to 2014?<br data-v-f87c67ca=\"\">\n","","What's noteworthy here is that if you again take a narrow chunk of the calendar -- buyers from late November through February -- you can find real \"losers\" in the bitcoin trade. Many saw the value of their tokens fall by 1\/3 to 1\/2. And, of course, selling into those declines is a real investor phenomenon, so many&nbsp;<em data-v-f87c67ca=\"\">realized<\/em> those losses. Sticking it out in 2015 would have often been more painful.","","","And yet by the end of 2016, nearly every single buyer and \"hodler\" would have been vindicated, even those caught up in the euphoria of late 2013. As the 2017 chart above shows, continued conviction would have turned their vindication into ecstasy.","None of the above proves a thing about where bitcoin is headed from here. You have <a href=\"https:\/\/www.cnbc.com\/2018\/06\/29\/el-erian-bitcoin-is-a-buy-below-5000-is-not-a-good-idea-for-all-.html\" data-v-f87c67ca=\"\">leading economists calling it a \"buy\" below $5000<\/a>&nbsp;and other proponents <a href=\"https:\/\/www.thestreet.com\/investing\/bitcoin\/tim-draper-reiterates-250000-dollar-bitcoin-price-target-14712907\" data-v-f87c67ca=\"\">suggesting $250,000 is just four years away<\/a>. We don't do price prognostication here at&nbsp;<em data-v-f87c67ca=\"\">The Block<\/em>. But we do bring you analysis. And this one shows that while price boom-and-bust cycles are certainly part of the bitcoin story, none of them has yet provided an argument against the long term bullish case. Indeed, the real selectivity is to pull from the handful of months were buying bitcoin was a truly terrible case of bad timing.","That even those look like good entry points in hindsight -- save for the window around last December -- speaks volumes about the resilience of bitcoin against exchange hacks, bad news, and generous mistrust in the greater banking and regulatory worlds. And that's definitely something to appreciate.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 12 months","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"2016","content":"DATE"},{"type":"$100B","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$6000","content":"MONEY"},{"type":"$20,000","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"900%","content":"PERCENT"},{"type":"$11,000","content":"MONEY"},{"type":"40%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"$460M","content":"MONEY"},{"type":"$5000","content":"MONEY"},{"type":"last two months","content":"DATE"},{"type":"$250,000","content":"MONEY"},{"type":"$60M","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$533M","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"$6500","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$6300","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"late November","content":"DATE"},{"type":"$6100","content":"MONEY"},{"type":"two weeks ago","content":"DATE"},{"type":"$8400","content":"MONEY"},{"type":"August 2013","content":"DATE"}],"hashtag":[],"authors":["Mark Rogowsky","The Block"]}