{"summary":"MakerDAO’s founder announced an airdrop for Spark Protocol’s governance token — outlining the distribution of two billion SPK over 10 years.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244074\/makerdao-token-airdrop-spark","publishDate":"2023-08-10T06:01:09","id":11784,"type":null,"title":"MakerDAO unveils token airdrop proposal for Spark lending protocol","category":["GOVERNANCE"],"content":["Rune Christensen, the founder of stablecoin issuer MakerDAO, introduced a proposal to create a new governance token for the Spark lending protocol and give them out as rewards to users, referred to as a “<a href=\"https:\/\/forum.makerdao.com\/t\/sparkdao-spk-pre-farming-airdrop-general-subdao-farming-overview\/21595\" data-v-f87c67ca=\"\">pre-farming airdrop<\/a>.” Aimed at promoting long-term engagement with the platform, the proposal details the distribution of two billion Spark (SPK) tokens over ten years — a plan to incentivize continued usage of Spark Protocol.","<a href=\"https:\/\/www.theblock.co\/post\/229805\/makerdao-boosts-dai-lending-capabilities-via-spark-protocol-roll-out\" data-v-f87c67ca=\"\">Spark Protocol<\/a> is a lending protocol introduced by MakerDAO that provides DeFi loans by sourcing liquidity directly from Maker. It accepts assets such as ether, staked ether, and Dai as collateral.","Spark is expected to eventually become a subDAO, marking a significant step in MakerDAO’s <a href=\"https:\/\/forum.makerdao.com\/t\/the-5-phases-of-endgame\/20830\" data-v-f87c67ca=\"\">endgame plan.<\/a> A subDAO will be an independent decentralized autonomous organization within MakerDAO. As part of the endgame plan, several subDAOs, like Spark, are anticipated to be created — each governed by their own tokens.&nbsp;","The SubDAO tokens will be allocated to Spark borrowers, using various assets as collateral and distributed proportionately to the amounts and duration of borrowing. “We want to bootstrap a community of users and DAO participants that are aligned with the mission and potential of SparkDAO,” Christensen wrote.","The goal is to incentivize Spark’s active usage despite it offering a 5% yield — previously 8% — on Dai deposits, known as the Enhanced Dai Savings Rate, said Christensen.","The EDSR on Spark <a href=\"https:\/\/www.theblock.co\/post\/243475\/makerdao-spark-dai-vpn\" data-v-f87c67ca=\"\">increased<\/a> to 8% earlier this week, leading to significant capital inflows as users leveraged borrowing arbitrage opportunities. Users borrowed Dai at lower rates and deployed it for higher yields in EDSR. Christensen later stated that the rate would come down to 5% as Dai deposits rapidly crossed the designated threshold on deposits.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Christensen","content":"PERSON"},{"type":"8%","content":"PERCENT"},{"type":"SPK","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Rune Christensen","content":"PERSON"},{"type":"Enhanced Dai Savings Rate","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Vishal Chawla","The Block"]}