{"summary":"The police force uncovered the money laundering group in June related to an investment fraud case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260330\/taiwan-police-bust-324-2-million-usdt-money-laundering-operation","publishDate":"2023-11-01T05:53:25","id":11780,"type":null,"title":"Taiwan police bust 324.2 million USDT money laundering operation","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">Taiwan police have busted what appears to be the country’s largest crypto-related money laundering case in Taichung — involving 324.2 million USDT.<\/span>","<span data-v-f87c67ca=\"\">The police agency’s criminal investigation bureau said in a <\/span><a href=\"https:\/\/www.cib.npa.gov.tw\/ch\/app\/news\/view?module=news&amp;id=1885&amp;serno=cfc41011-5af1-4146-9bdd-19d4ff6517a2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\"> that the police force in June arrested a suspect surnamed Chiu, who allegedly processed over 324.2 million USDT to launder money involved in an investment fraud case uncovered in October 2022. The police also arrested three other suspects.<\/span>","<span data-v-f87c67ca=\"\">The police investigation showed the fraud group instructed victims to transfer their funds to dummy accounts and channel the illicit funds to overseas crypto exchanges or individual crypto traders. Chiu then allegedly obtained these cryptocurrencies and converted them into cash, <\/span><a href=\"https:\/\/udn.com\/news\/story\/7315\/7541063\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">according<\/span><\/a><span data-v-f87c67ca=\"\"> to local newspaper United Daily News.<\/span>","<span data-v-f87c67ca=\"\">During the investigation, the special task force discovered that Chiu had frequently traveled overseas, adding that the suspect may have engaged in discussions with foreign gambling and fraudulent groups. The police arrested Chiu in June at the Taoyuan International Airport when the suspect returned to the country.<\/span>","<span data-v-f87c67ca=\"\">The police have also seized several pieces of incriminating evidence, including a Lamborghini, a LEXUS LM, three branded watches, work phones and drugs.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"United Daily News","content":"ORGANIZATION"},{"type":"Taichung","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Taoyuan International Airport","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"Taiwan","content":"LOCATION"}],"hashtag":["ANTI-MONEY LAUNDERING","CRYPTO","TETHER"],"authors":["Timmy Shen","The Block"]}