{"summary":"Prosecutors pushed back against questions SBF lawyers wanted to pose to potential jurors ahead of next month’s trial.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251312\/prosecutors-dont-like-juror-questions-proposed-by-sbfs-lawyers","publishDate":"2023-09-15T16:45:42","id":11793,"type":null,"title":"Prosecutors don&#x27;t like juror questions proposed by SBF&#x27;s lawyers","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors pushed back against questions lawyers for FTX CEO Sam Bankman-Fried's want to pose to potential jurors about the so-called \"effective altruism\" movement ahead of next month's trial.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The former billionaire's lawyers <a href=\"https:\/\/www.theblock.co\/post\/250602\/sbf-lawyers-want-to-quiz-jurors-on-thoughts-about-crypto-body-language\" data-v-f87c67ca=\"\">proposed<\/a> earlier this week asking jurors about a number of topics, including the social movement centered on the supposed use of resources to help others, body language and political donations.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The questions are a \"thinly veiled attempt\" to advance a narrative that Bankman-Fried was looking to \"improve the world\" through his wealth, prosecutors argued on Friday in a <a href=\"https:\/\/ecf.nysd.uscourts.gov\/cgi-bin\/show_temp.pl?file=file0.197116762670827.pdf&amp;type=application\/pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">filing<\/span><\/a> to the <\/span><span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;U.S. District Court for the Southern District of New York.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Prior to his downfall and arrest, Bankman-Fried had been a supporter of the social movement that centered on the supposed use of resources to help others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Whether or not the defense can establish an admissible purpose for the defendant's purported philanthropic commitments, voir dire is not the appropriate forum to suggest to the jury that the defendant was simply a good guy who wanted to make the world a better place,\" prosecutors said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Voir dire refers to the process of picking jurors to serve on the jury panel in a trial.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried is currently waiting for his Oct. 3 trial in jail after prosecutors accused him of witness tampering. He <a href=\"https:\/\/www.theblock.co\/post\/236735\/judge-denies-motion-to-dismiss-most-charges-against-sam-bankman-fried\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">faces<\/span><\/a> over 100 years in prison if he is convicted of a slew of charges, including fraud, over allegations that he and other FTX executives used billions of customer assets to make their own failed investments.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Bankman-Fried's lawyers also wanted to pose questions around <\/span><span class=\"s3\" data-v-f87c67ca=\"\">ADHD, referring to attention-deficit\/hyperactivity disorder, and said it could affect Bankman-Fried's body language, eye contact and physical behavior.&nbsp;<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Prosecutors said that questioning would \"<\/span><span class=\"s1\" data-v-f87c67ca=\"\">improperly cast the defendant at the outset of the trial in a sympathetic light.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The defendant is currently taking medication for his ADHD, which should effectively manage any symptoms. Moreover, the description of the potential visible symptoms of ADHD is both vague and expansive, and invites the defendant to disrupt the trial under the guise of exhibiting symptoms of ADHD,\" the prosecutor added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors also opposed questions about political donations and lobbying. Bankman-Fried's lawyers proposed asking whether it is wrong for people to donate money to political candidates or lobbying groups to help their interest.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Prosecutors called those questions irrelevant.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Government has not suggested, and does not intend to argue, that it is improper, standing alone, to donate large amounts of money to political candidates or to do so to advance one’s interests,\" they said.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Oct. 3","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Government","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Sarah Wynn","The Block"]}