{"summary":"Bitcoin miner Riot posted $366.3 million in net loss for the second quarter and $72.9 million in revenue — down 8.7% from the previous three-month period.\nThe company got $5.7 million in power credits for curtailing energy at its Texas facility.","author":["Catarina Moura","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163787\/bitcoin-miner-riot-posts-366-3-million-net-loss-in-second-quarter","publishDate":"2022-08-16T11:13:43","id":1179,"type":null,"title":"Bitcoin miner Riot posts $366.3 million net loss in second quarter","category":["Mining"],"content":["Bitcoin miner Riot reported a net loss of $366.3 million in the second quarter, mainly due to a $349.1 goodwill impairment charge and a $99.8 million impairment charge on its bitcoin reserves.","The company made $5.7 million in power credits during those three months by selling energy back to the Texas grid, on top of the <a href=\"https:\/\/www.theblock.co\/post\/161226\/riot-mined-28-less-bitcoin-in-july-and-earned-9-5-million-in-power-credits\" data-v-f87c67ca=\"\">$9.5 million it subsequently got in July<\/a>.","\"We believe our ability to sell power back to the grid at market-driven spot prices, thereby reducing our operating costs, is integral to our overall strategy,\" the company said in a statement Monday. \"While participation in various grid demand response programs may impact our Bitcoin production, we view this as an important part of our partnership-driven approach with ERCOT.\"","Riot mined 1,395 BTC, down 0.7% from the previous quarter.","Revenue also fell by 8.7% to $72.9 million, of which $46.2 million was from mining and $9.8 million from hosting.","The company said it was negatively impacted by the decrease in bitcoin prices and increased variable mining costs but improved efficiencies by deploying a more considerable portion of new-generation hardware.","Last quarter, it completed its first 200-megawatt <a href=\"https:\/\/www.theblockcrypto.com\/news+\/157436\/bitcoin-miners-are-racing-to-deploy-cooling-systems-that-use-liquid-instead-of-air\" data-v-f87c67ca=\"\">immersion-cooled building<\/a> and moved all the miners that were hosted at Coinmint into its Wninestone facility, in Texas, in an effort to reduce operating costs.","\"We are extremely encouraged by Riot’s financial resilience and operational achievements this quarter,\" said CEO Jason Les.","The miner had a hash rate of 4.4 exahash per second (EH\/s) by the end of the quarter, jumping 2.3% in three months. It anticipates reaching 12.5 EH\/s by the first quarter of 2023, slightly down from the figure it had previously announced of 12.8 EH\/s by January.","Riot had initially scheduled its second-quarter earnings call for last Tuesday, stating in a U.S. Securities and Exchange Commission <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/0001167419\/000107997322000946\/riot_nt10q.htm\" data-v-f87c67ca=\"\">(SEC) file<\/a> that it needed more time to review its financials, citing the \"complexity of analyzing the impact of various global macroeconomic and geopolitical factors.\""],"hashtag":[]}