{"summary":"Jack Liu, a senior director at Circle, is leaving the $3 billion crypto finance company, he confirmed to The Block. The former investment banker said he&#x27;s","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/15833\/circles-managing-director-in-asia-leaves-firm-to-focus-on-bitcoins-survival","publishDate":"2019-03-14T10:10:30","id":11790,"type":null,"title":"Circle&#x27;s managing director in Asia leaves firm to focus on Bitcoin SV&#x27;s survival","category":["PEOPLE"],"content":["Jack Liu, a senior director at Circle, is leaving the $3 billion crypto finance company, he confirmed to The Block.","The former investment banker said he's always been motivated in his career to help \"Satoshi's vision\" come to fruition.","\"I've been a long-time veteran of this industry, and I didn't come to it by accident...Circle was a great learning ground.&nbsp;But I'm all about innovation...I want to step into the open and take a more direct approach and increase the number of transactions on the blockchain. I feel a sense of urgency right now,\" he said. \"I don't want to be 50 when it starts working.\"","He even skipped a bonus he'd have claimed in a few months. \"I just couldn't wait any longer.\"","While at Circle, Liu helped the firm develop a 24-hour trading service operating out of Asia. He also helped build the support-product for the trading of Bitcoin&nbsp;Satoshi Vision<em data-v-f87c67ca=\"\"> (<\/em>SV)&nbsp;at Poloniex, which Circle had reportedly acquired for $400 million&nbsp;before he joined.","His next move remains obscure but will involve helping build the&nbsp;<a href=\"https:\/\/bico.media\/bae922ee7979427b614e2d200886281a837c75b68ded0731450843e7752babbf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-v-f87c67ca=\"\">Bitcoin SV blockchain<\/a> -&nbsp; a fork extension of the original Bitcoin. He's a big believer in the coin and its scaling potential - something he's deeply concerned about.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jack Liu","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"Bitcoin&nbsp;Satoshi Vision","content":"ORGANIZATION"},{"type":"Poloniex","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Satoshi","content":"PERSON"},{"type":"Asia","content":"LOCATION"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}