{"summary":"The service will go live for select U.S. based PayPal users, allowing them to log into the app from MetaMask to purchase or transfer ETH.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195046\/metamask-and-paypal-join-forces-to-offer-crypto-onramp-to-select-users","publishDate":"2022-12-14T14:29:49","id":11798,"type":null,"title":"MetaMask and PayPal join forces to offer crypto onramp to select users","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">MetaMask and PayPal are joining forces to offer an ETH onramp to the web3 application, ConsenSys <a href=\"https:\/\/consensys.net\/blog\/press-release\/consensys-teams-with-paypal-for-a-new-way-to-buy-crypto-in-metamask\/\" data-v-f87c67ca=\"\">announced<\/a> today.<\/span>","“Buying crypto is riddled with friction, and there isn't a one-size-fits-all solution for our global user base. So we're working with several companies to make the process easier and safer for users,” a ConsenSys spokesperson told The Block.","<span data-v-f87c67ca=\"\">The integration represents the first between PayPal and a web3 wallet, and will be initially rolled out to select U.S.-based PayPal users, according to ConsenSys. From within the MetaMask app, users will be able to log directly into PayPal and buy ETH, or send existing ETH reserves on their PayPal account directly to their MetaMask wallet.<\/span>","“As the leading self-custodial wallet, MetaMask acts as a digital authority manager and portal for web3, providing users with secure access to their data and online assets. With the addition of PayPal, MetaMask is expanding its payment options to serve its users better and support the broader web3 ecosystem,”ConsenSys said.","<span data-v-f87c67ca=\"\">As it expands access to crypto services, PayPal continues to <\/span><a href=\"https:\/\/www.theblock.co\/post\/193459\/paypal-expands-crypto-services-to-luxembourg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">branch out<\/span><\/a><span data-v-f87c67ca=\"\"> into additional regions. Earlier this month, the payment provider introduced crypto services in Luxembourg, extending account support to allow customers to buy, hold or trade Bitcoin, Ethereum, Litecoin and Bitcoin Cash.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Litecoin","content":"PERSON"},{"type":"MetaMask","content":"ORGANIZATION"},{"type":"Luxembourg","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["WALLETS"],"authors":["Jeremy Nation","The Block"]}