{"summary":"For several days, those buying WAX tokens on the MoonPay app were not receiving them in their wallets.\nThe problems were caused by MoonPay’s liquidity partner Bittrex Global, which suffered from a technical issue.","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106100\/wax-token-investors-spend-days-in-limbo-after-technical-glitch","publishDate":"2021-05-26T09:43:42","id":118,"type":null,"title":"WAX token investors on MoonPay spend days in limbo after technical glitch","category":["Exchanges"],"content":["Buyers of WAX (WAXP) tokens through the crypto payments app MoonPay have finally seen their funds come through, after several days of not knowing what had happened to their money.","From May 22, customers who had tried to purchase WAX through the MoonPay app had been experiencing delays receiving their tokens. This led to <a href=\"https:\/\/uk.trustpilot.com\/review\/moonpay.com\" data-v-f87c67ca=\"\">a spate of negative reviews<\/a> on Trustpilot for the otherwise well-rated MoonPay, with customers complaining about “waiting for days” for their crypto to come through.","During that time, the price of the cryptocurrency fell from around $0.18 to around $0.11, before recovering to its current level of $0.15, <a href=\"https:\/\/coinmarketcap.com\/currencies\/wax\/\" data-v-f87c67ca=\"\">according to CoinMarketCap<\/a>. WAX is the native currency of the non-fungible token (NFT) marketplace Worldwide Asset eXchange. It has a market capitalization of roughly $238 million.","A spokesperson for MoonPay told The Block on May 25 that the delay was the result of a liquidity partner suspending WAX withdrawals. At that time, the spokesperson said that it had been in contact with all those impacted and, while the issues were ongoing, the company would be refunding customers out of its own pocket. Since the issues have been resolved, users are finding that their purchase orders have now been fulfilled.","People familiar with the matter told The Block that the liquidity provider in question is Bittrex Global, an offshoot of the Seattle-based Bittrex, with offices in Liechtenstein and Bermuda. The two Bittrex exchanges are separate and serve different customers, but share owners and are built on similar technology.","“Bittrex Global supports over 250 digital assets with varying code structures. At times, there can be technical issues which may lead to certain wallets being disabled as we assess network stability and prioritize the safety of our users’ funds,” said Stephen Stonberg, CEO of Bittrex Global, in an emailed statement.","Stonberg explained that the Bittrex Global team worked with Worldwide Asset eXchange to work out a solution. He said the issue has now been resolved and the wallet has been re-enabled.","Launched in 2019, MoonPay is an app that helps customers buy and sell more than 80 different cryptocurrencies in over 160 countries. In March, the company hired former Coinbase UK CEO Zeeshan Feroz <a href=\"https:\/\/www.theblockcrypto.com\/post\/97884\/ex-coinbase-chief-feroz-moonpay\" data-v-f87c67ca=\"\">as its chief growth officer<\/a>.","MoonPay’s focus is building on-and-off-ramps for converting fiat currencies into crypto and vice versa. The company has raised no external investment to date, but announced in March that it had increased its revenues by 3,000% in the 12 months up to that date (without disclosing an exact figure)."],"hashtag":[]}