{"summary":"Babylon, a Bitcoin staking protocol under development since 2022, has launched its first testnet to the public.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279515\/bitcoin-babylon-testnet-nft-passes","publishDate":"2024-02-28T09:00:03","id":11808,"type":null,"title":"Bitcoin staking protocol Babylon launches testnet, rewarding NFT passes","category":["CRYPTO ECOSYSTEMS"],"content":["Babylon, a Bitcoin staking protocol under development since 2022, has launched its testnet to the public.","The testnet is built on BTC Signet, a test network for Bitcoin, so no real bitcoin is at stake, Babylon said Wednesday.","This is Babylon's first testnet of its staking protocol. \"We will have multiple steps ahead of mainnet,\" Babylon co-founder David Tse told The Block. \"Some of these steps will enable users to lock real bitcoin and get staking points, including during post-audit and incentivized testnet,\" he said.","The post-audit testnets are expected to launch between May and June, with the mainnet slated for late 2024, Tse added.","To take part in Babylon's testnet, users will need to download browser extensions of OKX and Keplr wallets and obtain Signet bitcoins through Signet Faucet and Babylon (BBN) testnet tokens through its Discord faucet channel, according to <a href=\"https:\/\/pioneers.babylonchain.io\/\" data-v-f87c67ca=\"\">information<\/a> on Babylon's website.","Early stakers on Babylon's testnet will be rewarded with a \"bitcoin pioneer pass NFT.\" The claim period for the pass is open from Feb. 28 to March 5, and it has a limited supply, per the website. The pass will also <a href=\"https:\/\/medium.com\/babylonchain-io\/join-the-bitcoin-staking-revolution-5558ad66f5ef\" data-v-f87c67ca=\"\">grant<\/a> access to some \"exclusive\" unspecified features.","\"This testnet launch provides a practical demonstration of how bitcoin can be staked to secure PoS [proof-of-stake] chains,\" Jehan Tremback, from the Cosmos Hub team at Informal Systems, said in a statement. \"We are following it with great interest, and we can't wait to integrate Babylon into the products that we build.\"","Babylon is already in the process of supporting the Cosmos Hub ecosystem, as The Block <a href=\"https:\/\/www.theblock.co\/post\/215662\/babylon-to-bring-bitcoin-security-to-chains-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">reported<\/a> previously. The Babylon protocol will help BTC become a staking asset on PoS networks, using its security to make PoS chains safer. Currently, PoS chains rely on their native tokens for security, which can be expensive, especially for newer chains that often need to offer high staking rewards to attract capital. With Babylon, users will eventually be able to stake their real bitcoins on PoS and earn rewards.","Babylon is backed by high-profile investors, including <a href=\"https:\/\/www.theblock.co\/post\/279344\/binance-labs-bitcoin-staking-protocol-babylon\" data-v-f87c67ca=\"\">Binance Labs<\/a>, Polygon Ventures, OKX Ventures and Polychain Capital. The project has <a href=\"https:\/\/www.theblock.co\/post\/266518\/bitcoin-staking-babylon-series-a\" data-v-f87c67ca=\"\">raised<\/a> over $26.8 million in total funding to date.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"BTC Signet","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Signet","content":"ORGANIZATION"},{"type":"Signet Faucet","content":"ORGANIZATION"},{"type":"Feb. 28","content":"DATE"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Babylon","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"March 5","content":"DATE"},{"type":"David Tse","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Keplr","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Informal Systems","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Jehan Tremback","content":"PERSON"},{"type":"$26.8 million","content":"MONEY"},{"type":"Babylon","content":"LOCATION"}],"hashtag":["BITCOIN","STAKING FIRMS","UTILITY NFT"],"authors":["Yogita Khatri","The Block"]}