{"summary":"South Korea&#x27;s Bank of Korea is set to launch a pilot program to test a &quot;digital won&quot; with 100,000 citizens in 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264501\/south-korea-to-launch-digital-currency-pilot-with-100000-citizens","publishDate":"2023-11-23T08:13:51","id":11806,"type":null,"title":"South Korea set to launch digital currency pilot with 100,000 citizens: report","category":["INTERNATIONAL POLICYMAKING"],"content":["South Korea’s Bank of Korea (BOK) is set to launch a central bank digital currency (CBDC) pilot program involving 100,000 citizens next year in collaboration with the country’s Financial Services Commission (FSC) and Financial Supervisory Service (FSS).","The scheduled launch follows a meeting today between BOK Governor Rhee Chang-yong and Agustin Carstens, General Manager of the Bank for International Settlements (BIS) — the bank for central banks, <a href=\"https:\/\/www.koreatimes.co.kr\/www\/nation\/2023\/11\/602_363810.html\" data-v-f87c67ca=\"\">according<\/a> to The Korea Times.","Carstens referred to the CBDC as a “digital won,” praising the central bank in its efforts to embrace a future monetary system.","The latest development follows plans <a href=\"https:\/\/www.theblock.co\/post\/254665\/bank-of-korea-announces-plan-to-test-wholesale-cbdc\" data-v-f87c67ca=\"\">announced<\/a> by the BOK in October to begin wholesale real-world CBDC experiments in partnership with the BIS and other institutions.","Some 100,000 citizens will participate in the pilot program, enabling them to purchase goods with “deposit tokens” issued by commercial banks in the form of a CDBC, The Korean Times reported, comparing the functionality as similar to using vouchers at a store.","The participants will be chosen by selected commercial banks and recruited between September and October next year, ahead of a three-month trial project — restricted to designated payment purposes only.","\"Following consultations with relevant organizations and a review of related laws, the pilot project will be conducted first in the fourth quarter of 2024. The possibility of conducting separate pilots will be considered as well if banks propose new individual projects,\" a BOK official said.","The BOK suggests digital currencies could effectively tackle various issues prevalent in current voucher systems, including those used for special grants during the COVID-19 pandemic and government-provided childcare, helping to alleviate high transaction fees, delayed settlement times and the risk of fraudulent activities.","Additionally, the BOK plans to conduct technological experiments, including integrating the CBDC into a simulation system for carbon emissions trading, to test the feasibility of the new financial product.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Agustin Carstens","content":"PERSON"},{"type":"’s Financial Services Commission (FSC","content":"ORGANIZATION"},{"type":"Rhee Chang","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"FSS","content":"ORGANIZATION"},{"type":"19","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Supervisory Service","content":"ORGANIZATION"},{"type":"The Korea Times","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"the fourth quarter of 2024","content":"DATE"},{"type":"General Manager of the Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"South Korea’s Bank of Korea","content":"LOCATION"},{"type":"BOK","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["TRADFI BANKS"],"authors":["James Hunt","The Block"]}