{"summary":"Kevin O’Leary explains why WonderFi, a DeFi project he backs, is acquiring Canadian crypto exchange Bitbuy for $162 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129232\/why-defi-platform-wonderfi-is-acquiring-crypto-exchange-bitbuy","publishDate":"2022-01-04T17:58:59","id":11816,"type":null,"title":"Why DeFi platform WonderFi is acquiring Bitbuy","category":["CRYPTOCURRENCY"],"content":["WonderFi Technologies, a Vancouver-based decentralized finance (DeFi) platform, announced today that it will acquire Toronto-based crypto exchange Bitbuy for around $206 million CAD ($162 million USD) in cash and shares.","The deal establishes WonderFi, backed by venture capitalist Kevin O’Leary, as Canada’s largest publicly traded end-to-end consumer platform for crypto and DeFi. It's also a bet on the regulatory environment in Canada — and reflects a global strategy of seeking out crypto-friendly regulators, according to O'Leary.","“I’m investing in a geography that has a progressive regulator, and a company that wants to grow beyond just the Canadian borders,\" he said in an interview with The Block, noting that Canada was&nbsp;the first country \"to provide ETFs, with the underlying being bitcoin or ethereum.\"","WonderFi plans to grow globally in jurisdictions with similarly \"progressive\" regulations while waiting out the regulators in the US, said O’Leary. \"There are different jurisdictions and different geographies that are far more progressive and they can offer their products and services,\" he said.&nbsp;","Beyond the policy-related considerations, “Bitbuy offers almost 400,000 users and significant revenue,” Ben Samaroo, WonderFi co-founder and CEO, told The Block.&nbsp;","Bitbuy <a href=\"https:\/\/www.theblockcrypto.com\/linked\/125944\/canadian-crypto-exchange-bitbuy-secures-regulatory-approval-as-marketplace-and-investment-dealer\" data-v-f87c67ca=\"\">became<\/a> Canada’s first regulated crypto marketplace in November 2021, with more than $4.4 billion in transactions through the platform. Between September 2020 and September 2021, the company generated more than $31 million in revenue.","“I’m really interested in finding the best engineering teams and betting on them, and certainly when you look at the execution skills of WonderFi’s team and what has been created by Bitbuy, these are cutting edge teams,” said O’Leary.","WonderFi plans&nbsp;to acquire more companies in 2022, said Samaroo. “We’re really going to continue this aggressive growth through organically growing our products and then rolling up companies we see with great management teams, great technology, and that can expand our userbase more quickly.”","The acquisition is expected to close in the first quarter of 2022.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kevin O’Leary","content":"PERSON"},{"type":"Canada","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"September 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"$162 million","content":"MONEY"},{"type":"Samaroo","content":"PERSON"},{"type":"$31 million","content":"MONEY"},{"type":"the first quarter of 2022","content":"DATE"},{"type":"O'Leary","content":"PERSON"},{"type":"Toronto","content":"LOCATION"},{"type":"Vancouver","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Ben Samaroo","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"$206 million","content":"MONEY"},{"type":"$4.4 billion","content":"MONEY"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}