{"summary":"Proximity Labs, along with three decentralized exchanges on the Near Protocol blockchain — Orderly Network, Spin, and Tonic — announced a $10 million developer fund.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189743\/proximity-labs-unveils-10-million-developer-fund-for-trading-protocols-on-near","publishDate":"2022-11-24T10:00:44","id":11812,"type":null,"title":"Proximity Labs unveils $10 million developer fund for trading protocols on Near","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Blockchain research and development firm Proximity Labs and three decentralized exchanges on the Near Protocol blockchain — Orderly Network, Spin, and Tonic — have announced a $10 million developer fund.<\/span>","<span data-v-f87c67ca=\"\">The fund will provide grants and investments to new developer teams that build on top of Orderly, Spin, or Tonic, which are decentralized trading protocols that rely on virtual order books. These projects offer trading experience akin to centralized exchanges, using the Near blockchain as the settlement layer. New projects can plug into these protocols and use the liquidity they offer for their own tools, such as decentralized exchange aggregators.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The protocols raised funds and deployed on Near in quick succession earlier this year. Orderly Network raised<\/span> <a href=\"https:\/\/www.theblock.co\/linked\/150730\/orderly-bags-20-million-raise-in-boost-for-defi-protocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$20 million<\/span><\/a><span data-v-f87c67ca=\"\"> in June. Spin, which runs a perpetual trading exchange on Near, raised $3.5 million in February. In April, Tonic raised<\/span> <a href=\"https:\/\/www.prnewswire.com\/news-releases\/tonic-raises-5-million-to-build-a-defi-platform-on-near-301532690.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$5 million<\/span><\/a><span data-v-f87c67ca=\"\"> prior to its launch.<\/span>","<span data-v-f87c67ca=\"\">Proximity Labs said the $10 million fund will derive from the treasuries of the four contributors. In addition to capital in the form of grants and investments, Proximity will also offer advisory services and developer support, it added.<\/span>","<span data-v-f87c67ca=\"\">Kendall Cole, Director at Proximity Labs, said the fund is aimed at further strengthening the decentralized trading ecosystem on Near in light of the fall of centralized exchange giant FTX.<\/span>","<span data-v-f87c67ca=\"\">\"At Proximity, we believe the recent events highlight the necessity of a robust and highly performant orderbook DEX economy for a truly decentralized future. This $10 million fund encourages talented teams from any ecosystem to build on Near,\" Cole said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"Cole","content":"PERSON"},{"type":"Kendall Cole","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Proximity Labs","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}