{"summary":"Bankrupt firm Voyager claimed that a recent proposal from FTX Trading and Alameda had &quot;misleading or outright false claims.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159387\/voyager-document-says-ftx-alameda-proposal-has-misleading-or-outright-false-claims","publishDate":"2022-07-24T22:47:53","id":11813,"type":null,"title":"Voyager filing says FTX, Alameda proposal has &#x27;misleading or outright false claims&#x27;","category":["EXCHANGES"],"content":["In legal documents filed Sunday, Voyager representatives described a <a href=\"https:\/\/www.theblock.co\/post\/159209\/ftx-alameda-propose-early-liquidity-plan-for-voyager-digital-customers\" data-v-f87c67ca=\"\">proposal by crypto exchange FTX and sister firm Alameda<\/a> to offer liquidity to Voyager's beleaguered customers as \"misleading or outright false.\"","In the filing, bankruptcy lawyers from Kirkland &amp; Ellis LLP said the proposal was a \"low-ball bid dressed up as a white knight rescue.\"","\"By making its Proposal publicly in a press release laden with misleading or outright false claims, AlamedaFTX violated many obligations to the Debtors and the Bankruptcy Court,\" the document said. \"Voyager reserves all rights and remedies against AlamedaFTX for its clear and intentional subversion of the bankruptcy process.\"","In response to the filing, FTX's CEO Sam Bankman-Fried defended the proposal, arguing that it is trying to offer Voyager customers with an opportunity to access the funds locked up in Voyager as it wades through complex bankruptcy proceedings. Of course, FTX stands to benefit as the deal requires customers to open up an account with FTX.&nbsp;","Still, FTX's Bankman-Fried said Voyager's retort represents the self-interest of its legal advisers, whom stand to benefit from a drawn-out process.&nbsp;","\"To clarify: our offer would give Voyager customers back 100% of the remaining assets that Voyager has, including claims on anything recovered in the future,\" the billionaire said in a tweet.","In a message to The Block, FTX's Ramnik Arora said that its proposal is \"simple.\"","\"We're buying the estate assets at FMV and distributing it to the customers.\"","Arora continued:","\"So imagine, if the estate had 10ETH and you had deposited 1ETH. You basically should have 10% of the recovery. However, the way bankruptcy works, you can never get more than your claims (denominated in USD). So if this whole process took 5 years, and ETH ripped to $10k, you'd still only get a maximum of $1150.\"","Bankman-Fried's Alameda and Voyager are navigating the market following the blow up of hedge fund Three Arrows Capital, which has served as a headwind for firms across the market. Three Arrows defaulted on a loan from Voyager worth more than $670 million.&nbsp;","Alameda, which was founded by Bankman-Fried, has borrowed $376.8 million in crypto from Voyager. Voyager in turn took out a $75 million loan from Alameda to manage its liquidity, <a href=\"https:\/\/www.wsj.com\/articles\/in-voyager-bankruptcy-crypto-trading-firm-alameda-is-creditor-shareholder-and-borrower-11657186200\" data-v-f87c67ca=\"\">according to the Wall Street Journal<\/a>.&nbsp;","Voyager further claimed that the offer \"transfers significant value to AlamedaFTX, and completely eliminates the value of assets that are of no interest to AlamedaFTX.\"&nbsp;","The firm laid out a series of arguments as to why the proposal \"harms customers\" but \"benefits AlamedaFTX.\" For one, it believes that it would hinder the competitive process and therefore undermine efforts to maximize value.","The firm also argued that it ignores the tax consequences of converting and paying cryptocurrency claims in US dollars and would \"effectively eliminate the VGX token\" resulting in the loss of over $100 million in value.","Voyager said that it will consider \"any serious proposal\" that is better for customers than its own stand-alone plan.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Voyager","content":"LOCATION"},{"type":"FMV","content":"ORGANIZATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"$670 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Kirkland &amp; Ellis LLP","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"$75 million","content":"MONEY"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"$1150","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Ramnik Arora","content":"PERSON"},{"type":"$376.8 million","content":"MONEY"},{"type":"$10k","content":"MONEY"}],"hashtag":["FTX"],"authors":["Catarina Moura","Frank Chaparro","The Block"]}