{"summary":"The Sky Mavis chief moved the funds as part of efforts to shore up the company’s funds in the wake of the $540 million Ronin bridge hack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160128\/sky-mavis-ceo-moved-funds-before-disclosing-540-million-hack-bloomberg","publishDate":"2022-07-28T14:56:32","id":11822,"type":null,"title":"Sky Mavis CEO moved funds before disclosing $540 million hack: Bloomberg","category":["HACKS"],"content":["Trung Nguyen, co-founder and CEO of Sky Mavis: the studio behind the Axie Infinity blockchain game, moved about $3 million in crypto tokens before the company disclosed details of a $540 million, Bloomberg has <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-07-28\/axie-ceo-moved-axs-tokens-to-binance-before-disclosing-ronin-hack\" data-v-f87c67ca=\"\">reported<\/a>.","According to Bloomberg, Nguyen moved the funds as part of effort to salvage the company’s funds in the wake of the attack. These fund transfers were made before Axie went public with the information about the hack.","Kalie Moore, a Sky Mavis spokesperson said this was necessary to prevent short-sellers from frontrunning the sale of tokens once the hack became public knowledge.","Nguyen’s fund movements are part of a raft of crypto transfers from Axie-linked wallets tracked by a pseudonymous Axie user called Asobs. These wallets all moved funds off the Ronin sidechain to centralized exchanges like Binance after the hack occurred. However, only the one identified to be by the Sky Mavis CEO has been confirmed by the company, according to the Bloomberg report.","The hack <a href=\"https:\/\/www.theblock.co\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\">occurred in March<\/a> and saw the attackers compromise five out of the nine validator keys on the project’s Ronin sidechain. The hacker then used these keys to siphon some $540 million worth of crypto from the project.","<a href=\"https:\/\/www.theblock.co\/post\/156038\/how-a-fake-job-offer-took-down-the-worlds-most-popular-crypto-game\" data-v-f87c67ca=\"\">The Block has since revealed<\/a> that a fake job advert was used as the attack vector in the exploit.","Sky Mavis later raised funds to compensate for the loss of funds in the lack. The company also previously announced that reimbursement of affected users began on June 28.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nguyen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"$540 million","content":"MONEY"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Trung Nguyen","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Kalie Moore","content":"PERSON"},{"type":"Mavis spokesperson","content":"PERSON"},{"type":"Sky Mavis CEO","content":"ORGANIZATION"},{"type":"June 28","content":"DATE"},{"type":"Mavis","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}