{"summary":"As the United Kingdom enters a third national lockdown in an effort to get rising infection rates linked with a new variant of Covid-19 under control, the nation’s crypto startups are taking steps to boost staff morale.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90220\/uk-crypto-firms-boost-morale-third-lockdown","publishDate":"2021-01-06T12:53:21","id":11826,"type":null,"title":"Bitcoin gifts and pub quizzes: How UK crypto firms are boosting morale with a third lockdown in place","category":["CRYPTOCURRENCY"],"content":["As the United Kingdom enters a third national lockdown to get rising infection rates linked with a newly identified strain of Covid-19 under control, the nation’s crypto startups are taking steps to boost staff morale.","The government's new restrictions mean people must stay at home and work from wherever possible, while most non-essential shops have been closed.","The Block spoke to several UK startups who are taking action to maintain staff well-being.&nbsp;Sergey Zhdanov, chief financial officer of the crypto exchange EXMO, said the lockdown \"affects the social part a lot.\"","“Some employees feel more drive and energy when they work from the office with other colleagues. So there is an increased risk of being burned out for such employees,” he said.&nbsp;","EXMO has been forced to cancel a new year team-building exercise, in lieu of which it has gifted bitcoin to all staff, according to Zhdanov. The exchange operator's plans to open a new office in London last year have been booted into 2021.","Data analytics business CryptoCompare has also been trying to lift employees’ spirits. Chief executive Charles Hayter said the firm runs pub quizzes, as well as handing out occasional Deliveroo vouchers and, more recently, Christmas hampers.","Most startups in the space do not appear overly concerned about the prospect of a prolonged period of remote working, but Hayter described the situation as a mixed bag.","“Some parts of the business work better remotely and some better in an office. But remote work does mean an increase in things falling through the cracks overall,” he said, adding that the firm is encouraging more face-to-face calls and exercise so that staff “maintain a connection, health and normalcy.\"","Investors in crypto have also had to adapt to the new normal.","George MacDonaugh, chief executive of the crypto-focused investment firm KR1, said his business is “inherently remote” because of the globally distributed nature of the industry in which it invests.&nbsp;","“Before any lockdown our business ran on two tracks, conferences and zoom. And although we’ve lost the former, the latter, Zoom, has been enough to give us continued access to a pipeline of interesting projects,” he said, adding:","“The conference circuit was great for morale as it’s a niche space, where everyone knows each other and it’s always good to meet face-to-face, so they have become a time for catching up and in particular talking business. In time, this part of our industry will return in full force.”","Of course, crypto founders do at least have some cause for cheer in the form of the surging price of bitcoin, which is currently sitting near all-time highs. The bull run has prompted a corresponding rise in volumes for a variety of U.K.-based operators.","Ziglu, the crypto wallet app, has seen trading volumes more than double during the past month, according to chief executive Mark Hipperson. At the same time Copper, the digital asset custody startup, has grown its assets under custody by 8% in Q1, 87% in Q2, 66% in Q3 and a whopping 463% in Q4.","“For us, we have been distributed for a while so work continues uninhibited. Morale is high at the moment, mostly driven by the bitcoin price,” said Andrew Clover, co-founder of the crypto firm Quantave.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"George MacDonaugh","content":"PERSON"},{"type":"United Kingdom","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"87%","content":"PERCENT"},{"type":"Hayter","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"66%","content":"PERCENT"},{"type":"Andrew Clover","content":"PERSON"},{"type":"Mark Hipperson","content":"PERSON"},{"type":"463%","content":"PERCENT"},{"type":"Sergey Zhdanov","content":"PERSON"},{"type":"Charles Hayter","content":"PERSON"},{"type":"London","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}