{"summary":"Users with at least 32 eth can now let MetaMask and Consensys run a validator node on their behalf, with no pooling or hardware required.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273656\/metamask-introduces-ethereum-validator-staking-feature-powered-by-consensys","publishDate":"2024-01-21T13:39:16","id":11825,"type":null,"title":"MetaMask introduces Ethereum validator staking feature, powered by Consensys","category":["CRYPTO ECOSYSTEMS"],"content":["MetaMask, the popular crypto wallet application, has partnered with Consensys Staking to run Ethereum validator nodes on behalf of users willing to stake at least 32 eth, a current value of about $80,000.","Following its transition from a proof-of-work network to a proof-of-stake network in the September 2022 known as ‘The Merge,’ Ethereum’s network is now secured by such validators. Many staking providers allow users to pool smaller amounts of funds together to hit the 32 eth requirement to run one validator, splitting the rewards.&nbsp;","MetaMask’s new staking offering, however, promises no pooling and no hardware or software requirements. Rather, the 32 eth stake is used to run a validator node through the Consensys Staking service, which already operates validators totaling about <a href=\"https:\/\/consensys.io\/staking\" data-v-f87c67ca=\"\">4% of all staked eth<\/a>.&nbsp;","MetaMask currently promises about 4% annual yield on the rewards, before taking a <a href=\"https:\/\/support.metamask.io\/hc\/en-us\/articles\/21134236430747-How-do-you-calculate-the-validator-rewards-rate\" data-v-f87c67ca=\"\">10% fee<\/a>, though the company notes that this yield may increase or decrease due to the inherently random chance of any given validator’s block being selected to add to the network.&nbsp;","MetaMask also offers pooled staking through popular providers Lido and RocketPool, though the advertised rewards are currently lower at 3.53% and 3.14%, respectively.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"3.53%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"September 2022","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"$80,000","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"3.14%","content":"PERCENT"}],"hashtag":["ETHEREUM"],"authors":["Zack Abrams","The Block"]}