{"summary":"Gitcoin announced the mainnet launch of its Layer 2 Public Goods Network (PGN) with the aim to fund public goods.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241425\/gitcoins-layer-2-public-goods-network-goes-live-on-mainnet","publishDate":"2023-07-26T06:05:58","id":11828,"type":null,"title":"Gitcoin&#x27;s Layer 2 &#x27;Public Goods Network&#x27; goes live on mainnet","category":["CRYPTO ECOSYSTEMS"],"content":["Gitcoin unveiled the mainnet activation of its Layer 2 Public Goods Network (PGN).","Jointly managed by Gitcoin and third-party infrastructure provider Conduit, PGN is designed as a low cost Layer 2 solution on Ethereum that will serve as a dedicated blockchain for financing public goods — key services underpinning the infrastructure for decentralized applications and their users.","PGN is developed using OP Stack, a software tool from the developers of OP Mainnet. It joins a roster of Layer 2 projects, including the Coinbase-backed <a href=\"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers\" data-v-f87c67ca=\"\">Base<\/a>, Zora, and <a href=\"https:\/\/www.theblock.co\/post\/235401\/bnb-chain-opbnb-testnet-evm-compatible\" data-v-f87c67ca=\"\">BNB Chain<\/a>, which have either already been developed or are currently in development using OP Stack.","It employs <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\" data-v-f87c67ca=\"\">Optimistic Rollups<\/a> technology to aggregate Ethereum transactions on a secondary layer, aiming to reduce user transaction costs while maintaining the Ethereum network’s security features. The network is compatible with the Ethereum Virtual Machine (EVM) and offers functionalities similar to the <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">OP Mainnet,<\/a> the team noted.","A distinguishing feature of the PGN is its approach to sequencer fees, the costs associated with processing and ordering transactions on the Layer 2 system before they’re finalized on the mainnet (Layer 1).","A significant portion of these fees on PGN will be directed to support public goods projects. “PGN will allocate the vast majority of this revenue to fund public goods, rather than channeling profits to venture capitalists,” its website <a href=\"https:\/\/docs.publicgoods.network\/about\" data-v-f87c67ca=\"\">states<\/a>.","The network will complement Gitcoin’s established operations, continuing its focus on incentivizing open-source software development within the Ethereum ecosystem. It provides a marketplace where developers can earn financial rewards for their contributions to open-source projects, mainly via a mechanism termed “bounties.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"Public Goods Network (PGN","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Gitcoin","content":"PERSON"},{"type":"PGN","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}