{"summary":"The UK&#x27;s finance minister will investigate claims that licensed crypto firms are having difficulty opening business accounts in the country.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268444\/uk-finance-minister-to-probe-banking-challenges-faced-by-countrys-crypto-firms","publishDate":"2023-12-19T12:58:49","id":1182,"type":null,"title":"UK Finance Minister to probe banking challenges faced by country&#x27;s crypto firms","category":["POLICY"],"content":["UK’s finance minister will investigate claims that licensed crypto firms are having difficulty opening business accounts in the country.","The UK's finance minister said he will investigate claims that licensed crypto firms are having difficulty opening business accounts in the country.","On Tuesday, <a href=\"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector\" data-v-f87c67ca=\"\">UK Chancellor of the Exchequer Jeremy Hunt<\/a> agreed to meet with the nation's Economic Secretary of the Treasury Bim Afolami to discuss the matter. Hunt was responding to a <a href=\"https:\/\/twitter.com\/cryptoappg\/status\/1737122522863129025\" data-v-f87c67ca=\"\">question<\/a> posed by Chair of the&nbsp;Crypto&nbsp;and Digital Assets All-Party Parliamentary Group <a href=\"https:\/\/www.theblock.co\/podcast\/234167\/dr-lisa-cameron-u-k-member-of-parliament-ian-taylor-board-advisor-cryptouk\" data-v-f87c67ca=\"\">Lisa Cameron<\/a> about the difficulty being faced by licensed crypto firms in the UK.","Hunt replied that he would arrange a meeting with the UK Treasury to investigate. He also took the opportunity to say that \"the UK, and London in particularly, has become the global crypto hub.\"","\"To make sure that the crypto market really can take off in the way that was intended in a responsible way we need to regulate it, which is why we have introduced legislation for stablecoins and for the promotion of crypto services,\" the finance minister added.","In April 2022, while serving as the country's finance minister, UK Prime Minister Rishi Sunak unveiled plans to transform the nation into \"a global crypto hub.\" Since then, the UK has passed legislation to advance that aim, such as new regulations for supervising the nation’s Digital Securities Sandbox initiative.","The new regulations will give the nation's financial watchdogs rules for supervising a sandbox for <a href=\"https:\/\/www.theblock.co\/post\/268212\/uk-introduces-new-regulations-for-its-digital-securities-sandbox\" data-v-f87c67ca=\"\">tokenized securities<\/a>, according to an official <a href=\"https:\/\/www.legislation.gov.uk\/uksi\/2023\/1398\/made\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">publication<\/a>.","The regulations will be for the UK's Digital Securities Sandbox, DSS, and they come into force on Jan. 8, 2024. They are part of the UK government's Financial Services and Markets Act 2023, or FSMA.","The new rules set the overall limitations on what can be carried out within the sandbox and which participants are eligible for involvement. The sandbox will let regulators and companies test solutions, including distributed ledger technology and the tokenization of securities.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Hunt","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"DSS","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Treasury Bim Afolami","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Digital Securities Sandbox","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Jan. 8, 2024","content":"DATE"},{"type":"UK","content":"LOCATION"},{"type":"Party Parliamentary Group <a href=\"https:\/\/www.theblock.co\/podcast\/234167\/dr-lisa-cameron-u-k-member-of-parliament-ian-taylor-board-advisor-cryptouk\" data-v-f87c67ca=\"\">Lisa Cameron","content":"ORGANIZATION"}],"hashtag":["FCA","UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}