{"summary":"Bitstamp has decided not to move forward with a planned inactivity fee for certain customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156233\/bitstamp-scraps-planned-inactivity-fee-over-customer-concerns","publishDate":"2022-07-06T17:37:14","id":11839,"type":null,"title":"Bitstamp scraps planned inactivity fee over customer concerns","category":["COMPANIES"],"content":["Luxembourg-based exchange Bitstamp announced on Wednesday that it will not move forward with plans to charge certain customers a monthly,10 euro fee for having an inactive account.&nbsp;","Bitstamp had <a href=\"https:\/\/blog.bitstamp.net\/post\/3-things-you-need-to-know-about-the-inactivity-fee\/\" data-v-f87c67ca=\"\">first disclosed<\/a> the planned fee in a July 1 blog post, saying that as of August 1 certain customers would be charged a 10 euro \"inactivity fee\" each month.","These charges would have applied to customers with balances of less than 200 euros that had not made any transactions or performed staking in the past year, excluding those based in the United States. Bitstamp did acknowledge that \"some\" of its customers were concerned about the change in its initial blog post explaining the fee.","But now, Bitstamp says it has scrapped its plans to charge the inactivity fee altogether, citing customers' concerns following the announcement.","\"We have taken everyone’s concerns onboard and have decided to cancel the inactivity fee,\" Bitstamp CEO JB Graftieaux said in a press release statement. “Listening to our customers is part of our service DNA. Bitstamp’s goal has always been to be a secure, reliable trading platform that provides industry-leading services, and we do not intend to deviate from our path.”&nbsp;&nbsp;","Crypto exchanges have been coming to terms with a <a href=\"https:\/\/www.theblock.co\/post\/155946\/crypto-exchange-bitstamp-to-charge-inactive-accounts-a-fee\" data-v-f87c67ca=\"\">decline in trading<\/a> volumes across the market. In its press statement, Bitstamp underscored that its \"financial position remains strong and healthy.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"JB Graftieaux","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"July 1","content":"DATE"},{"type":"August 1","content":"DATE"},{"type":"Bitstamp","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":["BITSTAMP"],"authors":["Kristin Majcher","The Block"]}