{"summary":"Ethena governance token will be listed on various centralized exchanges starting at 4:00 a.m. EST on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286000\/ethenas-token-to-list-on-exchanges-today-amid-airdrop-claims","publishDate":"2024-04-02T03:52:10","id":1184,"type":null,"title":"Ethena token to list on exchanges today amid airdrop claims","category":["CRYPTO ECOSYSTEMS"],"content":["The synthetic dollar project Ethena has begun the claim process for its governance token (ENA) airdrop, distributing 750 million tokens, which represent 5% of its total supply of 15 billion, to eligible users.","The project noted the token will be listed on several centralized exchanges starting at 4:00 a.m. EST.","The airdrop comes after “shard campaign,\" a reward program for early participants that permitted user involvement via referral links, rewarding them with shards (or points). The quantity of tokens each user receives is based on the total shards they accumulated up until April 1.","Development firm <a href=\"https:\/\/www.theblock.co\/post\/285212\/ethena-labs-to-airdrop-750-million-ena-tokens-on-april-2\" data-v-f87c67ca=\"\">Ethena Labs<\/a> supports the USDe stablecoin, also referred to as an “Internet Bond” and a “synthetic dollar.”","In February, it <a href=\"https:\/\/www.theblock.co\/post\/277565\/ethena-usde-stablecoin-funding-valuation-paypal-brevan-howard-others\" data-v-f87c67ca=\"\">raised<\/a> $14 million in a strategic funding round at a $300 million valuation. The round was co-led by Dragonfly and BitMEX founder Arthur Hayes' family office, Maelstrom.","Unlike conventional stablecoins, USDe employs a unique mechanism that does not rely on direct fiat or asset backing. These include hedging derivative positions against collateral held by the protocol and an arbitrage system for minting and redeeming USDe, aimed at maintaining its peg to the US dollar.","In other words, it utilizes strategies like staking ETH holdings (collected from USDe stablecoin minters) with Ethereum validators and simultaneously shorting the same amount of ether futures. This generates a yield for the protocol that is shared back with stablecoin holders.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 1","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$14 million","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"15 billion","content":"MONEY"},{"type":"ENA","content":"ORGANIZATION"},{"type":"Ethena Labs","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"4:00 a.m. EST","content":"TIME"}],"hashtag":["AIRDROP","ASSETS","PROTOCOLS","TOKENS"],"authors":["Vishal Chawla","The Block"]}