{"summary":"Written by Kelcey Gosserand and Antony Demekhin as part of an ongoing series examining the current state of ICOs. One of the most misunderstood and often","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283\/building-engaged-blockchain-communities-that-sustain-business-growth","publishDate":"2018-09-06T19:38:43","id":11849,"type":null,"title":"Building engaged blockchain communities that sustain business growth","category":["ICO AND IEO"],"content":["<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Written by <\/em><a class=\"markup--user markup--p-user\" href=\"https:\/\/medium.com\/u\/2f0ae90f4b54\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/u\/2f0ae90f4b54\" data-anchor-type=\"2\" data-user-id=\"2f0ae90f4b54\" data-action-value=\"2f0ae90f4b54\" data-action=\"show-user-card\" data-action-type=\"hover\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Kelcey Gosserand<\/em><\/a><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">&nbsp;and <\/em><a class=\"markup--user markup--p-user\" href=\"https:\/\/medium.com\/u\/d49159ac0c20\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/u\/d49159ac0c20\" data-anchor-type=\"2\" data-user-id=\"d49159ac0c20\" data-action-value=\"d49159ac0c20\" data-action=\"show-user-card\" data-action-type=\"hover\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Antony Demekhin<\/em><\/a>&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">as part of an ongoing series examining the current state of ICOs.<\/em>","One of the most misunderstood and often confused concepts within the tech sector is the idea of community. We all feel a certain way when we hear “community” — the term gets thrown around often with little regard to its purpose or significance. It’s worth remembering a community is a collection of people, aligned by a common interest or goal. In the digital age, communities are no longer bound by physical space; we no longer need proximity to connect. We can communicate with like-minded people without geographic limitations and amass global communities. <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Doing so gives us the power to realize the goals of our project. Failing to do so could leave us wondering where it all went wrong.<\/em>","It’s exciting and terrifying: With great power comes great responsibility! Within the tech sector, a number of sub-communities make up the broader ecosystem. There are developer communities broken up into different tech stacks, service providers, influencers, investors, governments, startups, corporations, analysts, supporters that all contribute to the whole. The concept of community gets even more granular when different verticals are considered.","But what happens when a nascent tech category is launched, and the community has to be built from the ground up? Welcome to the blockchain generation. Here, we will define what makes a community, how to develop and sustain an active blockchain community, and how blockchain communities feed into the broader tech ecosystem.","When does one turn on the community spigot — pre-product or post-product? Or does one do it after the initial investment is raised or when there is the right product\/market (i.e. token\/market) fit? The chicken or egg problem is a hot topic within the blockchain space and for a good reason. Striking the right balance is as much of an art as it is a science and no one has cracked the code on scalable, best practices.","Stealthy founders are looking for the opportune moment to announce their projects, then expect the floodgates to open with a captive audience. Instead&nbsp;… crickets. Social media growth hacks have given founders a false sense of what is necessary to garner attention that converts to a community. “Community” has been reduced to the simple metrics like number of followers and subscribers to XYZ platform.","<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/medium.com\/the-block-crypto\/the-evolution-of-icos-and-the-rising-importance-of-brand-marketing-5a3ba71c10c0\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/medium.com\/the-block-crypto\/the-evolution-of-icos-and-the-rising-importance-of-brand-marketing-5a3ba71c10c0\" data-v-f87c67ca=\"\">Last week, we mentioned the fabled, product-focused strategy of building first <\/a>and then expecting to capture attention and market share. There are tons of examples of where this concept has worked — Steve Jobs made a career out of it — but it’s not an easy one. When a team is building for an industry that is continually being defined by media headlines — and there is a general lack of knowledge and awareness — a different path should be followed.","The community is the lifeblood of blockchain endeavors. Having a stable community in place validates your project, fills knowledge gaps, contextualizes complex concepts, and provides you with ambassadors who will “sell’ your vision. There is no magic switch to activate your community instantaneously, nor is there a mathematical formula for determining the yield of subscribers and followers that creates critical mass for a project. What we do know, is that building community is an <em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">intentional&nbsp;<\/em>act and it starts with the ability to align a singular vision to the more significant needs of a few. With monitoring, active participation, and iteration, your community can build a foundational user base and provide you with invaluable data to scale your business.","This all sounds fine and dandy but how is this put into practice? Where do you start? Which platform is best? Again, these are great questions in theory, but if you’re asking these from the jump, you probably need to zoom out a bit. It’s like rationalizing what mode of transportation to use to get to a given destination when it’s often just a preference. The first set of questions to consider when creating a community around your project are: Who am I building this for? Why do they need this? How will they apply this to their everyday lives?","Getting clarity on your audience and perhaps drilling deeper into specifics like geographies and lifestyles will help you build a genuine, lasting community. Keep coming back to these questions to get a more holistic understanding of who makes up your community and how to keep them engaged. Rinse and repeat.","Building a community involves strategy and execution. Determining the right platforms and tools to use for engagement are integral to the the strategy portion. What you don’t want to do is amass a passive following of supporters and behave as a broadcaster. Fifty thousand Telegram followers are useless if they don’t regularly engage in the discussion. The ideal scenario is a push and pull situation, where you present consistent and relevant content in a way that promotes real participation. An adequately engaged community will inform you of what works and what doesn’t, and from there, you can build your playbook of best practices. Keep them engaged throughout your product releases, and your early adopters are in the bag.","The ideal role of a blockchain community within the broader tech ecosystem is symbiotic. Everything should feed in together and create harmony. Nourish the community with what they want based on who they are, and they will help your business grow like wildflowers spreading out in every direction. Think about it: The idea of tech communities and ecosystems comes from science and the natural order.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ICOs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Antony Demekhin","content":"PERSON"},{"type":"Steve Jobs","content":"PERSON"},{"type":"Kelcey Gosserand","content":"PERSON"},{"type":"XYZ","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kelcey Gosserand","The Block"]}