{"summary":"The company accidentally published draft materials on its website earlier this month saying it was filing for Chapter 11 bankruptcy protection.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197956\/bitcoin-miner-argo-blockchain-suspends-nasdaq-trading-pending-announcement","publishDate":"2022-12-27T08:06:18","id":11844,"type":null,"title":"Bitcoin miner Argo Blockchain suspends Nasdaq trading pending announcement","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner Argo Blockchain requested that trading be temporarily suspended on Nasdaq pending an announcement by Wednesday's open.","Trading is expected to resume on Wednesday, it said in a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20221227005129\/en\/Suspension-of-Trading-on-Nasdaq-for-Argo-Blockchain-plc\" data-v-f87c67ca=\"\">statement<\/a>.","The UK-based company is also listed on the London Stock Exchange, which is closed Tuesday and where trading was temporarily suspended earlier this month after the company accidentally published draft materials on its website <a href=\"https:\/\/www.theblock.co\/post\/194230\/bitcoin-miner-argo-accidentally-said-its-filing-for-chapter-11-but-is-actually-trying-to-avoid-that-fate-by-selling-assets\" data-v-f87c67ca=\"\">saying that it was voluntarily filing for Chapter 11 bankruptcy<\/a> protection in the U.S.","Instead, the miner said that it was in \"advanced negotiations with a third party\" to sell certain assets and secure equipment financing.","\"The company is hopeful that it will be able to consummate the transaction outside of a voluntary Chapter 11 bankruptcy filing in the United States, although there is no assurance that the company can avoid such a filing,\" it said 0n Dec. 12.","Argo warned in October that it would become cashflow negative if it failed to raise money after a financing deal fell through. In that scenario it would also have to cease operations, the company said at the time.","Rival Core Scientific f<a href=\"https:\/\/www.theblock.co\/post\/196925\/core-scientific-files-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">iled for Chapter 11 bankruptcy<\/a> last week.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stock Exchange","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Dec. 12","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}