{"summary":"Coinbase&#x27;s shares fell by more than 20% on the Nasdaq stock exchange Wednesday morning","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146339\/coinbases-stock-craters-to-new-lows-after-earnings-disappointment-banks-slash-price-targets","publishDate":"2022-05-11T11:03:38","id":11847,"type":null,"title":"Coinbase&#x27;s stock craters to new lows after earnings disappointment, banks slash price targets","category":["EARNINGS"],"content":["Crypto exchange Coinbase saw its shares drop by more than 20% Wednesday morning, a day after the company released earnings that revealed a declining user base and hefty expenses for the first quarter of 2022.","Shares in Coinbase were trading at $56 per share at the time of writing, representing a drawdown of more than 70% since the beginning of the year.","Coinbase — which is among the largest publicly traded companies in the crypto market— went public in April 2021 and has declined by 83% since its market debut.&nbsp;","Its first-quarter earnings revealed mounting expenses for the firm, which translated into a net loss of $430 million. The firm's revenues fell to $1.17 billion, missing Wall Street's target of about $1.5 billion.","Unsurprisingly, given the drawdown in activity across crypto exchanges, the firm's monthly transaction users dropped to 9.2 million during the first quarter from 11.4 in Q4. Adjusted EBITDA declined from $1.2 billion in the fourth quarter to $20 million in Q1.&nbsp;","In a letter to shareholders, Coinbase addressed the broader market conditions that underpinned the quarter, noting that \"we believe these market conditions are not permanent and we remain focused on the long-term.\"&nbsp;","Investment analysts aren't convinced with Goldman and JPMorgan slashing their price targets to $171 and $80, respectively.","\"In the current macro backdrop, we believe COIN is unlikely to return to recent levels of profitability in the near term absent a significant increase in crypto prices or volatility,\" analysts at Goldman Sachs noted in a note published Wednesday.","Coinbase, much like other technology stocks, has been gripped by broader macro conditions as well with tightening monetary policy wreaking havoc across risk assets from stocks to cryptocurrencies.&nbsp;","In a conversation with The Block post-earnings, executives from the company noted that it was a \"good quarter for the business, but the macro environment weighed on financials.\"","The team added that Coinbase gained market share in seven of its top tradeable assets and also saw the number of clients engaging with multiple products increase to 54%. Another bright spot: fees.&nbsp;","<span data-v-f87c67ca=\"\">Here's&nbsp;<\/span>Coinbase<span data-v-f87c67ca=\"\">&nbsp;CFO Alesia Haas:&nbsp;<\/span>","\"Just factually, our fees actually have not declined. In fact, our blended fee rate is up over the last two quarters. Our transaction revenues are down on an absolute basis in Q1, and that reflects the broader weakness in the markets, which is not surprising given crypto volatility in price cycles, which we previously talked about. But we're not seeing that competition on fees.\"","<span data-v-f87c67ca=\"\">John Todaro, an analyst at Needham &amp; Company, told The Block that fee compression is among the concerns of investors, adding that they think that fees will compress to zero, much like how they have in equities trading.&nbsp;<\/span>","\"What I am telling folks every day is, well, they haven't come down yet,\" he said. \"I think the fee compression concern is overblown but it is one of the biggest concerns.\"","FTX.US, FTX's American affiliate, sent out an email to users Tuesday highlighting a slash in its taker fees for certain tiers, suggesting that a tide may be turning when it comes to fees.&nbsp;","Coinbase said that consumers are going to be willing to pay for the security and platform that Coinbase offers.","As for expenses, a slowdown in hiring might help address the firm's expenses, which came in at $1.7 billion in the quarter. The company hired more than 1,200 people during the quarter as part of an effort to right-size the firm given its growth last year.&nbsp;","\"We are able to hire aggressively because we are coming from this with a strong balance sheet,\" a spokesperson said.&nbsp;\"Are we going to go from where we are today to tripling again? That's probably too much.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$56","content":"MONEY"},{"type":"April 2021","content":"DATE"},{"type":"54%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"$1.17 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$430 million","content":"MONEY"},{"type":"$80","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"Goldman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"first quarter of 2022","content":"DATE"},{"type":"83%","content":"PERCENT"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Alesia Haas","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"John Todaro","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"$20 million","content":"MONEY"},{"type":"Needham &amp; Company","content":"ORGANIZATION"},{"type":"$171","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}