{"summary":"DNP3, the pseudonym of the founder of the Goobers NFT collection, admitted to gambling away user funds due to an addiction. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199021\/nft-project-founder-dnp3-admits-to-gambling-away-user-funds","publishDate":"2023-01-03T17:26:27","id":11852,"type":null,"title":"NFT founder DNP3 admits to gambling away user funds","category":["METAVERSE & NFT"],"content":["The founder of Goobers NFT, who goes by the name DNP3, blamed a gambling addiction for why he gambled and lost user funds.&nbsp;&nbsp;","\"Over the last year I got incredibly addicted to gambling,\" he wrote. \"Every dollar I could find I would put into Stake in hopes of winning big. Even when the big wins did happen it wasn’t enough. Eventually I lost everything. In addition to my own life savings, I also irresponsibly used investor funds to try and 'get my money back' from the casino, which was wrong for so many reasons.\"","He added on Twitter that it \"started with a sponsored stream and unleashed an addiction I never knew I had.\"","DNP3 is the founder of the NFT project Goobers, which launched in September 2021 and amassed a 968 ETH total trading volume. At its peak, the project's floor price was 55.25 ETH on Feb. 20, 2022 before falling to 0.02 ETH on Jan 3.&nbsp;","DNP3 did not respond to The Block's request to clarify the amount of money used for gambling. However, The Block Research estimated that millions of dollars worth of funds were gambled.&nbsp;","DNP3 is also the founder of Gridcraft Network, a play-to-earn web3 game, and the charity-focused cryptocurrency CluCoin. In addition, he streams on the live streaming platform Twitch to more than 251,000 followers.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Feb. 20, 2022","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Goobers NFT","content":"ORGANIZATION"},{"type":"Gridcraft Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}