{"summary":"U.S. inflation came in below estimates of 7.3% in November.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194405\/u-s-inflation-shows-signs-of-cooling-at-7-1-in-november-below-estimates","publishDate":"2022-12-13T08:39:22","id":11856,"type":null,"title":"U.S. inflation shows signs of cooling at 7.1% in November, below estimates","category":["MARKETS"],"content":["Inflation in the U.S. came in at 7.1% in November, compared to the 7.3% year-on-year forecast. The month-on-month increase was 0.1%, down from 0.4% in October.&nbsp;","Cryptocurrencies and traditional stock markets rose in response as yields dropped.","","","While inflation shows signs of easing, interest rates remain elevated. The market is watching to see how much the Federal Reserve will raise interest rates tomorrow, with the expectation that it will slow down the pace from its recent increases of 75 basis points to 50 basis points on the assumption that inflation is taking a bit of a breather.&nbsp;","While today's data is unlikely to sway the Fed in its rate decision being announced tomorrow, U.S. core and headline inflation figures will likely set the tone for the central bank, and by extension, the upcoming year, said David Stritch, a currency analyst at Caxton.","“Today’s U.S. CPI data will give us an idea on how the market pricing for the Fed’s terminal rate will clash with the dot plot projections that will come out tomorrow, and that will, in all cases, hammer any potentially optimistic market sentiment,” <a href=\"https:\/\/en.swissquote.com\/newsroom\" data-v-f87c67ca=\"\">said<\/a> Ipek Ozkardeskaya, a senior analyst at Swissquote Bank.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"7.1%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"7.3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"0.4%","content":"PERCENT"},{"type":"0.1%","content":"PERCENT"},{"type":"Swissquote Bank","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"David Stritch","content":"PERSON"},{"type":"Ipek Ozkardeskaya","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Caxton","content":"ORGANIZATION"}],"hashtag":["BITCOIN","DOGECOIN","ECONOMIC INDICATORS","EQUITY MOVERS","ETHEREUM","RATE DECISIONS"],"authors":["Adam Morgan McCarthy","The Block"]}