{"summary":"Gaming project DeFi Kingdoms is the first to be granted incentives under the new Multiverse program.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136691\/avalanche-subnet-incentive-program","publishDate":"2022-03-08T10:00:23","id":11863,"type":null,"title":"Avalanche Foundation unveils $290 million incentive program to spur on growth of subnets","category":["LAYER 1S"],"content":["The Avalanche Foundation announced incentives worth hundreds of millions of dollars on Tuesday to stimulate new types of development on the Avalanche blockchain.","The so-called Avalanche Multiverse program — funded by four million AVAX tokens (worth around $290 million at current prices) — aims to encourage the growth of subnets on the network.","The subnets are blockchains linked to Avalanche, in that they share similar tools and features, but that can be customized to suit the requirements of specific apps.","They are also siloed in terms of competing for resources, meaning their speed and costliness won’t be affected by events — such as a popular NFT drop — elsewhere on the Avalanche blockchain. Subnets can also use a token of their own design instead of AVAX.","“It’s kind of like blockchain as a service,” John Wu, president of Ava Labs, said in an interview with The Block. He added that subnets, while app-specific, retain “all the power of Avalanche.”","The launch puts Avalanche in competition with rivals Cosmos and Polkadot, blockchain operators that already offer similar functionality.","News of the Multiverse program comes after the creation of <a href=\"https:\/\/www.theblockcrypto.com\/post\/114782\/avalanche-launches-180-million-defi-incentive-scheme-aave-curve\" data-v-f87c67ca=\"\">an $180 million program<\/a> in August of last year, named Avalanche Rush, which aimed to entice DeFi developers to the blockchain. Similar rewards packages have been dangled by Ethereum challengers Algorand, Hedera and Celo — and early signs suggest they have&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/news+\/118150\/ethereum-challengers-are-dangling-token-rewards-to-attract-big-name-defi-projects-and-its-working\" data-v-f87c67ca=\"\">proven effective<\/a>.","In its latest announcement, the Avalanche Foundation highlighted two examples of subnet projects that are already under way: DeFi Kingdoms and an institutional DeFi initiative featuring half a dozen big-hitters in crypto.","The first subnet to receive incentives through the Multiverse program is NFT gaming project DeFi Kingdoms, for which $15 million in incentives has been set aside. Those rewards will be denominated in AVAX and a new DeFi Kingdoms token named CRYSTAL, which will sit alongside the game’s existing JEWEL token.","In a statement, DeFi Kingdoms’ pseudonymous executive director Frisky Fox said the team had been looking for technology to help the project “scale and introduce new features like using our native tokens for gas fees, without sacrificing security or decentralization.”","Another key subnet project focuses on crafting regulatory-compliant access to DeFi for institutional investors.","Ava Labs, which helps drive the development of Avalanche, has partnered with Aave, GoldenTree Asset Management, Wintermute, Jump Crypto, Valkyrie, Securitize and others to build the subnet. Participants will be required to undergo know-your-customer (KYC) checks.","“In this case, a consortium can help govern who is participating in this subnet in order to stay compliant with the rules and regulations,” said Wu.","Launched in September 2020, Avalanche is a proof-of-stake protocol that touts its smart contracts platform as the fastest in the blockchain space. In proof-of-stake systems, participants are required to stake tokens for the chance to be randomly selected to validate transactions.","Developers must stake 2,000 AVAX tokens (around $144,000 at current prices) to create and validate a subnet, according to Luigi D’Onorio DeMeo, a director at Ava Labs.","For projects that qualify, the Multiverse initiative could cover that cost. But the program can also dish out rewards to subnet users and liquidity mining incentives, paid out to entities that stake tokens in order to help validate transactions in subnets.","The Avalanche Foundation said the Multiverse program will be divided into at least six phases to support multiple cohorts of projects.","Several subnets have already been created on Avalanche —&nbsp;including one by Shrapnel, a first-person shooter game that <a href=\"https:\/\/www.investing.com\/news\/cryptocurrency-news\/avalanche-to-introduce-its-first-aaa-game-on-its-blockchain-2777506\" data-v-f87c67ca=\"\">recently raised<\/a> $10.5 million in funding. But DeFi Kingdoms is the first project to receive incentives under the Multiverse label, according to D’Onorio DeMeo.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/evm-chains-stats\/daily-new-unique-addresses-for-evm-chains\/embed\" title=\"Daily New Unique Addresses for EVM-Chains\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"John Wu","content":"PERSON"},{"type":"Avalanche Foundation","content":"ORGANIZATION"},{"type":"$290 million","content":"MONEY"},{"type":"September 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Luigi D’Onorio DeMeo","content":"PERSON"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Hedera","content":"PERSON"},{"type":"August of last year","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Jump Crypto","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"$180 million","content":"MONEY"},{"type":"GoldenTree Asset Management","content":"ORGANIZATION"},{"type":"$10.5 million","content":"MONEY"},{"type":"Frisky Fox","content":"ORGANIZATION"},{"type":"$144,000","content":"MONEY"}],"hashtag":["AVALANCHE"],"authors":["Ryan Weeks","The Block"]}