{"summary":"PublicAI, a Web3 distributed AI training network, closed a $2M seed round from investors IOBC Capital, Foresight Ventures, Solana Foundation, Everstate","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274838\/web3-distributed-ai-training-network-publicai-raises-2m-in-seed-funding-round","publishDate":"2024-01-29T09:01:59","id":11867,"type":null,"title":"Web3 Distributed AI Training Network PublicAI Raises $2M in Seed Funding Round","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">PublicAI, a Web3 distributed AI training network, closed a $2M seed round from investors IOBC Capital, Foresight Ventures, Solana Foundation, Everstate Capital. The team comprises PhDs and professors from Stanford and former employees of Goldman Sachs and JP Morgan. The funds will primarily be used to accelerate the launch and Go-To-Market of the network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">PublicAI utilizes web3 to build a distributed AI training network, allowing anyone to earn rewards by offering data works. Dr. Steven Wong, the founder of PublicAI, stated, \"PublicAI aims to produce massive high-quality training data with blockchain technology at a large-scale to solve all the problems faced by artificial intelligence so far, and enable every human to participate in AI creation while sharing the benefits\". Currently, AI LLMs (Large Language Models) face several challenges as below:<\/span>","<b data-v-f87c67ca=\"\">Morality Concerns<\/b>","<span data-v-f87c67ca=\"\">Training artificial intelligence relies on vast amounts of high-quality data, and humans play a vital role in feeding knowledge to AI via data works. PublicAI's Train-To-Earn tokenomics and Slash\/Reward mechanism deliver an effective supervision. The data contributors are supervised by the protocol to ensure that the LLMs exhibit a strong moral inclination.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Human Preference<\/b>","<span data-v-f87c67ca=\"\">Human preference is the benchmark of AI behavior from human points such as morality inclination, poetry appreciation, visual aesthetics, and musical rhythm. LLMs must effectively learn human preferences before massive adoptions. PublicAI produces human preference data with a finely designed BFT data consensus algorithm to achieve human consensus on each item of training data, guaranteeing the human preferences without bias.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Hallucination<\/b>","<span data-v-f87c67ca=\"\">Some LLM-generated contents are inaccurate or misdescribed with certain sources or contain absurd information is referred to as \"Hallucination\". In PublicAI, under the supervision of the web3 protocol and the data consensus algorithm, the training data has been acknowledged by 51% consensus which will be more authentic to historical traceability,&nbsp; effectively correcting the hallucination issues of AI.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Data Contamination<\/b>","<span data-v-f87c67ca=\"\">The internet will be flooded with AI-generated data soon leading to the AI’s perception of reality becoming distorted. The research institution EpochAI suggests that by next year, humans may face an AI data famine, with high-quality training data worldwide running dry. However, by scaling up data production with web3 protocol, PublicAI can effectively alleviate the \"data famine\" along with the data consensus algorithm.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<a href=\"https:\/\/epochai.org\/blog\/will-we-run-out-of-ml-data-evidence-from-projecting-dataset\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Read more about \"Will We Run Out of ML Data? Evidence From Projecting Dataset Size Trends\" by EpochAI and MIT.<\/span><\/a><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<b data-v-f87c67ca=\"\">Domain Expertise<\/b>","<span data-v-f87c67ca=\"\">AI will revolutionize every professional sector eventually, but currently LLMs still perform poorly and lack professionalism in the specific domains such as law, medicine, politics, education, music. PublicAI's global training protocol aims to harness the expertise of individuals worldwide, allowing everyone, from anywhere, at any time to offer professional data works to train the AI.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">PublicAI's innovation offers a glimpse into a future where training data is more democratized, ethical, and efficient. PublicAI holds the potential to not only alleviate the looming \"data famine\" but also share the benefits of AI with everyone on the earth. The question is no longer whether AI will replace humans, but how humans can harness the power of Web3 to shape a responsible and inclusive future for AI.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">This post is commissioned by PublicAI and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/em><br data-v-f87c67ca=\"\">\n<\/span>","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$2M","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Everstate Capital","content":"ORGANIZATION"},{"type":"Steven Wong","content":"PERSON"},{"type":"IOBC Capital","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"MIT","content":"ORGANIZATION"},{"type":"ML Data","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Stanford","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}