{"summary":"A new $450 million venture fund is entering the crypto market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160041\/variant-raises-450-million-for-two-new-venture-funds","publishDate":"2022-07-28T10:00:25","id":11873,"type":null,"title":"Variant raises $450 million for two new venture funds","category":["VENTURE CAPITAL"],"content":["Crypto venture investment firm Variant has raised $450 million across two new funds targeting the beleaguered market for Web3 and decentralized finance.&nbsp;","In a Thursday announcement shared with The Block, the company said it raised $300 million for a so-called opportunity fund as well as $150 million fund to invest in earlier-stage startup projects. Led by general partners Li Jin, Jesse Walden and Spencer Noon, Variant closed its first fund in 2020 and most recently <a href=\"https:\/\/www.theblock.co\/linked\/121168\/variant-closes-110-million-fund-after-merger-deal\" data-v-f87c67ca=\"\">announced<\/a> a $110 million fund following a merger with Atelier Ventures in 2021.&nbsp;","Variant's portfolio includes a wide-range of companies in the crypto space, including NFT platforms like Magic Eden, decentralized credit platform Goldfinch, and decentralized exchange Uniswap.&nbsp;","The two new funds will have a mandate that's breadth reflects Variant's investing history, with the firm noting in press materials that it will look at four specific buckets of investment opportunities: decentralized finance, blockchain infrastructure, consumer applications in Web3, and projects experimenting with new forms of ownership.&nbsp;","<span data-v-f87c67ca=\"\">\"Tokens and NFTs enable net-new user experiences that satisfy diverse motivations and 'jobs-to-be done,' from control to belonging, to financial alignment with the products you use everyday,\" the firm explained. \"Ownership is a design space for new product features and experiences.\"<\/span>","The two new funds launch amidst an unsavory backdrop for the crypto market, which has seen volumes across various platforms decline, users retreat, and prices broadly sink. Yet Variant isn't alone among investors in forging ahead with fresh fundraising. Crypto vets Jason Choi and Darryl Wang <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-07-05\/crypto-venture-investors-choi-wang-launch-fund-for-web3#xj4y7vzkg\" data-v-f87c67ca=\"\">launched<\/a> a new fund targeting web3 this summer. David Gan, a former executive at Huobi, <a href=\"https:\/\/techcrunch.com\/2022\/06\/30\/op-crypto-raising-100m-for-fund-of-funds-to-back-fund-managers\/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAJKhg5edg1tZcy9pjgDJzZrhpW7dEyT7xXFMUDoB518_nmwxwaTSSaCKRwcVbkXd-KKCe5g1ConpBL6STbgBdCLwKNaCoZ5j3qKuXW9p5jVoqFdsnjXVXhkTavQsDsdm2beorlVdAGi_jV4kOHlV1FVGcJTP4g8UUy5fmp0leV4Z\" data-v-f87c67ca=\"\">launched<\/a> his latest venture fund of funds in June.&nbsp;","As for Variant, the firm remains bullish on the long-term future of web3.&nbsp;According to Walden, the technology powering the emerging web3 industry will only improve from here.","“In the history of technology, technology doesn't get worse and disappear — it gets better and more pervasive,” he said. “And that's happening at an exponential rate in web3, because this is all software, it's all open source, and there's just tons of talent jumping in... So the tech is working, and again, I think that means it's only going to be more pervasive.”","As noted by The Block Research, venture funding in the blockchain sector declined roughly 22% in the second quarter of this year, from $12.5 billion the previous quarter to $9.8 billion.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$450 million","content":"MONEY"},{"type":"David Gan","content":"PERSON"},{"type":"Jason Choi","content":"PERSON"},{"type":"22%","content":"PERCENT"},{"type":"Walden","content":"LOCATION"},{"type":"$9.8 billion","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Li Jin","content":"PERSON"},{"type":"$12.5 billion","content":"MONEY"},{"type":"$110 million","content":"MONEY"},{"type":"second quarter of this year","content":"DATE"},{"type":"Atelier Ventures","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Jesse Walden","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Darryl Wang","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Huobi","content":"LOCATION"},{"type":"$150 million","content":"MONEY"},{"type":"Spencer Noon","content":"PERSON"},{"type":"Magic Eden","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}