{"summary":"The extension granted is shorter than that sought by the troubled Asian crypto lender.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215340\/vauld-gets-yet-another-creditor-protection-extension-until-march-24","publishDate":"2023-02-27T08:40:13","id":11872,"type":null,"title":"Vauld gets yet another creditor protection extension until March 24","category":["COMPANIES"],"content":["Asian crypto lender Vauld received a further extension to its legal protection from creditors at a Singapore High Court hearing on Monday — albeit a shorter delay than requested.","The company now has until March 24 to explore options to ease its financial troubles, according to two sources with direct knowledge of the matter. Vauld, however, had sought protection through April 28, according to its latest affidavit dated Feb. 24 obtained by The Block. The firm's previous creditor protection <a href=\"https:\/\/www.theblock.co\/post\/202694\/vauld-creditor-protection-until-feb-28?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">expires<\/a> tomorrow.&nbsp;","Vauld&nbsp;<a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/155679\/vauld-halts-withdrawals-hires-legal-financial-advisors\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">halted<\/span><\/a> client withdrawals last July and had been in discussions with rival Nexo for a potential acquisition. Those talks ended after a <a href=\"https:\/\/www.theblock.co\/post\/199618\/nexo-says-vauld-ceo-doesnt-have-best-interest-of-creditors-in-mind\" data-v-f87c67ca=\"\">dramatic tussle<\/a>, according to Vauld's Feb. 24 affidavit.","\"Discussions with Nexo have been discontinued,\" reads the affidavit. \"Nexo was unable to provide sufficient information to substantiate its claim of solvency (would not agree to an exercise of financial due diligence) or adequately serve U.S.-based customers.\"","Vauld is now in favor of another restructuring plan that involves a so-called scheme of arrangement. This comprises two options: either the company's funds being placed under management or a distribution of the company's funds to creditors through a managed wind down, according to another Vauld affidavit dated Feb. 21 obtained by The Block.","The company will likely go for the second option of \"a managed wind down coupled with the option of conducting RDAs [reverse Dutch auctions] coinciding with the realization of illiquid assets,\" the affidavit states. This option would provide creditors \"liquidity opportunities at various stages,\" Vauld argues.","Vauld plans to apply for leave to convene a creditor meeting and a further moratorium extension to facilitate the scheme meeting process in April, before getting it approved and implemented in June and July, per the affidavit.","However, some of Vauld's creditors are in favor of the company winding up via a court order or going into liquidation, according to the Feb. 24 affidavit. Vauld, on the other hand, thinks that its proposal offers \"greater flexibility\" as \"creditors are able to choose when they require liquidity and to what extent, and whether to hold out for a greater prospective recovery than if they were to obtain liquidity in the short term via the RDA.\"&nbsp;","Vauld owes over $325 million to its creditors and its financial hole stands at over $65 million, according to its latest financial position disclosed in the Feb. 21 affidavit.","Vauld and its financial advisor, Kroll, did not immediately respond to requests for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Feb. 21","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$65 million","content":"MONEY"},{"type":"RDA","content":"ORGANIZATION"},{"type":"Kroll","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"March 24","content":"DATE"},{"type":"Feb. 24","content":"DATE"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"$325 million","content":"MONEY"},{"type":"Singapore High Court","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"April 28","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":["COURT HEARINGS"],"authors":["Yogita Khatri","The Block"]}