{"summary":"CVS Health has filed a trademark application that mentions NFTs, and health services in virtual and augmented reality, according to a February 28th filing.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136462\/healthcare-giant-cvs-files-for-nfts-and-virtual-goods-trademark","publishDate":"2022-03-04T16:12:50","id":11889,"type":null,"title":"Healthcare giant CVS files for NFTs and virtual goods trademark","category":["LEGAL"],"content":["CVS Health has filed a trademark application that signals potential plans to offer NFTs and healthcare services in virtual reality and augmented reality, according to a trademark filing posted on February 28. &nbsp;","In general, it’s hard to say whether there are immediate plans for a company to move into crypto or the metaverse based on just a filing, says Mike Kondoudis, trademark attorney. This is because there are two ways to file for trademark: 1A filings means actual use, where a company gives the government evidence of use for the trademark. Alternatively, the filing could be a “1B” filing, which means there’s intent to use. In the case of 1B filings, the trademark filing is in place for future use but does not necessarily mean there are immediate plans.","The CVS filing is on a 1B basis, with plans to offer digital and virtual goods and prescription drugs, and health services in virtual and augmented reality.","“As the leading health solutions company, we’re consistently enhancing our omnichannel health services to meet the needs of consumers when and where they want them, including at home, virtually and in the community,” a rep from CVS told The Block in an email. “We’re also regularly looking at new and innovative ways to engage consumers through a digital-first, technology-forward approach, which is why we recently made trademark filings related to virtual health care services, as well as other virtual goods and services.”","CVS Health is the parent company of several well-known US-based businesses, including CVS Pharmacy and the insurer Aetna. Last year, CVS Health was ranked fourth on the <a href=\"https:\/\/fortune.com\/fortune500\/2021\/search\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Fortune 500<\/a> list.&nbsp;","When asked about insights on any immediate plans, the rep clarified that they will continue to “explore these and other options to improve the consumer experience and launch a new consumer-centric services and offerings.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"February 28","content":"DATE"},{"type":"CVS Health","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"CVS","content":"ORGANIZATION"},{"type":"Mike Kondoudis","content":"PERSON"},{"type":"Aetna","content":"ORGANIZATION"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}