{"summary":"Web3 email solution EtherMail raised a $4 million in a pre-Series A funding round. The startup closed a $3 million seed round in August of last year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217761\/tim-draper-joins-ethermails-advisory-board-leads-4-million-raise","publishDate":"2023-03-08T09:02:30","id":11887,"type":null,"title":"Tim Draper joins EtherMail&#x27;s advisory board, leads $4 million raise","category":["VENTURE CAPITAL"],"content":["Web3 email solution EtherMail received $4 million from veteran venture investor Tim Draper, well-known for backing household names, including Hotmail — the company EtherMail is trying to disrupt.","The pre-Series A round is led by Draper and his venture firm, Draper Associates. He will also join the startup's advisory board, the company said in a release.","\"Draper Associates has an unrivaled track record when it comes to backing early-stage industry disruptors, and we’re proud to join the likes of Tesla, SpaceX and our partners Unstoppable Domains as Draper-backed innovators,\" said Shant Kevonian, CEO and founder of EtherMail in the release. \"Additionally, the support of MS&amp;AD will be invaluable as we continue our Asian expansion, setting the standard for anonymous and encrypted wallet-to-wallet communication.”","MS&amp;AD Ventures, backed by insurance conglomerate MS&amp;AD Insurance Group, also participated in the raise.","Founded in 2021, EtherMail wants to enable encrypted wallet-to-wallet communication — where users will get rewarded for reading emails from companies. The startup is implementing a paywall solution that uses its EMT token to help protect users' inboxes by asking companies to pay for the right to invade them.","\"It is still a battle for attention, and so even if you didn't buy anything during that campaign on Black Friday, or whatever it might be, you should still be somehow compensated because they are invading your personal space, your personal inbox,\" said Kevonian in a September interview with The Block.&nbsp;","\"Time isn't free; it's the one thing you don't get back,\" Kevonian said. \"And so if you're spending some time, there should be some&nbsp; loyalty reward in that regard.\"&nbsp;Users can also be rewarded by sharing their interests and data with companies to increase the value proposition of what they are being targeted for, he added.","EtherMail is also built on traditional email, which means users can use existing tools, like Gmail and Thunderbird.","The startup <a href=\"https:\/\/www.prnewswire.com\/news-releases\/ethermail-raises-3m-in-seed-round-funding-from-top-vcs-fabric-and-greenfield-one-to-enable-anonymous-wallet-to-wallet-email-communication-to-200-million-users-worldwide-301603710.html\" data-v-f87c67ca=\"\">closed<\/a> a $3.3 million seed round in August last year. Its backers included Greenfield Capital and Fabric Ventures. Since the raise, the startup has <a href=\"https:\/\/news.bitcoin.com\/ethermail-integrates-with-unstoppable-domains-to-expand-web3-communication-network\/\" data-v-f87c67ca=\"\">secured<\/a> partnerships with NFT projects, such as Probably Nothing and Toxic Skulls Club, as well as web3 domain startup Unstoppable Domains.","“The EtherMail team has quickly established a dominant market position at the forefront of Web3 email innovation, underpinned by a firm understanding of evolving Web3 market dynamics,\" said Tim Draper, founding partner of Draper Associates, in the release.","The funding will be used to drive hiring and market expansion, said the company in the release. It's also working to expedite the rollout of its single sign-on solution and advertising marketplace solution.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"MS&amp;AD Insurance Group","content":"ORGANIZATION"},{"type":"$3.3 million","content":"MONEY"},{"type":"Draper Associates","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Time","content":"ORGANIZATION"},{"type":"$4 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Toxic Skulls Club","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"August last year","content":"DATE"},{"type":"Draper","content":"PERSON"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Kevonian","content":"PERSON"},{"type":"Shant Kevonian","content":"PERSON"},{"type":"Tim Draper","content":"PERSON"},{"type":"EtherMail","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Greenfield Capital and Fabric Ventures","content":"ORGANIZATION"}],"hashtag":["DECENTRALIZED INFRASTRUCTURE","SEED &AMP; PRE-SEED","SERIES A"],"authors":["Kari McMahon","The Block"]}