{"summary":"The organization supporting the Ethereum Layer 2 network Arbitrum is investing in a feature-length film called &quot;New Here.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278506\/arbitrum-foundation-funds-crypto-related-film-produced-by-oscar-winning-producer","publishDate":"2024-02-21T18:07:38","id":11895,"type":null,"title":"Arbitrum Foundation funds crypto-related film from Oscar-winning producer","category":["NFT COLLECTIONS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arbitrum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.89%\n    <\/span><\/a> <!----><\/span><\/span> Foundation has decided to finance a film project which promises to explore the world of digital art \"through the lens of a new user falling down the crypto rabbit hole.\"<\/span>","The foundation, an <a href=\"https:\/\/www.theblock.co\/post\/253560\/arbitrum-foundation-fracton-ventures-japan\" data-v-f87c67ca=\"\">organization supporting<\/a> the Ethereum Layer 2 network Arbitrum, announced on Wednesday its partnership with the new media company Dpop Studios and will help finance \"New Here,\" a film that will examine how \"artists are using new technologies like blockchain and AI to shape the future.\" The film will be produced, in part, by Shane Boris, who won an Academy Award last year for the documentary \"Navalny.\"","\"Just to look at what NFTs and NFT artists are doing more deeply, and see the possibilities of what this new mode of creation is capable of,\" said Boris during an X spaces on Wednesday. \"We sort of profile those artists and thinkers within the space, but also in the film itself, where we’re experimenting with all different types of creative modalities and storytelling structure, and ideas of how to allow a film or piece of art to find, reach and create new audiences.\"","This is not the first time the world of filmmaking and crypto have intersected. Last year, Decentralized Pictures, co-founded by legendary director Francis Ford Coppola's son Roman Coppola, helped fund the film \"The Quiet Maid,\" which secured much of its financing from the sale of NFTs.","“The 'New Here' universe introduces an exciting new digital realm that connects entertainment with digital ownership in a way the media and film industry has yet to venture into,\" Arbitrum Foundation's head of ecosystem development, Nina Rong said in a statement. \"Owning an NFT corresponding to a short series to unlock advancing viewing experiences has the potential to reimagine how media companies approach media&nbsp; releases in a web3 world.”&nbsp;","\"New Here\" is a feature film that is comprised of 11 short films that will be released throughout this year, according to the statement. An NFT collection called Glimpses can be claimed on Zora, a platform artists and brands can use to mint non-fungible tokens. \"Glimpses are open-edition art pieces that will connect audiences to an interactive experience while viewing the 'New Here,'\" short film series, the statement also said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Navalny","content":"ORGANIZATION"},{"type":"Academy Award","content":"ORGANIZATION"},{"type":"-1.89%","content":"PERCENT"},{"type":"Boris","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Francis Ford Coppola","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Shane Boris","content":"PERSON"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"Decentralized Pictures","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Nina Rong","content":"PERSON"},{"type":"New Here","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}