{"summary":"The institutional broker market in crypto is heating up. And Genesis Global Trading is the latest to throw its hat in the ring.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65928\/genesis-crypto-prime-broker-race","publishDate":"2020-05-21T09:00:30","id":11898,"type":null,"title":"Digital asset trader and lender Genesis joins the race to build a crypto prime broker","category":["MARKETS"],"content":["Michael Moro, CEO of Genesis Trading, was calling for a cryptocurrency prime broker as far back as 2018.","\"The better option from a markets structure perspective is to have a prime broker sitting in the middle where all you have to do is wire one account and you can trade,\" he told this reporter in a 2018 interview for&nbsp;<a href=\"https:\/\/www.businessinsider.com\/prime-brokers-are-needed-in-the-bitcoin-market-2018-6\" data-v-f87c67ca=\"\">Business Insider<\/a>.&nbsp;","Then, industry insiders were calling for more intermediaries to sit between the spine-tinglingly volatile market and investors.&nbsp;Such go-betweens, which have existed for decades in traditional capital markets, could offer clients credit to trade across various markets and identify venues for the best price.","Now, Genesis is ready to dive into the prime broker market itself, the firm announced Thursday. The new service, dubbed Genesis Prime, will leverage the firm's existing trading and lending capabilities as well as the custody platform of Vo1t, a company Genesis recently acquired, Moro said in a phone interview with The Block.&nbsp;","\"In the equity world, the prime brokers are also custodians,\" he said. \"You really can't be non-custodial and call yourself a prime broker, it is basically table stakes.\"","The development comes as the market for brokers in crypto heats up.","Recently, FalconX, which is marketing itself as a prime broker, emerged from stealth mode. The company <a href=\"https:\/\/techcrunch.com\/2020\/05\/13\/falconx-raises-17m-to-power-its-crypto-trading-service\/\" data-v-f87c67ca=\"\">raised<\/a> $17 million from investors, including Coinbase Ventures, Fenbushi, and Accel. BitGo, which recently launched a <a href=\"https:\/\/www.theblockcrypto.com\/post\/57805\/as-crypto-credit-bubble-concerns-loom-bitgo-announces-launch-of-a-150-million-lending-business\" data-v-f87c67ca=\"\">lending business,<\/a> is building out its own prime broker offering, according to several people with knowledge of the firm's plans. The company, which is best known for its custody and wallet business, has had a <a href=\"https:\/\/angel.co\/company\/bitgo\/jobs\/808131-senior-software-engineer-prime-services\" data-v-f87c67ca=\"\">job ad<\/a> seeking a senior prime services software engineer to build out APIs tied to the clearing, settlement, and lending of digital assets.","Elsewhere, <a href=\"https:\/\/tagomi.com\/\" data-v-f87c67ca=\"\">Tagomi<\/a>&nbsp;— an early pioneer of best-execution in crypto — continues to build out its platform to become a full-scale prime broker. FalconX, for its part, plans to roll out a number of enhancements to its services, such as cross-border B2B payments. Fidelity Digital Assets, the crypto unit of Fidelity, recently <a href=\"https:\/\/www.thetradenews.com\/fidelity-expands-liquidity-digital-asset-platform-erisx\/\" data-v-f87c67ca=\"\">expanded<\/a> its pool of available liquidity by linking up to Chicago-based ErisX.&nbsp;","In many respects, these firms are heading in the same direction from different starting points, Moro noted.&nbsp;","\"I've said for a while, give it a couple years and we will all look exactly the same in terms of the products and services we offer,\" he said. \"Except each of us would have started in a different place.\"","For Tagomi and FalconX, the starting place was execution, whereas BitGo and Fidelity Digital Assets kicked things off with custody.&nbsp;","Still, the proverbial holy grail is missing, some market specialists say. That is to say, a prime-broker with all of the bells and whistles, spanning spot and derivatives trading aggregation, the extension of credit to trade, and capital introduction services.&nbsp;","\"Does crypto have a prime broker in a binary sense? No,\" said Blocktower Capital founder Ari Paul. \"A lot of players from different angles are attacking the prime feature set, but when most of them say they are prime-brokers it is a bit aspirational.\"","As for Genesis, its aspirations to build out a prime broker raises interesting questions given its main proprietary trading business. For instance, how do we know that Genesis — which makes money by trading against counter-parties — will act in the best interest of its prime broker clients? Moro says there will be boundaries in place.&nbsp;","\"The folks dealing with assets in custody are not the prop traders,\" he told The Block.&nbsp;","Over the next few months, the company will roll out an agency desk that will be separate from the prop trading business. Like Tagomi and FalconX, that desk will scour venues and trading desks for the best price at any given time and will not take a spread.&nbsp;","\"It is not motivated at all to transact with Genesis,\" he said.&nbsp;","To be sure, it is still early days for Genesis. To start, the firm will integrate Vo1t's&nbsp;technology with its existing platforms. Then, it will launch a \"one-stop shop broker interface\" through which clients can move through its trading, custody, and lending services.&nbsp;","As he said in a press announcement: \"Stay tuned. We're just getting started.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Moro","content":"PERSON"},{"type":"Tagomi","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Blocktower Capital","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Moro","content":"PERSON"},{"type":"Fenbushi","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Accel","content":"ORGANIZATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"$17 million","content":"MONEY"},{"type":"Ari Paul","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}