{"summary":"Domain Money launched in January of this year but found it hard to attract users in the current market environment.\nThe firm reported just 398 users in March, and 28 employees have since left.\nFounder Adam Dell’s previous venture, Clarity Money, was acquired by Goldman Sachs and later became part of Marcus by Goldman Sachs.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180339\/domain-money-flounders-as-adam-dells-firm-reports-less-than-400-accounts-the-information","publishDate":"2022-10-27T10:54:45","id":1189,"type":null,"title":"Domain Money flounders as Adam Dell&#x27;s firm reports less than 400 accounts: The Information","category":["Markets"],"content":["Former Goldman Sachs partner Adam Dell is finding that navigating the crypto bear market is a challenge as Domain Money struggles to find users and keep staff.&nbsp;","Domain Money offered clients five portfolios with a minimum investment threshold between $100 and $500. The portfolios had a mix of crypto and stock exposure and charged a 1% annual management fee.","As of March, this year, Domain Money — which <a href=\"https:\/\/domainmoney.com\/resources\/domain-money-raises-33%20million-serious-control-crypto-stock-investing\" data-v-f87c67ca=\"\">raised<\/a> $33 million at the beginning of the year — had just 398 accounts with around $400,000 in customer money, <a href=\"https:\/\/www.theinformation.com\/articles\/ex-goldman-sachs-partner-adam-dells-crypto-startup-stumbles\" data-v-f87c67ca=\"\">according<\/a> to a filing seen by The Information.","According to a recent ADV filing, Domain Money stopped offering its managed portfolios in August and plans to pivot the business operations.","The firm said it had 15,000 users on a LinkedIn <a href=\"https:\/\/www.linkedin.com\/posts\/domainmoney_15k-users-at-domain-money-thank-you-all-activity-6952272135994171393-ngKa?utm_source=share&amp;utm_medium=member_desktop\" data-v-f87c67ca=\"\">post<\/a> in July. This figure more likely represents the number of people who have signed up, not necessarily the number who have linked their financial information to the app or had actively invested, a source told The Information.","Goldman Sachs acquired founder Adam Dell's last project, Clarity Money, in 2018, which led him to work on Goldman's move into main street banking. Clarity Money was eventually <a href=\"https:\/\/www.theblock.co\/linked\/93252\/goldman-sachs-fintech-clarity-money-shutter\" data-v-f87c67ca=\"\">shuttered<\/a>, with Marcus by Goldman Sachs assuming its business.&nbsp;","Dell worked as a partner at the investment bank until 2021, when he left to start Domain Money, bringing a slew of Goldman employees with him. However, many of these employees who followed Dell have since left, according to The Information — 28 to be precise.","Of the 28 exits from the firm, 11 of those were employees that joined directly from Goldman when Dell left to set up his latest venture. Andrew Pesco, former head of investment management at Domain Money was one of them, and he returned to Goldman in August, <a href=\"https:\/\/www.linkedin.com\/in\/andrew-pesco-22797746\/\" data-v-f87c67ca=\"\">according<\/a> to his LinkedIn.","Domain Money's launch coincided with a crash in crypto prices. Bitcoin and ether have tumbled over 50% since January, while the crypto market cap has more than halved from $2.31 trillion to $1.04 trillion today.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/crypto-total-marketcap\/embed\" title=\"Crypto Total Marketcap\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Dell <a href=\"https:\/\/www.theblock.co\/post\/157718\/domain-money-ceo-on-responsible-crypto-asset-management-and-where-failed-lenders-went-wrong\" data-v-f87c67ca=\"\">appeared<\/a> on The Scoop in July, saying the firm would differentiate itself through quality portfolio managers. Domain Money brought teams from Goldman Sachs and Bridgewater to help construct and manage portfolios. However, it appears there wasn't an appetite for Dell's latest offering as the firm now looks to pivot the business model.","Domain Money did not immediately respond to a request for comment from The Block."],"hashtag":[]}