{"summary":"Lumoz (formerly Opside) has raised $6 million in a pre-Series A funding round at a $120 million token valuation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286969\/lumoz-crypto-funding-token-round-valuation","publishDate":"2024-04-08T10:00:02","id":119,"type":null,"title":"Blockchain scaling infra provider Lumoz raises token round at $120 million valuation","category":["DEALS"],"content":["Lumoz (formerly Opside), a blockchain scaling infrastructure project that helps developers launch zk-rollups, has raised a pre-Series A funding round at a $120 million valuation.","Investors in the round included OKX Ventures, HashKey Capital, KuCoin Ventures, Comma3 Ventures, Kronos Ventures, Kernel Ventures and Polygon co-founder Sandeep Nailwal, Lumoz said Monday. The funding round was sized at $6 million, a source with direct knowledge of the matter told The Block. A HashKey Capital spokesperson confirmed the firm's participation in the round.","Lumoz began raising for the round this February and closed in March, co-founder Jeffrey Yang told The Block. It was structured as a simple agreement for future tokens (SAFT) round, Yang said, adding that $120 million is a fully diluted token valuation.","Lumoz's pre-Series A round comes a year after it raised $4 million in a seed funding round in April 2023, then known as Opside. Yang said rebranding to Lumoz happened last October because the project was misunderstood as working on optimistic rollups when it was helping build zk-rollups.","Founded in March 2022, Hong Kong-based Lumoz is broadly a blockchain scaling infrastructure provider. Specifically, it is a zk-rollup as a service (<a href=\"https:\/\/www.theblock.co\/post\/248199\/the-zk-op-debate-in-raas-why-zk-raas\" data-v-f87c67ca=\"\">ZK-RaaS<\/a>) platform that helps developers launch their own application-specific zk-rollups \"with a single click.\"","\"We help others build zk-rollups and also provide the underlying modular compute layer,\" Yang said. \"There are substantial computing costs associated with zero-knowledge proof (ZKP) computation for ZK-rollups, which often surpass data availability (DA) costs, and Lumoz's modular compute layer aims to bridge this gap by offering modular computing support.\"","Yang said that Layer 2 projects ZKFair and Merlin Chain are already leveraging Lumoz's ZK-RaaS platform. Since Merlin Chain is a Bitcoin Layer 2 project, Yang said Lumoz can support all Layer 1 blockchains for scaling, not just Ethereum.","<a href=\"https:\/\/www.theblock.co\/post\/277994\/altlayer-strategic-fundraising-round-polychain-capital-hack-vc\" data-v-f87c67ca=\"\">AltLayer<\/a> can be seen as one of Lumoz's closest competitors, according to Yang. As RaaS platforms, AltLayer and Lumoz help developers build application-specific rollups using modular tech stacks. Existing rollup projects such as Arbitrum, Optimism and ZKSync, on the other hand, can be seen as general-purpose rollups.","Lumoz said its platform is compatible with most types of zk-rollups, including Polygon CDK, zkSync, Scroll and StarkNet.","With fresh capital in hand, Lumoz plans to expand its current team of over 30 people by hiring in the engineering and business development functions, Yang said. Lumoz also plans to launch the mainnet of its compute layer in July, Yang added.","There has been a points program going on at Lumoz for the last month. Yang said that all points can convert to future tokens, adding that the conversion ratio has not yet been decided. The token generation event is expected in August, he said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"Lumoz","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Yang","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"KuCoin Ventures","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Lumoz","content":"LOCATION"},{"type":"Lumoz","content":"PERSON"},{"type":"$6 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Kronos Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Yang","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Kernel Ventures","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"$120 million","content":"MONEY"},{"type":"Merlin Chain","content":"PERSON"},{"type":"Jeffrey Yang","content":"PERSON"},{"type":"October","content":"DATE"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","ROLLUPS","SERIES A"],"authors":["Yogita Khatri","The Block"]}