{"summary":"In a bid to give users better command over their own vehicle data, DIMO deployed a decentralized automotive data insight network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193837\/decentralized-automotive-insight-network-dimo-launches-mainnet","publishDate":"2022-12-12T16:21:21","id":11904,"type":null,"title":"Decentralized automotive insight network DIMO launches mainnet","category":["CRYPTO INFRASTRUCTURE"],"content":["DIMO deployed a decentralized automotive data insight network in a bid to give users better command over their own vehicle data.","The company hopes to save users money on automotive sales, purchases, and services by plying their own data metrics.","DIMO Network, a decentralized automotive data insight network, today launched its mainnet, which aims to give users more control over— and potentially earn rewards from — driving data.","<span data-v-f87c67ca=\"\">Users that plug their cars in and provide information to the network will receive an airdrop of tokens over the next three months that, among other functions, provide a governance utility to network participants. Ongoing token rewards for users who offer viable telemetry to the network are to be distributed on a weekly basis.<\/span>","<span data-v-f87c67ca=\"\">“You can kind of think about it like the DMV or the digital twin of your car. You get to register your vehicle. We enforce uniqueness on the car so we can know this is the only version of this car connected to DIMO and we can tell what kind of car it is and what data it's producing,” DIMO co-founder Andy Chatham told The Block in an interview.<\/span>","<span data-v-f87c67ca=\"\">The airdrop is part of the company’s effort to turn the protocol over to token holders and will end in three months, according to DIMO. <\/span>","The decentralized alternative gives users a way to monetize their data. The existing user-data marketplace is primarily used by corporations for corporate interests.","“We're collecting on behalf of the owner of the vehicle with their authorization and they're excited about it,” said Chatham, “versus OEMs that are collecting that data from the vehicles kind of like through the back door and getting you to agree to the terms and agreements.”","Chatham said DIMO was approached by corporate entities to broker an agreement to purchase data from the company but he turned them down over concerns that the data would be turned against consumers.","<span data-v-f87c67ca=\"\">Currently DIMO’s vehicle network consists of 4,200 cars, including 480 different models that have streamed nearly 24 million miles worth of data.<\/span>","<span data-v-f87c67ca=\"\">The information gathered by DIMO can vary from one vehicle model to another. “It's very easy for people to start ... they just put in their credentials into our app,” said Chatham of the roughly 1,400 Teslas on the network, adding the network receives “rich data about the battery performance” from the connected cars.<\/span>","<span data-v-f87c67ca=\"\">Other vehicles networked with DIMO require a piece of hardware that connects via universal car adapters and can be fine-tuned in order to offer data insights on miles driven, diagnostic codes, tire pressure and a wide range of telemetry. Within the device, a SIM card pings one of any three cellular networks to send gathered insights back to DIMO’s network.<\/span>","<span data-v-f87c67ca=\"\">An important distinction between DIMO’s approach versus data collection tools present in original equipment from manufacturers, referred to as \"OEMs\" in the industry, is that DIMO does so on behalf of the vehicle owners, Chatham explained.<\/span>","<span data-v-f87c67ca=\"\">For now, DIMO is focused on simple use cases, such as providing data from DIMO to an affiliate company to reduce car payments for Tesla owners who opt in, for which DIMO receives a cut. In return for using the affiliate service, users also receive tokens from DIMO, a model that Chatham said makes sense for the time being.<\/span>","<span data-v-f87c67ca=\"\">“We also just added valuations to the app, so we're pulling in instant valuations from CarMax, Carvana and Vroom, and then a bunch of other valuation sources. So if you want to go sell your car, you can do that with the data you've already collected attached to it and potentially get a better price than you would otherwise,” Chatham said.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For its next phase DIMO is building a developer platform. “What we're really interested in is building better apps and services for people that help them navigate the used car market or the insurance market or get better maintenance for their car, sell their car for more money when they go to sell it,” said Chatham.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vroom","content":"PERSON"},{"type":"DIMO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CarMax","content":"ORGANIZATION"},{"type":"Andy Chatham","content":"PERSON"},{"type":"Chatham","content":"LOCATION"},{"type":"DMV","content":"ORGANIZATION"},{"type":"Carvana","content":"PERSON"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}