{"summary":"Crypto lending platform Salt has paused withdrawals and deposits.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187228\/crypto-lender-salt-halts-withdrawals-citing-ftx-impact","publishDate":"2022-11-15T12:29:44","id":11908,"type":null,"title":"Crypto lender Salt halts withdrawals citing FTX impact","category":["COMPANIES"],"content":["Crypto lending platform Salt paused withdrawals and deposits, according to a company email sent to customers.","The firm said in a message attributed to CEO Shawn Owen that \"the collapse of FTX has impacted our business.\" However, the full extent of the exposure was not disclosed in the message.&nbsp;","\"Until we are able to determine the extent of this impact with specific details that we feel confident are factually accurate, we have paused deposits and withdrawals on the SALT platform effective immediately,\" Owen wrote.","Owen went on to write that the company is \"working diligently with our partners to secure a clear path forward and plan to be as transparent as possible.\"","Salt is the latest crypto company to reveal that it was affected negatively by the collapse of FTX, which on Friday <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">declared bankruptcy<\/a>. Numerous crypto firms, including those in the trading and markets sector, held funds on the exchange prior to its downfall.&nbsp;","Salt did not immediately respond to a request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Shawn Owen","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Owen","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS"],"authors":["Michael McSweeney","The Block"]}