{"summary":"Wash trading volumes on Ethereum NFT marketplaces have fallen to 1.8% of total USD volume, the lowest rate in more than a year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272970\/nft-wash-trading-volumes-on-ethereum-marketplaces-hit-lowest-level-in-more-than-a-year","publishDate":"2024-01-16T16:29:01","id":11905,"type":null,"title":"NFT wash trading volumes on Ethereum marketplaces hit lowest level in more than a year","category":["METAVERSE & NFT"],"content":["Wash trading volumes on Ethereum-based NFT marketplaces are the lowest they've been since May 2022, The Block Pro's Data Dashboard shows.&nbsp;","NFT wash trading volumes on Ethereum marketplaces hit 1.8% on Jan. 9 and Jan. 13. That compares to 36.2% of trading volumes on Jan. 1, 2023, and it's also the lowest level since the 0.35% rate seen on May 1, 2022. The percentages refer to the portion of total USD volume associated with <a href=\"https:\/\/www.theblock.co\/post\/231892\/bitcoin-ordinals-nft-boom-wash-trading\" data-v-f87c67ca=\"\">wash trading<\/a>, a type of market manipulation in which individuals trade assets between themselves to artificially drive up price or the appearance of liquidity.&nbsp;","<span data-v-f87c67ca=\"\">Ratio of wash trading volume on Etheruem-based NFT marketplaces since Dec. 31, 2022. Image: The Block Pro Data Dashboard<\/span>","The NFT platforms that have contributed the the <a href=\"https:\/\/www.theblock.co\/post\/221344\/why-nft-wash-trading-was-up-126-in-february\" data-v-f87c67ca=\"\">most<\/a> to wash trading in the past — LooksRare, X2Y2 and Blur — have all made changes that dissuade such activity further.&nbsp;","\"We've started to see exchanges like LooksRare and X2Y2 begin to phase out some of their trading rewards programs,\" said The Block's Senior Research Analyst Rebecca Stevens. \"Blur was actively trying to filter wash traders from their airdrop, which has made wash trading less attractive. That, in addition to the valuations of several NFT marketplace tokens dropping, has caused overall wash trading to continue to decline.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 1, 2022","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Rebecca Stevens","content":"PERSON"},{"type":"May 2022","content":"DATE"},{"type":"0.35%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1.8%","content":"PERCENT"},{"type":"36.2%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Jan. 13","content":"DATE"},{"type":"Jan. 9","content":"DATE"},{"type":"Jan. 1, 2023","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block Pro Data Dashboard","content":"ORGANIZATION"},{"type":"Dec. 31, 2022","content":"DATE"},{"type":"Data Dashboard","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["BLUR","LOOKSRARE"],"authors":["MK Manoylov","The Block"]}