{"summary":"A new White House crypto policy report blasts digital assets as risky for both consumers and the entire U.S. financial system.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221815\/white-house-blasts-digital-assets-in-new-crypto-report","publishDate":"2023-03-21T18:30:20","id":11916,"type":null,"title":"White House crypto policy report blasts digital assets","category":["POLICY"],"content":["A new report from the White House blasts digital assets as failing to live up to their purported initial promise and raising risks for both consumers and the entire U.S. financial system.","<span data-v-f87c67ca=\"\">The president’s annual economic <a href=\"https:\/\/www.whitehouse.gov\/wp-content\/uploads\/2023\/03\/ERP-2023.pdf\" data-v-f87c67ca=\"\">report<\/a> to Congress casts major doubt on the benefits of digital assets, and comes almost exactly a year after President Joe Biden ordered multiple federal agencies to research and issue reports on the matter.<\/span>","<span data-v-f87c67ca=\"\">Noting that digital assets have been touted as distribution tools for intellectual property and financial value, a better payment mechanism, an avenue for increased financial inclusion and a way of cutting out financial middlemen, the report argues that “so far, crypto assets have brought none of these benefits.”<\/span>","<span data-v-f87c67ca=\"\">“Indeed, crypto assets to date do not appear to offer investments with any fundamental value, nor do they act as an effective alternative to fiat money, improve financial inclusion, or make payments more efficient; instead, their innovation has been mostly about creating artificial scarcity in order to support crypto assets’ prices — and many of them have no fundamental value,” the report issued by the Biden administration says. “This raises the question of the role of regulation in protecting consumers, investors, and the rest of the financial system from panics, crashes, and fraud related to crypto assets.”<\/span>","<span data-v-f87c67ca=\"\">The critiques in the report to Congress may signal a shift in approach from agnostic to openly adversarial toward digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The White House suggests that the Fed’s soon-to-be debuted faster payments network may eliminate much of the argument for digital assets, saying that “continued investments in the nation’s financial infrastructure have the potential to offer significant benefits to consumers and businesses.” The report casts doubt on — but does not rule out — the possibility of a U.S. central bank digital currency, saying that CBDCs could hurt credit availability and raise the risk of bank runs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The annual economic report notes that some of the benefits of distributed ledger technology may be achieved in the future. It specifically cites the New York Federal Reserve’s pilot program for a wholesale central bank digital currency aimed at making payments between banks, including cross-border transactions, virtually instantaneous.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The White House document also argues that digital assets are neither an effective store of value, nor an effective means of payment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There is also tension in an asset being promoted as both money and an investment vehicle,” the report reads. “As money, the instrument should have a stable value, suggesting limited price volatility. But as a risky asset, it should experience price volatility, for which an investor would be compensated with a high expected return. Holding everything else constant, the riskier an asset is, the less likely it can effectively serve as money.”<\/span>","<span data-v-f87c67ca=\"\">That includes the prospect of stablecoins becoming a widely adopted payment tool, the report says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Stablecoin holders that lack redemption rights may be unable to find willing counterparties to exit their stablecoin positions,” reads the document, which echoes a Financial Stability Oversight Council report that singled out Tether and Circle’s USDC. The White House adds that stablecoins are “too risky” to serve a broad payments purpose yet.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The White House appears to have a dim view of distributed ledger technology as a whole, citing arguments that previously existing technology could perform similar functions better, and poking holes in several specific use cases. It also notes the frequent noncompliance in securities and other financial regulatory law, large numbers of scams, and unusual concentration of activities by crypto trading platforms that would be prohibited at an existing exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The White House also blasts proof-of-work mining, arguing that it \"has few, if any, attendant benefits,” for the communities where miners set up while increasing local energy costs and heightening the risk of power crises.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">DeFi doesn’t escape the White House’s criticism either.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Though DeFi applications claim to help broaden access to credit by decreasing intermediation fees, they create serious risks to investors and cause at least two risks for the broader financial system: the use of significant leverage, and the performance of regulated functions without compliance with appropriate regulations.”<\/span>","<span data-v-f87c67ca=\"\">In the conclusion of its chapter on digital assets, the White House urges that regulators “must apply the lessons that civilization has learned, and thus rely on economic principles, in regulating crypto assets.”<\/span>","<span data-v-f87c67ca=\"\">The Council of Economic Advisers, one of the two main economic policy units within the White House, drafts the annual report, which the president signs off on. Biden in February nominated Jared Bernstein, a current member of that panel and former Obama and Clinton administration official, to become its chair. <\/span>","<span data-v-f87c67ca=\"\">Whether the criticisms presented in the report reflect a majority opinion in the administration remains to be seen. Lael Brainard, the former Federal Reserve vice chair and new head of the National Economic Council, the other major White House economic policy group, played an active role in the Fed’s CBDC research. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Council of Economic Advisers","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"New York Federal Reserve","content":"ORGANIZATION"},{"type":"Lael Brainard","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Obama","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"National Economic Council","content":"ORGANIZATION"},{"type":"Clinton","content":"PERSON"},{"type":"Jared Bernstein","content":"PERSON"},{"type":"Joe Biden","content":"PERSON"},{"type":"Biden","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"Circle’s USDC","content":"ORGANIZATION"}],"hashtag":["CBDCS","CFPB","CFTC","CONGRESS","FDIC","FEDERAL RESERVE","SEC","TREASURY DEPARTMENT"],"authors":["Colin Wilhelm","The Block"]}