{"summary":"The European Commission released a tender for a study on how to monitor the Ethereum network through “embedded supervision” and automate data collection from DeFi in real time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175920\/eu-commission-seeks-automated-ethereum-defi-monitoring","publishDate":"2022-10-10T10:26:32","id":11918,"type":null,"title":"EU Commission seeks automated Ethereum DeFi monitoring","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The European Commission released a bid to study the possibilities of monitoring decentralized finance through “embedded supervision” last week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Stemming from the Commission’s Directorate-General dedicated to finance and markets, the proposal sets out to investigate how financial supervisors could regulate Ethereum — which it sees as the biggest payment settlement platform for DeFi.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The pilot program would go on for a minimum of six months and is estimated at a value of €250,000 (approximately $242,500). Applications to participate remain open until December 1.<\/span>","<span data-v-f87c67ca=\"\">Lawmakers in the Commission recognize that DeFi and Ethereum’s open-source nature is a vantage point for regulatory watchdogs to follow protocol activity.&nbsp;<\/span><span data-v-f87c67ca=\"\">The study will focus on “automated supervisory data gathering directly from the blockchain to test the technological capabilities for supervisory monitoring of real-time DeFi activity,” according to the Commission’s <a href=\"https:\/\/ted.europa.eu\/udl?uri=TED:NOTICE:542418-2022:HTML:EN:HTML&amp;tabId=1&amp;tabLang=en\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">document<\/a>.<\/span>","<span data-v-f87c67ca=\"\">Patrick Hansen, EU policy and strategy head at Circle, <\/span><a href=\"https:\/\/twitter.com\/paddi_hansen\/status\/1579360087973367808\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\"> that the impact of the pilot could be significant a<\/span><span data-v-f87c67ca=\"\">s \"the capability of regulatory bodies to automatically monitor compliance by reading public blockchain data could drastically reduce the need for market participants (e.g. DAOs) to actively collect, verify &amp; deliver data to authorities.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$242,500","content":"MONEY"},{"type":"Commission","content":"ORGANIZATION"},{"type":"December 1","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Patrick Hansen","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"Commission’s Directorate","content":"ORGANIZATION"},{"type":"European Commission","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Inbar Preiss","The Block"]}