{"summary":"Onchain data shows the majority of bitcoin derivatives traders have taken a bullish stance in the past 24 hours, according to Coinglass data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272583\/bitcoin-long-short-ratio-high-binance","publishDate":"2024-01-15T07:57:40","id":11913,"type":null,"title":"Bitcoin long-short ratio hits multi-month high on Binance","category":["MARKET UPDATES"],"content":["The ratio between longs and shorts for bitcoin on <a href=\"https:\/\/www.binance.com\/en-GB\" data-v-f87c67ca=\"\">Binance Futures<\/a> has risen to a multi-month high. This metric is considered a barometer of investor anticipation, with a high long-short ratio indicating that more investors have a positive expectation for the bitcoin price.","In the past 24 hours, the long-short ratio has increased sharply to 2.86, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/btc-long-short-ratio-on-binance\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a><span data-v-f87c67ca=\"\"> — despite <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.060%\n    <\/span><\/a> <!----><\/span> retracing gains made since multiple spot bitcoin exchange-traded funds were approved. The present reading is relatively high, considering that if an equal number of traders were positioned long and short, the reading would be 1.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/btc-long-short-ratio-on-binance\/embed\" title=\"BTC Long\/Short Ratio on Binance\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Last week, before multiple spot bitcoin ETFs were approved, the long-short ratio was at a low of 0.86. However, after approval, the ratio rose, as traders speculated on the asset's appreciation.","Coinglass <a href=\"https:\/\/www.coinglass.com\/LongShortRatio\" data-v-f87c67ca=\"\">data<\/a> also concurs with that from The Block, showing that more trader positions are long rather than short. The crypto derivatives data analysis platform puts the current long-short ratio for bitcoin positions on Binance Futures at 2.63.","<span data-v-f87c67ca=\"\">The bitcoin long-short ratio on Binance Futures shows an increase in open long positions. Image: Coinglass<\/span>","According to <a href=\"https:\/\/www.coinglass.com\/LongShortRatio\" data-v-f87c67ca=\"\">Coinglass<\/a>, a high long-short ratio suggests bullish market sentiment, while a low ratio suggests bearish market sentiment.","The current bitcoin sentiment on Coinglass is weighted towards bullish bets. The distribution of long positions compared to short positions in the last 24 hours indicates that 42% of traders have adopted a bullish stance, whereas only 22% have taken a bearish position. The remaining percentage comprises neutral positions.","<span data-v-f87c67ca=\"\">Bitcoin sentiment indicator shows the majority of trader positions reflect a bullish perspective. Image Coinglass.<\/span>","Contrarian traders might analyze the current market structure and observe that many have already taken long positions. This cohort of traders might anticipate that the momentum of bullish sentiment is beginning to slow down or level off.","Contrarian trading strategies often involve going against the crowd, assuming that a crowded trade might be nearing exhaustion. These times of crowded trading, such as a relatively high or low long-short ratio, could be followed by a cascade of liquidations if the bitcoin price suddenly swings in a particular direction.","The price of the world's largest cryptocurrency by market capitalization declined by over 0.3% in the past 24 hours, falling to $42,602 at 7:50 a.m. ET, according to <a href=\"https:\/\/www.theblock.co\/prices\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"42%","content":"PERCENT"},{"type":"past 24 hours","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"-0.060%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"0.3%","content":"PERCENT"},{"type":"7:50 a.m. ET","content":"TIME"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Binance Futures","content":"ORGANIZATION"},{"type":"Coinglass","content":"ORGANIZATION"},{"type":"$42,602","content":"MONEY"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}