{"summary":"A CFTC complaint says that at least 29 customers transferred $1.3 million to California company Justby International Auctions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236072\/cftc-charges-california-firm-ceo-over-crypto-romance-scam","publishDate":"2023-06-22T16:19:20","id":11925,"type":null,"title":"CFTC charges California firm, CEO over crypto &#x27;romance scam&#x27;","category":["LEGAL"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Commodity Futures Trading Commission brought its first “romance scam” <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8726-23\" data-v-f87c67ca=\"\">case<\/a> on Thursday after it found a company misappropriated $1.3 million in customer funds that were intended to be used for digital asset trading.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">At least 29 customers transferred funds to California company Justby International Auctions to trade digital assets and forex on “supposedly legitimate trading platforms,” the CFTC said in the complaint. But those funds were not used to trade, and Justby CEO Cunwen Zhu instead used some of the funds for his personal use and transferred the majority to others involved, the agency said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The CFTC said “solicitors” reached out to customers on social media and “pretended to befriend or romance the customers” in an effort to have them open accounts.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“As people sought to escape the isolation of the pandemic and form a connection to others online, fraudsters saw a new venue to prey on and to take advantage of the public,” CFTC Director of Enforcement Ian McGinley said in the statement.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">From April 2021 through March 2022, Zhu and Justby accepted and misappropriated $1.3 million from customers, according to the CFTC.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“Solicitors established a rapport with the Scheme Customers by messaging them frequently, sharing purported pictures of themselves in expensive locales or with expensive items such as luxury cars,” the CFTC said in the complaint. “The Solicitor always claimed to be a highly successful trader and usually attributed their success to an ‘uncle’ or an ‘insider’ who provided them with inside knowledge.”<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Customers were also given false records “<\/span><span class=\"s2\" data-v-f87c67ca=\"\">to maintain the pretense that they were engaged in actual trading,” the agency said.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The agency is seeking restitution to defrauded customers, disgorgement of ill-gotten gains, civil monetary penalties, trading bans, and a permanent injunction against further violations of CFTC regulations.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Zhu was also charged with one count of wire fraud in the Middle District of Florida back in April, the CFTC said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Justby International Auctions","content":"ORGANIZATION"},{"type":"Middle District of Florida","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"$1.3 million","content":"MONEY"},{"type":"March 2022","content":"DATE"},{"type":"Cunwen Zhu","content":"PERSON"},{"type":"Ian McGinley","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}