{"summary":"The CFTC said consumers should be careful about scammers promising huge returns using artificial intelligence.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274695\/cftc-warns-about-ai-scams","publishDate":"2024-01-26T12:59:02","id":11923,"type":null,"title":"CFTC warns about AI scams promising huge returns using crypto arbitrage algorithms","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">The Commodity Futures Trading Commission on Thursday issued a consumer alert <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8854-24\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">warning<\/a> about artificial intelligence-fueled scams, some of which are promising outsized returns by using crypto arbitrage algorithms. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">\"With the growth of the use of AI in everyday life, scammers are making claims that it can generate huge returns using bots, trade signal algorithms, crypto-asset arbitrage algorithms, and other AI-assisted technology,\" the agency said in a statement, adding that social media influencers can spread false promises of quick profit.<\/span>","<span data-v-f87c67ca=\"\">\"Don’t believe the scammers. AI technology can't predict the future or sudden market changes,\" the agency said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The CFTC said it has pinned down several fraud schemes involving references to AI. One of them caused the loss of 30,000 bitcoins worth about $1.7 billion at the time.<\/span>","<span data-v-f87c67ca=\"\">\"Unfortunately, AI has become another avenue for bad actors to defraud unsuspecting investors,\" CFTC Office of Customer Education and Outreach head Melanie Devoe said in the statement.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"CFTC Office of Customer Education","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1.7 billion","content":"MONEY"},{"type":"Melanie Devoe","content":"PERSON"}],"hashtag":["CFTC"],"authors":["Anna Baydakova","The Block"]}