{"summary":"Lido’s staked ether (stETH) is now almost 7% cheaper than the price of ether (ETH) due to continued selling pressure from whale holders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151894\/lido-staked-ether-selloff-continues-as-larger-holder-unloads-56000-steth","publishDate":"2022-06-14T09:29:41","id":11920,"type":null,"title":"Lido staked ether selloff continues as larger holder unloads 56,000 stETH","category":["DEFI"],"content":["The Lido staked ether (stETH) token discount has deepened further following a large selloff of the token by a major holder.","On-chain <a href=\"https:\/\/etherscan.io\/tx\/0xf109137add2b0f4fce8e2df8b05f6272db2a440b5e6437fa1d2eb7d97b8dda0a\" data-v-f87c67ca=\"\">data<\/a> from Etherscan show wallet addresses, labeled as Three Arrows Capital in <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1536652831281016832?t=tkGthtD5w_4kcjqJZEk6eQ&amp;s=19\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a tweet from PeckShield<\/a>, selling over 56,000 stETH for ether (ETH). One <a href=\"https:\/\/etherscan.io\/tx\/0x58cb6b4c752f3e8b3fc9b4b33005095d729a4805da084cdcedbe7f2bd1bf2722\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">transaction<\/a> involved a 17,780 stETH swap for 16,625 ETH which was converted to the dai (DAI) stablecoin for $20 million.","Another batch of selling involved 38,900 stETH swapped for 36,718.64 ETH. This trade happened from another wallet labeled as 3AC. The <a href=\"https:\/\/etherscan.io\/address\/0x3BA21b6477F48273f41d241AA3722FFb9E07E247#tokentxns\" data-v-f87c67ca=\"\">wallet<\/a> in question still holds over 19,600 stETH as of the time of publishing.","Today’s stETH is the latest in a string of high-value swaps of the liquid staking derivative token that has seen staked ether become more decoupled from the price of ETH. One wallet sold close to 50,000 tokens on Thursday, <a href=\"https:\/\/www.theblock.co\/post\/151380\/lido-staked-ether-steth-discount-drops-to-5-for-second-time-in-one-month\" data-v-f87c67ca=\"\">as reported by The Block<\/a> at the time.","Lido, a liquid staking platform, gives users stETH in exchange for ETH staked on its platform. Thus, each stETH is backed 1:1 by ether staked on the Ethereum Beacon chain.","This, however, does not mean that stETH will always trade at the same price as ETH. Secondary market forces can create a slight disparity in the price of staked ether relative to ETH.","The disparity can be attributed to the uncertainty that comes from holding a derivative token rather than the underlying asset. ETH staked on the beacon chain cannot be withdrawn until Ethereum transitions to a proof-of-stake and the two parallel chains are merged.","Today’s selloff has also caused the stETH liquidity pool on Curve to become even more unbalanced. Curve is a major DeFi liquidity pool and serves as the primary source of liquidity for staked ether swaps.","Data from the stETH Curve pool now shows a <a href=\"https:\/\/curve.fi\/steth\" data-v-f87c67ca=\"\">ratio<\/a> of 20% ETH to 80% stETH. This means that liquidity for staked ether is shrinking and it will become increasingly difficult for swaps to proceed.","Shrinking liquidity and increasing price discounts could spell trouble for people with loans collateralized with stETH on DeFi lending pools like Aave. Further price declines would potentially impact these positions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Lido","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"Ethereum Beacon","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}