{"summary":"The lead of Animoca Labs&#x27; venture arm hopes the experiments of gaming giants will prove to be a boon for web3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230822\/animoca-ventures-console-gaming","publishDate":"2023-05-15T13:44:15","id":11936,"type":null,"title":"Animoca Ventures lead hopes console makers will save web3 gaming","category":["DEALS"],"content":["One of the world’s most prolific crypto gaming investors sees hope of a recovery in the sector spearheaded by mainstream gaming giants.&nbsp;","James Ho, head of the $100 million fund Animoca Ventures, the investment arm of Animoca Brands, told The Block in an interview that the web3 gaming sector — which has been blighted by a widespread decline in the price of tokens issued by its developers —&nbsp;is nevertheless attracting “some of the best, most profound veterans in gaming.”","He pointed to several examples including free-to-play gaming giant <a href=\"https:\/\/venturebeat.com\/games\/xterio-raises-40m-for-high-end-mobile-web3-games\/\" data-v-f87c67ca=\"\">FunPlus’s investment in Xterio<\/a>, a web3 mobile game developer; Final Fantasy developer <a href=\"https:\/\/www.ign.com\/articles\/square-enix-nft-blockchain-web3-elixir\" data-v-f87c67ca=\"\">Square Enix’s recent expansion<\/a> into blockchain gaming; and an unnamed studio that had been part of Tencent, the Chinese tech giant, that is now building a web3 first-person shooter. Ubisoft, the console gaming giant, is an investor in Animoca Brands, <a href=\"https:\/\/www.theblock.co\/post\/141245\/ubisoft-anchors-white-star-capitals-second-crypto-fund\" data-v-f87c67ca=\"\">as well as White Star Capital’s second crypto-centric fund<\/a> and other crypto outfits.","“Console makers never cared about free-to-play until it grew into multimillion users,” Ho said. “What we’re seeing here now is some of the console makers with their deep pockets want to get involved in potentially a fund to stay on top of innovation… And that to me is a signal that they want to build something in this space in the near future, or not too distant future.”","Ho added that Animoca Ventures is currently putting out feelers to raise a second early-stage venture fund and said certain “key Japanese console makers” had expressed interest. The first $100 million fund was unveiled in May 2022. Its focus is on seed and Series A stage investments in the crypto gaming space, and it has a mandate to allocate 10% of its capital to NFTs.&nbsp;","When its first fund was unveiled, crypto venture funding hit nearly $3.4 billion2 dollars for the month of May last year. Funding tumbled since then alongside cryptocurrency prices and the collapse of several firms including Voyager and Genesis. Still, last month was the highest month in venture funding for the blockchain sector year to date, receiving just shy of <a href=\"https:\/\/www.theblock.pro\/research\/april-blockchain-funding-recap-2-230298\" data-v-f87c67ca=\"\">$1.2 billion across 156 deals<\/a>, according to The Block Research.","The funds come mostly from external institutional backers, though Animoca Group’s cash is also in the mix. More than half the $100 million has been deployed so far, spread across roughly 100 startups, including well-known names like Yuga Labs, the Bored Ape Yacht Club creator.","The deep-pocketed investors in which Ho sees such promise must be careful not to repeat the mistakes of the first wave of crypto gaming innovators, he warned.","Big-name crypto games like Axie Infinity and Stepn drummed up tremendous interest during the crypto bull run with play-to-earn models that gave gamers token rewards in exchange for their patronage. Yet user activity and the value of those tokens declined sharply over the past year. &nbsp;","Animoca Brands’ financial position reflects that reality. The Hong Kong-based company <a href=\"https:\/\/www.reuters.com\/technology\/animoca-brands-token-reserves-down-36-after-crypto-plunge-2023-05-12\/\" data-v-f87c67ca=\"\">released an update<\/a> over the weekend revealing that its token reserves stood at $2.7 billion at the end of April, down 36% from the previous year.","“In the first run, we needed to really understand, does web3 gaming have merit? And without seeing the likes of Axie and Stepn, it wouldn’t have caused a ripple into the curiosity of the gaming developers,” Ho said.","The next wave of crypto gaming pioneers must “build a sustainable tokenomics,” Ho said. “In short, protecting the tokenomics and protecting the NFT strategy is going to be key.”&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/gaming\/non-ethereum-gaming-nft-sales\/embed\" title=\"Non-Ethereum Gaming NFT Sales\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Animoca Group","content":"ORGANIZATION"},{"type":"Enix","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"May last year","content":"DATE"},{"type":"James Ho","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"April","content":"DATE"},{"type":"Xterio","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"Stepn","content":"PERSON"},{"type":"$2.7 billion","content":"MONEY"},{"type":"36%","content":"PERCENT"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"$3.4 billion2 dollars","content":"MONEY"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Animoca Ventures","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["PLAY2EARN","SEED &AMP; PRE-SEED","SERIES A"],"authors":["Ryan Weeks","The Block"]}