{"summary":"Bitcoin plunged below $28,000 as Fed Chair Powell spoke to reporters in Washington. The central bank chief said rate cuts aren&#x27;t in the base case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221931\/fed-up-chair-powell-insists-rate-cuts-are-off-the-table-crypto-prices-fall-on-interest-rate-hike","publishDate":"2023-03-22T16:02:46","id":11934,"type":null,"title":"Fed up! Chair Powell insists rate cuts are off the table; crypto prices fall on interest rate hike","category":["MARKETS"],"content":["Fed Chair Jerome Powell admits the central bank considered a pause in the past few days, but ultimately it chose to increase the Fed Funds target rate by 25 basis points.","Inflation projections are still too high, and the Fed isn't ready to waver yet, according to Powell. There's a long way to go, and the road to its 2% inflation goal will likely be bumpy, he said during a press conference in Washington. As such, the Federal Open Market Committee increased the target rate range to 4.75% to 5% from 4.5 to 4.75%.","Rate cuts are not on the table, Powell said.","Bitcoin was trading at $27,295 by about 3:40 p.m. EDT, down over 3.4%, according to TradingView data. The leading cryptocurrency by market cap, which many have hailed as a safe haven asset in the past few days, plunged throughout Powell's speech. The DXY, which measures the value of the U.S. dollar relative to a basket of foreign currencies fell. Bitcoin's price usually increases when the DXY decreases.","","","The interest rate increase was in line with expectations, and the central bank <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20230322a.htm\" data-v-f87c67ca=\"\">said<\/a> it \"anticipates that some additional policy firming may be appropriate in order to attain a stance of monetary policy that is sufficiently restrictive to return inflation to 2% over time.\"&nbsp;","During his press conference Powell elaborated that line referred to additional interest rate hikes, though he emphasized the \"may\" in the sentence from the FOMC statement.&nbsp;","The committee's economic indicators point to \"modest growth in spending and production,\" while job gains picked up in recent months and are \"running at a robust pace,\" the announcement read. Unemployment remains low, and inflation remains elevated.&nbsp;","\"The committee is strongly committed to returning inflation to its 2% objective,\" it reiterated.&nbsp;","<span data-v-f87c67ca=\"\">source: bls.gov and federalreserve.gov<\/span>","Beyond the 25-basis point increase, the FOMC also increased its projections for 2024. The policy-setting committee now sees the Fed Funds rate staying around 4.3% next year, up from 4.1% in December.","The committee lowered its annual GDP expectations to 0.4% from 0.5%. It also expects economic growth to be sluggish in 2024, lowering projections to 1.2% from 1.6%.","Powell said that the events of the last few weeks and potential credit tightening, which could have an impact on inflation in its own right, might lead the central bank to assess its increases. When pressed on whether this meant it would pause rates, Chair Powell was quick to say the committee doesn't know enough at this moment in time.&nbsp;","It's too early to say whether these events would impact the possibility of a \"soft landing,\" he noted. Powell concluded his Q&amp;A session by stating that \"rate cuts are not in our base case.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"Washington","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"4.1%","content":"PERCENT"},{"type":"3.4%","content":"PERCENT"},{"type":"1.6%","content":"PERCENT"},{"type":"4.3%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"Powell","content":"PERSON"},{"type":"0.4%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"1.2%","content":"PERCENT"},{"type":"Jerome Powell","content":"PERSON"},{"type":"4.75%","content":"PERCENT"},{"type":"3:40 p.m. EDT","content":"TIME"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"$27,295","content":"MONEY"}],"hashtag":["CRYPTO MOVERS","ECONOMIC INDICATORS","EQUITY MOVERS","FEDERAL RESERVE","RATE DECISIONS"],"authors":["Adam Morgan McCarthy","The Block"]}