{"summary":"Founded by former Google ad professional, HypeLab aims to use on-chain data to help personalize ads for web3 companies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244521\/web3-ad-firm-hypelab-raises-4-million-in-round-led-by-shima-capital-and-makers-fund","publishDate":"2023-08-11T13:11:38","id":11942,"type":null,"title":"HypeLab raises $4 million in round led by Shima Capital and Makers Fund","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">HypeLab, a <\/span><span data-v-f87c67ca=\"\">web3 advertising <a href=\"https:\/\/www.hypelab.com\/\" data-v-f87c67ca=\"\">startup<\/a> that uses on-chain data to personalize and serve ads, raised seed capital of $4 million in a funding round led by VC firms <a href=\"https:\/\/www.theblock.co\/post\/187055\/shima-capital-backs-playembers-2-3-million-raise\" data-v-f87c67ca=\"\">Shima Capital<\/a> and Makers Fund.<\/span>","<span data-v-f87c67ca=\"\">Founded in part by former Google product manager Ed Weng, who has a background in digital advertising, the adtech aims to sell services to clients eager to get a headstart on connecting with the growing number of consumers embracing blockchain-enabled solutions and products.<\/span>","<span data-v-f87c67ca=\"\">Shima Capital General Partner Yida Gao cited the VC’s “excitement for web3 and confidence in adtech playing a critical role in the future of the ecosystem” as reasons for investing in HypeLab.<\/span>","<span data-v-f87c67ca=\"\">“Ads monetization is a pivotal component that will bring outside capital into the ecosystem and accelerate new user adoption in web3,” HypeLab CEO Joe Kim said in a statement. HypeLab also said it has already helped more than 50 companies “acquire new web3 users.\"<\/span>","<span data-v-f87c67ca=\"\">The fresh capital comes during a somewhat depressed period for new investment in blockchain startups. Last month, with $818 million invested in companies working in the blockchain space, funding in dollar terms fell by about 18% when compared to June, according to The Block data.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"$818 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Shima Capital General Partner Yida Gao","content":"ORGANIZATION"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Joe Kim","content":"PERSON"},{"type":"Ed Weng","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}