{"summary":"Hoping to make it cheaper to trade crypto in Brazil, Nubank will implement Talos&#x27;s &quot;Smart Order Routing engine.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266137\/nubank-partners-with-talos-to-trim-crypto-trading-costs-in-brazil","publishDate":"2023-12-05T13:00:18","id":11943,"type":null,"title":"Nubank partners with Talos to trim crypto trading costs in Brazil","category":["COMPANIES"],"content":["Nubank, the leading Brazilian digital bank by market value, has announced a partnership with institutional trading technology provider Talos geared toward reducing the cost of trading crypto.","\"With this partnership, customers who wish to trade crypto assets in Brazilian reais through the Nu app will benefit from reduced costs through Talos's Smart Order Routing engine and connectivity to optimize trade execution across multiple liquidity providers,\" the company said in a statement.","Nubank is one of the world's largest digital banks and serves 90 million customers across Brazil, Mexico and Colombia, the company also said. The fintech launched crypto trading in May 2022 and currently offers 15 cryptocurrencies through Nubank Cripto.","\"Nubank Cripto will continue to evolve as a platform that combines simplicity and robustness for cryptocurrency enthusiasts,\" Thomaz Fortes, leader of Nubank Cripto, said in the statement. \"With Talos, we have made further progress in this direction to offer users even more competitive prices securely and reliably when trading cryptocurrencies through an extensive network of settlement providers.\"","Brazil is viewed as a market with considerable potential for growth in the arena of cryptocurrency trading. Besides the country of more than 200 million people <a href=\"https:\/\/www.theblock.co\/post\/258952\/brazils-central-bank-plots-next-moves-in-adoption-of-cbdcs-digital-payments\" data-v-f87c67ca=\"\">developing its own<\/a> digital currency, top crypto organizations like <a href=\"https:\/\/www.theblock.co\/post\/222412\/coinbase-regulation-brazil-us\" data-v-f87c67ca=\"\">Coinbase<\/a> and payments firm <a href=\"https:\/\/www.theblock.co\/post\/250547\/buying-crypto-in-brazil-gets-easier-with-pix-payment-integration\" data-v-f87c67ca=\"\">Ramp<\/a> have invested in trying to grow their presence there.&nbsp;","\"Digital assets have an important role to play in the financial future of Brazil,\" Talos&nbsp; CEO and co-founder Anton Katz said in the statement.&nbsp;","Both the Chicago Mercantile Exchange and the Chicago Board Options Exchange are among the dozens of partners that make up the \"Talos Provider Network for cryptocurrency trading operation,\" the company also said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anton Katz","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thomaz Fortes","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"Mexico","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Nubank Cripto","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Colombia","content":"LOCATION"},{"type":"Nubank Cripto","content":"ORGANIZATION"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"Chicago Board Options Exchange","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}