{"summary":"Magic Eden has added support for buying and selling of non-fungible tokens on the Polygon network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189035\/magic-eden-expands-nft-support-to-polygon-network-embargo-9-am-et","publishDate":"2022-11-22T09:00:13","id":11944,"type":null,"title":"Magic Eden expands NFT support to Polygon network","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Magic Eden has added support for trading of non-fungible tokens on the Polygon network, a move that will boost its ability to work with gaming projects on the network. Rather than acting merely as a venue for NFT trading, the firm wants to expand and capitalize on the emerging blockchain gaming niche on Polygon.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMagic Eden is the largest NFT marketplace on Solana by trading volume. Earlier this year, the project went multi-chain, first <\/span><a href=\"https:\/\/www.theblock.co\/post\/160836\/magic-eden-to-launch-support-for-ethereum-nfts-in-coming-weeks\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">releasing<\/span><\/a><span data-v-f87c67ca=\"\"> its marketplace on the Ethereum blockchain in August.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Polygon is now the third blockchain that Magic Eden has integrated after Solana and Ethereum. Polygon, a proof-of-stake sidechain running parallel to Ethereum, allows for cheaper transactions for Ethereum-based applications.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By leveraging Polygon, the Magic Eden team noted that it is able to support game developers that want to integrate NFTs. “Given Polygon’s popularity amongst game developers as a low cost EVM-compatible chain, integrating Polygon will continue to cement Magic Eden as the go-to web3 gaming platform,\" Zhuoxun Yin, co-founder of Magic Eden said.<\/span>","<span data-v-f87c67ca=\"\">Magic Eden explained it wants to work with game publishers in the Polygon ecosystem via a new launchpad. In fact, several game publishers, including Bora, IntellaX, nWay, Block Games, Boomland, Planet Mojo, and Taunt Battleworld have agreed to release NFT-based gaming projects on Polygon via Magic Eden’s launchpad.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zhuoxun Yin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Boomland","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}