{"summary":"Polkadot-based DeFi protocol Parallel Finance has raised $22 million in a Series A funding round. \nParallel plans to launch its mainnet in the fourth quarter of this year, said founder Yubo Ruan.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/115984\/polkadot-based-defi-protocol-parallel-finance-raises-21-million-funding","publishDate":"2021-08-30T12:00:43","id":1194,"type":null,"title":"DeFi protocol Parallel Finance raises $22 million in Series A funding","category":["Venture Capital"],"content":["Parallel Finance, a Polkadot-based decentralized finance (DeFi) protocol that offers lending and staking services, has raised $22 million in a Series A funding round.","Polychain Capital led the round, with Lightspeed Venture Partners, Slow Ventures, Alameda Research, Blockchain Capital, CMT Digital, Blockchange Ventures, and others also participating. This was an equity round and values the project at $150 million, Parallel Finance founder Yubo Ruan told The Block. In June, the project raised $2 million, bringing its total funding to date to $24 million.","Parallel Finance was launched just five months ago and is currently in testnet on both <a href=\"https:\/\/www.theblockresearch.com\/mapping-out-polkadots-ecosystem-91104\" data-v-f87c67ca=\"\">Polkadot<\/a> and Kusama networks. The protocol offers two key services: leverage staking and liquidity mining. Leverage staking enables users to borrow against their staking collateral to increase their yield, and liquidity mining allows users to stake their Polkadot (DOT) tokens to receive Parallel's native tokens.","Parallel plans to launch its mainnet in the fourth quarter of this year, said Ruan. To that end, the project is looking to expand its current team of 20 people by mostly hiring engineers, he said.","There are currently 3,000 users of Parallel, and the protocol plans to onboard 10,000 users within six months and over 50,000 users within a year, said Ruan.","On the product roadmap side, Parallel is also looking at participating in Polkadot and Kusama crowd auctions. In order to launch a parachain on Polkadot's mainnet, projects need to win a crowd loan. There are only 100 parachain slots on the Polkadot network as of now, meaning there are only 100 projects that can operate on the main network until further notice, and the crowd loan is the only way currently for new parachains to connect to the Polkadot network, said Ruan.","Looking ahead, Parallel plans to also raise more funds, said Ruan. \"After we have TVL [total value locked] traction, we will do another round,\" he said.","<em data-v-f87c67ca=\"\">Update: After the publication of this story, Parallel Finance said it raised $22 million in its Series A round, not $21 million. The story and its headline have been updated to reflect that.<\/em>"],"hashtag":[]}