{"summary":"One Bored Ape Yacht Club holder seems to have mistakenly sold an NFT for 99.9% lower than the collection&#x27;s floor price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139554\/a-350000-bored-ape-nft-was-just-sold-for-only-115","publishDate":"2022-03-28T12:25:39","id":11957,"type":null,"title":"A $350,000 Bored Ape NFT was just sold for only $115","category":["NFTS"],"content":["A Bored Ape Yacht Club (BAYC) NFT has just been sold for 115 DAI ($115) in what appears to be either a costly mistake or a hack.","Data from <a href=\"https:\/\/opensea.io\/assets\/0xbc4ca0eda7647a8ab7c2061c2e118a18a936f13d\/835\" data-v-f87c67ca=\"\">OpenSea<\/a> shows the previous owner with the moniker “cchan” accepting a 115 DAI bid on Monday for BAYC #835. That's 99.9% lower than the current floor price — the lowest price one is available to buy — of the popular NFT collection.","The same owner also sold Mutant Ape #11670 for 25 DAI ($25) to the same buyer. The floor price for mutant apes is 22.6 ETH ($76,000).","While it is not immediately clear why the owner would accept such low offers, the situation seems to be a mistake with cchan confusing DAI for ETH. There were three other high-value bids for the Bored Ape between 75 ETH and 106 ETH placed by other collectors that were not accepted.","The floor price for BAYC sits at 106 ETH ($350,000) as of the time of writing. But the NFT in question sports sunglasses and a cigarette, several traits that mean it would typically sell higher than the current floor price. (It's hard to specify exactly how much it specific NFT should be valued — a wider problem that has been <a href=\"https:\/\/www.theblockcrypto.com\/news+\/138055\/nft-finance-part-2-the-pesky-challenge-of-pricing-nfts-at-scale\" data-v-f87c67ca=\"\">perplexing NFT traders<\/a> when it comes to <a href=\"https:\/\/www.theblockcrypto.com\/news+\/138014\/nft-finance-part-1-demand-is-exploding-for-loans-backed-by-nfts\" data-v-f87c67ca=\"\">using them for loans<\/a>).","Apart from being sold much lower than the floor price, the sale also represents a major loss for cchan, seeing as the BAYC NFT was initially acquired for 16 ETH in August last year.","Since the purchase, the new buyer has <a href=\"https:\/\/etherscan.io\/tx\/0x677a871a073921254024b90021882f66df7e6495b4404b4a7588cbab89e82241\" data-v-f87c67ca=\"\">claimed<\/a> the Ape tokens from the <a href=\"https:\/\/www.theblockcrypto.com\/post\/137829\/bored-ape-yacht-club-yuga-labs-virtual-land-sales-metaverse\" data-v-f87c67ca=\"\">ApeCoin airdrop<\/a>. They received <span class=\"mr-1\" data-v-f87c67ca=\"\"><span data-toggle=\"tooltip\" data-original-title=\"Current Price : $14.84 \/ APE\" data-v-f87c67ca=\"\">12,136 Ape tokens (<\/span><\/span>$180,000).","When reached for comment after the publication of this report, the owner told The Block that he was \"in the process of figuring it out as well. He said that he maintains a high degree of security on his accounts, especially during periods of travel, and would be \"hard pressed to call it a hack.\" The owner added that they were traveling and had not initiated any transactions.&nbsp;","What's strange about this whole situation is that the previous owner had to <a href=\"https:\/\/etherscan.io\/address\/0xa251D56DbFa4c59ff2C40e4023d7f5426Cb1e21b\" data-v-f87c67ca=\"\">approve their wallet<\/a> to be able to interact with DAI. That means a transaction will have popped up asking them to approve the use of the stablecoin — a sign that the payment wasn't being made with ETH. They then sold both the Bored Ape and the Mutant Ape within a minute of each other, suggesting they had decided to accept both offers in one go.","While this might suggest that this was a deliberate move (for some <span data-dobid=\"hdw\" data-v-f87c67ca=\"\">unbeknown<\/span> reason), a glance at the <a href=\"https:\/\/opensea.io\/0x4ed9aa0a83fc44135a17edf73fa110792f91b41b?tab=activity\" data-v-f87c67ca=\"\">buyer's wallet<\/a> shows otherwise. The buyer has been continously placing bids in DAI on multiple Bored Ape NFTs, seemingly looking to trick someone into believing the offer is in ETH and accepting the purchase. This suggets the seller fell into the intentional trap.","It's also possible that the seller had their account compromised. One Bored Ape Yacht Club member <a href=\"https:\/\/twitter.com\/NFApes\/status\/1508443291838263297\" data-v-f87c67ca=\"\">tweeted<\/a> that he had contacted cchan and that he was not aware of the sales — suggested he had been hacked.","The sale is not the first occurrence of an expensive NFT being sold for a fraction of its price. An NFT collector <a href=\"https:\/\/www.theblockcrypto.com\/linked\/122884\/cryptopunk-worth-850000-sells-for-just-a-fraction-of-its-price\" data-v-f87c67ca=\"\">mistakenly sold<\/a> a CryptoPunk worth $850,000 for only $19,000. In that instance, a misplaced decimal was the cause as the owner listed the piece for 4.444 ETH ($19,000) instead of 4,444 ETH ($19 million at the time).","BAYC holders are no stranger to mistakes, freak accidents, and phishing attacks when it comes to losing their prized NFTs. Many Bored Ape holders along with owners of other popular collections saw their holdings sniped at prices much lower than their market value due to an <a href=\"https:\/\/www.theblockcrypto.com\/post\/131443\/opensea-reimburses-users-sold-nfts-below-market-value-ui-issue\" data-v-f87c67ca=\"\">OpenSea UX bug<\/a> earlier in the year.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$850,000","content":"MONEY"},{"type":"$76,000","content":"MONEY"},{"type":"$115","content":"MONEY"},{"type":"BAYC #835","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$19,000","content":"MONEY"},{"type":"$25","content":"MONEY"},{"type":"BAYC NFT","content":"ORGANIZATION"},{"type":"$19 million","content":"MONEY"},{"type":"$180,000","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"},{"type":"August last year","content":"DATE"},{"type":"99.9%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$350,000","content":"MONEY"},{"type":"Mutant Ape","content":"ORGANIZATION"}],"hashtag":["OPENSEA"],"authors":["Osato Avan-Nomayo","The Block"]}