{"summary":"The tools include deploying smart contracts across all supported EVM chains, configuring drop mechanics and personalizing landing pages. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208233\/opensea-rolls-out-new-suite-of-tools-offering-one-stop-shop-for-nft-drops","publishDate":"2023-02-02T15:43:37","id":11956,"type":null,"title":"OpenSea rolls out one-stop shop for NFT drops","category":["NFT MARKETPLACES"],"content":["OpenSea has launched a suite of tools to let people or brands launch their own NFT projects.&nbsp;","The <a href=\"https:\/\/twitter.com\/opensea\/status\/1621233689052024835\" data-v-f87c67ca=\"\">tools<\/a> aid deploying smart contracts across all supported EVM chains, configuring drop mechanics and personalizing landing pages. This move followed OpenSea's efforts to create distinct tools for an augmented mint launch, such as immersive minting, scarcity trackers and royalty enforcement tools.&nbsp;","The company said that it will allow certain creators to use the one-stop shop minting tools over the coming weeks. It will be adding more features.&nbsp;","\"Our vision is to expand this product so that anyone can easily drop collections across any chain on OpenSea with an immersive, safe storefront — without needing access to robust technical resources or expertise,\" OpenSea said.","OpenSea is one of the most popular NFT marketplaces for Ethereum-based digital assets, bringing in 56% of the total NFT trading volume in January of this year, according to The Block's Data Dashboard. OpenSea partnered with U.S. record label Warner Music Group to facilitate music NFT launches.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"Ethereum NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"OpenSea","content":"PERSON"},{"type":"56%","content":"PERCENT"},{"type":"Warner Music Group","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["OPENSEA"],"authors":["MK Manoylov","The Block"]}