{"summary":"Auditing firm Debaub discovered a medium severity vulnerability in the Uniswap Universal Router smart contract that allowed third parties to potentially steal funds during token transfers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198949\/security-firm-debaub-finds-critical-vulnerability-in-uniswap-smart-contract","publishDate":"2023-01-03T14:52:24","id":11954,"type":null,"title":"Security firm Dedaub finds critical vulnerability in Uniswap smart contract","category":["DEFI"],"content":["Security auditing firm Dedaub received a Uniswap \"bug bounty\" worth $40,000 after discovering <a href=\"https:\/\/twitter.com\/dedaub\/status\/1610058814094450694?s=20&amp;t=EEHoww2SwG_X4mD3aUwxfg\" data-v-f87c67ca=\"\">a critical vulnerability<\/a> in a smart contract on the protocol.","The vulnerability was found in Uniswap’s <a href=\"https:\/\/uniswap.org\/blog\/permit2-and-universal-router\" data-v-f87c67ca=\"\">Universal Router contract<\/a>, a new technology and scripting language that allows users to swap multiple tokens for NFTs in one transaction.","Dedaub <a href=\"https:\/\/twitter.com\/dedaub\/status\/1610058822550265856\" data-v-f87c67ca=\"\">said<\/a> on Twitter that the vulnerability could have allowed someone to implement third-party code during a transfer and steal funds.","","","The UniversalRouter contract is capable of performing several transaction commands in a row on the back end, which improves the user experience. Dedaub found that the contract did not have what is known as a re-entrancy lock, which mitigates hackers from making additional commands during transfers that would allow them to steal funds.","Dedaub said it received immediate confirmation from the Uniswap team a few weeks ago when it first found the vulnerability. It received $40,000 in USDC for the discovery of the bug.","<em data-v-f87c67ca=\"\">(Corrects spelling of Dedaub throughout.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dedaub","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"},{"type":"Uniswap’s <a href=\"https:\/\/uniswap.org\/blog\/permit2-and-universal-router\" data-v-f87c67ca=\"\">Universal Router","content":"ORGANIZATION"},{"type":"UniversalRouter","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}