{"summary":"The fund has already raised $50 million from traditional and crypto-native LPs like LedgerPrime and FJ Labs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155162\/op-crypto-targets-100-million-for-fund-to-back-early-stage-crypto-fund-managers","publishDate":"2022-06-30T11:56:31","id":11966,"type":null,"title":"OP Crypto targets $100 million for fund to back early-stage crypto fund managers","category":["VENTURE CAPITAL"],"content":["OP Crypto, a venture capital firm, said on Thursday that it has launched a new fund to invest in fund managers focused on early-stage crypto investments.","The fund, called OP FOF I, has already raised $50 million from traditional and crypto-native LPs like LedgerPrime and FJ Labs. LedgerPrime is the subsidiary arm of crypto exchange FTX, and FJ Labs is a venture capital firm with $500 million AUM.","OP Crypto is targeting a $100 million hard cap.&nbsp;","<strong data-v-f87c67ca=\"\">“<\/strong>There is actually quite a lot of picked up demand due to people not knowing where exactly is best to park capital amidst the current bear market,” said Lucas He, general partner at OP FOF I and David Gan, president and advisor of OP FOF I, in a joint email to The Block.","“We offer a fairly downside protected safe haven vehicle with a very diversified portfolio base,\" they added. \"Especially for investors that are not as crypto native, this is the ideal vehicle to gain diversified exposure with a single check where LPs can also double down on investments that fit their thesis via co-investment opportunities from managers within the FOF vehicle.”","The new fund will back managers with expertise in areas such as DeFi, NFTs, metaverse, gaming and other unique web3 areas, focusing on geographies such as Latin America, Africa, India and Southeast Asia.","“From our venture vehicle perspective, we take a very disciplined approach to investing, having only invested 20% in the past year, and looking to double down when there is a market downturn at reasonable valuations,” said He and Gan.","“Lucas, a veteran in the crypto space since 2013 has been through three major market cycles and we see current market conditions as an ideal market for the FOF vehicle specifically, to back managers who have a similar disciplined approach to invest during this bear market with reasonable valuations and be able to catch the bull run upside.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Southeast Asia","content":"LOCATION"},{"type":"David Gan","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Gan","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Lucas","content":"PERSON"},{"type":"FOF","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Anushree Dave","The Block"]}