{"summary":"If done properly regulatory frameworks can help innovation, by reducing the risks of &#x27;confidence-destroying crashes,&#x27; he said on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173325\/regulators-must-extend-existing-processes-to-crypto-boes-jon-cunliffe-says","publishDate":"2022-09-28T06:47:56","id":11965,"type":null,"title":"Regulators must extend existing processes to crypto, BoE&#x27;s Jon Cunliffe says","category":["MARKETS"],"content":["Regulators must address cryptocurrency before it is of systemic importance, Jon Cunliffe, the Bank of England's (BoE) deputy governor for financial stability has said.","If done properly regulatory frameworks can help innovation, by reducing the risks of \"confidence-destroying crashes,\" he added, in a speech given at the AFME Conference.&nbsp;","The speech also touched on the potential for post-trade technology to improve processes. The post-trade taskforce, an industry group which the BoE acts as an observer for, said earlier this year that innovation in post-trade process has lagged behind other areas of financial markets.","The possibilities for disruption of the current post-trade landscape might come from innovative approaches and technologies that have been developed for the trading, clearing and settlement of cryptocurrencies, Cunliffe noted.","Tokenised representations of money and securities that trade in mainstream markets brings both components of the trade onto a single ledger, Cunliffe said. This process \"facilitates near-instant settlement of trades and, building on modern cryptography, atomic settlement.\"","Cunliffe also spoke about smart contract technology, and the ability of crypto exchanges to collapse a large number of activities into a smart contract. These activities, he said, would be split across custody banks, exchanges, central counterparties and central securities depositories, in traditional markets.","The opportunity to improve the process and gain in cost from consolidation could be significant, Cunliffe noted, \"fewer intermediaries should mean less fees.\" However, it is not just the end investor that could benefit, Cunliffe said a simplified structure with fewer participants in the process could make it more resilient, benefitting regulators.","\"With fewer critical points in the chain, the potential points of failure in the system are reduced.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cunliffe","content":"PERSON"},{"type":"Jon Cunliffe","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"AFME Conference","content":"ORGANIZATION"}],"hashtag":["BOE","CRYPTO"],"authors":["Adam Morgan McCarthy","The Block"]}