{"summary":"The investment manager&#x27;s new ETF exceeded $300 million in trading volume Tuesday, more than ten times its highest level of daily activity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278250\/vanecks-spot-bitcoin-etf-volume-skyrockets-over-1000-day-before-lower-fee-comes-into-effect","publishDate":"2024-02-20T14:43:26","id":11974,"type":null,"title":"VanEck&#x27;s spot bitcoin ETF volume skyrockets over 1000% day before lower fee comes into effect","category":["MARKETS"],"content":["Less than a week after VanEck filed a notice saying it would be lowering the fee it charges on its spot bitcoin ETF, the investment manager's fund experience a massive spike in trading volume.","On Tuesday, VanEck's spot bitcoin ETF surpassed $300 million in trading volume as of 1:50 p.m. ET, more than ten times what it traded on its best day so far. When VanEck's crypto-based ETF launched on January 11 it hit its previous high of daily trading volume when it registered $25.5 million, according to Yahoo Finance data compiled by The Block.","Bloomberg senior ETF analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1759985608989032736\" data-v-f87c67ca=\"\">took to X<\/a>&nbsp;to express his surprise for how well the fund was performing. VanEck's ETF \"is going wild today with $258 million in volume already, a 14x jump over its daily average, \" he posted. \"And it's not one big investor (which would make sense) but rather 32,000 individual trades, which is 60x its average.\"","\"Because ETFs trade on the secondary market, it can be challenging to know who or why someone buys an ETF,\" VanEck's head of ETF product, Ed Lopez told The Block. \"Today’s trading has sported great volume at tight spreads, which is ultimately what you’d want from an ETF, whether you're bullish or bearish on the market.\"","VanEck's ETF has struggled to keep pace with the products offered by BlackRock, Fidelity and Grayscale, <a href=\"https:\/\/www.theblock.co\/post\/275240\/blackrock-and-fidelity-spot-bitcoin-etfs-are-on-track-to-outpace-grayscale-in-daily-trading-volume-for-first-time\" data-v-f87c67ca=\"\">which have dominated<\/a> in terms of daily trading volumes since the new financial instruments launched last month. Both BlackRock and Fidelity charge a fee of 0.25% on their offerings, though the fees are partially waived for early investors. Last week, in a sign it potentially hoped to compete on price, VanEck <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1838028\/000093041324000609\/c108219_424b3.htm\" data-v-f87c67ca=\"\">filed a notice<\/a> with the Securities and Exchange Commission announcing it would lower its fee to 0.20% from 0.25%, effective on Feburary 21, or tomorrow.&nbsp;","\"We've publicly filed to lower HODL’s fee, and we have seen strong interest in our fund ... including great engagement from retail investors,\" said Lopez.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/bitcoin-spot-etf-volumes\/embed\" title=\"Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.20%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$258 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Feburary 21","content":"DATE"},{"type":"January 11","content":"DATE"},{"type":"$25.5 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Lopez","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Ed Lopez","content":"PERSON"},{"type":"1:50 p.m. ET","content":"TIME"},{"type":"$300 million","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["RT Watson","The Block"]}