{"summary":"The Block has exclusively obtained a draft version of the crypto regulation bill led by US Senator Cynthia Lummis.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149186\/heres-a-full-draft-of-senator-cynthia-lummis-landmark-crypto-bill","publishDate":"2022-05-27T15:10:29","id":11977,"type":null,"title":"Here’s a full draft of Senator Cynthia Lummis&#x27; landmark crypto bill","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">US Senator Cynthia Lummis (R-WY) has spent months teasing details of a comprehensive bill that addresses crypto regulation.<\/span> The Block has obtained a draft version that offers key details about the scope and impact of the bill.","The 70-page draft focuses on numerous aspects of US crypto regulation. These areas include which activities would fall under the jurisdiction of the Commodity Futures Trading Commission (CFTC), the Securities and Exchange Commission (SEC) and other federal regulators.&nbsp;","The Block understands that this version of the bill was shared by the Lummis team in the last month. A spokesperson for Lummis said that the draft version is dated March 1.","Extensive sections on stablecoin regulation and digital asset tax policy address many of the key blind spots in crypto regulation today. The bill appears to place significant aspects of the US crypto industry under the auspices of the CFTC. As the text notes:","“Except as otherwise provided by this section, the [CFTC] shall have exclusive jurisdiction over any agreement, contract, or transaction involving a contract of sale of a digital asset that is offered, solicited, traded, executed, or otherwise dealt in interstate commerce.”","Perhaps crucially, the draft bill adds the term “ancillary asset” to the Securities Exchange Act.","Namely, it defines such an asset as:","“An intangible asset that is offered, sold, or otherwise provided to a person in connection with the purchase and sale of a security through an arrangement or scheme that constitutes an investment contract.”","Further, an ancillary asset “may include a digital asset, as defined in section 9801 of title 31, United States Code, that is used to facilitate the governance of a distributed ledger technology network or decentralized autonomous organization.”","In conversation with The Block, sources from the industry had previously expressed concern that the bill would label many cryptocurrencies other than Bitcoin as securities.","<span data-v-f87c67ca=\"\">This is the first full version of the bill to come to light. <\/span>","In the months since the bill’s <a href=\"https:\/\/www.theblockcrypto.com\/linked\/128535\/sen-lummis-to-propose-new-us-crypto-market-overseer-next-year-report\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">initial announcement<\/a>, the senator’s staff has kept the actual text of the draft under wraps, using software that prohibits sharing and printing of the document. Various members of the crypto industry, lobby and Congressional staffers have expressed frustration about the limited access to the bill, which has changed frequently.","Lummis and her team have touted independent provisions of the bill publicly at both industry events and media events, with details remaining vague and ever-changing.","Lummis joined forces with Senator Kirsten Gillibrand (D-NY) <a href=\"https:\/\/www.theblockcrypto.com\/linked\/139245\/senators-lummis-and-gillibrand-are-collaborating-on-a-regulatory-framework-for-crypto\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">in March<\/a> of this year when the two teased they were collaborating on the forthcoming bill. Lummis, a staunch conservative and ally of Donald Trump, faced an uphill battle getting Democratic support for the bill.","Gillibrand said they were in “the beginning of the process” at a March 25 event hosted by Politico.","During that event in March, Gillibrand described the bill as a \"broad-based regulatory framework for how this industry should potentially be regulated in the future.\"","When reached for comment, Lummis' office told The Block that they will release a final draft of the bill on June 7. A representative for Gillibrand had not returned a request for comment as of publication time.","Following the publication of this story, Lummis said in a <a href=\"https:\/\/twitter.com\/SenLummis\/status\/1530281115247951872\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweet<\/a> that \"any language circulating online is an incredibly outdated version from March 1,\" adding: \"Stay tuned for our release of the actual bill on June 7th!\"","According to a source with knowledge of the behind-the-scenes process, staffers have continued to update the bill’s contents.&nbsp;","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Editor's Note:&nbsp;<\/strong>This story has been updated to reflect that, according to a post-publication comment from the Lummis team, the draft is dated March 1. Also adds a tweet from Lummis.&nbsp;<\/em>","<a title=\"View Lummis Bill Draft on Scribd\" href=\"https:\/\/www.scribd.com\/document\/576008331\/Lummis-Bill-Draft#from_embed\" data-v-f87c67ca=\"\">Lummis Bill Draft<\/a> by <a title=\"View Mike McSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/510415454\/Mike-McSweeney#from_embed\" data-v-f87c67ca=\"\">Mike McSweeney<\/a> on Scribd","<iframe frameborder=\"0\" height=\"600\" src=\"https:\/\/www.scribd.com\/embeds\/576008331\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-rwNXt6u0DRZEXFdZkj8I\" title=\"Lummis Bill Draft\" width=\"100%\" data-auto-height=\"false\" data-aspect-ratio=\"0.7729220222793488\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 7th","content":"DATE"},{"type":"9801","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June 7","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"March 25","content":"DATE"},{"type":"Lummis","content":"LOCATION"},{"type":"Lummis","content":"PERSON"},{"type":"March 1","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Securities Exchange","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Donald Trump","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"March<\/a> of this year","content":"DATE"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"United States Code","content":"LOCATION"},{"type":"Gillibrand","content":"PERSON"},{"type":"Mike McSweeney","content":"PERSON"}],"hashtag":["CFTC","CONGRESS","CYNTHIA LUMMIS","SEC"],"authors":["Kollen Post","The Block"]}