{"summary":"Brazil&#x27;s central bank picked eight new projects to advance through its LIFT Lab, including a DeFi staking pool from Itaú Unibanco.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166375\/brazils-central-bank-picks-itau-defi-project-among-new-innovation-proposals","publishDate":"2022-08-29T20:02:59","id":11971,"type":null,"title":"Brazil&#x27;s central bank picks Itaú DeFi project among new innovation proposals","category":["PAYMENTS AND BANKING"],"content":["&nbsp;","Brazil's central bank picked proposals for eight new projects to advance through its innovation lab, including a decentralized finance (DeFi) liquidity pool from Itaú Unibanco, the country's largest bank.&nbsp;","The proposed project will be a \"platform that, through blockchain and smart contracts, allows custody, currency exchange and alternative investments,\" a Central Bank statement in Portuguese said. \"The use case consists of creating a liquidity pool, with tokens that emulate stablecoins that can have parity with the [Brazilian] real, dollar or some other fiat currency, with its operation being similar to that of liquidity DeFis that operate in the digital asset market.\"","The list of proposals also includes several other blockchain-related projects. One proposal from Lovecrypto involves converting a stablecoin on the Celo blockchain into what would be Brazil's central bank digital currency (CBDC), the Real Digital. Another project from Delend Tecnologia would form a decentralized credit protocol aimed at small- and medium-sized businesses, while a separate proposal from Celso Jungbluth focuses on decentralized microcredit.","The lab will open on Sept. 12, and developers must submit a functional prototype and report for each project by Dec. 15.","Itaú is the largest Brazilian bank, according to <a href=\"https:\/\/www.spglobal.com\/marketintelligence\/en\/news-insights\/latest-news-headlines\/latam-s-50-largest-banks-by-assets-2022-69927370#:~:text=The%20top%20six%20were%20unchanged,the%20top%20five%20by%20assets.\" data-v-f87c67ca=\"\">S&amp;P Global<\/a>, holding more than $371 billion in total assets. The Central Bank also selected another Itaú project focusing on near-field communication (NFC) and QR code technology to further innovate PIX, the country's instant payment system.","This marks the fifth round of projects the LIFT Lab has selected since its launch in 2018. In March, LIFT separately chose to develop <a href=\"https:\/\/www.theblock.co\/linked\/136348\/brazils-central-bank-selects-nine-cbdc-projects-to-move-forward-in-innovation-challenge\" data-v-f87c67ca=\"\">nine projects<\/a> aimed at developing a Brazilian CBDC.&nbsp;","<em data-v-f87c67ca=\"\">Editor's note: The start date for the LIFT lab projects and a reference to the DeFi liquidity pool were updated.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delend Tecnologia","content":"ORGANIZATION"},{"type":"Celso Jungbluth","content":"PERSON"},{"type":"$371 billion","content":"MONEY"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"Real Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Dec. 15","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Sept. 12","content":"DATE"},{"type":"S&amp;P Global","content":"ORGANIZATION"},{"type":"Lovecrypto","content":"LOCATION"},{"type":"Unibanco","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}