{"summary":"Bitcoin was hovering just under $44,000 on Wednesday, with an influx of capital leading to an uptick in activity from crypto derivatives traders and","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266313\/bitcoin-price-hovers-around-44000-as-options-open-interest-hits-all-time-high","publishDate":"2023-12-06T13:38:02","id":11976,"type":null,"title":"Bitcoin price hovers around $44,000 as options open interest hits all-time high","category":["MARKETS"],"content":["The majority of the options traded in the past 24 hours have been calls, with a breakdown of 60% calls and only 40% puts. Calls give traders the right, but not the obligation, to buy the underlying asset at a set price up to a future expiry date. It is assumed that a trader who buys call options is implicitly bullish on the underlying asset, while a put buyer is bearish.","<span data-v-f87c67ca=\"\">Bitcoin options open interest hits an all-time high, according to Coinglass data.<\/span>","When examining the significant monthly options expiry on Jan. 26, 2024, the majority of options are calls. Among these call options, those with the highest trading volume in the past 24 hours have a strike price of $50,000, according to <a href=\"https:\/\/velodata.app\/options\" data-v-f87c67ca=\"\">Velo Data.<\/a> The prevalence of calls at this particular price suggests that traders anticipate a price rise above these levels for the underlying asset in early 2024.","The next most traded group of open options comprises calls with a strike price of $45,000, indicating that traders are protecting themselves against a potential price slide. However, there is a significant volume of calls at $75,000, implying that certain traders anticipate a substantial price appreciation for bitcoin in early 2024.","<span data-v-f87c67ca=\"\">Majority of bitcoin active options are calls at $50,000 for January 26 expiry, according to Velo Data.<\/span>","According to Bitfinex analysts, there are four major factors driving the latest bitcoin rally. The analysts cited the upcoming bitcoin halving, the possible approval of spot bitcoin ETFs, El Salvador's bitcoin bet creeping into profit, and a potential Federal Reserve rate cut in 2024.","\"The bitcoin halving, expected in April 2024, has traditionally led to price increases due to the reduced supply of new coins. This event is associated with supply scarcity, driving up the price. Combined with the fact that we currently have the highest supply inactive statistics, especially for long-term holders, this effect is already in play,\" the Bitfinex analysts said in a note sent to The Block.","The analysts added that if a spot bitcoin ETF gets approved, it could open the gates for a surge in institutional investment. \"The potential impact of institutional money on the bitcoin price could be important. In addition, the ETFs will go live a couple of months post the approval, which would imply an increase in the speculative window post such a bullish announcement,\" the Bitfinex analysts said.","According to Bitfinex, El Salvador's bitcoin adoption and further adoption by other nations or major companies could also bolster the value and credibility of the digital asset. \"A major development has been Argentina electing a pro-bitcoin head of state in an economy struggling with inflation,\" the analysts added.","Lastly, the Bitfinex note said that if central banks globally start to cut interest rates, it could make riskier asset classes like crypto more attractive. \"2022-23 has seen a very high correlation in monetary policy with crypto price trends and monetary policy,\" the Bitfinex analysts said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"April 2024","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"El Salvador","content":"LOCATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"January 26","content":"DATE"},{"type":"23","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Argentina","content":"LOCATION"},{"type":"$45,000","content":"MONEY"},{"type":"Jan. 26, 2024","content":"DATE"},{"type":"$75,000","content":"MONEY"},{"type":"Velo Data","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["ECONOMIC INDICATORS","RATE DECISIONS","SEC"],"authors":["Brian McGleenon","The Block"]}