{"summary":"Crypto exchange Coinbase is officially entering the crypto perps market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229021\/coinbase-launches-perps-exchange","publishDate":"2023-05-02T09:00:53","id":11975,"type":null,"title":"Coinbase launches international perps exchange — starting with 5x leverage","category":["THE BLOCK"],"content":["Crypto exchange Coinbase is officially entering the crypto perps market.","The firm, which has made headlines in recent weeks for its brouhahas with U.S. regulators and its plans to set up shop overseas, said Tuesday that it would enable international users to trade so-called perpetual futures out of Bermuda through a new platform.&nbsp;","Dubbed Coinbase International Exchange, the platform touts a robust trading experience delivered in partnership with a number of external market makers ready to provide liquidity, as well as a liquidation framework that “meets rigorous compliance standards,” according to marketing materials shared with The Block.","“<a href=\"https:\/\/www.coinbase.com\/international-exchange\" data-v-f87c67ca=\"\">Coinbase International Exchange<\/a> will enable institutional users based in eligible jurisdictions outside of the U.S., to trade perpetual futures,” the firm said. “Perpetual futures accounted for nearly 75% of global crypto trading volume in 2022, creating highly-liquid markets and offering traders additional versatility in their trading strategies.”","Coinbase plans to start business with bitcoin and ether derivatives “with additional listings to come in the future,” a spokeswoman said. Initially, it will offer traders 5x leverage.","As The Block previously reported, the firm has long been eyeing the build out of an offshore derivatives business to compete with behemoths like OKX and Binance. It was a business in which now defunct crypto exchange FTX had secured a large market share.","Coinbase isn’t alone. Rival Gemini recently announced that it would offer derivatives trading to customers across 30 jurisdictions.","The push by Coinbase and Gemini reflect the opportunity for firms to capitalize on the gap left by their fallen rival FTX, while also illustrating the uncertain regulatory environment stateside.","Coinbase recently escalated its own tussle with the Securities and Exchange Commission through the threat of a lawsuit following the agency’s issuance of a Wells Notice against the firm in March.","The firm announced last month that it would operate its new international exchange under Bermuda’s regulatory framework.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"75%","content":"PERCENT"},{"type":"Bermuda","content":"LOCATION"},{"type":"Coinbase International Exchange","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}