{"summary":"Commercial drone delivery is becoming a serious business, but it still faces technical challenges related to data sharing and trust. Blockchains could help with that, a new report published by the U.S. Department of Transportation (DOT) contends.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63133\/us-report-blockchains-medical-delivery-drones","publishDate":"2020-04-27T13:41:25","id":11972,"type":null,"title":"A new US government report explores how blockchains could be used to track drones carrying medical supplies","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Commercial drone delivery is becoming a serious business, but it still faces technical challenges related to data sharing and trust. Blockchains could help with that,&nbsp;<\/span><a href=\"https:\/\/rosap.ntl.bts.gov\/view\/dot\/48789\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a report<\/span><\/a><span data-v-f87c67ca=\"\"> published April 15 by the US Department of Transportation (DOT) contends.<\/span>","<span data-v-f87c67ca=\"\">Companies and governments all over the world are using unmanned aircraft systems (UASs) to deliver essential products, like medicines. For instance, last year Ghana launched the world's largest medical drone delivery service, which takes up to 600 on-demand flights per day to 2,000 health facilities spread across the country.<\/span>","<span data-v-f87c67ca=\"\"> \"The number of variety of UASs and the diverse operations they are or may be expected to soon be involved in make these aircraft especially suitable to the trust and operational integrity provided by blockchains,\" says the DOT report, which was penned by a group of contributors led by engineer Seamus McGovern of the John A. Volpe National Transportation Systems Center. The DOT's website describes the report as \"a high-level study of unmanned aircraft systems' flight operations that may benefit from the application of blockchain concepts.\"<\/span>","<span data-v-f87c67ca=\"\">A \"<\/span><a href=\"https:\/\/www.uasvision.com\/2019\/03\/11\/red-cat-releases-beta-version-of-blockchain-based-black-box-flight-recorder-for-uas\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blockchain-based black box<\/span><\/a><span data-v-f87c67ca=\"\">,\" for example, might provide data that would help investigators figure out what a drone was doing right before it crashed or failed. The report notes that IBM has obtained a patent for a system that would use a blockchain to help air traffic controllers chronicle each drone's flight path, and even respond in real-time if, say, the drone drifts too close to a restricted flight zone.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For a more concrete example, consider a drone that is supposed to deliver a human organ for a transplant. This has already happened; in 2019 a drone delivered a kidney that was then successfully transplanted, at the University of Maryland. The kidney flew 2.6 miles in 10 minutes over the city of Baltimore, whereas a car trip <\/span><a href=\"https:\/\/www.baltimoresun.com\/health\/bs-hs-organ-delivered-by-drone-20190426-story.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">would have taken 15-20 minutes<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">\"Not only is time an issue, but another concern is that en route the organ's progress is not normally known by the receiving hospital,\" and this lack of clarity can lead to unnecessary delays, notes the DOT report. In theory, adding a blockchain to the process would let all the entities involved – air traffic controllers, the drone operator, the drone itself, the hospital supplying the organ, and the hospital that is receiving it – track an important set of shared data. <\/span>","<span data-v-f87c67ca=\"\">They could have varying levels of access to the ledger, which might track the drone's position, its intended route, its fuel status, and essential information about the organ itself and its container.<\/span>","<span data-v-f87c67ca=\"\">\"In this case study, not only is a range of valuable information readily available, but it is also trusted, which is critical in both aviation operations and medical procedures,\" the report concludes.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"Seamus McGovern","content":"PERSON"},{"type":"Baltimore","content":"LOCATION"},{"type":"April 15","content":"DATE"},{"type":"John A. Volpe National Transportation Systems Center","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"US Department of Transportation (DOT","content":"ORGANIZATION"},{"type":"Ghana","content":"LOCATION"},{"type":"University of Maryland","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Mike Orcutt","The Block"]}