{"summary":"Secretary of the Treasury Janet Yellen will lay out the Treasury&#x27;s high-order perspective on cryptocurrencies in a speech Thursday morning.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141010\/treasury-secretary-yellens-first-speech-on-crypto-will-focus-on-existing-laws-except-for-stablecoins","publishDate":"2022-04-07T07:00:37","id":11981,"type":null,"title":"Treasury Secretary Yellen&#x27;s first speech on crypto will focus on existing laws — except for stablecoins","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Treasury Secretary Janet Yellen will speak on cryptocurrencies today at American University in Washington, DC.<\/span>","<span data-v-f87c67ca=\"\">A much-anticipated event, it is the first time Yellen is addressing the subject at length.&nbsp;<\/span><span data-v-f87c67ca=\"\">Based on excerpts of the speech shared with The Block and conversations with Treasury officials familiar with the matter, here’s what to expect.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The speech comes in response to President Joe Biden’s <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/136883\/janet-yellen-says-bidens-crypto-executive-order-supports-responsible-innovation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">March executive order on cryptocurrencies<\/span><\/a><span data-v-f87c67ca=\"\">, which directed agency coordination on broad frameworks for cryptocurrency policy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Like that executive order, Yellen’s speech will be high-level and politically minded, which is to say scant on details for specific policies. However, Yellen appears set to emphasize existing statutory authorities more than she will push for any new law expanding Treasury’s authority in crypto:<\/span>","<span data-v-f87c67ca=\"\">“In many cases, regulators have authorities they can use to promote these objectives and Treasury supports those efforts. To the extent there are gaps, we will make policy recommendations, including assessment of potential regulatory actions and legislative changes.”<\/span>","<span data-v-f87c67ca=\"\">Yellen’s remarks likewise say: “Wherever possible, regulation should be ‘tech neutral.” <\/span>","<span data-v-f87c67ca=\"\">She will also, Treasury officials say, be careful to contextualize cryptocurrency within historical assets and make recommendations “[c]onsistent with existing statutory mandates.”&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The primary exception will be stablecoins. Yellen will continue to support the <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/122890\/us-treasury-releases-long-awaited-report-on-stablecoin-risk-features-request-for-new-laws\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">President’s Working Group’s recommendations<\/span><\/a><span data-v-f87c67ca=\"\"> from November in some form or another.<\/span>","<span data-v-f87c67ca=\"\">Of note from the standpoint of regulation rather than new legislation, Yellen’s comments focus particularly on custody and tax reporting:<\/span>","<span data-v-f87c67ca=\"\">“Firms that hold customer assets should be required to ensure those assets are not lost, stolen, or used without the customer’s permission. And taxpayers should receive the same type of tax reporting on digital asset transactions that they receive for transactions in stocks and bonds, so that they have the information they need to report their income to the IRS.”<\/span>","<span data-v-f87c67ca=\"\">At the same time, Yellen’s speech will emphasize the Treasury’s support for innovation. Particularly, she will point to problems with the speed, cost and inclusiveness of existing payments as areas that could benefit from digital ingenuity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On April 6, Yellen <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/140892\/congresswoman-calls-yellen-to-account-for-work-on-targeting-crypto-in-russian-sanctions-evasion\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">appeared before the House Financial Services Committee<\/span><\/a><span data-v-f87c67ca=\"\"> to testify on the state of international finance, in a hearing that focused extensively on crypto’s role in Russia’s sanctions evasion.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Working Group","content":"ORGANIZATION"},{"type":"American University","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Janet Yellen","content":"PERSON"},{"type":"April 6","content":"DATE"},{"type":"November","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Russia","content":"LOCATION"},{"type":"DC","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Yellen","content":"PERSON"}],"hashtag":["JANET YELLEN"],"authors":["Kollen Post","The Block"]}