{"summary":"Galaxy Digital&#x27;s Alex Thorn indicates that approval of spot Ethereum ETFs in May is now highly doubtful due to SEC subpoenas and a lack of engagement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284284\/spot-ethereum-etf-approval-may-extremely-unlikely-galaxy-thorn","publishDate":"2024-03-22T16:30:07","id":11989,"type":null,"title":"Spot Ethereum ETF approval in May seems &#x27;extremely unlikely,&#x27; says Galaxy&#x27;s Thorn","category":["FUNDS"],"content":["<span data-v-f87c67ca=\"\">Approval for spot <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.063%\n    <\/span><\/a> <!----><\/span><\/span> exchange-traded funds in May now seems \"extremely unlikely,\" according to Alex Thorn, head of firmwide research at Galaxy Digital.<\/span>","Recent reports that the Securities and Exchange Commission has issued subpoenas to crypto firms regarding their relationship with the Ethereum Foundation, coupled with the SEC's lack of active engagement with ETF applicants just two months before the first deadline, have cast significant doubt on the May approval, Thorn wrote in a note on Friday.","Fortune this week <a href=\"https:\/\/www.theblock.co\/post\/283753\/sec-subpoenaed-firms-that-dealt-with-the-ethereum-foundation-fortune\" data-v-f87c67ca=\"\">reported<\/a> that the SEC is \"waging an energetic legal campaign\" to classify ether (ETH) as a security, citing U.S. companies that have received subpoenas related to an investigation. Meanwhile, The Block <a href=\"https:\/\/www.theblock.co\/post\/283686\/ethereum-foundation-has-received-a-confidential-enquiry-from-a-state-authority-shows-github-commit\" data-v-f87c67ca=\"\">reported<\/a> also this week that the Ethereum Foundation received a voluntary and confidential inquiry from an unspecified state authority, leading to the \"warrant canary\" removal from its website.","Thorn, a former Fidelity Investments veteran, suggested that if the SEC is seeking information about crypto firms' interactions with the Ethereum Foundation, it may be considering whether the original Ethereum initial coin offering (ICO) in 2014 was an unregistered securities offering rather than simply classifying the current secondary trading of ETH as securities trading. He speculated that while the SEC might differentiate between the ICO and the current secondary trading of ETH, any enforcement action against the Ethereum Foundation almost a decade later would be \"extremely irregular.\"","SEC Chairman Gary Gensler has refused to comment on whether the agency considers ETH a security. The SEC reportedly views Ethereum's 2022 \"Merge\" upgrade as enhancing the likelihood that ETH is a security due to the network's transition from proof-of-work to proof-of-stake. However, the SEC allowed the launch of several futures-based Ethereum ETFs in 2023, a year after Ethereum transitioned to PoS. Therefore, Thorn argued, if the SEC moves to allege securities violations against ETH or the Ethereum Foundation, it would be \"treading on tricky ground in terms of law, regulatory precedent, and impact on over a decade old industry.\"","If the SEC takes action against ETH or the Ethereum Foundation for the ICO, it would represent a significant escalation in enforcement efforts by a Commission currently facing challenges in court and on Capitol Hill, according to Thorn.","Thorn's perspective <a href=\"https:\/\/www.theblock.co\/post\/283330\/bitwise-cio-says-spot-ether-etfs-could-attract-more-assets-if-they-launch-later-than-may\" data-v-f87c67ca=\"\">mirrors<\/a> that of market experts who doubt the approval of a spot Ethereum ETF by May. Bitwise CIO Matt Hougan recently <a href=\"https:\/\/www.theblock.co\/post\/283330\/bitwise-cio-says-spot-ether-etfs-could-attract-more-assets-if-they-launch-later-than-may\" data-v-f87c67ca=\"\">said<\/a> that delaying approval might be beneficial, allowing Wall Street to digest the spot bitcoin ETFs before it is ready to focus on a new one. He anticipated that a later approval might result in even more assets.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"-1.063%","content":"PERCENT"},{"type":"2014","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Matt Hougan","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Fidelity Investments","content":"ORGANIZATION"},{"type":"Thorn","content":"LOCATION"},{"type":"Alex Thorn","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Thorn","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Capitol Hill","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["BITCOIN","BITCOIN FUTURES ETF","ETHEREUM","SPOT BITCOIN ETF","SPOT ETHEREUM ETF"],"authors":["Yogita Khatri","The Block"]}