{"summary":"BitMEX, once the world’s biggest crypto derivatives player, today launched a new prediction markets product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250632\/bitmex-launches-prediction-markets-as-it-doubles-down-on-derivatives-once-more","publishDate":"2023-09-13T03:27:27","id":11988,"type":null,"title":"BitMEX launches prediction markets, doubles down on derivatives","category":["EXCHANGES"],"content":["BitMEX, once the world’s largest crypto derivatives player, unveiled a new prediction markets product today.","The exchange operator said in a statement that the new tool lets traders capitalize on the outcome of real-world events, ranging from price action in crypto to pop culture — opening up new trading and hedging opportunities on the platform.","Under former CEO Alexander Höptner, BitMEX had previously pursued a strategy it billed as “beyond derivatives,” which involved branching into spot trading and several other new business areas. But after several rounds of restructuring and <a href=\"https:\/\/www.theblock.co\/post\/179580\/bitmex-ceo-alexander-hoptner-steps-down-with-immediate-effect\" data-v-f87c67ca=\"\">Höptner’s departure in October last year<\/a>, the firm has recently been getting back to its roots.","With the new product, Stephan Lutz, who took over as CEO and group CFO at BitMEX, said the firm wants its traders “to ride the waves of the ever-changing world.”","“This product adds the mojo to crypto derivatives trading, allowing traders to diversify their portfolios and earn returns by predicting outcomes of real-world news,” Lutz added.","”Especially in a bear market with low volatility, Prediction Markets is a great tool to level up your trading game. We start with three contracts and will be adding more topical and interesting ones soon.”","The first prediction contracts on the platform will give traders a path to bet on the percentage recovery rate of FTX’s bankruptcy claims and whether the U.S. Securities and Exchange Commission will approve a Bitcoin ETF before on or before Oct. 17, among other things.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Stephan Lutz","content":"PERSON"},{"type":"Lutz","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Oct. 17","content":"DATE"},{"type":"Alexander Höptner","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"October last year","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}