{"summary":"Episode 1 of Season 2 of The Scoop was recorded with Frank Chaparro, Ryan Todd, and JP Thieriot, CEO of Uphold. Listen below, and subscribe to The Scoop","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53253\/exploring-the-contrasting-use-cases-of-crypto-between-north-south-america-with-uphold-ceo-jp-thieriot","publishDate":"2020-01-16T15:15:26","id":11986,"type":null,"title":"Exploring the Contrasting Use Cases of Crypto Between North &amp; South America with Uphold CEO JP Thieriot","category":["THE BLOCK"],"content":["<em data-v-f87c67ca=\"\">Episode 1 of Season 2 of The Scoop was recorded with Frank Chaparro, Ryan Todd, and JP Thieriot, CEO of Uphold. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#f888979c9b998b8cb88c909d9a94979b939b8a81888c97d69b9795\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"45352a212624363105312d2027292a262e26373c35312a6b262a28\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK7331739951\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><span data-mce-type=\"bookmark\" class=\"mce_SELRES_start\" data-v-f87c67ca>﻿<\/span><\/iframe>","JP Thieriot is the CEO of Uphold, a crypto broker that<span class=\"sh-color-black sh-color\" data-v-f87c67ca=\"\"> serves 184+ countries, across 30+ currencies (traditional and crypto) and commodities with frictionless foreign exchange and cross-border remittance for members around the world.&nbsp;<\/span>","In this episode we explore:","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Ladies and gentlemen, thank you so much for tuning in to what is the first episode of The Scoop for 2020. I am your host, as always, Frank Chaparro Chaparro. I am joined this time by my very special colleague, Ryan Todd. And it's the New Year, so it's a new us. It's a new The Scoop. We're going to be changing things up a little bit. The same old quality guests, the same old quality questions, but the focus and the presentation of it, so to speak, is going to be a little bit different. The crypto universe, as many of you know, it is saturated, very oversaturated with folks coming on and, you know, basically having a Q &amp; A type conversation around that guest, their experiences, etc.. Each episode moving forward, we're going to change things a little bit. We're going to try to explore a question, and, of course, have guests come on who are experts in that in that given arena and explore their question with us. So I'm very excited about that. I'm very excited to kick off the new year with our guest today, JP Thieriot. He's the CEO of Uphold, a position which he's held since September 2018. They're one of many places you can buy and sell cryptocurrency assets. And Ryan, you know, I think we were discussing what we should talk about with JP. You met him in Davos, he has a great background in payment--&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Money20\/20. That's our standard correction.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">There's always one thing that you need to correct me on. Davos maybe next year he can join our event, or this year.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Las Vegas Davos.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Same thing, yeah.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">But we were talking about potential topics, and, you know, obviously, something that we're witnessing here at The Block is just the--not only is the podcast market oversaturated, but the market for places where you can buy and sell cryptocurrency assets, I think has never been more saturated with as many players as there are now. And at the same time, you have traditional--quote-unquote traditional--fintechs moving into the space, expanding their offerings. We're thinking Cash App, right?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Provenance, Robinhood, SoFi..&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">All of them are getting in it, and so the question is for a place like Uphold, JP, how do you see that playing out in 2020? Will this be the year of shaking out, where we see certain players, you know, kind of rise to the top? Or will it be more of the same? Is it just going to be a continuation of more players coming in and old players trying to survive? What do you think it'll look like?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">So that's a great question, and thanks for having me on your inaugural 2020 show. So I think 2020 is likely to be a year of consolidation for sure. Too many players in the crypto space, a long, sort of sideways to down, market and really no real delivery of utility to mom and pop, anything that's meaningfully changing their lives. Some interesting fodder for trading firms to speculate on and for, you know, Wall Street, for lack of a better term, to move into. Probably higher margins, less efficiencies than in equities and other trading markets, so it's interesting for folks to move in that direction. But in terms of moving from sort of crypto-native outward, I think we're still sort of waiting for--I think \"the killer app\" is maybe the wrong descriptor, but something that just makes people's lives easier on a day-to-day basis and doesn't mean that they have to be 25-year-old technophiles to be able to benefit. So, speaking from Uphold's vantage point, you know, we've always viewed it as, \"That will happen when one has a critical mass of things insofar as financial contents,\" and not just crypto, but maybe, you know, other asset classes that would be complementary, and to have them all in one place, easily accessible--and in many cases accessible for the first time, let's say the big regions of the world: Latin America, Africa, even Europe and some in some context--the second you can do that then you've done something different. And so, lots of people converging on a space, each with a slightly different angle, but I don't think crypto as a whole has delivered the compelling benefit yet.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">There isn't a compelling product out there that you see at the intersection of crypto and equities?<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, so it's really such a fascinating question. So what's the product? Is Bitcoin a product? Because if Bitcoin is a product, it's a fascinating one, right? It's digital gold, it's non-correlated. You could describe it as being--as someone did and I've always loved it--a shorting of the status quo. And I think, you know, those things have been delivered. Can a Libra, as an example, take that thread further? No. It just takes it back into boring old territories. What's a basket of fiat currencies? To whom does that deliver a benefit? Maybe for large multinational corporates are looking to hold balances in something that better reflects their business and say dollars or euros, but it doesn't introduce anything new. Bitcoin introduced something completely new. I think some of the utility tokens are useful in the measure that their ecosystems are delivering something new. Brave and BAT is a perfect example: you have a privacy browser that's captured the Zeit Geist insofar as the problems with Facebook and Google making you the product or us the product, so in the measure those things are delivering into real needs and they have a utility token that is an integral part of that ecosystem, those things will flourish as well. And, if you want me to keep going on this, one question, the one part that I've sort of been meditating on a little bit is if you look at this proliferation of tokens, 99.9% of them are probably pretty useless. You know, Bitcoin is useful. You could argue that XRP has some legitimate functions. And then again, I'll go back to BAT. There'll be others, but what sort of really caught me the other day was this notion that if you look at purchasing power over time. Yeah, I heard somebody describe the other day--in fact, I think we did an early video--that look at gold, right? An ounce of gold today, what is it, around 1500 bucks? It's about what it costs to buy a suit. For a Roman senator, buying a toga cost about an ounce of gold. So, you know, over time, it's held its value. I grew up--forget my Argentine childhood, in my U.S. childhood, a dime bought me a Kit-Kat. I don't know what my kid's paying for a Kit-Kat today, but, you know, two bucks or something, right?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">I think it's around two dollars.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Two dollars. Right.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">I love Kit-Kats.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">So the point is the best of the fiat currencies has not held its value relative to a marker of that over the eons, which is gold. And now you have a far more practical equivalent of it in Bitcoin. So you have some units of account scattered, you know, over a page, right? If you take that to extremes way below the dollar, you have Venezuela, Zimbabwe, Argentina, lots and lots of countries in the world have done a far worse job than the United States of managing its currency, and really the compunction there is spend this as fast as you possibly can because it's losing value by the hour. And I think people expected that Bitcoin would somehow become this transactional thing, but it hasn't. It's at the opposite end of the spectrum. I'm holding Bitcoin because I expect, given the way the world's unfolding, it'll be worth ten times what it's worth today at some moment in the possibly distant future, right? But in the middle, that's the fascinating part. Are there going to be private denationalized currencies that actually become transactional? And if that's a possibility, then it can only really come from crypto. That's what's fascinating. And the math, the calculus there isn't, \"I'm going to speculate on this thing because it's going to moonshot,\" or whatever the other descriptor would be. I just have to believe it's going to do better than -3% a year, which is the U.S. dollar. And the second crypto produces something like that, that's a game-changer. And it ain't Libra, right? It's somebody with some scale the economy where their currency of the realm can outperform any public currency.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">So you would say, to the Libra point, that even though it's stable in the sense that it's backed by some of the more stable currencies in the world--yeah, I guess this is all hypothetical because it doesn't exist yet--.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Right. And it probably won't, by the way.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Yeah, exactly. If people in, say, Venezuela and other countries with high inflation had access to something like that, you're still saying that because they're still exposed to these other currencies, that that's still not beneficial for them, or?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">No, it's totally beneficial. I mean, if you live in Venezuela, access to the Mexican currency is beneficial for you, right, in incremental terms. So, of course, it would be preferable to their current options then. I'm just saying that it doesn't introduce anything new into the world, whereas a crypto can introduce a denationalized currency into the world alla Hayek's theories. And now you have something kind of--how can a public sector currency, with trade unions and political trade-offs and compromises in the whole world that has a government, ever compete with an ecosystem that might be growing at 50% a year? Their products are demanded. There's a finite supply. You can always print more dollars, you can always print more pesos. You can't produce more BAT token, as an example. So if you have an economy that's now 10 million people--the size of Ireland's three, the size of Uruguay is three--you have something that's like nation-state size with fundamentals that are far better than public fundamentals could ever be. At some point, somebody is going to say, \"Wait a second, private currencies can be transactional and in fact, they ought to, they ought to out-compete.\"<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">It's interesting, the way you sort of describe or think about some of these crypto assets as being products themselves, right? And addressing where those products might find a market, right? Product market fit, whether it's Venezuela or somewhere else. Bringing the conversation back to the broader business landscape for so-called--I don't know if we'd call you guys a broker or something else, but a venue where you can buy and sell crypto assets--is the core of doing that successfully viewing crypto assets as a product and then thinking about where you can best deliver and serve that product?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Good question.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">I would guess, right? It sounds like you guys are in a similar vein as Abra, right, where it's like let's address the international market because that's where there is product-market fit: not necessarily here in the US, but in places like Venezuela.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, that's where you can deliver life-changing benefits as opposed to incremental conveniences, right? I think there's a market for it globally, but, you know, the new, scarier regime in Argentina is just coming in January. They wasted no time. Now Argentines can only buy two hundred U.S. dollars a month. Now if you want to use your Argentine debit card to buy Netflix or spend some money at Disney World, they tack on 30 percent, right? So imagine coming up with a card that they could use that isn't punished in that way, or it would allow them access to more than 200 dollars to store the fruit of their labor.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">So how does Uphold serve them?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">So we have users, lots of users--I would argue more users than any of our competitors--in Latin America specifically. We're approaching a million users, more than a half a million users in Venezuela. And in partnership with companies like Dash who are working on that sort of \"last mile\" transactionality of all these things, it really makes a difference in their lives. Somebody has a use for a pile of cash in the context of whatever their business is, but flow in the other direction: here's my useless pile of cash, give me some electronic value that I can safe harbor from the local disaster, there's a massive market for that.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">How do you build a business in Latin America, in as much as how is it different than building it here? And you grew up there, so you have some sense of understanding of the market.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">For sure. So I think it's a focus on those real-world benefits that, you know, again, crypto, I think, as a whole, at a very general level, has failed to do. You just focus on that. Hey, guys, you want a place to access dollars or gold or something that will hold value? Here is how you do it. We partner with local exchanges. At one point, we partnered with the largest local Bitcoin exchange in Brazil. We're doing the same deal now in Argentina, Uruguay, Chile, Mexico. So the notion is these local exchanges have done deals with the local banking system. Now you can move money as a Mexican from your bank account into the local Bitcoin exchange, and that Bitcoin exchange doesn't cover dollars, pounds, euros, gold, all these other assets we have there may be more conventional and it's a two-hop.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Kind of sounds similar to what Revolute offers in Europe just from being able to cross into different currencies. Is that kind of something similar, you'd say, like a good comparison, but for crypto?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yes. I think we've been at it, you know, a lot longer than Revolute, and our offering is truly global, whereas Revolute's is Europe looking to expand into the US. And I think, you know, we're covering close to 90 assets at this point. I'd be surprised of that more than, I don't know, a handful, ten or twelve or something. So the idea is that--and to another question you asked, because I went, sorry, so far into the rabbit hole of, you know, novel new units of account--the other major one is asset-backed units of account that don't necessarily have to be asset-backed in the context of a Libra backed by dollars, pounds, euros. They can be backed by--unfortunately, bad comparison, Venezuela is the first to do it--oil (Petro) or real estate or private equity or, eventually, all these other things. And in the manner that you bring those things on board, you digitize them and you fractionalize them, then you are democratizing access to everybody. So, you know, a millennial in Brazil can now access all these sorts of things that have been the exclusive domain of only the richest people in America and Europe and where they've been historical wealth creation engines for those very rich people who have all those choices. So that's, I think, the real thrust.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Well, it's interesting because crypto, the crypto market touches so many assets, if you think about it. It's kind of in an ambiguous state, if you will, right? You can tokenize cattle, real estate-- even though there hasn't been much success with the latter--but in any case, what does that mean for crypto businesses where, you know, you start out very simply in, you know--let's look at Cash App for an example, right--buying and selling Bitcoin to start. They also have stocks where you can, I think, get fractionalized stocks.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">It just launched.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Just launched. And, you know, Robinhood is another example. First, you know, it was only equities, now it's equities, crypto, and, I think, also fractionalized stocks. There are other cryptocurrency firms who are looking at both. I think if you think about eToro, they provide an example of equities and crypto as well. In order for these firms to succeed, do they need to get into all of those different assets?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">And even so, the examples Frank listed: self custody. So a lot of those, outside of Cash App, they're holding your coins for you, they're holding your keys. There's none of that in their system.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">It's a great point, and that's what I'd argue is today our biggest differentiator from all of those. And by the way, with Cash App, I think it's a very recent development. It was all synthetic. In other words, eToro, Abra, all these guys--and God bless them, and I think there's room for lots of players here; I don't think it's a one- or two-player market, but the only use case those guys are enabling is speculation, right? There is no way you can deposit your Bitcoin into Robinhood or extract your XRP to your cold storage device on Square or Robinhood. With us, we've always built things with full integrations.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">What's the bigger market, you think: the speculative market or the utility market?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">For now, it's by far the speculative market, which is, you know. We may have been right in the long term, but we were wrong in the short term. We've now launched, I think, 15 cryptos the other day because it's easy for us to do and we're calling them \"synthetic,\" which is what all these other firms do. But you can't, as an example, you can't take a unit of account called EOS and make it play in a world of Ethereum dApps if it's synthetic. You can't take a Bitcoin and make it speak to smart contracts. Ours enables all that nature of functionality, which has proven differentiating-ly useful for us in a B2B environment. So a lot of crypto companies come to us to provide them with that functionality, but insofar as retail users, they don't really care. More are caring now because they're hearing, \"Hey, you don't have your keys, you don't have your crypto,\" so they probably want to be somewhere where in two seconds they can withdraw it to their physical device and we enable that, but I think that's a lesser attribute.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Are you seeing growth slow as more players come into the market or expand into the market, or, as you sort of alluded to, not necessarily because there's so much opportunity for that pie to grow.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, so I think public interest goes in lockstep with crypto market cap. If it spikes up, then public interest spikes up, and if it goes down and stays sideways and interests diminish. Interestingly, from Uphold's point of view, we closed 2019, despite it being a crappy year for crypto, 69% up in new sign-ups versus 2018. And even though we're only one week into 2020, so all it's telling you is what the first week of 2019 was like, but our first week in 2020 is up 297% from our first week in 2019. So, sideways, but I think signs of life and, you know, metamorphosis is inevitable and consolidation is gonna be a part of it, probably, contracting margins is gonna be another part of it. But I think pushing out into other parts of the world, again, with more useful products will help things along.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">So what are some of those useful products that you're looking at?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, I think, you know, day-to-day transactionality, so the ability to have a digital wallet that can hold any form of value you choose, but your ability to spend that on your coffee, on your bicycle, on your kid's school, whatever, that's the real big one, right? And again, there are things you're not ever gonna want to spend, like a Bitcoin, but I think there are emerging units of account that, again, are not Fiat, they're not commodities, they're these new crypto--whatever you want to call them, maybe asset-backed, maybe not--units of account, and that's where things will get really fascinating. So \"spendability,\" if you will, is huge. And then, I think, also the ability to borrow, get yield, all the traditional attributes.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">When you say \"spendability,\" like, on what medium? Is that card-based or--.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Likely to be card-based for a while. I think--I don't think I'm speaking out of turn here that people can put two and two together. When you can see a balance in a browser and all e-commerce is accessed through a browser, how long is it going to take for you to be on a browser with a balance in it, where you look at a product, click on it, and you know that the merchant's going be willing to pay the 50 basis points versus the two and a half to one of the credit card rails? That's probably 5, 10 years down the road. But for now, it's a card.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">That's another--.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">That's pretty fascinating.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Yeah, that's an interesting point. \"Spendability,\" making it easier for folks to spend their crypto is one aspect. Where--what are some things that you think might be gimmicky, so to speak. Where are firms kind of stepping on their own shoes in rolling out things to attract new clients, but might not necessarily be something that adds that much value?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, I think, I mean, some of these programs that offer, say, benefits in their own crypto. You know, those may work. Those are really intriguing to look at. If you can create a token that has actual, you know--.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">So like a BNB, CoinFLEX, Flexcoin..&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah, like use this. The rates may be shitty. Nothing about it might be appealing, but you're gonna go ahead and get piles of our, as yet undetermined whether it's valuable or not, crypto. The other thing I was going to point out that's a big room for improvement is the speed and convenience by which money moves from the legacy money system to the new money system. So right now, if an ACH is still taking somebody seven days, you know, if somebody wants to act on something that they set up an ACH and it takes a long time--and there's a ton of fraud on that, by the way, which is the other sort of suppressor of the move forward is as people go to holding digital value, every variety of pirate and hacker in the world is trying to phish that or hack this--and that's a lot of work, a lot, a lot of work.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Who do you think's better positioned? Like crypto-native firms like Abra or a Coinbase or a Binance, or more Fintech-y Revolute, Robinhood?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">They each have strengths and weaknesses. I think, in terms of history rhyming, you'd go with the crypto-native firms, right? Who don't have the baggage. That said, you know, some of these things are not new under the sun, so having administrative infrastructure and marketing capabilities and experience all counts for quite a bit also. But generally, I would think that the technologically-led crypto-native companies have the same nature of edge that an Internet company would have had over a traditional media company and in the early 90s.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Sure. Well, let's focus on marketing for a bit. Uphold isn't, you know, respectfully, the biggest name in the space compared to like a Coinbase or Robinhood?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">And many of these firms are gearing up their marketing to almost no avail. You look at the Gemini campaign, for instance, they probably spent millions. You look at their market share as an exchange, it's basically the same. EToro has had some fun with Alec Baldwin, and, I think, back in the day when Robinhood first rolled out their crypto offering, they had signs up in San Francisco near Coinbase's office as a sort of, like, you know, \"look at us,\" a \"flex,\" if you will. Do you guys spend a lot on marketing? What does spend look like for marketing, and if it's not important, why not?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">And how does that differ, I guess, if you're targeting Latin American consumers?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah, well, so A.) we don't spend anything like the amount of money that they do on marketing. I think, as a result, our cost of customer acquisition is a fraction of those of our competitors, which is one of I think our market advantages. And I go back to what I mentioned earlier, which is that we partner with other companies in the ecosystem that are either a sort of Web 3 or crypto companies jumping over into mass-market relevance, and they require a partner that allows seamless movement of value between old money systems and new money systems, that has the legal licensing to be able to do that in different parts of the world, and that has all the technical stack that allows it, right? So fully today of our, call it, 3500, 4000 signups a day, half are coming directly from our partners' ecosystems at zero spend to us. And those partners are relying on us for our licenses, for the stack, for the ability to move between different units of account. Sort of amusingly--it is amusing, and it's anecdotal, and I don't know if there's room for this--we did our first little tiny marketing stint in Argentina this year, and it was at an event that is so peculiarly Argentine that most people wouldn't have heard of it, but Argentina is the polo capital of the world, and there is one tournament a year called the Argentine Open, which is the only time that these pros play against each other without the patron who is usually, you know, the old dude with a lot of money. It's like owning the Lakers, but getting to go out and play with the guys. So the only time that doesn't happen is in this little moment in Argentina, and amusingly, the team of my brother-in-law was sponsored by WeWork, and, of course, I got a call a couple of months ago saying, \"Hey dude, our sponsorship isn't looking so good this year. You know, if you guys want to do something--\"<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">What happened?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah. Well, so we did. We did come in, and it was really interesting. I mean, we signed up 3000 people in the span of, you know, five days. And again, the demand is off the charts. Everybody's seen the movie before, right? A regime comes in, they have no respect for financial freedoms, they slap on the currency controls, and everybody is desperate. And some of these poor guys, you know, they do these things where, \"Okay. Everybody's been cheating on their taxes, we're giving you this opportunity to go ahead and come clean.\" So people come clean and declare these things, and now they're trapped again. So, at any rate, that was our sponsorship. It worked out really well.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">And so WeWork just disappeared?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">They just--yes. Well, I think half the Buenos Aires skyline still has giant WeWork signage.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">In any case, I do want to continue on Argentina, because I think it's interesting. How do you guys capitalize on that sort of dysfunction in the market or broader economy?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">It's been word of mouth. I mean, literally word of mouth. And then the fact that all our collateral is translated in Spanish, we have a Spanish site, all that stuff. And we've been there for a while. In Venezuela, the way we got off to a roaring start is we used to have an app that was sort of our competitor to Abra at the time that had local people. We'd do, you know, meet-ups and teach-ins and that sort of stuff. And then once it gets critical mass, it just seems to grow by itself. We want to, in 2020, get more concerted about that sort of stuff. Getting the local licensing or the local partner that allows that, you know, last inch into people's bank accounts and, you know, in both directions, that's critical.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">But that's also going to be difficult, right? Getting those local licenses means working, right, with the local regulators or governments?<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah, and in some cases that's exactly what you don't want to do.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Exactly. So how do you navigate that situation?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Country by country. I mean, I think there's countries that obviously we have to take very seriously: the New Zealands, Australias, Singapores, Canadas, etc., who are, you know--I don't want to say legit or illegit--do a better job of preserving the sort of basic rights of their citizenry than some of these other Zimbabwe-, Venezuela-, Argentina-type regimes. So it's a different approach depending on where you are.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Something I'm pretty naive about, admittedly, like, what does the on- and off-ramp look like for a Venezuelan that wants to get into Uphold? So they're holding--the moment, you said this earlier, they get the cash, they're getting rid of it. Obviously, it takes a lot of cash now to convert even to, like, a simple loaf of bread. What does that look like?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, a lot of it's peer-to-peer. So when, you know--we have hundreds of thousands of users, so it's gotten to the point where the peer-to-peer actually works. I have cash, you have value on Uphold, I have an Uphold account. It all works. I think, again, Dash is doing really good work. Feet on the streets there to try to get Dash accepted that, you know, thousands of merchants. There is a phone--have you seen the Crip phone? So there is a low-cost smartphone that comes with the Uphold wallet embedded in it. They're selling tens of thousands of those in Venezuela. So, yeah, it's been basically that peer-to-peering. On places where it's not that necessary for survival, your average country, there's local Bitcoins and that nature of things.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">If the opportunity is in these regions of the world where there is this political, economic instability, doesn't that present risk to your own business, if you're putting too many of your eggs in one basket, so to speak, and then Argentina decides one day, or Venezuela decides one day to be hyper-aggressive towards crypto companies, or bans, like we saw in Iran, financial institutions from dealing with these assets? How do you hedge or manage that to service these customers?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Well, so I think--so those are two different things, right? If it's if it's the U.S. and Europe saying we don't want you doing business in these kinds of countries, North Korea, Iran, etc, then, of course, that's it. There's not a single penny or user from those regimes. If it's in a regime saying we don't want our citizenry accessing U.S. dollars, then you say, \"OK, you probably don't want them looking at illicit material on the Internet either, but what are you gonna do about it, right?\" China can do the great firewall, I don't think many other countries can. And there's a construct called reverse solicitation that allows not just companies in the fintech space, but any company, including Google--you know, Google might need, I don't know, a telecommunications license in a lot of these countries, were it a local company, but the fact that Google has users in Uruguay is not illegal up to a certain threshold. And then after a certain threshold, you have to then go and get your license or whatever it is. I mean, just to be clear, we look to operate legally everywhere, but in terms of where there might be differentiated or overlapping standards, it's the U.S.'s and Europe's standards that we'd look to apply.&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Fair enough. It's a really interesting point. Legal regulatory issues or standards, rather, are often thought of as being the most significant headache for companies in the space, and Abra provides a really interesting example. We've never had Bill on the podcast, but we've spoken to him quite a few times, and we were one of the first to report on the winding down of the stock offering, because at least from my source's perspective, it was viewed very much by the S.E.C. as a sort of equity derivative or swap-type platform, and so they kind of wound that down. And he has said many times that regulations and the regulators are probably the biggest impediment or one of the biggest impediments, and I think a lot of CEOs and executives in this space view that to be the case.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">It's unquestionably true. I think what's happened is there has been a benefit to, let's say, the big Asian players, right, who have gone and built these very robust businesses playing by their own sets of rules abroad for which there are no consequences, and then they can, you know, some window dressing and sort of move in. And so with Abra versus, say, you know, Binance or whomever it would be, they like us, I'm sure, have looked to adhere to the U.S. interpretation of the rules, and so, certainly, you are being saddled with encumbrances that your foreign competitors do not have. And so you're fighting at a huge disadvantage. That's just been the nature of the game so far.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">So, I guess to sort of wrap things up, we really appreciate you coming on. You mentioned Libra. You don't think it's going to launch in 2020. Why?&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Let me sort of couch that a little bit. It might launch in Africa in 2020, but I don't think Europe or the U.S. will touch it for all kinds of reasons, right? I mean, above and beyond the nature of the specifics of the offering, it is kind of ironic, right? Zuckerberg, love him or hate him--well, I don't know if you guys have read Roger McNamee's book, it's fairly interesting reading called Zucked. I happened to read it right after reading Bitcoin Billionaires, which was Mezrich's book about the twins, and it's kind of interesting, these two things juxtaposed, right? Here you have, presumably, arch enemies, and the twins were made to look sort of like caricatures in the context of the movie The Social Network, and Mezrich writes this book where he says, \"Wait a sec, I did these guys a disservice. Nobody is as successful as they were in the first context and then goes and does it again, being really early with Bitcoin, becoming the first American Bitcoin billionaires.\" So this is their turf. They were there at the beginning, they're pioneers. And here their arch enemy is coming in and usurping them to an extent. So there's that sort of human narrative, but then on top of it, he is the face of compromising everybody's privacy, if not elections. He can't possibly be the force that is going to go and legitimize, you know, crypto and particularly in this way where he's creating a basket of stable coins. It just, I don't see why anybody would allow that to happen.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">And I think the most poetic juxtaposition are the two names, right? You have Gemini and Libra, the two astrological signs.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Hadn't thought of that.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Ryan Todd <\/b><span data-v-f87c67ca=\"\">Yeah. I remember when Frank came across that--.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">When I came across that, I didn't stop talking about it for like a week, and I actually wrote a piece about how it actually makes a lot of sense if you understand the way Libras behave. Not to generalize, but they often have big, bold ideas that are tough to execute on. JP, thank you so much for joining us. We appreciate it.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Not at all.<\/span>","<b data-v-f87c67ca=\"\">Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Best wishes for the rest of 2020. Hope we'll be in touch.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">JP Thieriot <\/b><span data-v-f87c67ca=\"\">Absolutely. Well, thank you for having me on, and yes, may it be the Roaring 20s for crypto, especially for crypto.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1500","content":"DATE"},{"type":"Two dollars","content":"MONEY"},{"type":"Abra","content":"LOCATION"},{"type":"Flexcoin","content":"PERSON"},{"type":"North Korea","content":"LOCATION"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">Provenance","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">Money20","content":"PERSON"},{"type":"Disney World","content":"ORGANIZATION"},{"type":"New Zealands","content":"LOCATION"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">Good","content":"PERSON"},{"type":"Frank","content":"PERSON"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">That","content":"PERSON"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"200 dollars","content":"MONEY"},{"type":"JP","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"Chile","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">Kind","content":"PERSON"},{"type":"Africa","content":"LOCATION"},{"type":"Iran","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Revolute","content":"ORGANIZATION"},{"type":"Netflix","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Mezrich","content":"PERSON"},{"type":"Cash App","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Hayek","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Canadas","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"JP Thieriot <\/b><span data-v-f87c67ca=\"\">Right","content":"ORGANIZATION"},{"type":"-3%","content":"PERCENT"},{"type":"Thieriot <\/b><span data-v-f87c67ca=\"\">Well","content":"PERSON"},{"type":"Buenos Aires","content":"ORGANIZATION"},{"type":"S.E.C.","content":"ORGANIZATION"},{"type":"Frank Chaparro <\/b><span data-v-f87c67ca=\"\">Well","content":"PERSON"},{"type":"Zeit Geist","content":"PERSON"},{"type":"Davos","content":"LOCATION"},{"type":"Ryan","content":"PERSON"},{"type":"Mexico","content":"LOCATION"},{"type":"America","content":"LOCATION"},{"type":"two dollars","content":"MONEY"},{"type":"JP Thieriot <\/b><span data-v-f87c67ca=\"\">Absolutely","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Roger McNamee","content":"PERSON"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ireland","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"JP Thieriot","content":"ORGANIZATION"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">Yeah","content":"PERSON"},{"type":"CEO of Uphold","content":"ORGANIZATION"},{"type":"Australias","content":"LOCATION"},{"type":"Chaparro <\/b><span data-v-f87c67ca=\"\">Yeah","content":"PERSON"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">When","content":"PERSON"},{"type":"JP Thieriot <\/b><span data-v-f87c67ca=\"\">Las Vegas Davos","content":"ORGANIZATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Uphold","content":"ORGANIZATION"},{"type":"Kat","content":"PERSON"},{"type":"Zimbabwe","content":"LOCATION"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Frank Chaparro Chaparro","content":"PERSON"},{"type":"September 2018","content":"DATE"},{"type":"JP Thieriot <\/b><span data-v-f87c67ca=\"\">Had","content":"ORGANIZATION"},{"type":"Ryan Todd","content":"PERSON"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"JP Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah","content":"ORGANIZATION"},{"type":"Thieriot","content":"PERSON"},{"type":"99.9%","content":"PERCENT"},{"type":"4000","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"JP Thieriot <\/b><span data-v-f87c67ca=\"\">Country","content":"ORGANIZATION"},{"type":"297%","content":"PERCENT"},{"type":"Argentina","content":"LOCATION"},{"type":"69%","content":"PERCENT"},{"type":"Ryan Todd <\/b><span data-v-f87c67ca=\"\">Same","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"30 percent","content":"PERCENT"},{"type":"Alec Baldwin","content":"PERSON"},{"type":"Kat today","content":"DATE"},{"type":"Thieriot <\/b><span data-v-f87c67ca=\"\">Yeah","content":"PERSON"},{"type":"first week of 2019","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Uruguay","content":"LOCATION"},{"type":"Kats","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","Ryan Todd","The Block"]}