{"summary":"The SEC has previously rejected ETF proposals over concerns about market manipulation, but some recent applicants, such as BlackRock, have implemented agreements to detect and address market irregularities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259914\/cantor-fitzgerald-sees-spot-bitcoin-etf-as-most-important-short-term-catalyst","publishDate":"2023-10-28T14:34:17","id":11990,"type":null,"title":"Cantor Fitzgerald sees spot bitcoin ETF as &#x27;most-important short-term catalyst&#x27;","category":["COMPANIES"],"content":["The much-anticipated spot bitcoin exchange-traded fund is on the verge of becoming a reality, according to analysts at the financial services firm Cantor Fitzgerald.","As <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-10-27\/cantor-is-increasingly-confident-a-bitcoin-spot-will-win-approval\" data-v-f87c67ca=\"\">reported<\/a> by Bloomberg News, the firm — which offers prime brokerage and investment banking services — is \"increasingly confident\" that the slate of applications from asset managers to launch a spot ETF for bitcoin will be granted approval by the SEC.&nbsp;","The agency, which has been reluctant to approve such a product because of the fear of manipulation on off-shore spot platforms, could approve new applicants because of the market surveillance procedures they have proposed. &nbsp;","\"A&nbsp;comprehensive surveillance-sharing agreement with a regulated market of significant size\" would mollify regulators, the firm's Josh Siegler and Will Carlson noted.&nbsp;","The analysts believe a spot ETF approval would be a significant short-term catalyst for bitcoin's price, adding approval would be \"a bedrock moment for Bitcoin’s long-term adoption and legitimization.\"","They described approval as the \"most-important short-term catalyst.\"","The SEC has rejected several prior proposals, expressing concerns about the lack of information sharing among exchanges to prevent market manipulation. However, BlackRock, which submitted its proposal in June, has an agreement with Coinbase to detect and address market irregularities.","Bitcoin has surged in recent weeks around headlines tied to the potential approval of a spot ETF, with the cryptocurrency appreciating towards $35,000 earlier this month.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" title=\"BTC Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Will Carlson","content":"PERSON"},{"type":"$35,000","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Josh Siegler","content":"PERSON"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Cantor Fitzgerald","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}