{"summary":"Generalist venture capital firm Northzone announced the launch of a €1 billion fund.\nIt has previously backed tech startups such as Klarna and Spotify, as well as web3 outfits like Magic Labs, Gro Protocol, and Sunscreen. \nNorthzone partner Wendy Xiao Shadeck described web3 as a “core sector” for the firm. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169381\/uk-venture-firm-northzone-eyes-web3-startups-with-new-e1-billion-fund","publishDate":"2022-09-13T01:00:27","id":1199,"type":null,"title":"UK venture firm Northzone eyes web3 startups with new €1 billion fund","category":["Venture Capital"],"content":["London-based venture capital firm Northzone launched a €1 billion fund with an eye on investing in crypto and fintech startups, according to an announcement today.&nbsp;","Founded in 1996 as a generalist investor, Northzone has backed a wide range of tech companies, from fintech firms like open banking specialist&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/news+\/125489\/truelayer-interview\" data-v-f87c67ca=\"\">TrueLayer<\/a>&nbsp;and buy now play later giant&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/156900\/klarna-valuation-cut-to-6-7-billion-in-800-million-fundraise\" data-v-f87c67ca=\"\">Klarna<\/a>, to music streaming platform Spotify, which is said to be <a href=\"https:\/\/www.theblock.co\/linked\/134900\/spotify-backend-engineer-web3\" data-v-f87c67ca=\"\">exploring web3<\/a>. But the company also counts crypto infrastructure startup Magic Labs, web3 privacy firm Sunscreen, and DeFi protocol Gro as portfolio companies.","Wendy Xiao Schadeck, a partner at Northzone, described web3 as a \"core sector\" for the firm. She authored its&nbsp;<a href=\"https:\/\/medium.com\/@wen_xs\/our-crypto-investment-thesis-7810879f705b\" data-v-f87c67ca=\"\">crypto investment thesis<\/a>&nbsp;way back in July 2018 — at the start of a long crypto winter.&nbsp;","\"Web3 and web2 two will likely start to converge in this fund cycle's lifetime,\" she said in an interview with The Block. \"For instance, some of the web2 fintech companies in our last fund have launched tokens and some of our gaming companies have decided to base their follow-on rounds from web3 VCs — so it's really hard to say exactly where the delineation will be.\"","The venture capital firm has the infrastructure in place to back startups via both equity investments and token sales, and has participated in staking tokens previously, Xiao Schadeck said. She also suggested that the firm would be open to investing in a decentralized autonomous organization (DAO), in the right circumstances.&nbsp;","Northzone doesn't currently have exposure to NFTs, unlike fellow London-based venture firm Blossom Capital, which <a href=\"https:\/\/www.theblock.co\/post\/130454\/blossom-capital-third-fund-crypto\" data-v-f87c67ca=\"\">has purchased NFTs<\/a>&nbsp;—&nbsp;including a Bored Ape, a CryptoPunk, and an Azuki, per founding partner Ophelia Brown — through its latest $432 million fund. But that could change.&nbsp;","\"We consider new modes of investing that are aligned to what we do,\" Xiao Schadeck said, when asked about a purchasing NFTs. \"But it's not at a point where we say we'll dedicate a portion of the funding to buy NFTs or anything like that. So far, we haven't found that specifically, NFTs themselves are an investment case that fits our venture criteria.\"&nbsp;","Xiao Shadeck also said that she isn't put off by some of the bumps in the road that DeFi has encountered. Portfolio company Gro was hit by the <a href=\"https:\/\/medium.com\/gro-protocol\/making-gro-protocol-more-resilient-5271bd15c02a\" data-v-f87c67ca=\"\">depegging of Terra's UST<\/a> in May, leading it to re-evaluate its strategy for generating yield for customers. Yet&nbsp;Xiao Shadeck said that Northzone will continue to look at the web3 infrastructure space and DeFi protocols like Gro.&nbsp;","The jury is still out on whether Northzone will follow the lead of other European venture capital firms, such as <a href=\"https:\/\/www.theblock.co\/post\/161177\/aglae-ventures-web3-fund\" data-v-f87c67ca=\"\">Aglaé Ventures<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/134525\/cherry-crypto\" data-v-f87c67ca=\"\">Cherry Ventures<\/a>,&nbsp;by launching a dedicated crypto fund, according to Xiao Shadeck.","\"We would discuss and evaluate with our LPs to see if the time is right for that,\" she said, noting that such a move would allow the firm to participate in trading liquid tokens. \"I think what's most likely to happen is that we'll continue to invest into web3 companies out of our core funds and if they decide to launch tokens we'll hold them — we're not at all limited in that way.\""],"hashtag":[]}