{"summary":"Starting Wednesday, margin trading is available for Coinbase Pro clients in 24 states.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55615\/coinbase-rolls-out-margin-trading-again","publishDate":"2020-02-12T13:00:45","id":11992,"type":null,"title":"Coinbase rolls out margin trading. Again.","category":["THE BLOCK"],"content":["If at first you don't succeed, try again.&nbsp;","That's the approach cryptocurrency exchange Coinbase is taking for margin trading. The digital asset exchange announced Wednesday that it's taking another swing at supporting margin after it suspended the functionality in 2017 following a flash crash in the price of ether. The precipitous drop dragged ETH's price down to 10 cents from more than $300 in a matter of milliseconds. &nbsp;","Starting Wednesday, certain clients of the exchange will able to trade with as much as 3x leverage – a paltry amount, perhaps, in a crypto market where 100X leverage can be found at some offshore venues. Trading on margin allows a trader to borrow money for the potential of earning a bigger upside on a trade.&nbsp;","The service will be available in 23 states for Coinbase Pro users, and it'll be open to institutional clients in 45 states for U.S. dollar pairs. And looking ahead, Coinbase<span data-v-f87c67ca=\"\">&nbsp;plans to expand access to the service over the next year.&nbsp;<\/span>","Coinbase's chief operating officer Emilie Choi said margin trading would be the firm's \"next big step\" in an interview with <a href=\"https:\/\/www.theblockcrypto.com\/linked\/25243\/coinbase-exec-says-the-firm-is-thinking-of-supporting-margin-trading\" data-v-f87c67ca=\"\">The Block<\/a>&nbsp;in May. This time, Coinbase doesn't really have much margin for error. Following the 2017 flash crash, the Commodities Futures Trading Commission sent an inquiry to the firm about its margin service, as per a report by Bloomberg News.&nbsp;","To ensure the robustness of the new margin product, the firm coordinated with regulators and created a new team dedicated to liquidation management, a spokesman told The Block.&nbsp;","\"We're leveraging all of our resources to make this successful,\" the spokesman said.&nbsp;","The addition of margin could be a boon for the company's market share, which has declined by more than 3% since June. Year-over-year, its volumes have declined by 19.2%; from $95.3 billion in 2018 to $76.9 in 2019.&nbsp;","Coinbase was among the few exchanges not offering margin. Both Kraken and Bitfinex offer up to 5x margin.&nbsp;","","","<span data-v-f87c67ca=\"\">Source: The Block, CryptoCompare, CoinGecko<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"19.2%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$95.3 billion","content":"MONEY"},{"type":"$300","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"10 cents","content":"MONEY"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$76.9","content":"MONEY"},{"type":"Emilie Choi","content":"PERSON"},{"type":"Bloomberg News","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}