{"summary":"TRON DAO (“TRON”) is pleased to announce that it has joined the Japan Cryptoasset Business Association (“JCBA”) as an associate member starting from August 1st, 2023. As a leading global blockchain, TRON is committed to building cooperation and collaboration with other JCBA members to promote the growth of the crypto industry in Japan and all across Asia.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246786\/tron-partners-with-japan-cryptoasset-business-association-jcba-to-champion-web3-ecosystem-growth","publishDate":"2023-08-23T09:01:36","id":11995,"type":null,"title":"TRON Partners with Japan Cryptoasset Business Association (JCBA) to Champion Web3 Ecosystem Growth","category":["SPONSORED"],"content":["<a href=\"https:\/\/trondao.org\/\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">TRON DAO<\/b><\/a><b data-v-f87c67ca=\"\"> (“TRON”)<\/b><span data-v-f87c67ca=\"\"> is pleased to announce that it has joined the <\/span><a href=\"https:\/\/cryptocurrency-association.org\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Japan Cryptoasset Business Association<\/b><\/a><b data-v-f87c67ca=\"\"> (“JCBA”)<\/b><span data-v-f87c67ca=\"\"> as an associate member starting from August 1st, 2023. As a leading global blockchain, TRON is committed to building cooperation and collaboration with other JCBA members to promote the growth of the crypto industry in Japan and all across Asia.<\/span>","<span data-v-f87c67ca=\"\">Established in 2016, JCBA is a Japanese based association for stakeholders within the Web3 ecosystem. It aims to foster a promising environment for the development of digital assets, including cryptocurrencies, NFTs, and stablecoins. Currently, JCBA has 134 members from both Web3 and traditional industries based in Japan and internationally.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">By joining as an associate member of JCBA, TRON strives to closely collaborate with the Japanese market and contribute to JCBA's vision by leveraging TRON's efficient network and robust userbase.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by TRON<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 1st, 2023","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Japan Cryptoasset Business Association","content":"ORGANIZATION"},{"type":"JCBA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}