{"summary":"The deputy governor of the Bank of England is not convinced DeFi protocols can mitigate risk in the manner claimed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188707\/bank-of-england-unconviced-defi-can-solve-financial-risk","publishDate":"2022-11-21T05:04:54","id":1200,"type":null,"title":"Bank of England unconvinced DeFi can solve financial risk","category":["CENTRAL BANKS"],"content":["Decentralized finance protocols do not yet provide an effective way to manage risk, the Bank of England deputy governor warned on Monday.&nbsp;","The claim by DeFi advocates that a code can manage risk, rather than intermediaries, is unproven, Jon Cunliffe <a href=\"https:\/\/www.bankofengland.co.uk\/speech\/2022\/november\/-\/media\/8331cfac3f284b4c94567d24912b0bba.ashx\" data-v-f87c67ca=\"\">told<\/a> an audience at the Warwick Business School.&nbsp;''From the standpoint of a financial stability authority and a financial regulator, I have yet to be convinced that the risks inherent in finance can be effectively managed in this way,'' he said.","Cunliffe compared DeFi protocols to driverless cars, saying they were only as good as the rules, programs and sensors which organize their operations.&nbsp;","''Moreover, it is not clear the extent to which these platforms are truly decentralized,'' he added. ''Behind these protocols typically sit firms and stakeholders who derive revenue from their operations. Moreover, it is often unclear who, in practice, controls the governance of the protocols.''","The Bank of England will hold a consultation next year on the regulatory framework around a digital asset payment system, including the use of services, such as wallets, Cunliffe said.","The central bank and the Financial Conduct Authority will have additional powers to oversee stablecoins and other crypto-related technologies, once the so-called Financial Services and Markets Bill passes through parliament and becomes law.&nbsp;","The UK Treasury will also do a consultation on how to extend investor protection, market integrity and other regulatory frameworks that cover the promotion and trading of financial products to activities and entities involving crypto assets, Cunliffe said.","At the moment, only anti-money laundering legislation applies to those activities, he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Warwick Business School","content":"ORGANIZATION"},{"type":"Cunliffe","content":"PERSON"},{"type":"Jon Cunliffe","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"}],"hashtag":["BOE"],"authors":["Benjamin Robertson","The Block"]}