{"summary":"FTX CEO John Ray III spoke to the House Financial Services Committee one day after Sam Bankman-Fried was arrested in the Bahamas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194633\/ftx-execs-had-free-rein-over-exchange-alameda-ceo-ray-says","publishDate":"2022-12-13T11:44:13","id":12005,"type":null,"title":"FTX execs had ‘free rein’ over exchange, Alameda, CEO Ray says ","category":["POLICY"],"content":["Sam Bankman-Fried and his top lieutenants had “free rein” over failed crypto exchange FTX and its sister trading firm, Alameda Research, the new FTX CEO said in a congressional hearing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Testifying before the House Financial Services Committee on the collapse of FTX and its impact on crypto markets, John Ray III told lawmakers that there were no distinctions between FTX, Alameda Research and other entities which filed for bankruptcy protection last month.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“The owners of the company could really run free rein across all four silos,” Ray said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> Ray was the sole witness after Bankman-Fried, the former CEO who had also been scheduled as a witness after high-profile negotiations to secure his appearance, was arrested in the Bahamas last night.&nbsp;<\/span>","Once valued at $32 billion, FTX collapsed after a run on its native utility token last month. Ray took over as CEO of FTX after Bankman-Fried stepped down from that role. The new executive has described FTX’s financial situation as the worst mess he’s seen in his career, noting that the multibillion dollar business ran its accounting through the small business bookkeeping software Quickbooks, if it recorded financial transactions at all.&nbsp;","<span data-v-f87c67ca=\"\">“It’s really unprecedented in terms of the lack of documentation,” said Ray, who called it a <\/span><span data-v-f87c67ca=\"\">“paperless bankruptcy.”<\/span>","<span data-v-f87c67ca=\"\">Ray laid into how Bankman-Fried and other executives handled FTX. He cautioned that the company’s audited financial statements should not be trusted because the firm has lost so much cash.<\/span>","<span data-v-f87c67ca=\"\">\"We've lost $8 billion,\" Ray said. \"I don't trust a single piece of paper in this organization.\"<\/span>","<span data-v-f87c67ca=\"\">Unlike Enron, another corporate collapse that Ray helped clean up, the scheme executives ran at FTX was “not sophisticated at all,” Ray said. He called the Enron catastrophe “highly orchestrated” in comparison to FTX.<\/span>","<span data-v-f87c67ca=\"\">\"This is really old-fashioned embezzlement,” Ray said.<\/span>","<span data-v-f87c67ca=\"\">Ray also noted that Bankman-Fried should have “zero” role in FTX as the bankruptcy process unfolds. In media interviews Bankman-Fried has raised doubts about the accuracy of Ray’s court filings and complained that the company’s new leadership is ignoring him.&nbsp;<\/span>","Bankman-Fried was hit with criminal and civil complaints from the U.S. Justice Department, Securities Exchange Commission and the Commodity Futures Trading Commission on Tuesday morning. Bankman-Fried is accused of giving Alameda special access to FTX customer funds and defrauding investors; he and other executives also gave themselves unpaid loans through Alameda.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> FTX’s new leadership has been cooperating with U.S. regulators and plans to “turn over any information that would be relevant to them,” Ray said.&nbsp;<\/span>","Ranking Republican Rep. Patrick McHenry, R-N.C., called Bankman-Fried’s arrest “welcome news,” but noted it does not reveal what went wrong at FTX, and said he still wanted to hear from the former FTX boss. <span data-v-f87c67ca=\"\">“I look forward to getting his lies here on the record, under oath,\" said the North Carolina Republican.&nbsp;<\/span>","He and top current Committee Chair Maxine Waters, D-Calif., said they still plan to move ahead on legislation around digital assets. The two have negotiated to draft a comprehensive regulatory framework for stablecoins.&nbsp;","“This committee will not stop until we uncover the full truth behind the collapse of FTX,” said Waters at Tuesday's hearing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Members of the committee dug into claims made by Ray and his lawyers that Bankman-Fried and his lawyers and fellow executives in the Bahamas are coordinating with the Bahamian government to undermine the bankruptcy process. After FTX filed for bankruptcy protection, some assets were transferred from the company, in a potential violation of U.S. bankruptcy law, Ray said.&nbsp;","“They just took it,” said the FTX CEO.","Bankman-Fried and FTX co-founder Gary Wang minted approximately $300 million in new FTT tokens and moved hundreds of millions of dollars worth of assets, including those newly minted FTT tokens, into Bahamian custody after Bankman-Fried put nearly all his companies into the bankruptcy process, Ray said. The current FTX CEO suggested suggested his predecessor is working to undermine the U.S. bankruptcy process and that the bankruptcy process in the Bahamas is not transparent.","“The pushback that we’ve gotten is sort of extraordinary in the context of bankruptcy. It raises questions. It seems irregular to me. There’s lots of questions on our part,” Ray said. “We’ve repeatedly asked them for clarity about what they’ve been doing and we’ve been shut down on that.”","Other members of the committee also still want Bankman-Fried to appear, if he's able to after federal criminal indictments against him unsealed on Tuesday.&nbsp;","<span data-v-f87c67ca=\"\">“I think either way he needs to come talk to the committee, whether he’s a prisoner or free on bail,” said Rep. Warren Davidson, R-Ohio.<\/span>","<span data-v-f87c67ca=\"\">\"Absolutely,\" answered Rep. Emanuel Cleaver, D-Mo. “There are some issues that I am concerned about that only he can answer.”<\/span>","Others said that their patience is wearing thin with the crypto industry.&nbsp;","<span data-v-f87c67ca=\"\">“It’s been 14 years and the American public has heard lots of promises but it has seen lots of Ponzi schemes,\" said Rep. Jake Auchincloss, D-Mass. \"For crypto it’s time to put up or shut up.”<\/span>","McHenry, the incoming chair, promised another hearing on the subject after he takes over control of the committee next year.&nbsp;","\"You had somebody who was a 'crypto genius,' but behind closed doors was using Quickbooks,\" said the North Carolina Republican, noting what the committee heard in testimony from Ray. \"As chair of the committee it's my intention to continue the work of Chairwoman Waters when it comes to this matter.\"&nbsp;","<em data-v-f87c67ca=\"\">With additional reporting contributed by Kollen Post and Colin Wilhelm.&nbsp;<\/em>","<i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><span class=\"s2\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"Enron","content":"ORGANIZATION"},{"type":"Committee Chair Maxine Waters","content":"ORGANIZATION"},{"type":"Kollen Post","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ray","content":"PERSON"},{"type":"Ray","content":"LOCATION"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Warren Davidson","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"last month","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Jake Auchincloss","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"last night","content":"TIME"},{"type":"2021","content":"DATE"},{"type":"Mo.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Emanuel Cleaver","content":"PERSON"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Ohio","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"North Carolina","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"U.S. Justice Department","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Chairwoman Waters","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Calif.","content":"LOCATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"December 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Securities Exchange Commission","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["CFTC","CONGRESS","CRIME","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"],"authors":["Stephanie Murray","The Block"]}