{"summary":"Currently, the UK is getting ready to allow institutional investors access to bitcoin ETNs — but retails users are banned from US bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284243\/kraken-uk-managing-director-says-he-would-absolutely-like-to-see-a-bitcoin-etf-in-the-uk?utm_source=telegram1&utm_medium=social","publishDate":"2024-03-23T07:46:05","id":12004,"type":null,"title":"Kraken UK Managing Director says he would &#x27;absolutely&#x27; like to see a bitcoin ETF in the UK","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.10%\n    <\/span><\/a> <!----><\/span><\/span> ETFs should \"absolutely\" come to the UK, according to Kraken UK Managing Director Bivu Das.<\/span>","In an interview at the Digital Asset Summit in London, Das explained that the world has changed significantly since such products were restricted in the UK in 2021. \"And if anything, some of those concerns that the regulators have around protection for retail investors are minimized to some extent if you're not owning the actual asset underneath it.\"","Das added that bitcoin ETFs are an interesting product with the potential for decent returns that UK investors cannot access. He noted that this potentially sends them to unregulated venues to try to get exposure, something he said isn't great for the UK. \"The UK has always said it wants to be a crypto hub. And this is one of the basic fundamentals potentially for meeting that definition,\" he said.","While the UK has recently approved the launch of crypto exchange-traded notes, these will only be available for institutional investors and not for a retail audience. That's unlike the bitcoin ETFs in the U.S., which anyone can access.","As for the launch of bitcoin ETFs, Das noted how the products were adopted very quickly and that they're positive for the clients they're available to. He added that they have legitimized bitcoin in the crypto market more broadly for institutions.","Coinbase UK CEO Daniel Seifert appears to support Das's view on bringing ETFs to the UK. In a <a href=\"https:\/\/www.theblock.co\/post\/282938\/us-bitcoin-etfs-are-a-monumental-milestone-says-coinbase-uk-ceo-while-etns-in-the-uk-are-a-positive-step\" data-v-f87c67ca=\"\">recent interview<\/a>, when asked whether he would want to see bitcoin ETFs available in the UK, Seifert replied, “I would say more choice for consumers is always good.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel Seifert","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Seifert","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Kraken UK Managing Director Bivu Das","content":"ORGANIZATION"},{"type":"+0.10%","content":"PERCENT"},{"type":"Das","content":"PERSON"},{"type":"Digital Asset Summit","content":"ORGANIZATION"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}