{"summary":"Dorsey says Block is building an “ecosystem of ecosystems.” Bitcoin is one such ecosystem into which the firm is pouring resources.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147659\/block-details-expanded-bitcoin-efforts-at-2022-investor-day","publishDate":"2022-05-18T13:19:52","id":12006,"type":null,"title":"Block details expanded Bitcoin efforts at 2022 Investor Day","category":["BITCOIN"],"content":["Block is no longer just a payments company, according to Block Head Jack Dorsey.","But if the firm’s 2022 investor day is any indication, it’s certainly looking to be a Bitcoin company.","Dorsey touted Block’s latest approach to its products as an “ecosystem of ecosystems.” Bitcoin is one such ecosystem the firm is pouring resources into. Block Finance lead Amrita Ahuja said the firm sees a $3 billion gross profit opportunity for bitcoin consumer trading.","“We think we've just scratched the surface for further adoption of Bitcoin in the United States and globally,” said Ahuja. “We believe Bitcoin is going to have a profound impact on financial services, particularly as a tool for economic empowerment and as a global currency for the Internet.”","This approach means capturing value across a number of sectors within crypto. That, of course, includes Block’s wheelhouse, payments, but it has also expanded to building hardware and platforms for crypto users to capture value in the crypto ecosystem.","Indeed, the firm is building its own wallet, which will integrate hardware and software to enable self-custody, a decentralized exchange dubbed “TBDex” and a decentralized mining system.","“These initiatives are early in their development and we intend to build out in the open,” said Ahuja.","Dorsey <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130439\/jack-dorseys-block-commits-to-build-an-open-bitcoin-mining-ecosystem\" data-v-f87c67ca=\"\">committed<\/a> to building an “open” bitcoin mining system at the start of this year. Block contends that the current state of mining is dominated by large firms and hard to access for small firms or individuals.","“We want to dramatically expand access to this rapidly growing market, which would add resilience and security to the Bitcoin ecosystem and generate value for a broader set of stakeholders,” said Ahuja. “This is what our mining initiative intends to fulfill.”","Its TBD project was kept under wraps until Block <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124945\/square-decentralized-exchange-protocol-white-paper\" data-v-f87c67ca=\"\">circulated<\/a> a white paper on the project’s design in November of last year. That document proposed the “tbDEX” would facilitate \"decentralized networks of exchange between assets by providing a framework for establishing social trust, utilizing decentralized identity (DID) and verifiable credentials (VCs) to establish the provenance of identity in the real world.”","At today’s events, Ahuja said Building a new system for managing identity and trust in a decentralized manner is at the core of the product’s development.","“Our plan is to build consumer-facing proprietary products and also enable developers and other industry participants to build upon our standards,” she said.","The hope is to enable cheaper remittances for consumers through services built on TBD, while also enabling developers to build products geared towards decentralized financial services. As of now, Ahuja said Block is already actively engaging potential partners in the financial services space, and said the firm is “encouraged about the interest they’re showing.”","Today's event is Block's first Investor Day since 2017.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Amrita Ahuja","content":"PERSON"},{"type":"Block","content":"ORGANIZATION"},{"type":"Ahuja","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"November","content":"DATE"}],"hashtag":["BITCOIN","BLOCK"],"authors":["Aislinn Keely","The Block"]}