{"summary":"Chainalysis says it managed to trace bitcoin through the popular mixing service CoinJoin. But are all transactions traceable?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135148\/a-look-at-chainalysis-claim-to-track-bitcoin-through-mixing-service-coinjoin","publishDate":"2022-02-23T05:32:17","id":12000,"type":null,"title":"A look at Chainalysis&#x27; claim to track bitcoin through mixing service CoinJoin","category":["PRIVACY"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Amidst yesterday's report by <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Cryptopians author<\/span> Laura Shin that <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblockcrypto.com\/post\/135017\/new-research-claims-to-identify-the-man-who-hacked-the-dao\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">claims to identify<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;who hacked The DAO in 2016, there was a small detail crucial to the findings but with other implications.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">It was the claim, by blockchain analytics firm Chainalysis, that it was able to unmask the path of transactions through a popular bitcoin mixing service called CoinJoin — something that would defeat its entire raison d'etre.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">CoinJoin is a crypto mixing tool by privacy-focused Wasabi Wallet. It helps users obscure their transaction history by mixing their funds with those of other users. It's much harder to follow the movement of money across a string of blockchain transactions when they go through CoinJoin.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Shin's report that claims to have found the hacker of The DAO — a crowdfunding platform set up on the Ethereum blockchain that fell foul to its own code in 2016 — cashed out some funds, mixed them, and sent them to several exchanges. It was the cashing out at the exchange point that supposedly identified the alleged perpetrator. But this is all based on Chainalysis successfully following the money through CoinJoin.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Now there are two possible options here. Either the blockchain analytics firm is able to unmask each and every transaction through CoinJoin — the worst-case scenario for privacy proponents — or it's able to do so under certain circumstances, such as sloppy privacy practices.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">When we reached out to Chainalysis, it refused to provide more details about its abilities with regard to CoinJoin. \"We helped trace funds despite the attacker's attempts to cover his tracks [with] mixers,\" said Chainalysis. \"This is yet another example of evidence preserved on the blockchain forever.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"We aren't providing further comment, but we can confirm (as we did <a href=\"https:\/\/twitter.com\/chainalysis\/status\/1496087885061181443\" data-v-f87c67ca=\"\">here<\/a>) that Laura's report about our role in her investigation is accurate.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">When asked whether all CoinJoin transactions could be traced, Wasabi Wallet founder Adam Fiscor told The Block, \"Unfortunately we have no more information on this than you do. I think it's unlikely, but I'd love to learn more, too.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Tom Robinson, co-founder and chief scientist at blockchain analytics firm Elliptic, said that it's not possible to demix all CoinJoin transactions. But he acknowledged that some transactions can be traced.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Yes, Elliptic can also demix Wasabi transactions in some circumstances. However, this does not mean that all Wasabi transactions can be demixed. This is typically possible in situations where the Wasabi user has made a mistake,\" said Robinson.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">He clarified that it's possible to track funds through Wasabi due to bad practices by a user — specifically, address re-use.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">But what about other crypto mixers such as Ethereum's Tornado Cash?<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"No one can demix all crypto mixer transactions,\" said Robinson. \"Some mixer transactions can be demixed, for most mixers.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Elliptic said that it isn't trying to trace all mixer transactions. \"There are completely legitimate reasons to use mixers, and our aim is not to violate peoples' financial privacy without cause,\" said Robinson. \"However, we do try to trace specific funds, known to have originated from illicit activity, through mixers.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Elliptic also doesn't plan to do its own analysis on Shin's claims, said Robinson.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"Laura","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chainalysis","content":"LOCATION"},{"type":"Tom Robinson","content":"PERSON"},{"type":"Chainalysis","content":"PERSON"},{"type":"Adam Fiscor","content":"PERSON"},{"type":"Robinson","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Shin","content":"ORGANIZATION"},{"type":"Wasabi Wallet","content":"ORGANIZATION"},{"type":"CoinJoin","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","Tim Copeland","The Block"]}