{"summary":"Gas Station nixes gas fees on Circle&#x27;s programmable wallets, and Smart Contract Platform simplifies smart contract deployment and management.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258237\/circle-launches-gas-abstraction-and-smart-contract-beta-tools-amid-push-into-web3-services","publishDate":"2023-10-19T09:00:03","id":12019,"type":null,"title":"Circle launches gas abstraction and smart contract beta tools amid push into web3 services","category":["COMPANIES"],"content":["Circle has launched two new beta tools for developers: Gas Station and Smart Contract Platform.&nbsp;","Gas Station removes transaction \"gas\" fees when integrated with Circle's programmable wallets. Smart Contract Platform simplifies smart contract importing, deployment and management and supports Ethereum, Polygon and Avalanche via APIs. Both products aim to streamline development for web3 services.&nbsp;","\"We are actively exploring the expansion of Smart Contract Platform support across a number of additional blockchains,\" Gagan Mac, Head of Product for Web3 Services at Circle, told The Block. \"We plan to add support for more blockchains starting early next year.\"","\"Gas Station and Smart Contract Platform have been tailor-made to tackle the key challenges faced by businesses and app developers seeking to integrate blockchain-enabled experiences. These tools abstract away much of the complexity businesses and developers have faced until now with handling gas tokens and interacting with smart contracts — enabling smoother adoption, sleeker UX and faster development time with a reliable infrastructure that takes care of the complexities,\" Mac added.","The move follows Circle's attempt to take blockchain-based technology <a href=\"https:\/\/www.theblock.co\/post\/244510\/circles-jeremy-allaire-says-web3-is-going-mainstream\" data-v-f87c67ca=\"\">mainstream<\/a> through deployment of web3 services.&nbsp;Circle launched a <a href=\"https:\/\/www.theblock.co\/post\/238139\/circle-quietly-launches-wallet-as-a-service-developer-platform\" data-v-f87c67ca=\"\">programmable wallet<\/a>, which gave developers a user-friendly system to embed web3 wallets into their apps, in July, The Block previously reported.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Circle","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gagan Mac","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Head of Product for Web3 Services at Circle","content":"ORGANIZATION"}],"hashtag":["USDC"],"authors":["MK Manoylov","The Block"]}