{"summary":"Cowen Digital is onboarding dozens of clients in six months of existence–and amid the frosty crypto winter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167744\/cowen-digital-snags-dozens-of-clients-in-six-months-as-expansion-plans-proceed","publishDate":"2022-09-06T10:41:20","id":12011,"type":null,"title":"Cowen Digital snags dozens of clients in six months as expansion plans proceed","category":["BLOCKCHAIN"],"content":["Cowen Digital has brought on dozens of clients in six months of existence — and amid the frosty crypto winter, to boot.","The digital arm of Cowen recently announced <a href=\"https:\/\/www.theblock.co\/post\/165739\/cowen-expands-digital-division-with-new-crypto-native-hires\" data-v-f87c67ca=\"\">two crypto-native hires<\/a> for the team. With a core team now established, the firm expects to eventually expand the division to more than 100 people. That doesn’t include the approximately 40 people within Cowen that have supported the project.","<a href=\"https:\/\/www.cowen.com\/capabilities\/markets\/cowen-digital\/\" data-v-f87c67ca=\"\">Cowen Digital<\/a>, created in March, is growing quickly to tap the fast-moving demand for digital asset investment opportunities. The interest is coming from traditional hedge funds but also from crypto-native funds that have done well in a bear market and are looking for access to traditional financial infrastructure.","“It’s a unique opportunity, I think it’s massive, I think there is true demand from our customer base as well as a whole new customer base of companies and funds that are strictly in digital, and that’s why we’re doing it,” said <a href=\"https:\/\/www.linkedin.com\/in\/drew-forman-49b8a86a\/\" data-v-f87c67ca=\"\">Drew Forman<\/a>, managing director and head of Cowen Digital, in an interview last week. “The institutional demand is there and I think the interest is 10 times what the current demand is.”","The company is aggressively putting its money where its mouth is. It built Cowen Digital as a separate company as it’s currently impossible to trade crypto inside a broker-dealer, and is getting licensed across the U.S., Canada and the UK to transact in the crypto spot market.","Last year, a Cowen affiliate made a strategic investment in <a href=\"https:\/\/digitalprimetechnologies.com\/\" data-v-f87c67ca=\"\">Digital Prime Technologies<\/a>, which creates software to expand brokerage capabilities in the digital asset sector, while Cowen Digital made a strategic investment in infrastructure provider <a href=\"https:\/\/www.cowen.com\/news\/cowen-and-polysign-to-launch-strategic-partnership-geared-toward-providing-clients-access-to-cryptocurrency-and-digital-assets\/\" data-v-f87c67ca=\"\">PolySign<\/a>, which aims to offer instant and automatic settlements for crypto assets. Cowen Digital led PolySign's Series B round, followed by a further Series C in June where Cowen Digital also participated in the $53 million fundraise alongside Brevan Howard and GSR Soros.","Those investments are already paying off, according to Forman.","“We’re already starting to see the fruits of our labor,” said Forman, who bought bitcoin in 2012 at $100.","And there’s plenty more to come. That Cowen is a staid, century-old investment bank is part of the lure for both traditional finance players and their crypto native counterparts. Next year, Forman expects to see more adoption coming from Cowen's current 2,500 or so clientele.","“The big asset managers are probably three to 12 months from actually launching crypto strategies,” and are vetting vendors like Cowen, he said.","Forman said the trend of talent from current tech firms moving into web3 tech firms will translate into better user experiences, and that’s going to lead to “a massive pick up of investment banking activity and adoption,” he said.","Next up for Cowen Digital will be the launch of a lending product leveraging its Digital Prime investment in the coming weeks. The company also intends to roll out its swaps and derivatives products in the fourth quarter.","\"When I think about how everything in the future could be tokenized, it is mind-blowing to imagine the capabilities needed to support the explosion in institutional demand for digital assets,” he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cowen","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$53 million","content":"MONEY"},{"type":"winter","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Cowen Digital","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Cowen","content":"ORGANIZATION"},{"type":"Drew Forman","content":"PERSON"},{"type":"Digital Prime Technologies","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Brevan Howard","content":"PERSON"},{"type":"GSR Soros","content":"ORGANIZATION"},{"type":"Forman","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}