{"summary":"As Paxos reckons with two regulatory blows, crypto industry experts are left reading between the lines to determine who, or what, might be next.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211889\/paxos-lands-on-the-front-lines-of-new-us-crackdown-on-crypto","publishDate":"2023-02-23T15:56:12","id":12012,"type":null,"title":"Paxos lands on the front lines of new US crackdown on crypto","category":["POLICY"],"content":["Paxos did things by the book. It <a href=\"https:\/\/paxos.com\/company\/\" data-v-f87c67ca=\"\">put<\/a> former FDIC Chair Sheila Bair and retired Senator Bill Bradley on its board. It went so far as to <a href=\"https:\/\/paxos.com\/\" data-v-f87c67ca=\"\">brag<\/a> about its buttoned-up nature by labeling itself “the first regulated blockchain company.”","It wasn’t enough.","The stablecoin issuer last week took successive regulatory blows from the New York Department of Financial Services and the U.S. Securities and Exchange Commission. The NYDFS’s action was related to its <a href=\"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\">issuance<\/a> of the Binance U.S. dollar stablecoin (BUSD). The SEC <a href=\"https:\/\/www.theblock.co\/post\/211242\/paxos-categorically-disagrees-with-sec-in-calling-busd-a-security\" data-v-f87c67ca=\"\">slapped<\/a> it with a Wells Notice, signaling an impending enforcement action, without providing further details.","The SEC on Feb. 15 proposed a new custody rule that would explicitly extend safeguarding requirements to crypto firms. Then, SEC Chair Gary Gensler told reporters after the 4-1 vote to propose the rule change that crypto companies are already broadly not in compliance with current asset safeguarding rules that prohibit commingling of customer and company funds.","Paxos also faces uncertainty over the conditional federal trust charter it obtained in 2021, according to at least three people familiar with the matter, after recent guidance from the Federal Reserve Board warned against state-chartered banks holding crypto assets for non-custodial purposes. On Feb. 13 the company's state regulator, the New York Department of Financial Services, issued a consumer alert over its offering with Binance, which Paxos has since ceased.","\"DFS has ordered Paxos to cease minting Paxos-issued BUSD as a result of several unresolved issues related to Paxos’ oversight of its relationship with Binance in regard to Paxos-issued BUSD,\" the New York Department of Financial Services said in a&nbsp;<a class=\"c-link c-link--focus-visible\" href=\"https:\/\/www.dfs.ny.gov\/consumers\/alerts\/Paxos_and_Binance\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.dfs.ny.gov\/consumers\/alerts\/Paxos_and_Binance\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">consumer alert<\/a>&nbsp;published on Feb. 13. \"The Department is monitoring Paxos closely to verify that the company can facilitate redemptions in an orderly fashion subject to enhanced, risk-based, compliance protocols.\"<span class=\"c-message__edited_label\" dir=\"ltr\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">&nbsp;<\/span>","In a statement released after the SEC's proposed custody changes, Paxos commended the proposed rule, and said, \"We look forward to continuing our work with the SEC to make the custody and settlement of all securities safer, more transparent, and more efficient.\"","Paxos acknowledged that its warning letter from the SEC was connected to BUSD, the stablecoin Paxos issues in partnership with the world’s largest crypto exchange, Binance. Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-02-13\/circle-usdc-alerted-new-york-over-binance-peg-busd-issues\" data-v-f87c67ca=\"\">reported<\/a> that Circle, which issues the second-largest stablecoin in the world, flagged Binance's lack of stablecoin reserves to the NYDFS. A similar issue led to FTX’s sudden collapse.","Binance has long been viewed with suspicion by U.S. authorities, which observers saw as a reason for why Paxos was singled out.","“General regulatory suspicion around Binance’s activities, jurisdictions, are most likely playing a part,” said Noelle Acheson, Genesis’ former head of global market insights. “Stablecoins have long been regarded as the ‘low-hanging fruit’ of the crypto industry from a broad regulatory point of view. Going after BUSD through Paxos is the lowest of that low-hanging fruit.”","BUSD launched in 2019 through a partnership between Paxos and Binance. It has since become the third-largest stablecoin in the market with a total supply of over $16 billion. It also plays an important role in Binance’s business with roughly $300 million a year generated via a revenue share with Paxos.","“Just because the regulators don't block something or don't sue on something quickly, doesn't mean they can't do it in the future,” said a former SEC staffer who asked to remain anonymous to speak freely. “It is the incentive structure in the government that it needs to be tough on crypto, very tough on crypto, and that's new, different versus a year ago.”","In the wake of FTX, and the trouble one of its banks — Silvergate — found itself in, federal banking authorities have also cautioned against traditional financial exposure to the risks presented by doing business with cryptocurrency firms. That may also place Paxos' conditional federal trust charter from the Office of the Comptroller of the Currency in jeopardy, at least three people familiar with the matter said.&nbsp;","In an emailed statement, a Paxos spokesperson replied, \"<span id=\"x_m_-4272965130444197311gmail-docs-internal-guid-6813b748-7fff-09f4-6a6e-328dbc616b98\" data-v-f87c67ca=\"\">We believe our stablecoins are unequivocally not securities under either Howey or Reves, and we look forward to continuing to work privately with federal regulators, including the SEC, to make this case.\"<\/span>","The company also said that its BUSD redemptions have gone smoothly since the NYDFS action.","<span id=\"x_gmail-docs-internal-guid-0596ddbb-7fff-f2db-3873-32cf3c48a29f\" data-v-f87c67ca=\"\">\"We have not seen extreme redemption levels and Paxos will continue to support BUSD in circulation for at least one year,\" the spokesperson wrote. \"All BUSD reserves remain fully-backed 1:1 with USD cash &amp; cash equivalents held in custody with our NYDFS Trust.\"&nbsp;<\/span>","Gabriel Shapiro, general counsel at Delphi Labs, said Binance’s reputation and the recent scrutiny on exchanges following FTX’s collapse could have been enough to spark a deeper examination of the relationship between the two companies.","The NYDFS said Paxos was ordered to stop minting new BUSD’s because of “unresolved issues” with the stablecoin issuer’s relationship with Binance. A spokesperson for the regulatory organization also told Reuters that Paxos had “violated its obligation to conduct tailored, periodic risk assessments and due diligence refreshes of Binance and Paxos-issued BUSD customers to prevent bad actors from using the platform.”","If the regulator had concerns that Paxos was not “effectively managing its relationship with Binance to the degree that the stablecoin could result in consumer harm,” then that could be why the regulator went after BUSD and not Paxos’ own USDP stablecoin, said Jason Brett, former U.S. bank regulator and executive vice president at Key Bridge Advisors.","“A key takeaway from this will be whether other stablecoins that are issued in partnership with exchanges such as Binance will be similarly scrutinized over how they manage these relationships, which could cool off interest in the stablecoin markets because of this regulatory uncertainty,” Brett said.","The Paxos and Binance relationship also has a revenue-sharing component that could have caught the attention of regulators.","“Paxos, a U.S. regulated entity, shares 50% of revenue from interest with Binance, which is likely something regulators don’t like,” said Larry Cermak, head of research and data at The Block. “The revenue share component makes it likelier to be considered a security.”","On Binance’s platform, users can stake BUSD and earn yields of around 6%. However, the action from the NYDFS does not focus on the earn product, but instead on the fact BUSD was only issued for use on the Ethereum blockchain.","“It is important to note that the department authorized Paxos to issue BUSD on the Ethereum blockchain,” the New York regulator said. “The department has not authorized Binance-Peg BUSD on any blockchain, and Binance-Peg BUSD is not issued by Paxos.”","There is even less detail on the SEC’s action, which views BUSD as an unregistered security. Paxos said it \"categorically disagrees\" with the SEC’s decision, confirming it received a Wells Notice from the regulator.","The jury is still out on if Paxos can weather this storm. It has other components within its business model including other tokenized assets, an exchange and settlement tools. Paxos said it is prepared “to vigorously litigate” the SEC case if necessary.","Much of Paxos’ future will depend upon the nature of the charges and settlements and what areas of the business model are affected, said a former government agency staffer. The number one thing to be watching now is where does the money that was held in BUSD flow to, they said.","“If Paxos loses this case, the custodial stablecoin business in the U.S. is pretty much doomed — and that goes double for other stablecoin issuers, as the Paxos model is the most conservative one,” said Shapiro of Delphi Labs. “The only hope for the industry would be if Congress steps in and creates a new regulatory structure for issuing stablecoins.”","<em data-v-f87c67ca=\"\">With additional reporting by Colin Wilhelm.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">Corrections: The story has been corrected to remove a reference to Paxos as a custodian for digital assets, to note that Paxos' revenue sharing agreement is not unique in the industry, and to attribute a statement about the OCC. We have also clarified that Bloomberg's report referred to Binance's reserves.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delphi Labs","content":"ORGANIZATION"},{"type":"6%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Gabriel Shapiro","content":"PERSON"},{"type":"OCC","content":"ORGANIZATION"},{"type":"Paxos","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"Paxos","content":"PERSON"},{"type":"$16 billion","content":"MONEY"},{"type":"Colin Wilhelm","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Shapiro","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Department","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Sheila Bair","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Bill Bradley","content":"PERSON"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"NYDFS","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"BUSD","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DFS","content":"ORGANIZATION"},{"type":"Feb. 15","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Binance U.S.","content":"LOCATION"},{"type":"Federal Reserve Board","content":"ORGANIZATION"},{"type":"Feb. 13","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Brett","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Jason Brett","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"Key Bridge Advisors","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BUSD","SEC","USDC"],"authors":["Kari McMahon","Lucy Harley-McKeown","Sarah Wynn","The Block"]}