{"summary":"Bitpanda, the Austrian investment platform, has acquired British crypto and DeFi custodian Trustology for an undisclosed sum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134994\/crypto-unicorn-bitpanda-acquires-trustology","publishDate":"2022-02-22T05:00:07","id":12015,"type":null,"title":"Crypto unicorn Bitpanda snaps up FCA-registered custodian in first acquisition","category":["MERGERS & ACQUISITIONS"],"content":["Bitpanda, the Austrian investment platform, has acquired British crypto and DeFi custodian Trustology to boost its offering for professional investors.&nbsp;","Announced today, the deal will pave the way for Bitpanda Pro — Bitpanda’s platform for experienced traders and institutional investors — to launch its own custody service.","While the company did not disclose an exact valuation, a spokesperson confirmed that it had spent a “significant two-digit million” sum in US dollars on the deal.","Bitpanda’s maiden acquisition comes after a period of frantic fundraising last year that saw the Vienna-based startup raise around $450 million across multiple rounds. The most recent fundraising in August valued the company at $4.1 billion.","Eric Demuth, co-founder and CEO of Bitpanda, said in a statement the launch of a custody service will bring the firm “one step closer to building a leading, fully regulated and secure digital investment platform for everyone, new investors and professionals alike.”","Trustology, which will be rebranded as Bitpanda Custody, has been <a href=\"https:\/\/www.trustology.io\/insights-events\/trustology-gets-full-fca-registration-as-cryptoassets-firm\" data-v-f87c67ca=\"\">fully registered<\/a> as a crypto-assets firm with the UK's Financial Conduct Authority (FCA) since October 2021 — one of only a few dozen crypto startups to have satisfied the regulator’s anti-money laundering requirements.","Trustology’s technology will be used to take custody of all Bitpanda’s assets across its retail, institutional and white-labelling arms. The company said in a statement that this will make it one of the largest crypto custodians globally.","Bitpanda sees the acquisition as a first step towards transforming the Bitpanda Pro platform into a fully-fledged prime brokerage business. The startup <a href=\"https:\/\/www.theblockcrypto.com\/linked\/122230\/bitpanda-hires-jpmorgan-fintech-executive\" data-v-f87c67ca=\"\">hired former JPMorgan executive Joshua Barraclough<\/a> to lead the platform in October of last year. A month later, The Block revealed that the unit <a href=\"https:\/\/www.theblockcrypto.com\/post\/124891\/bitpanda-crypto-derivatives\" data-v-f87c67ca=\"\">planned to launch a crypto derivatives desk<\/a>.","“This is a great step for us as a company and especially for Bitpanda Pro,” said Barraclough. “Recently, we have invested a lot in upgrading Bitpanda Pro exchange as well as boosting our liquidity partnerships, so that we can compete with the largest exchanges on execution capabilities. Now we are looking to massively increase our footprint and bring lots more clients to our venues.”","He added that Bitpanda Pro is moving away from an assets under custody model, aiming over time to drive custody costs to zero for clients that trade actively on the platform.","Trustology last took investment in December 2018, when it <a href=\"https:\/\/www.trustology.io\/insights-events\/trustology-announces-8m-seed-investment-for-digital-asset-safeguarding\" data-v-f87c67ca=\"\">raised $8 million<\/a> in a seed round led by Two Sigma Ventures, with participation from Ethereum developer ConsenSys.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$450 million","content":"MONEY"},{"type":"$4.1 billion","content":"MONEY"},{"type":"Bitpanda Custody","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Barraclough","content":"PERSON"},{"type":"December 2018","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"Joshua Barraclough","content":"PERSON"},{"type":"Vienna","content":"LOCATION"},{"type":"Eric Demuth","content":"PERSON"},{"type":"October 2021","content":"DATE"},{"type":"UK's Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Bitpanda","content":"LOCATION"},{"type":"Bitpanda Pro","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"August","content":"DATE"},{"type":"Two Sigma Ventures","content":"ORGANIZATION"}],"hashtag":["FCA"],"authors":["Ryan Weeks","The Block"]}