{"summary":"Coinchange employs its risk-managed Earn API platform to let its business users to trade and access digital asset yields.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265071\/defi-yield-platform-coinchange-raises-10-million-in-funding","publishDate":"2023-11-29T06:02:00","id":12029,"type":null,"title":"DeFi yield platform Coinchange raises $10 million in funding","category":["VENTURE CAPITAL"],"content":["Decentralized finance platform Coinchange raised $10 million in funding","The firms G1.VC, Spirit Blockchain, Good News Ventures, K2.CA and Atoia Ventures led the round, which saw additional participation from Mintfox.&nbsp;","Coinchange lets its business users trade and access digital asset yields as a service through its Earn API, a risk-managed platform for stable returns that supports bitcoin, ethereum and all major stablecoins.&nbsp;","The firm will use the funding to grow its operations and services along with onboarding new clientele, the company said in a statement.&nbsp;","\"As part of our expansion plans with this funding, we'll continue to improve our products and expand our clientele to provide the simplest and most secure ways to earn passive income on crypto holdings,\" Coinchange CEO Maxim Galash said. \"We aim to have Earn API empower fintechs and exchanges to unlock yield-earning accounts for millions of users across the globe.\"","Along with DeFi yield services, Coinchange manages compliant brokerage services in the U.S. and Europe, the firm added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Maxim Galash","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"Spirit Blockchain","content":"ORGANIZATION"},{"type":"Mintfox","content":"LOCATION"},{"type":"Coinchange","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"Atoia Ventures","content":"ORGANIZATION"},{"type":"Good News Ventures","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}