{"summary":"Polygon 2.0 will provide a multi-chain network of ZK-powered Layer 2 chains that can securely interact with each other.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234354\/polygon-2-zk","publishDate":"2023-06-13T02:54:51","id":12024,"type":null,"title":"Polygon unveils plan to build network of ZK-based Layer 2 chains","category":["LAYER 2S AND SCALING"],"content":["The core team at Polygon has unveiled its plan for building Polygon 2.0 — envisioned as a network of zero-knowledge-powered Layer 2 blockchains.&nbsp;","Polygon operates a proof-of-stake sidechain network called Polygon POS,&nbsp;which runs parallel to Ethereum and hosts notable crypto apps, such as Uniswap and Aave. It also manages a Layer 2 network based on ZK-Rollups, named Polygon zkEVM, <a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">complementing<\/a> its existing proof-of-stake chain.","However, the team is preparing to create additional Layer 2s that leverage ZK-Rollups — one of the two most adopted solutions designed to scale Ethereum with off-chain computation. Such individual Layer 2s could interact with each other securely.&nbsp;","The team explained that the architecture of Polygon 2.0 is being designed to facilitate instantaneous and secure cross-chain interactions with Layer 2 chains without additional trust assumptions. The team stated that this initiative aims to establish the “Value Layer of the Internet.”","“Individual blockchains aren’t infinitely scalable; they have strict throughput limits,\" the team <a href=\"https:\/\/polygon.technology\/blog\/introducing-polygon-2-0-the-value-layer-of-the-internet?utm_source=twitter&amp;utm_medium=social&amp;utm_content=polygon-2.0-value-layer\" data-v-f87c67ca=\"\">noted.<\/a>&nbsp;\"We can add capacity by creating new chains, but not without fragmenting liquidity and reducing security and capital efficiency. Enter Polygon 2.0.\"","Polygon has previously shown interest in creating multiple chains using its software stack called SuperNets. The team has been involved in developing individual chains for <a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers\" data-v-f87c67ca=\"\">Immutable<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/221942\/gaming-project-aavegotchi-to-release-own-blockchain-with-polygon-supernets\" data-v-f87c67ca=\"\">Aavegotchi<\/a>. With Polygon 2.0, the emphasis will shift towards creating more interconnected chains, leading to ecosystems akin to Cosmos and Polkadot. However, the unique approach, in this case, involves developing them as Layer 2s that leverage ZK-Rollups.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon POS","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Aavegotchi","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"}],"hashtag":["POLYGON","ZKEVM"],"authors":["Vishal Chawla","The Block"]}