{"summary":"Policymakers — and not the European Central Bank — will need to decide how much privacy will be lost to financial law compliance on a digital euro.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204705\/ecb-says-it-will-leave-digital-euro-privacy-decisions-to-eu-lawmakers","publishDate":"2023-01-23T11:56:20","id":12023,"type":null,"title":"ECB says it will leave digital euro privacy decisions to EU lawmakers","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Lawmakers — and not the European Central Bank — will need to decide how much personal information the bank will have access to if it adopts a digital euro.&nbsp;<\/span>","But the ECB's leadership isn't clamoring to have direct knowledge of individual transactions, one of its board members told MEPs.&nbsp;","<span data-v-f87c67ca=\"\">“We propose that we do not have access to any personal data,” executive board member Fabio Panetta told the EU Parliament’s economic committee on Monday in a regular dialogue on the digital euro.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It will be for you as co-legislators to decide on the balance between privacy and other important public policy objectives,” he added, naming anti-money laundering, counter-terrorism financing, preventing tax evasion and ensuring sanctions compliance.<\/span>","<span data-v-f87c67ca=\"\">The digital euro will likely rely on intermediaries like private banks to hold digital euro accounts for users. Those intermediaries would “not have more access than they have already now,\" Panetta added.<\/span>","<span data-v-f87c67ca=\"\">Lawmakers can also expect to decide whether the digital euro could be used as legal tender, and whether intermediaries would be required to distribute it. <\/span><span data-v-f87c67ca=\"\">Panetta noted that the digital euro “would never be programmable money” that would put constraints on users. “Central banks issue money, not vouchers,\" he said.<\/span>","<span data-v-f87c67ca=\"\">The central bank may not opt for blockchain technology as the underlying technology, as its leadership worries it may not be efficient for supporting a scale of 400 million people, Panetta said.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The ECB is halfway through its investigation phase on the digital euro. <\/span>","<span data-v-f87c67ca=\"\">In October, the central bank will decide whether to move forward with a realization phase, where it will develop and test technical solutions and business strategies for the CBDC. However, it will be up to European institutions to decide whether the digital euro will become a reality.<\/span>","<span data-v-f87c67ca=\"\">The European Commission is expected to come out with a proposal on the digital euro in the second quarter of 2023. This will kick off the legislative process, as the European Parliament and Council will need to come to an agreement on digital euro policy.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fabio Panetta","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Panetta","content":"PERSON"},{"type":"ECB","content":"ORGANIZATION"},{"type":"EU Parliament","content":"ORGANIZATION"},{"type":"the second quarter of 2023","content":"DATE"},{"type":"European Parliament and Council","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"October","content":"DATE"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"European Central Bank —","content":"ORGANIZATION"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}