{"summary":"Prosecutors say SafeMoon executives lied to investors about having &#x27;locked&#x27; liquidity and instead used the funds to buy luxury cars.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260514\/safemoon-executives-arrested-after-doj-sec-allege-they-misappropriated-millions-buying-luxury-cars-and-real-estate","publishDate":"2023-11-01T13:30:45","id":12028,"type":null,"title":"SafeMoon executives arrested after DOJ, SEC allege they misappropriated millions, buying luxury cars and real estate","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Two SafeMoon executives were arrested after prosecutors said they lied to investors about having 'locked' liquidity, when instead they allegedly used the funds to buy luxury cars and real estate.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Braden John Karony, 27, and Thomas Smith, 35, were arrested on Wednesday, while another executive, Kyle Nagy, 35, remains at large, according to a statement from the U.S. Attorney's Office for the Eastern District of New York. <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prosecutors, in a joint enforcement action with the Securities and Exchange Commission, say the trio diverted millions of dollars to buy a custom Porsche sports car and real estate, among other purchases.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"As fraudsters increasingly use digital assets to mislead investors and misappropriate funds, our Office will be at the forefront of pursuing them and their ill-gotten gains. We will continue our focus in the digital asset space and bring those who defraud investors in this area to justice,\" said U.S. Attorney for the Eastern District of New York Breon Peace.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SafeMoon issues decentralized finance digital assets called SafeMoon, or SFM. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">SFM reached a market cap of more than $9 billion dollars and since its launch in March 2021 had more than two million SFM holders, according to a court filing.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SafeMoon transactions were subject to a 10 percent tax, with half being marketed as going to designated SFM liquidity pools that defendants said would prevent them from being used to enrich developers, prosecutors said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In reality, the defendants allegedly retained access to the SFM liquidity pools and they used that access to intentionally divert and misappropriate millions of dollars’ worth of tokens from the SFM liquidity pools for their personal benefit,\" prosecutors said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The three were charged with conspiracy to commit securities fraud, conspiracy to commit wire fraud and money laundering conspiracy.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission also brought charges against Smith, Nagy and Karony on Wednesday for alleged fraud and offering unregistered securities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC called SafeMoon a \"crypto asset security\" and said the three executives failed to deliver promised profits and misappropriated investor funds for their own personal use.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC said SafeMoon tokens are securities because \"purchasers invested money in a common enterprise and reasonably expected profits or returns derived from the entrepreneurial or managerial efforts of others, in this case, the defendants.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Decentralized finance claims to deliver transparency and predictable outcomes, but unregistered offerings lack the disclosures and accountability that the law demands, and they attract scammers like Kyle Nagy, who use these vulnerabilities to enrich themselves at the expense of others,” said David Hirsch, chief of the SEC Enforcement Division’s Crypto Assets and Cyber Unit, in a statement.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Notably, the SEC also called BNB a \"crypto asset security.\" The agency previously said it considered BNB a security in a separate case brought against <a href=\"https:\/\/www.theblock.co\/post\/233151\/binance-coin-price-tumbles-as-sec-files-lawsuit-against-crypto-exchange-giant\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Binance<\/span><\/a> in June.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Updated at 2:05 p.m. ET with details<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Porsche","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"misappropriate millions of dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Smith","content":"ORGANIZATION"},{"type":"David Hirsch","content":"PERSON"},{"type":"March 2021","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"SFM","content":"ORGANIZATION"},{"type":"2:05 p.m.","content":"TIME"},{"type":"Nagy","content":"PERSON"},{"type":"Kyle Nagy","content":"PERSON"},{"type":"John Karony","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Eastern District of New York","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Eastern District of New York Breon Peace","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"$9 billion dollars","content":"MONEY"},{"type":"Thomas Smith","content":"PERSON"},{"type":"10 percent","content":"PERCENT"},{"type":"SEC Enforcement Division’s Crypto Assets","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}