{"summary":"Leaders across web3 offered a nuanced appraisal of a jury’s decision that Mason Rothschild violated Hermès’ trademark rights when the NFT artist created and sold digital assets that closely mimicked the design of the handbag maker’s physical product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210317\/metabirkins-lost-to-hermes-but-be-they-art-or-merchandise-nfts-are-being-taken-seriously","publishDate":"2023-02-09T16:50:12","id":12026,"type":null,"title":"MetaBirkins lost to Hermès. But be they art or merchandise, NFTs are being taken seriously.","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">MetaBirkins creator Mason Rothschild may have lost a trademark case over Birkin bags to Hermès, but not everyone sees it as bad news for NFTs.<\/span>","<span data-v-f87c67ca=\"\">Leaders across web3 are offering a nuanced appraisal of a federal jury’s decision that Rothschild violated Hermès’ trademark rights when the NFT artist created and sold digital assets which closely mimicked the design of the French handbag maker’s physical product.<\/span>","<span data-v-f87c67ca=\"\">The ruling in a Manhattan federal court in favor of Hermès this week set off fears surrounding NFTs and their future. The case is seen by some as defining for artistic NFT collections that borrow elements of existing intellectual property. Hermès targeted the NFT artists’ collection of 100 customized, digitized handbags similar to the original Birkin, which can sell for hundreds of thousands of dollars. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">\"While this might be an upsetting decision for many members of the NFT community, I think it's a signal that the art is being taken seriously,” said Joshua James, co-founder of OneOf, which <\/span>creates and sells NFT trading cards based on “iconic” brands. <span data-v-f87c67ca=\"\">“Digital collectibles carry value to consumers, and they must be just as authentic and verified as the real-world items they emulate.\"<\/span>","<span data-v-f87c67ca=\"\">Rothschild’s “MetaBirkins” originally sold for about $450 before their value soared on to tens of thousands of dollars, according to Bloomberg.<\/span>","<span data-v-f87c67ca=\"\">NFTs originally caught fire among collectors thanks to artistic, profile-picture-like non-fungible token collections like CryptoPunks, Bored Ape Yacht Club and Doodles. Since then, major corporations and brands have released lower-priced collections inspired by existing intellectual property like Nike shoes, the popular TV series “Game of Thrones” or Budweiser beer.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“What’s that great quote about art? ‘Good artists copy, great artists steal,’” said Les Borsai, co-founder of Wave Financial, which manages an NFT fund. “Art has always been connected to other derivatives. You can say we wouldn’t have the music market we have today without samples.”<\/span>","<span data-v-f87c67ca=\"\">Fred Hsu, CEO of ClubID, a membership platform for web3 communities, backed the brand's position.<\/span>","“<span data-v-f87c67ca=\"\">I 100 percent side with the IP owner. The intent to sell art that almost identically resembles an existing product, and not even changing its name for the collection, was a blatant infringement,” said Hsu “If these were bags being sold in the real world, there wouldn't have even been a doubt.\"<\/span>","<span data-v-f87c67ca=\"\">But some NFT advocates might argue that in a way MetaBirkins do exist in the real world, only as digital assets. Because in part, the advent of digital assets has meant that not being able to hold something in one’s hand no longer precludes an object from having real-world value.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“What we’re seeing here with the Hermès lawsuit is the beginning of a deeper, much-needed conversation around how we legally categorize NFTs and what protections these digital collectibles, and their creators, should have in a court of law,” said Inder Phull, CEO of Pixelnyx, a web3 music and gaming platform. “The court has decided that NFTs are not works of art, but rather more similar to consumer goods. I expect that as the web3 space matures and continues to integrate with mainstream culture, we’ll come to a more nuanced perception of NFTs.”<\/span>","<span data-v-f87c67ca=\"\">Nihar <\/span><span data-v-f87c67ca=\"\">Neelakanti<\/span><span data-v-f87c67ca=\"\"> echoed James’ positive sentiments. <\/span>","<span data-v-f87c67ca=\"\">“The jurors determined something very positive for the space: that NFTs are more than art,” said the CEO of Ecosapiens, a platform that aims to help people combat climate change with NFTs. “They are unique assets and technologies that can be protected under U.S. trademark or patent law.”<\/span>","A substantial part of Hermès’ lawsuit centered around the notion that Rothschild had damaged the Birkin brand. The fashion company also said it had plans to potentially release its own NFTs, according to Bloomberg.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWave Financial's Borsai, who says he owns more than 2,000 NFTs including CryptoPunks, said ultimately big brands will aim to protect what sets them apart. Artists who want to create derivative works should try and strike a deal beforehand, he said. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Fashion companies … their whole game is protecting the things they create,” Borsai said. “It’s really easy to err on the safe side and say ‘If I’m going to knock off a Birkin then maybe I want to get permission before I do so and not just benefit off of the Birkin.’”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Les Borsai","content":"PERSON"},{"type":"Pixelnyx","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"tens of thousands of dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Birkin","content":"LOCATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"100 percent","content":"PERCENT"},{"type":"Borsai","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Mason Rothschild","content":"ORGANIZATION"},{"type":"Ecosapiens","content":"LOCATION"},{"type":"Rothschild","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Hermès","content":"PERSON"},{"type":"$450","content":"MONEY"},{"type":"Nike","content":"ORGANIZATION"},{"type":"Inder Phull","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"Joshua James","content":"PERSON"},{"type":"Fred Hsu","content":"PERSON"}],"hashtag":["COURT HEARINGS"],"authors":["RT Watson","The Block"]}