{"summary":"Major Ethereum Layer 2 chains implementing blobs have seen a dramatic drop in average transaction fees — following the Dencun upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282417\/ethereum-layer-2s-show-dramatic-drop-in-transaction-fees-after-dencun","publishDate":"2024-03-14T03:16:46","id":1202,"type":null,"title":"Ethereum Layer 2s show a dramatic drop in transaction fees after Dencun","category":["CRYPTO ECOSYSTEMS"],"content":["Yesterday’s <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">Dencun upgrade<\/a> on Ethereum appears to have fulfilled its promise of reducing transaction costs on Layer 2s.","Major Layer 2 chains that implemented blobs have seen their average transaction fees drop dramatically.","For the uninitiated, the upgrade provided Layer 2s with a new transaction type called blobs. These blobs serve as a new point of location for the chains when posting information on Ethereum, instead of the traditional “calldata” method, offering a direct path to fee reduction.","Data from Layer 2s, such as in the Optimism ecosystem, including OP Mainnet, Base, and Zora, as well as others like zkSync and Starknet, all indicate a drop in transaction fees of several folds.","For example, the median gas fees on Base have fallen from around $0.5 on March 13 (right before Dencun went live) to about $0.0012, according to the latest on-chain data aggregated by <a href=\"https:\/\/dune.com\/Marcov\/layer-2-transaction-cost\" data-v-f87c67ca=\"\">Marcov on Dune<\/a>. Meanwhile, the average fees on Base stand at $0.06. Similar numbers are applicable for OP Mainnet, which is also part of the Optimism ecosystem, just like Base.","<span data-v-f87c67ca=\"\">Median transaction fees across Layer 2s | Source: <a href=\"https:\/\/dune.com\/Marcov\/layer-2-transaction-cost\" data-v-f87c67ca=\"\">Dune (via Marcov)<\/a><\/span>","On Starknet, reductions in fees were observed as well. Argent, one of the largest wallet providers on the network, <a href=\"https:\/\/twitter.com\/argentHQ\/status\/1767917028013224370\" data-v-f87c67ca=\"\">noted<\/a> on X that average fees for a swap on Starknet stood at $0.04 (at the time of the post) as opposed to over $6.8 a few days prior to Dencun.","Meanwhile, the most widely used Layer 2, Arbitrum One, has yet to integrate with Dencun improvements. It plans to launch its ArbOS upgrade later today, introducing blob support to Arbitrum rollup chains.","More than <a href=\"https:\/\/dune.com\/queries\/3519378\" data-v-f87c67ca=\"\">3000 blobs<\/a> have been used so far. It is anticipated that Layer 2 chains utilizing blobs might experience higher fees in the future. As the number of rollups employing blobs increases, competition for blob space is expected to intensify, leading to slightly higher transaction costs.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.5","content":"MONEY"},{"type":"Dune","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$6.8","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"$0.0012","content":"MONEY"},{"type":"$0.04","content":"MONEY"},{"type":"OP Mainnet","content":"ORGANIZATION"},{"type":"Marcov)","content":"ORGANIZATION"},{"type":"Dencun","content":"PERSON"},{"type":"$0.06","content":"MONEY"}],"hashtag":["BASE","DEVELOPER TOOLS","ETHEREUM","PROTOCOLS","ROLLUPS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}