{"summary":"Grayscale has reported record inflows into its family of crypto funds with more than $1 billion finding its way to the asset manager in Q3\nThat’s striking, according to JPMorgan, considering the outflows from gold funds recently. ","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85463\/jpmorgan-gold-funds-grayscale-investments","publishDate":"2020-11-23T11:28:15","id":1202,"type":null,"title":"JPMorgan reports &#x27;modest outflows&#x27; for gold funds as more than $1 billion poured into Grayscale in Q3","category":["Markets"],"content":["\"Drop gold.\"","Crypto enthusiasts will remember that slogan from an ad campaign <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100634\/grayscale-chainlink-digital-asset-fund\" data-v-f87c67ca=\"\">Grayscale<\/a> ran last year to woo investors to its suite of crypto funds. Now, more than a year later, it appears that investors are heeding the recommendation of the crypto asset management firm.&nbsp;","Michael Sonnenshein, a managing director at firm, said that 2020 has been a year marked by \"unprecedented capital inflows for the Grayscale business.\"","\"On the heels of 2019, which was a record year for us, the momentum has carried into 2020,\" he told The Block. \"In Q3, the firm raised over $1 billion and we are pleased to share with you that we are seeing that momentum only increase — two-thirds of the way into Q4.\"","The inflows into Grayscale's funds are striking juxtaposed with action in the gold market, according to a group of analysts at JPMorgan in a report published Friday.","\"What makes the past five weeks flow trajectory for the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/23109\/inflows-into-grayscale-products-picked-up-40-in-q1-fueled-by-offshore-hedge-funds-looking-for-bitcoin-exposure\" data-v-f87c67ca=\"\">Grayscale<\/a> Bitcoin Trust even more impressive is its contrast with the equivalent flow trajectory for gold ETFs, which saw modest outflows since mid-October,\" the analysts wrote, adding:","The contrast isn't surprising to Sonnenshein, who said that Grayscale made a bet that money would rotate into bitcoin as a result of shifting preferences.&nbsp;","\"Going back to the Drop Gold campaign, we took a look at generational investment preferences and we are now seeing the beginning of this wealth transfer,\" he said.&nbsp;","Recent gold ETF outflows have been underpinned by a decline in the metal's price since midsummer. After a roaring rally that brought the price of bullion above $2,000 earlier this year, the price of gold has fallen by about 10% since the market's August peak.&nbsp;","Optimism tied to an upcoming vaccine is said to be playing a role. Also, inflation — which is believed to be a tailwind for gold — appears to be less of a concern among Wall Streeters. Indeed, Goldman Sachs wrote in a note to clients that it viewed a dramatic rise in inflation in the next couple of years to be \"unlikely.\"","","","Analysts at Macquarie expect things to get even worse for gold.","According to&nbsp;<a href=\"https:\/\/www.ft.com\/content\/a1f0a75c-b3d7-4550-88ef-ea8cad18d0f3\" data-v-f87c67ca=\"\">reporting<\/a> by the Financial Times, analysts at the bank say the bull market for gold has come to an end and expect the price of the commodity to fall to $1,550 per troy ounce by next year, a 17% decline from current prices.&nbsp;"],"hashtag":["BITCOIN"]}