{"summary":"Binance CEO Changpeng Zhao said the exchange had to move funds in its main bitcoin wallet to provide verification to an auditor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190240\/binance-moves-2-billion-of-bitcoin-as-part-of-reserves-audit","publishDate":"2022-11-28T07:41:32","id":12035,"type":null,"title":"Binance moves $2 billion of bitcoin as part of reserves audit","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Binance has moved 127,351 bitcoin ($2 billion) to verify to an auditor it has control over the claimed <a href=\"https:\/\/blockstream.info\/address\/34xp4vRoCGJym3xR7yCVPFHoCNxv4Twseo\" data-v-f87c67ca=\"\">address<\/a>.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The transfer of such a large amount of bitcoin today from Binance to an unknown wallet led to questions among the crypto community regarding the nature of the transaction. In response, Binance CEO <\/span><span data-v-f87c67ca=\"\">Changpeng Zhao clarified that the transfer is part of an ongoing audit at Binance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This is part of the Proof-of-Reserve Audit. The auditor requires us to send a specific amount to ourselves to show we control the wallet. And the rest goes to a Change Address, which is a new address,” Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1597192848025464833\" data-v-f87c67ca=\"\">claimed<\/a>. He added the exchange has rotated the funds to a <a href=\"https:\/\/blockstream.info\/address\/3JJmF63ifcamPLiAmLgG96RA599yNtY3EQ\" data-v-f87c67ca=\"\">new address<\/a> in its control.<\/span>","<span data-v-f87c67ca=\"\">Last week, Binance officially <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-releases-proof-of-reserves-system-0c7a786cbe8c4e108f3301385ab61e39\" data-v-f87c67ca=\"\">introduced<\/a> its first proof-of-reserves system, a prototype aiming to show that it holds the reserves necessary to cover all customer deposits. It's currently working on a more complete audit.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The pressure on centralized crypto exchanges to adopt “proof of reserves” has increased dramatically after the collapse of crypto exchange FTX. By publishing both the total amount of assets and liabilities, exchanges can indicate that they have the reserves on hand to meet customer withdrawal requests.&nbsp; However, these initial reserves don't necessarily show the full picture, as they don't provide details on the exchange's liabilities.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Reserves can be shown in two ways or a combination of both. The first is by having the reserves audited by independent third-parties auditors whereas the second is by providing a list of public addresses that hold different assets, as <\/span><a href=\"https:\/\/halborn.com\/proof-of-reserves-how-does-it-work-and-why-is-it-so-important\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\"> by security firm Halborn. Each has different benefits and drawbacks.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Change Address","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Halborn","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Vishal Chawla","The Block"]}