{"summary":"Shadow says the platform can be used to help address problems frequently seen by onchain analysts and researchers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265947\/crypto-data-platform-startup-shadow-raises-9-million-in-paradigm-led-seed-round","publishDate":"2023-12-05T09:00:05","id":12032,"type":null,"title":"Crypto data platform startup Shadow raises $9 million in Paradigm-led seed round","category":["COMPANIES"],"content":["Crypto data platform startup Shadow, which says it can reduce development costs on Ethereum, has raised $9 million in a seed round led by Paradigm.","Additional angel investors included individuals who work at Coinbase Ventures, Electric Capital, the Ethereum Foundation, Uniswap and Flashbots, the company said in a statement provided to The Block.","The company's first product, which allows \"anyone to augment any contract to get the exact data they need with custom events and view functions,\" is now open for public demo. Using so-called \"shadow forks,\" private execution environments are designed to mirror the state of a public blockchain in real time.&nbsp;","The platform can be used to help address problems frequently seen by onchain analysts and researchers including inadequate events, in addition to contract optimization and data ergonomics.&nbsp;","<span data-v-f87c67ca=\"\">Shadow co-founders Alvin and Emily Hsia.<\/span>","The startup was co-founded by brother and sister Alvin and Emily Hsia, who both have previous technical experience at Airbnb and have worked together for the past eight years inside and outside of crypto. They said in an interview with The Block that they both got serious about blockchain development in the \"DeFi summer\" of 2020.","\"The problem that we are solving is that blockchains are fundamentally a new type of database, but it's still far too difficult to work with the data,\" said Shadow CEO Alvin Hsia, adding that most of the interesting data on blockchains are generated by smart contracts. \"But the problem is that smart contract event logs are much more limited and constrained today compared to how they work in web2.\"","The product is already live, and early customers have included DeFi protocols and web3 platforms, he added.&nbsp;","Shadow intends to use the fresh funding to hire more engineers, Emily Hsia, who serves as CTO, said.&nbsp;","\"We worked closely with Alvin and Emily as they developed Shadow during Paradigm's Entrepreneur in Residence (EIR) Program,\" Paradigm Chief Technology Officer and Research Partner Georgios Konstantopoulos said in an emailed statement. \"We think Shadow Logs are going to enable teams to ship more cost-effective smart contracts, access more data, and tighten teams' time to market. We are beyond excited to be partnering with this stellar team.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Emily","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Airbnb","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Emily Hsia","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Alvin Hsia","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"$9 million","content":"MONEY"},{"type":"Georgios Konstantopoulos","content":"PERSON"},{"type":"Coinbase Ventures, Electric Capital","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"CTO","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Alvin","content":"PERSON"},{"type":"\" Paradigm Chief Technology Officer and Research","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Nathan Crooks","The Block"]}