{"summary":"In a court hearing on Friday, a lawyer representing Bitmain said the bitcoin miner maker giant recorded a loss of nearly $60 million in 2019.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88414\/bitmain-60m-2019-loss-court","publishDate":"2020-12-18T11:20:50","id":12049,"type":null,"title":"Bitmain recorded a nearly $60M loss in 2019, lawyer says in court hearing","category":["STARTUPS"],"content":["In a court hearing on Friday, a lawyer representing Bitmain has said the bitcoin mining giant recorded a loss of nearly $60 million in 2019.","Four former Bitmain staffers, whose employment was terminated in early 2020 as part of Bitmain's layoff efforts since late 2019, brought a lawsuit against the firm earlier this year. They're accusing Bitmain of owing them additional severance, compensation and bonus payments.","While the amount of their demands may not seem significant — ranging from $1,500 to $20,000 — Bitmain's lawyer at one point during the hearing disclosed the firm's financial data in 2018 and 2019, which was not previously known.","According to a <a href=\"http:\/\/tingshen.court.gov.cn\/live\/16283662\" data-v-f87c67ca=\"\">live stream<\/a> of the hearing held on December 18, Bitmain's lawyer said the company lost nearly 400 million yuan ($61 million) in 2019, which was a significant reduction from the 3 billion yuan ($450 million) of profit from 2018.&nbsp;","That also means Bitmain's net loss started even before 2019. The firm's initial public offering prospectus in 2018 showed it made $1 billion in profit for the first half of 2018. With a whole year profit of about $450 million, as Bitmain lawyer's said, Q3 and Q4 of 2018 resulted in a loss of more than $500 million as the bear market continued.&nbsp;","The lawyer's note on the financial data was in response to the four former staffers' accusation that <a href=\"https:\/\/www.theblockcrypto.com\/post\/3010\/crypto-caselaw-minute-week-of-11-4-18-bitmain-chases-a-ghost-canada-cracks-down-on-coin-deal\" data-v-f87c67ca=\"\">Bitmain<\/a> breached employment contracts by not paying their entitled 13th-month salary and bonus for 2019. As such, the four plaintiffs are demanding more money from the miner maker.","Bitmain's lawyer argued that the issuance of a 13th-month compensation and bonus depends on the company's overall business performance, which is not contractual by law but an internal policy. Since Bitmain endured a massive performance shift from 2018 to 2019, the lawyer said there were no 13th-month payments and bonuses for all staff in 2019.","But the four plaintiffs cited reports that Bitmain handed out up to 70,000 yuan (~$11,000) to each employee in May as a special bonus — buoyed by $300 million revenue generated in the first four months of 2020. They alleged that Bitmain delayed the 2019 bonus to May but did not pay what the plaintiffs were entitled. To that point, Bitmain's lawyer argued the special bonus was in fact based on the 2020 performance and had nothing to do with 2019.","But $10,000 as a bonus, if anything, was an indication that <a href=\"https:\/\/www.theblockcrypto.com\/post\/3884\/crypto-caselaw-minute-week-of-11-18-18-conundrums-come-from-bitmain-configurations-mislaid-ether\" data-v-f87c67ca=\"\">Bitmain<\/a> was boosting morale and trying to somehow turn the tide in 2020 after a less-than-stellar year.","Indeed, it failed to fully seize the market's significant growth of demand in bitcoin's hash rate in 2019, especially in the second half of year, while spending on research and development for the next generation of equipment.","Bitcoin network's total hash rate grew by 100% during the second half of 2019. While Bitmain was sitting on the sideline, its main rival MicroBT sold some 600,000 units of its flagship WhatsMiner equipment in 2019, which significantly boosted its market share and eroded Bitmain's dominance.","The loss of money and market share led Bitmain co-founder Wu Jihan to return to the company in October 2019 in a coup that forced out his rival co-founder Zhan Ketuan.","Upon his return, Wu revealed the long-running power fight between him and Zhan and how he believed the way to \"save the ship\" was for him to retake control.","The internal turmoil soon escalated in public view as the two sides have continued to fight over control of Bitmain throughout most of 2020.","But in September, the fight came to an end — or a short-term one, at least. Over the past three months, the firm has made public several purchasing deals for more than 80,000 units of its flagship AntMiner S19 and S19 Pro from U.S. miners and mining farm operators such as Marathon, Riot Blockchain and Core Scientific.","As The Block <a href=\"https:\/\/www.theblockcrypto.com\/post\/88151\/bitcoin-mining-hardware-bidding-war\" data-v-f87c67ca=\"\">reported<\/a> this week, with bitcoin's price breaking new highs above $20,000, the bidding war for the most efficient and powerful ASIC mining equipment is heating up again.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$450 million","content":"MONEY"},{"type":"400 million yuan","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"second half of 2019","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"Bitmain","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"$11,000","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"$60 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"3 billion yuan ($450 million","content":"MONEY"},{"type":"December 18","content":"DATE"},{"type":"Bitmain","content":"ORGANIZATION"},{"type":"October 2019","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Zhan Ketuan","content":"PERSON"},{"type":"Marathon","content":"LOCATION"},{"type":"the first four months of 2020","content":"DATE"},{"type":"$61 million","content":"MONEY"},{"type":"$1,500","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"$10,000","content":"MONEY"},{"type":"$300 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"second half of year","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}