{"summary":"Factory pools on Curve Finance faced a reentrancy vulnerability, a security flaw allowing potential funds drain from interrupted contract calls.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242066\/curve-finance-factory-pools-targeted-due-to-reentrancy-vulnerability","publishDate":"2023-07-30T13:09:22","id":12040,"type":null,"title":"Curve Finance factory pools targeted due to reentrancy vulnerability","category":["CRYPTO ECOSYSTEMS"],"content":["Factory pools on Curve Finance have been confronted with a reentrancy vulnerability, a critical security flaw that arises when a contract's external call is interrupted and called back before its completion, potentially allowing attackers to maliciously drain funds or exploit the contract's logic. This vulnerability led to significant outflows across various associated pools, amounting to over $26 million.&nbsp;","According to security analysts at Beosin, the attacker targeted Curve's factory pools of multiple projects: JPEGd, Metronome and Alchemix.","JPEGd’s pETH-ETH factory pool on Curve saw an outflow of $11.4 million. Following closely, the Metronome’s sETH-ETH pool saw a movement of $1.6 million. However, it was the Alchemix’s alETH-ETH pool that witnessed the most significant activity, with a substantial $13.6 million being transacted.&nbsp;","So far, overall asset outflows related to this security incident on Curve pools have crossed <a href=\"https:\/\/docs.google.com\/spreadsheets\/d\/1gUi7Nxs6V4wHKUMfSq85d2ShFW3fsMfggKIEV846ROQ\/edit#gid=0\" data-v-f87c67ca=\"\">$41 million<\/a>, according to estimates from security firm BlockSec.","Curve Finance is a decentralized exchange (DEX) optimized for efficient stablecoin trading. Over time, it has expanded its offerings to cater to other types of assets. Factory pools describe a system where new liquidity pools can be created using a standardized framework or “factory.” Instead of the Curve team manually creating each pool, this system offers a more permissionless approach, enabling projects or individuals to launch their own liquidity pools leveraging Curve’s infrastructure.","Today’s outflows involved a sequence of interactions. They began with a flashloan, which appeared to exploit the reentrancy vulnerability associated with certain older compiler versions of Vyper – the smart contract programming language used to write the code for these factory pools, as explained by Igor Igamberdiev, the head of research at Wintermute.&nbsp;","Vyper has <a href=\"https:\/\/twitter.com\/vyperlang\/status\/1685692973051498497\" data-v-f87c67ca=\"\">acknowledged<\/a> that its versions 0.2.15, 0.2.16, and 0.3.0 are vulnerable to malfunctioning reentrancy locks, with investigations ongoing.","While the immediate reaction was dominated by concerns of a massive security breach, on-chain data suggests that MEV bots might have front-run some of these transactions. This has led to speculation that whitehat hackers could be involved.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$41 million","content":"MONEY"},{"type":"Wintermute","content":"LOCATION"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$26 million","content":"MONEY"},{"type":"$1.6 million","content":"MONEY"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Beosin","content":"LOCATION"},{"type":"$11.4 million","content":"MONEY"},{"type":"$13.6 million","content":"MONEY"},{"type":"Igor Igamberdiev","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","Frank Chaparro","The Block"]}