{"summary":"Tether and Bitfinex CTO Paolo Ardoino suggests Ethereum still falls short compared to Bitcoin.\nArdoino argued that it’s all about narrative.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170075\/tether-cto-paolo-ardoino-on-the-merge-ethereum-still-doesnt-match-bitcoin","publishDate":"2022-09-14T12:46:18","id":1204,"type":null,"title":"Tether CTO Paolo Ardoino on The Merge: &#x27;Ethereum still doesn’t match Bitcoin&#x27;","category":["The Merge"],"content":["<span data-v-f87c67ca=\"\">Paolo Ardoino, CTO of Tether and Bitfinex, said today that Ethereum still doesn’t match Bitcoin because its narrative keeps shifting.<\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block, Ardoino said “While Bitcoin is a form of money, Ethereum is stuck between claims of being a form of money and claims of being a platform, but ETH cannot compete with Bitcoin on the money front because there is no fixed supply, and it isn’t really a world computer yet because it has a shared global state and hence too slow to be scalable.”<\/span>","<span data-v-f87c67ca=\"\">The Merge — Ethereum’s highly anticipated transition from proof of work to proof of stake — is now just hours away, promising to reduce energy consumption by over 99% and clearing the roadmap for future scaling upgrades.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, Ardoino is more critical of the change, stating “The Merge will not fix transaction fees or make Ethereum any more decentralized. The Merge has put a huge focus on Ethereum, but what will we be left with?\"<\/span>","<span data-v-f87c67ca=\"\">Ardoino added that The Merge won’t impact the ecosystem’s Layer 2 solutions either as it doesn’t directly solve Ethereum’s scalability issues.<\/span>","<span data-v-f87c67ca=\"\">“The real message here isn’t what the Merge will change but what asset already exists that provides the core themes of our industry, which includes true decentralization. The fact of the matter is that Bitcoin is the only asset out there that has a solid narrative, one that hasn’t changed. Ethereum still doesn’t match Bitcoin because its narrative keeps shifting,” Ardoino concluded.<\/span>","<span data-v-f87c67ca=\"\">After reading the Bitcoin whitepaper in 2012, Ardoino joined crypto exchange Bitfinex in 2014 and was promoted to chief technology officer after just two years. He also holds the same role at Tether, the company behind the stablecoin USDT.<\/span>","<span data-v-f87c67ca=\"\">Bitfinex, like many of the <\/span><a href=\"https:\/\/www.theblock.co\/post\/169931\/heres-how-the-5-biggest-centralized-crypto-exchanges-are-navigating-the-merge\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">biggest crypto exchanges<\/span><\/a><span data-v-f87c67ca=\"\">, plans to support The Merge, though it may temporarily suspend deposits and withdrawals for ETH and ERC-20 tokens. In the event of a fork — a split that produces another blockchain, such as the proposed ETHPoW (ETHW) fork — Bitfinex will decide whether to support the forked tokens and credit users’ balances. Regardless, the ticker for the proof of stake version will remain as ETH.<\/span>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">For the latest news and updates about The Merge, make sure to check out our <\/span><\/i><a href=\"https:\/\/www.theblock.co\/post\/169846\/the-merge-live-coverage-of-ethereums-major-upgrade\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">live coverage<\/span><\/i><\/a><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">.<\/span><\/i>"],"hashtag":["BITCOIN","ETHEREUM","TETHER"]}