{"summary":"The Helium Foundation has announced the Helium Network’s migration to the Solana blockchain following a successful community vote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172107\/helium-foundation-announces-migration-to-solana-following-community-vote","publishDate":"2022-09-22T11:19:33","id":12057,"type":null,"title":"Helium Foundation announces migration to Solana following community vote","category":["GOVERNANCE"],"content":["<span data-v-f87c67ca=\"\">The Helium Foundation has <\/span><a href=\"https:\/\/www.webwire.com\/ViewPressRel.asp?aId=294557\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> the migration of the Helium Network, a decentralized network powering wireless communication protocols, to the Solana blockchain after a successful community vote on the proposal.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The network, which since its inception in 2019 has run its own Layer 1 blockchain, <\/span><a href=\"https:\/\/www.theblock.co\/post\/166705\/helium-developers-propose-a-full-migration-to-the-solana-blockchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">proposed the migration<\/span><\/a><span data-v-f87c67ca=\"\"> in August via a Helium Improvement Proposal, <\/span><a href=\"https:\/\/heliumvote.com\/13Y79HnMVt4Epug2rbLYivMPvrcpC2wYUNbZK5Dga3tw3VBpBjk\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">HIP70<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","<span data-v-f87c67ca=\"\">The move aims to scale Helium to meet the demands of builders and users, supporting a goal to accelerate the decentralized wireless network of Helium 5G and more than 945,000 Internet of Things (IoT) user-managed hotspot devices.<\/span>","<span data-v-f87c67ca=\"\">In a statement, Scott Sigel, COO of the Helium Foundation, said: “We have an ambitious mission of deploying and managing wireless networks at scale and moving to Solana allows us to do that.\"<\/span>","<span data-v-f87c67ca=\"\">Helium’s migration to Solana is scheduled to occur in the fourth quarter of 2022. The Helium Foundation said it would work closely with the Solana Foundation to ensure a seamless transition.<\/span>","<span data-v-f87c67ca=\"\">“Solana and its primary differentiators of scalability, low cost, and energy efficiency are an ideal foundation for Helium to realize its ambitious mission. The Helium community’s vote to migrate to the Solana network is a tremendous endorsement of Solana as the foundation for the next stage of growth for the Helium ecosystem,” said Anatoly Yakovenko, Solana's co-founder.<\/span>","<span data-v-f87c67ca=\"\">The community-approved announcement from Helium’s governing body was made possible after the HIP70 proposal gained <\/span><a href=\"https:\/\/heliumvote.com\/13Y79HnMVt4Epug2rbLYivMPvrcpC2wYUNbZK5Dga3tw3VBpBjk\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">81.41% support<\/span><\/a><span data-v-f87c67ca=\"\"> from 7,447 votes as the vote came to a close early Thursday. A two-thirds majority was required for the vote to pass, with community members staking HNT tokens to participate in on-chain voting.<\/span>","<span data-v-f87c67ca=\"\">Helium’s shift to Solana does not impact HNT, MOBILE and IOT, which will continue to be Helium ecosystem tokens, now issued on Solana. Helium Network applications and governance will also transfer. Once the migration completes, a new version of the Helium Wallet app will be released. Users will also be able to use other wallets in the Solana ecosystem, such as Phantom or Solflare.<\/span>","<span data-v-f87c67ca=\"\">The news comes after Helium development company Nova Labs <\/span><a href=\"https:\/\/www.theblock.co\/post\/171411\/nova-labs-will-use-t-mobile-to-fill-coverage-dead-zones\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">inked<\/span><\/a><span data-v-f87c67ca=\"\"> a five-year deal with T-Mobile’s 5G services to help fill the gaps in Helium’s coverage.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Helium Improvement Proposal","content":"ORGANIZATION"},{"type":"IOT","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Scott Sigel","content":"PERSON"},{"type":"81.41%","content":"PERCENT"},{"type":"the fourth quarter of 2022","content":"DATE"},{"type":"Helium Network","content":"ORGANIZATION"},{"type":"Helium Foundation","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["SOLANA"],"authors":["James Hunt","The Block"]}