{"summary":"Decentralized exchange (DEX) aggregator 1inch has raised $12 million in Series A funding.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86401\/dex-aggregator-1inch-raises-12-million-saft-sale","publishDate":"2020-12-02T09:00:19","id":1205,"type":null,"title":"DEX aggregator 1inch raises $12 million in SAFT sale","category":["THE BLOCK"],"content":["Decentralized exchange (DEX) aggregator 1inch has raised $12 million in Series A funding.","The round was facilitated through a simple agreement for future tokens (SAFT) sale, 1inch co-founder and CEO Sergej Kunz told The Block. A SAFT is an investment contract that promises the delivery of tokens at a future date.","1inch's SAFT round was led by Pantera Capital, with participation from ParaFi Capital, Blockchain Capital, Nima Capital, and Spartan Group, among others.","The funds will go towards 1inch's team expansion (it now counts 28 people), as well as new product and protocol launches, Kunz told The Block.","\"We are soon going to announce our product roadmap for the next two years. This includes a lightweight, very gas-efficient limit order protocol and an improved liquidity protocol.\"","<a href=\"https:\/\/www.theblockresearch.com\/1inch-v2-and-why-it-matters-83937\" data-v-f87c67ca=\"\">1inch<\/a> is a liquidity <a href=\"https:\/\/www.theblockresearch.com\/dex-aggregator-market-analysis-78593\" data-v-f87c67ca=\"\">aggregator<\/a>, which connects several DEXes onto one platform. It then helps users get the best price for an optimized trade. 1inch recently also launched its own automated market maker (AMM) protocol, Mooniswap. AMM is a type of DEX protocol that relies on algorithms to price assets, unlike on order books on centralized exchanges.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">When 1inch token?&nbsp;<\/span><\/strong>","For the 1inch token launch, which was first announced in August, Kunz said some \"bottlenecks\" are yet to be cleared. \"Code is already written, and the 1inch Foundation is also in place, which would issue the token. But we have to stay clean from the regulatory side. We also need to get the code audited by several parties. Right now, seven companies are auditing our contracts. We await their results.\"","On the regulatory side, particularly, Kunz said the token would be registered with a regulator, without disclosing specific details. \"The independent board of the 1inch Foundation, a Cayman Islands foundation company, intends to support the adoption of 1INCH tokens by the permissionless blockchain-based decentralized 1inch Network,\" he said, adding:","\"The 1INCH tokens are not intended to be securities [...] or an investment. The 1INCH tokens are intended to be used for their consumptive purposes on the 1inch Network, the 1INCH token protocols, and other applications that third parties may develop utilizing the 1INCH tokens and\/or the permissionless blockchain-based decentralized 1inch Network.\"","Kunz went on to say that the token could also be used for staking and participating in governance functions of 1inch protocols by all holders, including investors.","Today's Series A brings 1inch's total funding to date to $14.8 million. In August, the aggregator raised $2.8 million in seed funding, which was also facilitated via a SAFT round, Kunz now told The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"1inch Foundation","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"Nima Capital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$14.8 million","content":"MONEY"},{"type":"SAFT","content":"ORGANIZATION"},{"type":"$2.8 million","content":"MONEY"},{"type":"Mooniswap","content":"ORGANIZATION"},{"type":"Sergej Kunz","content":"PERSON"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"Kunz","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}