{"summary":"Chris and Charlie Brooks run a crypto recovery service, which took them on a wild goose chase after a supposed $44 million of bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134443\/the-wild-adventures-of-a-father-son-duo-that-go-searching-for-stuck-bitcoin","publishDate":"2022-02-20T13:11:53","id":12054,"type":null,"title":"The wild adventures of a father-son duo that go searching for stuck bitcoin","category":["BITCOIN"],"content":["It’s not every day you go on a treasure hunt for $44 million. For father and son duo Chris and Charlie Brooks, it was just part of the job.","Chris, 50, and Charlie, 20, run a <a href=\"https:\/\/cryptoassetrecovery.com\/\" data-v-f87c67ca=\"\">bitcoin recovery service<\/a>. And since bitcoin’s big gains last year business has been booming. In the past 13 months, they have recouped seven figures worth of bitcoin for their clients. They’ve also had their fair share of bizarre, only-in-crypto type experiences.&nbsp;","The duo recently sat down with The Block to recount how the business started and how it works — and tell some of their craziest stories.&nbsp;","For Chris and Charlie, business really took off in September, after they were <a href=\"https:\/\/markets.businessinsider.com\/news\/currencies\/locked-crypto-wallet-password-recovery-cryptocurrency-chris-charlie-brooks-btc-2021-9\" data-v-f87c67ca=\"\">featured<\/a> in Business Insider. The article inspired a flurry of inbound requests.","One of those requests came from three burly men from Georgia. The men, who got in touch the day after the article, sent only a screenshot of a wallet with a balance of $44 million, a number, and a message: “Call me now.”","Chris and Charlie hopped on a Zoom call with the prospective clients, who told them that they had won 5,000 bitcoin in a court case in around 2012 or 2013.","“They said they had won 5,000 bitcoin and said they were able to withdraw $300,000 a week but they wanted to pull it all out and they wanted us to come down and figure out how to withdraw all of this bitcoin in one lump sum,” says Charlie.&nbsp; “And they said they would make us millionaires.”&nbsp;","The next morning, the two sleuths got on a plane to Georgia. They went for lunch and witnessed the three men bring out a few tablets, showing their accounts. Yet the duo were surprised to see the accounts showed $3.2 billion in ether (ETH) — a figure that didn’t match the court case explanation. This was the first major red flag.","<span data-v-f87c67ca=\"\">Charlie (left) and Chris (right) Brooks as they hop on a plane to Georgia.<\/span>","“We hopped back in their truck. Drove another hour deeper into Georgia,” says Chris. “We pull up at this strip mall because one of them owns a strip mall. They just start handing us notebooks with seed phrases on them.”","Charlie adds that there were around 20 to 30 notebooks and that the guys just kept watching over what they were doing. The duo spent around 10 hours pouring through them, looking at every private key and seed phrase on them. After spending the day there, they managed to unlock just $10 of bitcoin.&nbsp;","It was a total disaster.","Charlie explains that the men had portfolio trackers set to these wallets containing large amounts of cryptocurrency and that they were convinced they had the private keys to them. He estimates that they had been sold these addresses on the premise that they controlled the funds. In other words, they had been scammed.","As for the $300,000 a week they were supposedly able to withdraw, that was a bald-faced lie, according to Charlie.","“It was a few plane tickets down the drain and a day wasted,” says Charlie. “They were really sweet guys though.”","Chris follows on, “We were never worried about being kidnapped, it was just such a bizarre experience.”","Chris first heard about bitcoin in 2014 when his business coach recommended that he take a look at it. It was worth $600 at the time. He says he “quickly realized it was ridiculous” and went on to ignore it for three years.","Three years later, during bitcoin’s epic 2017 rally to $20,000, Chris came back around and bought his first bitcoin. Then, while on holiday, he read a book about bitcoin and it changed his mind about it.","He started looking for a way to build a business around it. A programming engineer with 20 years of experience, he considered mining or automated trading strategies. Then he started coming across stories of people losing passwords to their bitcoin wallets and thought he would take a shot at starting a recovery service.","Known as Crypto Asset Recovery, the business ran for little over half a year before he shut up shop. By then, bitcoin’s price had crashed and he wasn’t making any money.&nbsp;","<span data-v-f87c67ca=\"\">Charlie (left) and Chris (right) Brooks in their home office.<\/span>","Fast forward to December 2020, and the price of bitcoin is back above $20,000 and breaking new highs. His son Charlie, who had been a computer science student, had just taken six months off to go traveling. When he got home they started hashing out business ideas — they had an idea of building one together —&nbsp;and they thought back to the bitcoin business.&nbsp;","“We decided we were going to give it a try and rehash the business,” Charlie says. So far, business has been going strong, though it remains sensitive to the broader crypto markets.","Prospective clients typically reach out to the duo and say they’ve got a wallet but have lost the password to get into it (as opposed to losing the private key for the wallet —&nbsp;a very different problem).&nbsp;","In order for the duo to help, they have to get access to the wallet and collect as much information as possible about the client’s normal passwords, such as for their email address. Sometimes they need the client to hand over an encrypted copy of their private key.&nbsp;","Typically the father and son will first jump on a video call with the client to get to know the problem. This is the moment where both sides are working out if they can trust each other. The client is looking to see if they feel safe handing over their passwords, while Chris and Charlie are looking to check if the client is being genuine about their story.","“At the same time we need to figure out if the story they’re telling us is real,” says Chris. In crypto, that can be especially difficult.&nbsp;","“We look at people who come to us with 1,000 bitcoin in a bitcoin core wallet for example. These wallets are just purchased on the internet as lost wallets,” Chris says. These are files that contain private keys to bitcoin addresses where the owner forgot the password and they’re hard to access. They can be bought on websites like <a href=\"https:\/\/allprivatekeys.com\/wallet.dat\" data-v-f87c67ca=\"\">AllPrivateKeys<\/a>. He adds that even if the two were able to open one of these wallets, they wouldn’t know if the client necessarily owned the bitcoin inside.","Another struggle is that it’s often hard for the duo to know how much money is in the wallets before they open them. In some cases, they know the public address, so it’s trivial to look the wallet up and find out how much is inside, but they often don’t have this information.","And while it can be tempting to chase after wallets that clients say contain a lot of crypto, as they found in Georgia, sometimes the treasury chest at the end of the rainbow is all but empty.","In fact, according to Charlie, the whole business is very hit and miss, with 40-50% of wallets that they get inside turning out to be empty.","He says the two of them had been working on one wallet for a month or two. The client said it had 12 bitcoin inside it, worth $500,000 at current prices. When they finally got inside it, they realized that wasn’t nearly the case.&nbsp;","“We tried to act as professional as we are, but when we crack a big wallet we jump up and down and are super stoked about the payday we’re getting. We were super excited about this 12 bitcoin crack,” says Charlie. “It turned out he had $2.38 in the wallet.”","Carlie says it’s common for people to lose track of their wallets and get confused over how many wallets they have and which providers they actually set wallets up with. This is often because of the time gap between when they set them up and when they suddenly remember or find them and want access.","On the other hand, there are some good experiences. One client bought 2.35 bitcoin for $399 at a CVS drug store in 2011 and forgot all about it. Apparently it was purchased through Blockchain.com (Blockchain.info at the time) via payment processor BitPay.","Charlie says the former co-founder of Blockchain.com, Nic Cary, had set up a range of backchannels for people to buy bitcoin in its early days. Yet the current team was unaware that this used to be possible. But they were still able to work with the company to get access to the wallet.","“After a month or so we got inside her wallet and her $399 investment had accumulated up to $150,000 at that point. She had just retired and was able to pay a big chunk of her daughter’s college bill,” says Charlie.","<em data-v-f87c67ca=\"\">Following the publication of this story, Chris got in touch to say that it was not $84 million but $44 million of supposed bitcoin and that the three guys could withdraw $300,000 not $3,000 a week. We have updated the story to reflect this.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"$3,000","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"2011","content":"DATE"},{"type":"$150,000","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Chris (","content":"PERSON"},{"type":"$10","content":"MONEY"},{"type":"$600","content":"MONEY"},{"type":"$20,000","content":"MONEY"},{"type":"$44 million","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$84 million","content":"MONEY"},{"type":"$2.38","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Three years later","content":"DATE"},{"type":"Charlie Brooks","content":"PERSON"},{"type":"Crypto Asset Recovery","content":"ORGANIZATION"},{"type":"$3.2 billion","content":"MONEY"},{"type":"$399","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Georgia","content":"LOCATION"},{"type":"$500,000","content":"MONEY"},{"type":"December 2020","content":"DATE"},{"type":"Brooks","content":"PERSON"},{"type":"Carlie","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"CVS","content":"ORGANIZATION"},{"type":"Nic Cary","content":"PERSON"},{"type":"Chris","content":"PERSON"},{"type":"Charlie","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Tim Copeland","The Block"]}