{"summary":"The coming Bitcoin halving could be a boon for Microstrategy stock, according to Berenberg Capital Markets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238784\/bitcoin-halving-underpins-bull-case-for-microstrategy-berenberg-says","publishDate":"2023-07-10T17:11:29","id":12058,"type":null,"title":"Bitcoin halving underpins bull case for Microstrategy, Berenberg says","category":["COMPANIES"],"content":["Berenberg Capital Market's bull case for Michael Saylor's <a href=\"https:\/\/www.theblock.co\/post\/236904\/microstrategy-bitcoin-12333-btc-for-347-million\" data-v-f87c67ca=\"\">Microstrategy<\/a> is underpinned by the upcoming Bitcoin halving, the firm said in a research note shared with The Block Monday.&nbsp;","The equity research shop, which has a bullish price target of $430 for the Virginia-based software firm, said in the note that the firm derives most of its value from the more than 150,000 bitcoin it holds on its balance sheet, adding that it expects the historical trend of bitcoin rallying post-halving to play out again.&nbsp;","Halving events reduce the rate of new coin issuance by 50%, effectively decelerating the pace at which new tokens enter the market. The fourth Bitcoin halving is expected to occur on April 26, 2024.","\"If the historical pattern established by the first three bitcoin halvings continues to play out with the fourth halving, then the pre-halving rally would begin about four months from now,\" the firm wrote. \"If a rally were to occur after the fourth halving, and if it were as long-lived as the rallies that occurred after the past couple of halvings, then it would continue until around October 2025.\"","\"If the fourth bitcoin halving features the kind of strong rally in the price of bitcoin that occurred prior to and following the first three halvings, then we believe it is likely that MSTR’s stock would rally along with it; the correlation between the company’s share price and the price of bitcoin is ~0.90,\" the firm added.","Microstrategy is up more than 181% since the beginning of the year, according to <a href=\"https:\/\/www.tradingview.com\/symbols\/NASDAQ-MSTR\/\" data-v-f87c67ca=\"\">TradingView<\/a>. It increased 7% on Monday to close the day at $407.71.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Virginia","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 26, 2024","content":"DATE"},{"type":"October 2025","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$407.71","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"181%","content":"PERCENT"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"$430","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Berenberg Capital Market","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["MICROSTRATEGY"],"authors":["Frank Chaparro","The Block"]}