{"summary":"Genesis said in a client letter Wednesday that work on a plan to address issues in its lending unit will take weeks rather than days to complete. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192946\/genesis-says-plan-to-resolve-lending-units-woes-could-take-weeks","publishDate":"2022-12-07T12:09:22","id":12052,"type":null,"title":"Genesis says plan to resolve lending unit&#x27;s woes could take &#x27;weeks&#x27;","category":["COMPANIES"],"content":["Genesis said in a client letter Wednesday that work on a plan to address issues in its lending unit will take weeks rather than days.&nbsp;","The crypto lender wrote that it was working \"in consultation with highly experienced advisors and in close collaboration with our owner, DCG\" as well as holding discussions with client representation groups, according to a copy of the letter obtained by The Block.","CoinDesk first reported on the letter Wednesday.","Genesis had to halt withdrawals and new loan originations last month amid the fallout from the collapse of the FTX crypto exchange. The company <a href=\"https:\/\/www.theblock.co\/post\/188891\/genesis-warns-of-possible-bankruptcy-without-funding-bloomberg\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">warned<\/a>&nbsp;about a potential bankruptcy last month in the event it is unable to secure emergency funding.&nbsp;","\"As you know, these are extraordinary times in our industry, and, while we are working urgently, this is a comprehensive process that we expect will take some time,\" Genesis wrote. \"At this point, we anticipate that it will take additional weeks rather than days for us to arrive at a path forward.\"","<em data-v-f87c67ca=\"\">Frank Chaparro contributed reporting.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Chaparro","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}