{"summary":"The SEC appears to be hashing out technical details for a spot bitcoin ETF, which could signal that the agency is close to making a decision.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267062\/blackrock-and-fidelity-hash-out-details-over-spot-bitcoin-etf-redemption-models-with-the-sec-as-anticipation-mounts","publishDate":"2023-12-11T15:57:48","id":12050,"type":null,"title":"BlackRock and Fidelity hash out details over spot bitcoin ETF redemption models with the SEC as anticipation mounts","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission and big name investment firms including BlackRock and Fidelity have been hashing out <a href=\"https:\/\/www.theblock.co\/post\/266854\/fidelity-held-meeting-with-sec-about-spot-bitcoin-fund-submitted-presentation-about-etf-workflows\" data-v-f87c67ca=\"\">technical details<\/a> for a possible spot bitcoin ETF, which could signal that the agency is close to making a decision on whether to approve such a product.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Memos show that firms have met with the agency over the past few weeks to go over details about how the redemption process would work for a spot bitcoin ETF.&nbsp;<\/span><span class=\"s2\" data-v-f87c67ca=\"\">The SEC seems to be in an inspection period and hammering out the details for a possible approval, said Vivian Fang, a finance professor at Indiana University.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BlackRock employees met with the agency on Nov. 28 to discuss its iShares <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.087%\n    <\/span><\/a> <!----><\/span><\/span> Trust and presented a <\/span><a href=\"https:\/\/www.sec.gov\/comments\/sr-nasdaq-2023-016\/srnasdaq2023016-303319-781202.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">plan<\/span><\/a> for a so-called \"Revised In-Kind\" model that could give the asset manager more flexibility should investors want to redeem their shares for the underlying asset, Fang said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In an interview, Fang broke down the potential structures of a spot bitcoin ETF, comparing them to a basket of eggs. At issue are three separate models for determining which entity would have to liquidate bitcoin in the event of a redemption. No matter the model, investors would still get cash back when redeeming their shares, Fang said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Asset managers are very familiar with what is called an \"in-kind\" redemption model, Fang said, since it's one stock-based ETFs mostly use. In that model, retail investors who want to redeem their shares would get their share of bitcoin in return from BlackRock, which could then be turned into cash via a broker-dealer.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">On the flip side, the SEC likely favors what is called a cash model that would require BlackRock to move the bitcoin out of storage, sell it right away and then give the cash back to the investor.&nbsp;<\/span>","Fidelity has also seemed to nod toward a model that would stick to in-kind redemption, according to a&nbsp;<a href=\"https:\/\/www.sec.gov\/comments\/sr-cboebzx-2023-044\/srcboebzx2023044-308919-795162.pdf\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">memo<\/span><\/a>&nbsp;about its recent meeting with the SEC.&nbsp;","\"They [asset managers] are very familiar with a type of model that does not give them a lot of risk,\" Fang said.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The difference between the models comes down to the risk that BlackRock, or any other issuer, is willing to take on.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">For example, if an asset manager holds 100 eggs, and investors want all those eggs back, they don't want to be the ones to assume that conversion risk, Fang said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"<\/span><span class=\"s2\" data-v-f87c67ca=\"\">You want your one egg back, I'll give you your one egg back, I don't have to immediately care about how much that egg is selling for now, it can be $5, it could be $10, but I'm holding one egg for you and you're getting one egg back when you want it<\/span><span class=\"s1\" data-v-f87c67ca=\"\">,\" Fang said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">During the November meeting, BlackRock's presentation detailed a revised plan that wouldn't require the asset manager to <span class=\"s2\" data-v-f87c67ca=\"\"> immediately liquidate bitcoin holdings upon demand and would<\/span><\/span><span class=\"s2\" data-v-f87c67ca=\"\"> reduce the impact of large collective redemptions on the ETF and allow for greater flexibility in managing the portfolio without incurring capital gains taxes, Fang said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Basically the only difference is that in the cash model you have to sell bitcoin to raise that cash,\" Fang said. \"In the revised in kind model, I'm paying cash, you don't have to worry about when and how I sold bitcoin to get this cash, but I'm paying cash right now. You leave the selling part to my control.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The revised model might be enough to satisfy the SEC, Fang said. There is no difference, from the investor's point of view, between the cash model and the revised in-kind model.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"They never want investors to get to the point where they want to turn their eggs into cash and they can't,\" Fang said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">BlackRock and Fidelity declined to comment. The SEC did not respond to a request for comment.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 28","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Vivian Fang","content":"PERSON"},{"type":"+0.087%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Indiana University","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$5","content":"MONEY"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Fang","content":"PERSON"}],"hashtag":["SEC","SPOT BITCOIN ETF"],"authors":["Sarah Wynn","The Block"]}