{"summary":"Countries need clear and updated legal frameworks for deploying CDBCs, the Bank for International Settlements said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253206\/bis-wants-countries-to-set-up-legal-frameworks-to-support-cbdcs","publishDate":"2023-09-27T08:37:02","id":12055,"type":null,"title":"BIS wants countries to set up legal frameworks to support CBDCs","category":["CENTRAL BANKS"],"content":["The Bank for International Settlements wants countries to set up legal frameworks that support the deployment of central bank digital currencies.","In a speech on Wednesday at the <a href=\"https:\/\/www.bis.org\/about\/bisih\/locations\/ch.htm\" data-v-f87c67ca=\"\">BISIH-FSI<\/a> conference in Switzerland, <a href=\"https:\/\/www.theblock.co\/post\/246734\/bis-warns-emerging-economies-of-financial-stability-risk-from-crypto\" data-v-f87c67ca=\"\">BIS<\/a> General Manager Agustín Carstens warned that outdated legal frameworks in different jurisdictions could hinder the development of CBDCs. \"It is simply unacceptable that unclear or outdated legal frameworks could hinder their deployment,\" Carstens said. \"The work to address these issues needs to begin in earnest. And it needs to proceed at pace.\".","Carstens emphasized that the current monetary system needs to evolve and noted that central banks are actively exploring CBDCs to drive innovation. However, he said central banks cannot achieve the desired transformation alone.","In light of this, Carstens referred to a 2021 IMF <a href=\"https:\/\/www.imf.org\/en\/Publications\/fintech-notes\/Issues\/2023\/09\/08\/How-Should-Central-Banks-Explore-Central-Bank-Digital-Currency-538504\" data-v-f87c67ca=\"\">paper<\/a>, which stated that nearly 80% of central banks either cannot issue a digital currency based on current laws or have unclear legal frameworks. In contrast, a BIS <a href=\"https:\/\/www.bis.org\/publ\/bppdf\/bispap136.htm\" data-v-f87c67ca=\"\">survey<\/a> revealed that 93% of central banks are actively involved in various aspects of CBDC development. This would suggest jurisdictional legal frameworks are trailing behind advancements made by central banks in the CBDC space.&nbsp;","Carstens stated that a CBDC's legitimacy comes from the central bank's legal authority to issue it. \"That authority needs to be firmly grounded in the law,\" he added. Referencing how money is a social construct, he stressed the importance of legal frameworks to underpin the legitimacy of money. \"Without the law, money cannot function,\" the BIS General Manager added.","Carstens called for jurisdictional legal frameworks to be interoperable with other jurisdictions. \"It would be unfortunate if we ended up with a fragmented system and legal framework in which different digital currencies don't interoperate,\" he added.","According to Carstens, any legal framework should have core elements. He added that these must strike a balance between protecting the user and upholding the integrity of the financial system as a whole. He underscored the need to maintain oversight for monitoring suspicious transactions that could potentially involve money laundering.","Additionally, he said any legal framework should ensure <a href=\"https:\/\/www.theblock.co\/post\/239373\/bis-survey-suggests-there-may-be-a-large-increase-in-cbdcs-by-2030\" data-v-f87c67ca=\"\">CBDCs<\/a> offer users a choice. He said choice would come by allowing CBDCs to coexist with cash and commercial bank money. \"A retail CBDC may be expected to be available alongside cash,\" he said. \"It would be one of a menu of options available to users, which should continue to include both cash and commercial bank money.\"","The BIS General Manager said that cash use is declining, and \"users are increasingly demanding new forms of money.\" He added that technological innovations are setting higher expectations. Carstens said new innovations are \"highlighting the shortcomings in the existing system\" and that people now \"want their money to be digital and programmable.\"","Referring to the declining use of cash, he pointed to the cryptocurrencies and <a href=\"https:\/\/www.theblock.co\/post\/253051\/circle-launches-eurc-stablecoin-on-stellar-network\" data-v-f87c67ca=\"\">stablecoins<\/a> fuelling \"a demand for change\" but dismissed any intrinsic value. \"While they have achieved some popularity as speculative investments, these financial instruments are not money,\" Carstens said.","He added that these \"new forms of private money\" do not offer the backing and protection of central banks as a lender of last resort or supervision by regulatory bodies. \"Even stablecoins do not assure a stable value. They do not and cannot meet the standards the public expects of money,\" he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BIS<\/a> General Manager Agustín Carstens","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"earnest","content":"LOCATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"93%","content":"PERCENT"},{"type":"BIS General Manager","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Carstens","content":"PERSON"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"FSI","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","BOE","CBDCS","ECB","FEDERAL RESERVE"],"authors":["Brian McGleenon","The Block"]}