{"summary":"The SEC has asked the court for a temporary restraining order to freeze assets held by crypto exchange Binance, Binance.US, and their owner Changpeng &#x27;CZ&#x27; Zhao.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233369\/sec-files-temporary-restraining-order-against-binance","publishDate":"2023-06-06T16:26:57","id":12063,"type":null,"title":"SEC files motion to freeze cryptocurrency held by Binance, Binance.US, CZ","category":["POLICY"],"content":["The Securities and Exchange Commission followed up on its request in yesterday's enforcement action, seeking an order for the freeze of assets, including cryptocurrencies, held by Binance, Binance.US, their owner Changpeng 'CZ' Zhao.&nbsp;","The SEC already asked for a freeze of assets held by Binance, Binance.US, and owner Changpeng 'CZ' Zhao as part of its initial enforcement action filed on Monday. But the agency followed up with a temporary restraining order filing to further expedite the matter.&nbsp;","The commission asked for the asset freeze due to accusations accusing Zhao and Binance executives of redirecting customer funds to his own investment funds to use as Zhao wished, including purchasing an $11 million yacht and buying BUSD. The <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\">allegations are similar to those made against FTX, Alameda Research, and Sam Bankman-Fried<\/a>, though Zhao and Binance only face civil charges so far.&nbsp;","\"The SEC respectfully submits that this relief is necessary on an expedited basis to ensure the safety of customer assets,\" the SEC argues in its restraining order filing, as well as to prevent Binance and Zhao from hiding assets,&nbsp; \"given the Defendants’ years of violative conduct, disregard of the laws of the United States, evasion of regulatory oversight, and open questions about various financial transfers and the custody and control of Customer Assets—including by Defendants who claim they are not subject to the Court’s jurisdiction,\" the SEC adds.&nbsp;","Notably, the SEC wants the court to allow Binance.US to continue to allow customers to redeem their holdings from the company.&nbsp;","The markets regulator also wants a federal judge to order Binance's holding company, Binance.US's holding company,&nbsp; and Zhao to provide sworn, verified accounting. That would be the first full, likely public accounting of the Binance family of companies.","Binance controversially released a partial accounting of its finances conducted by the firm Mazars Group late last year, following the FTX collapse, but did not disclose its liabilities, a key omission. <a href=\"https:\/\/www.theblock.co\/post\/195623\/mazars-pauses-crypto-audits\" data-v-f87c67ca=\"\">Mazars suspended its work with crypto firms<\/a> following Binance's release of their report, and criticism of it.&nbsp;","The SEC also asked a federal judge in Washington, D.C. to order the repatriation of assets, expedited discovery of documents, and a mandate for the preservation of documents and a prohibition on the destruction of evidence, as well as the appointment of a receiver for Binance, Binance.US, and Zhao's assets.&nbsp;","In a statement posted to Twitter, BinanceUS called today's filing \"unwarranted and based more on the SEC Staff obtaining an advantage in litigation versus genuine concern about the safety of customer assets.\"","\"While we are disappointed by this action, we look forward to defending ourselves in court,\" the company said.","<em data-v-f87c67ca=\"\">UPDATE: This story has been updated to reflect that the SEC asked for a freeze of Binance, Binance.US, and Zhao's assets, and the restraining order follows the original request made in the lawsuit filed Monday.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"$11 million","content":"MONEY"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Zhao","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Mazars Group","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Changpeng","content":"PERSON"}],"hashtag":["BINANCE","COURT HEARINGS","CZ","LAWSUITS"],"authors":["Tim Copeland","Colin Wilhelm","The Block"]}