{"summary":"Hybrid crypto exchange GRVT, combining the benefits of centralized and decentralized exchanges, will launch as zkSync&#x27;s first &quot;hyperchain.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258727\/hybrid-crypto-exchange-grvt-zksync-hyperchain","publishDate":"2023-10-20T10:44:26","id":12065,"type":null,"title":"Hybrid crypto exchange GRVT to debut as zkSync&#x27;s ‘first hyperchain&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">GRVT (pronounced \"gravity\"), a hybrid crypto exchange that combines the benefits of centralized and decentralized exchanges, will debut as the first \"hyperchain\" in the zkSync ecosystem.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">GRVT will provide a Robinhood-like user experience and self-custodial features of Uniswap-like exchanges, Matter Labs, the developer of&nbsp;<\/span>Ethereum Layer 2 zkSync, said Friday. It will be zkSync's first \"<a href=\"https:\/\/www.theblock.co\/post\/236322\/zksync-matter-labs-releases-zk-stack-for-building-hyperchains\" data-v-f87c67ca=\"\">Hyperchain<\/a>,\" a custom blockchain that will run as a Layer 3 Validium in the zkSync ecosystem, Matter Labs said.","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Validiums are Ethereum scaling networks that operate much like Layer 2 network zk-rollups, with the key distinction being that in a zk-rollup, data is maintained on-chain, whereas Validiums store it off-chain. Since Validiums encrypt data before adding it to the blockchain, it helps protect users from front-running and <\/span><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">market manipulation, Matter Labs said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">zkSync has opened the door to new use cases with platforms like GRVT, a Matter Labs spokesperson told The Block. \"There is nothing like GRVT being built, not in the zkSync ecosystem nor outside of it,\" they said. \"By being able to design and deploy custom hyperchains connected through hyperbridges, teams like GRVT's can build entirely new use cases,\" they added.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The hybrid crypto exchange is expected to launch its closed alpha version next month and mainnet in the first quarter of next year. It aims to offer a transaction speed of up to 600,000 trades per second with less than two milliseconds of latency with zkSync's \"horizontally scaling\" infrastructure.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Horizontally scaling means to deploy additional underlying pairs as new hyperchains,\" GRVT co-founder and CEO Hong Yea told The Block. \"Say BTC\/USDT perpetual futures is one hyperchain and so on. And we can look to add other infrastructure components like this as new hyperchains to scale throughout, as they can interoperate. This allows high-frequency traders to trade more efficiently with high transactions per second similar to a central exchange,\" Yea said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">GRVT is backed by Matter Labs, CMS Holdings and other investors. It announced raising&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/251665\/grvt-crypto-exchange-funding\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">$7.1 million in pre-seed and seed funding last month<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;in an equity with a token warrant round at a $39 million post-money valuation. GRVT's token is expected to launch later in 2024.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$7.1 million","content":"MONEY"},{"type":"GRVT","content":"ORGANIZATION"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"first quarter","content":"DATE"},{"type":"Hong Yea","content":"LOCATION"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$39 million","content":"MONEY"}],"hashtag":["DERIVATIVES","SMART CONTRACTS","ZKSYNC"],"authors":["Yogita Khatri","The Block"]}