{"summary":"In the short term, it’s difficult to anticipate whether inflation will take place and how significant any potential fluctuations in a currency’s purchasing power may be.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124402\/how-to-invest-in-an-era-of-rampant-inflation","publishDate":"2021-11-20T09:00:24","id":12061,"type":null,"title":"How to invest in an era of rampant inflation","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">In the short term, it’s difficult to anticipate whether inflation will take place and how significant any potential fluctuations in a currency’s purchasing power may be. However, the moment you zoom out you are faced with a harsh reality – every major national currency has steadily (and in some cases rapidly)<\/span><a href=\"https:\/\/fee.org\/articles\/central-banks-gold-and-the-decline-of-the-dollar\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">declined in value over time<\/span><\/a><span data-v-f87c67ca=\"\">, and there are no exceptions to this unambiguous trend.<\/span>","<span data-v-f87c67ca=\"\">This trend long preceded the rampant money-printing triggered by the COVID-19 pandemic, though the past year has indeed given rise to an unprecedented increase in the global money supply. Nearly 21% of all U.S. dollars in existence were minted in the past year, and while the Federal Reserve’s quantitative easing does not involve the actual printing of new physical dollars, the result still comes down to<\/span><a href=\"https:\/\/katusaresearch.com\/is-2021-the-death-of-fiat-currency\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">flooding the markets with cash<\/span><\/a><span data-v-f87c67ca=\"\"> to keep borrowing cheap. The total money in the U.S. shot up from $4.6 trillion in 2000 to $19.5 trillion in 2021, and it’s no surprise that the USD has lost over a third of its relative purchasing power in the past two decades alone.<\/span>","","","<span data-v-f87c67ca=\"\">What does this mean for investors? For one, it’s worth increasing your investment exposure to hard assets. The USD has lost 98.2% of its purchasing power relative to gold over the past century, and generally assets like real estate and previous metals have maintained their market value significantly better than every national currency. However, out of all your available investment options, cryptocurrencies have the most asymmetric advantages and the strongest track record.<\/span>","<span data-v-f87c67ca=\"\">Cryptocurrencies are relatively new, and there is a big difference in quality and design between different crypto projects. Many of the same criticisms levied against cryptocurrencies apply to fiat currencies like the USD, EURO, and JPY, but the truth is the leading crypto projects are hard-coded to have a predictable, capped supply. This means that, unlike the USD and other national currencies, the supply of Bitcoin, Ethereum, and other major cryptocurrencies cannot be unilaterally expanded or changed by anyone. Nearly 90% of the total supply of Bitcoin has already been created, and there is no way to change this total supply cap now or in the future. And even though most blockchain projects are open source, you cannot secretly duplicate a cryptocurrency network since a cloned project will not have the transaction history as the original project its derived from. In other words: unlike fiat currencies, your cryptocurrencies cannot be diluted through supply inflation.<\/span>","<span data-v-f87c67ca=\"\">Also, portfolio diversification is especially crucial during periods of economic uncertainty. It’s extremely risky to put all your eggs in one basket under current market conditions, whether that basket consists of stocks, commercial real estate, or crypto. The key is to allocate your holdings across multiple uncorrelated assets and rebalance your portfolio over time. The price of Bitcoin is only<\/span><a href=\"https:\/\/www.blockchaincenter.net\/cryptocurrency-correlation-study\/?timeframe=180days&amp;asset1=XAU&amp;asset2=BTC\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">loosely correlated<\/span><\/a><span data-v-f87c67ca=\"\"> to the S&amp;P 500, with a 180-day correlation coefficient of 0.2, and the cryptocurrency’s correlation with gold is -0.08. Many other cryptocurrencies move in tandem with Bitcoin’s movements, and these loose correlations to traditional investments underscore crypto’s potential as an effective portfolio diversifier.<\/span>","<span data-v-f87c67ca=\"\">At the end of the day, we believe there is a responsible way to invest in crypto without taking on too much risk. The best way to do this is through a crypto lending platform like Vauld, which lets you earn<\/span><a href=\"https:\/\/www.vauld.com\/rates\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">12.68% APY<\/span><\/a><span data-v-f87c67ca=\"\"> on your USD-backed stablecoins, which is more than the SPY’s historical returns. And since Vauld does not subject its users to any deposit\/withdrawal fees or mandatory lock-up periods, investors can stay flexible and rebalance their investments whenever they want. Additionally, Vauld offers investors an array of automated investment plans, which allow investors to easily diversify into a particular blockchain sector or emergent market trend. And in order to mitigate against worst-case scenarios, investor funds stored in Vauld’s cold wallets are insured to the tune of $100 million by Lloyd’s London.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As an all-encompassing digital wealth management solution, Vauld lets you trade crypto and access real-time market intelligence, while offering among the highest yields in the industry. The team behind Vauld believe it’s irresponsible for investors to place all their money and trust in a national currency system that has proven to decline in value over time. Similarly, it would also be reckless to invest everything you have in cryptocurrencies or other alternative assets. What Vauld enables is a balanced approach to wealth preservation and growth using the latest technology and most reliable, predictable yields. To take advantage of all these features and more, <\/span><a href=\"https:\/\/www.vauld.com\/auth\/register\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">register with Vauld today<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"90%","content":"PERCENT"},{"type":"past two decades","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$19.5 trillion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2000","content":"DATE"},{"type":"19","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"end of the day","content":"TIME"},{"type":"USD","content":"ORGANIZATION"},{"type":"EURO","content":"ORGANIZATION"},{"type":"$4.6 trillion","content":"MONEY"},{"type":"12.68%","content":"PERCENT"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"98.2%","content":"PERCENT"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}