{"summary":"Bitmain&#x27;s AntMiner S9 is old, but not yet obsolete – thanks to the market surge pushing bitcoin miner&#x27;s revenue per TH\/s to yearly highs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90060\/bitcoin-price-mining-hardware-renaissance","publishDate":"2021-01-06T16:49:01","id":12071,"type":null,"title":"Bitcoin&#x27;s sky-high price has sparked a profitability renaissance for older mining hardware","category":["BITCOIN"],"content":["The supply shortage for the latest generation of bitcoin miners isn't just causing a bidding war -- it's revived the market for older models as well.","According to multiple sale channels on both Telegram and WeChat seen by The Block, the volume and frequency of sale quotes for past-gen mining equipment has risen since mid-December. As of the time of writing, bitcoin's price has reached a new all-time high, crossing the $36,000 mark for the first time ever.","Bitcoin's price jump above $20,000 in mid-December resulted in older hardware, rolled out between 2016 and 2018, significantly surpassing their breakeven points (mostly between $13,000 to $18,000), according to profitability figures tracked by mining pools <a href=\"https:\/\/www.f2pool.com\/miners\" data-v-f87c67ca=\"\">F2Pool<\/a> and <a href=\"https:\/\/www.poolin.com\/miners-rank\" data-v-f87c67ca=\"\">Poolin<\/a>.&nbsp;","In light of the recent price climbs, miner resellers are posting quotes for machines like Bitmain's Antminer S9 or Canaan's equivalent model, the Avalon 851, with a price range between $80 to $130 per unit. By contrast, such models were being liquidated for less than $50 after China's hydro-season ended in October.","Some mining companies have also started looking for facilities to host machines previously thought to be obsolete by the end of 2020, like the S9s, which were launched almost five years ago and dominated the market between 2016 to 2019.","Thanks to the price surge, bitcoin miner's revenue per each terahashes second (TH\/s) of computing power is reaching highs not seen since September 2019, according to The Block's Data Dashboard.","<iframe title=\"Bitcoin Miner Revenue per TH\/s (7DMA)\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-per-th-s-7dma\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","With an average electricity cost of $0.05 per kWh, the breakeven price for the Antminer S9 is around $16,500. A single unit of S9 is able to yield a rough daily profit of $1.50 at a cost of $0.05 per kWh of electricity.","With a daily profit of $1.50 per unit, new buyers of these machines in the secondary market could have a static payback period of around two to three months.","Hashage, a local Chinese mining company, has been posting WeChat feeds looking for facilities with 20 megawatt of capacity to host their Antminer S9s. Based on the S9's standard specification, a 20-megawatt capacity can power up about 14,000 units.&nbsp;","\"This is right now a business that can make guaranteed payback,\" Nicholas Feng, COO of Poolin's cloud mining business, said in a call with The Block. That, of course, depends on whether such businesses have access to suitable hosting spots and well-structured put options to hedge against price declines.","Still, not every mining farm operator would necessarily be willing to host old models. Such a move carries more maintenance overhead and higher risks of shutdowns compared to the newest generation of machines.","“Yeah, we see the same in Russia [of S9's revival], but we strategically decided not to host S9s in our core facilities,\" said Igor Runets, founder and CEO of Russia-based mining farm operator BitRiver. \"Demand [for the] newer generation of machines is also very strong. And we strategically decided to prioritize requests for new-gen machines as they are more sustainable over time.\"","Yet even in light of the price increases, the <a href=\"https:\/\/www.theblockcrypto.com\/post\/88151\/bitcoin-mining-hardware-bidding-war\" data-v-f87c67ca=\"\">ongoing bidding war<\/a> for top-of-the-line equipment is setting an increasingly higher entrance barrier. And that may leave smaller-scale players with few options.","Some mining farms that use past-gen models like Bitmain's S17 or MicroBT's M20 series are also trying to get in on the action, based on offers made by farm operators and brokers on WeChat.","The supply shortage for new-gen models is a factor that contributes to the revival of these older models, ecosystem players say. \"I’ve seen some of my clients looking for S19 and not being able to source them started looking for M20S, etc.,\" said Runets.&nbsp;","\"Such shortage makes manufacturers less keen to cater small players and naturally prioritize bulk orders from larger players,\" Poolin's Feng told The Block.","It appears that smaller players who want to capture gains in the mining space are now turning to cloud mining as one option.&nbsp;","Feng said Poolin launched its cloud mining business less than two months ago and has already sold nearly 100,000 TH\/s of computing power to retail investors.","The hash rate is powered by some 800 units of the latest models hosted and maintained in Poolin's facilities and was sold to retailers by each unit to lower their entrance threshold.","Feng expects the firm will increase its cloud mining hash rate in the coming months, given that Poolin has placed bulk preorders for Bitmain's S19 or equivalent models worth over $15 million.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"Poolin","content":"PERSON"},{"type":"$50","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1.50","content":"MONEY"},{"type":"$20,000","content":"MONEY"},{"type":"Bitmain","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"September 2019","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"$16,500","content":"MONEY"},{"type":"Poolin","content":"LOCATION"},{"type":"$80","content":"MONEY"},{"type":"Bitmain","content":"ORGANIZATION"},{"type":"mid-December","content":"DATE"},{"type":"Nicholas Feng","content":"PERSON"},{"type":"S9","content":"ORGANIZATION"},{"type":"Poolin","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"less than two months ago","content":"DATE"},{"type":"Igor Runets","content":"PERSON"},{"type":"$13,000","content":"MONEY"},{"type":"$36,000","content":"MONEY"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"$18,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"$0.05","content":"MONEY"},{"type":"Antminer S9","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"$130","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}