{"summary":"The Series A round brings Tres&#x27;s total funding to $18.6 million, with support from Faction, New Form, Cyber Fund and others.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268153\/web3-tax-services-firm-tres-raises-11-million-in-series-a-financing","publishDate":"2023-12-20T08:59:42","id":12076,"type":null,"title":"Web3 tax services firm Tres Finance raises $11 million in Series A financing","category":["VENTURE CAPITAL"],"content":["Tres Finance, a crypto taxation startup, raised $11 million in a Series A funding round.&nbsp;","Faction Ventures led the financing round that saw additional participation from New Form, Boldstart Ventures, Cyber Fund and Ambush Capital. The raise brings Tres's total funding to $18.6 million.","Tres offers accounting, auditing, reporting and other financial services for web3 firms. The startup intends to use the funding to advance its growth, with the goal of expanding its customer base in the&nbsp;US, EU and APAC and scaling its customer base by 300% within the year.&nbsp;","\"This next bull cycle will have something that no other bull cycle before it had — dozens of live blockchain networks, thousands of decentralized applications, battle tested infrastructure, and the adoption by major banks and government organizations around the world. The number of companies that will hold crypto on its balance sheets is about to explode, and we are here to serve them — no matter how complex the transactions are,\" Tres co-founder and CEO Tal Zackon told The Block.","\"Now, rather than using spreadsheets to track positions across DeFi activity, Tres's Financial Data Lake enables much more sophisticated risk modeling and analysis for crypto exchanges, DAO treasuries and funds.\"","Tres supports over 100 Layer 1 and Layer 2 blockchains including Bitcoin, Ethereum, Solana, Avalanche, and it aims to add more supported blockchains in the future.","The firm raised <a href=\"https:\/\/www.theblock.co\/post\/171172\/web3-accounting-software-tres-raises-7-6-million-in-seed-funding\" data-v-f87c67ca=\"\">$7.6 million<\/a> in seed funding in September 2022 led by Boldstart Ventures and Alchemy Ventures, The Block previously reported. Additional participants at the time included F2, New Form, Kenetic Capital, Blockdaemon Ventures and Mantis.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">(Corrects to distinguish Faction Ventures as its own entity.)<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockdaemon Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$11 million","content":"MONEY"},{"type":"Tres","content":"ORGANIZATION"},{"type":"Tres Finance","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"$7.6 million","content":"MONEY"},{"type":"APAC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"300%","content":"PERCENT"},{"type":"Boldstart Ventures","content":"ORGANIZATION"},{"type":"Kenetic Capital","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$18.6 million","content":"MONEY"},{"type":"September 2022","content":"DATE"},{"type":"Tal Zackon","content":"PERSON"},{"type":"Alchemy Ventures","content":"ORGANIZATION"},{"type":"Tres's Financial Data Lake","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Faction Ventures","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SERIES A"],"authors":["MK Manoylov","The Block"]}