{"summary":"A timeline of FTX&#x27;s demise showing how the situation at Alameda Research developed and ended up ripping the exchange apart.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256106\/a-complete-timeline-of-ftx-from-alamedas-spiraling-debt-to-its-dramatic-implosion","publishDate":"2023-10-12T14:00:29","id":12081,"type":null,"title":"A complete timeline of FTX: From Alameda&#x27;s spiraling debt to its dramatic implosion","category":["CRYPTO ECOSYSTEMS"],"content":["It's difficult to pinpoint exactly where things took a turn for the worst for FTX. Was it the millions worth of lost XRP tokens? Nishad Singh coding \"Allow Negative\" at the behest of Sam Bankman-Fried? FTX's befuddled bank accounts for customer deposits? The infamously leaked balance sheets?&nbsp;","We all know the <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">end of the story<\/a>. Now, testimonies from former FTX and Alameda Research employees shed new light on FTX's spiral toward destruction.&nbsp;","The Block poured through hundreds of pages of court transcripts to cobble together a complete timeline. Here's what we know so far:","<i data-v-f87c67ca=\"\">The above moments are based on a combination of sources, including testimony from former FTX executives in the <\/i><a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">SBF's trial<\/i><\/a><i data-v-f87c67ca=\"\">.<\/i>","<em data-v-f87c67ca=\"\">Update: Fixed the amount of debt Yedida told SBF about.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","SBF TRIAL"],"authors":["MK Manoylov","The Block"]}