{"summary":"Ethereum Layer 2 Kinto has migrated to the Arbitrum ecosystem after previously launching its testnet using Optimism’s OP Stack.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263948\/ethereum-layer-2-kinto-migrates-to-arbitrum-ecosystem","publishDate":"2023-11-21T08:03:12","id":12086,"type":null,"title":"Ethereum Layer 2 Kinto migrates to the Arbitrum ecosystem","category":["LAYER 2S AND SCALING"],"content":["Ethereum Layer 2 Kinto has migrated to the Arbitrum ecosystem via the Arbitrum Nitro technology stack after previously launching its testnet using Optimism’s OP Stack in May.","The migration follows a change in the structure of the Arbitrum Orbit ecosystem of chains that granted the Arbitrum Foundation greater autonomy in negotiating Layer 2 deployments, according to a statement.","Kinto claims it can bridge the gap between traditional finance and decentralized finance by building a KYC-compliant Layer 2 to support both modern financial institutions and decentralized protocols. It also aims to reduce the risk of DeFi exploits, providing built-in insurance for all smart contracts.&nbsp;","The decision to migrate to Arbitrum was driven by a need to provide similar levels of security, reliability and regulatory compliance typical in traditional financial systems while reducing the costs and friction associated with traditional asset issuance.","“Arbitrum’s ability to provide a credibly neutral, efficient and mature platform, with a strong understanding of decentralized finance, made it a perfect fit for the foundation of Kinto,” the team said.","“Arbitrum is the indisputable leader in the rollup space regarding adoption, TVL and technology maturity,” Kinto founder Ramon Recuero added. “Arbitrum is a community driven ecosystem with thousands of projects being built by crypto-natives and we are excited to add Kinto into that discussion. We seek to extend a bridge for TradFi into DeFi without alienating the principles and ethos of crypto and Arbitrum is the best place to do so.”","Earlier this month, Kinto <a href=\"https:\/\/www.prnewswire.com\/news-releases\/kinto-raises-5-million-to-launch-first-kycd-layer-2-blockchain-for-financial-institutions-and-decentralized-protocols-301988179.html\" data-v-f87c67ca=\"\">announced<\/a> it had raised $5 million over two funding rounds from investors, including Kyber Capital Crypto, Spartan Group and Parafi. Kinto’s mainnet launch is scheduled for Q1, 2024.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kinto","content":"ORGANIZATION"},{"type":"Spartan Group","content":"ORGANIZATION"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Parafi","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Kyber Capital Crypto","content":"ORGANIZATION"},{"type":"Kinto","content":"LOCATION"},{"type":"Kinto","content":"PERSON"},{"type":"Ramon Recuero","content":"PERSON"},{"type":"$5 million","content":"MONEY"}],"hashtag":["ARBITRUM","OPTIMISM"],"authors":["James Hunt","The Block"]}