{"summary":"The move will lower fees and increase transaction speed by removing the need for Ethereum as an intermediary.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246878\/crypto-exchange-bitso-adds-tron-support-for-tether-transactions","publishDate":"2023-08-22T16:20:19","id":12089,"type":null,"title":"Crypto exchange Bitso adds Tron support for Tether transactions","category":["COMPANIES"],"content":["The Latin America-focused crypto exchange Bitso has added support for the Tron network and USDT transactions.","The move means customers won't have to use Ethereum as an intermediary for Tether transactions, which increases transaction speed and lowers costs.&nbsp;","\"By selecting the Tron network, individual and institutional clients of Bitso will be able to make deposits and withdrawals more efficiently, which will offer an additional solution to move business or personal funds, as well as the possibility of protecting their assets from inflationary changes or unstable economic contexts,\" Bitso said in a statement.&nbsp;","Tether is the most popular stablecoin by supply, according to data compiled by The Block. It currently holds 69.2% of the total stablecoin supply worth $84.1 billion.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"The Tron network is known for its speed and efficiency and thanks to this integration, USDT transactions will be confirmed in seconds, allowing our clients to take full advantage of market opportunities with significantly lower transaction fees,\" Bitso's Andrés Salcedo said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$84.1 billion","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"69.2%","content":"PERCENT"},{"type":"Andrés Salcedo","content":"PERSON"},{"type":"Bitso","content":"PERSON"}],"hashtag":["TETHER"],"authors":["MK Manoylov","The Block"]}