{"summary":"Binance wants more Brazilian customers and has signed with the nation&#x27;s football federation to help get them.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226460\/binance-brazilian-football-nft","publishDate":"2023-04-14T10:11:41","id":12088,"type":null,"title":"Binance and Brazil&#x27;s football federation partner on NFT to attract customers","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">A day ahead of Brazil’s pro football season kicking off, Binance and the Brazilian Football Federation are launching a non-fungible token aimed at not only boosting fan engagement but also attracting more consumers.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The free NFT from the world’s biggest cryptocurrency exchange <\/span><span data-v-f87c67ca=\"\">will give fans “access to technology that will enhance the match experience and grant unique perks,” Binance and Brazil’s federation said in a statement. It appears Binance is also keen to use the initiative to attract new clients as existing customers are able to “redeem their NFTs by referring friends to open an account on the exchange.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">While the U.S. <\/span><span data-v-f87c67ca=\"\">is embroiled in policy and regulation debates that could restrict the proliferation of crypto-related businesses and wider consumer growth, Brazil has <\/span><a href=\"https:\/\/www.theblock.co\/post\/222412\/coinbase-regulation-brazil-us\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">appeared<\/span><\/a><span data-v-f87c67ca=\"\"> to be a friendlier market to exchanges like Binance and Coinbase.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Last year Brazil's president <\/span><a href=\"https:\/\/www.theblock.co\/post\/197036\/brazils-cryptocurrency-regulation-set-to-become-law-at-midnight\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">signed<\/span><\/a><span data-v-f87c67ca=\"\"> legislation establishing regulatory framework for the trading and use of bitcoin.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">\"We believe crypto and blockchain are the future of money and the internet, bringing indisputable benefits to people, especially in developing countries,\" Binance's country manager Guilherme Nazar said in a statement. \"We are sure that this historical launch will allow more Brazilians to feel closer to their clubs and learn about crypto, so that they can take advantage of what this technology has to offer.\"<\/span>","Fans who nab one of the NFTs will join a \"Fanverse\" and be able to take part in \"gamified\" experiences and win prizes and tickets, the statement also said. Finally, joining the crypto-football fan community will offer lower trading fees when using Binance.","<span data-v-f87c67ca=\"\">Internationally Brazil’s national football team has historically been one of the most successful among all nations, winning the FIFA World Cup five times, while the local professional league possesses one of the largest and most-engaged fan bases in the world.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Guilherme Nazar","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"FIFA","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Brazilian Football Federation","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["RT Watson","The Block"]}