{"summary":"USDT slightly de-pegged from its usual 1:1 ratio with the US dollar on the Curve decentralized exchange, presenting an arbitrage opportunity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234836\/usdt-depeg-arbitrage-defi-traders","publishDate":"2023-06-15T04:01:19","id":12098,"type":null,"title":"USDT price discrepancy presents arbitrage opportunities for DeFi traders","category":["STABLECOINS"],"content":["In an unexpected turn of events, Tether’s USDT — the leading stablecoin with a staggering market capitalization of $83 billion — slightly moved from peg with US dollar on the Curve decentralized exchange, presenting an arbitrage opportunity for savvy DeFi traders.","Liquidity pools on Curve and Uniswap have been overrun with USDT sellers, causing USDT to trade momentarily below $1 instead of its standard parity. Even more noteworthy is Curve Curve's 3Pool, the top liquidity pool for USDT trading, becoming heavily <a href=\"https:\/\/www.theblock.co\/post\/234822\/tether-depeg-curve-3pool\" data-v-f87c67ca=\"\">imbalanced<\/a>. In the pool, USDT's balance&nbsp;<a href=\"https:\/\/curve.fi\/#\/ethereum\/pools\/3pool\/deposit\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">increased<\/a> to over 70% — suggesting that traders are selling it for the two other stablecoins: DAI and USDC.","Market participants reacted quickly to the de-peg, causing a significant increase in USDT borrowing from Aave, the top decentralized lending and borrowing protocol. Borrowers sold the devalued USDT for DAI or USDC — both of which held their standard 1:1 peg with the US dollar — on Curve’s 3pool.","One notable case was an Ethereum address known as <a href=\"https:\/\/debank.com\/profile\/0x9026a229b535ecf0162dfe48fdeb3c75f7b2a7ae\/history?chain=eth\" data-v-f87c67ca=\"\">czsamsun.eth<\/a>, who, using 17,400 ETH ($28 million) and 14,690 stETH ($24 million) as collateral, borrowed $31.5 million USDT from Aave 2 and exchanged it for 31.47 million USDC at a rate of $0.997 on Curve.","The sudden de-pegging of USDT from the USD created a unique opportunity for these traders to profit from arbitrage — capitalizing on price differences between markets. In this case, the discrepancy between USDT’s lowered trading price and its typical dollar parity.","An address <a href=\"https:\/\/etherscan.io\/address\/0xd275e5cb559d6dc236a5f8002a5f0b4c8e610701\" data-v-f87c67ca=\"\">0xd2<\/a>, capitalized on the USDT de-peg in a big way. This address <a href=\"https:\/\/debank.com\/profile\/0xd275e5cb559d6dc236a5f8002a5f0b4c8e610701\/history\" data-v-f87c67ca=\"\">deposited<\/a> 52,200 stETH ($85 million) through Aave V2 and borrowed $50 million USDC, swapping large sums of USDT at a discounted rate in batches. Here, the trader took advantage of the lower price of USDT to buy large quantities using borrowed USDC, which was still holding its 1:1 peg with the US dollar. In theory, if USDT returns to its 1:1 peg, the traders can sell their USDT at a profit, repay their borrowed USDC and pocket the difference.","In response to this sudden demand for USDT loans, Aave’s algorithmic model automatically adjusted its rates to maintain market equilibrium. The result was a significant rate hike, with the deposit rate soaring to over 15% and the borrowing rate increasing by over 25%.","<em data-v-f87c67ca=\"\">The headline has been updated for clarification.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"$31.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$85 million","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"$28 million","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"15%","content":"PERCENT"},{"type":"$83 billion","content":"MONEY"},{"type":"$24 million","content":"MONEY"},{"type":"$0.997","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["TETHER"],"authors":["Vishal Chawla","The Block"]}