{"summary":"The Federal Reserve is seeking comments on how to appraise financial institutions with new types of charters that seek access to accounts in the central banking system.\nThe news appears positive for crypto — but how good? \nThe developments come as the Office of the Comptroller of the Currency, the top U.S. bank regulator, comes under new management.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/104333\/fed-draft-standards-novel-institutions-crypto-banks","publishDate":"2021-05-14T13:39:55","id":1209,"type":null,"title":"What do the Fed&#x27;s draft standards for vetting &#x27;novel institutions&#x27; mean for crypto banks?","category":["Central Banks"],"content":["Earlier this month, the U.S. Federal Reserve put out a set of proposed <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/bcreg20210505a.htm\" data-v-f87c67ca=\"\">new standards<\/a> for appraising \"novel institutions\" that want access to the Fed's payments and accounts services.","For now, the guidance is just a proposal and has not yet taken effect. It will be available for public comment for 60 days, at which point it will undergo a process of revision that could stretch on for months or longer. The act of making the draft standards public does, however, signal real interest in expanding services for non-traditional players — especially those using emerging technologies — to offer financial services.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Benefits of the Fed<\/span><\/strong>","As the central bank of the U.S., the Fed is the hub through which financial institutions in the country transact with each other. For example, they need accounts with the Fed to use the Automated Clearing House (ACH).&nbsp;","Some non-banks partner with federally chartered banks to access Fed services, but that adds another layer of delays and fees.&nbsp;This has been the dilemma that historically faces crypto firms. From an advocate's perspective, it hamstrings the technology's underlying efficiency through the involvement of third parties.","This state of affairs is a core reason why the Office of the Comptroller of the Currency's push to expand its fintech charter and provide definition as a bank to firms like <a href=\"https:\/\/www.theblockcrypto.com\/linked\/91071\/crypto-custodian-anchorage-nabs-national-bank-charter-from-occ\" data-v-f87c67ca=\"\">Anchorage,<\/a> <a href=\"https:\/\/www.theblockcrypto.com\/linked\/93928\/occ-grants-conditional-charter-blockchain-bank\" data-v-f87c67ca=\"\">Protego<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/91071\/crypto-custodian-anchorage-nabs-national-bank-charter-from-occ\" data-v-f87c67ca=\"\">Paxos<\/a> has prompted such excitement among the industry's backers and stakeholders.","The guidance itself is certainly heavy on technological advances in general terms. \"The payments landscape is evolving rapidly as technological progress and other factors are leading to both the introduction of new financial products and services and to different ways of providing traditional banking services,\" it reads, noting:","None of which names crypto directly, and across the document the Fed specified neither firms nor specific technologies, nor did it use broader phrases like \"financial technologies\" or \"fintech.\" Regulators are fond of the buzzword \"tech-neutral,\" which may explain why the Fed's guidance verges on ambiguity. When The Block reached the Fed for comment, a representative similarly declined to confirm or deny any particular charters or companies as part of this push.&nbsp;","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">So what are these novel institutions?<\/span><\/strong>","But some confirmation for involvement has come from the crypto industry itself.","In a statement to The Block, Kraken Bank CEO David Kinitsky identified the firm's <a href=\"https:\/\/www.theblockcrypto.com\/post\/77804\/kraken-crypto-bank-launch-wyoming\" data-v-f87c67ca=\"\">Wyoming-based charter<\/a> as \"just the sort of forward-looking license that the Fed's recent proposed guidelines are meant to address.\" He further confirmed the firm's intention to \"move forward on our own master account application.\"&nbsp;","Senator Cynthia Lummis (R-WY) was also quick to pull in Wyoming's crypto-friendly special-purpose depository institution charter as a prompt for the Fed's guidance. \"Wyoming has developed the United States' best regulatory framework for digital assets,\" said Lummis a statement shared with The Block. \"I'm proud of the Federal Reserve for thoughtfully considering Wyoming's leadership.\"","But as for federal charters from the OCC, the relationship is less clear. Anchorage, the first digital asset firm to get a national bank charter, declined to comment on the new guidelines. A rep for Paxos, which operates under both a New York Bank Trust and received a conditional OCC charter at the end of April, told The Block that the firm had no advanced notice of the Fed's proposal.&nbsp;","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Different prospects for national and state charters<\/strong><\/span>","The OCC, for its part, is facing a change in management. Treasury Secretary Janet Yellen <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104245\/yellen-fed-reserve-acting-comptroller-occ\" data-v-f87c67ca=\"\">named Michael Hsu<\/a> as the new Acting Comptroller last week, with May 10 his first formal day on the job.&nbsp;","Despite the fact that it was an Obama-era OCC that made the first push for a national fintech charter, the process accelerated dramatically under the leadership of Brian Brooks last year. Brooks' legacy was entrenched in the crypto world. He joined the OCC from Coinbase's legal team and upon his departure became <a href=\"https:\/\/www.theblockcrypto.com\/daily\/102897\/brian-brooks-binance-coinbase-competitor\" data-v-f87c67ca=\"\">CEO of Binance US<\/a>.","Unfortunately for fintech licenses, Brooks became the target for an enormous wave of ire from Congressional Democrats on the House Financial Services Committee. As former U.S. president Donald Trump's term came to an end, there was strong political pressure to roll back the actions of Brooks and his predecessor Joseph Otting.","On Tuesday night, the Senate passed a <a href=\"https:\/\/www.congress.gov\/bill\/117th-congress\/senate-joint-resolution\/15\/text?q=%7B%22search%22%3A%5B%22chamberActionDateCode%3A%5C%222021-05-11%7C117%7C17000%5C%22+AND+billIsReserved%3A%5C%22N%5C%22%22%5D%7D&amp;r=1&amp;s=2\" data-v-f87c67ca=\"\">resolution<\/a> to undo Brooks' \"True Lender\" rule, which is expected to face minimal resistance in the House. The House Financial Services Committee has already <a href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=407533\" data-v-f87c67ca=\"\">signaled<\/a> similar disapproval of the OCC's recent charters.&nbsp;"],"hashtag":["CONGRESS","FEDERAL RESERVE","JANET YELLEN","OCC"]}