{"summary":"Blockchain builders think cryptographic tech could solve a lot of the intellectual property and personal data concerns presented by artificial intelligence.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239028\/ai-blockchain-synergy-may-hold-the-answer-to-protecting-drakes-voice","publishDate":"2023-07-11T17:09:52","id":12097,"type":null,"title":"Drake&#x27;s voice might be saved by blockchain-infused AI","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">Nearly three months since an anonymous TikToker dressed like a ghost <\/span><a href=\"https:\/\/www.nytimes.com\/2023\/04\/19\/arts\/music\/ai-drake-the-weeknd-fake.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">enlisted artificial intelligence<\/span><\/a><span data-v-f87c67ca=\"\"> to create a duet featuring two of the world’s biggest music stars, Drake and The Weeknd, much of the outcry, paranoia and hypothesizing about what it all means has subsided.<\/span>","<span data-v-f87c67ca=\"\">But the very real dilemma of how people, from pop stars to your average Joe on the street, will be able to protect their voice and likeness — tangible dimensions of both identity and personal data — isn’t going anywhere. Many in the blockchain community see cryptographic technology as the answer.<\/span>","<span data-v-f87c67ca=\"\">“AI makes the internet a less trustworthy place,” said Lasha Antadze, co-founder of Rarify Labs, a company working to strengthen the protection and verification of digital identity. “Its proliferation amplifies the need for reliable sources of authenticity and creates an opportunity for blockchain to become a critical piece of infrastructure.”<\/span>","<span data-v-f87c67ca=\"\">Other AI-generated musical experiments have <\/span><a href=\"https:\/\/twitter.com\/Nevernyny\/status\/1646571616267059200\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">included Rihanna<\/span><\/a><span data-v-f87c67ca=\"\">, Kanye West and deceased Beatles legend <\/span><a href=\"https:\/\/www.theverge.com\/2023\/6\/13\/23759296\/the-beatles-now-and-then-restoration-ai-paul-mccartney-john-lennon\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">John Lennon<\/span><\/a><span data-v-f87c67ca=\"\">. Record label giant Universal Music Group, which through subsidiaries releases Drake and The Weeknd’s music, <\/span><a href=\"https:\/\/www.musicbusinessworldwide.com\/universal-music-group-responds-to-fake-drake-ai-track-streaming-platforms-have-a-fundamental-responsibility\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">condemned<\/span><\/a><span data-v-f87c67ca=\"\"> the creation of AI-generated music content which borrows from professional musicians without their consent.<\/span>","<span data-v-f87c67ca=\"\">In a statement UMG said music “ecosystem” stakeholders would need to decide if they wanted to side with “artists, fans and human creative expression, or … deep fakes, fraud and denying artists their due compensation.”<\/span>","","","<span data-v-f87c67ca=\"\">While UMG has engaged with web3 companies in the past, like <\/span><a href=\"https:\/\/www.prnewswire.com\/news-releases\/limewire-strikes-deal-with-universal-music-group-for-its-music-nft-licensing-platform-301548725.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">partnering with LimeWire<\/span><\/a><span data-v-f87c67ca=\"\"> so its artists could sell NFT versions of “audio recordings, audiovisual content, backstage footage” and artwork, it’s unclear if the music giant would eventually consider using cryptographic technology on the blockchain in order to audit authenticity and track provenance.<\/span>","<span data-v-f87c67ca=\"\">Some web3 builders with ties to the world of entertainment believe it’s only a matter of time before the music industry relies on blockchain-based technology to ensure authenticity and protect against copyright infringement.<\/span>","<span data-v-f87c67ca=\"\">“A huge pillar of blockchain technology is its ability to track ownership,” said Inder Phull, CEO of Pixelynx, a web3 music and gaming company co-founded by musical artists Deadmau5 and Richie Hawtin. “As AI continues to make its way into the web3 sector, we’ll see more projects begin to implement blockchain … tracking the provenance of the resulting content and mitigating some of the concerns over transparency and digital ownership.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The expanded use of AI may pose a threat to more than just famous musical artists or other recognizable characters like politicians, who could have their image falsified in deep fake videos. Average people’s data and likeness could also be at risk, according to proponents of blockchain-powered data storage solutions.<\/span>","<span data-v-f87c67ca=\"\">Some web3 data experts see the decentralized storing of personal information as a safe and efficient way to protect users against having their private data leveraged and monetized by massive tech giants who operate centralized ecosystems like Google and Meta aiming to grow their businesses using artificial intelligence.<\/span>","<span data-v-f87c67ca=\"\">“The reason AI has been scrutinized with regard to data privacy is that major platforms with access to millions, sometimes even billions of users’ data, are looking to incorporate AI,” said Gregor Žavcer, executive director at Swarm Foundation, a Swiss non-profit seeking to “empower digital freedom” in part by decentralizing the “storage and exchange” of data.<\/span>","<span data-v-f87c67ca=\"\">Žavcer said he expects the billions of people using Meta’s Facebook or Instagram are about to have their personal data aggregated and analyzed en masse. He also believes when these tech corporations begin deploying AI on a significant level, while simultaneously storing large troves of personal data, they'll be opened up to “the potential for breaches and hacks” which could lead to the leaking of sensitive information.<\/span>","<span data-v-f87c67ca=\"\">Blockchain technology and its ability to decentralize data provides solutions, according to Žavcer. “Decentralized storage offers a ready solution to protect user and enterprise data because its decentralized nature makes it extremely difficult to hack or manipulate,” he said.<\/span>","<span data-v-f87c67ca=\"\">Additionally, the Swarm Foundation executive said decentralized storage of private data could put both individuals and companies into a position where they decide where their information is kept, who has access and whether or not AI models are allowed to use it.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"John Lennon","content":"PERSON"},{"type":"UMG","content":"ORGANIZATION"},{"type":"Rarify Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Lasha Antadze","content":"PERSON"},{"type":"Swarm Foundation","content":"ORGANIZATION"},{"type":"Joe","content":"PERSON"},{"type":"Kanye West","content":"LOCATION"},{"type":"Universal Music Group","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Rihanna","content":"ORGANIZATION"},{"type":"Drake","content":"PERSON"},{"type":"Gregor Žavcer","content":"PERSON"},{"type":"Inder Phull","content":"PERSON"},{"type":"Pixelynx","content":"LOCATION"},{"type":"LimeWire","content":"LOCATION"},{"type":"Richie Hawtin","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}