{"summary":"Iron Bank has responded to Alpha Homora saying it needs to take ownership of its $30 million bad debt.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216832\/iron-bank-tells-alpha-homora-to-take-ownership-of-its-bad-debt","publishDate":"2023-03-03T06:04:36","id":12099,"type":null,"title":"Iron Bank tells Alpha Homora to &#x27;take ownership&#x27; of its bad debt","category":["CRYPTO ECOSYSTEMS"],"content":["DeFi lending platform Iron Bank has urged Alpha Homora to “take ownership” of its bad debt amid a tussle between the two liquidity platforms.","Iron Bank paused Alpha Homora’s lending account on March 1. Iron Bank is a DeFi protocol that provides liquidity to other DeFi lending platforms, including Alpha Homora. The pause came in response to Alpha Homora’s $30 million bad debt that arose after a <a href=\"https:\/\/www.theblock.co\/linked\/94809\/alpha-homora-exploited-for-37-5m\" data-v-f87c67ca=\"\">malicious exploit<\/a> in February 2021.","Iron Bank <a href=\"https:\/\/twitter.com\/ibdotxyz\/status\/1631595663673925632\" data-v-f87c67ca=\"\">said<\/a> that it had repeatedly asked Alpha Homora to provide a solution to rebalance its bad debt, but to no avail. “They continue to seek private calls rather than transparently provide a written solution,” Iron Bank said on Friday. The DeFi lending platform said written solutions provide full transparency for all parties involved.","Alpha Homora <a href=\"https:\/\/www.theblock.pro\/news\/post\/216536\/iron-bank-freezes-alpha-homora-lending-accounts-over-bad-debt-dispute\" data-v-f87c67ca=\"\">previously said<\/a> that it was communicating with Iron Bank on possible solutions. AlphaVentureDAO CEO Tascha Punyaneramitdee issued an open letter on Thursday detailing previous agreements between Alpha Homora and Iron Bank. AlphaVentureDAO is the DAO behind the Alpha Homora protocol. These agreements included locking up 50 million ALPHA tokens as collateral and using 20% of Alpha Homora’s protocol fees to service the debt.","Still, Iron Bank said on Friday that Alpha Homora has not met the terms of its commitment to pay off the debt. “Alpha Homora needs to take ownership for the cost of their own exploit,” Iron Bank said.","Alpha Homora’s lending account on Iron Bank remains paused. Users are unable to withdraw their funds. Iron Bank says this measure is meant to protect its other users from Alpha Homora's bad debt.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alpha Homora","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Iron Bank","content":"ORGANIZATION"},{"type":"Alpha Homora","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Tascha Punyaneramitdee","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"March 1","content":"DATE"},{"type":"February 2021","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Iron Bank paused Alpha Homora","content":"ORGANIZATION"}],"hashtag":["EXPLOITS","HACKS","LENDING"],"authors":["Osato Avan-Nomayo","The Block"]}