{"summary":"Some speculate that crypto will be better off with Binance’s founder Changpeng ‘CZ’ Zhao being punished for wrongdoing while leading the world’s largest cryptocurrency exchange.\nJPMorgan says this eliminates potential systemic risk associated with a hypothetical collapse of the exchange.","author":["RT Watson","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264272\/how-czs-exit-and-binances-4-billion-fine-could-shape-the-future-of-crypto","publishDate":"2023-11-22T09:01:49","id":121,"type":null,"title":"How CZ&#x27;s exit and Binance&#x27;s $4 billion fine could shape the future of crypto","category":["Exchanges"],"content":["<span data-v-f87c67ca=\"\">As agonizing as FTX’s collapse was for many in crypto, the exchange’s former billionaire CEO Sam Bankman-Fried being <a href=\"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report\" data-v-f87c67ca=\"\">found guilty<\/a> of criminal charges was a cathartic event for some, seen as setting the stage for the building of a new era.<\/span>","<span data-v-f87c67ca=\"\">Now, another one-time crypto wunderkind, Binance’s <\/span><span data-v-f87c67ca=\"\">CEO Changpeng 'CZ' Zhao has been forced to step down as head of an even bigger company after pleading guilty to criminal charges in the United States. Binance also pled guilty while agreeing to pay $4.3 billion for wrongdoing.<\/span>","<span data-v-f87c67ca=\"\">One question on many people’s minds is what does it all mean? The number of high-profile crypto stars being held accountable for wrongdoing have piled up including <a href=\"https:\/\/www.theblock.co\/post\/254172\/criminal-trial-date-set-for-next-year-for-former-celsius-ceo-mashinsky-bloomberg-news\" data-v-f87c67ca=\"\">Alex Mashinsky<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/261349\/sec-seeks-summary-judgment-in-lawsuit-against-terraform-do-kwon\" data-v-f87c67ca=\"\">Do Kwon<\/a> and Bankman-Fried. But CZ has probably been the most powerful of all as head of the world’s largest cryptocurrency exchange and now he is exiting Binance for \"mistakes\" he admits making. So will crypto now enter a new phase and if so what will it look like?<\/span>","<span data-v-f87c67ca=\"\">DeFiance Capital founder Arthur Cheong <a href=\"https:\/\/twitter.com\/Arthur_0x\/status\/1727025668024938810?t=y-DtbCLpfGSBEhW-yUEcuA&amp;s=19\" data-v-f87c67ca=\"\">took to X<\/a> on Tuesday to say he is \"very bullish\" after hearing Binance had finally resolved its drawn-out entanglement with the U.S. Department of Justice by pleading guilty <\/span><span data-v-f87c67ca=\"\">to counts of money laundering, conspiracy to conduct an unlicensed money transmitting business,<\/span> <span data-v-f87c67ca=\"\">and sanctions violations.<\/span>","<span data-v-f87c67ca=\"\">\"This remove[s] one of the biggest overhang[s] for the industry and I consider this an orderly resolution,\" said Cheong.<\/span>","Mike Novogratz echoed Cheong's statements in a post. \"Binance setting with the US regulators would be super bullish,\" the Galaxy Digital Holdings CEO <a href=\"https:\/\/twitter.com\/novogratz\/status\/1726654930998763749\" data-v-6504b264=\"\" data-v-f87c67ca=\"\">wrote ahead<\/a> of the confirmation that Binance and CZ would plead guilty. \"Not sure if reports are true but I personally am hoping for a settlement and for the industry to move forward.\"","<span data-v-f87c67ca=\"\">The <\/span><span data-v-f87c67ca=\"\">U.S. Department of Justice’s prosecution of Binance has been expected for years after the investigation began in 2018. \"<\/span><span data-v-f87c67ca=\"\">From the very beginning, Zhao and other Binance executives engaged in a deliberate and calculated effort to profit from the U.S. market without implementing the controls required by U.S. law,\" Attorney General Merrick B. Garland <a href=\"https:\/\/www.theblock.co\/post\/264013\/binance-us-press-conference-settlement\" data-v-f87c67ca=\"\">said<\/a>. The DOJ found that the exchange enabled transactions between American users and sanctioned entities.&nbsp;<\/span>","<span data-v-6504b264=\"\" data-v-f87c67ca=\"\">A lot of speculation on X focused on how the shake up caused by U.S. authorities coming down hard on Binance could clear the way for traditional financial institutions to take control of the space.&nbsp;<\/span>","<span data-v-6504b264=\"\" data-v-f87c67ca=\"\">Eric Wall, a board member of StarkNet Foundation, said he is hoping traditional finance doesn’t absorb crypto but “<\/span><span data-v-6504b264=\"\" data-v-f87c67ca=\"\">it shouldn’t surprise anyone” if that is what ends up happening. Traditional financial institutions like BlackRock, Grayscale and Fidelity have applied for spot Bitcoin exchange-traded funds, a signal for many that crypto is either maturing or being taking over by the very established organizations some crypto natives want to avoid.&nbsp;<\/span>","On Wednesday, analysts at financial services giant JPMorgan, <a href=\"https:\/\/www.theblock.co\/post\/264283\/jpmorgan-binance-settlement-positive-crypto\" data-v-6504b264=\"\" data-v-f87c67ca=\"\">said that<\/a> Binance’s settlement with U.S. authorities is \"positive\" for the cryptocurrency exchange and the entire industry. Binance resolving the case eliminates&nbsp;“potential systemic risk emanating from a hypothetical Binance collapse,” JPMorgan also said.","<span data-v-6504b264=\"\" data-v-f87c67ca=\"\">While CZ stepping down from the exchange he founded is a seminal moment, and he may face jail time, he is being allowed to hold on to his majority stake in Binance. Richard Teng <a href=\"https:\/\/www.theblock.co\/post\/264120\/binance-names-richard-teng-as-new-ceo-as-founder-cz-admits-mistakes\" data-v-6504b264=\"\" data-v-f87c67ca=\"\">takes the reins<\/a> as the company's new CEO. Whether CZ will continue to wield a lot influence remains to be seen.<\/span>","<span data-v-6504b264=\"\" data-v-f87c67ca=\"\">“It seems like CZ was a very involved leader, so how the company will fare under new leadership is unclear,” said Devon James, co-executive director and CTO at the web3 firm Working Group, “However, it’s theirs to lose because Binance has a huge competitive advantage as the biggest exchange in the industry.”<\/span>","<span data-v-6504b264=\"\" data-v-f87c67ca=\"\">In the wake of the CZ-Binance news, data<\/span><span data-v-6504b264=\"\" data-v-f87c67ca=\"\">&nbsp;from DefiLlama <a href=\"https:\/\/www.theblock.co\/post\/264204\/binance-saw-1-billion-in-net-outflows-over-the-last-24-hours\" data-v-6504b264=\"\" data-v-f87c67ca=\"\">showed<\/a> that Binance’s 24-hour outflows topped $1 billion as of 3:30 p.m. Hong Kong time on Wednesday.<\/span>","Binance tried to express hope for the future in a memo, saying&nbsp; \"we are confident that Binance will emerge as a stronger company as we lay the foundation for the next 50 years.\"","<em data-v-f87c67ca=\"\">Anna Baydakova contributed to this article.<\/em>"],"hashtag":["BINANCE","JPMORGAN"]}