{"summary":"Algorand has announced a new upgrade that could boost its transactions per second (TPS) and cross-chain communication security via state proofs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168465\/algorand-upgrade-could-increase-speed-and-cross-chain-transaction-capability","publishDate":"2022-09-07T18:00:20","id":12103,"type":null,"title":"Algorand upgrade could increase speed and cross-chain transaction capability","category":["LAYER 1S"],"content":["Algorand, a proof of stake Layer 1, has announced a new upgrade to its protocol that could boost its transactions per second (TPS) and cross-chain communication security via state proofs.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlgorand’s state proofs are an interoperability standard that aims to securely connect Algorand to other blockchains. State proofs provide an interface any proof of stake blockchain can use for cross-chain communication and transactions.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlgorand <a href=\"https:\/\/twitter.com\/Algorand\/status\/1567506194004168705?s=20&amp;t=ZpIiNibWlti4Cj1msmvBUg\" data-v-f87c67ca=\"\">claims<\/a> this upgrade increases the network TPS from 1,200 to 6,000.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile an increase in TPS could be a positive upgrade, more details are needed to understand what impact it will have for users and protocols. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nTPS is a measure of speed and is not correlated to finality, which is when a transaction is processed and finalized on the blockchain. Finality is important for security in that it guarantees the transaction cannot be reversed and must be considered when assessing TPS in blockchains. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlgorand’s Chief Product Officer Paul Reigle believes that state proofs are “game-changing” for secure blockchain interoperability. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlgorand’s founder Silvio Micali seconded this, highlighting its importance that “decentralization does not need to come at the cost of performance or security,\" and his belief that state proofs are a “critical security feature for communication between networks.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSecurity for cross-chain messaging and transactions is of heightened importance, with several <a href=\"https:\/\/www.theblock.co\/search?query=hack\" data-v-f87c67ca=\"\">hacks<\/a> occurring over the past year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvio Micali","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Paul Reigle","content":"PERSON"},{"type":"TPS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}