{"summary":"Bloomberg suggested several ways that Musk, who has had a complicated relationship with cryptocurrencies, might bring more crypto into Twitter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181129\/elon-musk-could-bring-more-crypto-into-twitter-bloomberg","publishDate":"2022-10-29T11:47:34","id":12100,"type":null,"title":"Elon Musk could bring more crypto into Twitter: Bloomberg","category":["PEOPLE"],"content":["Billionaire Elon Musk entered Twitter headquarters carrying what appeared to be a bathroom sink, then the Tesla and SpaceX CEO left with the keys and $44 billion less in his wallet as he completed his takeover of the company and ended a months-long saga on Friday, according to <a href=\"https:\/\/www.theblock.co\/post\/180725\/musk-at-last-takes-over-twitter-reports\" data-v-f87c67ca=\"\">multiple reports<\/a>.","Bloomberg today <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-10-29\/how-elon-musk-can-add-crypto-nft-transactions-on-twitter?srnd=premium\" data-v-f87c67ca=\"\">suggested<\/a> several ways that Musk, who has had a complicated relationship with cryptocurrencies, might bring more crypto into Twitter, including using blockchain to reduce the presence of bots, a subject that had ignited a legal battle between Musk and the company that threatened the acquisition.","Musk, Bloomberg pointed out, is a freedom of speech champion of sorts who may lift Twitter’s bans against some users. This position might align him with many crypto believers in the decentralization of blockchains, which Musk has at times discussed using to reduce spam and promote free speech, though he has also declared that “blockchain Twitter isn’t possible.”","A Musk “super app” expanding Twitter into messaging, games, payments and more may be in the cards, Bloomberg said, and digital assets may play a part in that. NFTs may also enter the picture, though Musk has shunned them in the past.","<span class=\"s1\" data-v-f87c67ca=\"\">Additionally, c<\/span>rypto exchange operator Binance <a href=\"https:\/\/www.theblock.co\/post\/180752\/binance-confirmed-as-investor-in-twitter-takeover-as-musk-reportedly-plans-to-take-reins-as-ceo\" data-v-f87c67ca=\"\">has been confirmed<\/a> as an equity investor in Musk's acquisition of Twitter. \"We're excited to be able to help Elon realize a new vision for Twitter. We aim to play a role in bringing social media and web3 together in order to broaden the use and adoption of crypto and blockchain technology,\" Binance founder and CEO Changpeng Zhao said in a statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"SpaceX","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"Musk","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Elon","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["ELON MUSK"],"authors":["Mike Millard","The Block"]}