{"summary":"The company had recently launched its own range of non-fungible tokens (NFTs) for use in its online metaverse game. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159250\/neopets-stung-by-major-hack","publishDate":"2022-07-23T05:23:52","id":12108,"type":null,"title":"Neopets stung by major hack","category":["HACKS"],"content":["Virtual pet owning game Neopets said that it was investigating a breach of customer data and recommended that users change their passwords.","\"Neopets recently became aware that customer data may have been stolen. We immediately launched an investigation assisted by a leading forensics firm. We are also engaging law enforcement and enhancing the protections for our systems and our user data,\" the company wrote in a twitter thread on Thursday.&nbsp;","The company had recently launched its own range of non-fungible tokens (NFTs) for use in its online metaverse game.&nbsp;","The Block contacted Neopets about the scale of the breach but had not heard back by time of publication.","Other news sites reported the hack may have affected as many as <a href=\"https:\/\/www.bleepingcomputer.com\/news\/security\/neopets-data-breach-exposes-personal-data-of-69-million-members\/\" data-v-f87c67ca=\"\">69 million accounts<\/a>. One site, Bleeping Computer, alleged that a hacker known as TarTarX began offered up the source code and database for the Neopets.com website for the price of four bitcoin, citing screenshots from a hacking forum.&nbsp;","<a href=\"https:\/\/www.pcgamer.com\/neopets-jumps-to-41m-visits-per-month-but-is-now-unsurprisingly-wracked-with-cheaters\/\" data-v-f87c67ca=\"\">Recent reports<\/a> estimate the game clocks more than 4 million site visits per month, down from a peak of <a href=\"https:\/\/www.themarysue.com\/neopets-economy\/\" data-v-f87c67ca=\"\">92 million<\/a> in the early 2000s.&nbsp;","Launched in 1999, Neopets was many gamers' first experience of a social networking site, with its own economy and land predating the growth of major social media sites such as Facebook.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bleeping Computer","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Neopets","content":"ORGANIZATION"},{"type":"2000s","content":"DATE"},{"type":"Neopets.com","content":"LOCATION"},{"type":"1999","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}