{"summary":"Web3 startup IYK has raised $16.8 million in seed funding led by A16z Crypto. Other investors included 1kx and Collab Currency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253443\/a16z-crypto-web3-startup-iyk","publishDate":"2023-09-28T12:01:05","id":12107,"type":null,"title":"A16z Crypto leads $16.8 million seed round for web3 startup IYK","category":["VENTURE CAPITAL"],"content":["IYK, a web3 startup that provides tools to brands like Adidas and Johnnie Walker to help bridge the physical and digital worlds, has raised $16.8 million in seed funding led by A16z Crypto.","Other investors in the round included 1kx, Collab Currency, Lattice Capital and gmoney, IYK said Thursday. IYK was an alumnus of a16z Crypto Startup School, the venture capital giant's accelerator program that typically invests $500,000 in participating startups in exchange for 7% equity, according to its website.","It is unclear when IYK began raising for the seed round and when the firm closed it; co-founder Ryan Ouyang declined to comment. He also declined to comment on the structure of the seed round and valuation.","IYK lets brands, musicians and creators build digi-physical experiences, helping them reward their customers and fans and stay connected with their community. Its products include a near-field communication chip that helps tokenize physical products and events, including in the form of NFTs. IYK also provides developer APIs and \"modules\" for further customization of experiences.&nbsp;","Since its founding in 2021, IYK said it has onboarded over 100 creators across industries including fashion, music and art. To onboard more brands and creators, it is launching a self-service platform to help create digi-physical experiences.","\"As a creator on the IYK platform, you can choose to build a ready-to-use experience with no-code tools, or invite developers to remix and extend the experience as much as they'd like with the IYK APIs,\" Ouyang told The Block. \"We don't lock you into a chip type, authentication system, or even our domain.\"","\"Compare this with competitors such as Collect.ID or LNQ, who funnel you into their first-party experience, requiring consumers to sign up for an account with them and sometimes requiring consumers download their mobile app,\" he added.&nbsp;","As part of its growth plans, IYK also looks to hire its first business development executive, Ouyang said. There are currently ten people working for IYK and Ouyang plans to also grow the engineering team in the short-term.&nbsp;","The full form of IYK is \"If You Know\" — a shortened version of IYKYK (\"If You Know You Know\") — Ouyang said. \"It comes from needing to 'know' that a chip is behind the patch on your clothing or behind the belly of your penguin toy. It's about 'knowing' that there's a digital universe you can teleport to by engaging with your physical product — a universe that changes over time and rewards you for participating,\" he added.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Ouyang","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Adidas","content":"ORGANIZATION"},{"type":"Collab Currency","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"digi","content":"ORGANIZATION"},{"type":"Lattice Capital","content":"ORGANIZATION"},{"type":"Johnnie Walker","content":"PERSON"},{"type":"$16.8 million","content":"MONEY"},{"type":"Crypto Startup School","content":"ORGANIZATION"},{"type":"IYK","content":"ORGANIZATION"},{"type":"Ryan Ouyang","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}