{"summary":"Mining company Hive Blockchain is testing other coins to mine with GPUs after Ther Merge, stating it is &quot;well poised&quot; to navigate the competitive market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168044\/crypto-miner-hive-blockchain-testing-other-gpu-mineable-coins-ahead-of-the-merge","publishDate":"2022-09-06T12:53:44","id":12109,"type":null,"title":"Crypto miner Hive Blockchain testing other GPU mineable coins ahead of The Merge","category":["MINING"],"content":["Bitcoin and Ethereum miner Hive Blockchain is looking into other coins that can be mined with graphics processing units (GPU), which are typically used to mine Ethereum.","The company is implementing beta-testing this week ahead of <a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">The Merge<\/a> — when the blockchain's proof-of-work consensus mechanism changes to proof-of-stake —, it said in its <a href=\"https:\/\/www.hiveblockchain.com\/news\/hive-blockchain-provides-august-2022-production-update-record-monthly-btc-production-and-appointment-of-gabriel-ibghy-as-general-counsel\/\" data-v-f87c67ca=\"\">monthly update<\/a> on Tuesday.","\"The Company's technical team is implementing a strategy to optimize the hashrate economics of the 6.5 Terahash of Ethereum mining capacity in the event of Ethereum's transition to Proof of Stake, across various other GPU mineable coins,\" it said in a statement. It also has a \"pilot project for cloud computing.\"","GPU mining represents 16% (or 21.5 megawatts) of the company's total energy capacity. Most of its power is used to mine bitcoin.","Hive said that in the current \"competitive\" landscape, only miners with the lowest cost of power and most efficient GPUs will prevail. With its cost of $0.03 per kilowatt-hour, the company believes it is \"well positioned to navigate the market ahead.\"","However, it seems also to consider the option of using the 14.8 megawatts of power currently allocated to legacy GPU cards to mine Bitcoin, stating that if it did so, it would be able to add 0.4 to 0.44 exahashes per second (EH\/s) to its bitcoin mining hashrate of 2.3 EH\/s.","Bitcoin miner Hut 8, which has been growing its high-performance computing business, said also on Tuesday that it recently installed 180 GPUs, which are currently mining Ethereum and will \"pivot on demand\" to provide artificial intelligence, machine learning or VFX rendering services to customers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$0.03","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"16%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Proof of Stake","content":"ORGANIZATION"},{"type":"Ethereum miner Hive Blockchain","content":"PERSON"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"VFX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}