{"summary":"Disgruntled former employees are nothing new. But a dedicated group chat of over a dozen engineers criticising their employer, R3, is a different story. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36156\/engineers-v-management-r3-is-facing-rumblings-among-its-core-ranks-but-it-may-not-be-alone","publishDate":"2019-08-21T12:52:47","id":12116,"type":null,"title":"Engineers v. Management: R3 is facing rumblings among its core ranks, but it may not be alone","category":["STARTUPS"],"content":["Disgruntled former employees are nothing new. But a dedicated group chat of over a dozen engineers criticising their employer, R3, is a different story.&nbsp;","R3 is one of the more prominent ventures in the blockchain space, having raised an eye-watering <a href=\"https:\/\/www.r3.com\/press-media\/statement-from-r3-ceo-david-e-rutter\/\" data-v-f87c67ca=\"\">$120 million<\/a> to fund its middleman-cutting creation and now counting over 200 employees across offices in New York, Brazil and London.","Still, while the firm has achieved some public success - including pinning down a consortium of high-profile banks - the aforementioned group chat documents complaints ranging from R3's so-called \"poor\" company culture and concerns over its core, pay-to-use DLT product; Corda Enterprise. The engineers say they've lost faith in the tech, saying it lacks scalability and \"doesn't perform well,\" as well as questioning Corda's long-term viability; pointing to alleged 5-figure monthly bills for cloud services.","Elsewhere, the delay of Corda 4 — the software's latest version— proved to be the final straw for many who subsequently left the blockchain giant earlier this year. This amounted to an \"exodus\" of around 10% of the global engineer force - including tech leads - over the course of a month, according to sources who asked for anonymity on account of NDAs.","But there's a key riff underlying these issues that may well go far beyond R3 and stretch to its fast-growing rivals. Indeed, R3's recent departures point to a deeper cultural conflict between the people running the space's biggest enterprise-blockchain firms and the engineers building them.","<strong data-v-f87c67ca=\"\">Corda concerns<\/strong>","To understand the tensions at R3, it’s worth briefly delineating the key technical grievances shared by its engineers.","The first issue is <strong data-v-f87c67ca=\"\">design<\/strong>; what Corda is and the ultimate vision. Sources suggest R3 is struggling to decide its identity, spreading itself “too thin” from being a financial software firm to a broad tech consortium. They also note frustration at the lack of ambition and clarity over what sort of blockchain Corda is trying to be – if indeed, it is intent on DLT.","Specifically, there are reportedly divisions between those seeking interoperability and those within management who they call Corda \"maximalists,” which has alienated some groups.","As a result, there are also concerns that the product will not offer viable efficiency gains for the wide array of businesses being targeted.","\"The problem is value creation and extraction: if Corda saves your organisation $100k but you have to pay $100k for an annual license, then even if the operation is more efficient...[it's] the same from a value perspective,\" said one source.","Still, R3 is not struggling for sales (though one source added they were \"not nearly what they hoped.”). From a revenue perspective, arguably casting a net wide is working for them for now, according to a <a href=\"https:\/\/www.forbes.com\/sites\/michaeldelcastillo\/2018\/06\/21\/r3-goes-for-broke-financial-documents-show-rocky-road-towards-blockchain-profitability\/#5b16dfab2347\" data-v-f87c67ca=\"\">Forbes article last year<\/a>. One former engineer also highlighted that there is technical \"potential\" for Corda to \"cut the costs and operation complexity for banks and other business by a large degree.\" But there is serious doubt over R3’s ability to maximise on its early promise <em data-v-f87c67ca=\"\">long-term<\/em>. Sources suggest that the lack of visionary leadership and disjointed design means at best Corda might find muted success within specific sectors like trade finance rather than becoming “a world-changing”, billion-dollar product.","\"They will get a big bank to implement Corda, I'm sure. But they [R3] will need to spend so much time firefighting it,” one source warned, highlighting underlying issues with its code and suggest<span data-v-f87c67ca=\"\">ing Corda wasn’t hitting the scaling numbers advertised.<\/span>","“They lost sight of the main game - building something that brings value to users,” another who left this month suggested, adding management had closed itself off to outside suggestions.","<span data-v-f87c67ca=\"\">Competition is also heating up. R3 recently <\/span><a href=\"https:\/\/www.coindesk.com\/r3-rejected-utility-settlement-coin-blockchain\" data-v-f87c67ca=\"\">fell short in an ambitious bid for the <\/a><span data-v-f87c67ca=\"\">Utility Settlement Coin project, losing to UK rival Clearmatics.<\/span>","The second grievance is over <strong data-v-f87c67ca=\"\">process<\/strong>; <em data-v-f87c67ca=\"\">how <\/em>Corda is being built. A particular frustration is that the team is building the tech while simultaneously accumulating around 200 \"partners\".&nbsp;Engineers report that clients often face sub-par service from what is a work-in-progress, and whose issues go beyond basic teething problems.","\"Getting Corda running is very complex, and the support is not great...Every client is a cost centre,\" one source reported. \"The size of the customer support team is completely out of whack with the number of clients.”","\"R3 are just flogging software and it isn't fully baked yet,” another added. [related id=\"1\"]&nbsp;","This is backed up by contacts at one of R3's major clients, Dutch multinational bank ING, which signed a five-year revenue agreement for an unlimited number of Corda Enterprise licenses last year. One source, who left ING last year, recounted the bank's frustration at R3’s handling of their requests for technical support and said they \"aren't seeing the value creation for the money they spent.\"","It is worth noting ING’s spokesperson commented that they continue to have a “strong partnership” with ING and views Corda as a “leading enterprise DLT platform.” However they did not explain where it had seen value creation.","<strong data-v-f87c67ca=\"\">A broader cultural schism<\/strong>","Nonetheless, these divisions also tell a more complex story, hinting at the issues facing firms who hire ideologues to operate in deeply corporate structures.","Indeed, one way to interpret the tensions at R3 is a cultural gap, stemming from the firm’s roots in traditional finance. In one camp is R3’s founder, Wall Street veteran David Rutter, and the major banks the firm targets as investors and clients; focused on boosting the top-line. In the other camp, there are the blockchain engineers; a unique breed of often talented, bullishly smart, and intransigent individuals, who typically seek disruption over capital gains.","Perhaps then it should come as little surprise that R3’s engineers find their finance-minded compatriots less collaborative, open-minded, and innovative than their technical peers<span data-v-f87c67ca=\"\">. <\/span>Meanwhile, senior management may see organised push-back from the junior ranks as a mark of dissent and a grave business-risk. These conflicting mindsets also create a stark divergence in approach, according to Richard Crook, an investment banking tech-lead.","\"There is a big difference between the type of developer found in crypto and those found in the finance domain. If you’ve grown up in crypto, you are like Facebook in its early-days; move quickly and break things,” he told The Block. \"R3, on the other hand, doesn't want to break things.\"","Indeed, to its engineers' frustration, R3’s business heads are purposely building the tech to suit the client with a pre-established use-case, rather than a puritan DLT approach.","\"If you start with the users and then build the tech, it's more successful. Like Facebook. So R3 started with the banks and then built, which is the inverse to Ripple [for example]. Architecturally the tech is different,” Crook explained. This business model is also a key reason behind Corda's “share-nothing” philosophy, as a private blockchain, which has proven unpopular among some developers.","<span data-v-f87c67ca=\"\">Elsewhere, others comment that R3's straight-laced, corporate dynamic has been a necessary ingredient in introducing banks to blockchain, adding institutions would be \"repelled\" by t-shirt-clad engineers.<\/span>","Crook also suggests R3’s flurry of departures earlier this year is part and parcel of the culture within tech communities.","\"I am actually surprised it’s only 10%,\" he said, adding that he expects the firm will now \"turn over a third\" of their first hires in total.","He added:","\"Many engineers like building new things. They don’t tend to like building on other people’s stuff. Three years in, all the greenfield is gone. A different engineer is needed for the next maturity step.\"","Yet paradoxically, these software firms rely on engineers. And these deeper ideological clashes may well be endemic in other enterprise-blockchain firms like IBM and Consensys, who may be unintentionally building a team of employees with deeply opposing approaches to process, output, and delivery.","So does R3 have a revolt on its hands?","Perhaps not yet, but the modus operandi is clearly strained and a visionary brain-drain is in motion. Candidates with ideals of changing “the world” are starting to seek less bureaucratic, bottom-up work environments; potentially to the detriment of enterprise-blockchain firms.&nbsp;","R3 did not respond to a request for comment for this piece by the time it went to print.","<em data-v-f87c67ca=\"\">UPDATE: The story has been updated with ING’s spokesperson's comment.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Corda \"","content":"ORGANIZATION"},{"type":"Richard Crook","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"ING","content":"ORGANIZATION"},{"type":"Brazil","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Corda","content":"ORGANIZATION"},{"type":"$100k","content":"MONEY"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Forbes","content":"ORGANIZATION"},{"type":"Corda","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Corda","content":"PERSON"},{"type":"Corda Enterprise","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"David Rutter","content":"PERSON"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}