{"summary":"Alex Gladstein, chief strategy officer for the Human Rights Foundation, chats with The Block&#x27;s Frank Chaparro about El Salvador&#x27;s bitcoin moves.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108090\/alex-gladstein-on-the-significance-of-el-salvadors-bitcoin-moves","publishDate":"2021-06-11T08:43:55","id":12110,"type":null,"title":"Alex Gladstein on the significance of El Salvador&#x27;s bitcoin moves","category":["BITCOIN"],"content":["<i data-v-f87c67ca=\"\">Episode <\/i><strong data-v-f87c67ca=\"\">31<\/strong><i data-v-f87c67ca=\"\"> of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Human Rights Foundation’s Alex Gladstein.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"2c5c43484f4d5f586c5844494e40434f474f5e555c5843024f4341\">[email&nbsp;protected]<\/a>.<\/i>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus<\/a>, <a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>, and Exodus<\/strong><\/span>","<span data-v-f87c67ca=\"\">Eventus is the leading global provider of multi-asset class trade surveillance, transaction monitoring and market risk solutions. Eventus offers a powerful, award-winning trade surveillance platform that is easy to deploy, customize and operate. Eventus is proven in the most complex, high-volume and real-time environments and supports many of the industry’s leading crypto exchanges including Coinbase, Gemini, ErisX and OSL. The company’s rapidly growing client base relies on Eventus’ responsive support and product development teams to overcome its most pressing regulatory challenges.<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started&nbsp;today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Exodus<\/strong><\/span>","Alex Gladstein, chief strategy officer for the Human Rights Foundation, is excited about the implications of El Salvador's adoption of Bitcoin.","Last week, Nayib Bukele, president of El Salvador, sparked shockwaves across the bitcoin community with his Miami conference announcement of a proposed bill to declare bitcoin as legal tender in the country and mandate its acceptance as a means of payment. Earlier this week, the bill was formally introduced and then <a href=\"https:\/\/www.theblockcrypto.com\/post\/107699\/el-salvador-becomes-the-first-country-ever-to-make-bitcoin-legal-tender\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">signed into law<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">During a new episode of The Scoop, Gladstein explained what's happening in El Salvador and the ramifications from a domestic and international human rights perspective. Gladstein pointed out that it's significant that El Salvador opted for bitcoin versus building a digital currency the government could have more control over.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I just wanted to take pains to try to draw the distinction between the domestic human rights situation and that sort of more geopolitical situation with a dollar kind of hegemony and the great powers thing here. I mean, look, they could have gone with China, they could have gone with a digital Yuan, or something like that. I am so happy that they're going with bitcoin. I mean they could have chosen a coin that they controlled and could surveil and confiscate. And you've got to realize how shocking this is, because that is the direction that governments are going in\"<\/span>","<span data-v-f87c67ca=\"\">Gladstein also unpacked what the move means for bitcoin’s role as a form of money. While major Wall Street firms have invested in bitcoin over the last year in part for its use case as digital gold — an inflation hedge — Gladstein says that bitcoin’s role as a quick, borderless payments vehicle is becoming increasingly important. Developments like El Salvador making bitcoin legal tender and advancements in the build-out of Lightning, a bitcoin scaling project, are fueling that shift, according to Gladstein.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Most people don't think bitcoin is money, but what if it was actually turning into money? What would that look like? What would that seem like?... And that's literally what we're watching unfold,\" he said during the interview, noting:<\/span>","<span data-v-f87c67ca=\"\">“[Bitcoin] has these remarkable properties that allow it to enable connections between people in different places in the world. So I guess my argument is that we're kind of entering this next narrative phase of Bitcoin, what we perceive it to be, and it being enacted or adopted by a country not as an asset necessarily on the central bank balance sheet, but as legal tender.”<\/span>","<span data-v-f87c67ca=\"\">As for what this means for the people of El Salvador, specifically, Gladstein said that it will help bank many unbanked citizens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“70 percent of the country doesn't have a bank account, but more than 50 percent of the country has Internet access. So there is a significant overlap there of people whose lives are being changed as a result of this.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"El Salvador","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Gladstein","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"70 percent","content":"PERCENT"},{"type":"Spotify","content":"LOCATION"},{"type":"the Human Rights Foundation","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Alex Gladstein","content":"PERSON"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"The Block’s Frank Chaparro and Human Rights Foundation","content":"ORGANIZATION"},{"type":"50 percent","content":"PERCENT"},{"type":"China","content":"LOCATION"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}