{"summary":"Phantom wallet has launched a &quot;Sign In With Solana&quot; (SIWS) feature — allowing apps to securely authenticate users with just a Solana address.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246683\/phantom-sign-in-with-solana","publishDate":"2023-08-22T06:57:52","id":1211,"type":null,"title":"Phantom launches &#x27;Sign In With Solana&#x27; feature for one-click user authentication","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto and NFT wallet app Phantom has launched a \"Sign In With Solana\" (SIWS) feature — allowing apps to securely authenticate users with just a Solana address.","Phantom is the most widely used wallet on Solana. Its new one-click \"signIn\" method aims to improve authentication UX and security when connecting to apps, eliminating the need for cumbersome multi-step processes, according to an <a href=\"https:\/\/twitter.com\/phantom\/status\/1693759783512543368?s=20\" data-v-f87c67ca=\"\">announcement<\/a> on Monday.","Currently, when users connect their wallets to major apps, they're often greeted with confusing signature requests. These pop-ups can be daunting for new users and tedious for returning ones but are required for authentication to prove control over the private key for the connecting address.&nbsp;","However, a lack of standardization in the authentication process among apps has led to fragmented and poor user experiences.","As part of Phantom's SIWS feature, it unveiled a new one-click \"signIn\" method and support for the \"Solana Wallet Standard\" to help address the issue. Using the one-click sign-in method, users can connect and sign a standardized authentication message in a single step. Solana developers can use the new sign-in method on all extension platforms, with mobile support coming soon, Phantom <a href=\"https:\/\/phantom.app\/learn\/developers\/sign-in-with-solana\" data-v-f87c67ca=\"\">said<\/a> in a blog post. It can also scrutinize message data, such as domain details or timestamps, ensuring its legitimacy and flagging any suspicious activity, the team added.","Phantom said it worked with Solana Labs on the launch, ensuring that the sign-in method is fully compatible with the Solana Wallet Standard’s <a href=\"https:\/\/github.com\/solana-labs\/wallet-standard\/pull\/12\" data-v-f87c67ca=\"\">SIWS feature<\/a> which can be integrated by other wallets in the Solana ecosystem.","Phantom first <a href=\"https:\/\/www.theblock.co\/post\/210578\/phantom-wallet-authentication-phishing\" data-v-f87c67ca=\"\">announced<\/a> it was adopting \"Sign In With\" standards in February to improve user security and protect against phishing attacks.","In November, Phantom also <a href=\"https:\/\/www.theblock.co\/post\/190241\/crypto-wallet-phantom-is-expanding-to-ethereum-and-polygon\" data-v-f87c67ca=\"\">expanded<\/a> to the Ethereum and Polygon blockchain networks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Solana","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Solana Wallet Standard","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Solana Wallet Standard’s <a href=\"https:\/\/github.com\/solana-labs\/wallet-standard\/pull\/12\" data-v-f87c67ca=\"\">SIWS","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["SOLANA","WALLETS"],"authors":["James Hunt","The Block"]}