{"summary":"The Solana-based portfolio management outfit says its crypto lending product is in response to increased institutional demand for DeFi credit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183510\/friktion-offers-under-collateralized-crypto-lending-for-institutional-clients","publishDate":"2022-11-06T04:19:27","id":12113,"type":null,"title":"Friktion offers under-collateralized crypto lending for institutional clients","category":["LENDING"],"content":["Friktion, a Solana-based portfolio management platform, debuted a crypto lending product for institutional clients who are in the market for access to higher yields in the DeFi space.","The company said its crypto lending product will provide access to under-collateralized loans for borrowers. This type of loan does not require the borrower to put up collateral that is equal to or greater than the value of the loan. As such, it can be a capital-efficient form of borrowing.","Friktion’s crypto lending will offer enhanced lender protection, the company said. The lending product will comprise tranched pools ranging from junior tranches to senior tranches. Junior tranches will offer higher annualized yields of between 11% and 17% in return for covering senior lenders against loan defaults. Loan pools will also feature a diverse cast of borrowers to reduce counterparty risks. Lenders in the senior pool can earn annualized yields of between 8% and 10%.","Commenting on its risk-management strategy, the company told The Block that third-party underwriters called “conductors” will do due-diligence checks on borrowers before launching loan pools.","“Throughout the tenure of the loan pool, conductors will also perform real-time risk monitoring of borrowers’ positions both on exchanges and on-chain,” the company told The Block, adding, “In an unlikely event of default, the junior pool serves as first loss capital and provides default protection to the senior pool.”","Under-collateralized loans pose significant risks for lenders, especially when borrowers are unable to repay them. Indeed, under-collateralized lending and the crypto bear market collapse led to bankruptcies of the likes of <a href=\"https:\/\/www.theblock.co\/post\/172351\/celsius-investors-file-for-fiduciary-to-advocate-for-them-in-bankruptcy-case\" data-v-f87c67ca=\"\">Celsius<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/168264\/bankrupt-voyager-digital-to-hold-asset-auction-on-september-13\" data-v-f87c67ca=\"\">Voyager<\/a>.","DeFi lending, on the other hand, is primarily over-collateralized. Most of the major DeFi lenders like Aave and Compound require borrowers to put up collateral in excess of the loan amount. According to Friktion, this collateral requirement presents a significant barrier for institutional players in the DeFi lending space amid concerns about capital efficiency. These concerns are further worsened by the current decline in DeFi yield due to the year-long crypto bear market.","Despite these problems, Friktion says there is a growing demand for institutional DeFi credit, especially under-collateralized stablecoin loans that offer capital efficiency for borrowers.","“As adoption from sophisticated market participants continues to grow, there is a natural demand for institutional-grade lending solutions that provide enhanced transparency, risk management, and lender protection,” the company said, adding, “This is a positive signal which not only indicates recovering sentiment but also demonstrates the maturation within the crypto lending market.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"17%","content":"PERCENT"},{"type":"Friktion","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"Friktion","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"Solana","content":"LOCATION"}],"hashtag":["LENDING"],"authors":["Osato Avan-Nomayo","The Block"]}