{"summary":"&quot;Falling stablecoin market capitalization means falling crypto liquidity and leverage,&quot; Morgan Stanley strategists said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211608\/why-morgan-stanley-says-you-should-be-paying-attention-to-stablecoins","publishDate":"2023-02-14T15:23:46","id":12129,"type":null,"title":"Why Morgan Stanley says you should be paying attention to stablecoins","category":["COMPANIES"],"content":["With U.S. regulators moving to limit stablecoin products, strategists at Morgan Stanley think the broader crypto economy should be paying attention.","<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">\"Falling <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">stablecoin market capitalization means falling crypto liquidity <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">and leverage,\" Sheena Shah and Kinji&nbsp; Steimetz wrote in a note dated Feb. 13. \"Stablecoins play a vital role in crypto trading and their products potentially compete with the fiat banking system.\"<\/span><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe New York Department of Financial Services earlier this week <a href=\"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\">ordered Paxos<\/a> to stop issuing the Binance USD stablecoin, and the Morgan Stanley strategists expect upcoming regulatory efforts in the U.S. Congress to focus on stablecoins.","&nbsp;\"<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">We think stablecoin issuers will likely have to register and show <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">they hold sufficient liquid assets to back the issued stablecoins,\" they wrote, citing an analysis by DataFinnovation which showed that \"BUSD wasn't always fully backed in the past.\"<\/span>","The availability of stablecoins can serve as a \"simple indicator of institutional demand for leverage, which influences prices,\" the report stated.&nbsp;","Without new BUSD being created by Paxos, its still unclear whether current holders of BUSD will transfer their funds to other stablecoins, with a neutral impact to liquidity, or whether the risk of further regulatory actions will reduce the overall market demand for stablecoins, according to the report.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Paxos","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Kinji&nbsp; Steimetz","content":"PERSON"},{"type":"DataFinnovation","content":"ORGANIZATION"},{"type":"Sheena Shah","content":"PERSON"},{"type":"Feb. 13","content":"DATE"}],"hashtag":["ANALYST REPORTS","BINANCE","BUSD","COINBASE","CRYPTO BANKS AND LENDERS","ECONOMIC INDICATORS","FEDERAL RESERVE","INVESTMENT FIRMS","SEC","USDC"],"authors":["Sam Venis","The Block"]}