{"summary":"Crypto exchange OKX is ceasing its operations in India due to &quot;local regulations,&quot; and it has asked users to withdraw funds by Apr. 30.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284003\/crypto-exchange-okx-exiting-india","publishDate":"2024-03-21T12:50:36","id":12120,"type":null,"title":"Crypto exchange OKX exiting India, asking users to withdraw funds by Apr. 30","category":["COMPANIES"],"content":["Crypto exchange OKX is shutting down its operations in India. The decision follows shortly after the Indian government blocked several offshore crypto exchange websites earlier this year, although OKX was not on that list. However, Apple and Google stores removed various crypto apps in India earlier this year, including OKX's.","\"We regret to inform you that OKX is no longer providing services to users in India,\" OKX said in an email sent to local users on Thursday, a copy of which was obtained by The Block. The exchange attributed the move to \"local regulations\" and instructed users to close all margin positions, as well as positions in perpetual, futures and options. Additionally, it asked users to redeem all funds from Earn and other products and withdraw them from their accounts.","The email said users must take these actions by Apr. 30, 12 AM UTC. Following this date, OKX will restrict users' accounts, though they will still be able to withdraw funds. \"Your funds will remain safe and available in your account until you withdraw them,\" the email reads.","An OKX spokesperson confirmed sending the email, saying to The Block that the decision was made in response to \"recent local regulations directed at offshore exchanges that make CeFi [centralized finance] trading available in India. OKX's DeFi [decentralized finance] web3 services remain available to developers and creators in India.\"","It's worth noting that <a href=\"https:\/\/www.theblock.co\/post\/248618\/crypto-exchange-okx-plans-to-enter-india-hire-local-staff-coindesk\" data-v-f87c67ca=\"\">OKX<\/a> was not among the nine crypto websites the Indian government blocked in January of this year for \"operating illegally without complying with the provisions of the PMLA [Prevention of Money Laundering Act] in India.\" The nine exchanges were Binance, KuCoin, Huobi, Kraken, Gate.io, Bittrex, Bitstamp, MEXC Global and Bitfinex.","However, following the government's actions, Apple and Google stores removed crypto exchange apps in India, including OKX's. At the time, <a href=\"https:\/\/www.theblock.co\/tag\/okx\/2\" data-v-f87c67ca=\"\">OKX<\/a> rival Binance said it would continue to work with Indian regulators to address the situation.","\"The ongoing situation is not unique to Binance, and we remain committed to complying with local regulations and maintaining dialogue with regulators worldwide to ensure the continued availability of our services,\" Binance South Asia's X account said at the time.","<em data-v-f87c67ca=\"\">(Updates with comment from an OKX spokesperson)<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Apr. 30","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Bittrex","content":"LOCATION"},{"type":"Bitstamp","content":"LOCATION"},{"type":"PMLA","content":"ORGANIZATION"},{"type":"Huobi","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance South Asia","content":"LOCATION"}],"hashtag":["OKX"],"authors":["Yogita Khatri","The Block"]}