{"summary":"An educational bitcoin deck penned by JPMorgan Private Bank signals increasing interest from its private wealth clients in the asset class.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97257\/jp-morgan-bitcoin-deck-private-client","publishDate":"2021-03-05T09:46:18","id":12124,"type":null,"title":"JPMorgan tells private wealth clients that bitcoin can be a portfolio diversifier &#x27;if sized correctly&#x27;","category":["BITCOIN"],"content":["JPMorgan Private Bank has distributed an educational deck to clients to help them understand the basics, risks and potential of bitcoin and cryptocurrencies.","The deck, obtained by The Block, was prepared in February and distributed last week in Europe and Asia as bitcoin's price rally has drawn attention from financial institutions and investors.&nbsp;","Overall, the deck covers major topics, like the basics of bitcoin, as well as the implications for holding bitcoin in a portfolio. The desk is for \"informational purposes only\" and notes: \"J.P. Morgan Securities LLC does not endorse, advise on, transmit, sell or transact in any type of virtual currency.\"&nbsp;","But the scope of the deck nonetheless demonstrates how the banking giant feels the need to respond to its wealth clients' growing interest in the digital asset class. Indeed, JPMorgan is becoming more interested as an institution, with JPMorgan's co-president and COO noting last month the firm will \"<a href=\"https:\/\/www.theblockcrypto.com\/linked\/94750\/jpmorgan-bitcoin-btc-trading-client-demand-coo-comments\" data-v-f87c67ca=\"\">have to be involved<\/a> [in crypto]\" if there's enough client demand for it.","In a slide entitled \"How others are valuing crypto?\" the bank broke down three commonly used metrics taken by market participants that \"suggest significant upside [of bitcoin] is possible.\"","Under the so-called Metcalfe's law, which suggests the value of a network is proportional to the square of the number of users, bitcoin's per-coin valuation would be at $21,667.","If comparing the current global value of gold to bitcoin by using the 21 million max supply of bitcoin, then bitcoin's valuation would be at $540,814. Finally, if applying the global value of money supply to the max supply of bitcoin, its value would be $1.9 million.","<span data-v-f87c67ca=\"\">Screenshot of the JPMorgan Private Bank slide<\/span>","Taking a step back, the private bank also provided its clients with charts and data that showed bitcoin's correlation with the dollar, gold, S&amp;P and Treasuries, highlighting that \"Bitcoin is diversifying, but it's not a protection asset.\"&nbsp;","\"Bitcoin is not gold, nor do we think of it as such. When it comes to portfolio construction, it has diversifying properties like gold, but its volatility characteristics and correlation profile refute the comparison to the traditional safe haven asset,\" the deck's authors wrote, adding:","\"Take the below correlations between Bitcoin and the DXY, gold, S&amp;P and Treasury yields – there is no consistent message. Sometimes it’s correlated with gold. Sometimes it’s correlated with equities. It’s rarely ever correlated with Treasuries. There is undoubtedly value in this lack of correlation but it needs to be considered in context.\"","<span data-v-f87c67ca=\"\">Screenshot from the JP Morgan deck<\/span>","In a further slide, JPMorgan shared its views with clients that bitcoin has recently been correlated with risk assets \"but long term it beats to its own drum\" and \"those correlations fall towards zero.\"&nbsp;","Thus bitcoin can be a \"portfolio diversifier,\" the bank said, \"if sized correctly.\"","\"It’s difficult to conclude that outflows from gold are directly linked to inflows into Bitcoin. That said, Bitcoin doesn’t consistently trade like a protection asset or a substitute for gold. If anything in the near term, Bitcoin is more similar to a diversifying risky asset rather than protection akin to Treasuries and gold.\"","The Block reported last October that JPMorgan <a href=\"https:\/\/www.theblockcrypto.com\/daily\/82334\/jpmorgan-digital-asset-custody-subcustody\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">was actively exploring crypto custody solutions<\/a> and held talks with crypto-native custody providers to see how it could offer digital asset custody to its clients via a sub-custodian or third-party specialist firm.&nbsp;","Meanwhile, Goldman Sachs <a href=\"https:\/\/www.theblockcrypto.com\/linked\/97259\/goldman-sachs-crypto-survey-shows-22-of-respondents-expect-100000-bitcoin?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">posted<\/a> the results of a survey on Thursday that showed 40% of its 280 sampled clients have exposure to cryptocurrencies and about 20% of the respondents expect bitcoin to trade above $100,000 within the next 12 months.","<span data-v-f87c67ca=\"\">Screenshot of the JPMorgan deck<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"COO","content":"ORGANIZATION"},{"type":"Metcalfe","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"JPMorgan Private Bank","content":"ORGANIZATION"},{"type":"$540,814","content":"MONEY"},{"type":"$100,000","content":"MONEY"},{"type":"$21,667","content":"MONEY"},{"type":"$1.9 million","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"J.P. Morgan Securities LLC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Private Bank","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","JPMORGAN"],"authors":["Wolfie Zhao","The Block"]}