{"summary":"Coinbase has filed for permission to submit a brief in the Ripple case that argues the SEC has failed to provide adequate guidance for crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181515\/coinbase-submits-amicus-brief-in-ripple-case","publishDate":"2022-10-31T19:32:58","id":1212,"type":null,"title":"Coinbase submits amicus brief in Ripple case","category":["LEGAL"],"content":["Crypto exchange Coinbase filed for permission to submit a brief in the ongoing case between the Securities and Exchange Commission and Ripple Labs, saying the lack of clarity in crypto enforcement actions is putting U.S. exchanges at a disadvantage.&nbsp;","Coinbase argues in its brief that the Constitution lays out that government agencies must give \"fair notice\" that conduct is illegal before taking action. In other words, the public must have a way of knowing the activity is illegal before the SEC can bring an enforcement.","The exchange filed a motion to submit an amicus curiae brief, and if approved, the accompanying document would be taken into account as the court weighs its decision. Both Ripple and the regulator recently <a href=\"https:\/\/www.theblock.co\/post\/170927\/sec-and-ripple-each-seek-ruling-in-long-running-unregistered-securities-case\" data-v-f87c67ca=\"\">moved for summary judgment<\/a>, asking a judge to make a decision based on the agreed-upon facts rather than sending the case to trial.","The Coinbase amicus brief joins other attempts from the crypto industry to give context to the case, including a recent <a href=\"https:\/\/www.theblock.co\/post\/181085\/blockchain-association-files-amicus-argument-in-ripple-case\" data-v-f87c67ca=\"\">motion<\/a> from The Blockchain Association as the SEC has yet to provide clear regulation for a fast-growing industry. Coinbase has repeatedly called for specific SEC rulemaking for crypto, petitioning the regulator in July.","The SEC first brought the case in 2020 when it alleged Ripple's XRP token constituted an unregistered security offering. The brief supports a part of Ripple's defense that claims the SEC failed to give adequate notice that XRP issuance and trading constituted illegal activity.","Coinbase claims the SEC sued XRP token sellers after allowing XRP to trade for years. The exchange says the regulator made public statements that longstanding tokens were not considered securities. Coinbase urges the court to deny the SEC's request for summary judgment on the grounds that a lack of rulemaking and the alleged mixed signals failed to give fair notice.","Additionally, the firm argues that those trying to be compliant incur significant losses over the SEC's lack of clarity. When the SEC brought its allegations against Ripple's XRP token, many platforms halted XRP trading and caused the price to drop, harming Coinbase customers.&nbsp;","\"The absence of formal rulemaking has led to unexpected enforcement actions like this one that create market uncertainty and profoundly disadvantage U.S. trading platforms like Coinbase as they compete with offshore platforms in jurisdictions where there is no risk of regulatory enforcement surprise,\" the brief said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE","SEC"],"authors":["Aislinn Keely","The Block"]}