{"summary":"On a hiring spree, crypto financial services firm BlockFi has nabbed two prominent executives from the traditional finance space\nFormer American Express vice president Wittney Rachlin and former Credit Suisse director David Olsson have both joined the firm\nRachlin will lead BlockFi’s growth strategy and its rewards card launch, while Olsson is focusing on its institutional business","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63768\/blockfi-american-express-credit-suisse-execs-bitcoin-card","publishDate":"2020-05-05T09:09:36","id":1213,"type":null,"title":"BlockFi hires former American Express exec as it gears up for bitcoin rewards card launch","category":["Capital Markets"],"content":["BlockFi has been on a hiring spree, and its hiring of a former American Express executive shows that it is inching closer to launching a bitcoin rewards credit card.","The firm announced today that it has brought on former American Express vice president Wittney Rachlin as chief growth officer, who will lead business development for the new card product that is <a href=\"https:\/\/www.theblockcrypto.com\/post\/55812\/blockfi-raises-30-million-as-it-looks-to-become-more-than-just-a-lender\" data-v-f87c67ca=\"\">slated to launch later<\/a> this year.","Prior to BlockFi, Rachlin spent 12 years at credit card giant American Express, where she led the growth strategy of four cards that accounted for 20% of American Express' total billings, according to Rachlin's LinkedIn. As such, BlockFi is hoping to leverage Rachlin's experience as it gears up for its own credit card launch. Before joining BlockFi, Rachlin spent two years at Prudential Financial.&nbsp;","\"Between the marketing, the rewards program, and payment processing, there's a lot that goes on in the backend of card processing and servicing that requires the need to connect with partners. The pandemic has slowed some of the partners down a bit,\" said CEO Zac Prince.&nbsp;","According to Prince, BlockFi is on track to launch the first round of cards in Q4 of 2020. The initial batch will be distributed among BlockFi employees and other strategic clients to start, while the full card launch is scheduled for 2021.&nbsp;","It's unclear at the moment whether it will charge an annual fee, but Prince said if they did decide to implement one, the card would likely offer incremental rewards that corresponded to different spending levels. The card will also initially target prime borrowers.&nbsp;","The credit card is part of BlockFi's larger plan to evolve into a full-fledged financial services firm. In February, BlockFi <a href=\"https:\/\/www.theblockcrypto.com\/post\/55812\/blockfi-raises-30-million-as-it-looks-to-become-more-than-just-a-lender\" data-v-f87c67ca=\"\">announced<\/a> a $30 million Series B led by Valar Ventures, with participation from Morgan Creek Digital, CMT Digital, and others. At the time, CEO Zac Prince told The Block that the firm would \"be associated less and less with the crypto lending category and more and more be identified as a diversified financial-services entity.\"","Indeed, the firm launched a retail brokerage service last year and is in the process of rolling out its own native app recently. It recently hit all-time highs across funding accounts and loan volumes, and now count more than 100 employees, according to Prince.","BlockFi has also added former Credit Suisse director David Olsson is its new global managing director.&nbsp;Olsson will focus on BlockFi's institutional business. At Credit Suisse, Olsson ran a private banking team that focuses on ultra-high-net-worth clients.&nbsp;","The firm has also announced that it has hired three new directors to its team to fuel business strategy and operations. Rob Margolis, formerly of LedgerX, is now BlockFi's Director Institutional Services; Mitch Port was hired from Kraken to serve as Director of Strategy and Analytics; and Dylan Stigliano, formerly product operations and strategy manager at Petal, joins <span class=\"il\" data-v-f87c67ca=\"\">BlockFi<\/span> as Director of Business Operations."],"hashtag":["BLOCKFI","LENDING"]}