{"summary":"Crypto crime has declined compared to previous years, Chainalysis says in a new report.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239256\/crypto-crime-down-by-more-than-65-chainalysis-says","publishDate":"2023-07-12T14:27:05","id":12136,"type":null,"title":"Crypto crime down by more than 65%, Chainalysis says","category":["LEGAL"],"content":["Crypto-related crime has declined significantly, <a href=\"https:\/\/blog.chainalysis.com\/reports\/crypto-crime-midyear-2023-update-ransomware-scams\/\" data-v-f87c67ca=\"\">according<\/a> to data from Chainalysis.","A new report from the analytics firm notes that daily crypto inflows into illicit services is down relative to previous years. From the beginning of the year through June, crypto inflows into illicit entities, which covers sanctioned individuals or groups, is down 65% from the same period last year.","","","The report notes that the drawdown in illicit crypto transactions outpaced the broader decline in crypto transactions tied to the slump in token prices.","\"Transaction volumes are down across the board, but declines are much less severe for legitimate services, which have seen just a 28% drop in inflows,\" the firm said.&nbsp;","\"In other words, there’s been a market pullback, but illicit crypto transaction volume is falling much more than legitimate crypto transaction volume.\"","Still, ransomware attacks are a crypto-based form of crime that is increasing in prevalence. Chainalysis found that ransomware attackers are on track for their second-biggest year on record, having siphoned about $449.1 million since the beginning of the year through June.&nbsp;","\"If this pace continues, ransomware attackers will extort $898.6 million from victims in 2023, trailing only 2021’s $939.9 million,\" the firm said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"28%","content":"PERCENT"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"$898.6 million","content":"MONEY"},{"type":"$449.1 million","content":"MONEY"},{"type":"$939.9 million","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}