{"summary":"The European Union is considering a ban on banks and crypto providers dealing with cryptocurrencies that aim to enhance user privacy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187078\/european-aml-rules-could-ban-privacy-coins-coindesk","publishDate":"2022-11-15T07:55:41","id":12132,"type":null,"title":"European AML rules could ban privacy coins: CoinDesk","category":["INTERNATIONAL POLICYMAKING"],"content":["The European Union is considering a ban that would prevent banks and crypto providers from dealing with cryptocurrencies that aim to enhance user privacy — commonly called \"privacy coins.\"","Digital currencies that allow anonymous means of payments — such as zcash, monero and dash — would be forbidden, according to a draft of a money laundering bill from Czech officials <a href=\"https:\/\/www.coindesk.com\/policy\/2022\/11\/15\/privacy-enhancing-crypto-coins-could-be-banned-under-leaked-eu-plans\/\" data-v-f87c67ca=\"\">obtained<\/a> by CoinDesk.&nbsp;","“Credit institutions, financial institutions and crypto-asset service providers shall be prohibited from keeping … anonymity-enhancing coins,” according to the document, dated Nov. 9, which has been circulated to the bloc's other 26 member states for comment.","The plans indicate that crypto-asset providers would have to verify customers' identities for transactions under $1040 (€1000) and face further probing for larger payments. Those doing business outside the bloc would have to verify if the counterparties are licensed, and verify their money-laundering controls.&nbsp;","The proposal to the European Union's position on anti-money laundering follows a series of amendments drafted by European parliament members that implicated decentralized finance, decentralized autonomous organizations and nonfungible tokens.","In September, The Block <a href=\"https:\/\/www.theblock.co\/post\/173652\/europe-aml-rules-could-implicate-defi-daos-and-nfts\" data-v-f87c67ca=\"\">reported<\/a> that DeFi protocols, DAOs and NFT traders may be subject to identity verification processes. Moreover, the metaverse was also targeted as potential grounds for money laundering.&nbsp;","The bill has to be agreed upon by the Council and European Parliament to pass into law.&nbsp;","In other jurisdictions, regulators have also sought to clamp down on crypto-based privacy tools. For instance, in August, the U.S. Treasury <a href=\"https:\/\/www.theblock.co\/post\/174016\/arrested-tornado-cash-developer-alexey-pertsev-appeal-rejected\" data-v-f87c67ca=\"\">sanctioned<\/a> crypto mixer Tornado Cash — leading to the arrest of Tornado Cash developer Alexey Pertsev.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Parliament","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Council","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Nov. 9","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1040","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Alexey Pertsev","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["EUROPEAN PARLIAMENT","EUROZONE REGULATION"],"authors":["Tom Matsuda","The Block"]}