{"summary":"Ethereum co-founder Vitalik Buterin, reflecting on his crypto journey, said it is time to support a new generation of crypto developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275308\/vitalik-buterin-next-generation","publishDate":"2024-01-31T07:01:55","id":12140,"type":null,"title":"Vitalik Buterin reflects on his role, says &#x27;time for the next generation to take up the mantle&#x27;","category":["PEOPLE"],"content":["In a reflective <a href=\"https:\/\/vitalik.eth.limo\/general\/2024\/01\/31\/end.html\" data-v-f87c67ca=\"\">blog post<\/a><span data-v-f87c67ca=\"\">, <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.16%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Vitalik Buterin discussed the importance of new talent in the crypto space and his evolving role within it.<\/span>","Buterin said one of his most striking memories in recent years was seeing people much younger than him taking on leadership roles in all kinds of projects in the industry. When he was the same age, Buterin recalled being praised as a wunderkind, transforming the world. “Watching all of these people go further than I did, younger than I did, made me clearly realize that if that was ever my role, it is no longer,” Buterin wrote.","Buterin explained his thinking has changed over the last ten years, as has the world around him, involving less crypto-focused economics than it used to and exploring other areas like longevity research.","Following the demise of FTX’s Sam Bankman-Fried, a social media <a href=\"https:\/\/twitter.com\/venturefounder\/status\/1590072787020165121\" data-v-f87c67ca=\"\">post<\/a> also got Buterin thinking about the casualty rate of crypto’s “main characters,” saying it was the moment he realized that most of the people he’d looked up to in the space and could follow in the footsteps of were “no more.”","After U.S. Visa complications prevented an internship at Ripple in 2013, Buterin focused on his work at Bitcoin Magazine before introducing Ethereum at BTC Miami in 2014. The “social proof” of the reception at his presentation solidified his choice to leave University.","However, most of Buterin's decisions in Ethereum responded to pressure and requests from other people, he said, reflecting on accepting an invite to meet Vladimir Putin in 2017, which he subsequently regretted, realizing that he “no longer had the luxury of sitting back and letting mystical ‘other people’ run the show.” He had responsibilities and needed to be intentional about how he operated.","“I was one of the mystical other people, and it was up to me to play the part. If I do not, and the crypto space either stagnates or becomes dominated by opportunistic money-grabbers more than it otherwise would have as a result, I have only myself to blame,” he said. “And so I decided to become careful in which of others' plans I go along with, and more high-agency in what plans I craft myself.”","But ultimately, Buterin now believes it’s time to support the next wave of developers and thinkers, “I am now in some different kind of role, and it is time for the next generation to take up the mantle that used to be mine,” he said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Vladimir Putin","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Buterin","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"University","content":"ORGANIZATION"},{"type":"-1.16%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Buterin","content":"PERSON"},{"type":"Bitcoin Magazine","content":"ORGANIZATION"},{"type":"last ten years","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","VITALIK BUTERIN"],"authors":["James Hunt","The Block"]}