{"summary":"The integration allows Zcash wallet developers to implement Nym’s privacy features, supported by a $150,000 community grant from Zcash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277290\/nym-receives-150000-grant-to-integrate-its-mixnet-with-zcash","publishDate":"2024-02-13T08:30:04","id":12149,"type":null,"title":"Nym receives $150,000 grant to integrate its mixnet with Zcash","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Privacy-focused project <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nym <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/257065\/nym-nym-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/NYM_Token.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">NYM<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.51%\n    <\/span><\/a> <!----><\/span><\/span> is incorporating its mixnet technology into the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Zcash <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248496\/zcash-zec-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/circle-zcash-color.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ZEC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.37%\n    <\/span><\/a> <!----><\/span><\/span> network, in collaboration with Zcash development organization Electric Coin Company. The aim is to enhance privacy protections by addressing the issue of metadata leakage for users.<\/span>","The integration process involves embedding Nym’s mixnet within the Zcash light client libraries developed by the Electric Coin Company. This will enable developers of Zcash wallets to optionally implement the mixnet’s privacy features. Nym has received a $150,000 community grant from Zcash for this.","“I’m extremely pleased to see Nym come to life on the Zcash network. Network-level privacy has been a missing piece since Zcash’s inception,” said Josh Swihart, CEO of Electric Coin Company.","Nym’s team highlighted the pervasive risk of metadata leaks across all online interactions — positioning its mixnet as a solution to protect this type of data from potential surveillance.","Zcash, known for its optional privacy features through an “auto-shielding” function, distinguishes itself from cryptocurrencies such as Bitcoin and Ethereum by complicating the linkage of transactions. Despite these measures, Nym notes that the metadata associated with user transactions remains traceable. Auto-shielding automatically moves funds from a transparent Zcash address to the latest shielded ZEC pool supported by the wallet.","However, should an adversary gain access to a user’s transaction address, they could potentially monitor the user’s wallet activities — including IP measurements — over time, as explained by Nym.","While traditional privacy tools like VPNs and Tor are available, Nym asserts that its mixnet solution provides a more comprehensive approach to safeguarding metadata privacy for cryptocurrency transactions.","Nym’s mixnet technology encrypts user-generated data into packets of identical size, then routes these packets through a network of mix nodes globally at randomized intervals. By incorporating dummy ‘cover’ traffic into this process, the mixnet aims to further obfuscate user data — making the identification of metadata patterns exceedingly difficult, as claimed by Nym.","Such a strategy brings Zcash into alignment with other crypto projects like Monero, Aztec, and Near, that have previously <a href=\"https:\/\/www.theblock.co\/post\/260369\/nym-privacy-protections-near-ecosystem\" data-v-f87c67ca=\"\">collaborated<\/a> with Nym on its mixnet technology.","Recently, privacy-focused cryptocurrencies including Monero and Zcash, have encountered potential delisting threats from centralized exchanges amid regulatory pressures. Notably, Binance has proceeded to <a href=\"https:\/\/www.theblock.co\/post\/276176\/binance-delisting-monero?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">delist<\/a> Monero.","Meanwhile, Nym clarified that its metadata encryption through a VPN-like product is not subject to these same regulatory challenges. “Exchanges are obviously not a big fan of on-chain privacy, and we hope issues can be resolved. Note that as NYM is a transparent token that provides access to a VPN-like service, this is not an issue for the NYM token itself,” said Harry Halpin, co-founder and CEO of Nym.","Nym Technologies raised $13 million in a 2021 funding round led by Andreessen Horowitz (a16z), at a valuation of $270 million.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$150,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nym","content":"ORGANIZATION"},{"type":"NYM","content":"ORGANIZATION"},{"type":"$13 million","content":"MONEY"},{"type":"Zcash development organization Electric Coin Company","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Harry Halpin","content":"PERSON"},{"type":"Monero","content":"PERSON"},{"type":"-0.51%","content":"PERCENT"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$270 million","content":"MONEY"},{"type":"CEO of Electric Coin Company","content":"ORGANIZATION"},{"type":"VPN","content":"ORGANIZATION"},{"type":"Josh Swihart","content":"PERSON"},{"type":"-0.37%","content":"PERCENT"},{"type":"Binance","content":"PERSON"},{"type":"ZEC","content":"ORGANIZATION"},{"type":"Electric Coin Company","content":"ORGANIZATION"}],"hashtag":["PROTOCOLS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}