{"summary":"Friday&#x27;s bitcoin put-call options ratio was a bullish indicator, after $4.5 billion worth of options contracts expired on Deribit.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259818\/bitcoins-put-call-options-ratio-a-bullish-indicator-for-the-market-says-analyst","publishDate":"2023-10-27T13:00:57","id":12153,"type":null,"title":"Bitcoin&#x27;s put-call options ratio a bullish indicator for the market, says analyst","category":["MARKETS"],"content":["\"The put-call ratio was bullish as there were more calls outstanding than puts,\" Strijers told The Block. A put-call options ratio below one indicates that the call volume exceeds the put volume, signifying bullish sentiment in the market. According to data from The Block dashboard, today's put-call ratio on Deribit is 0.49.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-put-call-ratio\/embed\" title=\"BTC Put\/Call Ratio\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Strijers added that an even more important metric was Friday's elevated skew for call prices compared to puts. \"This means calls are relatively more expensive and driven by increased demand, another bullish signal. Finally, we see the basis, difference between futures and spot, increasing as well. This is a signal traders expect the upcoming expiries to settle at higher levels versus spot today, another bullish signal,\" Strijers added.","Options are derivative contracts that give a trader the right but not the obligation to buy or sell the underlying asset at a predetermined price on or before a specific date. A call option gives the right to buy and a put offers the right to sell. It is assumed that a trader who buys call options is implicitly bullish on the market, while a put buyer is bearish.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}