{"summary":"The basketball great called for the dismissal of the lawsuit against him after having eluded servers for weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229987\/shaquille-never-served-ftx-lawsuit","publishDate":"2023-05-09T12:38:32","id":12155,"type":null,"title":"Shaq says he wasn&#x27;t served in FTX case despite claims from lawyer","category":["POLICY"],"content":["Shaquille O'Neal was so difficult to serve that class action attorney Adam Moskowitz <a href=\"https:\/\/www.theblock.co\/post\/226583\/shaq-served-ftx-class-action\" data-v-f87c67ca=\"\">celebrated<\/a> in April when he finally gave the NBA star official notice that he was a target of a lawsuit against FTX promoters — or so he thought.&nbsp;","Weeks later, O’Neal now claims he was never actually served. Process servers tossed papers at O’Neal’s moving car, he said in a court filing, but never succeeded in actually serving him. The basketball legend is asking a court to dismiss the lawsuit.","\"This purported ‘service’ is inadequate,” <a href=\"https:\/\/ecf.flsd.uscourts.gov\/doc1\/051025963229?caseid=623680\" data-v-f87c67ca=\"\">O'Neal's lawyers said in a court filing<\/a>. “It should be quashed, and the claims against Mr. O’Neal dismissed.”","O’Neal is one of more than a dozen celebrities and sports figures being sued for promoting FTX, the now-bankrupt crypto exchange. Targets of the lawsuit, which was filed by an Oklahoma man who says he is an FTX customer include promoters like Tom Brady and Steph Curry.","Although O’Neal appears regularly on television, hosts a podcast and is a touring DJ, lawyers <a href=\"https:\/\/www.theblock.co\/post\/226496\/shaquille-oneal-crypto-ftx-lawsuit\" data-v-f87c67ca=\"\">struggled to serve him<\/a> with official notice that he was the target of a lawsuit.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","According to Moskowitz, process servers “personally” gave O’Neal notice of the FTX class action lawsuit outside of his Atlanta home in April. But O’Neal’s lawyers, who did not immediately respond to a request for comment, said in court documents that the papers never made it into his hands.&nbsp;","“Two process servers — neither of whom is registered in Georgia — saw Mr. O’Neal driving his car out of his residence. They crowded the road outside the double residential gate to his property, making it so he had to drive by both of them to leave his home, and then stepped outside their cars,” O’Neal’s lawyers said in court documents. “Mr. O’Neal — who never exited his car — drove past the strangers lurking outside his home, one of the process servers ‘tossed the legal documents at the front of’ his car.”","O'Neal's lawyers said in a court filing that he was never properly served.","Moskowitz, the class action lawyer, disputed O'Neal's account. He said the exchange was captured on video and went as far as to suggest O'Neal tried to \"possibly injure\" the process server in an email to The Block on Tuesday.","\"It is really disappointing and surreal. The video will show Mr. O’Neal finally being served, after many months of hiding, as he attempts to possibly injure the process server. We expected better from an officer of the law,\" Moskowitz said, referencing O'Neal's role as an <a href=\"https:\/\/www.orlandosentinel.com\/2019\/03\/18\/florida-sheriffs-office-adds-shaq-as-auxiliary-deputy\/\" data-v-f87c67ca=\"\">auxillary deputy sheriff<\/a>. \"Mr. O’Neal and his lawyers need to stop running and finally deal with these serious allegations.\"","It’s not clear whether O’Neal has video footage of the incident, as Moskowitz claims, or if he plans to release it.","This latest wrinkle in the FTX class action suit comes after a dramatic, months long effort to serve O'Neal. At one point, a process server apparently gave up on trying to serve O'Neal after receiving a threatening text message. It is not clear who sent the message.","In O'Neal's view, process servers did not give him official notice of the lawsuit before an April deadline and the case against him should be dismissed. The lawsuit was filed in the U.S. District Court<span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;for the&nbsp;<\/span>Southern District<span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;of&nbsp;<\/span>Florida<span class=\"s3\" data-v-f87c67ca=\"\">.<\/span>","“Plaintiffs have had months and multiple tries. Mr. O’Neal has not evaded service by failing to be at the residences where plaintiffs belatedly attempted service or by driving past strangers who approached his car,” O’Neal’s lawyers told the court.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NBA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"O’Neal","content":"PERSON"},{"type":"Georgia","content":"LOCATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Adam Moskowitz","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tom Brady","content":"PERSON"},{"type":"the&nbsp;<\/span>Southern District<span class=\"s3\" data-v-f87c67ca=\"\">&nbsp;of&nbsp;<\/span>Florida","content":"ORGANIZATION"},{"type":"O'Neal","content":"PERSON"},{"type":"Moskowitz","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Steph Curry","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Atlanta","content":"LOCATION"},{"type":"Oklahoma","content":"LOCATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}