{"summary":"Coinbase will take requests to unstake ETH 24 hours after Shanghai-Capella update, but requests must be processed on-chain to be finalized.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220259\/coinbase-to-process-eth-unstaking-requests-24-hours-after-shanghai-update","publishDate":"2023-03-15T14:13:21","id":12162,"type":null,"title":"Coinbase to process ETH unstaking requests 24 hours after Shanghai update","category":["EXCHANGES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase will begin to take unstaking requests around 24 hours after the Shanghai-Capella upgrade to the Ethereum network that will allow users to unstake ETH goes live, the exchange <a href=\"https:\/\/twitter.com\/coinbase\/status\/1636047279793528833?s=20\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">said<\/span><\/a> on Twitter.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">However, that doesn’t mean users will be able to unstake their ETH right away because “the Ethereum protocol controls the unstaking process and we’re simply the conduit,” Coinbase, said, adding “we can’t share an exact waiting period when you request to unstake.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase currently provides a 6.0% APY return on staked ETH.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Once unstaking requests are processed on-chain and released by the Ethereum protocol, Coinbase confirmed users will receive all their staked ETH, in addition to staking rewards accrued.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">While Coinbase will process withdrawal requests just a day after the Ethereum Shanghai-Capella update, staking platform Lido said it will <a href=\"https:\/\/www.theblock.pro\/news\/post\/220027\/lido-finance-expects-it-will-support-staked-ether-withdrawals-by-mid-may\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">wait<\/span><\/a> until mid-May to initiate staked ETH withdrawals following the completion of on-chain code audits to ensure user safety.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"6.0%","content":"PERCENT"},{"type":"Lido","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}