{"summary":"Namada will launch an incentivized testnet offering 3% of its token supply as rewards.\nThe testnet includes an “asteroid mining race” where participants accumulate ROIDs to win part of 30 million NAM tokens.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267807\/cosmos-layer-1-namada-token-testnet-users","publishDate":"2023-12-15T09:00:02","id":1216,"type":null,"title":"Namada allocates 3% of token supply to incentivized testnet users","category":["Layer 1s"],"content":["Privacy-focused Layer 1 blockchain Namada will launch an incentivized testnet that will reward participants with 3% of its total supply.","Dubbed the \"Namada Shielded Expedition,\" the testnet campaign is a multiplayer role-playing game launching ahead of the privacy protocol’s mainnet rollout in early 2024.","Namada’s testnet will let participants (validators and users) join a competitive game to test the network for its consensus (CometBFT) algorithm and Sybil resistance. The goal is to enable participants to utilize Namada’s features, supporting asset-agnostic privacy, ahead of its mainnet release.","Participants will compete in an “asteroid mining race,” where testnet participants will be ranked by the number of ROIDs (points) they accumulate. A total of 30 million NAM (3% of the one billion total supply) tokens will be distributed to those who succeed in the game. The Namada testnet commences on Jan. 15 and will run until the end of the month.","The testnet incentives were revealed a week after Namada <a href=\"https:\/\/twitter.com\/namada\/status\/1732787047486935059\" data-v-f87c67ca=\"\">unveiled<\/a> a community airdrop, allocating 65 million (6.5% of the total supply) to researchers, developers and stakers on Cosmos Hub and Osmosis blockchains.","Namada is a proof-of-stake Layer-1 blockchain protocol developed by the Anoma Foundation that is planned to launch in the first quarter of 2024. As part of the <a href=\"https:\/\/www.theblock.co\/learn\/249525\/what-is-cosmos-and-how-does-it-work-a-beginners-guide-to-atom-cryptocurrency\" data-v-f87c67ca=\"\">Cosmos ecosystem<\/a>, the network aims to enable asset-agnostic multichain privacy using zero-knowledge proofs for transferring assets across different blockchains.","The network also features a native Ethereum bridge for asset movement across networks. In May 2023, the Anoma Foundation secured $25 million in funding to develop its ecosystem, which includes Namada."],"hashtag":["COSMOS","VALIDATORS"]}