{"summary":"Investment management giant Franklin Templeton expanded its OnChain U.S. Government Money Fund to the Polygon blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228445\/franklin-templeton-fund-polygon","publishDate":"2023-04-26T14:00:04","id":12171,"type":null,"title":"Franklin Templeton expands its onchain money market fund to Polygon","category":["COMPANIES"],"content":["Franklin Templeton, an investment management giant with about $1.4 trillion in assets under management, has expanded its OnChain U.S. Government Money Fund to the Polygon blockchain.","Launched in 2021, the fund was first available on the Stellar blockchain. Polygon is the second blockchain the fund is supporting, a <a href=\"https:\/\/www.theblock.co\/post\/168032\/franklin-templeton-launches-metaverse-etf-for-european-investors\" data-v-f87c67ca=\"\">Franklin Templeton<\/a> spokesperson told The Block, adding that more networks could be supported in the future.","\"Extending the reach of the Franklin OnChain U.S. Government Money Fund to Polygon enables the Fund to be further compatible with the rest of the digital ecosystem, specifically through an Ethereum-based blockchain,\" Roger Bayston, head of digital assets at Franklin Templeton, said in a statement. \"This furthers our distribution reach through a Layer 2 (L2) blockchain that has a proven track record.\"","<a href=\"https:\/\/www.franklintempleton.com\/investments\/options\/money-market-funds\/products\/29386\/SINGLCLASS\/franklin-on-chain-u-s-government-money-fund\/FOBXX#documents\" data-v-f87c67ca=\"\">FOBXX<\/a> is the first U.S.-registered mutual fund that uses a public blockchain to process transactions and record share ownership. The fund’s transfer agent, Franklin Templeton Investor Services, maintains the official record of share ownership via a proprietary blockchain-integrated system.","Given the 24\/7 nature of blockchains, the fund is available to trade at any time. It is available via Franklin's Benji Investments app and currently <a href=\"https:\/\/www.stellar.org\/press-releases\/franklin-templeton-announces-the-franklin-onchain-u-s-government-money-fund-surpasses-270-million-in-assets-under-management\" data-v-f87c67ca=\"\">has an AUM of over $270 million<\/a>.","Stellar Development Foundation, a nonprofit organization supporting the Stellar blockchain, recently <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-04-24\/franklin-templeton-says-money-market-fund-fobxx-is-attracting-crypto-assets\" data-v-f87c67ca=\"\">invested $20 million in the fund<\/a>. Polygon Labs declined to comment when asked if it has also invested in the fund.","Given it is a money market fund, the fund invests at least 99.5% of its total assets in U.S. government securities, cash and repurchase agreements collateralized fully by U.S. government securities or cash, according to its website. The fund seeks to provide a competitive yield and maintain a stable $1 share price.","As with all other mutual funds, an investment in the Franklin OnChain U.S. Government Money Fund is not insured or guaranteed by the Federal Deposit Insurance Corporation or any other government agency.","Using blockchain technology has helped the fund with operational efficiencies, including increased security, faster transaction processing and reduced costs, ultimately benefiting the fund's shareholders, according to Franklin Templeton. One share of the fund is represented by one BENJI token.","Ethereum-scaling platform Polygon continues to grow. Tens of thousands of decentralized applications utilize the blockchain, which has processed over 2.35 billion total transactions to date. The Polygon network supports some of the biggest web3 projects including Uniswap and OpenSea, as well as enterprises including Robinhood, Stripe and Adobe.","Earlier today, The Block reported that Solana wallet <a href=\"https:\/\/www.theblock.co\/post\/228320\/solana-wallet-phantom-multichain-ethereum-polygon\" data-v-f87c67ca=\"\">Phantom is expanding to Polygon<\/a> and that <a href=\"https:\/\/www.theblock.co\/post\/228372\/binanceus-domain-name-unstoppable-domains-binance-polygon\" data-v-f87c67ca=\"\">Binance.US is set to launch branded web3 domain names on Polygon<\/a> in the coming weeks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"$1.4 trillion","content":"MONEY"},{"type":"Roger Bayston","content":"PERSON"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Franklin Templeton Investor Services","content":"ORGANIZATION"},{"type":"Benji Investments","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"Stellar Development Foundation","content":"ORGANIZATION"},{"type":"Franklin","content":"PERSON"},{"type":"$270 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Franklin OnChain","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"99.5%","content":"PERCENT"}],"hashtag":["ASSETS","POLYGON"],"authors":["Yogita Khatri","The Block"]}