{"summary":"Wall Street appears to be losing faith in Coinbase, a development that comes as the US crypto exchange undertakes a raft of cost-cutting measures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150179\/coinbase-pumped-the-brakes-on-hiring-as-wall-streets-love-affair-cooled","publishDate":"2022-06-05T11:53:01","id":12177,"type":null,"title":"Coinbase pumped the brakes on hiring as Wall Street&#x27;s love affair cooled","category":["EXCHANGES"],"content":["\"I just got an email today saying my offer had been rescinded ... due to a massive hiring plan change at Coinbase.\"","That's Ashutosh Ukey, who is among the tech industry workers who saw their hopes to work at one of the biggest digital asset exchanges dashed after Coinbase rescinded outstanding offers as part of an effort to scale back hiring.","On May 16, Coinbase <a href=\"https:\/\/blog.coinbase.com\/employee-note-an-update-on-hiring-plans-507ea4e2b6cf\" data-v-f87c67ca=\"\">said<\/a> that it would slow hiring in response to an ongoing market slowdown. Then, last week. the company <a href=\"https:\/\/www.cnbc.com\/2022\/06\/02\/coinbase-hiring-pause-for-foreseeable-future-and-will-rescind-offers.html\" data-v-f87c67ca=\"\">said<\/a> that it would rescind some offers and extend a hiring pause for the \"foreseeable future.\"","\"This was devastating to me,\" Ukey, a machine learning programmer, wrote on LinkedIn.&nbsp;","The decision to rescind offers triggered speculation about the reasons behind Coinbase's cost-cutting measures. And yet it's far more likely that these moves are a direct response to Wall Street prognostication than any other sort of exogenous factor tied to the so-called crypto winter.&nbsp;","Previously, market research analysts covering Coinbase's stock appeared to stick by the firm despite its dwindling stock price.","But in recent months, banks slashed their price targets, with the average price target collapsing from $279 on the week of April 22 to $145 as of the time of writing, according to The Block Research. That last figure represents a 96% premium over the current fair market price.&nbsp;","<em data-v-f87c67ca=\"\">Source: The Block Research, Factset<\/em>","A reduction in corporate spend — total operating expense weighed in at $1.7 billion during Q1 2022 — could help win back analysts who have highlighted expenses in earnings calls.","\"Operating expenses came in higher than expected as COIN's hiring was robust, growing headcount 33% in Q1,\" a May 10 analyst note from Bank of America Global Research laid out.&nbsp;","Adjusted EBITDA — a measure of a public company's financial performance — came in at just $20 million, well below Wall Street's estimate of $448 million.&nbsp;","As for hiring itself, Will Nance of Goldman Sachs described the 1,200 hires in the first quarter as a strikingly \"large\" figure <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2022\/q1\/Coinbase-Q1'22-Earnings-Call-Transcript.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">during the exchange's Q1 earnings call<\/a>. In response, Coinbase CFO Alesia Haas said that slowing hiring was one lever at the firm's disposal to cut expenses.&nbsp;","To be sure, not every analyst is hung up on cost. In an interview with The Block, BTIG Mark Palmer said that focus on adjusted EBITDA is \"misguided,\" adding that Coinbase — despite its large footprint in crypto — is still a \"work in progress.\"","\"What you really want to see if you are an investor in a company at this stage, a growth company, that is in a competitive environment ... you want to see investment, you want to see that spending,\" he said.&nbsp;","Still, while Coinbase's cost-cutting will have a clear impact on the bottom line, there is also a more intangible cost to pulling back offers from would-be employees. Emails made public indicate that Coinbase initially told incoming staffers that their jobs would be safe.","In an email obtained by Blind, a pseudonymity-focused social network for professionals, and shared with The Block, the company said it had a plan for \"market volatility\" and would not be \"rescinding the offers of any employees who have already signed or have received an offer from us.\"","Internally, employees are concerned about the reputation backlash of the move and burned relationships. Several sources have told The Block that Coinbase remains understaffed despite its hiring efforts in the past year and employees are overworked within what is known to be a fast-moving and intense culture.","\"We have an intense work culture, and are regularly pushed out of our comfort zones,\" LJ Brock, the firm's chief people officer, has <a href=\"https:\/\/blog.coinbase.com\/working-at-coinbase-intense-and-demanding-balanced-by-deliberate-recharge-time-a5235b9fa920\" data-v-f87c67ca=\"\">noted<\/a> in the past.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brock","content":"PERSON"},{"type":"May 16","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"$279","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"April 22","content":"DATE"},{"type":"Will Nance of Goldman Sachs","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"96%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Bank of America Global Research","content":"ORGANIZATION"},{"type":"Coinbase CFO Alesia Haas","content":"PERSON"},{"type":"$448 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"Mark Palmer","content":"PERSON"},{"type":"$145","content":"MONEY"},{"type":"Ashutosh Ukey","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"May 10","content":"DATE"},{"type":"Factset","content":"ORGANIZATION"}],"hashtag":["COINBASE","HIRING"],"authors":["Frank Chaparro","The Block"]}