{"summary":"Here&#x27;s the full translation of the eight measures proposed by the Inner Mongolia Development and Reform Committion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/105973\/china-inner-mongolia-crypto-bitcoin-mining-ban-measures","publishDate":"2021-05-25T11:15:08","id":12179,"type":null,"title":"China&#x27;s Inner Mongolia set to impose eight measures on crypto mining ban","category":["CHINA"],"content":["The government of China's Inner Mongolia region has proposed eight new measures to phase out crypto mining activities.","The Inner Mongolia Development and Reformation Commission (DRC) <a href=\"https:\/\/mp.weixin.qq.com\/s\/rI-Uiu1BKWEAGLJJ0x4cPg\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">issued a proposal on Tuesday<\/a> that outlined eight areas that could be deemed as illegal that relate to crypto mining activities. It is the first, more concrete proposal to emerge four days after <a href=\"https:\/\/www.theblockcrypto.com\/post\/105708\/china-bitcoin-crackdown-usdt-otc\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a Chinese State Council committee<\/a> raised the subject of a bitcoin trading and mining crackdown during a recent meeting.","The proposal is now set to go through a public consultation process that will last until June 1 before it takes effect. The proposed measures target not only crypto mining facilities in the region that mostly use fossil fuels but also power stations that supply energy to such operations. Internet cafes that may have been using idle computers to mine cryptocurrencies are also included.","In addition, any enterprise or individual using cryptocurrency for money laundering or fundraising activities in the region could also be liable for a criminal offense. According to the published proposal, any corporation or individual found engaging in crypto mining activities could also put into China's Social Credit Dishonesty List, which would bar them from social activities such as getting banked, booking air or train tickets, etc.","The latest measure comes as the Inner Mongolia government <a href=\"https:\/\/www.theblockcrypto.com\/linked\/105290\/china-inner-mongolia-report-bitcoin-mining\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">is stepping up efforts<\/a> to meet China's carbon neutrality goal, as The Block reported previously. In March, the local government already <a href=\"https:\/\/www.theblockcrypto.com\/linked\/96591\/chinas-inner-mongolia-seeks-to-shut-crypto-mining-farms-in-new-proposal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">released<\/a> a plan to shut down crypto mining activities in the region but the latest proposal intensifies such efforts with additional and specified legal liabilities for any individual or corporate that fails to comply. Since then, local miners there have already started to relocate their operations elsewhere in the country or overseas.","It remains to be seen if other main crypto mining provinces, especially Sichuan and Yunnan – where the energy is mostly based on hydro-electricity – would follow the Inner Mongolia's measure.","Below is the full translation of the eight proposed measures:","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Inner Mongolia Development","content":"ORGANIZATION"},{"type":"June 1","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Sichuan","content":"LOCATION"},{"type":"Reformation Commission (DRC","content":"ORGANIZATION"},{"type":"Mongolia","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"Chinese State Council","content":"ORGANIZATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}