{"summary":"The RaaS aims to provide dapps with the infrastructure required to deploy Layer 2 networks on the BNB Smart Chain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282442\/bnb-chain-layer-2-rollups-as-a-service","publishDate":"2024-03-14T06:01:06","id":12172,"type":null,"title":"BNB Chain introduces rollup-as-a-service solution to expand its Layer 2 ecosystem","category":["LAYER 2S AND SCALING"],"content":["BNB Chain has unveiled a rollup-as-a-service (RaaS) solution to enable the expansion of custom Layer 2 networks in its ecosystem.","The RaaS will provide dapp projects with the infrastructure required to build cost-effective dedicated rollups on the BNB Smart Chain (BSC), including no-code deployment options.","BSC is the third-largest blockchain by total value locked, with $6.1 billion in TVL compared to Ethereum’s $56.7 billion and Tron’s $10.5 billion, according to DeFiLlama <a href=\"https:\/\/defillama.com\/chains\" data-v-f87c67ca=\"\">data<\/a>.","“By combining the power of RaaS and the interconnectivity capabilities of our ecosystem, developers will have a comprehensive toolkit to build efficient and scalable Layer 2s on BSC,” the BNB Chain core development team said in a statement.","The <a href=\"https:\/\/www.theblock.co\/learn\/249523\/what-is-bnb-chain-and-how-does-it-work-a-beginners-guide-to-bnb-cryptocurrency?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">BNB Chain<\/a> ecosystem includes five distinct networks: BSC, a Layer 1 blockchain compatible with the Ethereum Virtual Machine; existing Layer 2 solutions <a href=\"https:\/\/www.theblock.co\/post\/250659\/bnb-chain-opbnb-mainnet\" data-v-f87c67ca=\"\">opBNB<\/a> and zkBNB; the data storage network BNB Greenfield; and the BNB Beacon Chain — though this is set to be <a href=\"https:\/\/www.bnbchain.org\/en\/blog\/bep2-bep8-asset-sunset-announcement\" data-v-f87c67ca=\"\">phased out<\/a> with its functionality migrated to BSC.","Layer 2s built on BSC network are connected via opBNB Connect — designed to facilitate interoperability within the ecosystem as part of its “One BNB” initiative to address the need for an integrated tech stack.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$56.7 billion","content":"MONEY"},{"type":"BNB Greenfield","content":"ORGANIZATION"},{"type":"$10.5 billion","content":"MONEY"},{"type":"$6.1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BSC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"}],"hashtag":["BNB CHAIN","ROLLUPS"],"authors":["James Hunt","The Block"]}