{"summary":"The economic crime plan points to goals such as cutting fraud, recovering criminal assets and driving down sanctions evasion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224054\/uk-economic-crime-plan-crypto-regulation","publishDate":"2023-03-30T11:38:05","id":12170,"type":null,"title":"UK economic crime plan looks to tighten grip on crypto kleptocrats and fraudsters","category":["POLICY"],"content":["The UK Treasury and Home Office plan to tighten their grip on crypto money launderers and kleptocrats, according to the latest three-year Economic Crime Plan published on Thursday.&nbsp;","\"The government will set out ambitious plans to protect consumers and grow the economy by robustly regulating cryptoasset activities – providing confidence and clarity to consumers and businesses alike,\" the <a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/1147515\/6.8300_HO_Economic_Crime_Plan_2_v6_Web.pdf\" data-v-f87c67ca=\"\">policy paper<\/a> reads, adding that this is in order to make the UK \"an attractive destination for cryptoassets and cryptoasset innovation in the world.\"","As part of this, the UK expects criminals will use less-regulated crypto exchanges and services in the future, requiring more coordinated law enforcement action between countries. The Financial Conduct Authority (FCA) is already working closely with international counterparts on a \"bilateral basis\" to exchange information.","The plan points to goals such as cutting fraud, reducing money laundering, recovering criminal assets, combatting kleptocracy and driving down sanctions evasion.","It also outlines the agencies which will be responsible for overseeing these, including the Treasury, Home Office, trade body CryptoUK, the Crown Prosecution Service and HMRC.&nbsp;","Based on estimates of UK transaction volumes, illicit cryptoasset transactions linked to the UK in 2021 likely equated to at least £1.24 billion ($1.5 billion), or about 1% of total transaction value, with a possibility they were significantly higher, the National Crime Agency found.&nbsp;","The economic crime plan follows the NCA's <a href=\"https:\/\/www.theblock.co\/post\/199096\/uk-crime-agency-crypto-investigations-new-unit\" data-v-f87c67ca=\"\">creation<\/a> of a \"crypto cell\" as it kicked off the recruitment of a group of law enforcement officers specifically focused on digital assets.","<em data-v-f87c67ca=\"\">With reporting by Stephanie Murray.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NCA","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"1.24 billion ($1.5 billion","content":"MONEY"},{"type":"Stephanie Murray","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crown Prosecution Service","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Home Office","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"National Crime Agency","content":"ORGANIZATION"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"}],"hashtag":["ANTI-MONEY LAUNDERING","CRIME","FCA","UK PARLIAMENT"],"authors":["Lucy Harley-McKeown","The Block"]}