{"summary":"LayerZero announced that former SushiSwap leader 0xMaki will be joining the project to lead business development.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137850\/layerzero-gears-up-for-launch-of-cross-chain-protocol-stargate","publishDate":"2022-03-15T09:00:06","id":12188,"type":null,"title":"LayerZero gears up for launch of cross-chain protocol Stargate","category":["CRYPTO ECOSYSTEMS"],"content":["Interoperability protocol LayerZero is preparing to launch Stargate, a protocol for swapping tokens across different blockchains.","According to a <a href=\"https:\/\/medium.com\/layerzero-official\/the-omnichain-future-is-here-74389f6d70c3\" data-v-f87c67ca=\"\">Medium post<\/a>, Stargate will go live following the conclusion of a token sale that starts on March 17. The purpose of the token sale is to generate liquidity across the seven blockchains that Stargate is launching on.","The team has also brought onboard Maki, the co-founder of SushiSwap, to lead business development. 0xMaki took over the decentralized exchange in 2020 before stepping down toward the end of last year.","“We couldn't be any more thrilled to announce 0xMaki joining the team full time. He's been an invaluable resource and we're extremely excited to be building the future of omni-chain messaging with him,” LayerZero Labs CEO Bryan Pellegrino told The Block.&nbsp;&nbsp;","The Stargate protocol is an application created on top of the LayerZero protocol, which aims to enable the transfer of funds between several blockchains. Once launched, it will compete with existing multichain bridge projects, such as Hop Protocol, Connext, Multichain, and Synapse.&nbsp;","The team touted Stargate as the first to solve <a href=\"https:\/\/medium.com\/stargate-official\/the-bridging-trilemma-d80788cce4ef\" data-v-f87c67ca=\"\">“the bridging trilemma”<\/a> —&nbsp;a triple set of properties that, according to the team, makes any multichain bridge ideal for usage. These properties include unified liquidity pools between chains, instant guaranteed finality of transactions, and the use of native assets for cross-chain swaps.&nbsp;","“Solving the bridging trilemma enables true composability in bridging that has never been possible before,” said Pellegrino.","Stargate aims to make it easier to transfer assets from one blockchain to another one in a single transaction, bypassing the need for using varying and lengthy steps involving locking, minting and burning, and redeeming assets.&nbsp;","Stargate will go live on seven chains compatible with the Ethereum Virtual Machine (EVM), including Ethereum, Avalanche, Polygon, BSC, Fantom, Arbitrum and Optimism, shortly after the token sale. In the coming months, the team plans to add support for other chains like Solana, Terra, Cosmos Hub and Osmosis.","Ahead of the launch, LayerZero is opening up a public sale of native tokens on the Stargate bridge.","LayerZero is auctioning off 10% of the total token supply of stargate tokens (STG), some 100 million tokens, which will be sold in an auction using a bonding curve. The auction plans on raising $25 million in USDC from the public, at a maximum price of $0.25 per token.","The token sale will end once traders have purchased $25 million in USDC or after 48 hours have gone by — whichever comes first.","The $25 million raised will be paired with 50 million STG tokens and placed into a pool on the decentralized exchange Curve. It will open for swaps at $0.50 per STG token.","The 100 million stargate tokens sold during the auction will be frozen for up to a year followed by another six months of linear vesting.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Connext","content":"ORGANIZATION"},{"type":"Maki","content":"PERSON"},{"type":"Stargate","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Multichain","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"50 million STG","content":"MONEY"},{"type":"March 17","content":"DATE"},{"type":"$0.50 per STG","content":"MONEY"},{"type":"Fantom","content":"PERSON"},{"type":"$0.25","content":"MONEY"},{"type":"Pellegrino","content":"PERSON"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Bryan Pellegrino","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}