{"summary":"Taiwan’s FSC today published its highly anticipated guidelines as it looks to step up oversight of the industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252915\/taiwan-releases-guidelines-for-crypto-exchanges-restricts-offshore-exchanges-unless-compliant","publishDate":"2023-09-26T05:25:39","id":12189,"type":null,"title":"Taiwan releases guidelines for crypto exchanges, restricts offshore exchanges unless compliant","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Taiwan’s financial watchdog today announced a set of guidelines for virtual asset services providers <\/span><span data-v-f87c67ca=\"\">(VASPs) <\/span><span data-v-f87c67ca=\"\">that places great emphasis on customer protection.<\/span>","<span data-v-f87c67ca=\"\">Under the new guidelines,<\/span><span data-v-f87c67ca=\"\"> domestic crypto platforms must ensure the separation and custody of companies’ and customers’ assets, establish review standards for virtual asset listing and delisting, and strengthen information disclosure, the Financial Supervisory Commission said in a <a href=\"https:\/\/www.fsc.gov.tw\/ch\/home.jsp?id=96&amp;parentpath=0,2&amp;mcustomize=news_view.jsp&amp;dataserno=202309260005&amp;dtable=News\" data-v-f87c67ca=\"\">statement<\/a>.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The latest guidelines specified that offshore exchanges that seek to operate in Taiwan must register with the FSC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Foreign virtual asset platform operators that have not registered under the company laws and have not declared compliance with anti-money laundering regulations to the FSC may not solicit business within Taiwan or target Taiwanese nationals,” the guidelines said. The Block reported last month that Binance, the world’s largest crypto exchange, is <\/span><a href=\"https:\/\/www.theblock.co\/post\/244320\/binance-is-applying-to-get-registered-in-taiwan-for-aml-compliance-sources\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">applying to get registered in Taiwan for AML compliance<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The FSC also pointed out that crypto platforms are “not allowed to engage in operations involving derivative financial product transactions with virtual assets as underlying assets or virtual asset businesses with securities-like characteristics.”<\/span>","<span data-v-f87c67ca=\"\">Previously, Taiwan has required (VASPs) to comply with anti-money laundering laws since the FSC <\/span><a href=\"https:\/\/law.fsc.gov.tw\/LawContent.aspx?id=GL003218&amp;kw=%e8%99%9b%e6%93%ac%e9%80%9a%e8%b2%a8%e5%b9%b3%e5%8f%b0%e5%8f%8a%e4%ba%a4%e6%98%93%e6%a5%ad%e5%8b%99%e4%ba%8b%e6%a5%ad%e9%98%b2%e5%88%b6%e6%b4%97%e9%8c%a2%e5%8f%8a%e6%89%93%e6%93%8a%e8%b3%87%e6%81%90%e8%be%a6%e6%b3%95\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">introduced<\/span><\/a><span data-v-f87c67ca=\"\"> anti-money laundering rules in July 2021.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Following the official release of the FSC’s guidelines, crypto platforms in Taiwan are expected to form an industry association and come up with self-supervisory rules based on the guidelines.<\/span>","<span data-v-f87c67ca=\"\">Currently, nine crypto exchanges in Taiwan have <\/span><a href=\"https:\/\/www.theblock.co\/post\/252884\/taiwans-crypto-industry-prepares-to-form-association-ahead-of-new-regulation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">set up a working group<\/span><\/a><span data-v-f87c67ca=\"\"> in preparation for the establishment of a crypto industry association, aiming to submit an application for an association in mid-October.<\/span>","<span data-v-f87c67ca=\"\">The working group currently consists of nine firms, including major exchanges in Taiwan such as MaiCoin, BitoGroup and ACE. Winston Hsiao, XREX’s cofounder and Group CRO, serves as the working group convener, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">Wayne Huang, co-founder and Group CEO of Taipei-based crypto exchange XREX, told The Block that the FSC’s new guidelines could “give birth to a new industry, providing this new industry legitimacy, oversight, a solid path to grow, and an accelerated means to acquire public trust.”<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wayne Huang","content":"PERSON"},{"type":"mid-October","content":"DATE"},{"type":"Group CRO","content":"ORGANIZATION"},{"type":"FSC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Supervisory Commission","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Taiwan","content":"LOCATION"},{"type":"Taipei","content":"LOCATION"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}