{"summary":"Three attorneys offer their take on SEC commissioner Hester Peirce&#x27;s token safe harbor proposal and why modified a Reg A may offer a solution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57207\/case-for-reg-a-response-commissioner-peirce-sec-token","publishDate":"2020-02-28T11:16:15","id":12186,"type":null,"title":"The case for Reg A: a response to Commissioner Peirce","category":["REGULATION"],"content":["<em data-v-f87c67ca=\"\">Zachary Fallon, James Blakemore, and Josh Garcia are attorneys who lead&nbsp;<span class=\"il\" data-v-f87c67ca=\"\">Ketsal<\/span>, a strategic advisory firm focused on fintech compliance, as well as an associated law firm.<\/em>","Earlier this month, SEC Commissioner Hester Peirce announced a proposed three-year safe harbor from the application of specific securities laws for token issuers developing decentralized networks.","Commissioner Peirce’s <a href=\"https:\/\/www.sec.gov\/news\/speech\/peirce-remarks-blockress-2020-02-06\" data-v-f87c67ca=\"\">Token Safe Harbor Proposal<\/a> (the \"Proposal\") has already generated a good deal of helpful discussion of both the Proposal itself and the U.S. federal securities laws (the \"Securities Laws\") generally. We welcome the Proposal and appreciate its focus on cryptocurrency specific issues. As legal professionals with the expertise and interest to advise this space, we are all too familiar with the issues raised by the Proposal. We also appreciate the need for <a href=\"https:\/\/www.coindesk.com\/the-cost-of-not-engaging-regulators\" data-v-f87c67ca=\"\">greater dialogue<\/a>, as it may ultimately lead to an effective regulatory solution.","To be clear, the goal of the Proposal is laudable. And, like a gavel, we hope it will be an effective call to order. When the gallery din fades, however, we believe taking a scalpel, not a sword, to existing regulations will best achieve many of the Commissioner’s policy objectives. The Proposal is a useful starting place for the regulatory discussion, but in reality, its scope is too sweeping to have any meaningful chance at adoption.","Yet, all is not lost. The Securities Laws already include an exemption for primary offerings that meets many of the Commissioner’s objectives. <a href=\"https:\/\/medium.com\/ketsal-consulting\/the-reg-a-gambit-8c739c8cad9a\" data-v-f87c67ca=\"\">Regulation A<\/a> (“Reg A”) provides decentralized network creators with the ability to publicly raise up to $50 million annually from an unrestricted pool of future network participants through the sale of tokens (or rights to tokens) that, at least for some initial period of time, would be considered securities. Proposal advocates will have more in success obtaining a desirable regulatory outcome by embracing the existing framework. This would include suggesting, as needed, relatively minor, yet impactful, tweaks to Reg A that can further achieve the Commissioner’s stated goals. In so doing, market participants could pivot attention and focus energy on solving secondary market issues.","When it comes to primary offerings, we see no need to reinvent the regulatory wheel; better, perhaps, to remold some of its treads.","Conveniently, the SEC is currently <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2019-97\" data-v-f87c67ca=\"\">considering input<\/a> from the public on ways to improve its exempt offering framework(s), including Reg A. It follows that there will also likely soon be an actual proposal on these issues—one the SEC will eventually adopt in some form—which makes input here all the more important. The Commissioner may even have factored that regulatory momentum into her decision to release the Proposal now.","The conversation around the Proposal presents a perfect opportunity for the crypto community to focus its energies on obtainable reforms via time-tested channels.","From the early days of crypto, a central question for regulators has been whether the technology is so unlike anything that proceeded it that it requires its own legal regime, or whether existing laws will do just fine, thank you. This type of debate is common to technological innovations, and <a href=\"https:\/\/cyber.harvard.edu\/works\/lessig\/finalhls.pdf\" data-v-f87c67ca=\"\">animated early discussions<\/a> of the internet. In part, Commissioner Peirce’s Proposal is a call to the crypto community to make the case that the law should treat crypto differently because it is, well, different.","One way many token offerings differ from traditional securities offerings is in their need for wide distribution. This is true for at least two interconnected reasons: functional design (decentralization requires distribution) and regulatory requirement (to the extent decentralization might mean tokens cease being considered securities). The SEC is at the forefront of helping market participants appreciate the latter and the resulting unvirtuous cycle many network creators find themselves in today.","For this reason, the Proposal takes aim at what some call the “<a href=\"https:\/\/corpgov.law.harvard.edu\/2018\/12\/20\/when-are-tokens-securities-some-questions-from-the-perplexed\/\" data-v-f87c67ca=\"\">Hinman Paradox<\/a>.” The paradox is derived from SEC Director Bill Hinman’s now-famous suggestion that a token, initially sold as a security, might lose its security status if the token’s network became “sufficiently decentralized.” But a network has little hope of sufficient decentralization if, in practice, the Securities Laws curtail wide distribution of its tokens. Thus, the paradox.","In our view, concerns around decentralization must be addressed from at least two standpoints: the first is the somewhat obvious technical issue of code control, while the second relates to an issuer’s choice of funding mechanism as way to achieve widespread distribution.","Funding mechanisms interest us particularly, as this is an area where we spend a considerable amount of time and one in which token issuers actually have a regulatory (and not a Hobson’s) choice to make. To date, however, the vast majority of compliant token offerings in the United States have been conducted in private exempt securities offerings, pursuant to Regulation D, to a limited number of accredited investors. As the Commissioner notes, “[g]iven the limited pool of persons qualifying as accredited investors based on the current wealth and income tests, it can be difficult for these projects’ networks to take off.”","It doesn’t have to be that way. Among the available funding mechanisms, we believe that Reg A in its current form—and, more so, in an amended form we suggest below—is ultimately the better option for network creators. Reg A facilitates token issuers’ ability to pursue the creation of distributed networks by way of the immediate and compliant wide distribution of unrestricted tokens (or rights to tokens) to network participants, thereby bolstering their case for having achieved this aspect of decentralization.","Likely for this reason, the Proposal is substantively reminiscent of the Reg A framework, including requirements for initial and ongoing disclosure, as well as the preemption of state securities laws (of which, more below). Yes, the Proposal’s disclosure requirements are tailored to token issuers, but Reg A’s principles-based disclosure requirements would elicit similarly tailored information. Any need for more prescriptive disclosure relating to token offerings does not suggest the need for a new regulatory framework. Rather, a simple amendment to Reg A’s Form 1-A by the SEC or the issuance of <a href=\"https:\/\/www.sec.gov\/news\/public-statement\/statement-clayton-091318\" data-v-f87c67ca=\"\">non-binding staff guidance<\/a> to help ameliorate concerns regarding materiality can be enough.","This is not to say that the Proposal wouldn’t seemingly offer token issuers advantages over Reg A in its current form. Commissioner Peirce has proposed a notice regime, for example, whereas Reg A currently requires SEC review and action (through “qualification”) in order for sales in an offering to proceed. Under the Proposal, developers could avail themselves of Commissioner Peirce’s safe harbor without first seeking permission from the SEC. But, as we explain below, a similar result could be effectively obtained through tweaks to Reg A, an easier goal to achieve than a new safe harbor, and one that extends benefits to and can corral support from outside of the crypto industry.","Whatever one thinks of the crypto’s potential uniqueness or the necessity of a crypto-specific securities regime, <a href=\"https:\/\/www.coindesk.com\/crypto-firms-should-get-behind-peirces-safe-harbor-proposal-even-if-its-unlikely-to-become-law\" data-v-f87c67ca=\"\">commentators<\/a> have been quick to note that the Proposal has little chance of adoption. Commissioner Peirce said as much herself—“I get the point. I am one of five Commissioners. I cannot write rules unilaterally”—but pitched the Proposal as a spark looking to start a fire. We think she’s achieved her goal of sparking a helpful conversation. In that spirit, we have one more bucket of cold water to throw on the strained, sputtering metaphor.","The Proposal in its current form would preempt state securities laws. Like the SEC on the federal level, states have their own jurisdiction over issuer registration and qualification of securities offerings conducted within their boundaries. This can sometimes result in overlapping or additional disclosure requirements and duplicative or merit-based offering reviews by state securities regulators that can add time, cost, and uncertainty to the offering process. For these reasons, in the 1990s, Congress enacted legislation that provided for the preemption (i.e., inapplicability) of state securities laws registration and qualification requirements in certain instances and delegated the SEC the authority to unilaterally do the same in limited circumstances. In 2012, Congress passed the JOBS Act, which directed the SEC to promulgate new rules and added to the Securities Laws new instances of preemption.","On the back of the JOBS Act, the SEC proposed and adopted provisions in Reg A that provided for the preemption of state securities laws by defining the category of “qualified purchaser” to include those persons offered and sold securities pursuant to its robust regulatory framework. The Proposal suggests that the SEC should follow the same path to preemption. Unlike as was the case with Reg A, however, the Proposal does not identify any meaningfully demonstrated need for preemption or, crucially, a congressional mandate to support it.","Unsurprisingly, questions of preemption are politically charged, as they involve the constitutional balance of power between the states and the federal government. Despite Reg A’s clearer case for preemption, several state securities regulators took the SEC to court over the move and the issue <a href=\"https:\/\/scholar.google.com\/scholar_case?case=13220015890970011871&amp;q=Lindeen+v.+Securities+and+Exchange+Commission,+825+F.3d+646+(2016)&amp;hl=en&amp;as_sdt=20006\" data-v-f87c67ca=\"\">reached the D.C. Circuit<\/a>. While the SEC ultimately prevailed, any attempt to replicate that path in a space as fraught with investor protection concerns as token offerings would certainly face much greater challenges, both from within the SEC and, for any formal proposal, in the courts. In the case of Reg A, the SEC relied on a congressional mandate in the JOBS Act that included provisions specifically relating to preemption. No such mandate exists for Commissioner Peirce’s unilateral Proposal. Inside The Beltway, authority without a mandate is about as useful as a car without gas on the New Jersey Turnpike.","The SEC already fought and won the preemption battle for Reg A. To be frank, it is unlikely to fight that battle again for crypto. For this reason, we believe that Reg A, with a few achievable modifications, could provide token issuers with many of the benefits of the Proposal.","The Proposal is well-timed to galvanize its advocates to take the SEC up on its call for recommendations to revamp the current exemptive framework. Absent a legislative mandate, it will be much easier for interested parties to latch on to existing regulatory momentum, and nudge its trajectory, than to convince the SEC to build something crypto-specific from scratch.","Many have already contributed a broad range of <a href=\"https:\/\/www.sec.gov\/comments\/s7-08-19\/s70819.htm\" data-v-f87c67ca=\"\">suggested modifications<\/a>. In our view, Reg A, particularly in this context, would benefit from the following potential revisions, among others:","As practitioners in the Reg A space, we’ve spoken with a number of foreign companies over the last few years, including token issuers, who have expressed a strong desire to conduct Reg A offerings. We’ve been forced to disappoint them. Reg A is currently available only to companies organized in and with their principal place of business in the United States or Canada. Removing this limitation, a vestigial organ of securities law history, and expanding Reg A eligibility to non-Canadian foreign issuers, would facilitate greater access by U.S. persons and residents to compliant token offerings, a desirable alternative to their participation in largely unregulated or underregulated offerings overseas.","This modification is attainable. When the Reg A rules were proposed in 2013, many commenters supported expanding eligibility to non-Canadian foreign companies. In the end, the SEC decided not to expand eligibility to such issuers but left open the possibility that it would reconsider expanding eligibility once it had an opportunity to observe the rules in practice. True to its word, in its recent call for comments on existing exemptions, the SEC has specifically requested comment on Reg A eligibility.","Before the JOBS Act amendments to Reg A, an offering statement, like a registration statement in a registered offering, could technically be qualified (i.e., permitted to proceed) automatically with the passage of time—20 calendar days after filing with the SEC, to be exact.","In practice, however, issuers rarely allowed this to happen out of legitimate concerns that their offering materials, without the benefit of input from the SEC staff, might be materially deficient, potentially leading to lawsuits. To avoid this and to facilitate SEC staff review and comment on the filings (which ultimately inures to all parties’ benefit through improved disclosure), the issuer would include a delaying notation on the cover of its Form 1-A stating that the offering statement would only be qualified by SEC order. Once the issuer and SEC staff in charge of reviewing the filing came to general agreement on the substance of the disclosure in a given offering statement, the issuer would file an amendment without the delaying notation indicating that the offering statement would become qualified on the 20th calendar day after filing. SEC staff could intervene to accelerate the date of qualification, but, other than the passage of 20 calendar days, no further action was required in order to begin to offer and sell securities.","The JOBS Act-related amendments to Reg A altered the qualification process so that an offering statement could only be qualified by order of the SEC, and the process associated with the delaying notation and automatic qualification was eliminated. The SEC proposed and sought comment on the change before eventual adoption, but, since no commenters opposed the change, it was adopted.","We suggest Proposal advocates consider the import of an amended Reg A qualification process that substantively realigns with the pre-JOBS Act (and current registration) process.","The potential for automatic qualification would serve at least two important purposes. First, it would alleviate the requirement that SEC staff actively qualify (and risk being viewed to have somehow “blessed”) every token offering statement. Second, it would give token issuers some leverage and control over time to qualification in the event that all substantive SEC staff comments are otherwise addressed, while perhaps minor disclosure issues remain outstanding.","In order to minimize the risk of premature qualification, we would suggest the SEC only provide for the potential for auto-qualification after some minimal period of time (or a minimum number of rounds of comments), in which SEC staff would have the opportunity to review and comment on the filing. This is a tangible and achievable amendment to Reg A that would provide the SEC, its staff, and token issuers with greater cover, certainty, and control over the token offering and qualification process.","To be clear, we believe strongly that the SEC staff should maintain the ability to weigh in on and to put a stop to an issuance where they identify material issues. But, consistent with the registration process for registration statements, Reg A should no longer require the SEC to issue an order qualifying every offering statement.","Pursuant to a well-known strategy, many token issuers have elected to sell rights to future tokens to venture capitalists and other accredited investors. The ability of accredited investors to resell these rights and\/or the actual tokens, immediately upon receiving them at network launch, is at the heart of prominent cases <a href=\"https:\/\/modernconsensus.com\/regulation\/sec-telegram-lied-about-its-ico\/\" data-v-f87c67ca=\"\">like Telegram<\/a> and Kik.","Again, Reg A provides a solution in the midst of this uncertainty. Accredited investors who purchase token rights in private placements may resell their actual tokens, when received, alongside the token issuer in a subsequent Reg A offering. The issuer simply needs to qualify such secondary sales in its offering statement. The problem, currently, is that Reg A caps the amount of secondary sales permitted in an issuer’s initial Reg A offering, and any subsequent offering within the following 12 months, at 30% of the offering price and does not permit pure secondary offerings within the first year. Generally speaking, if an issuer offers $50 million in tokens under Reg A (the most an issuer can offer annually under Reg A), no more than $15 million worth of those tokens can be sold on behalf of existing holders.","We recommend that Proposal advocates consider how amending this limitation could expand liquidity options for such purchasers and provide a clear approach for a path many issuers have attempted, at times at their peril, to tread. Setting out a viable exit route for VCs at network launch would help token projects secure early, non-equity high risk capital from those most able to absorb the risk of loss. This would also facilitate the eventual wide distribution of actual tokens at the time of network launch (i.e., when it is functionally ready) through a compliant securities offering that includes substantive disclosure upon which potential network participants can make an informed investment decision.","One other modification could bring Reg A in line with another aspect of the Proposal—the “network maturity” determination. Currently, Reg A requires issuers to file an exit report on Form 1-Z when their offering is complete and they are no longer subject to an ongoing reporting obligation. The Proposal would provide token issuers with a three-year safe harbor during which time they must treat their tokens as securities, including by complying with reporting obligations similar to those required under Reg A, and after which time they are effectively out of regulatory luck. A better approach would be to issue tokens under Reg A and simply comply with the Reg A ongoing reporting obligations until one of two events occurs: either the reporting obligations are satisfied and come to an end or, consistent with the Proposal, the project achieves a yet-to-be determined measure of decentralization.","Whether the project achieves decentralization or the Reg A reporting obligations otherwise expire, the issuer could file a Form 1-Z, amended to include a representation that the project has satisfied specified decentralization criteria. The amended Form 1-Z could also provide for a period during which the SEC could review and intervene in that determination.","On the one hand, this would allow for token issuers to potentially realize the benefits of decentralization (and non-security status) in less than three years, and would provide an established ongoing regulatory path for those issuers unable to achieve decentralization within three years (i.e., continued reporting). On the other, it would also provide for the option for regulatory review of and against premature determinations of decentralization. The Proposal’s definition of network maturity needs work (and <a href=\"https:\/\/www.theblockcrypto.com\/post\/55985\/an-open-letter-to-sec-commissioner-peirce-on-token-safe-harbors\" data-v-f87c67ca=\"\">commenters<\/a> <a href=\"https:\/\/www.coindesk.com\/preston-byrne-peirces-safe-harbor-proposal-would-be-hilarious-if-it-werent-so-serious\" data-v-f87c67ca=\"\">have<\/a> already started that conversation), but when we arrive at a sensible definition, we think the best place for it is in Form 1-Z.","Finally, a brief rebuttable to an objection that has likely surfaced in your mind: “Make all the fixes you want—isn’t Reg A too expensive?”","The truth is that Reg A was designed to facilitate small company capital formation, not to be costly. A range of service providers, from the high-end to the cost-conscious, exist to help token issuers take advantage of Reg A. While it’s true, as Commissioner Peirce noted in announcing her Proposal, that Reg A token offerings to date have reported price tags beyond the reach of most companies, developers should not be deterred by the costs reported in the few filings she cites. It would be a great misfortune if a viable path to market were discarded on the basis of so paltry a data set. To be sure, there are costs to conducting an offering under Reg A—just as there would be <a href=\"https:\/\/www.coindesk.com\/preston-byrne-peirces-safe-harbor-proposal-would-be-hilarious-if-it-werent-so-serious\" data-v-f87c67ca=\"\">under the Proposal<\/a>. But cost is a private market issue, not a regulatory one.","As time goes on and more issuers take advantage of Reg A and the full range of Reg A service providers, we believe Reg A will become increasingly attractive from a cost perspective.","At once the most surprising, exciting, and insightful aspect of the Proposal is its requirement that development teams “undertake good faith and reasonable efforts to create liquidity for users” of their token.","Our clients are often surprised to learn that taking steps to facilitate secondary markets—steps often necessary to achieving decentralization—can increase the likelihood that their token is viewed as a security. There are good and established reasons for this, but it leaves token projects with an intractable problem and undermines completely the promise held out by decentralized (or decentralizing) projects. The Proposal’s secondary market provisions, or measures like them, could prove central to cutting Hinman’s Gordian Knot. It takes what was a hardship for token projects and proposes that it become a fundamental aspect of their regulation.","If a project achieves wide distribution at issuance, the Proposal’s secondary market provisions are less pressing: Reg A provides a method of wide distribution at issuance which impacts the decentralization analysis and subsequent securities law status of the tokens. Short of full decentralization, however, Reg A does not solve the trading venue issue for compliant token-security resales. The place to agitate for a politically difficult safe harbor is here, where other relief doesn’t already exist. Advocating for adjustments to Reg A, in lieu of seeking a sweeping new safe harbor and taking on a fraught and likely unwinnable preemption battle, will free up energy and political capital that Commissioner Peirce and Proposal advocates can better spend pursuing a narrower exemption that addresses secondary market trading in a way that protects investors without locking them out altogether.","Commissioner Peirce’s Proposal has already begun to bear its intended fruit, inasmuch as it has set commenters’ pens ascribblin’.","The Proposal has invigorated the conversation and we love that. But we also hope some of this energy gets directed away from the shiny object of the day and back to the humdrum notice and comment process, where we think we have an actual chance of effecting some change. Reg A already provides many of the benefits of the Proposal, and our time would be better spent perfecting the wheel than on a Quixotic mission to reinvent it. With the energy we conserve there, we can turn to the moonshots, like improved secondary market provisions.","Whatever your views, now’s the time to share them. The SEC is seeking your input. Commissioner Peirce is asking for your feedback. If you’re reading this, you probably have some thoughts. Take them up on it.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Commissioners","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Kik","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Commissioner Peirce’s Proposal","content":"ORGANIZATION"},{"type":"Bill Hinman","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Hobson","content":"PERSON"},{"type":"James Blakemore","content":"PERSON"},{"type":"Securities Laws","content":"ORGANIZATION"},{"type":"Peirce’s Proposal","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"“<a href=\"https:\/\/corpgov.law.harvard.edu\/2018\/12\/20\/when-are-tokens-securities-some-questions-from-the-perplexed\/\" data-v-f87c67ca=\"\">Hinman Paradox","content":"ORGANIZATION"},{"type":"Reg A","content":"PERSON"},{"type":"Peirce","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"Josh Garcia","content":"PERSON"},{"type":"New Jersey Turnpike","content":"ORGANIZATION"},{"type":"Hinman’s Gordian Knot","content":"ORGANIZATION"},{"type":"Z.","content":"LOCATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Zachary Fallon","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["SEC","TOKENS"],"authors":["Zachary Fallon","James Blakemore","Joshua Garcia","The Block"]}