{"summary":"The UK Treasury has published a new report on the potential use cases of fund tokenization, such as the use of tokens as collateral for MMFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284792\/uk-treasury-publishes-new-report-on-fund-tokenization","publishDate":"2024-03-26T11:55:24","id":12182,"type":null,"title":"UK Treasury publishes new report on fund tokenization","category":["POLICY"],"content":["The Technology Working Group of the UK's Treasury, the government's economic and finance ministry, has published a new report on the potential use cases of fund tokenization.&nbsp;","The <a href=\"https:\/\/www.gov.uk\/government\/news\/technology-working-group-publish-second-fund-tokenisation-report\" data-v-f87c67ca=\"\">report<\/a> explored the use of tokens as collateral for money market funds and the role tokenized funds could play in the onchain investment market.","The report outlined how the UK funds industry can effectively leverage <a href=\"https:\/\/www.theblock.co\/post\/264603\/uk-investment-funds-get-green-light-for-tokenization\" data-v-f87c67ca=\"\">tokenization's<\/a> potential for the asset management sector and detailed how firms operating within the UK can adopt a foundational tokenization model.","Furthermore, it explained various use cases demonstrating how this model could enhance firms' business operations, such as optimizing money market fund collateral management.","This is the second report from the Technology Working Group, established in April 2023 under the auspices of the Asset Management Taskforce. The focus of the third report will be the impact of artificial intelligence on the industry.","The new report builds on the publication of the Technology Working Group's first report, released in November 2023. Tuesday's report expanded on the potential use cases of fund tokenization first highlighted in the initial report.","Tokenization refers to issuing units recorded on a distributed ledger, as opposed to units recorded on more traditional record-keeping systems. Transitioning the existing operational infrastructure underpinning investment funds onto a distributed ledger could drive further efficiency and transparency within the sector and improve its competitiveness.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Asset Management Taskforce","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Technology Working Group","content":"ORGANIZATION"}],"hashtag":["UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}