{"summary":"Fireblocks has acquired BlockFold, a smart contract firm that specializes in tokenization projects for financial institutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253576\/fireblocks-acquires-blockfold-to-expand-tokenization-capabilities","publishDate":"2023-09-29T07:39:30","id":12194,"type":null,"title":"Fireblocks acquires BlockFold to expand tokenization capabilities","category":["COMPANIES"],"content":["Fireblocks has acquired BlockFold, a smart contract development and consulting firm that specializes in tokenization projects for financial institutions.","\"BlockFold’s expertise fills an important gap in the market, tailoring bespoke solutions for some of our most sophisticated customers and prospects in the banking and financial institutions space,\" Fireblocks CEO Michel Shaulov said.","The $10 million acquisition will expand Fireblocks' capabilities in <a href=\"https:\/\/www.theblock.co\/post\/252030\/taurus-custody-tokenization-deutsche-bank\" data-v-f87c67ca=\"\">tokenization<\/a> including token customization, orchestration, and distribution, the firm said in an email sent to The Block on Friday.","\"Bringing BlockFold’s expertise in-house means that we can better serve tier-1 financial institutions to quickly and seamlessly bring tokenization projects into production and new assets onto the blockchain,\" Shaulov added.","Fireblocks said tokenization is reinvigorating the legacy processes used in banking and financial markets infrastructure. The digital asset technology firm said they've seen demand in tokenization projects increase by 350% between 2022 and 2023.","According to Fireblocks, 75% of its tier-1 financial institution customers are exploring tokenization. The enterprise-grade digital asset provider also cited a Boston Consulting Group <a href=\"https:\/\/web-assets.bcg.com\/1e\/a2\/5b5f2b7e42dfad2cb3113a291222\/on-chain-asset-tokenization.pdf\" data-v-f87c67ca=\"\">report<\/a> that said tokenization of financial assets on the blockchain will grow into a $16 trillion market by 2030 and will represent 10% of all financial assets.","Fireblocks added it is also having conversations with more than 25 banks globally who are exploring the creation of bank-issued <a href=\"https:\/\/www.theblock.co\/post\/253051\/circle-launches-eurc-stablecoin-on-stellar-network\" data-v-f87c67ca=\"\">stablecoins<\/a> or tokenized deposits. The firm projected that within the next three years, \"the value of tokenized money on the blockchain will reach $350 billion.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"$16 trillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"Michel Shaulov","content":"PERSON"},{"type":"350%","content":"PERCENT"},{"type":"Fireblocks","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Boston Consulting Group","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"$350 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"}],"hashtag":["PRIVATE COMPANY M&AMP;A","SECURITY FIRMS"],"authors":["Brian McGleenon","The Block"]}