{"summary":"Blast claims to offer native Layer 2 yield generation for ether and stablecoins and has attracted over $30 million in bridged assets so far.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263926\/blur-ethereum-layer-2-blast-live-20-million-raise","publishDate":"2023-11-21T07:23:12","id":12196,"type":null,"title":"Blur founder&#x27;s Ethereum Layer 2 Blast goes live in early access after $20 million raise","category":["LAYER 2S AND SCALING"],"content":["Ethereum Layer 2 Blast has gone live in early access mode following a $20 million investment from Paradigm and Standard Crypto, among others.","Blast announced the launch in a <a href=\"https:\/\/x.com\/Blast_L2\/status\/1726747087906464024?s=20\" data-v-f87c67ca=\"\">post<\/a> on X late yesterday, aiming to become the first Ethereum Layer 2 to introduce a native yield model. Flashbots strategy lead Hasu, Delegate CEO Foobar and members of investment group eGirl Capital also participated in the round.","<span data-v-f87c67ca=\"\">Blast was built by Tieshun Roquerre, the founder of the NFT marketplace <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Blur <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248507\/blur-blur-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/blur.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BLUR<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.57%\n    <\/span><\/a> <!----><\/span><\/span>, also known as “Pacman.” Roquerre previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/214131\/blurs-pacman-doxxes-himself-and-outlines-plan-to-become-the-binance-of-nfts\" data-v-f87c67ca=\"\">doxxed<\/a> himself in February, outlining plans for the platform to become the \"Binance of NFTs.\"","Roquerre will oversee the development of both Blur and Blast, adding that he had raised another $40 million to contribute to the Blur ecosystem, including Layer 2 apps for NFTs.","Blast plans to airdrop tokens to community members and developers, with half the tokens allocated for each of the two groups. The airdrop will be based on the number of points each member has earned. The developer airdrop is scheduled for January 2024 when the testnet launches while the airdrop for community members will be in May.","Though users can already earn 3-4% by separately staking ether, Blast said the baseline interest rate on existing Layer 2s is 0%, with the value of assets depreciating against inflation over time. With Blast’s native yield, users’ balances compound automatically, offering 4% for ether and 5% for stablecoins, alongside rewards known as “Blast Points,” the team said.","More specifically, Blast said it natively participates in staking ether and passes the yield on to the Layer 2’s users and dapps, with their balances automatically growing over time.","Additionally, Blast offers stablecoins yields on USDC, USDT and DAI, which are deposited in on-chain T-Bill protocols like MakerDAO with the yield passed back to users in the form of USDB — Blast’s auto-rebasing stablecoin.","Over $30 million has bridged to the Layer 2 since launch, according to a Dune Analytics <a href=\"https:\/\/dune.com\/wumbonft\/blast\" data-v-f87c67ca=\"\">dashboard<\/a>. This includes over 13,000 ETH ($26 million), $3.4 million in DAI, $2.3 million in USDC and $900,000 in USDT.","According to a separate <a href=\"https:\/\/twitter.com\/PacmanBlur\/status\/1726756296094073040\" data-v-f87c67ca=\"\">post<\/a> by Roquerre, there is $100 million of total value locked in Blur’s bidding pool not earning yield, and a Layer 2 was the answer. “A new L2 with native yield for dapps and users would allow the Blur ecosystem to avoid asset depreciation, reduce NFT transaction costs and launch NFT perps,\" he said.","Despite the apparent demand, the platform has received criticism over how its model is structured and marketed.","Invite-only early access members are offered more points based on how much they bridge and who they invite to rank further up the leaderboard, according to a screenshot shared by Tytan.eth on X and verified by The Block. Members get rewards from those they invite, and then a smaller portion of rewards from people that their invitees then invite. Some have <a href=\"https:\/\/x.com\/Tytaninc\/status\/1726849555281633565?s=20\" data-v-f87c67ca=\"\">likened<\/a> it to a Pyramid scheme.","<span data-v-f87c67ca=\"\">Blast has a points scheme that rewards individuals who get their referees to invite more people. Image: Tytan.eth.<\/span>","Users also have to wait until the Blast mainnet launch in February before dapps go live and they can withdraw any funds, according to the team.","Currently the bridge to send funds to Blast is a multisig wallet owned and controlled by five people.","\"L<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">egally speaking, this is beyond crazy, particularly when only managed by a multisig. You are simply investing in a crypto hedge fund,\" said Delphi Labs General Counsel <a href=\"https:\/\/twitter.com\/lex_node\/status\/1726921756404027682\" data-v-f87c67ca=\"\">Gabriel Shapiro on X<\/a>.<\/span>","Roquerre did not immediately return a request for comment from The Block.","<em data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Blast.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$26 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$3.4 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$40 million","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"January 2024","content":"DATE"},{"type":"$900,000","content":"MONEY"},{"type":"-1.57%","content":"PERCENT"},{"type":"DAI","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Standard Crypto","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"},{"type":"$2.3 million","content":"MONEY"},{"type":"Delphi Labs General Counsel <a href=\"https:\/\/twitter.com\/lex_node\/status\/1726921756404027682\" data-v-f87c67ca=\"\">Gabriel Shapiro","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"“Blast Points","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"Roquerre","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Hasu","content":"PERSON"}],"hashtag":["BLUR"],"authors":["James Hunt","The Block"]}