{"summary":"Former Head of Institutional Sales Zane Tackett explains why FTX 2.0 would make sense — although it would have to be &quot;run like a crypto company&quot; to succeed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225865\/ftx-zane-tackett-exchange-relaunch","publishDate":"2023-04-12T06:30:43","id":12199,"type":null,"title":"FTX&#x27;s former sales chief says bankrupt crypto exchange should relaunch","category":["COMPANIES"],"content":["FTX should relaunch and offer a token representing creditor claims, according to the defunct exchange's former head of institutional sales.&nbsp;","\"It would at least provide some value (no matter how small) to creditors,\" Zane Tackett said via Telegram. \"If they try and fail it’s not like the creditors are much worse off.”","FTX should be resurrected with all the products it offered when it <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">collapsed<\/a> in November, while adding a market for trading creditors' claims on the bankrupt firm, Tackett argued. He referred to rival crypto exchange Bitfinex, which offered a token called BFX after it suffered a hack in 2016, as an example of how this could work. He said the new exchange could offer a market for FTX claims based on one token per $1 lost, as Bitfinex did.","“As is, there isn’t a fair way for the creditors to price the assets held by FTX. If they were able to convert their debt to equity and get exposure to the investments FTX had\/has, I think that would be a massive benefit,” he said. “It would also provide immediate liquidity to those that want to sell off their claim and would allow those with the assets\/desire to have the opportunity for a bigger payoff.”","This would be a similar idea to OPNX, an exchange <a href=\"https:\/\/twitter.com\/OPNX_Official\/status\/1643233549263224832\" data-v-f87c67ca=\"\">launched<\/a> this month for trading spot crypto and crypto bankruptcy claims. OPNX was set up by the founders of crypto hedge fund Three Arrows Capital, which blew up following the TerraUSD stablecoin's collapse, and Coinflex, which is still trying to recover $84 million from Bitcoin Cash proponent Roger Ver and Blockchain.com CEO Peter Smith.&nbsp;","Tackett isn't alone in proposing to bring FTX back from the dead. Even John Ray III, the man installed to lead FTX following its bankruptcy filing, mooted the idea in January and the law firm representing FTX’s creditors has <a href=\"https:\/\/www.theblock.co\/post\/222461\/ftx-sbf-clients-want-reboot-despite-scam\" data-v-f87c67ca=\"\">held several<\/a> “reboot of exchange” meetings. The company has also <a href=\"https:\/\/twitter.com\/AFTXcreditor\/status\/1643566735453310978\" data-v-f87c67ca=\"\">examined<\/a> the benefits and tax implications of restarting the exchange, along with creating a mock up to test user experience.&nbsp;","Yet Tackett acknowledged there are several barriers to the plan. For a start, it would involve using some of the funds recovered for creditors to finance the reboot. If the resurrected exchange fails once again, it would reduce the amount that creditors would receive.","Success would also depend on the way the exchange is relaunched. When asked whether users would return to a renewed FTX, he said it “completely depends on how it is done. If it’s a super regulated, U.S.-based and run operation, that doesn’t allow innovation or the products that initially brought in users, no f---king way.”","FTX 2.0 can succeed “if it’s run like a crypto company and is able to be nimble,” he added.&nbsp;“I just don’t know if I think the people currently managing it are the right people to do the relaunch.”&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"$84 million","content":"MONEY"},{"type":"Tackett","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"BFX","content":"ORGANIZATION"},{"type":"John Ray III","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Peter Smith","content":"PERSON"},{"type":"Zane Tackett","content":"PERSON"},{"type":"Roger Ver","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Tim Copeland","The Block"]}