{"summary":"Ethereum co-founder Vitalik Buterin has proposed a new system called &quot;stealth addresses&quot; to enhance privacy on the Ethereum blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/204524\/vitalik-buterin-proposes-stealth-addresses-to-enhance-ethereum-privacy","publishDate":"2023-01-23T04:32:06","id":12193,"type":null,"title":"Vitalik Buterin proposes &#x27;stealth addresses&#x27; to enhance Ethereum privacy","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethereum co-founder Vitalik Buterin has proposed a \"stealth address system\" to improve transactional privacy on the Ethereum blockchain. In a<\/span><a href=\"https:\/\/vitalik.ca\/general\/2023\/01\/20\/stealth.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> research blog<\/span><\/a><span data-v-f87c67ca=\"\">, Buterin wrote that privacy is \"one of the largest remaining challenges in the Ethereum ecosystem.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The stealth address system is based on a mechanism that would allow any Ethereum wallet to generate cryptographically obfuscated public addresses called \"stealth addresses'' in order to receive funds in a private manner and access them using a special code called a \"spending key.\"<\/span>","<span data-v-f87c67ca=\"\">Buterin described that stealth addresses give the same privacy properties as someone generating a fresh address for each transaction. These proposed stealth addresses are a way to increase privacy on Ethereum by creating unique, anonymous addresses for each transaction.<\/span>","<span data-v-f87c67ca=\"\">Each time someone makes a transaction, they can generate a new stealth address so that it is difficult for anyone to track the transactions or determine who is sending and receiving assets. This means that each user's transactional history can remain private. Buterin also suggested using ZK-SNARKs, shorthand for zero-knowledge proofs, to boost the privacy of the system and make it difficult to link the stealth addresses.<\/span>","<span data-v-f87c67ca=\"\">On Ethereum, transactions are public by default, which can pose a privacy concern. There are ways to attain transactional privacy on the network, such as using cryptocurrency mixers like Tornado Cash. However, such methods can raise regulatory issues. This was seen with Tornado Cash, which was sanctioned by the U.S. Treasury Department's Office of Foreign Assets Control (OFAC) for potentially illicit activities.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"U.S. Treasury Department's Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}