{"summary":"Game has more than 1 million players pre-registered as closed beta is slated for a launch later this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286267\/minecraft-inspired-crypto-game-hytopia-launching-beta-after-8-million-node-sale","publishDate":"2024-04-03T12:01:05","id":122,"type":null,"title":"Minecraft-inspired crypto game Hytopia launching beta after $8 million node sale","category":["GAMING"],"content":["Hychain Games said it will launch a closed beta of its Minecraft-inspired web3 video game Hytopia this month after the developer generated $8 million from a node sale, according to a statement.&nbsp;","<span data-v-f87c67ca=\"\">The company allows users to contribute to the security and functionality of its Layer 2 blockchain, also called Hychain, \"while earning rewards from a pool of 250 million $TOPIA tokens,\" according to Hychain Games's statement. \"Within just 48 hours of the node sale announcement, Hychain generated 2,098 ETH ($8 million at the time of the sale), with 254 ETH ($1 million) distributed among creators,\" it also said.<\/span>","The web3 game developer <a href=\"https:\/\/www.theblock.co\/post\/280211\/minecraft-based-crypto-project-nft-worlds-charts-comeback-with-node-sale-and-rebrand\" data-v-f87c67ca=\"\">first announced<\/a> the node sale last month. Hychain Games was previously known as the Minecraft-based project NFT Worlds. The developer is using the Layer 2 Hychain blockchain to power its new video game Hytopia, which, according to the company, has more than 1 million players pre-registered.","\"<span data-v-f87c67ca=\"\">Following the node sale, Hychain developers launched its mainnet on March 9, enabling users to transact, deploy contracts, create systems, and more,\" Hychain Games said in its statement.<\/span>","<span data-v-f87c67ca=\"\">Screenshot of Hytopia gameplay. Image: Hychain Games.<\/span>","The launch of free-to-play Hytopia's closed beta comes nearly two years after NFT Worlds was forced to devise a new strategy. NFT Worlds had been using Minecraft's source code as a basis for its NFT-powered metaverse, but then Mojang Studios, the developer behind Minecraft, <a href=\"https:\/\/www.theblock.co\/post\/159002\/nft-worlds-to-have-plan-of-action-by-end-of-week-following-minecraft-nft-ban\" data-v-f87c67ca=\"\">banned NFT integrations<\/a>.&nbsp;","Now, Hychain Games hopes Hytopia will satisfy gamers who might feel frustrated or limited by Minecraft's structure and policies.","\"<span data-v-f87c67ca=\"\">Despite Minecraft's user base exceeding 150 million, its restrictive monetization and creator ecosystem have left a gap for a new platform that emphasizes modding, performance, monetization and creator tools,\" Hychain said in its statement. \"Hytopia aims to directly address the challenges faced by Minecraft creators, such as stringent EULA constraints and technical limitations that restrict monetization opportunities and creative freedom.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"250 million $TOPIA","content":"MONEY"},{"type":"Minecraft","content":"LOCATION"},{"type":"Hytopia","content":"PERSON"},{"type":"Hytopia","content":"LOCATION"},{"type":"Hychain","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hychain Games","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Minecraft","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"March 9","content":"DATE"},{"type":"Hytopia gameplay","content":"ORGANIZATION"},{"type":"Mojang Studios","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}