{"summary":"The Bancor team noted large centralized entities have recently sold large amounts of Bancor tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153049\/bancor-dex-pauses-impermanent-loss-protection-amid-market-instability","publishDate":"2022-06-20T09:01:35","id":1220,"type":null,"title":"Bancor DEX pauses impermanent loss protection amid market instability","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Bancor, a decentralized exchange on Ethereum, has <a href=\"https:\/\/twitter.com\/Bancor\/status\/1538662297635282949\" data-v-f87c67ca=\"\">paused<\/a> one of its main features called impermanent loss (IL) protection. The DEX cited large sales of Bancor (BNT) tokens for its action.<\/span>","<span data-v-f87c67ca=\"\">Bancor first launched in 2017 as one of the very first decentralized exchanges on Ethereum. Later it became widely known for its feature of offering protection against impermanent loss — a type of loss incurred when someone supplies two unrelated crypto assets to a liquidity pool.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This impermanent loss comes into play when the price of any two tokens supplied together to any liquidity pool diverges. Impermanent loss occurs when the value of the liquidity provider (LP)'s position is less than what the LP would have had if they didn't invest in the liquidity pool and just held the assets in their wallet instead.<\/span>","<span data-v-f87c67ca=\"\">While most decentralized exchanges like Uniswap don't provide protection against impermanent loss, <\/span><span data-v-f87c67ca=\"\">Bancor subsidizes it by paying out newly minted Bancor tokens as rewards. It's up to LPs if they want <\/span><span data-v-f87c67ca=\"\">to hold or liquidate these tokens on the market. <\/span>","<span data-v-f87c67ca=\"\">In a Sunday blog, the Bancor team <a href=\"https:\/\/blog.bancor.network\/market-conditions-update-june-19-2022-e5b857b39336\" data-v-f87c67ca=\"\">noted<\/a> amid turbulence in crypto markets, large centralized <\/span><span data-v-f87c67ca=\"\">entities have recently sold large amounts of BNT tokens paid to them as IL rewards. Dune Analytics <a href=\"https:\/\/dune.com\/ChainsightAnalytics\/BNT-Minted-for-IL-Protection\" data-v-f87c67ca=\"\">shows<\/a> that during June, there was huge spike in the amount of BNT minted for the impermanent protection feature, much of which is said to have been sold off.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">To protect the BNT token from getting further depreciated in value, the team decided to temporary halt IL rewards, before adding that those will be be reactivated after the market stabilizes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"The need to pause IL protection is a result of the recent sell-off of emissions that were accumulated over the last 18 months,\" Bancor stated in a <a href=\"https:\/\/blog.bancor.network\/market-conditions-update-june-19-2022-e5b857b39336\" data-v-f87c67ca=\"\">blog post<\/a>. \"The temporary measure to pause IL protection should give the protocol some room to breathe and help BNT recover.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bancor Network (BNT) token <\/span>traded at about <span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.coingecko.com\/en\/coins\/bancor-network\" data-v-f87c67ca=\"\">$0.52<\/a> at<\/span> the time of writing, up 5% over the past 24 hours — but still 40% lower than its price a week ago.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"LP","content":"ORGANIZATION"},{"type":"Bancor","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$0.52","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"last 18 months","content":"DATE"},{"type":"40%","content":"PERCENT"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}