{"summary":"The blueprint outlines the various use-cases of incorporating &quot;smart contract&quot; innovations into the unified ledger design.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235800\/bis-makes-case-for-unified-ledger-but-describes-crypto-as-a-flawed-system","publishDate":"2023-06-21T07:23:16","id":12204,"type":null,"title":"BIS makes case for &#x27;unified ledger&#x27; but describes crypto as a flawed system","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">The Bank of International Settlements (BIS) released a blueprint for a global “unified ledger” to support <a href=\"https:\/\/www.theblock.co\/post\/231295\/starkex-based-network-hosts-first-forex-swap-using-australias-trial-cbdc\" data-v-f87c67ca=\"\">CBDCs<\/a> and tokenized assets. But it took a dim view of crypto.<\/span>","<span data-v-f87c67ca=\"\">The Swiss-based global monetary authority argued that the future of monetary systems is rooted in tokenization, carried out on programmable platforms overseen by central banks.<\/span>","<span data-v-f87c67ca=\"\">The <a href=\"https:\/\/www.theblock.co\/post\/217346\/bis-develops-cross-border-retail-cbdc-payment-system\" data-v-f87c67ca=\"\">BIS<\/a> outlined the construction of a “unified ledger,” centered around Central Bank Digital Currencies (CBDCs), tokenized deposits, and other tokenized claims on financial and tangible assets. The BIS <\/span><a href=\"https:\/\/www.bis.org\/publ\/arpdf\/ar2023e3.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> said that this ‘unified ledger’ would allow financial transactions to be automated and seamlessly integrated.<\/span>","<span data-v-f87c67ca=\"\">“Monetary system stands at the cusp of another major leap, following dematerialization and digitalization, the key development is tokenization, the process of representing claims digitally on a programmable platform,” the report, released Tuesday, added.<\/span>","<span data-v-f87c67ca=\"\">The BIS report took time to heap criticism on the crypto sector, stating that “crypto and decentralized finance (<a href=\"https:\/\/www.theblock.co\/post\/235559\/reserve-protocol-to-buy-defi-governance-tokens-worth-20-million\" data-v-f87c67ca=\"\">DeFi<\/a>) have offered a glimpse of tokenization’s promise, but crypto is a flawed system that cannot take on the mantle of the future of money.”<\/span>","<span data-v-f87c67ca=\"\">The report then doubled down on its assertion that “crypto has collapsed” and stressed the only successful use of tokenization rests on the foundations of trust provided by central banks.<\/span>","<span data-v-f87c67ca=\"\">“The collapse of crypto and the faltering progress of other tokenization projects underline a key lesson, that the success of tokenization rests on the foundation of trust provided by central bank money and its capacity to knit together key elements of the financial system,” the report argued.<\/span>","<span data-v-f87c67ca=\"\">Tokenization, as outlined in the BIS report, was hailed to have fundamental advantages over traditional ledger systems. It argued that, unlike the latter where account managers maintain and update records of ownership, a tokenized system transforms money or assets into \"executable objects\" maintained on programmable platforms.<\/span>","<span data-v-f87c67ca=\"\">The BIS study said these “executable objects” can be transferred via programming instructions without requiring an account manager's intervention, altering the role of intermediaries to more of rule book curators rather than bookkeepers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The report defined tokens as being not just digital entries but having the ability to integrate the records of underlying assets with set rules.<\/span>","<span data-v-f87c67ca=\"\">This allows tokens to be customized to meet specific user or regulatory requirements for individual assets, which the report claimed would provide significant potential for enhanced supervision and compliance settings.<\/span>","<span data-v-f87c67ca=\"\">The BIS report outlined significant potential use-cases of a unified ledger, emphasizing its capacity to update current processes and introduce entirely new types of transactions and arrangements, particularly in the context of banking and supply chain management.<\/span>","<span data-v-f87c67ca=\"\">It outlined the application of smart contracts and how they could overcome coordination problems often prevalent in joint ventures, stating that the blockchain innovation would eliminate free-riding and contribute to the stability of bank funding.<\/span>","<span data-v-f87c67ca=\"\">“A smart contract could specify that each participant contributes only a certain amount to a joint venture if all other participants also contribute, this way, free-riding is eliminated,” it stated.<\/span>","<span data-v-f87c67ca=\"\">Additionally, the report highlighted the potential for unified ledger technology in transforming supply chain financing, which currently suffers from challenges like delayed payments and the necessity for pre-production financing for suppliers.<\/span>","<span data-v-f87c67ca=\"\">It added that a unified ledger can provide real-time information incorporated into smart contracts, thereby addressing these persistent issues.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bank of International Settlements (BIS","content":"ORGANIZATION"},{"type":"Central Bank Digital Currencies","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BIS","content":"ORGANIZATION"}],"hashtag":["CBDCS","CRYPTO"],"authors":["Brian McGleenon","The Block"]}