{"summary":"With the development of a multi-chain ecosystem and the prosperity of Ethereum L2 solutions, users and developers have more choices. However, this also brings about the issues of fragmented user experience and liquidity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259539\/bifrost-omni-ls-dapp-a-new-user-experience-in-the-era-of-chain-abstraction","publishDate":"2023-10-26T09:01:02","id":12203,"type":null,"title":"Omni Liquid Staking DApp - A New Experience in the Era of Chain Abstraction","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">With the development of a multi-chain ecosystem and the prosperity of Ethereum L2 solutions, users and developers have more choices. However, this also brings about the issues of fragmented user experience and liquidity.<\/span>","<span data-v-f87c67ca=\"\">With the development of a multi-chain ecosystem and the prosperity of Ethereum L2 solutions, users and developers have more choices. However, this also brings about the issues of fragmented user experience and liquidity.<\/span>","<span data-v-f87c67ca=\"\">Taking the Liquid Staking (LS) sector as an example, most Liquid Staking protocols, such as the largest, Lido, deploy instances on multiple chains to support cross-chain Liquid Staking. However, these instances are independent of each other and lack interoperability. These Liquid Staking Token (LST) assets created by these instances can only circulate within their respective native chains and cannot be integrated into the multi-chain ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Recently, Bifrost has launched a new Liquid Staking Dapp. Through this Dapp, users can remotely stake, redeem and swap any LST of Bifrost. For example, users can directly stake vDOT, Bifrost LST for staked DOT on various EVM Parachains such as Moonbeam and Astar, without having to cross-chain and transfer it to the EVM chain.<\/span>","<span data-v-f87c67ca=\"\">You can visit the <\/span><a href=\"https:\/\/omni.ls\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Omni LS Dapp<\/span><\/a><span data-v-f87c67ca=\"\"> to experience it, directly.<\/span>","<span data-v-f87c67ca=\"\">The functionalities of the Omni LS Dapp are achieved through the use of a <\/span><a href=\"https:\/\/forum.polkadot.network\/t\/slpx-the-omni-chain-liquid-staking-vision-via-xcm\/3836\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cross-chain Architecture<\/span><\/a><span data-v-f87c67ca=\"\">. The Bifrost Staking Liquidity Protocol (SLP) module is built on this architecture, where the staking and redeeming of the LST is performed on a unified chain, on Bifrost. As a result, the liquidity hubs of these LSTs are aggregated and originate on this “headquarter” chain. Other chains have lightweight remote “branch” modules to support users and Dapps in remotely accessing the SLP module, tapping in and utilizing this liquidity.<\/span>","<span data-v-f87c67ca=\"\">As a result, users can stake, redeem and swap Bifrost LSTs through remote calls, regardless of the chain they are on, just like operating locally without experiencing the underlying cross-chain process. Furthermore, users don't need to worry about which chain their assets are on; they can use Bifrost's services anytime, anywhere. In this sense, <\/span><a href=\"https:\/\/medium.com\/@bifrost-finance\/chain-abstraction-the-path-to-a-new-omni-chain-web3-architecture-7ada030d5020\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Chain Abstraction<\/span><\/a><span data-v-f87c67ca=\"\"> is a necessary path to improve the Web3 user experience and to achieve Mass Adoption.<\/span>","&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by Bifrost<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chain Abstraction","content":"ORGANIZATION"},{"type":"Bifrost LST","content":"ORGANIZATION"},{"type":"Bifrost Staking Liquidity Protocol (SLP","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Moonbeam","content":"LOCATION"},{"type":"EVM","content":"ORGANIZATION"},{"type":"SLP","content":"ORGANIZATION"},{"type":"Bifrost","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}