{"summary":"MetaMask is the most popular crypto hot wallet by amount of app downloads, according to a report.\nCoinbase Wallet, Trust Wallet, and Blockchain.com Wallet each have fewer than half MetaMask’s installations.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243849\/metamask-takes-top-spot-as-most-popular-wallet-with-22-million-downloads-coingecko-report","publishDate":"2023-08-09T10:05:59","id":1220,"type":null,"title":"Metamask takes top spot as most popular wallet with 22 million downloads: CoinGecko report","category":["Companies"],"content":["MetaMask is the most popular crypto hot wallet, with over 22.66 million app downloads to date, according to a new report by CoinGecko.","MetaMask is followed by Coinbase Wallet, <a href=\"https:\/\/www.theblock.co\/post\/227730\/trust-wallet-vulnerability-fix\" data-v-f87c67ca=\"\">Trust Wallet<\/a> and Blockchain.com Wallet, with each boasting slightly over ten million installations. Bitcoin.com Wallet comes in fifth place with five million installations. In total, the top four crypto hot wallets represent 66.6% of total wallet installations with a combined 54.06 million downloads.","The report, titled \"<a href=\"https:\/\/www.coingecko.com\/research\/publications\/most-popular-crypto-hot-wallets?utm_campaign=Data%2BVisualization&amp;utm_medium=social\" data-v-f87c67ca=\"\">Most Popular Crypto Hot Wallets for Self-Custody<\/a>\" added \"the ten most popular crypto hot wallets have over four times the number of installations for less popular wallets.\"","Half of the top ten wallets are either backed or owned by centralized crypto exchanges, indicating the interest centralized entities have in self-custody services. <a href=\"https:\/\/www.theblock.co\/post\/243695\/coinbase-buy-back-bonds\" data-v-f87c67ca=\"\">Coinbase<\/a> Wallet and Crypto.com DeFi Wallet were developed by their respective exchanges, whilst Trust Wallet was acquired by <a href=\"https:\/\/www.theblock.co\/post\/243710\/binance-el-salvador-crypto-licenses\" data-v-f87c67ca=\"\">Binance<\/a> in 2018. BitKeep is partially backed by the Bitget exchange. Also, <a href=\"https:\/\/www.theblock.co\/post\/89922\/safepal-the-first-tokenized-hardware-wallet-backed-by-binance\" data-v-f87c67ca=\"\">SafePal’s<\/a> hardware wallet integration received investment from Binance Labs.","There are currently at least 54 crypto hot wallets, according to the report.&nbsp; Android mobile devices were found to have almost three times more installations than browsers.","The CoinGecko study examined hot wallet installations on browser and mobile on August 1, 2023, using <a href=\"https:\/\/cer.live\/\" data-v-f87c67ca=\"\">CER.live<\/a> and public data. The data was from Android mobile devices and Chrome, Brave, Edge, Firefox and Opera web browsers only. Data from iOS, Safari, MacOS, Linux and Windows was unavailable."],"hashtag":["BINANCE","COINBASE","DECENTRALIZED INFRASTRUCTURE"]}