{"summary":"South Korean prosecutors have reportedly asked Interpol, an international organization that facilitates police cooperation and crime control between countries, to issue a red notice against Do Kwon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170992\/south-korea-asks-interpol-to-issue-red-notice-for-do-kwon-ft","publishDate":"2022-09-19T05:52:26","id":12208,"type":null,"title":"South Korea asks Interpol to issue red notice for Do Kwon: FT","category":["LEGAL"],"content":["South Korean prosecutors have reportedly asked Interpol, an international organization that facilitates police cooperation and crime control between countries, to issue a red notice against Do Kwon.","The Financial Times <a href=\"https:\/\/www.ft.com\/content\/7e9f6182-f545-4e53-9cef-1ae4f6e3bd9f\" data-v-f87c67ca=\"\">reported<\/a> the news on Monday, stating that Kwon, the co-founder of crypto firm Terraform Labs, is allegedly refusing to co-operate with a probe into the $40 billion implosion of the tokens terraUSD and luna.","Red notices are issued for fugitives wanted either for prosecution or to serve a sentence. <a href=\"https:\/\/www.interpol.int\/en\/How-we-work\/Notices\/View-Red-Notices\" data-v-f87c67ca=\"\">Interpol's website<\/a>&nbsp;states that a red notice is&nbsp;\"a request to law enforcement worldwide to locate and provisionally arrest a person pending extradition, surrender, or similar legal action.\"","South Korean prosecutors have reportedly also asked the country's foreign ministry to cancel Kwon’s South Korean passport, as he was “obviously on the run and has no intention to appear before us for questioning.”","“We have begun the procedure to place him on the Interpol red notice list and revoke his passport,” the prosecutors’ office said Monday, adding that Kwon had not co-operated with investigations into Terraform's collapse.","Kwon <a href=\"https:\/\/www.theblock.co\/post\/170902\/do-kwon-says-he-is-not-on-the-run-cooperating-with-authorities\" data-v-f87c67ca=\"\">said on Saturday<\/a>&nbsp;that he is not trying to evade any relevant authorities. “I am not 'on the run' or anything similar - [from] any government agency that has shown interest to communicate, we are in full cooperation and we don’t have anything to hide,” Kwon tweeted recently, responding to reports that Singaporean police officials have claimed he is not currently residing in the city-state nation.","The South Korean prosecutor’s office reportedly said that Kwon told investigators through his lawyer that he did not want to respond to their summons immediately.","“We are doing our best to locate and arrest him,” a spokesperson for the office told the FT. “He is clearly on the run as his company’s key finance people also left for the same country during that time.”","The red notice comes a few days after Korean authorities issued an arrest warrant for Kwon and sought to freeze his passport, which in theory would require him to return to Seoul within 14 days of receiving the notice of revocation.","Kwon's Singapore employment pass is due to expire Dec. 7 and an application for another pass is pending, according to a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-09-19\/terra-s-do-kwon-may-be-trying-to-escape-probes-prosecutors-say?leadSource=uverify%20wall\" data-v-f87c67ca=\"\">Bloomberg report<\/a>, citing government records.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Dec. 7","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"},{"type":"Interpol","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["DO KWON"],"authors":["Yogita Khatri","The Block"]}