{"summary":"The recent Bedrock upgrade has reduced costs for the Layer 2 network Optimism, making transactions cheaper for its users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233949\/optimisms-bedrock-upgrade-has-already-saved-150000-in-transaction-fees","publishDate":"2023-06-09T09:33:44","id":12210,"type":null,"title":"Optimism&#x27;s Bedrock upgrade has already saved $150,000 in fees","category":["CRYPTO ECOSYSTEMS"],"content":["After the recent <a href=\"https:\/\/www.theblock.co\/post\/233364\/optimism-completes-upgrade-of-its-layer-2-network\" data-v-f87c67ca=\"\">Bedrock upgrade<\/a>, Optimism, a Layer 2 network that utilizes optimistic rollups, has experienced a notable drop in network costs.","The majority of costs for Optimism users stem from the fees required to publish transaction data on the Ethereum mainnet. The Bedrock upgrade reduced transaction fees through optimized batch compression and using Ethereum as a data availability layer. This has reduced network costs by 56% (from 6,890 to 3,000 gas units), according to <a href=\"https:\/\/dune.com\/oplabspbc\/optimism-bedrock-migration-impact-dashboard\" data-v-f87c67ca=\"\">data<\/a> compiled by Optimism’s core developer OP Labs on Dune.","As a result, the Bedrock upgrade has already saved users almost $150,000 in the last few days, data shows.","“The majority of the total transaction cost, about 86%, comes from the expected costs to submit data to [Ethereum],” Michael Silberling, onchain data analyst at OP Labs, told The Block.","Optimism users have also been boosted by average Ethereum transaction fees falling on its main layer. This makes it cheaper for Optimism to get its batches of transactions confirmed on Ethereum. With both of these factors in mind, average transaction fees on Optimism have decreased from $0.57 to $0.16.","<span data-v-f87c67ca=\"\">L1 Gas Fees per L2 Transaction on Optimism | Source: Dune (via Optimism Foundation)<\/span>","However, Silberling clarified that the “average cost per transaction” is subject to fluctuations in Ethereum transaction fee prices, something which is out of Optimism's control. Therefore, while the reduced transaction cost paints an encouraging picture, this metric can vary, Silberling further explained.&nbsp;","Optimism’s approach bundles multiple transactions together, which are then recorded on the Ethereum blockchain as a single transaction. It leverages the use of the OP Stack, a modular blockchain tool that enables developers to build their own chains.","The stack, which is also used by the Coinbase-backed project <a href=\"https:\/\/www.theblock.co\/post\/233722\/1-million-wallets-use-coinbase-backed-bases-smart-contracts-during-testing\" data-v-f87c67ca=\"\">Base<\/a> for their own Layer 2 network, facilitates faster and cheaper transactions while maintaining — to some degree — the security benefits of the Ethereum mainnet. Currently, the Optimism network holds around $830 million in locked assets, per <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-optimistic-rollups\" data-v-f87c67ca=\"\">data<\/a> from The Block.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"$150,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$830 million","content":"MONEY"},{"type":"Coinbase","content":"PERSON"},{"type":"86%","content":"PERCENT"},{"type":"56%","content":"PERCENT"},{"type":"Silberling","content":"PERSON"},{"type":"$0.57","content":"MONEY"},{"type":"Optimism Foundation)","content":"ORGANIZATION"},{"type":"Michael Silberling","content":"PERSON"},{"type":"$0.16","content":"MONEY"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"OP Stack","content":"ORGANIZATION"}],"hashtag":["OPTIMISM"],"authors":["Vishal Chawla","The Block"]}