{"summary":"Crypto exchange Gemini has slashed around 10% of its staff, its founders Cameron and Tyler Winklevoss wrote in a blog post published Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/149813\/crypto-exchange-gemini-slashes-about-10-of-its-work-force","publishDate":"2022-06-02T09:27:49","id":12211,"type":null,"title":"Crypto exchange Gemini lays off 10% of its staff","category":["EXCHANGES"],"content":["US-based crypto exchange operator Gemini slashed about 10% of its work force, founders Cameron and Tyler Winklevoss <a href=\"https:\/\/www.gemini.com\/blog\/a-message-from-cameron-and-tyler\" data-v-f87c67ca=\"\">wrote<\/a> in a blog post published today.","Gemini did not disclose the number of employees cut, but according to its LinkedIn page more than 1,000 people work at the company, which may translate to about 100 jobs. Gemini did not immediately respond to a request seeking comment on the number.","This is <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-06-02\/winklevoss-twins-gemini-slashes-staff-10-on-crypto-slump\" data-v-f87c67ca=\"\">reportedly<\/a> the first time Gemini has announced layoffs since its inception in 2014. The cuts come amid a currently bearish crypto market and macroeconomic conditions when job reductions are increasing. According to Layoffs.fyi, almost 15,000 people lost their jobs last month globally at start-up companies.","\"This is where we are now, in the contraction phase that is settling into a period of stasis — what our industry refers to as 'crypto winter.' This has all been further compounded by the current macroeconomic and geopolitical turmoil. We are not alone,\" the billionaire Winklevoss brothers wrote in the blog post.","Crypto prices have declined this year from the highs reached last November. As a result, trading volumes at crypto exchanges have dropped, including that of Gemini.","Gemini had less than 2% market share in last month's crypto trading volume, as opposed to market leader Binance's 64%, according to <a href=\"https:\/\/www.theblockresearch.com\/may-by-the-numbers-2-149555\" data-v-f87c67ca=\"\">The Block Research<\/a>.","","","Gemini's physical offices will remain closed today. The firm will hold remote conversations with impacted employees on their separation packages and health-care benefits. On Friday, Gemini plans to hold a company-wide \"standup\" to discuss its future.","\"Today is a tough day, but one that will make Gemini better over the long run,\" the Winklevoss brothers said.","Gemini's staff cuts come seven months after the company <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124818\/gemini-valued-at-7-1-billion-in-first-external-financing-effort\" data-v-f87c67ca=\"\">raised $400 million<\/a> at a valuation of $7.1 billion in its first funding round.","Gemini joins a number of crypto and fintech startups that have cut jobs in recent months, including <a href=\"https:\/\/www.theblockcrypto.com\/linked\/143679\/robinhood-announces-layoffs-ahead-of-first-quarter-earnings-release\" data-v-f87c67ca=\"\">Robinhood<\/a>, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/149092\/crypto-exchange-bitso-lays-off-80-employees-coindesk-reports\" data-v-f87c67ca=\"\">Bitso<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/140412\/bitmex-lays-off-75-employees-after-bank-acquisition-collapses\" data-v-f87c67ca=\"\">BitMEX<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"64%","content":"PERCENT"},{"type":"Tyler Winklevoss","content":"PERSON"},{"type":"Cameron","content":"PERSON"},{"type":"$400 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Winklevoss","content":"LOCATION"},{"type":"last November","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"$7.1 billion","content":"MONEY"}],"hashtag":["GEMINI","LAYOFFS"],"authors":["Yogita Khatri","The Block"]}