{"summary":"The elevated bitcoin futures basis to levels not seen since late 2021 is seen as a bullish indicator for the bitcoin market, an analyst said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282761\/bitcoin-futures-basis-is-a-bullish-indicator-for-the-market-analyst-says","publishDate":"2024-03-15T11:05:13","id":12215,"type":null,"title":"Bitcoin futures basis is a bullish indicator for the market, analyst says","category":["MARKETS"],"content":["The bitcoin futures basis, the difference between the futures and spot price, has increased to levels not seen since the digital asset's previous all-time high of over $68,000 in late 2021.","\"The basis is currently 18% to 25% annualized which are values we have only seen in 2021,\" Deribit&nbsp;Chief Commercial Officer&nbsp;Luuk Strijers told The Block.","Strijers added that the elevated annualized basis allows derivatives traders to lock in significant returns by buying spot <a href=\"https:\/\/www.theblock.co\/post\/282750\/bitcoin-price-falls-below-68000-volatility-causes-spike-in-long-liquidations\" data-v-f87c67ca=\"\">bitcoin<\/a> and selling nominally equivalent futures contracts at a higher price simultaneously. This trade provides a dollar gain that can be realized at expiry regardless of bitcoin's fluctuating value.","Strijers said that the disparity between the spot price of bitcoin and its futures price reflects the growing market momentum since the approval of ETFs in January and the expectations regarding the impact of the bitcoin halving.","\"The fact that this yield is so incredibly high is a very bullish indicator and driven by the daily new money flowing into the system because of the spot bitcoin ETF approval and the expected impact of the bitcoin halving,\" he said.","<span data-v-f87c67ca=\"\">A chart showing the increasing bitcoin annualized futures basis. Image: Deribit.<\/span>","In the bitcoin options market, Strijers noted an increased number of outstanding calls compared to puts leading up to the end of March expiry.","\"Overall the put-call ratio for bitcoin is now 0.59, so six puts for every ten calls, while moving further out, for June this drops to 0.32. So only three puts for every ten calls,\" Strijers told The Block. This ratio, which suggests a higher preference for calls over puts in the bitcoin options market, can indicate that bullish sentiment still dominates among derivatives traders.","A put-call options ratio below one indicates that the call volume exceeds the put volume. It is assumed that a trader who buys call options is implicitly bullish on the market, while a put buyer is bearish. According to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>, today's bitcoin put-call ratio is 0.58 on Deribit, which has about 90% of all bitcoin options open interest.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-put-call-ratio\/embed\" title=\"BTC Put\/Call Ratio\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Over the past 24 hours, bitcoin pulled back from a new all-time high of above $73,000, which was posted in early-day trading on Thursday.","Over the past day, the price correction led to a substantial liquidation of long positions on centralized exchanges. This volatility resulted in the liquidation of more than $278 million in bitcoin positions, with the majority ($225 million) being longs, according to CoinGlass <a href=\"https:\/\/www.coinglass.com\/LiquidationData\" data-v-f87c67ca=\"\">data<\/a>.","The largest digital asset by market cap is now changing hands for $68,446 at 10:06 a.m. ET, according to&nbsp;<a href=\"https:\/\/www.theblock.co\/prices\" data-v-f87c67ca=\"\">The Block’s Prices Page<\/a>.","The&nbsp;<a href=\"https:\/\/www.theblock.co\/indices\/top\/277090\/gmci-30-gm30\" data-v-f87c67ca=\"\">GM 30 Index<\/a>, representing a selection of the top 30 cryptocurrencies, has decreased by 4.48% to 152.83 in the past 24 hours.","<span data-v-f87c67ca=\"\">The price of bitcoin has decreased by over 4% in the past 24 hours. Image: The Block.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"GM","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"$68,446","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$73,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"March expiry","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"Strijers","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"$225 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"10:06 a.m. ET","content":"TIME"},{"type":"$68,000","content":"MONEY"},{"type":"$278 million","content":"MONEY"},{"type":"4.48%","content":"PERCENT"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}