{"summary":"Worldcoin has been suspended in Kenya — a market in which it has already signed up hundreds of thousands of customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242704\/worldcoin-suspended-in-kenya-one-of-its-biggest-markets-for-sign-ups-so-far","publishDate":"2023-08-02T04:59:28","id":12223,"type":null,"title":"Worldcoin suspended in Kenya, one of its biggest markets for sign-ups so far","category":["COMPANIES"],"content":["Worldcoin, the identity-focused crypto project co-created by Sam Altman, has been suspended in Kenya — a market in which it has already signed up hundreds of thousands of customers.","“The Government is concerned by the ongoing activities of an organization calling itself ‘WORLD COIN’ which is involved in the registration of citizens through the collection of eyeball\/iris data,” said Kenya’s Ministry of the Interior in a statement&nbsp;<a href=\"https:\/\/www.facebook.com\/photo\/?fbid=598481255807383&amp;set=pcb.598481412474034\" data-v-f87c67ca=\"\">shared on Facebook<\/a> on Wednesday and signed by Minister Kithure Kindiki.","It added, “Accordingly, the government has SUSPENDED forthwith, activities of ‘WORLD COIN’ and any other entity that may be similarly engaging the people of Kenya until relevant public agencies certify the absence of any risks to the general public whatsoever.”","The news will come as a blow for Worldcoin, which — in <a href=\"https:\/\/www.theblock.co\/post\/237647\/inside-sam-altmans-worldcoin-and-its-quest-to-catalog-all-humans?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">an investor presentation<\/a> obtained previously by The Block — had previously highlighted Nairobi, the country’s capital, as a city in which it had seen significant demand. In December 2022, when the presentation was prepared, Worldcoin boasted of more than a quarter of a million sign-ups in Nairobi, with 45 of its retina-scanning orbs circulating.","Worldcoin is currently ramping up production of those orbs, as it seeks to rapidly increase the number of people getting scanned around the world. Its technology is billed as a means of online identity verification. Those who sign up can also claim a portion of the project’s WLD token, <a href=\"https:\/\/www.theblock.co\/post\/241074\/sam-altman-worldcoin-launches-token\" data-v-f87c67ca=\"\">a cryptocurrency that launched last week<\/a>.","At launch, Worldcoin —&nbsp;which has chiefly been developed by San Francisco-based startup Tools for Humanity — had more than 2 million users, predominantly based in the Global South.","The startup did not immediately respond to a request for comment on this story.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Nairobi","content":"LOCATION"},{"type":"Kenya","content":"LOCATION"},{"type":"Government","content":"ORGANIZATION"},{"type":"December 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Kithure Kindiki","content":"PERSON"},{"type":"Kenya’s Ministry of the Interior","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}