{"summary":"The exploiter was able to successfully manipulate the exchange rate of the plvGLP token to make it 83% more valuable than it should have been.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193910\/lodestar-finance-exploited","publishDate":"2022-12-11T04:03:14","id":12224,"type":null,"title":"Arbitrum money market Lodestar Finance exploited","category":["DEFI"],"content":["Lodestar Finance, a lending platform on Ethereum scaling-solution suite Arbitrum, was attacked and exploited for about $6.5 million.","\"Protocol was exploited and deposits have been drained,\" the project's Twitter account <a href=\"https:\/\/twitter.com\/LodestarFinance\/status\/1601686921566375936\" data-v-f87c67ca=\"\">said<\/a> on Dec. 10 at 4:14 p.m. ET, while also declaring that it \"set all interest rates to zero so that supply and borrow balances are not moving while we weigh recovery options.\"","The exploiter was able to successfully manipulate the exchange rate of the plvGLP token to 1.83 GLP per plvGLP — making it 83% more valuable than it should have been. Using the inflated tokens as collateral, the exploiter could then remove all available liquidity on Lodestar Finance through bad debt.","The profits were <a href=\"https:\/\/twitter.com\/CertiKAlert\/status\/1601855447472001024\" data-v-f87c67ca=\"\">bridged<\/a> to Ethereum.","Other holders of plvGLP were able to use the exploiter's actions to their advantage by cashing out 1.83 GLP per plvGLP, Lodestar Finance noted.","According to the lending platform, 2.8 million GLP — worth $2.4 million at the time — can be recovered. It is also attempting to negotiate with the exploiter.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 10","content":"DATE"},{"type":"$6.5 million","content":"MONEY"},{"type":"$2.4 million","content":"MONEY"},{"type":"Lodestar Finance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4:14 p.m. ET","content":"TIME"},{"type":"83%","content":"PERCENT"}],"hashtag":[],"authors":["Adam James","The Block"]}