{"summary":"Block and Coinbase will announce their Q3 earnings on Thursday.\nThe delayed Cosmos vote for its new security model is scheduled for Monday.\nNFT.London kicks off on Thursday.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/181189\/here-are-three-big-stories-in-crypto-to-look-out-for-this-coming-week","publishDate":"2022-10-30T10:40:50","id":1222,"type":null,"title":"Here are three big stories in crypto to look out for this coming week","category":["Cryptocurrency"],"content":["Hacktober is almost over. In what’s likely to be a record-breaking year for hacks, this month saw the <a href=\"https:\/\/www.theblock.co\/post\/176824\/hacktober-surprise-worst-month-in-worst-year-of-hacks-chainalysis-says\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">worst<\/a> of it, with BNB Chain, Mango Markets, Team Finance, UvToken and FriesDAO among those targeted. Here’s hoping for a quieter November.","Meanwhile, companies are continuing to announce their earnings for Q3, an important vote is scheduled for the Cosmos community on Monday and the first ever NFT.London will start on Thursday.","Meta <a href=\"https:\/\/www.theblock.co\/post\/180304\/metas-stock-sinks-20-as-metaverse-spending-spree-continues\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a> more than $9 billion in losses relating to its metaverse division Reality Labs earlier this week, resulting in a sharp sell-off.&nbsp; With overall expenses at the company rising at the social media business struggling, people have little patience for Mark Zuckerberg's pet metaverse projects.","Laith Khalaf, head investment analysis at AJ Bell said “spouting on about the metaverse when in the here and now the social media business is struggling is about as palatable for the market as Jack banging on about magic beans to his mother when all she wants is to put food on the table.”","Let's hope other firms get a better response to their reports. Several more crypto and crypto-curious companies are set to announce their Q3 earnings over the next week.&nbsp; Microstrategy will hold its earnings call on Tuesday, followed by Robinhood on Wednesday. On Thursday, Block, Coinbase and Paypal are also expected to announce their results.&nbsp;","The delayed Oct. 24 Cosmos <a href=\"https:\/\/www.theblock.co\/post\/181100\/cosmos-to-vote-on-new-security-model-for-networks-hub-next-week\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">community vote<\/a> on its new security model for the network's central blockchain will take place on Monday.&nbsp; Called The Hub, Cosmos developers have proposed some new functionalities including interchain security and some changes to Cosmos Hub’s native token, ATOM.&nbsp;","NFT.London, the British spinoff of NFT.NYC, will kick off on Thursday. It’s the first time the event is coming to the UK and follows the New York edition earlier this year. Despite 15,000 attendees, conference goers noted a lack of interest in talks with lackluster attendance at sessions and little audience participation.","Nevertheless, expect plenty of NFT-themed weirdness including an NFT vending machine and a Bored and Hungry and McCains <a href=\"https:\/\/www.theblock.co\/post\/180804\/mccain-foods-wants-young-consumers-to-farm-its-metaverse-potatoes\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">pop-up eatery<\/a> collaboration.&nbsp;"],"hashtag":["COSMOS","EARNINGS"]}