{"summary":"NodeKit’s SEQ is a shared sequencer Layer 1 network designed to give a wide range of rollups more robustness and interoperability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267394\/nodekit-pre-seed","publishDate":"2023-12-13T10:05:06","id":1223,"type":null,"title":"NodeKit closes $1.2 million pre-seed round to enable a network of rollups","category":["CRYPTO ECOSYSTEMS"],"content":["NodeKit, the team working on Avalanche-based network SEQ, has raised $1.2M in a pre-seed round&nbsp;led by Borderless Capital, with participation from the Avalanche Blizzard Fund, Polygon Ventures and Wormhole Cross-Chain Ecosystem Fund.","NodeKit is building SEQ, a shared sequencer Layer 1 network that will aid rollup chains in launching and decentralizing their transactional sequencing. SEQ will operate as an individual blockchain or <a href=\"https:\/\/www.theblock.co\/post\/206863\/intain-launches-avalanche-subnet-for-asset-backed-securities\" data-v-f87c67ca=\"\">subnet<\/a> in the Avalanche ecosystem.&nbsp;","Most existing rollup chains in the broader Ethereum ecosystem will be compatible with SEQ in terms of software, including smart contract rollups (such as ZK and optimistic) and frameworks like <a href=\"https:\/\/www.theblock.co\/post\/236277\/optimism-changes-name-to-op-mainnet-in-line-with-superchain-vision\" data-v-f87c67ca=\"\">OP Stack<\/a>. Furthermore, rollups integrating with SEQ will gain cross-chain interoperability with each other.","“NodeKit enables rollups to have seamless interoperability, which unlocks innovative rollup design, empowering on-chain applications to directly compete with centralized off-chain applications,” Noah Pravecek, CEO of NodeKit, stated. “This enables a new design space for rollups, where they don’t have to choose between decentralization or high user growth.”&nbsp;","SEQ’s design will also support various data availability layers like <a href=\"https:\/\/www.theblock.co\/post\/267170\/celestia-to-integrate-data-availability-layer-with-polygon-cdk\" data-v-f87c67ca=\"\">Celestia<\/a>.","The testnet launch of SEQ is planned for 2024, followed by a mainnet release later.","SEQ is one of the first major projects to be developed using Avalanche’s HyperSDK software toolkit. HyperSDK offers builders customizability while optimizing for custom blockchains built atop Avalanche.","NodeKit marks Avalanche’s entry into the highly competitive and ever-expanding Ethereum Layer 2 niche. Layer 2 sequencers collect fees as users transact, with top Layer 2s like Optimism and Arbitrum generating millions of dollars in total fees in recent months.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Celestia","content":"LOCATION"},{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"$1.2","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Noah Pravecek","content":"PERSON"}],"hashtag":["AVALANCHE","DEVELOPER TOOLS","SEED &AMP; PRE-SEED"],"authors":["Vishal Chawla","The Block"]}