{"summary":"In yet another crypto bridge exploit, a hacker has managed to steal over $1 million worthof QANplatform (QANX) tokens — causing a price crash.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176118\/hacker-drains-1-million-from-qanplatform-bridge-token-slumps-94","publishDate":"2022-10-11T07:52:20","id":12246,"type":null,"title":"Hacker drains $2 million from QANplatform bridge, token slumps 94%","category":["HACKS"],"content":["Quantum-resistant Layer 1 blockchain QANplatform has suffered a malicious exploit to its bridge platform, resulting in the theft of $2 million worth of tokens, according to data from Etherscan.","“The bridge smart contract that is offline was hacked and the attacker managed to withdraw tokens,” QANplatform <a href=\"https:\/\/twitter.com\/QANplatform\/status\/1579759166478254080\" data-v-f87c67ca=\"\">said<\/a>, confirming the hack.","Data from Etherscan shows two bulk withdrawals from the project’s Ethereum cross-chain bridge took place between <a href=\"https:\/\/etherscan.io\/tx\/0x048a1a71fd41102c72427cc1d251f4ecbf70558562564306e919f66fd451fe82\" data-v-f87c67ca=\"\">08:17 AM<\/a> and <a href=\"https:\/\/etherscan.io\/tx\/0x39ec0a6bbe9c973a0eaa3f14c11952bd6ab3f9bc1bd1059a5614121c8f74080f\" data-v-f87c67ca=\"\">09. 40 AM<\/a> UTC on Oct. 11. These two withdrawals totaled roughly 1.46 billion QANX tokens — worth about $1 million at the time of the attack. One of the addresses involved in the attack has also been linked to other phishing attacks. The hacker also stole another $1 million worth of QANX tokens from the BNB cross-chain bridge, data from <a href=\"https:\/\/bscscan.com\/tx\/0xf93047e41433d73ddf983cfa008aeb356ec89803c0a92b0e97ccdc6c42a13f51\" data-v-f87c67ca=\"\">BSCscan<\/a> shows. This happened around the same time as the first withdrawal from the Ethereum side of the bridge.","Bridge security has become a major issue in the crypto industry following several major attacks. For example, earlier in October, a hacker <a href=\"https:\/\/www.theblock.co\/post\/175437\/biance-bnb-chain-is-back-up-after-bridge-exploit\" data-v-f87c67ca=\"\">stole $100 million<\/a> from the BNB Chain cross-chain bridge.","Today’s hack may also be related to the <a href=\"https:\/\/www.theblock.co\/post\/172773\/hacker-steals-950000-from-crypto-vanity-address-as-exploits-continue\" data-v-f87c67ca=\"\">profanity address vulnerability<\/a> that has also plagued other projects. This particular vulnerability has to do with vanity addresses — special custom addresses created by users. Security researchers previously identified a weakness associated with these addresses, through which their private keys can be “brute-forced.”","According to blockchain security outfit <a href=\"https:\/\/twitter.com\/BlockSecTeam\/status\/1579781207503802369\" data-v-f87c67ca=\"\">BlockSec<\/a>, the QANplatform’s deployer address is vulnerable to the bug. As such, it is possible that the attacker may have been able to uncover the private keys and used them to withdraw funds from the bridge.","<span data-v-f87c67ca=\"\">The QANplatform token has crashed 94% since a hacker stole $1 million from its crypto bridge. Image: CoinGecko.<\/span>","The QANplatform hacker has already begun to <a href=\"https:\/\/etherscan.io\/address\/0xf163a6cab228085935fa6c088f9fc242afd4fb11#tokentxns\" data-v-f87c67ca=\"\">sell<\/a> the tokens on Uniswap for ether (ETH). As of the time of publishing, the attacker has sold approximately 30% of the stolen funds in exchange for 230 ETH, worth $295,000. This selloff and the news of the hack have seen the QANX token take a massive tumble, dropping 94% from $0.012 to $0.0007 in less than an hour.","The attacker may now face some difficulties in disposing of the remainder of the stolen funds. QANplatform has withdrawn liquidity for its token from both Uniswap and Pancakeswap. “The trading, deposits and withdrawals on CEXes has been paused,” the team added. (CEXes, in this context, refer to centralized exchanges.) QANX is listed on centralized exchanges such as BitMart, MEXC Global and Gate.io. The hacker has also begun to <a href=\"https:\/\/etherscan.io\/tx\/0x35a358f8c91f90357283930b68e8dda2fc1c20507068436521ded847e8e5a13c\" data-v-f87c67ca=\"\">launder<\/a> the remaining funds via the <a href=\"https:\/\/www.theblock.co\/post\/162105\/us-treasury-sanctions-cryptocurrency-mixer-tornado-cash\" data-v-f87c67ca=\"\">US Treasury-sanctioned Tornado Cash<\/a>.&nbsp;","QANplatform also urged users not to conduct any transactions with the QANX token, and noted that it is investigating the incident. “Most likely we are going to do a snapshot before the hack and airdrop tokens according to it,” the project stated.","<em data-v-f87c67ca=\"\">Update: This article has been updated to state that $2 million worth of tokens were stolen in the hack and that the funds are being laundered via Tornado Cash.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.0007","content":"MONEY"},{"type":"Pancakeswap","content":"ORGANIZATION"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$295,000","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"94%","content":"PERCENT"},{"type":"1.46 billion","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"08:17 AM","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Oct. 11","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"$0.012","content":"MONEY"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}