{"summary":"LayerZero, a cross-chain application platform, confirmed it will be integrating with Aptos when it officially goes live.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176068\/layerzero-will-be-integrated-with-aptos-when-the-blockchain-launches","publishDate":"2022-10-11T05:05:48","id":12243,"type":null,"title":"LayerZero will be integrated with Aptos when the blockchain launches","category":["BLOCKCHAIN"],"content":["LayerZero, a cross-chain application platform, confirmed it will be integrating with the Aptos blockchain when it launches towards the end of 2022.&nbsp;","This integration will further improve security, user experience, and enable next-gen applications on Aptos, Aptos Labs <a href=\"https:\/\/twitter.com\/AptosLabs\/status\/1579571978885017600?s=20&amp;t=0w1H3mFBgE-5WKzrQT4T3A\" data-v-f87c67ca=\"\">said<\/a> on Twitter. These next-gen applications revolve around being cross-chain, meaning that they operate across multiple blockchains.&nbsp;&nbsp;","For users, operating across multiple blockchains is an unfriendly user-experience. Yet Aptos said operating across blockchains is critical for web3 adoption, and LayerZero supports that through its safeguards and emphasis on user experience.&nbsp;","LayerZero claimed there are over 20 of the largest Aptos applications building on the LayerZero developer network, meaning they are tapping into the possibilities of building a cross-chain compatible application.&nbsp;&nbsp;","Aptos received $350 million in funding this year and has been attracting developers from Solana – the <a href=\"https:\/\/defillama.com\/chains\" data-v-f87c67ca=\"\">fifth-largest<\/a> chain by TVL —&nbsp;over to its network.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"LayerZero","content":"ORGANIZATION"},{"type":"$350 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"Aptos Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Solana","content":"PERSON"}],"hashtag":["APTOS"],"authors":["Mike Truppa","The Block"]}