{"summary":"Oranges. What other food&#x27;s name is its own color? And what other food is on the blockchain? No other foods except oranges.  Just in time for Lunar New","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/9808\/ibm-puts-oranges-on-the-blockchain","publishDate":"2019-01-31T20:30:57","id":12252,"type":null,"title":"IBM puts literal oranges on the blockchain","category":["LAYER 1S"],"content":["Oranges. What other food's name is its own color? And what other food is on the blockchain? No other foods except oranges.&nbsp;","Just in time for Lunar New Year, Pacific International Lines and IBM Blockchain are using an electronic Bill of Lading - essentially an invoice that helps shippers follow a product from factory to depot - and connecting that e-BL to the blockchain.","That's right oranges on the blockchain. Mic. Drop.","Oh, not convinced?","\"That's all fine and good but how many oranges are we talking here?\" you ask, incredulously. \"My cousin Sal down at the wholesale market has loads of oranges and he never needed no blockchain!\" you howl.","Bang. Dropping knowledge in 3...2...1...","Your cousin Sal has nothing to do with with this shipment. This is 28 tons of sweet, uncut mandarin oranges rolling from China to Singapore on a boat the size of Sal's condo development. And IBM says the pilot was a success, noting that \"that 3,000 fresh oranges arrived ahead of schedule, ensuring an ample supply for Lunar New Year celebrations.\" Three thousand oranges, all blockchained and ready to peel. Maybe Sal should sit down and shut up.","\"Companies that ship perishable items like mandarin oranges require efficient document processing and expedited cargo clearing for delivery to help shorten overall shipping time, which in turn reduces risks for retailers and provides fresher options to consumers,\" wrote an IBM spokesperson. \"However, current processes mean that shipments of oranges from China can take up to seven days for the transfer of critical shipping documents and ultimately, the cargo.\"","\"The pilot demonstrated a significant reduction in the administrative process of transferring the title deed, from five to seven days to just a second.\"","The oranges came from&nbsp;Hupco Pte Ltd., a mandarin orange importer in the region.","“We are delighted with the outcome of the trial. By using the e-BL, we have seen how the entire shipment process can be simplified and made more transparent with considerable cost savings,\" said Tay Khiam Back, CEO of Hupco.","It is unclear if the technology will be available for other fruits like strawberries, bananas, or durian but anything that gets my mouth around a juicy orange faster and with more decentralized dependability is A-OK in my book.","&nbsp;","Photo by <a href=\"https:\/\/unsplash.com\/photos\/oAa4BY3b-vo?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" data-v-f87c67ca=\"\">Charles ??<\/a> on <a href=\"https:\/\/unsplash.com\/search\/photos\/oranges?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" data-v-f87c67ca=\"\">Unsplash<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles ??","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Pacific International Lines","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Sal","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Hupco Pte Ltd.","content":"ORGANIZATION"},{"type":"IBM Blockchain","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Tay Khiam Back","content":"PERSON"}],"hashtag":[],"authors":["John Biggs","The Block"]}