{"summary":"As interest and regulatory uncertainty over blockchain swirl on Capitol Hill, it&#x27;s also becoming increasingly evident that some regulators and lawmakers","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34280\/blockchain-projects-form-association-to-demystify-the-technology-for-us-lawmakers","publishDate":"2019-08-01T09:59:16","id":12251,"type":null,"title":"Blockchain projects form association to demystify the technology for US lawmakers","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">As interest and regulatory uncertainty over blockchain swirl on Capitol Hill, it's also becoming increasingly evident that some regulators and lawmakers are not well informed on the inchoate technology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is why Interchain Foundation, Blockfolio, and 10 other blockchain projects are coming together under an industry association, Proof of Stake Alliance (POSA), to educate regulators about the blockchain technology and hopefully win over their sympathy.<\/span>","<span data-v-f87c67ca=\"\">Alliance founder Evan Weiss told The Block that although there is not enough understanding of blockchain technology on the Hill, many blockchain projects are eager to communicate with regulators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We are hoping to sit down with regulators and policymakers, and just bring our members and give them opportunities to really just start dialogues with these different agencies on the hill,” said Weiss.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One of the key areas of focus for POSA is taxation. Weiss pointed out that a lot of POSA members, basing their projects on the PoS consensus, are concerned there is no clear guidance on how staking rewards are taxed.&nbsp;<\/span>","\"Some of what we are doing is trying to pursue the legal clarity around staking that would make it more coherent for people who are securing these networks at scale to participate and have a clear way to report their rewards,\" said Jacob Arluck, co-founder of TQ Tezos, an inaugural member of POSA.&nbsp;","<span data-v-f87c67ca=\"\">Indeed, POSA’s launch also comes days after the Internal Revenue Service (IRS) <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/31\/expert-cryptocurrency-taxation-high-enforcement-priority-for-irs-but-hindered-by-uncertainty\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">urged cryptocurrency investors to report<\/span><\/a><span data-v-f87c67ca=\"\"> their digital asset holding. <\/span><span data-v-f87c67ca=\"\">Currently, the IRS is still basing its cryptocurrency tax principle on a guideline issued in 2014. However, since Proof-of-Stake was invented in 2012 and <a href=\"https:\/\/cointelegraph.com\/news\/the-history-and-evolution-of-proof-of-stake\" data-v-f87c67ca=\"\">not implemented until 2013<\/a>, the 2014 guideline may not be sufficient in addressing the rewards people receive from implementing this algorithm.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, the Senate Banking Committee also <\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/30\/senate-panel-questions-cryptos-financial-inclusion-powers-calls-for-more-regulatory-clarity\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hosted a hearing<\/span><\/a><span data-v-f87c67ca=\"\"> on the regulatory framework of blockchain and cryptocurrencies earlier this week. During the hearing, Circle CEO Jeremy Allaire pointed out that \"there is a fundamental mismatch between the regulatory guidance and the nature of these [digital] assets.\"&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Against this backdrop, Weiss noted that Washington D.C. is showing more willingness to learn about blockchain and is open to conversations with blockchain companies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“People are receptive, they want to have conversations, they want to learn… you can tell the Hill is really starting to wake up to this [new technology],” said Weiss.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Jacob Arluck","content":"PERSON"},{"type":"Evan Weiss","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"POSA","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Washington D.C.","content":"LOCATION"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Interchain Foundation","content":"ORGANIZATION"},{"type":"Weiss","content":"PERSON"},{"type":"Blockfolio","content":"PERSON"},{"type":"Proof of Stake Alliance (POSA","content":"ORGANIZATION"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}