{"summary":"Want some bare-knuckled bitcoin litigation, agents (but not the James Bond kind), and news on why too much of a good thing sometimes isn&#x27;t all that great?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7965\/consultant-allegedly-gets-shorted-after-being-too-good-at-job","publishDate":"2019-01-20T10:00:15","id":1225,"type":null,"title":"Consultant allegedly gets shorted after doing job too well","category":["LEGAL"],"content":["Want some bare-knuckled bitcoin litigation, agents (but not the James Bond kind), and news on why too much of a good thing sometimes isn't all that great? Read on, MacDuff!&nbsp;","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes and provided by <a href=\"https:\/\/twitter.com\/nelsonmrosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a>&nbsp;&nbsp;and <a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stephen Palley<\/a>&nbsp;These posts are not legal advice. These are our opinions only and aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.&nbsp;<\/em>","We’ve got another services agreement gone awry. This case involves a startup cryptocurrency company, some deep pockets, and the potential perils of biting off more than you can chew.","The plaintiffs in this case, Emerging Markets Intrinsic (EMI) and SRT Capital SPC (SRT), got involved with Kadena LLC in 2017, because their attorney introduced them to his son, Will Martino, who is CEO of Kadena, LLC. According to the complaint Kadena was having a “friends and family” fundraising round selling convertible notes, and they were welcomed to join the round. Both plaintiffs invested $50,000 each for $100,000 total. Later in 2017, Kadena allegedly informed the EMI and SRT of immense institutional investor interest in Kadena Coin, the cryptocurrency that Kadena LLC hoped to build. Based on this representation SRT bought the right to receive $1 million worth of Kadena Coin. At the end of the fundraising round it was revealed that Kadena only raised $2.25 million meaning that SRT had inadvertently become the largest future holder of Kadena Coin.","In order to grow their company, Kadena entered into a consulting agreement with EMI, because EMI had many contacts in the business world. As part of the services agreement, EMI would be rewarded with future Kadena Coin in three different ways: setting up a meeting with a qualified prospect, a qualified prospect agreeing to develop a proof of concept, and a qualified prospect issuing a press release about their partnership with Kadena. These were Triggering Events that led to rewards of additional coins.","EMI took to their job with vigor. In May of 2018, EMI organized a series of meetings that were attended by Martino with potential business prospects. The cost of the trip was 250,000 euros, and EMI covered the costs for Kadena. Apparently, EMI was able to arrange “executive-level meetings with 13 out of 14 Qualified Prospects.” According to the terms of the service agreement this meant EMI was entitled to 2.6 million Kadena Coin. This is when the relationship began to sour.","Allegedly, upon the success of the meetings Kadena communicated that they never expected EMI to secure so many meetings, or that they would generate so much interest. Apparently, Kadena had not accounted for this in their financial modeling, and they needed to “play with the numbers,” to figure out how to pay EMI what they were allegedly owed.","When you enter into an agreement you have a duty of good faith and fair dealing to the other parties to that agreement. For example, you can’t try and act in a way to deny the benefits of the contract that the other party is owed. This is what Kadena allegedly proceeded to do after they realized that they owed EMI 2.6 million Kadena Coins.","The complaint alleges that Kadena attempted to thwart efforts by EMI to get Qualified Prospects to sign on to agreements to develop the technology, and attempted to delay press releases past a December 31, 2018, deadline in the Service Agreement. Amendments were made to the Service Agreement. There are emails here. They don’t look great. In part though this will come down to determining what is reasonable. For example, was it reasonable and in good faith for the CEO of Kadena to change their mind about extending the press release deadline multiple times over the course of a few months? Maybe, maybe not. What’s odd is that EMI apparently was Kadena’s best advocate much to the chagrin of Kadena. Crypto is weird.","The Block<em data-v-f87c67ca=\"\"> is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given <\/em>The Block<em data-v-f87c67ca=\"\"> permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em><i data-v-f87c67ca=\"\"><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 31, 2018","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"LLC","content":"ORGANIZATION"},{"type":"Kadena Coin","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"$50,000","content":"MONEY"},{"type":"Kadena Coin","content":"LOCATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"Kadena","content":"LOCATION"},{"type":"$2.25 million","content":"MONEY"},{"type":"Kadena Coins","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"May of 2018","content":"DATE"},{"type":"Kadena LLC","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Service Agreement","content":"ORGANIZATION"},{"type":"EMI","content":"ORGANIZATION"},{"type":"Will Martino","content":"PERSON"},{"type":"MacDuff!","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Martino","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}