{"summary":"SynFutures, a decentralized derivatives exchange focused on perpetual futures, has raised $22 million in a Series B funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258378\/synfutures-dex-funding-token-plan","publishDate":"2023-10-19T09:00:03","id":12261,"type":null,"title":"Derivatives DEX SynFutures raises $22 million, open to token launch idea","category":["DEALS"],"content":["SynFutures, a decentralized derivatives exchange focused on trading crypto perpetual futures, has raised $22 million in a Series B funding round.","Pantera Capital led the round, with HashKey Capital, SIG DT Investments (a unit of the Susquehanna International Group) and others participating, SynFutures said Thursday.","The firm started raising for the Series B round last year and closed it about two months ago, Rachel Lin, co-founder and CEO of SynFutures, told The Block in an interview. She declined to comment on valuation and structure of the round but said SynFutures is open to the idea of a native token launch in the future. Any decision would depend on market conditions and regulatory landscape, she added.","SynFutures’ Series B round comes nearly two and a half years after its <a href=\"https:\/\/www.theblock.co\/linked\/108659\/decentralized-derivatives-platform-synfutures-14-million-series-a\" data-v-f87c67ca=\"\">Series A round<\/a> worth $14 million in June 2021. It brings the firm’s total funding to date to about $38 million.","Launched in 2021, SynFutures is a decentralized exchange for trading crypto perpetual futures, a derivative product that allows traders to bet on the future price of a cryptocurrency with leverage and no set expiration date, making it possible to profit or lose rapidly based on price movements.","While deployed on several blockchains, SynFutures is currently the second largest derivatives protocol on Polygon, with a total value locked of over $6 million, according to DeFi Llama. SynFutures says it has recorded over $22 billion in cumulative trading volume to date.","SynFutures has today also launched a new version of its platform, V3, on Ethereum testnet. For mainnet, the platform is targeting to support multiple blockchains, including Polygon and <a href=\"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum\" data-v-f87c67ca=\"\">zkSync Era<\/a>, an Ethereum Layer 2 network. The mainnet is expected to go live later this year to early next year. SynFutures V2 is available on Polygon and zkSync Era, while SynFutures V1 was deployed on Ethereum, Polygon, Arbitrum and BNB Chain.","SynFutures said it has developed a proprietary automated market maker model called Oyster for its V3 platform that combines the best of order book and AMM models. “Our model unifies concentrated liquidity AMM (with up to 26,666x boost) and order book (with unlimited liquidity boost),” Lin said in the interview. With Oyster AMM, SynFutures looks to compete directly with centralized exchanges.","“On CEXs and in most traditional financial markets, derivatives trading eclipses spot market volumes by three to five times. Yet for DeFi, a huge gap remains for derivatives. To address that gap, and thereby improve the overall health of the DeFi trading environment, our V3 platform is designed to enhance trading efficiency, especially by concentrating liquidity,” Lin said.","Singapore-based SynFutures currently has a team of about 20 people, and with the new funding in place, it plans to hire additional people in engineering and business development functions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Lin","content":"PERSON"},{"type":"SynFutures","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"Oyster AMM","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SIG DT Investments","content":"ORGANIZATION"},{"type":"$14 million","content":"MONEY"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Susquehanna International Group)","content":"ORGANIZATION"},{"type":"$38 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"AMM","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"$22 billion","content":"MONEY"},{"type":"HashKey Capital","content":"ORGANIZATION"},{"type":"Rachel Lin","content":"PERSON"}],"hashtag":["DERIVATIVES","DEXS","SERIES B"],"authors":["Yogita Khatri","The Block"]}