{"summary":"Bored Ape founders said they had become the &quot;target of a crazy disinformation campaign&quot; and refuted allegations of Nazi links made by artist Ryder Ripps and a recently released YouTube video.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154094\/bored-ape-founders-push-back-on-nazi-accusations-open-up-about-logo-inspiration","publishDate":"2022-06-24T13:08:06","id":12267,"type":null,"title":"Bored Ape founders push back on Nazi accusations, open up about logo inspiration","category":["NFTS"],"content":["The founders of Bored Ape Yacht Club branded claims by artist Ryder Ripps and YouTuber Philion that they are Nazis “bullshit” in a Medium post published on Friday.","“We’ve become the target of a crazy disinformation campaign accusing us — a group of Jewish, Turkish, Pakistani, and Cuban friends — of being super-secret Nazis. Even though the @ADL, which exists to protect Jewish people around the world from just this sort of hatred and slander, has confirmed this isn’t true, trolls are still spreading ridiculous conspiracy theories online and using them to sell knockoff NFTs (surprise!),” the group said in the <a href=\"https:\/\/medium.com\/@team_69582\/a-letter-from-the-founders-678e5a3431e7\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statement<\/a>.","Earlier this week, an hour-long YouTube video on Philion’s channel laid out a list of claims about the founders' supposed links to Nazism and called for Twitter users to campaign against the group using the hashtag #BURNBAYC. The aim was to encourage famous Ape holders to destroy their NFTs.","BAYC has faced a flurry of criticism over the last few months spearheaded by US-based artist Ryder Ripps, who said on his website that he has been “investigat[ing] extensive connections between BAYC and subversive internet nazi troll culture” since De cember.","In mid-May he launched RR\/BAYC, a collection of NFTs that copied the designs of the original BAYC NFTs.","Ripps and Philion's claims center around the idea that the BAYC collection is full of subtle nods to Nazi ideology that would only be apparent to those deeply immersed in internet subculture. They point to an array of so-called evidence including ostensible similarities between the BAYC logo and the Nazi Totenkopf (a skull-and-crossbones image), online names chosen by the founders, phrases in the social media profiles of family members and numbers featured in the collection that may have significance to right-wing extremist communities.&nbsp;","BAYC’s response laid out their explanations as to why they chose specific names and designs, including emails detailing the design process for the logo, which they said is a mix of inspiration from punk, streetwear and skate references, maritime flags and pennants and old yacht club flags.","\"We never wanted to take ourselves too seriously, so the look of the club is ramshackle and divey. Everything about the BAYC was meant to convey a spirit of irreverence and absurdity... Overall, we think it’s crazy that these conspiracy theories have been able to proliferate. It really shows the power that a demented troll on the internet can have,\" the founders said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nazis","content":"ORGANIZATION"},{"type":"YouTuber Philion","content":"PERSON"},{"type":"mid-May","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Nazi Totenkopf","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Ryder Ripps","content":"PERSON"},{"type":"Philion","content":"PERSON"},{"type":"Friday","content":"DATE"}],"hashtag":["BAYC"],"authors":["Callan Quinn","The Block"]}