{"summary":"JKLabs secured a $2 million pre-seed funding from investors like 1kx and Boys Club, as it focuses on improving crypto governance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244889\/crypto-project-using-on-chain-reputations-for-governance-raises-2-million","publishDate":"2023-08-15T09:36:31","id":12264,"type":null,"title":"Crypto project using on-chain reputations for governance raises $2 million","category":["COMPANIES"],"content":["Crypto governance is broken, and upstart project jokerace doesn't think it's a laughing matter.&nbsp;","\"It's such a pain in the ass,\" says Sean McCaffery, co-founder of JKLabs. This is how they describe the current state of web3 and decentralized finance governance — an arena in which decision making is often bogged down by infighting between community members and big venture capitalists, inefficient transparency, and legal complexities.","JKLabs is looking to remedy some of the issues underpinning governance with a platform that allows projects to launch contests and hackathons, issue grants, and offer incentives to community members on-chain.","The firm announced Tuesday a pre-seed fundraise of $2 million with backing from a long list of investors, including lead investors 1kx as well as Boys Club, Seed Club Ventures and over 90 angel investors.","“Community organizing on-chain has, frankly, been a joke: susceptible to plutocracy, rugs, and apathy due to the utter lack of any kind of incentives or opportunities to participate in meaningful decision-making,” noted JKLabs co-founder David Phelps.","“We’re excited to enable contests that actually let communities and their members meaningfully monetize, grow their audience, and develop reputational capital to earn opportunities across the web.”","Typically crypto governance platforms weigh voting power by the number of tokens that any participant has. Governance platforms can be used for allocating resources for protocol-related grants and hackathons. Jokerace instead will be using on-chain reputations to assess who should have more say in the governance process.","\"We believe the future is going to be onchain as we see a flywheel: once users start reaping the benefits of developing on-chain reputation (for example, social graphs from shared voting interests, votes they earns as attestations, etc), it will entitle them to access, rewards, airdrops, and more governance power in turn, which will drive more people to want to adopt onchain data in turn,\" commented Phelps.&nbsp;","An example from Li.Fi demonstrates the potential of this new approach. By utilizing the platform, Li.Fi was able to put up funds for a contest where users could suggest and prioritize features. This process was then taken to social media for voting, creating an on-chain reputation for participants and showcasing power users.","The project has a number of partners lined up to use the platform, including Polygon Labs, Zapper, Flipside, Boys Club, and Eco.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Seed Club Ventures","content":"ORGANIZATION"},{"type":"David Phelps","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Sean McCaffery","content":"PERSON"},{"type":"Flipside","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Phelps","content":"LOCATION"},{"type":"$2 million","content":"MONEY"},{"type":"Boys Club","content":"ORGANIZATION"}],"hashtag":["GOVERNANCE VOTES"],"authors":["Frank Chaparro","The Block"]}