{"summary":"Cathie Wood&#x27;s Ark Invest sold more shares of Coinbase on Monday worth $26 million as the fund manager is taking profits.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240185\/ark-invest-coinbase-cathie-wood","publishDate":"2023-07-18T02:37:14","id":12277,"type":null,"title":"Ark Invest sells more Coinbase shares worth $26 million","category":["MARKETS"],"content":["Cathie Wood's Ark Invest sold 248,838 more shares of Coinbase on Monday as the stock continues to perform well off the back of a ruling in the Ripple case.","Ark's flagship fund, Ark Innovation ETF (ARKK), sold 127,266 shares of Coinbase, according to an update from the fund manager's trading desk on Monday. Its Ark Next Generation Internet ETF (ARKW) offloaded 44,784 shares, and Ark Fintech Innovation ETF (ARKF) sold 76,788 shares. Together, the sales were worth $26.3 million, based on the stock's closing price of $105.5 on Monday.","The latest sale marks <a href=\"https:\/\/www.theblock.co\/post\/239769\/ark-invest-coinbase-sells-cathie-wood\" data-v-f87c67ca=\"\">Ark's third sale of Coinbase shares in recent days<\/a> after nearly a year of building up its position. On the sales, Ark CEO and CIO Cathie Wood <a href=\"https:\/\/www.theblock.co\/post\/240136\/cathie-wood-says-shes-still-upbeat-on-coinbase-despite-recent-sales?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">said<\/a> the fund manager is \"simply taking profits and reallocating the capital to some laggards\" and that it is still \"very positive about Coinbase, especially in light of the court ruling for Ripple against the SEC (Securities and Exchange Commission).\"","Last week, Ripple pocketed a partial victory after a federal judge ruled that its XRP token is not a security when sold on the secondary market but is a security when sold to institutional investors. The ruling is favorable for Coinbase since it may affect the 13 tokens actively traded on Coinbase that the SEC alleged are securities in its lawsuit against the company last month, according to experts, including Wood and <a href=\"https:\/\/www.theblock.co\/post\/239775\/jpmorgan-ripple-xrp-coinbase\" data-v-f87c67ca=\"\">JPMorgan analysts.<\/a>","The ruling has resulted in a significant surge in Coinbase's price, with it currently trading close to its highest level in the past year. The shares have also rallied because Coinbase was listed as a surveillance-sharing partner for several spot bitcoin ETF applicants, including giants BlackRock and Fidelity.","While Ark is selling some Coinbase shares, it is still the second-largest owner, with more than a 6% stake, according to CNN <a href=\"https:\/\/money.cnn.com\/quote\/shareholders\/shareholders.html?symb=COIN&amp;subView=institutional\" data-v-f87c67ca=\"\">data<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$105.5","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"SEC (Securities and Exchange Commission)","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$26.3 million","content":"MONEY"},{"type":"Coinbase","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Cathie Wood","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Fintech","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Yogita Khatri","The Block"]}