{"summary":"The Block&#x27;s Frank Chaparro sits down with Shane Swanson of Greenwich Associates to talk about last month&#x27;s market frenzy and the broader implications of the frenzy around Robinhood and stocks like GameStop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93965\/former-citadel-securities-director-explains-what-happened-with-robinhood-and-gamestop-last-week","publishDate":"2021-02-05T16:10:09","id":12272,"type":null,"title":"Former Citadel Securities director explains what happened with Robinhood and GameStop last week","category":["CAPITAL MARKETS"],"content":["<i data-v-f87c67ca=\"\">Episode 7 of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Shane Swanson of Greenwich Associates.&nbsp;<\/i>","<i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Play<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"80f0efe4e3e1f3f4c0f4e8e5e2ecefe3ebe3f2f9f0f4efaee3efed\">[email&nbsp;protected]<\/a>.<\/i>","<i data-v-f87c67ca=\"\">This episode of The Scoop is brought to you by Blockset. With&nbsp;<a href=\"https:\/\/newsletter.theblockcrypto.com\/l\/7ongM1BS4pW2oMzRHwneMw\/V1Ujzkd447eIMGZOacS39Q\/r7uLQEbKLnxHG2n9jmci4Q\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Blockset<\/a>, companies gain access to tools such as:<br data-v-f87c67ca=\"\">\n<\/i>","<i data-v-f87c67ca=\"\">1. A highly scalable API that supports Bitcoin, Ethereum, Ripple, and other top chains<br data-v-f87c67ca=\"\">\n2. AML\/KYC data expediting time to market by complying with legal requirements<br data-v-f87c67ca=\"\">\n3. Leading custody solutions using modern multi-party compute (MPC) technology&nbsp;<\/i>","<iframe loading=\"lazy\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK5893909103\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","Stock markets have seen <a href=\"https:\/\/www.reuters.com\/article\/retail-trading-options\/retail-trading-fever-drives-u-s-equity-option-volumes-to-record-monthly-high-idUSL1N2K91CK\" data-v-f87c67ca=\"\">unprecedented levels of trading<\/a> in recent days, fueled by retail trading activity tied to Wall Street Bets. Robinhood — which became <a href=\"https:\/\/www.wsj.com\/articles\/robinhoods-reckoning-can-it-survive-the-gamestop-bubble-11612547759\" data-v-f87c67ca=\"\">the key figure in this drama<\/a> as the venue through which much of the publicly visible trading occurred — has been a focal point of this market backdrop after buckling under the pressure of heightened activity and temporarily limiting purchases of certain stocks, like GameStop and AMC.&nbsp;","In response, Robinhood came forward and tied its response to the underlying settlement infrastructure. Robinhood said in a blog post that the limits on trading were connected to soaring clearinghouse deposit requirements. The firm later <a href=\"https:\/\/blog.robinhood.com\/news\/2021\/2\/2\/its-time-for-real-time-settlement\" data-v-f87c67ca=\"\">said<\/a> that a move to real-time trade settlement would remedy f the issues that faced not only Robinhood but other brokers. Here's from the blog:","\"The clearinghouse deposit requirements are designed to mitigate risk, but last week’s wild market activity showed that these requirements, coupled with an unnecessarily long settlement cycle, can have unintended consequences that introduce new risks.\"","Shane Swanson of Greenwich Associates — a market structure wonk and former director at Citadel Securities — breaks down exactly what happened to the markets last week and why things stopped trading on a new episode of The Scoop podcast.","Here's Swanson:","\"I like to use examples because I am a simple guy and examples seem to help. If I am a broker and I have $10,000 worth of capital and these aren't the accurate numbers, but say that allows me to trade $100,000 worth in the market because I have some leverage capabilities. And I am going to let somebody trade with me and I am going to give them margin which means I'm going to lend them money and they're going to trade, and I am exposed to that lending risk. And they trade all the way up and they use all my $100,000 that I am allowed to expose myself to, once I hit that $100,000 I can't trade anymore. I can't expose myself to any more risk. I have used up the bucket of capital of which I am allowed to trade now.\"","As for what happens next, Swanson told The Scoop that \"it's always hard to go backwards on cost,\" referring to the ramifications of moving from T+2 to a more instant settlement process.","\"It all depends. If the costs are egregious enough that the industry has to absorb commissions could come back. Movement from T-plus 2 to T-plus 1 settlement would be over a long enough time horizon I believe that would not be something that ends up impacting the retail investors in terms of cost,\" Swanson explained.","<em data-v-f87c67ca=\"\">A full summary of this conversation will be published next week. We hope you enjoy the episode.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Shane Swanson","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"AMC","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Spotify","content":"LOCATION"},{"type":"Greenwich Associates","content":"ORGANIZATION"},{"type":"Swanson","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["ROBINHOOD"],"authors":["Frank Chaparro","The Block"]}