{"summary":"Brazil’s securities and exchange commission (CVM) has requested more information from cryptocurrency exchange Mercado Bitcoin about its fixed-income token offering.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173613\/brazils-securities-regulator-asks-mercado-bitcoin-to-clarify-token-information-estadao","publishDate":"2022-09-28T21:13:25","id":12270,"type":null,"title":"Brazil’s securities regulator asks Mercado Bitcoin to clarify token information: Estadão","category":["REGULATION"],"content":["Mercado Bitcoin confirmed it received a request from Brazil's securities and exchange commission that local news outlet <a href=\"https:\/\/www.estadao.com.br\/economia\/negocios\/mercado-bitcoin-cvm-renda-fixa\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Estadão<\/span><\/a> said yesterday was related to its fixed-income token offering.&nbsp;","<span data-v-f87c67ca=\"\">While a spokesperson for the Brazilian crypto exchange confirmed the communication, it did not say how it plans to proceed.<\/span>","<span data-v-f87c67ca=\"\">“We do not carry out a public offering of securities outside the scope of the authorizations we have as an authorized crowdfunding and investment manager platform,” the company said in a Portuguese-language statement, adding that it supports regulation of digital asset service providers.<\/span>","<span data-v-f87c67ca=\"\">Mercado Bitcoin, which offers more than 200 types of digital assets to its more than 3.8 million customers, recorded overall transactions of more than 40 billion reais in 2021 (about $7.44 billion at today’s exchange rate). Among them are a <\/span><a href=\"https:\/\/www.mercadobitcoin.com.br\/tokens\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">variety<\/span><\/a><span data-v-f87c67ca=\"\"> of fixed-income tokens available via the ERC-20 token standard. These require a minimum investment of 100 Brazilian reais ($18.60) and advertise up to double-digit yields depending on the asset.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulator wants to know how much Mercado Bitcoin has raised in these token offerings since January 2020 and if it will keep providing them, <\/span><a href=\"https:\/\/www.estadao.com.br\/economia\/negocios\/mercado-bitcoin-cvm-renda-fixa\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Estadão<\/span><\/a><span data-v-f87c67ca=\"\"> reported. It also wants to see a list of investors who acquired the assets and how much they invested.<\/span>","<span data-v-f87c67ca=\"\">“In relation to the so-called non-security tokens (tokens that do not represent securities), we take due care not to infringe on the scope of action of authorized entities, including consulting the regulator in advance about the structure used for such tokens, at the beginning of our operations in 2020,” Mercado Bitcoin said.<\/span>","<span data-v-f87c67ca=\"\">The CVM does not comment on specific cases, a spokesperson told The Block. However, the regulator did confirm that it asks for more information when necessary if it identifies transactions involving potential securities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The CVM said that “whenever necessary and, in particular, when it identifies possible transactions with potential characteristics of securities, carries out interactions with the participants in order to request information for the due work of analysis of facts and appropriate measures.\"<\/span>","<b data-v-f87c67ca=\"\">New securities guidelines coming for crypto companies<\/b>","<span data-v-f87c67ca=\"\">The CVM is also working on a set of guidelines for crypto companies to better orient themselves around securities rules, which these companies still must follow despite the country’s lack of digital asset regulations.<\/span>","<span data-v-f87c67ca=\"\">\"The CVM is preparing an advisory opinion that will have general directives on the subject,” the regulator told The Block earlier this month. It underscored that the forthcoming directive should be treated as a source of guidelines, rather than crypto-specific regulations.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It is not, at least for the time being, a regulation, given that there is currently no legal provision,” the CVM said in the statement. “The document will be characterized as providing recommendations and guidance to the market.\"<\/span>","<span data-v-f87c67ca=\"\">Cointelegraph Brasil, which <\/span><a href=\"https:\/\/cointelegraph.com.br\/news\/new-cvm-president-warns-ministry-of-economy-that-it-will-regulate-cryptocurrencies\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">first reported <\/span><\/a><span data-v-f87c67ca=\"\">that the CVM was preparing the guidelines, wrote that they would be coming last week. The regulator however said it has not yet defined a date.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A crypto regulation bill in Brazil’s Congress has reached key milestones this year, but it has been stalled in the lower house since the Senate <\/span><a href=\"https:\/\/www.theblock.co\/post\/144267\/brazil-inches-closer-to-finally-regulating-cryptocurrencies\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">approved the proposal in April<\/span><\/a><span data-v-f87c67ca=\"\">. The bill likely will not make any progress before the country’s presidential elections on Oct. 2.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Brazil’s securities regulator arguably has been open to crypto. It has permitted crypto exchange-traded funds and even launched a regulatory sandbox for fintech companies. But at the same time, it has cracked down on crypto companies in certain instances.<\/span>","<span data-v-f87c67ca=\"\">Earlier this month, the CVM <\/span><a href=\"https:\/\/www.in.gov.br\/en\/web\/dou\/-\/ato-declaratorio-cvm-n-20.123-de-2-de-setembro-de-2022-426943543\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blocked<\/span><\/a><span data-v-f87c67ca=\"\"> crypto exchange Bybit from acting as a <\/span><a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/05\/crypto-exchange-bybit-barred-from-brokering-securities-in-brazil\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">securities broker<\/span><\/a><span data-v-f87c67ca=\"\">. It also <\/span><a href=\"https:\/\/www.theblock.co\/linked\/70481\/brazil-binance-derivatives-regulators\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told Binance in 2020<\/span><\/a><span data-v-f87c67ca=\"\"> that it could not offer derivatives products in the country. <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7.44 billion","content":"MONEY"},{"type":"$18.60","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Mercado Bitcoin","content":"PERSON"},{"type":"January 2020","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Oct. 2","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Estadão","content":"ORGANIZATION"},{"type":"” Mercado Bitcoin","content":"ORGANIZATION"},{"type":"Estadão","content":"PERSON"},{"type":"40 billion reais","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"CVM","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}