{"summary":"Utah-based Bioniq unveils Bitcoin Ordinals marketplace using Internet Computer to reduce transaction cost.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265171\/polygon-capital-backed-bioniq-to-leverage-internet-computer-with-new-bitcoin-ordinals-marketplace","publishDate":"2023-11-29T09:29:33","id":12271,"type":null,"title":"Polychain Capital-backed Bioniq to leverage Internet Computer with new Bitcoin Ordinals marketplace","category":["NFT MARKETPLACES"],"content":["Seeking to make the process of buying and selling Bitcoin Ordinals easier and cheaper, Utah-based startup Bioniq is launching a new NFT marketplace.","Bioniq, which is backed by Polychain Capital, said it has set out to help \"people to buy, sell, exchange, and auction their Bitcoin NFTs in the most user-friendly and seamless way while alleviating congestion on the Bitcoin network.\"&nbsp;","Bitcoin <a href=\"https:\/\/www.theblock.co\/post\/263845\/bitcoin-transaction-costs-surpass-those-on-ethereum-amid-ordinals-resurgence\" data-v-f87c67ca=\"\">recently outpaced<\/a> Ethereum in terms of average transaction fees as Ordinals minting and trading rebounded last month. Bitcoin Ordinals are a type of non-fungible token recorded on the Bitcoin network.&nbsp;","\"No major platform or marketplace has been developed yet dedicated to supporting the Bitcoin Ordinals market on a separate Layer 1 without gas or network fees that can scale,\" Bioniq CEO and co-founder Bob Bodily said in a statement. \"While the new Ordinals movement will bring more utility to the BTC network, it also brings congestion and higher network fees.\"","<span data-v-f87c67ca=\"\">Bioniq said it is leveraging the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Internet Computer <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248379\/internet-computer-icp-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Internet_Computer_logo.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ICP<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.19%\n    <\/span><\/a> <!----><\/span><\/span> blockchain's integration with Bitcoin in order to reduce costs and transaction times.<\/span>","\"Because of the Internet Computer's unique architecture, storage costs are far lower,\" the company said.","Internet Computer is a blockchain <a href=\"https:\/\/www.theblock.co\/linked\/104146\/dfinity-launches-internet-computer\" data-v-f87c67ca=\"\">developed by<\/a> a Swiss-based not-for-profit called the Dfinity Foundation. It is intended to work faster than other blockchains and possess unlimited capacity.","If users create and store Ordinals in their Bioniq wallet, they will then be able to \"wrap these assets by sending them to a BTC address generated by a smart contract,\" the company said. \"Wrapping an Ordinal results in an [Internet Computer] NFT that includes all of the details from the original Bitcoin NFT, such as inscription data, metadata, and content, which can then be traded on the <span class=\"il\" data-v-f87c67ca=\"\">Bioniq<\/span> market.\"","\"We watched other marketplaces do softer pivots to Ordinals by including them with their existing offerings only to not get the traction they were looking for because the user experience was too confusing for users,\" said Bodily. \"Bioniq is a dedicated Bitcoin Ordinals marketplace, built for Bitcoin users natively.\"","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">*Corrects headline, story to show Bioniq is backed by Polychain Capital.<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bitcoin NFT","content":"ORGANIZATION"},{"type":"Bob Bodily","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"+0.19%","content":"PERCENT"},{"type":"Dfinity Foundation","content":"ORGANIZATION"},{"type":"Utah","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"ICP","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}