{"summary":"Trader Joe has launched its mainnet on Arbitrum as crypto protocols launch on multiple chains seeking growth.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198131\/dex-trader-joe-is-live-on-arbitrum-amid-trend-to-move-to-multiple-chains","publishDate":"2022-12-27T15:20:44","id":1227,"type":null,"title":"DEX Trader Joe is live on Arbitrum amid trend to move to multiple chains","category":["LAYER 2S AND SCALING"],"content":["Decentralized exchange (DEX) Trader Joe launched its mainnet on Arbitrum, its first move expanding to a chain beyond Avalanche.","The <a href=\"https:\/\/twitter.com\/arbitrum\/status\/1607739757123063808?s=20&amp;t=cf-z7UyT4KL2yOZ1e3ngWQ\" data-v-f87c67ca=\"\">expansion<\/a> from Avalanche’s most widely used application <a href=\"https:\/\/defillama.com\/dexs\/chains\/avalanche\" data-v-f87c67ca=\"\">by volume<\/a> is a significant trend for crypto protocols. They are launching on multiple chains in the hopes of growing and reaching a larger user base from a diminished pool as Layer 1 blockchains see a drop in transactions.","Trader Joe plans to continue its expansion to other chains that have strong decentralized finance (DeFi) activity and expected ecosystem growth, Trader Joe’s pseudonymous Marketing and Communications Lead Blue told The Block.","The DEX’s goal is to increase the usage of its new Automated Market Maker (AMM) model, a technology that’s the biggest such innovation since Uniswap V3, Blue claimed. Uniswap V3 currently has the highest cumulative trading volume across all DEXs, <a href=\"https:\/\/defillama.com\/dexs\" data-v-f87c67ca=\"\">according to DeFiLlama.<\/a>","Arbitrum and Optimism, both of which are Layer 2s built on top of Ethereum that inherit its security properties, have seen consistent growth in transaction count this year, <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/optimistic-rollups\" data-v-f87c67ca=\"\">according to The Block Data.<\/a> Meanwhile, Layer 1 blockchains have seen a decline in the same timeframe.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Joe","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Trader Joe’s pseudonymous Marketing and Communications Lead Blue","content":"ORGANIZATION"},{"type":"The Block Data","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}