{"summary":"The EU&#x27;s commitment to develop a digital euro is doomed to fail, academics claim.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244346\/digital-euro-might-be-dead-on-arrival-experts-forecast","publishDate":"2023-08-11T06:02:46","id":12280,"type":null,"title":"&#x27;Digital euro might be dead on arrival,&#x27; experts forecast","category":["POLICY"],"content":["European economists say the digital euro project could fail because it is designed to protect intermediary banks.","The European Union's commitment to develop a digital euro is doomed to fail, according to a group of academics.&nbsp;","A report by two economists criticized one of the main objectives of the European Central Bank's CBDC design, calling it a risk to the entire project.","\"The project's design choices raise doubts about the <a href=\"https:\/\/www.theblock.co\/post\/204705\/ecb-says-it-will-leave-digital-euro-privacy-decisions-to-eu-lawmakers\" data-v-f87c67ca=\"\">ECB's<\/a> objectives and strategy, as a consequence, the digital euro might well be dead on arrival,\" the duo wrote.&nbsp;","The report's authors <a href=\"https:\/\/cepr.org\/voxeu\/columns\/why-digital-euro-might-be-dead-arrival\" data-v-f87c67ca=\"\">added<\/a> \"Key design options favoured by the Governing Council trim the digital euro's attractiveness rather than increasing it. They include holding limits for consumers (a few thousand euros), even lower ones for merchants (zero).\"","They added that the ECB appears to view these features as permanent.","University of Bern economists Cyril Monnetm and Dirk Niepelt called into question the ECB's objective to \"do no harm to banks and protect their business model,\" raising concerns of potential conflicts of interests in allowing intermediary banks to have responsibility for deploying the <a href=\"https:\/\/www.theblock.co\/post\/236950\/eu-could-move-step-closer-to-digital-euro-this-october-lagarde-says\" data-v-f87c67ca=\"\">digital euro<\/a>.","\"A substantial share of banks’ profits originates from offering payment services. So, banks have no interest in seeing the digital euro alive and well unless digital euro-related bank services such as onboarding or wallet management are even more profitable,\" the report stated.","The paper highlighted that the ECB's plan to impose a negative interest premium on the digital euro during financial stress could reduce its appeal to intermediaries.","The paper added that the digital euro will be \"subpar\" in terms of convenience and privacy, which are claimed to be key adoption drivers. \"The best available private sector solution for retail payments will certainly dominate the digital euro in terms of user convenience. And in terms of privacy vis-à-vis government as well as censorship resistance, many citizens in Europe have limited faith in the ECB,\" the paper argued.","The digital euro is currently in its design phase, and according to ECB officials the earliest possible issuance is 2027. In late June, ECB executive Fabio Panetta said: \"The digital euro is a necessary step to ensure that our monetary system keeps up with digital advances. It will be widely accessible and easy to use while preserving privacy, just like cash.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bern","content":"LOCATION"},{"type":"Fabio Panetta","content":"PERSON"},{"type":"Dirk Niepelt","content":"PERSON"},{"type":"2027","content":"DATE"},{"type":"Governing Council","content":"ORGANIZATION"},{"type":"Cyril Monnetm","content":"PERSON"},{"type":"ECB","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"European Central Bank","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["CBDCS","ECB","EUROPEAN COMMISSION","EUROPEAN COUNCIL","EUROPEAN PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}