{"summary":"Subversive Capital Advisor will close and liquidate the Subversive Metaverse ETF as the firm pivots to artificial intelligence.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231170\/metaverse-etf-punk-meta","publishDate":"2023-05-17T10:49:16","id":12281,"type":null,"title":"Metaverse fund PUNK shutting down as focus shifts to AI","category":["COMPANIES"],"content":["An ETF with a stated purpose of betting against Meta's view of the Metaverse is shutting down after a little more than 15 months and a nearly 30% loss.&nbsp;","Subversive Capital Advisor will close and liquidate the <a href=\"https:\/\/www.prnewswire.com\/news-releases\/subversive-announces-metaverse-etf-closure-301826344.html\" data-v-f87c67ca=\"\">Subversive Metaverse ETF<\/a>, ticker PUNK, as the firm pivots to artificial intelligence.","<a href=\"https:\/\/www.subversiveetfs.com\/punk\/prospectus\" data-v-f87c67ca=\"\">PUNK<\/a> launched in <a href=\"https:\/\/www.prnewswire.com\/news-releases\/subversive-announces-launch-of-metaverse-exchange-traded-fund-301469349.html\" data-v-f87c67ca=\"\">January 2022<\/a> to invest in “companies that provide services and products that support the infrastructure and applications of the Metaverse.” Mark Zuckerberg's company, despite the name, was decidedly not one of those companies.&nbsp;","Subversive Capital said the ETF would focus on \"emerging technological and human advancement requires responsible companies dedicated to the principles of egalitarianism, democracy, sustainability, and facts,\" in its online description of the fund. \"Therefore, we believe that Meta Platforms Inc., the parent company to Facebook, is antithetical to those principals and any market cap above zero is a direct assault on liberal democracy and the survival of our planet.\"","The investment firm is just the latest company to seemingly sour on the metaverse. <a href=\"https:\/\/www.theblock.co\/post\/228541\/meta-zuckerberg-metaverse-ai\" data-v-f87c67ca=\"\">Zuckerberg himself spoke more about artificial intelligence<\/a> and Meta's core products rather than the company's metaverse efforts in its most recent earnings report and analyst call.&nbsp;","<a href=\"https:\/\/finance.yahoo.com\/quote\/META\/\" data-v-f87c67ca=\"\">The ETF shorted Meta<\/a>, which was trading at around $300 the day the fund started trading. Meta tumbled to under $90 in November, and is currently back up around $240.","Companies the fund did invest in included <a href=\"https:\/\/www.trackinsight.com\/en\/fund\/PUNK\" data-v-f87c67ca=\"\">Alphabet, Apple, Nvidia and Microsoft<\/a>, among others. Subversive says it “is dedicated to investing in radical companies whose core missions subvert the status quo and require sophisticated regulatory strategies for success.”","\"We continue to believe Meta's focus is misguided and we've decided to pivot given the rapid advances in more promising technology such as artificial intelligence,” Subversive's portfolio manager, Christian Cooper, said.","The fund will close after the close of business on May 31.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$300","content":"MONEY"},{"type":"January 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"Meta Platforms Inc.","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Meta","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"ETF","content":"ORGANIZATION"},{"type":"Metaverse","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Christian Cooper","content":"PERSON"},{"type":"May 31","content":"DATE"},{"type":"$90","content":"MONEY"},{"type":"$240","content":"MONEY"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}