{"summary":"Azuki, BEANZ, Meebits, CryptoPunks and DigiDaigaku are some of the major NFT projects seeing surges in sales numbers while ether price action bores.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193913\/nft-sales-surge-eth-stagnation","publishDate":"2022-12-11T04:32:41","id":12289,"type":null,"title":"Blue-chip NFT sales surge as ether price stagnates","category":["NFT BRANDS"],"content":["Trading volumes for some top NFT projects are surging while the price of ether stagnates below $1,300.","Over the past 24 hours, \"web3 anime universe\" Azuki has seen an increase of more than 490% in the number of transactions and a 550% increase in the number of sales, according to NFT analytics platform CryptoSlam. Azuki \"sidekicks\" BEANZ has seen a 1,000% increase in the number of transactions and a 631% in the number of sales.","Meanwhile, Meebits has seen a 2,457% increase in transactions and a 1,472% increase in sales. At the same time, fellow Yuga Labs-owned IP CryptoPunks has seen a 300% increase in transactions and a 255% increase in sales.","The list continues — for example, Limit Break's anime-style DigiGaikagu collection has seen a 1,700% increase in the number of transactions and a 1,210% increase in sales during the same period.","Despite a hot past 24 hours, broader NFT trading volumes remain significantly down from their all-time highs.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/nft-trade-volume-by-chain\/embed\" title=\"NFT Trade Volume by Chain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1,210%","content":"PERCENT"},{"type":"1,472%","content":"PERCENT"},{"type":"2,457%","content":"PERCENT"},{"type":"1,000%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"1,700%","content":"PERCENT"},{"type":"300%","content":"PERCENT"},{"type":"$1,300","content":"MONEY"},{"type":"631%","content":"PERCENT"},{"type":"255%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"550%","content":"PERCENT"},{"type":"490%","content":"PERCENT"}],"hashtag":["AZUKI","CRYPTOPUNKS","YUGA LABS"],"authors":["Adam James","The Block"]}