{"summary":"Recently Huobi Wallet has made waves around the industry for launching HClaimer, a new feature that enables users to collect their staking rewards from multiple DeFi projects through just one easy click.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/118740\/why-one-click-collecting-defi-rewards-feature-points-to-the-future-of-decentralized-wallets","publishDate":"2021-09-27T09:09:08","id":12286,"type":null,"title":"Why One-Click Collecting DeFi Rewards Feature Points to the Future of Decentralized Wallets","category":["SPONSORED"],"content":["Recently Huobi Wallet has made waves around the industry for launching HClaimer, a new feature that enables users to collect their staking rewards from multiple DeFi projects through just one easy click. This is the first feature of its kind to be available through a digital asset wallet.&nbsp;The new launch may be a game-changer for the wallet market, as users are increasingly demanding security and convenience when storing their crypto assets.","But let’s take a step back. While the crypto market had once pinned its hopes on wallet products as “a future gateway to the decentralized world”, their features and supporting technologies have since failed to fulfill expectations.","Now things are changing. Crypto wallets are becoming more important as the new wave of DeFi and NFT projects began to shake up the market in 2020. They could very well become our gateway to decentralized finance and the Web 3.0 era.","Crypto wallets have developed rapidly alongside POW miners, as capital and transactions have been vital. After waves of mining, ICO, DApp, etc., the industry witnessed the birth of numerous decentralized wallets. However, only a handful of them have survived.","So far, the industry has yet to see a dominant market leader, and none of the products available now have truly lived up to their mission of bridging blockchain and DeFi.","Although underrated for a period of time, decentralized wallets once again came back to center stage in 2021.","A report from Santiment shows that the amount of ETH held by centralized exchanges continued to decrease since June 2020, when it dropped from 26% to 18% by June 2021.","<img decoding=\"async\" loading=\"lazy\" class=\"size-medium wp-image-118745 aligncenter\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/09\/Picture1-762x450.jpg\" alt=\"\" width=\"762\" height=\"450\" srcset=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/09\/Picture1-762x450.jpg 762w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/09\/Picture1-768x454.jpg 768w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/09\/Picture1.jpg 941w\" sizes=\"(max-width: 762px) 100vw, 762px\" data-v-f87c67ca=\"\">","Where did all these assets go? The answer is simple: decentralized exchanges and decentralized wallets.","Lending, staking, and a surge in new transaction demand have altered transaction habits in the industry. What we see now is the exchange-centered transaction model shifting to a wallet-centered transaction one.","The crypto wallet has gradually changed from a tool for depositing and transferring assets to an application portal for DeFi, DApp, and NFT projects. Wallet+Exchange, Wallet+DeFi, Wallet+Mining, Wallet+NFT are common examples.","DeFi, NFT, and chain games are introducing large-scale user traffic to crypto wallets. At the end of April this year, MetaMask’s monthly active users reached five million, increasing by fivefold compared to just six months ago. Growth was driven by a sharp rise in users from emerging economies in Asia, Africa and South America.","Venture capital funds are capitalizing on this promising opportunity. Crypto wallets are gaining traction from the likes of a16z, Galaxy Digital, Hashed, Polychain Capital, 10T Fund、Auzera, etc., raising over 500 million US dollars since the beginning of 2021.","Wallets as a Gateway to the World of Crypto","Security, speed, and efficiency are the three basic criteria for users to judge whether or not a wallet is good.","Users are looking for a secure and efficient way to participate in the development of DeFi and NFT projects.","Users also use their wallets to participate in mining more frequently. However, users may feel annoyed when it comes to managing digital assets and making cross-chain transactions under different protocols from different platforms.","In addition, DApps have different designs, confusing many users as they struggle to make sense of what’s going on. In the context of today’s rapidly evolving markets, every second counts. These obstacles may cause these DApps to lose users and revenues.","Huobi Wallet’s Innovations and Solutions","To address these pain points, Huobi Wallet decided to provide its users with integrated and user-friendly features, while at the same time striving to ensure asset security.","At the end of March this year, Huobi Wallet launched a “real-time tracking of mining revenue” function, which is called HTracker. It’s an efficient DeFi asset management tool for users and supports the tracking of DeFi rewards on public chains such as ETH, HECO, and BSC.","Five months later, Huobi Wallet launched its HClaimer function, a new feature that enabled users to collect staking rewards from multiple DeFi projects with just one click.","How does HClaimer work? Users can click on the “My Assets” button to see their total assets, fund distribution, and income streams from each project in the “Invested” column. By clicking the floating “Rewards” window, they can collect their staking rewards from all projects. With this function, users do not need to search the official websites of each project, making the process much more efficient. Within just 52 seconds, users can collect their staking rewards from eight different projects and 17 different pools.","","","","","This may seem like a small step, but Huobi Wallet invested a significant amount of time and capital into developing this feature.","According to Huobi Wallet, each chain or each DApp requires different operations for collecting staking rewards. In order to collect the various rewards of different Dapps across different chains in a single wallet app, a unified compatible adaptation structure for all Dapps was needed.","Only with significant R&amp;D effort was Huobi Wallet able to build such a rewards-oriented technology architecture to support all DApp types.","During the first phase, Huobi Wallet’s new function is supporting 18 HECO projects such as MDEX, FilDA, and EarnDeFi; this list is likely to expand to more mainstream DeFi projects over the next two months.","“Our research and development team has worked diligently to obtain feedback from our customers, build out the infrastructure for HClaimer, and ultimately introduce this product to our user base,” said Liser Lee, Head of Huobi Wallet. “We hope that this small step forward can drive other industry players to develop new functions and improve their products, so that we can all provide the best user experience.”","In the past, wallets may not have had many application scenarios, but the development of DeFi has created more room for imagination.","The crypto wallet market is still in its early stages, but for DeFi mining, the introduction of one-click collection and real-time tracking of mining rewards has enabled Huobi Wallet to differentiate itself from its peers.","Huobi Wallet could leverage this opportunity to increase user balances and stickiness; it could even compete with other market players such as MetaMask, TokenPocket, and MathWallet.","As crypto wallets continue to become mainstream, they are not only a tool to store digital assets, but also the gateway to DeFi, NFTs, and GameFi. With the fast development of the crypto world, Huobi Wallet will not only keep up with the fast pace, but also create more leading functions for users in the future.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Huobi Wallet","content":"ORGANIZATION"},{"type":"June 2020","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"500 million US dollars","content":"MONEY"},{"type":"April this year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"18%","content":"PERCENT"},{"type":"South America","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"26%","content":"PERCENT"},{"type":"BSC","content":"ORGANIZATION"},{"type":"Liser Lee","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Africa","content":"LOCATION"},{"type":"Head of Huobi Wallet","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"March this year","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}