{"summary":"Gabriel Shipton explains how a DAO set up to raise funds for the WikiLeaks founder is helping support his legal defense.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142670\/julian-assanges-brother-assangedao-helps-wikileaks-founder-take-legal-fight-to-us","publishDate":"2022-04-20T15:11:35","id":12283,"type":null,"title":"Julian Assange’s brother: AssangeDAO helps fight the US on its own turf","category":["LAYER 1S"],"content":["A DAO set up to provide funds for Julian Assange to fight American espionage charges is helping him take \"aggressive\" legal action in the US,&nbsp;according to Assange’s brother, Gabriel Shipton.","Speaking on a <a href=\"https:\/\/www.orchid.com\/podcast\/episode-92-gabriel-shipton\/\" data-v-f87c67ca=\"\">podcast<\/a> produced by the privacy-focused crypto project Orchid on Wednesday, Shipton explained that the $53 million donated to the DAO was sent to a German foundation that has been supporting Assange’s defense for several years. The new funds will allow it to take the fight to the US courts as his extradition to America looks ever more likely.","“Particularly in the US, there’s been a real lack of resources to be able to fight the case where it originates,” said Shipton, who is a core contributor to AssangeDAO. “Now Julian has those resources at hand and he can really fight back now rather than just fighting in the courts in the UK, which has been the focus. He can be aggressive and take aggressive legal action and really take it to where the charges originate.”","Assange is facing US charges of illegally obtaining, receiving and disclosing classified information, related to his operation of the WikiLeaks website.&nbsp;The UK's supreme court last month refused him permission to appeal against extradition to the US, a decision <a href=\"https:\/\/www.theguardian.com\/media\/2022\/apr\/20\/uk-court-approves-extradition-of-julian-assange-to-us\" data-v-f87c67ca=\"\">formally confirmed<\/a> today.&nbsp;","Shipton said the ability of the crypto community to raise funds for such causes could make authorities think twice about prosecuting individuals.&nbsp;","“It means 'well the next time we want to do this, we have to take that into account.' That the crypto community doesn’t really want to be fucked with. At the end of the day they want their rights and they want to be protected and they can do that through saving Julian,” he said.","AssangeDAO was formed in December 2021, with the goal of raising funds that would be used to support Assange’s legal defense. The DAO — effectively a group of people working with a common goal — issued a token and then used these funds to <a href=\"https:\/\/www.theblockcrypto.com\/post\/133616\/assangedao-wins-julian-assange-x-pak-nft-for-53-million\" data-v-f87c67ca=\"\">purchase an NFT<\/a> that was being sold by Assange in collaboration with digital artist Pak.&nbsp;","The DAO has had its difficulties, however. According to <a href=\"https:\/\/www.coindesk.com\/layer2\/2022\/03\/08\/assangedao-raised-56m-and-quickly-split-up-was-it-still-a-success\/\" data-v-f87c67ca=\"\">CoinDesk<\/a>, there was a lot of disagreement over whether the DAO should bid all of the funds raised on the NFT, or keep some for itself. The publication claims the main leaders have largely stepped back from the project. During this time, the token, which was initially valued at around $0.0015, has slid to its current price of $0.00048, down 68%.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gabriel Shipton","content":"PERSON"},{"type":"$0.00048","content":"MONEY"},{"type":"Julian Assange","content":"PERSON"},{"type":"Julian","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$0.0015","content":"MONEY"},{"type":"$53 million","content":"MONEY"},{"type":"December 2021","content":"DATE"},{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"68%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Shipton","content":"PERSON"},{"type":"DAO","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}