{"summary":"Microsoft Gaming CEO Phil Spencer said he believes that gamers have already been in the metaverse for 30 years — but understands why some are hesitant about it at the moment.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166164\/microsoft-gaming-ceo-phil-spencer-gets-why-some-gamers-dont-like-the-metaverse","publishDate":"2022-08-28T06:35:11","id":12287,"type":null,"title":"Microsoft Gaming CEO Phil Spencer gets why some gamers don&#x27;t like the metaverse","category":["GAMING AND METAVERSE"],"content":["Microsoft Gaming CEO Phil Spencer said he believes that gamers have already been in the metaverse for 30 years — but understands why some are hesitant about it at the moment.","Speaking with <a href=\"https:\/\/www.youtube.com\/watch?v=0T4WQ23NgtU\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Bloomberg Studio 1.0<\/a> on Friday, he suggested that gamers don't \"get\" the metaverse because the technologies proponents claim as novel are ones they have experienced in games for years.","\"It’s not at all surprising to me that gamers might look at metaverse and think... I already have an avatar of myself, I can already go into a shared world and I can already have voice conversations,\" he said.","He also said he was \"cautious\" about some trends, including play-to-earn, because they create a \"workforce out of players for certain players to monetize.\"","Spencer has previously been critical of blockchain games' use of play-to-earn and NFTs, and Microsoft has laid down the law when it comes to their platforms being used for \"exploitative\" projects.","In July, Mojang Studios, which is owned by Microsoft, <a href=\"https:\/\/www.theblock.co\/post\/158759\/minecraft-developer-mojang-to-restrict-use-of-nfts-blockchain-tech-with-guideline-update?utm_source=rss&amp;utm_medium=rss\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">updated its community guidelines<\/a> for Minecraft to prevent projects with NFTs using the platform. The decision was a blow in particular to metaverse platform NFT Worlds, which was forced to <a href=\"https:\/\/www.theblock.co\/post\/159002\/nft-worlds-to-have-plan-of-action-by-end-of-week-following-minecraft-nft-ban\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">discontinue using Minecraft<\/a> as the basis of its virtual world.&nbsp;","That said, Spencer admitted that monetization among players already exists in web2 games.","\"There have been gold farmers, people who literally just spend their time doing some menial task in a game to accrue some currency that they can then sell to some other rich player for real money, so that person doesn't have to spend their time... But now you find games that are starting to build that into the economy of the game itself,\" he said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Phil Spencer","content":"PERSON"},{"type":"Spencer","content":"PERSON"},{"type":"Bloomberg Studio","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Mojang Studios","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}