{"summary":"The Californian regulator released 16 alerts for suspected crypto scammers over Dec. 27 and 28.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198336\/scam-alert-california-16-warning-regulator","publishDate":"2022-12-29T06:27:01","id":12290,"type":null,"title":"California regulator issues barrage of crypto scam warnings","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">California’s financial regulator released a barrage of 16 crypto scam alerts between Dec. 27 and 28, warning consumers of potentially fraudulent crypto websites and brokers.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The California Department of Financial Protection and Innovation rarely releases more than one warning at a time, but seems to have made an exception for crypto. Its previous crypto scam alert bombardment took place on Jun. 15, when 26 notices were pushed out.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">From romantic swindling schemes to advance fee scams, victims <\/span><a href=\"https:\/\/dfpi.ca.gov\/2022\/12\/28\/cryptocurrency-broker-simex-appears-to-be-engaged-in-fraud-against-california-consumers\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">totted up<\/span><\/a><span data-v-f87c67ca=\"\"> to losses of up to $1.2 million, the regulator said. Many fell into the trap following friendly social media messages that built a relationship between the victim and the scammer.<\/span>","<span data-v-f87c67ca=\"\">Some of the sites attempted to dupe well-known entities, with names such as “eth-Wintermute.net,” “UniSwap LLC” and “RB Hood.”<\/span>","<span data-v-f87c67ca=\"\">“The DFPI urges consumers to exercise extreme caution before responding to any solicitation offering investment or financial services,” the regulator wrote.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"California Department of Financial Protection and Innovation","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Jun. 15","content":"DATE"},{"type":"UniSwap LLC","content":"ORGANIZATION"},{"type":"Dec. 27","content":"DATE"},{"type":"$1.2 million","content":"MONEY"}],"hashtag":[],"authors":["Inbar Preiss","The Block"]}