{"summary":"Coin Metrics, a cryptoasset data provider, released a report titled: “An Analysis of Kin’s On-Chain Activity,” Kin’s blockchain activity to address two claims made by Kik on its usage\nThe report addresses the claims that Kin’s blockchain exceeds Ethereum and Bitcoin in daily blockchain activity and the claims that there are over 300,000 people who earn and spend Kin","author":["Steven Zheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/28682\/coin-metrics-report-blockchain-activity-shows-kiks-claim-that-kin-is-more-widely-used-than-bitcoin-or-ethereum-is-inaccurate","publishDate":"2019-06-24T11:22:15","id":1229,"type":null,"title":"Coin Metrics report: Blockchain activity shows Kik&#x27;s claim that Kin is more widely used than Bitcoin or Ethereum is inaccurate","category":["Research"],"content":["Cryptoasset data provider <a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/coinmetrics.io\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-href=\"https:\/\/coinmetrics.io\/\" data-v-f87c67ca=\"\">Coin Metrics <\/a>has released a report showing Kik's claims about its level of blockchain activity and adoption rates for its cryptocurrency Kin are inaccurate.","The <a href=\"https:\/\/coinmetrics.io\/an-analysis-of-kins-on-chain-activity\/\" data-v-f87c67ca=\"\">report<\/a>, titled: “An Analysis of Kin’s On-Chain Activity” was released today. It analyzed Kin’s blockchain activity to address two specific claims made by Kik on its usage:","To analyze Kin’s on-chain activity, Coin Metrics first notes that because Kin has gone through multiple infrastructure changes (there are three versions of the Kin blockchain since launch), the firm will only analyze data from Kin 2 and Kin 3. Kin 2 is a centralized version of Kin’s blockchain designed to be a mid-point for fully transitioning to Kin 3, a blockchain forked from the Stellar protocol.","According to Coin Metrics, due to their infancy, blockchains do not share the same level of standardization as traditional applications for estimating activity, such as daily active users. As such, Coin Metrics addresses blockchain activity using two criteria: Operations Count (which Kin uses as evidence to support its claims of activity) and Transfer value.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Operations Count<\/strong>","Kik defines blockchain activity as “the number of operations on the blockchain in the last 24 hours.” According to Coin Metrics, there are two distinct operations that happen on Kin’s blockchain: payments and account creation. Unlike Bitcoin and Ethereum, account creation is recorded as blockchain activity on Kin 3. As such, blockchain data shows that over the past three months, 36% of Kin 2 operations and 72% of Kin 3 operations have been account creations.","And while account creation on Kin could be a good gauge for blockchain activity, Coin Metrics notes that Kin’s blockchain does not require a minimum account balance even though Stellar, the blockchain from which Kin is forking its code, requires a “base reserve” to “prevent empty addresses from bloating the blockchain.” Therefore, Kin accounts can remain empty indefinitely. In fact, roughly 93% of all Kin accounts are empty.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Transfer Value<\/strong>","Because low-fee blockchains like Kin are inexpensive to transfer transactions on, transfer value, according to Coin Metrics, “is often quite noisy.” An example of “noise,” is if a user moves money between different accounts they own. Coin Metrics has devised an “adjusted transfer value” metric, to remove what it deems noise and spammy behavior. This resulted in the following conclusions:","For the first claim, Coin Metrics concludes that, by its nature, a microtransaction platform like Kin will have more transactions with smaller amounts. However, this blockchain activity is ultimately up to how one defines it. If activity were to be measured by payments count, Kin would be considered the most active blockchain. If measured by transfer value, Kin would be considered the least active.","According to Coin Metrics, while traditional applications use personal information to identify unique users, blockchains only have addresses, which makes it difficult to determine how many individuals are actually using a blockchain.","For its analysis, Coin Metrics uses “active addresses” to address Claim 2. Because Claim 2 is about the number of spenders and earners on Kin, Coin Metrics filtered its data to focus on addresses making payments on Kin’s blockchain. They conclude that:","Coin Metrics also adds that, at its peak, there have only been roughly 35,000 Kin addresses with more than 10,000 Kin ($0.23 at time of writing). “This is orders of magnitude less than other blockchains in our sample, which each have at least 1,000,000 addresses that hold at least $1 USD,” Coin Metrics concludes.","For Claim 2, Coin Metrics concludes that “although Kin has a relatively high number of active addresses, it has a relatively low amount of addresses with a significant account balance,” and that user comparisons across chains are tricky because they have different use cases and operating costs."],"hashtag":[]}