{"summary":"The SEC said that it filed a letter with the SDNY seeking leave for an interlocutory appeal of the summary judgement order in the Ripple Labs case.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244036\/sec-files-letter-with-sdny-seeking-leave-for-interlocutory-appeal-in-ripple-case","publishDate":"2023-08-09T17:25:01","id":12299,"type":null,"title":"SEC files letter seeking leave for interlocutory appeal in Ripple Case","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission said Wednesday that it planned to challenge a partial defeat in its ongoing case against <a href=\"https:\/\/www.theblock.co\/post\/241061\/sec-appeal-ripple-setback\" data-v-f87c67ca=\"\">Ripple Labs<\/a>, telling the court in the Southern District of New York that it will seek an <\/span><span class=\"s1\" data-v-f87c67ca=\"\">an interlocutory appeal.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“Interlocutory review is warranted here,\" it said in a letter to Judge Analisa Torres. \"These two issues involve controlling questions of law on which there is substantial ground for differences of opinion, as reflected by an intra-district split that has already developed.”<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency cited a recent <a href=\"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs\" data-v-f87c67ca=\"\">case<\/a> against Terraform Labs, where a judge rejected Torres’ approach. An SEC official declined to comment when asked if that influenced its appeal.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Torres <\/span><span class=\"s2\" data-v-f87c67ca=\"\">ruled last month that some of Ripple’s sales, called programmatic, of XRP did not violate securities laws because of a blind bid process in place for them. She also ruled that other direct sales of the token to institutional investors were securities.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC is looking to specifically appeal the part of the decision about the programmatic sales as well as “other distributions” that included offers and sales of XRP in exchange for goods and services, an SEC official said in a media briefing.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC also said in its motion that an interlocutory review would \"advance the termination of this litigation in an efficient manner by removing the possibility of two remedies phases and two trials.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC needs approval from the United States District Court Southern District of New York to appeal, and then from the court of appeals. If both of those things happen, then the SEC would need permission from the Second Circuit which then would look into the interlocutory appeal.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC and Ripple have been embroiled in a legal fight since 2020, when the agency accused Ripple of raising $1.3 billion in 2020 through the sale of XRP, which it says is an unregistered security, while also charging Garlinghouse and Larsen.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ripple too could appeal Torres' ruling. The <a href=\"https:\/\/www.theblock.co\/post\/239474\/ripples-xrp-token-surges-28-as-court-issues-ruling-sends-case-to-trial\" data-v-f87c67ca=\"\">partial victory<\/a> for the company last month was viewed as a watershed moment for the industry and sent the XRP token surging as much as 80%.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Gary DeWaal, senior counsel at the law firm Katten, said in an email that he expected the SEC to appeal, adding that “<\/span><span class=\"s1\" data-v-f87c67ca=\"\">it would not be surprising if Ripple makes a similar request in connection with the Court’s decision regarding the Institutional Sales.”<\/span>","Ripple will file its response with the court next week, said Stuart Alderoty, the firm's chief legal officer in a tweet on Wednesday.&nbsp;&nbsp;","(<em data-v-f87c67ca=\"\">Updates with Stuart Alderoty comment<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Garlinghouse","content":"PERSON"},{"type":"Second Circuit","content":"ORGANIZATION"},{"type":"Gary DeWaal","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Katten","content":"PERSON"},{"type":"Torres","content":"PERSON"},{"type":"Larsen","content":"PERSON"},{"type":"Analisa Torres","content":"PERSON"},{"type":"United States District Court Southern District of New York","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Stuart Alderoty","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"XRP","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}