{"summary":"Art Gobblers, a collection of NFTs designed by Rick &amp; Morty co-creator Justin Roiland, has seen a significant decline in its floor price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183441\/art-gobblers-nft-prices-trading-volumes-blur","publishDate":"2022-11-05T09:51:30","id":12293,"type":null,"title":"Art Gobblers NFT prices tumble as trading volumes dominate on Blur","category":["NFTS"],"content":["Art Gobblers, a collection of fully animated ERC721 nonfungible tokens designed by Rick &amp; Morty co-creator Justin Roiland, has seen a significant decline in its floor price.","After numerous sales for upwards of 17 ETH ($27,940) occurred on OpenSea in the days after minting began, the floor price on the NFT marketplace was 6.5 ETH ($10,683), with the best offer of 5.4 ETH ($8,875), as of 9 a.m. ET. On rival NFT marketplace startup Blur, the floor price was 5.90 ETH ($9,697), with recent sales touching as low as 5.01 ETH ($8,234).","The price declines represent a loss of 25% on the day, according to Blur, and almost 36% over the past 24 hours, according to Gem.","Trading of the Paradigm-backed Art Gobblers NFTs has dominated the sector in recent days — with a total volume of 10,441 ETH ($17,159,575) on OpenSea and a seven-day volume of 38,633.85 ETH ($63,493,960) on Blur. Art Gobblers has been most closely associated with the latter marketplace, despite both OpenSea and Blur <a href=\"https:\/\/www.paradigm.xyz\/portfolio\" data-v-f87c67ca=\"\">accompanying<\/a> the NFT project on crypto VC firm Paradigm's portfolio.","Art Gobblers has not arrived without its share of criticism from the NFT and crypto community. Some have expressed dissatisfaction with the project <a href=\"https:\/\/twitter.com\/artgobblers\/status\/1570502481389715457\" data-v-f87c67ca=\"\">hand-picking<\/a> individuals — who, in turn, chose other individuals — for the initial allowlist spots. Others have <a href=\"https:\/\/twitter.com\/FFVV1211\/status\/1587200384048979969\" data-v-f87c67ca=\"\">claimed<\/a> that influencers promoted the project without disclosing their alleged arrangements with the Art Gobblers teams. Meanwhile, some have gone so far as to make unsubstantiated claims the recent price action <a href=\"https:\/\/twitter.com\/JamesCryptoNova\/status\/1588613155965763584\" data-v-f87c67ca=\"\">indicates<\/a> a coordinated pump-and-dump from insiders. Many Art Gobblers proponents, however, <a href=\"https:\/\/twitter.com\/Loopifyyy\/status\/1587481511766409220\" data-v-f87c67ca=\"\">say<\/a> these are baseless allegations.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$63,493,960","content":"MONEY"},{"type":"$27,940","content":"MONEY"},{"type":"Justin Roiland","content":"PERSON"},{"type":"$8,875","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$8,234","content":"MONEY"},{"type":"$17,159,575","content":"MONEY"},{"type":"Rick &amp; Morty","content":"ORGANIZATION"},{"type":"$10,683","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Paradigm","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"36%","content":"PERCENT"},{"type":"$9,697","content":"MONEY"},{"type":"9 a.m. ET","content":"TIME"}],"hashtag":["BLUR"],"authors":["Adam James","The Block"]}