{"summary":"Intercontinental Exchange, the parent company of the New York Stock Exchange, has expanded its crypto data product, the company said in a LinkedIn post","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8679\/the-parent-company-of-the-new-york-stock-exchange-has-expanded-its-crypto-data-product","publishDate":"2019-01-24T12:30:31","id":1229,"type":null,"title":"New York Stock Exchange parent company has expanded its crypto data product","category":["CRYPTOCURRENCY"],"content":["Intercontinental Exchange, the parent company of the New York Stock Exchange, has expanded its crypto data product, the company said in a LinkedIn post Thursday.","\"Our enhanced crypto data feeds provides greater transparency,\" the Atlanta-based firm wrote. According to the post, the product now provides trading data on over 400 crypto and fiat pairs covering 30 marketplaces.&nbsp;","","","The feed covers 60 cryptocurrencies, <a href=\"https:\/\/www.theice.com\/market-data\/connectivity-and-feeds\/consolidated-feed\/coverage-list\/cryptocurrencies?utm_source=linkedin&amp;utm_campaign=7010L0000003Vrg&amp;utm_content=v3\" data-v-f87c67ca=\"\">according to ICE's site<\/a>. The update went live in the firm's product environment on Monday, according to a person familiar with the situation.&nbsp;","ICE, which is also known in the crypto world for being the company behind Bakkt, first jumped into the crypto market with a data feed it rolled out at the beginning of 2018, partnering with Blockstream, a firm aimed at building out bitcoin infrastructure. The so-called Cryptocurrency Data Feed drew data from just 15 exchange venues when it first went live.&nbsp;","The feed joined a family of more than 450 real-time data feeds operated by ICE when it launched in 2018. The feed transmits trading data over ICE's high-speed network to a number of hedge funds and trading firms.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Blockstream","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Atlanta","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Bakkt","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}