{"summary":"Roblox’s growth engine kept on chugging along during the first quarter of the year with increases in daily users and sales of its in-game digital","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230204\/roblox-collects-774-million-selling-in-game-digital-currency-as-users-hits-all-time-high","publishDate":"2023-05-10T08:47:20","id":12307,"type":null,"title":"Roblox collects $774 million selling in-game digital currency as users hits “all-time high”","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Roblox’s growth engine kept on chugging along during the first quarter of the year with increases in daily users and sales of its in-game digital currency, \"Robux.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The metaverse-y game platform, a social gathering place for many players, reported $774 million in “bookings,” a 23% increase when compared to the previous year, according to the company’s earning statement.&nbsp; Roblox classifies “bookings” as the revenue generated when users purchase \"Robux,\" an in-app currency with which users can customize their avatars.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Daily active users rose to 66.1 million, a 22% increase when compared to the same period in 2022, the company also said. <\/span><span data-v-f87c67ca=\"\">Roblox CEO David Baszucki said the number of users was an “all-time high\" and that the goal was to <\/span>hit 1 billion daily active users.&nbsp;","<span data-v-f87c67ca=\"\">“The momentum in our business demonstrates the success of our creator community as they bring their visions to life on Roblox, attracting an ever-growing global user base that spans all ages,” said Baszucki.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Revenue also increased to $655.3 million, a 22% year-over-year, Roblox said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$774 million","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"David Baszucki","content":"PERSON"},{"type":"23%","content":"PERCENT"},{"type":"22%","content":"PERCENT"},{"type":"$655.3 million","content":"MONEY"},{"type":"Baszucki","content":"PERSON"},{"type":"Roblox","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}