{"summary":"Alabama Congressman Barry Moore has purchased a range of cryptocurrencies in recent months.\nAccording to current prices, he’s down on all of his crypto investments so far.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110616\/us-congressman-buys-dogecoin-ethereum-and-cardano-amid-bull-market","publishDate":"2021-07-06T17:18:46","id":1230,"type":null,"title":"US congressman buys Dogecoin, Ethereum and Cardano amid bull market","category":["Investments"],"content":["Alabama Congressman Barry Moore has been buying dogecoin (DOGE), ether (ETH) and cardano (ADA) in recent months, according to <a href=\"https:\/\/disclosures-clerk.house.gov\/public_disc\/ptr-pdfs\/2021\/20018999.pdf\" data-v-f87c67ca=\"\">trading disclosures<\/a> filed with the clerk of the House of Representatives on July 2.","Specifically, on May 5, Moore bought \"Etherium\" [sic], followed by three purchases of cardano on May 10, 11 and 13 before buying dogecoin on June 13.","The disclosures do not specify how much of each coin Moore invested in, but give a range of $1,000-$15,000 for each purchase. That means he's bought between $5,000 and $75,000 in total.","Aside from the misspelling of the words Ethereum — and, indeed, \"cryto,\" — the presence of cardano on the balance sheet suggests that he was buying on a crypto exchange, as ADA is not available on more mainstream trading platforms with crypto options, like Robinhood or PayPal.&nbsp;","But so far, Moore's trading has not played out in his favor. <a href=\"https:\/\/coinmarketcap.com\/currencies\/cardano\/\" data-v-f87c67ca=\"\">ADA<\/a> was between $1.65-$1.90 on the days he was buying, but has since fallen to $1.41 as of publication. <a href=\"https:\/\/coinmarketcap.com\/currencies\/ethereum\/\" data-v-f87c67ca=\"\">ETH<\/a> went from around $3,000 on the day of Moore's purchase to a peak of around $4,330 on May 13. Yet it too has fallen and is currently sitting around $2,300.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/eth-price\/embed\" title=\"ETH Price\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Though Moore's <a href=\"https:\/\/coinmarketcap.com\/currencies\/dogecoin\/\" data-v-f87c67ca=\"\">DOGE<\/a> investment came well after its catastrophic fall — when <a href=\"https:\/\/www.theblockcrypto.com\/linked\/104398\/elon-musk-twitter-poll-tesla-dogecoin\" data-v-f87c67ca=\"\">Elon Musk<\/a> appeared on SNL calling himself the <em data-v-f87c67ca=\"\">dogefather — <\/em>the meme token has still slipped from his purchase price of $0.31 to $0.23.","Moore's filings are part of disclosure requirements mandated by the \"Stop Trading on Congressional Knowledge Act,\"or <a href=\"https:\/\/www.congress.gov\/112\/plaws\/publ105\/PLAW-112publ105.htm\" data-v-f87c67ca=\"\">STOCK Act.<\/a> The act requires reporting on trades \"not later than 30 days after receiving notification of any transaction required to be reported under section 102(a)(5)(B), but in no case later than 45 days after such transaction.\"","While the July 2 filing seems to be late for all but the dogecoin purchase, there's no telling if he has sold those tokens in recent weeks. Moore is also new to Congress this year and received an <a href=\"https:\/\/disclosures-clerk.house.gov\/public_disc\/financial-pdfs\/2020\/30011716.pdf\" data-v-f87c67ca=\"\">extension<\/a> on the overall report of holdings that members of Congress must produce, meaning any pre-existing holdings are not yet a matter of public record.&nbsp;","A member of Moore's staff has not responded to The Block's request for confirmation as of publication time.&nbsp;"],"hashtag":["CARDANO","CONGRESS","DOGECOIN"]}