{"summary":"The project launched its second collection of &quot;LPs&quot; or tracks on Monday, with the auction ending today at noon EST.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100099\/eulerbeats-nft-arts-music-second-collection-sale","publishDate":"2021-03-31T19:31:10","id":12310,"type":null,"title":"NFT music and arts project EulerBeats sells second collection for $3M","category":["NFTS"],"content":["Music and art non-fungible token (NFT) project EulerBeats has sold its latest collection of 27 original tracks, Enigma, for $3 million.&nbsp;","The project launched its second collection of \"LPs\" or tracks on Monday, with the auction ending Wednesday at noon EST. According to project co-founder Tyler Mulvihill, the team auctioned off the first 25 LPs on NFT marketplace OpenSea. LP 26 was given to a community DAO for LP and print owners of EulerBeats' first collection, Genesis.","\"We're proud of our team and excited for the community of Original and Print owners of both Enigma and Genesis to watch and listen to their new art and music,\" Mulvihill told The Block.","EulerBeats (pronounced oiler-beats) is an Ethereum-based project that features <a href=\"https:\/\/www.theblockcrypto.com\/daily\/99596\/eulerbeats-ethereum-nft-artist-payments\" data-v-f87c67ca=\"\">algorithmically-generated audio tracks<\/a>. These tracks are accompanied by visuals, which are also created algorithmically through the use of smart contracts.&nbsp;","What distinguishes EulerBeats from other NFT projects is its revenue model. The project uses a token standard called ERC-1155, which creates tokens that are both non-fungible and fungible. There are essentially two types of EulerBeats: original LPs, which are non-fungible, and “prints” of the LPs, which are reproductions of the original. The prints are priced on a bonding curve, with the price exponentially increasing as more prints are created.&nbsp;","LPs from the first collection, Genesis, could be reproduced a maximum of 120 times. LPs from the second collection, Enigma, can be reproduced a maximum of 160 times.&nbsp;","Each time a print is created, the owners of the original LP earn 8% of the revenue. According to a Dune Analytics <a href=\"https:\/\/duneanalytics.com\/chubbyavo\/EulerBeats-Enigma\" data-v-f87c67ca=\"\">analysis<\/a> by @ChubbyAvocado, 87.5 ETH in royalties already paid to OG holders of Enigma collection.&nbsp;","Four of the Enigma LPs, LP 02, 04, 17, and 20, were bought by a 54-member collective called \"<a href=\"https:\/\/twitter.com\/BeetsDAO\" data-v-f87c67ca=\"\">BEETSDAO.<\/a>\" According to one of the DAO co-founders, Jordan Garbis, the team wants to build a token to represent their LP collection and the capability of the EulerBeats community to do things like stake prints they currently own. While the token is currently restricted to the private, member-only DAO, it eventually wants to make the token public.","\"Revenue-generating NFTs are the future,\" Garbis told The Block in a phone interview. \"We wanted to create a way to fractionalize and democratize access to NFTs.\"","The token will be similar to the B20 token, a token developed by decentralized token swap protocol <a href=\"https:\/\/blog.whalestreet.xyz\/\" data-v-f87c67ca=\"\">WhaleStreet<\/a>. The B20 token fractionalized ownership over 20 pieces by popular digital artist Beeple, who sold his 5000-day collection for $<a href=\"https:\/\/www.theblockcrypto.com\/linked\/98047\/christies-beeple-auction-ends-digital-art\" data-v-f87c67ca=\"\">69.4 million<\/a> in a widely-covered auction. However, according to Garbis, the biggest difference is that BEETSDAO's token will eventually generate revenue. This revenue, he said, will go into paying print holders in the form of incentives, by hosting airdrops, or by simply reinvesting back into the DAO.&nbsp;","<span data-v-f87c67ca=\"\">\"NFTs are still in their infancy but this is the future of what copyright could be,\" he said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"$<a href=\"https:\/\/www.theblockcrypto.com\/linked\/98047\/christies-beeple-auction-ends-digital-art\" data-v-f87c67ca=\"\">69.4 million","content":"MONEY"},{"type":"LP","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1155","content":"DATE"},{"type":"Jordan Garbis","content":"PERSON"},{"type":"Beeple","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"Mulvihill","content":"PERSON"},{"type":"Garbis","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"5000","content":"DATE"},{"type":"Enigma","content":"LOCATION"},{"type":"Tyler Mulvihill","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["OPENSEA"],"authors":["Saniya More","The Block"]}