{"summary":"Now, Cyber’s founder Rayan Boutaleb tells The Block that it quietly raised $6.7 million in November in a round led by Variant.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/130495\/metaverse-startup-cyber-fundraise","publishDate":"2022-01-20T13:00:20","id":12311,"type":null,"title":"Metaverse startup Cyber raises $6.7 million from big name NFT investors","category":["NFTS"],"content":["It’s been a busy few months in the metaverse for Cyber, a startup that builds virtual showrooms for non-fungible tokens (NFTs).","Cyber has just unveiled new functionality that allows users to connect with each other using a portal with ‘doorways’ — each leading to a gallery curated by a different user. The firm had posted <a href=\"https:\/\/twitter.com\/oncyber_io\/status\/1480286576781369345\" data-v-f87c67ca=\"\">a teaser<\/a> of the portal product on Twitter on January 10.","Now, Cyber’s founder Rayan Boutaleb tells The Block that it quietly raised $6.7 million in November in a round led by Variant, the ‘ownership economy’ seed-stage investor that itself <a href=\"https:\/\/variant.fund\/writing\/fund-ii-announcement\" data-v-f87c67ca=\"\">raised $110 million<\/a> for its second fund in October.","A bevy of big-name NFT collectors also invested — including Cozomo de’ Medici, artist Joey Colombo, Product Hunt founder Ryan Hoover, Adobe’s chief product officer Scott Belsky, Not Boring founder Packy McCormick, Art Blocks founder Erick Calderon, and the pseudonymous trio of 6529, DeeZe and Gmoney. Three Arrows Capital and TCG Capital Management, the investment firms, also participated.","Boutaleb did not disclose the startup’s valuation. He plans to use the proceeds of the raise predominantly for hiring while remaining “completely product-led.” Cyber’s mission, he adds, is to “allow people to deploy immersive spaces, no matter how big or small.”","The term metaverse has been all the rage among investors over the past six months, with <a href=\"https:\/\/about.fb.com\/news\/2021\/10\/facebook-company-is-now-meta\/\" data-v-f87c67ca=\"\">Facebook’s rebrand to Meta<\/a> in October only adding to the hype.","The concept of the metaverse — coined in Neal Stephenson’s science fiction novel Snow Crash and popularized by other novels like Ready Player One — refers to a virtual reality space in which users can interact with each other.","Boutaleb has previously talked of taking <a href=\"https:\/\/www.theblockcrypto.com\/news+\/119540\/cybers-founder-wants-to-build-the-art-blocks-of-metaverse-architecture\" data-v-f87c67ca=\"\">a bottom-up approach<\/a> to building such a thing.","Launched in February 2021, Cyber began by letting artists construct and sell virtual showrooms, which themselves take the form of NFTs. Collectors can then mint these and later trade them on marketplaces like OpenSea — or use them to display their art.&nbsp;But there are also free galleries, available to any user with a crypto wallet.&nbsp;","Now that Cyber’s galleries can be connected through its new portal, Boutaleb believes the platform will start to resemble a kind of social media platform.","“The second stage is to allow users to connect in these spaces together in a more social kind of way,” says Boutaleb. “They’re going to kind of be creating their own metaverses, their own worlds.” And in Cyber’s worlds, as the startup explained in <a href=\"https:\/\/oncyber.notion.site\/Cyber-raises-6-7m-to-empower-creatives-to-build-their-own-worlds-with-NFTs-436e25f2239b4f5093a3405a97a144c4\" data-v-f87c67ca=\"\">a blog post<\/a>, every piece of content including the space itself is an NFT.&nbsp;","In <a href=\"https:\/\/oncyber.notion.site\/Cyber-read-me-9e4051ae49f7415383c8d695aa5d17bb\" data-v-f87c67ca=\"\">another recent blog post<\/a> about the company’s development, Cyber said that a multiplayer feature — which looks as though it will involve touring galleries in the form of an avatar — is “right around the corner.”","In time, Boutaleb says he would also like to enable Cyber showrooms to be linked to other metaverse platforms, but he doesn’t see that happening soon.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cyber","content":"PERSON"},{"type":"Ryan Hoover","content":"PERSON"},{"type":"Adobe","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$6.7 million","content":"MONEY"},{"type":"Meta","content":"ORGANIZATION"},{"type":"January 10","content":"DATE"},{"type":"TCG Capital Management","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"6529","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Scott Belsky","content":"PERSON"},{"type":"Gmoney","content":"ORGANIZATION"},{"type":"Boutaleb","content":"PERSON"},{"type":"February 2021","content":"DATE"},{"type":"Rayan Boutaleb","content":"PERSON"},{"type":"Neal Stephenson","content":"PERSON"},{"type":"Joey Colombo","content":"PERSON"},{"type":"Packy McCormick","content":"PERSON"},{"type":"Erick Calderon","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$110 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}