{"summary":"WisdomTree joins firms such as Coinbase, Gemini and Fidelity Digital Assets in being granted the limited-purpose trust charter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284118\/wisdomtree-trust-company-charter-crypto-related-services-new-york","publishDate":"2024-03-22T08:53:23","id":12318,"type":null,"title":"WisdomTree granted trust company charter to offer crypto-related services in New York","category":["REGULATION"],"content":["WisdomTree, the global asset manager behind the BTCW spot bitcoin exchange-traded fund, has been granted a charter from the New York State Department of Financial Services to offer crypto-related services in the state.","The charter allows WisdomTree to operate as a limited-purpose trust company under the New York Banking Law with enhanced regulatory supervision, according to a statement.","It authorizes the company to perform fiduciary custody of digital assets, including digital wallet services, issue and exchange approved stablecoins, and manage stablecoin reserves under the newly formed WisdomTree Digital Trust Company, LLC.","NYDFS’ approval also enables the firm to launch WisdomTree Prime for New York retail customers in the coming weeks — a personal finance app focused on offering user-friendly access to digital assets such as crypto and digital funds covering a range of major asset classes.","More specifically, the firm plans to issue the WisdomTree Gold Token and the WisdomTree Dollar Token in WisdomTree Prime and maintain reserves for those assets under an NYDFS-approved framework.","“The New York State Department of Financial Services is the premier regulator for businesses that engage in digital asset activity,” WisdomTree founder and CEO Jonathan Steinberg said. “This well-established trust company charter program — which long predates digital assets — is based on bank-grade regulation, allowing us to offer products that capitalize on innovation without sacrificing customer protection.”","WisdomTree joins just nine other firms with trust charters for crypto services, including Coinbase, Gemini and Fidelity Digital Assets, according to the NYDFS <a href=\"https:\/\/www.dfs.ny.gov\/virtual_currency_businesses\" data-v-f87c67ca=\"\">website<\/a>. WidsomTree also plans to use the trust company to offer products and services for institutions and business customers in the future.","WisdomTree is the issuer of one of the newly approved spot Bitcoin ETFs in the U.S. However, it ranks last among nine other competing products from BlackRock, Fidelity, Grayscale and Bitwise, among others, with $75.6 million in assets under management.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-assets\/embed\" title=\"Spot Bitcoin ETF AUM\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$75.6 million","content":"MONEY"},{"type":"LLC","content":"ORGANIZATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"WisdomTree Gold Token","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"WisdomTree Dollar Token","content":"ORGANIZATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"WisdomTree Digital Trust Company","content":"ORGANIZATION"},{"type":"Jonathan Steinberg","content":"PERSON"},{"type":"WisdomTree Prime","content":"ORGANIZATION"},{"type":"New York State Department of Financial Services","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS"],"authors":["James Hunt","The Block"]}