{"summary":"We want to know what you think is important or crucial to institutional crypto investors and how you see the future of the bitcoin\/crypto currency market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/101367\/help-us-shape-the-future-of-the-global-institutional-crypto-marketplace","publishDate":"2021-04-12T13:05:36","id":12314,"type":null,"title":"Help us shape the future of the global institutional crypto marketplace","category":["SPONSORED"],"content":["Your expert opinion would be highly valued.","We want to know what you think is important or crucial to institutional crypto investors and how you see the future of the bitcoin\/crypto currency market.","The survey is completely anonymous and should take no more than 5 minutes of your time. Thank you for your participation.","Click here to <a href=\"https:\/\/www.surveymonkey.co.uk\/r\/lmax-digital?utm_source=TheBlock&amp;utm_medium=link&amp;utm_content=survey&amp;utm_campaign=apr2021\" data-v-f87c67ca=\"\">start the survey<\/a>.","<strong data-v-f87c67ca=\"\">About LMAX Digital<\/strong>","LMAX Digital is the institutional crypto currency exchange from the LMAX Group, which operates a leading FCA regulated trading venue.","Leveraging LMAX Group proven, robust technology and liquidity relationships, LMAX Digital delivers a market-leading solution for physical trading and custodial services for the most liquid crypto currencies – such as BTC (Bitcoin), ETH (Ethereum), LTC (Litecoin), BCH (Bitcoin Cash) and XRP (Ripple).","Delivering trust, reliability and deep institutional liquidity, LMAX Digital ensures complete transparency, open access and a level playing field for all institutional crypto currency market participants – within a secure trading environment.","LMAX Digital is regulated by the Gibraltar Financial Services Commission (GFSC) as a DLT provider for execution and custody services.","For more information and to view live prices, visit <a href=\"https:\/\/www.lmaxdigital.com\/overview\/?utm_source=TheBlock&amp;utm_medium=link&amp;utm_content=digital-homepage&amp;utm_campaign=apr2021\" data-v-f87c67ca=\"\">www.lmaxdigital.com.<\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BCH","content":"ORGANIZATION"},{"type":"Gibraltar Financial Services Commission","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"LMAX Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"LTC","content":"ORGANIZATION"},{"type":"LMAX Digital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}