{"summary":"The SEC&#x27;s settlement with ShapeShift &quot;adds to the ambiguity&quot; in the crypto industry, the agency&#x27;s Republican commissioners said on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280907\/sec-commissioners-peirce-and-uyeda-call-out-agencys-ambiguity-after-shapeshift-settlement","publishDate":"2024-03-06T12:31:44","id":12313,"type":null,"title":"SEC Commissioners Peirce and Uyeda call out agency&#x27;s &#x27;ambiguity&#x27; after ShapeShift settlement","category":["REGULATION"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission's settlement with ShapeShift \"adds to the ambiguity\" in the crypto industry, the agency's Republican commissioners said in a rebuke of the agency's latest enforcement action.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"The Commission’s enforcement action against ShapeShift is the latest installment in the serial drama of the Commission’s poorly conceived crypto policy,\" said SEC Commissioners Hester Peirce and Mark Uyeda in a <a href=\"https:\/\/www.sec.gov\/news\/statement\/peirce-uyeda-statement-a-crypto-world-turns-03-06-24\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">statement<\/span><\/a> on Wednesday.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC announced on Tuesday that it filed a cease-and-desist against crypto firm <a href=\"https:\/\/www.theblock.co\/post\/280725\/shapeshift-settle-sec-unregistered-securities-charges\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">ShapeShift<\/span><\/a> for allegedly operating as an unregistered securities dealer. <\/span>The agency invoked the Howey Test, which is based on a 1946 U.S. Supreme Court case frequently cited by the SEC to determine if an asset qualifies as a security.","Peirce and Uyeda said that the SEC's Tuesday order failed to specify which of the 79 crypto assets were considered investment contracts, nor did it provide an explanation.","<span class=\"s2\" data-v-f87c67ca=\"\">\"This enforcement action underscores the adverse consequences of the Commission’s approach to regulation in the crypto space and adds to the ambiguity that hangs over the crypto world,\" said the commissioners. \"It is entirely unclear how ShapeShift was to discern that the Commission would consider crypto assets generally—and any crypto asset in particular—a security in the form of an investment contract.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The two Republican commissioners have been critical of the SEC's enforcement approach to crypto. <\/span>Over the past few years, the SEC has actively pursued legal actions against crypto firms, including notable cases last year against crypto exchanges Binance and Coinbase.","<span class=\"s2\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler has repeatedly said crypto platforms need to register with the agency and has said many cryptocurrencies are securities. The crypto industry, meanwhile, has argued <\/span><span class=\"s5\" data-v-f87c67ca=\"\">that they find it difficult being compliant and still competitive without a clear regulatory path forward in the U.S.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">Peirce and Uyeda called the SEC's \"just come in and register\" approach \"manifestly unsatisfying.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The fiction that this has been done is undermined by the Commission’s failure to state which specific assets in the case before us are securities,\" they said. \"The standards are so opaque and arbitrary that the Commission itself is unwilling to stand by its own analysis.&nbsp; If case-by-case determination is possible, we respectfully request that the Commission show its work.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"SEC Commissioners Hester Peirce","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Uyeda","content":"PERSON"},{"type":"Howey Test","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Mark Uyeda","content":"PERSON"},{"type":"Wednesday","content":"DATE"}],"hashtag":["GARY GENSLER","SEC"],"authors":["Sarah Wynn","The Block"]}