{"summary":"Crypto Facilities, a Kraken subsidiary company, has appointed hedge fund veteran and former Kraken executive Mark Jennings as its new CEO.\n\nThe under-the-radar UK-based derivatives platform aims to increase its visibility and expand its offerings to institutions in the coming months.","author":["Kari McMahon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240708\/krakens-crypto-facilities-appoints-hedge-fund-veteran-as-ceo","publishDate":"2023-07-20T09:30:57","id":1231,"type":null,"title":"Kraken’s Crypto Facilities appoints hedge fund veteran as CEO","category":["Companies"],"content":["Kraken is doubling down on its institutional derivatives offerings with the appointment of hedge fund veteran Mark Jennings as CEO of Crypto Facilities, its UK-based cryptoasset derivatives trading facility for institutions.","The crypto exchange acquired Crypto Facilities back in 2019 for a <a href=\"https:\/\/www.cryptofacilities.com\/cryptocurrency-news\/kraken-acquires-crypto-derivatives-trading-platform-and-index-provider-crypto-facilities-in-nine-figure-deal\" data-v-f87c67ca=\"\">nine figure sum<\/a>. The Financial Conduct Authority (FCA) regulated derivatives platform has since remained under-the-radar. Something which Jennings is trying to change in his new position.","“What we’re going to try and emphasize more is that we’re a capability that Kraken has, which is to bring institutional derivative venues to the institutional customers we are trying to service,” Jennings said.","Jennings started his career in hedge fund services at Citi and Credit Suisse and worked as the chief operating officer and chief financial officer for quantitative hedge fund manager True Arrow Capital Management. He joined Kraken in January 2022 as its operations lead for Europe.","“The opportunity at Crypto Facilities [is] bringing me back to my institutional roots and what I had done before,” Jennings said.","<a href=\"https:\/\/www.cryptofacilities.com\/\" data-v-f87c67ca=\"\">Crypto Facilities <\/a>provides regulated access to cryptocurrency futures to a global client base with the majority being based in the UK and within Europe. The platform <a href=\"https:\/\/www.cryptofacilities.com\/cryptocurrency-news\/crypto-facilities-becomes-first-licensed-crypto-futures-venue-in-europe\" data-v-f87c67ca=\"\">secured<\/a> a Multilateral Trading Facility (MTF) license from the FCA in 2020, which means it can serve institutional clients who are mandated to trade on licensed platforms. It also<a href=\"https:\/\/www.theblock.co\/linked\/124437\/kraken-subsidiary-crypto-facilities-receives-fca-approval-in-the-uk\" data-v-f87c67ca=\"\"> secured<\/a> an MLR license meaning the company is a registered cryptoasset business and compliant with money laundering regulations in the country.","Clients can currently tap into futures for five different cryptocurrencies including bitcoin, ether and ripple, which was recently <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">classified<\/a> as not a security when sold on secondary markets in a summary judgment from a New York district judge.","“We’ve always been very firm in how we select assets and we've been comfortable that this is where XRP should have ended up,” Jennings said.","The decision on which tokens to list as derivatives is based on the depth and liquidity that can be offered to clients, he added.","“I do think we'll probably add to that asset base over the next six to nine to 12 months as and when we see the interest develop,” said Jennings, adding that the initial asset selection has served them well.","For regulatory reasons, Kraken and Crypto Facilities maintain separate brands and operate separate entities, but Jennings expects going forward Crypto Facilities will become better known as part of the Kraken family.","This front-facing push comes as institutional adoption picks up amid catalysts such as the <a href=\"https:\/\/www.theblock.co\/post\/236415\/blackrock-etf-filing-could-be-turning-point-for-bitcoin-ark-says\" data-v-f87c67ca=\"\">BlackRock’s ETF application<\/a> and the <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">Ripple decision<\/a>. There’s now also enough historical data for strategies to be backtested, which makes the opportunity for institutions more concrete, Jennings said.","“We've waited for the growth of the institutions to come to the table and that was stuttered slightly with FTX at the back end of last year,” Jennings said. “But we can see that’s continued to grow; we’ve noticed most of the clients that we see are now more traditional than they were crypto native, maybe two or three years ago.”","Crypto Facilities isn’t the only company recognizing this momentum. Many UK-based <a href=\"https:\/\/www.theblock.co\/post\/235106\/upstart-crypto-exchanges-look-to-capitalize-on-current-exchange-woes\" data-v-f87c67ca=\"\">upstart players <\/a>such as Archax and Zodia Markets are also going after the institutional market, while crypto exchange titans <a href=\"https:\/\/www.theblock.co\/post\/220853\/coinbases-proposed-overseas-trading-venue-would-offer-derivatives-sources\" data-v-f87c67ca=\"\">Coinbase<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/227722\/gemini-foundation\" data-v-f87c67ca=\"\">Gemini<\/a> are diving deeper into derivatives.","“I think the likes of Zodia and Archax, who are coming to the table as well, just prove out how much appetite there is for this within the market,” Jennings said.","It’s also a sign of the <a href=\"https:\/\/www.theblock.co\/post\/236441\/meet-the-9-power-players-shaping-the-uks-growing-crypto-agenda\" data-v-f87c67ca=\"\">UK’s burgeoning status<\/a> as a crypto hot spot. The country recently <a href=\"https:\/\/www.theblock.co\/post\/237082\/new-uk-financial-law-includes-crypto-hub-provisions-and-web3-rules\" data-v-f87c67ca=\"\">passed<\/a> the Financial Services and Markets bill, which includes provisions for crypto assets. Jennings’ mission is to increase Crypto Facilities’ presence in the country.","“I'd rather people tell me we've heard enough about you than we don't know [who] Crypto Facilities is,” Jennings said. “I think it just needs to be more visible because I think it's a really unique offering.”"],"hashtag":[]}