{"summary":"Coinbase has sent the U.S. Securities and Exchange Commission a fresh letter, arguing that it&#x27;s impossible to regulate DEXs like a central exchange. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234728\/coinbase-tells-sec-that-dexs-cant-be-regulated-as-exchanges","publishDate":"2023-06-14T14:45:48","id":12327,"type":null,"title":"Coinbase tells SEC that DEXs can&#x27;t be regulated as exchanges","category":["COMPANIES"],"content":["Crypto exchange Coinbase, which has been embroiled in a lengthy <a href=\"https:\/\/www.theblock.co\/post\/234521\/sec-wants-four-months-to-respond-to-coinbases-request-for-rulemaking\" data-v-f87c67ca=\"\">public spat<\/a> with the U.S. Securities and Exchange Commission, sent a <a href=\"https:\/\/t.co\/w37R9OzrUV\" data-v-f87c67ca=\"\">fresh letter<\/a> to the regulator on Monday, this time arguing against a proposal to regulate decentralized exchanges like their centralized counterparts.","Chief Legal Officer of Coinbase Paul Grewel said Tuesday that it would be impossible for a DEX, as the decentralized exchanges like Uniswap are called, to register in the same way as a national securities exchange.&nbsp;","\"This proposal is too flawed on process &amp; substance to move forward,\" he wrote in a <a href=\"https:\/\/twitter.com\/iampaulgrewal\/status\/1669029818732617747\" data-v-f87c67ca=\"\">thread<\/a> on Twitter. \"In particular, the SEC is attempting to front run Congressional action by baking unsupported assumptions about its crypto jurisdiction into the proposed rules.\"","In the 8-page letter, Grewel argued an agency’s authority to regulate a particular industry \"does not include the authority to ban that industry, absent clear Congressional authorization.\"","\"Truly decentralized systems do in fact exist and have no single organization capable of being responsible for compliance,\" he wrote. \"The proposed rule, as applied to DEXs, would be just such an impossible requirement.\"","\"The Commission has failed to engage in a real economic analysis and instead used the patina of an economic analysis to justify its policy preferences,\" Grewel continued.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grewel","content":"PERSON"},{"type":"Paul Grewel","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"The Commission","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["MK Manoylov","The Block"]}