{"summary":"Binance CEO Changpeng “CZ” Zhao has said that there are two acquisitions deals in the pipeline he is “very excited” about\nThese are “major” and will have a “significant impact,” he said\nLast year, Binance made “no less than 9 full acquisitions,” but only a few were publicly announced","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51969\/binance-ceo-says-some-major-strategic-acquisitions-are-in-the-works-for-2020","publishDate":"2020-01-03T08:20:36","id":1233,"type":null,"title":"Binance CEO says some ‘major’ strategic acquisitions are in the works for 2020","category":["Exchanges"],"content":["After acquiring several firms last year, Binance CEO Changpeng “CZ” Zhao has now said that some more “major” strategic acquisitions are in the works for 2020.","“We always have a number of strategic acquisition discussions in the works, a couple of them are major and will have a significant impact. We will announce it in due time,” <a href=\"https:\/\/www.binance.com\/en\/amp\/blog\/419417682154909696\/Binance-2020-New-Year-Message-Building-Foundations--\" data-v-f87c67ca=\"\">said<\/a> CZ, in his first letter to the Binance community, published Thursday.","The letter describes Binance’s 2019 developments, including staking, futures trading, new fiat gateways and acquisitions, among others.","CZ said Binance made “no less than 9 full acquisitions in 2019,” but only a few were announced publicly. These <a href=\"https:\/\/www.theblockcrypto.com\/post\/49010\/binance-acquires-chinese-blockchain-data-startup-dappreview-for-undisclosed-sum\" data-v-f87c67ca=\"\">include<\/a> - blockchain data startup DappReview; Indian cryptocurrency exchange WazirX and little-known Seychelles-based derivatives platform JEX.","“There are always a number of deals being discussed at any given time, and there are 2 that I am very excited about specifically, said CZ.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<strong data-v-f87c67ca=\"\">Mass adoption&nbsp;<\/strong>","One of Binance's main goals for 2020 is to bring crypto to masses, said the CEO. To that end, the exchange aims to enable fiat-to-crypto trading for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/46952\/binance-plans-to-support-all-180-currencies-for-its-direct-fiat-to-crypto-trading-facility\" data-v-f87c67ca=\"\">all 180<\/a> fiat currencies available in the world. Binance currently <a href=\"https:\/\/www.binance.com\/en\/buy-sell-crypto\" data-v-f87c67ca=\"\">supports<\/a> 20 fiat currencies, according to its website.","Elsewhere, in the letter, CZ also said that Binance is working on a new incentive structure called ETOP (employee token ownership plan) to replace traditional ESOP (employee stock ownership plan). The exchange is also “further decentralizing” itself in terms of its team structure, work locations, operations, products and services.","CZ has also mentioned his outlook for 2030, saying that by the year, blockchain and crypto will be everywhere. It will be used \"to pay for self-driving versions of Uber;\" \"to buy things from half a world away and have them delivered to you via drones;\" and will be used \"to fund biotech research,\" among other things. While blockchain will be used for identity, voting in elections, decentralized social media and more, he concluded."],"hashtag":["BINANCE","CZ"]}