{"summary":"Several major Filecoin miners have halted or significantly reduced the growth of their mining power since the network&#x27;s officially went live last week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81610\/filecoin-miners-growth-economic-model","publishDate":"2020-10-19T11:24:33","id":12339,"type":null,"title":"Filecoin miners are holding back their growth plans because of the network&#x27;s economic model","category":["MINING"],"content":["The current design of Filecoin’s economic incentive model has led major miners to halt or significantly slow down the growth of their effective computing power on the recently launched network.","<span data-v-f87c67ca=\"\">To be sure, these miners did not turn off their hardware to reduce the amount of their effective mining power altogether. B<\/span><span data-v-f87c67ca=\"\">ut the overall slowdown of the network's growth rate demonstrates their collective hesitation to add more to the decentralized storage network until a revised economic model — one that could be more in their favor — is activated.<\/span>","<span data-v-f87c67ca=\"\">For example, China-based YunOS — which is behind the network’s biggest miner IDs <\/span><span data-v-f87c67ca=\"\">f02770<\/span><span data-v-f87c67ca=\"\"> and <\/span><span data-v-f87c67ca=\"\">f02775 —&nbsp;<\/span><span data-v-f87c67ca=\"\">still has more than 60 pebibytes (PiB) of effective storage mining power at the moment – or around 10% of the network’s total, network data shows.<\/span>","<span data-v-f87c67ca=\"\">Prior to Filecoin’s mainnet launch on October 15, YunOS was adding over 1,000 tebibyte (TiB) of effective storage power per day via the <a href=\"https:\/\/filfox.info\/en\/stats\/miner\" data-v-f87c67ca=\"\">f02770 ID<\/a> at an accelerated rate. But it reduced the growth to less than 200 TiB on October 16 and then close to zero over the weekend. (1 PiB=1024TiB)<\/span>","<span data-v-f87c67ca=\"\">Filecoin’s miner ranking <\/span><a href=\"https:\/\/filfox.info\/en\/ranks\/power\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">shows<\/span><\/a><span data-v-f87c67ca=\"\"> a majority of the top ten miner IDs on the network are undergoing a similar behavior pattern. Some major miners, such as 6Block — which possesses about over 10% of the network’s mining power via several miner IDs — have not added any new effective storage over the past few days.<\/span>","<span data-v-f87c67ca=\"\">Li Bai, a core developer at 6Block, said in an interview that the network’s total effective mining power had grown by just around 10 PiB in the past day to reach the current level of 597 PiB and that the growth has already flattened. He said Filecoin's economic incentive mechanism is the reason behind what appears to be a power growth standoff.<\/span>","<span data-v-f87c67ca=\"\">Filecoin’s current design requires miners to pledge 0.1901 FIL – the network’s native cryptocurrency – as collateral for sealing 32 gibibyte (GiB) of data that can be further converted into effective storage mining power, according to Filecoin’s blockchain explorer. One TiB equals 1100 GiB.<\/span>","<span data-v-f87c67ca=\"\">At the same time, by the current design, Filecoin’s block rewards – about 10 FIL per block – are not released to miners immediately but are vested to them linearly over a window of 180 days. For Li at 6Block, a suitable strategy now is to wait and see how the market for FIL plays out.<\/span>","<span data-v-f87c67ca=\"\">“It’s like pledging a spot FIL for getting a FIL in the future that’s coming with linear inflation. For miners, it’s just a matter of expectation for the rate of return of their spot FIL,” said Li.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Asked if there was a collective strike in a coordinated fashion among Chinese Filecoin miners as described in local news reports, Li rejected that narrative.<\/span>","<span data-v-f87c67ca=\"\">“It’s not a strike. It’s just a better strategy given the current economics,” he said. “With more potential sell pressure when there’s no adequate circulating FIL at a steady price range, it’s not lucrative to pledge a spot FIL for a future FIL whose price could be lower.”<\/span>","<span data-v-f87c67ca=\"\">But still, the current economic model has sparked complaints from Filecoin miners – a majority of whom are Chinese companies – in the project’s official Slack channel reviewed by The Block.<\/span>","<span data-v-f87c67ca=\"\">In response to that, Protocol Labs, the organization behind Filecoin, has approved a revision to the current mechanism in an attempt to solve miners’ liquidity issues.<\/span>","<span data-v-f87c67ca=\"\">According to the FIP-0004 proposal <\/span><a href=\"https:\/\/github.com\/filecoin-project\/FIPs\/blob\/master\/FIPS\/fip-0004.md\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published<\/span><\/a><span data-v-f87c67ca=\"\"> on GitHub on Sunday, the plan is to “make 25% of storage-mining rewards immediately available with no vesting” while the remaining 75% will still be vested through 180 days linearly. But it’s unclear when exactly the plan will be activated.<\/span>","<span data-v-f87c67ca=\"\">“The revision could expedite the process for reaching an equilibrium,” said Li. “Miners will be more motivated to pledge their FIL for mining future rewards when the circulation is adequate enough and price becomes more steady.”&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"October 16","content":"DATE"},{"type":"FIL","content":"ORGANIZATION"},{"type":"Sunday","content":"DATE"},{"type":"TiB","content":"ORGANIZATION"},{"type":"0004","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Protocol Labs","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"October 15","content":"DATE"},{"type":"Li Bai","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"GiB","content":"ORGANIZATION"},{"type":"Filecoin","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Filecoin","content":"LOCATION"}],"hashtag":[],"authors":["Wolfie Zhao","The Block"]}