{"summary":"Decentralized predictions market Augur has taken some big steps to stomp-out nefarious actors on its platform, the firm told The Block.   Augur allows","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26075\/augur-is-making-a-big-push-to-take-down-bad-actors-on-its-platform","publishDate":"2019-06-05T17:08:30","id":12345,"type":null,"title":"Augur is making a big push to take down bad actors on its platform","category":["DEX"],"content":["Decentralized predictions market Augur has taken some big steps to stomp-out nefarious actors on its platform, the firm told The Block.&nbsp;&nbsp;","Augur allows users to create a market based on the outcome of an event, with actors buying&nbsp; “yes” shares, “no” shares, or something more complicated. When the outcome is known, those who bet the winning outcome see an ether payout – one per share for a winning bet in a yes\/no scenario and none for a losing bet. However, in an invalid outcome, which occurs when a result is unverifiable, \"yes\" and \"no\" shares each receive a 0.5 payout. Essentially, in an invalid market, the one ether is distributed evenly among the number of outcomes.","Here is where cheaters take advantage, according to Augur.","Attackers create an invalid market, perhaps by setting the end of the event to a time when an ambiguous outcome is assured, like before the event takes place. They then buy up shares of the least probable outcome at a price lower than the payout of the “invalid” outcome. Market creators do have to pay a validity bond when creating a market, which they only get back when the market is deemed valid, but this isn’t enough to deter bad actors since the fee is often less than the money made off the invalid market.","<strong data-v-f87c67ca=\"\">The Fix<\/strong>","To combat this, Augur has released a new Augur App that sorts markets to show those most likely to be of value to traders, deterring users from creating invalid markets for gain since they’ll be less likely to see a payout.","“The ultimate goal is to create a game where everyone wins: where the individual incentives of market actors align with the utility and security of the protocol as a whole,” said Ben Davidow of Augur's growth strategy department, in a<a href=\"https:\/\/www.augur.net\/blog\/reliable-markets\/\" data-v-f87c67ca=\"\">&nbsp;post<\/a>.","Simply put, the new setup filters out markets that have wide spreads and a lack of deep liquidity as traders could previously manipulate markets with dust orders to give the appearance of a tight market. In addition to rewarding markets with tight, deep spreads by making them more visible, the filter also excludes markets that have no bids or asks that would incur a loss for the order creators in the case of an invalid resolution. This latter filter may lead to 'false positives' in markets that correctly have probability priced around 50%.&nbsp;","For v2 of its protocol, Augur also plans to let users trade an invalid outcome, making it impossible to profit on an “invalid” bet in a yes\/no result as scammers could previously. For now, however, the filters aren’t perfect, and some invalid market scammers may still slip through. Deceptive users can post a small order as a loss leader to bypass the filter, but the payout will likely be severely limited by the spread filter, incentivising users to not waste their time building scams since it’ll be less lucrative.","Augur isn’t the only decentralized platform that has had to take care of scammers: Bancor, a decentralized exchange protocol, has had to deal with <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/14\/bancor-had-a-front-running-problem-so-it-hired-one-of-the-manipulators-to-fix-it\/\" data-v-f87c67ca=\"\">front-running problems.<\/a> Bancor subsequently hired a front-runner to find solutions to the problem.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bancor","content":"ORGANIZATION"},{"type":"Ben Davidow","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"50%","content":"PERCENT"}],"hashtag":[],"authors":["Aislinn Keely","Frank Chaparro","The Block"]}