{"summary":"The Hong Kong government has officially established a web3 task force to provide recommendations on crypto development in the region.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237483\/hong-kong-government-sets-up-web3-task-force-to-help-build-a-thriving-ecosystem","publishDate":"2023-07-03T07:11:25","id":12348,"type":null,"title":"Hong Kong government sets up web3 task force to help &#x27;build a thriving ecosystem&#x27;","category":["WEB3"],"content":["The Hong Kong government has established a web3 task force to provide recommendations on sustainable and responsible crypto development in the region.","Chaired by the Financial Secretary, the task force includes 15 non-official members from relevant market sectors, alongside key government officials and financial regulators, with an initial two-year term from July 1, according to an <a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202306\/30\/P2023063000579.htm?fontSize=1\" data-v-f87c67ca=\"\">announcement<\/a> on Friday.","The task force builds upon the government's policy statement on the development of virtual assets, issued in October 2022, outlining Hong Kong's stance and approach toward the virtual asset sector.","\"The blockchain technology underpinning web3 features characteristics in respect of disintermediation, security, transparency and low cost. It has the potential to solve many difficulties and pain points encountered in finance, trade, business operations and even day-to-day life,” Hong Kong government Financial Secretary Paul Chan said.&nbsp;","“Premised on a balance between appropriate regulation and promoting development, Hong Kong seeks to lead and drive innovative exploration and development, create more new application models, and strives to draw together top-notch companies and talent in the arena to build a thriving ecosystem,\" Chen added.","Chen previously discussed the need to “nurture a web3 ecosystem and establish a task force on the development of virtual assets\" in his 2023-2024 <a href=\"https:\/\/www2.deloitte.com\/cn\/en\/pages\/tax\/articles\/hk-budget-2023-2024.html\" data-v-f87c67ca=\"\">budget speech<\/a> in February. It was referenced again in a recent government <a href=\"https:\/\/www.theblock.co\/post\/235589\/hong-kong-can-draw-on-japan-singapores-lead-for-its-crypto-efforts-says-government-study\" data-v-f87c67ca=\"\">study<\/a> highlighting concerns the region was lagging behind East Asia and Gulf countries for web3 development.","In another nod to Hong Kong's crypto ambitions, its banking regulator, the Hong Kong Monetary Authority (HKMA), has recently been applying <a href=\"https:\/\/www.theblock.co\/post\/234869\/hong-kong-regulators-hsbc-standard-chartered-embrace-crypto-clients\" data-v-f87c67ca=\"\">pressure<\/a> on HSBC, Standard Chartered and Bank of China — who hold a special role as issuers of the city’s currency — to accept crypto exchanges as clients.","Meanwhile, USDC stablecoin issuer Circle is also setting its <a href=\"https:\/\/www.theblock.co\/post\/236571\/circle-sets-sights-on-hong-kong-sees-enormous-demand-for-digital-dollars\" data-v-f87c67ca=\"\">sights<\/a> on Hong Kong, with CEO Jeremy Allaire seeing “enormous demand for digital dollars” in the region.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"Paul Chan","content":"PERSON"},{"type":"HSBC","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Financial Secretary","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"},{"type":"East Asia","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"July 1","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","USDC"],"authors":["James Hunt","The Block"]}