{"summary":"Moonbeam has integrated with Axelar and Osmosis to enable the transfer of tokens between the Polkadot and Cosmos ecosystems.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159447\/moonbeam-now-lets-you-swap-tokens-between-polkadot-and-cosmos","publishDate":"2022-07-25T09:16:57","id":12349,"type":null,"title":"Moonbeam now lets you swap tokens between Polkadot and Cosmos","category":["DEFI"],"content":["Moonbeam, a smart contract parachain on Polkadot, has partnered with <a href=\"https:\/\/www.theblock.co\/post\/123435\/a-dex-on-cosmos-is-working-on-a-way-to-prevent-front-running\" data-v-f87c67ca=\"\">Cosmos-based decentralized exchange Osmosis<\/a> to enable cross-chain token swaps between the Polkadot and Cosmos ecosystems, the project <a href=\"https:\/\/twitter.com\/MoonbeamNetwork\/status\/1550858366439784450\" data-v-f87c67ca=\"\">announced<\/a> on July 23. This means it will be simple to transfer tokens between the two different blockchain ecosystems.","The integration is made available via the Axelar Network protocol. Axelar is both a bridge network and a platform for cross-chain communication for smart contract protocols. The former allows tokens to be sent across different blockchains while the latter is what enables decentralized apps to be deployed on different networks. The project <a href=\"https:\/\/www.theblock.co\/post\/111493\/blockchain-interoperability-axelar-25-million-series-a-funding\" data-v-f87c67ca=\"\">raised $25 million<\/a> in its Series A funding last year.","DOT, the native token of the Polkadot blockchain, will be the first token supported on the cross-chain bridge, per the announcement. Moonbeam stated that there are plans to support the bridging of more Polkadot ecosystem coins to the Cosmos chain.","According to Moonbeam, the ability to transfer Polkadot-based coins to Cosmos is a major step in expanding cross-chain composability between the two blockchain ecosystems. Moonbeam also stated that the partnership buttresses the fact that Polkadot and Cosmos can exist as complementary ecosystems — even though they are often seen as rivals working on different ways to achieve the same goal.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cosmos","content":"LOCATION"},{"type":"July 23","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Polkadot","content":"LOCATION"},{"type":"$25 million","content":"MONEY"},{"type":"Moonbeam","content":"LOCATION"}],"hashtag":["COSMOS"],"authors":["Osato Avan-Nomayo","The Block"]}