{"summary":"A pair of Congressional hearings on central bank digital currencies indicates the direction Washington might take on the question of how to digitize the U.S. dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108494\/cbdc-central-banks-hearings-congress-june","publishDate":"2021-06-15T18:07:57","id":12355,"type":null,"title":"What we learned from the past week&#x27;s CBDC hearings in Congress","category":["CENTRAL BANKS"],"content":["<span data-v-f87c67ca=\"\">The House Fintech Task Force held a <a href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=407953\" data-v-f87c67ca=\"\">hearing<\/a> on Tuesday about the future of central bank digital currencies. The gathering came on the heels of a similar hearing before the Senate Economic Policy Subcommittee last week.<\/span>","<span data-v-f87c67ca=\"\">The interest in CBDCs on Capitol Hill is not so sudden. A surge in pilot programs and functional CBDCs globally over the past two years has heightened pressure on Congress. Last month, the Financial Services Committee — of which the Fintech Task Force is a subdivision — heard from the Federal Reserve that the central bank <a href=\"https:\/\/www.theblockcrypto.com\/linked\/105964\/fed-authority-cbdc-rollout-congress\" data-v-f87c67ca=\"\">would need congressional authorization<\/a> to put out a CBDC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In other words, there's new pressure on Congress to act or decide not to act.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">There was great interest in both hearings, with several members of the full committees sitting in. <\/span>","<span data-v-f87c67ca=\"\">Broadly speaking, the House hearing was significantly more productive, but the lawmakers involved in both hearings were at least on board with the philosophical mission of digitizing the dollar.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Senate gets sidetracked<\/b>","<span data-v-f87c67ca=\"\">The Senate hearing, led by subcommittee chairwoman Elizabeth Warren, largely transformed into an <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107983\/senator-elizabeth-warren-attacks-cryptocurrency-over-ransomware-energy-use\" data-v-f87c67ca=\"\">indictment of the cryptocurrency market<\/a>. The roster of witnesses was largely selected on the basis of their antipathy towards crypto. A notable exception was MIT’s Neha Narula, who also held the distinction of appearing in both the House and Senate hearings.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ranking Member John Kennedy (R-LA) conceded additional rounds of questions to Warren, who took the opportunity to get Lev Menard to deny the existence of a legitimate use case for bitcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Noted crypto allies like Cynthia Lummis seemed not to have tuned in for Warren’s opening remarks, keeping questions focused more on CBDCs. But this was the same week that a response to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106958\/biden-white-house-ransomware-cryptocurrency\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">ransomware<\/a> had become a top priority for the Biden administration.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In response to the Senate subcommittee’s fixation on criminality in crypto, Chris Giancarlo, former chair of the CFTC, noted:&nbsp; \"Wherever you've got money, you're going to have criminality. A lot of enforcement work is just in the evolving process of cops and robbers.\" But that argument was largely lost.&nbsp;<\/span>","The greatest single takeaway from the Senate hearing was heightened political hostility towards crypto at large.","<span data-v-f87c67ca=\"\">Amidst the rhetoric, the subcommittee seemed to come to the conclusion that a government-issued CBDC would represent a positive step. As Stanford Professor Darrell Duffie said, “many banks are exploring CBDCs and are doing so for that specific reason, to head off an invasion by an undesirable cryptocurrency.\"<\/span>","<strong data-v-f87c67ca=\"\">The House gets into the details<\/strong>","<span data-v-f87c67ca=\"\">The House Fintech Task Force appeared more receptive to crypto in general and, consequently, more focused on the particular challenges of a CBDC, though full committee Chair Maxine Waters (D-CA) <a href=\"https:\/\/www.theblockcrypto.com\/linked\/108451\/house-democrats-form-working-group-focused-on-cryptocurrencies\" data-v-f87c67ca=\"\">spoke of ambitions<\/a> for more cryptocurrency regulation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It’s imperative that we use these hearings to effectively gather information on the subject,” said Ranking Member Warren Davidson. “I know that some people prefer to use the CBDC conversation as a vehicle to voice their opinions on other fintech issues more broadly.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This makes sense, as the task force’s remit has required longer-term attention on cryptocurrencies than the Senate. At the same time, the discussion before the House illustrated many more of the details of a potential CBDC that would actually hold up progress, even after the specter of the Colonial Pipeline has ceased haunting the public consciousness.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Privacy and financial inclusion were at the forefront of the back-and-forth. Task force chairman Stephen Lynch (D-MA) phrased a recurring objective as: “Can a CBDC operate with the same level of privacy as cash?” <\/span>","<span data-v-f87c67ca=\"\">Witness Dr. Jonathan Dharmapalan followed up by noting, “One could argue that cash currency is the most inclusive financial technology we have today.”<\/span>","<span data-v-f87c67ca=\"\">So where was the disagreement?<\/span>","<b data-v-f87c67ca=\"\">How much privacy?<\/b>","<span data-v-f87c67ca=\"\">When it came to privacy and disintermediation, both the witnesses and the task force members seemed to be speaking different languages. Emtech founder and CEO Camilla Cadet, for example, highlighted blockchain as an optimal technology to achieve these goals:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Blockchain technology is something we saw as a key differentiator to any other type of technologies and approaches to creating digital currencies, especially when we talk about cash.”<\/span>","<span data-v-f87c67ca=\"\">Willamette University’s Rohan Grey, who came to prominence in the crypto world as the author of Rashida Tlaib’s <\/span><a href=\"https:\/\/www.theblockresearch.com\/examining-the-stable-act-proposal-part-i-90585\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">STABLE Act<\/span><\/a><span data-v-f87c67ca=\"\"> that was made public last December, advocated a blend of Fed and post office accounts, with an unspecified degree of tokenization involved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Representative Brad Sherman (D-CA), who is not on the task force, stepped in from the full committee to advocate for stronger know-your-customer controls. He warned against competition for the tax evasion market and asked, “How could the Fed make sure that a digital dollar is not a tool of tax evasion?”<\/span>","<span data-v-f87c67ca=\"\">“There are very few central banks that have really gone far enough to get to the real nuanced privacy questions,” said Narula, approaching a counterargument. “It should be possible to catch criminals without the government having a record of every date, time, amount and location whenever I buy a cup of coffee.”<\/span>","<b data-v-f87c67ca=\"\">Third-party intermediaries<\/b>","<span data-v-f87c67ca=\"\">In the traditional financial system, the Federal Reserve deputizes private banks and financial service providers to provide a modicum of finance tracking. The Fed generally doesn’t interact with retail users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I don’t think we want the Fed to take over the banking system,” said Congressman Anthony Gonzalez (D-OH), in an exchange with Narula. Rep. French Hill (R-AR) agreed: “The Fed should not have direct accounts with individuals, I found that concerning.”<\/span>","<span data-v-f87c67ca=\"\">Tom Emmer (R-MN) worried that the envisioned CBDC “would in fact convert the Fed into a consumer bank [...] that is not what we want.” He instead said such a system “[w]ould only come to fruition if it were open, permissionless and private,” referring to the example of the Bitcoin network.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The degree to which a digital dollar can disintermediate the existing financial system has been a consistent question, and a complicated one. Giancarlo, for one, has consistently advocated the continued role of the existing commercial banking infrastructure.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Davidson, who marked his inaugural hearing as ranking member today, later told The Block of the task force:<\/span>","<span data-v-f87c67ca=\"\">“They made a lot of references to cash, but you see some people in either party don’t truly like the permissionless nature of cash. They want third parties. They want them to hand over records and basically be deputized.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Camilla Cadet","content":"PERSON"},{"type":"Chris Giancarlo","content":"PERSON"},{"type":"Warren","content":"PERSON"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Financial Services Committee","content":"ORGANIZATION"},{"type":"John Kennedy","content":"PERSON"},{"type":"Emtech","content":"ORGANIZATION"},{"type":"Senate Economic Policy Subcommittee","content":"ORGANIZATION"},{"type":"Rohan Grey","content":"PERSON"},{"type":"Lev Menard","content":"LOCATION"},{"type":"Giancarlo","content":"PERSON"},{"type":"Stephen Lynch","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Narula","content":"PERSON"},{"type":"Warren Davidson","content":"PERSON"},{"type":"past two years","content":"DATE"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Jonathan Dharmapalan","content":"PERSON"},{"type":"Brad Sherman","content":"PERSON"},{"type":"Tom Emmer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"House","content":"ORGANIZATION"},{"type":"Anthony Gonzalez","content":"PERSON"},{"type":"Davidson","content":"PERSON"},{"type":"House Fintech Task Force","content":"ORGANIZATION"},{"type":"Willamette University","content":"ORGANIZATION"},{"type":"Colonial Pipeline","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Neha Narula","content":"PERSON"},{"type":"Darrell Duffie","content":"PERSON"},{"type":"Stanford","content":"ORGANIZATION"},{"type":"CBDC","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Fintech Task Force","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Kollen Post","The Block"]}