{"summary":"As the IRS probes more crypto tax evasion cases, it may be a better time than ever to offload your worthless NFTs. Here&#x27;s how.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269804\/nft-tax-loss-harvesting-spikes-as-year-end-deadline-approaches","publishDate":"2023-12-31T15:31:56","id":12353,"type":null,"title":"NFT tax loss harvesting spikes as year-end deadline approaches","category":["POLICY"],"content":["As the year's end approaches, NFT traders are finally finding a use for the worthless tokens in their wallets: selling them for pennies in order to offset capital gains on their taxes. And with the criminal investigation unit of the IRS reportedly taking a special interest in crypto cases, it may be a better time than ever to offload junk tokens.&nbsp;","The strategy, known as tax loss harvesting, helps traders who are lucky with some investments and unlucky with others minimize their taxable liability, saving them money in the end. But with so many NFT projects lifeless or abandoned, who will purchase worthless NFTs?&nbsp;","Enter projects such as Harvest.Art, Unsellable NFTs, and Sol Incinerator, which aim to purchase worthless NFTs in order to assist traders in tax loss harvesting.&nbsp;","\"People love to procrastinate, so most of our volume starts around December 26th and peaks right up until midnight hours of the new year,\" said pseudonymous developer NetDragon, co-founder of <a href=\"https:\/\/harvest.art\" data-v-f87c67ca=\"\">Harvest<\/a>.&nbsp;","Skyler Hallgren, <a href=\"https:\/\/www.unsellablenfts.com\/\" data-v-f87c67ca=\"\">Unsellable's<\/a> director of partnerships, pointed out that NFTs represented the first foray into investing for many individuals, and so they may not be aware of strategies like tax loss harvesting.&nbsp;","\"A lot of those folks are not as savvy when it comes to end-of-year tax planning as traditional investors might be. Most traditional investors are...being strategic about tax loss harvesting and finding ways to bring down their tax burden. Most Web3 folks don't come from that world,\" said Hallgren.&nbsp;","<strong data-v-f87c67ca=\"\">Why buy worthless NFTs?<\/strong>","Each competing service has a slightly different business model in order to attract customers.","Unsellable pays one penny for each NFT, but also charges a service fee of .002 eth (about $4.60 at current rates) for each NFT offloaded, up to a maximum of .08 eth (about $184.21) per transaction, not including gas fees. Users are able to sell up to 500 NFTs per transaction, from multiple collections at once.&nbsp;","\"Most of our users are not looking to get into a different speculative crypto investment; they're looking to make a really straightforward, no-nonsense end of year tax strategy,\" said Hallgren.&nbsp;","Harvest, in contrast, pays one gwei (one-billionth of one eth) for each NFT sold through the platform and doesn't charge an upfront service fee. Harvest also offers one \"bid ticket\" in exchange for each NFT sold, allowing users to bid on some of the over <a href=\"https:\/\/etherscan.io\/tokenholdings?a=0x996e1d4ce3e1e558889832832004B2466153adbe\" data-v-f87c67ca=\"\">110,000 NFTs<\/a> held by Harvest.&nbsp;","Rather than relying on upfront fees, Harvest hopes to leverage the cyclical nature of the NFT market in order to profit. A Web3 game called KOKODI, for example, took so long to release that many users lost hope and offloaded their NFTs through Harvest. \"We held 150+ of these NFTs when they finally announced the release of their game and the floor shot up to 0.1 ETH a piece. Without us knowing much about it, Harvest users independently started auctions for most of the KOKODI, and started cycling assets back into circulation,\" said NetDragon.&nbsp;","The total cost of offloading NFTs can vary. A <a href=\"https:\/\/etherscan.io\/tx\/0x8c2042f0219b8879700ea31c4cff166f872b261e9b508e70fd7b78a6a8e079cd\" data-v-f87c67ca=\"\">recent sale<\/a> of 459 NFTs through Harvest cost about $300 in gas fees, for example, not including the gas costs of approving each collection for transfer. A <a href=\"https:\/\/etherscan.io\/tx\/0xfa818faf1e0548f475391a35d1e32bfa612b37948d43d0aac57f3bb041cb1dc4\" data-v-f87c67ca=\"\">recent sale<\/a> of 80 NFTs through Unsellable cost about $630 after Unsellable's capped service fee and gas fees, again not including the gas costs of approving each collection for transfer.&nbsp;","\"Back in the middle of the year we did an analysis on about 900 of our users. I realized that the average user realized losses of $4,200,\" said Hallgren. \"I feel a high level of confidence that there are hundreds of millions of dollars in unrealized losses that are frozen right now.\"&nbsp;","Both Unsellable and Harvest operate on the Ethereum blockchain, with Harvest also supporting certain Layer 2 networks. Solana is serviced by <a href=\"https:\/\/sol-incinerator.com\/\" data-v-f87c67ca=\"\">Sol Incinerator<\/a>, while several other chains, including the ever-more-popular Bitcoin Ordinals protocol, appear to be lacking a similar service.&nbsp;","<strong data-v-f87c67ca=\"\">IRS probing crypto tax evasion<\/strong>","It may be a better time than ever for crypto traders to consider their tax bills. According to a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-12-04\/irs-criminal-investigation-unit-taking-on-more-crypto-tax-cases\" data-v-f87c67ca=\"\">report<\/a> in Bloomberg, the criminal investigation division of the Internal Revenue Service (IRS) has begun taking a closer look at crypto tax evasion, while only a few years ago most of the cases involved money laundering.&nbsp;","According to a recent <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/p3583.pdf\" data-v-f87c67ca=\"\">IRS report<\/a>, the investigations are looking into everything from \"...failure to report capital gains from the sale of cryptocurrency, income earned from mining cryptocurrency, or income received in the form of cryptocurrency, such as wages, rental income, and gambling winnings.\" The investigative unit is also probing whether or not individuals are failing to disclose their cryptocurrency ownership in an attempt to shield their holdings from taxes.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Hallgren","content":"PERSON"},{"type":"$300","content":"MONEY"},{"type":"$630","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"NetDragon","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$184.21","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Skyler Hallgren","content":"PERSON"},{"type":"$4.60","content":"MONEY"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$4,200","content":"MONEY"},{"type":"millions of dollars","content":"MONEY"},{"type":"Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Unsellable","content":"ORGANIZATION"}],"hashtag":["IRS"],"authors":["Zack Abrams","The Block"]}