{"summary":"Debate over proof-of-work mining, especially Bitcoin’s energy usage, has delayed votes on Europe’s long-awaited crypto markets directive. \nInitially scheduled for February 28, the rapporteur in charge of the votes has put them off indefinitely as a leak of amendments that many saw as PoW bans generated public outcry. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/135459\/european-parliament-delays-vote-on-crypto-assets-bill-over-proof-of-work-debate","publishDate":"2022-02-25T08:18:39","id":1235,"type":null,"title":"European Parliament delays vote on crypto assets bill over proof-of-work debate","category":["Bitcoin"],"content":["The parliament of the European Union has delayed a key vote on its long-awaited cryptocurrency market regulation in response to outrage from the crypto world.","The Markets in Crypto-Assets Directive, known as MiCA, was on the <a href=\"https:\/\/www.europarl.europa.eu\/doceo\/document\/ECON-OJ-2022-02-28-1_EN.pdf\" data-v-f87c67ca=\"\">docket<\/a> for a vote on February 28 that would send it from the European Parliament into negotiations between that body and the Council of the European Union and the European Commission — putting future alterations into question.","However, Stefan Berger, chairman of the Economics Committee and rapporteur in charge of that vote, has postponed it, Berger's office told The Block today.&nbsp;","A source close to negotiations over the directive told The Block that the primary point of contention was late-stage changes that some interpreted as bans on proof-of-work networks, primarily out of concerns over their energy usage. After a leak generated negative <a href=\"https:\/\/www.btc-echo.de\/news\/bitcoin-spd-gruene-und-linke-fordern-verbot-in-der-eu-135678\/\" data-v-f87c67ca=\"\">press<\/a>&nbsp;as well as overwhelming Twitter response, the right and center-right members withdrew support for the latest amendments.&nbsp;","Berger took to <a href=\"http:\/\/Berger took to Twitter to\" data-v-f87c67ca=\"\">Twitter<\/a> to explain that \"As rapporteur, it is central for me that the MiCA Directive is not misinterpreted as a de facto Bitcoin ban.\"","","Berger's office told The Block that they expect voting to happen \"in two to four weeks, 14 March or early April.\"","The <a href=\"https:\/\/eur-lex.europa.eu\/legal-content\/EN\/TXT\/?uri=CELEX%3A52020PC0593\" data-v-f87c67ca=\"\">directive<\/a> has been in <a href=\"https:\/\/www.theblockcrypto.com\/linked\/125459\/council-of-the-european-union-moves-forward-on-two-crypto-proposals\" data-v-f87c67ca=\"\">progress since 2019<\/a>. The European Parliament has not publicized the most recent amendments. A February 21 draft seen by The Block reads:&nbsp;","The delay was welcomed by many in the crypto industry.&nbsp;","\"Postponing the vote is the right decision, as several critically important issues in the bill remain unresolved,\" Seth Hertlein, global head of policy for Paris-based wallet manufacturer Ledger, told The Block. \"The future financial competitiveness of Europe depends on getting MiCA right.\"","But as Patrick Hansen, head of strategy and growth at Berlin-based Unstoppable Finance <a href=\"https:\/\/twitter.com\/paddi_hansen\/status\/1497174087449382921\" data-v-f87c67ca=\"\">pointed out<\/a>, it remains to be seen how long this process will take."],"hashtag":["EUROPEAN PARLIAMENT","MINING"]}