{"summary":"Genesis Capital, the lending arm of institutional over-the-counter cryptocurrency trading firm Genesis Global Trading, continues to see rising demand for","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45336\/genesis-capital-q3-lending-report-shows-a-surge-in-demand-for-btc-backed-cash-loans","publishDate":"2019-10-31T17:22:11","id":12356,"type":null,"title":"Genesis Capital Q3 lending report shows a surge in demand for BTC-backed cash loans","category":["LENDING"],"content":["Genesis Capital, the lending arm of institutional over-the-counter cryptocurrency trading firm Genesis Global Trading, continues to see rising demand for crypto-backed loans, as loan origination growth hit a new record in the third quarter.","The New Jersey based firm added $870 million worth in new crypto loan originations in the quarter, bringing its total originations to $3.1 billion since launching the business in March 2018, <a href=\"https:\/\/genesiscap.co\/insights\/view-q3-insights-2019\/\" data-v-f87c67ca=\"\">according to a Q3 lending snapshot report<\/a> published Wednesday.","","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Source: Genesis Capital 3Q19 Lending Snapshot, The Block<\/strong><br data-v-f87c67ca=\"\">\nNote: Originations include introduction of cash lending, which was ~10% of active book in 1Q19 vs 31% in 3Q19<\/span>","The report credited the growth in Q3 in part to a continued surge in demand for BTC-backed cash loans, driven by a larger demand to borrow the dollar internationally; 45% of outstanding cash loans came from international borrowers, of which 70% came from within Asia. USD based loans represented 31.2% of the outstanding loan portfolio to end the third quarter, up from ~24% total mix last quarter and 14% total mix to end 2018.&nbsp;","\"There are still many liquid onramps for yuan into the digital currency ecosystem, through pairs such as yuan\/USDT, localbitcoins (a peer to peer bitcoin transaction site) and transacting directly with miners. Once in the digital currency, getting to USD or another stablecoin is straightforward and we believe this flow of funds is one of the larger drivers of cash demand out of Asia,\" Genesis said in the report.","","","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Source: Genesis Capital 3Q19 Lending Snapshot, The Block<\/strong><\/span>","Outstanding ETH loans also saw a larger total mix of outstanding loans in the book, up to 7.5% of the total $450 million worth of outstanding loans in the book, from 2.5% last quarter and 4.1% to end 2018.","\"BTC-based lending is in its early stages and there aren’t many large institutional lenders actively participating. Demand for cash in digital asset markets is high and seems to be increasing over time. Because of this imbalance, cash lending rates will likely remain reasonably high until there is more supply, and yield opportunities may be more attractive than credit opportunities in traditional markets,\" the Genesis report concluded.","Earlier this year, Genesis Capital CEO Michael Moro <a href=\"https:\/\/www.theblockcrypto.com\/post\/22424\/michael-moro-genesis-global-trading\" data-v-f87c67ca=\"\">joined The Scoop<\/a> to discuss the evolution of Genesis' business and its established crypto OTC and lending desks. The lending business, originally formed as a \"cottage\" lending business to friends and family firms in the space, opened for business in March 2018 and made its footing by allowing traders to go short on positions near the top of the last bull market.","Moro also expressed wariness over new entrants dipping too far below the credit box in pricing for risk in order to drive higher volumes. He cautioned that he expects to see firms chase bigger ticket loans with sweeter introductory rates, and or lower collateral ratios to buy customers, adding that if this has played out time and time again in other credit markets why wouldn't one expect it to surface in crypto lending.","At the time of recording, Moro concluded that Genesis Capital will continue to prioritize risk-adjusted returns over origination growth, and added that the business is close to full in how many clients they expect to do business with, at 75 - 100 borrowers.","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK2137864950\" width=\"100%\" height=\"200\" frameborder=\"no\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"$450 million","content":"MONEY"},{"type":"New Jersey","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"4.1%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"March 2018","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"last quarter","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"7.5%","content":"PERCENT"},{"type":"Michael Moro","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"$870 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"31%","content":"PERCENT"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"31.2%","content":"PERCENT"},{"type":"14%","content":"PERCENT"},{"type":"24%","content":"PERCENT"}],"hashtag":[],"authors":["Ryan Todd","The Block"]}