{"summary":"Binance has offices dotted all over the world, and a policy that forbids staff from talking about them. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234577\/why-binance-tells-staff-not-to-talk-about-its-offices","publishDate":"2023-06-14T10:28:51","id":12350,"type":null,"title":"Why Binance tells staff not to talk about its offices","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Binance, which at at one time boasted more than 8,000 employees, describes itself as a “remote-first” company. But it has offices dotted all over the world — and a policy that forbids staff from talking about them.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The crypto exchange operator, which is currently embroiled <\/span><a href=\"https:\/\/www.theblock.co\/amp\/post\/234511\/binance-us-sec-agree-to-work-out-deal-to-avoid-full-asset-freeze-bloomberg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in a battle<\/span><\/a><span data-v-f87c67ca=\"\"> with regulators in the U.S., has <\/span><a href=\"https:\/\/www.binance.com\/en\/blog\/all\/how-binance-runs-a-remote-organization-421499824684900510\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">penned blog posts<\/span><\/a><span data-v-f87c67ca=\"\"> about its setup ever since the outbreak of the Covid-19 pandemic in 2020. <\/span><span data-v-f87c67ca=\"\">The company said at the time that remote work has been the reality for “most of its journey.” <\/span>","<span data-v-f87c67ca=\"\">CEO Changpeng Zhao, meanwhile, has often claimed that Binance <\/span><a href=\"https:\/\/decrypt.co\/70045\/cz-pressed-on-binance-headquarters-at-ethereal-summit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">has no headquarters<\/span><\/a><span data-v-f87c67ca=\"\"> because it is a “decentralized” organization. It’s a feature of the business — and indeed of other crypto outfits — that can make things tricky for regulators.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In recent years, Binance has been putting down deeper roots in cities where it has won regulatory approval. Dubai and Paris, for example, have become regional hubs for the sprawling company.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But Binance also has offices in markets in which it is less in favor with local regulators, including in the UK where&nbsp;staff have access to an office within a shared workspace in Central London, according to people familiar with the matter. That’s despite the fact that Binance Markets Limited, its local entity, <\/span><a href=\"https:\/\/www.theblock.co\/post\/109766\/uk-fca-bans-crypto-exchange-binance\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">was banned by the Financial Conduct Authority<\/span><\/a><span data-v-f87c67ca=\"\"> in 2021.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A spokesperson for Binance said that the company is not domiciled in the UK and clarified that the platform is only available to UK consumers “on a 'reverse solicitation' basis.” <\/span><span data-v-f87c67ca=\"\">In markets where it has lots of international employees working in close proximity, Binance sometimes arranges shared workspaces, they added.<\/span>","<span data-v-f87c67ca=\"\">But staff must be careful not to talk about them, two of the people familiar with the matter said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“For personal and operational security reasons, we don’t actively encourage employees to advertise where these shared workspaces are located,” the Binance spokesperson said.&nbsp;<\/span>","Details of the policy come just days after Binance's Zhao <a href=\"https:\/\/www.theblock.co\/post\/233823\/binance-ceo-warns-employees-about-private-ranting-that-could-show-up-in-court\" data-v-f87c67ca=\"\">warned staff<\/a>, in an internal memo last week, to be careful about what they say via private messaging platforms, after the U.S. Securities and Exchange Commission's suit against the company contained a comment from an employee who allegedly said <span data-v-f87c67ca=\"\">“<\/span>we are operating as a fking unlicensed securities exchange in the USA bro.<span data-v-f87c67ca=\"\">”<\/span>","<span data-v-f87c67ca=\"\">The Binance spokesperson said the office policy boils down to security concerns.<\/span>","<span data-v-f87c67ca=\"\">“Ensuring that our colleagues’ personal safety is not compromised is of paramount importance to Binance,” they added. <\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That chimes with what one of the people familiar with the policy told The Block — that security was the main driver and that Binance was especially conscious of this after dealing with “lunatics” and angry investors in the past. In one prominent example involving a rival exchange named OKX, a trader who had suffered steep losses <\/span><a href=\"https:\/\/cointelegraph.com\/news\/okex-resolves-futures-price-slip-impact-as-trader-threatens-suicide\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">turned up outside the firm’s premises in Hong Kong<\/span><\/a><span data-v-f87c67ca=\"\"> threatening suicide.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet other crypto firms do not appear to have enforced Binance’s policy of gagging staff, and two of the people familiar with the matter said Binance might have ulterior motives.<\/span>","<span data-v-f87c67ca=\"\">“It was 100% to avoid regulators. But they pretended it was to stop angry customers showing up,” said one.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Of Binance’s thousands of staff, fully a quarter are based near the company’s regional hubs in Paris and Dubai, or in a satellite office within a jurisdiction in which Binance holds licenses or registrations, according to its spokesperson.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">“In many other jurisdictions in which we have established a local presence, we have provided a local address and contact details for our office to local regulators,” they said, adding that many staff work on a remote basis.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"19","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Binance spokesperson","content":"ORGANIZATION"},{"type":"USA","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Dubai","content":"LOCATION"},{"type":"Central London","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Ryan Weeks","The Block"]}