{"summary":"The $16.6 million retroactive payment is to cover Aave Companies&#x27; 15-month-long work in developing Aave v3.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162755\/aave-companies-requests-16-6-million-compensation-for-work-on-aave-v3","publishDate":"2022-08-10T10:02:36","id":12352,"type":null,"title":"Aave Companies requests $16.6 million compensation for work on Aave v3","category":["GOVERNANCE"],"content":["Aave Companies has requested $16.6 million in retroactive funding from the Aave DAO for its work in developing Aave v3, according to a governance <a href=\"https:\/\/governance.aave.com\/t\/arc-aave-v3-retroactive-funding\/9250\" data-v-f87c67ca=\"\">proposal<\/a> filed on Wednesday.","Aave Companies is the for-profit company behind the Aave DeFi lending protocol, while Aave DAO is the decentralized autonomous organization that controls the protocol’s treasury. It's run by AAVE token holders. The DeFi lending platform launched its third version in March, <a href=\"https:\/\/www.theblock.co\/linked\/138018\/aave-set-to-launch-third-version-of-its-defi-protocol-across-six-networks\" data-v-f87c67ca=\"\">as previously reported by The Block<\/a>.","According to Wednesday’s proposal, the $16.6 million retroactive funding will cover two payments. One part worth $15 million is for incurred work on the part of the team, while the remaining $1.6 million will be to cover smart contract auditing costs. The proposal stated that five different security firms audited the Aave v3 code in two separate auditing rounds.","The Aave developer also wants the $16.6 million payment split between $10 million in stablecoins and $6.6 million in AAVE (the protocol’s native token). The proposal requested that the $10 million payment in stablecoins should mirror the percentage composition of the protocol's treasury stablecoin holdings. The DAO's treasury holds about $34 million in three stablecoins — USDC, DAI and USDT — with USDC at 51% of the holdings and the latter two at 30% and 19% respectively.","The company says it will lock its $6.6 million in AAVE coins upon approval of the proposal. The vesting period will last for one year and the tokens will be staked during the lock-up period. The proposal also suggested a suitable price benchmark to determine how many tokens should be worth $6.6 million when making the payment. This benchmark price is a retrospective two-week average from the moment the governance vote passes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$34 million","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"AAVE","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"$16.6 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"19%","content":"PERCENT"},{"type":"$15 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$6.6 million","content":"MONEY"},{"type":"$10 million","content":"MONEY"}],"hashtag":["AAVE"],"authors":["Osato Avan-Nomayo","The Block"]}