{"summary":"The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley (@stephendpalley) and Nelson M.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/3010\/crypto-caselaw-minute-week-of-11-4-18-bitmain-chases-a-ghost-canada-cracks-down-on-coin-deal","publishDate":"2018-11-09T08:00:28","id":12354,"type":null,"title":"Crypto Caselaw Minute, Week of 11.4.18: Bitmain chases a ghost, Canada cracks down on coin deal","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@NelsonMRosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full.<\/em>","This week we look at John Doe’s day in court, centralized control over coins in an ICO, and a throwback to the Dread Pirate Roberts showing just how compelling circumstantial evidence can be. These topics (and more) in today’s Crypto Caselaw Minute. (As always, Rosario summaries are “NMR” and Palley summaries are “SDP.” Palley and I are happy to be joined by Canadian lawyer Evan Thomas, who provides an update on the PlexCorps case from Quebec).","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Link to Complaint on Sribd:&nbsp;<\/em><a href=\"https:\/\/www.scribd.com\/document\/392698070\/Bitmain-Lawsuit\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Bitmain v. John Do<\/em><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">e<\/em><\/a>","Did you know you can sue someone without even knowing their name? The device of a “John\/Jane Doe” complaint allows a plaintiff to sue an unknown person and then use subpoena power to figure out who they are. That appears to be what’s going on in this new lawsuit by Bitmain against a John Doe defendant, filed yesterday in federal court in Seattle. (Bitmain is an international firm that designs specialized chips for bitcoin mining).","Per the Complaint, “Bitmain brings this action against the as-yet-to-be-identified “John Doe” thief who stole valuable bitcoin from Bitmain through unauthorized hacking\/access into online accounts. Bitmain seeks to identify the person responsible, hold them accountable, and recover its stolen property.” Bitmain alleges violation of the federal Computer Fraud and Abuse Act, the Washington Cybercrime Act, and common law conversion.","Bitmain alleges that the John Doe defendant broke into Bitmain’s Binance account in April 2018 and used the account to purchase the MANA token at an inflated price. Then, according to the complaint, John Doe used a separate wallet to take the other side of the trade, effectively using Bitmain’s Binance account for wash trading in attempt to manipulate the price of the token. Charts in the Complaint illustrates the alleged scam:","What’s the lesson? It’s almost Captain Obvious territory folks: Stealing crypto from a centralized exchange leaves a lot of fingerprints. And your name doesn’t need to be known for you to get sued. Now that the lawsuit is on file, one assumes that Bitmain’s next step will be to issue subpoenas to Binance and other service providers, allowing it to identify the defendant. (“But Steve,” you ask, “ what if they’re outside the United States?” If the defendant is outside the U.S. we will write a fun follow up post on how you serve subpoenas outside the United States and how Bitmain probably isn’t worried about the bill).[related id= 1]","In the latest chapter of PlexCoin’s ongoing battles with securities regulators, Québec’s Financial Markets Administrative Tribunal (FMAT) has found that the PlexCoin ICO was an investment contract and therefore subject to Québec securities law. In doing so, the FMAT emphasized the centralization of PlexCoin, as compared to bitcoin.","PlexCoin’s legal troubles began with an anonymous tip to the Québec Autorité des marchés financiers (AMF), Québec’s securities regulator. The AMF promptly obtained various orders from the tribunal to shut down the PlexCoin ICO on the grounds that it violated Québec securities law. The promoters challenged these orders at a full hearing, arguing that PlexCoin was not an investment contract.","The Québec Securities Act defines an investment contract as “a contract whereby a person, having been led to expect profits, undertakes to participate in the risk of a venture by a contribution of capital or loan, without having the required knowledge to carry on the venture or without obtaining the right to participate directly in decisions concerning the carrying on of the venture.” The alert reader will note that this definition looks very similar to the Howey test, and indeed, Howey and other U.S. cases have long influenced how Canadian courts and tribunals look at “investment contracts”.","The FMAT had little trouble concluding that the PlexCoin ICO was an investment contract because it found:","A few implications. First, not surprisingly, the decision is fully in line with the numerous warnings from Canadian and U.S. securities regulators that many ICOs are subject to securities laws.","Second, to the extent there is any uncertainty about bitcoin’s status under Québec securities law, the FMAT’s reasons imply that it did not consider bitcoin to be a security.","Third, and perhaps most interestingly, the reasons suggest that the greater the degree of centralized control, particularly in terms of how coins or tokens are issued, the more likely that coin or token will be considered an investment contract, at least in Québec.","<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Link to Decision on SCOTUSBlog:&nbsp;<\/em><a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/www.scotusblog.com\/wp-content\/uploads\/2018\/01\/17-950-opinion-below.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"http:\/\/www.scotusblog.com\/wp-content\/uploads\/2018\/01\/17-950-opinion-below.pdf\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">USA v. Ulbricht<\/em><\/a>","The case of Ross Ulbricht, aka the “Dread Pirate Roberts,” who operated the website the Silk Road is long, complex, and depending on who you talk to, highly contentious. We aren’t going to discuss any of that. Instead, the Ulbricht case is a fascinating case study in evidence, new technology, Fourth Amendment law, and how much information we put online and store in a digital manner.","Ulbricht was convicted of a long list of crimes in relation to his operation of the website the Silk Road. For those that do not know, the Silk Road was essentially an eBay for all things illegal where transactions were conducted using bitcoin. Ulbricht at trial did not contend that he created the Silk Road site, nor that he was in charge of it at the time he was arrested.","After being convicted Ulbricht appealed that conviction to the Second Circuit Court of Appeals. In particular, Ulbricht “challenge[d] several aspects of his conviction and sentence, arguing that (1) the district court erred in denying his motion to suppress evidence assertedly obtained in violation of the Fourth Amendment; (2) the district court committed numerous errors that deprived him of his right to a fair trial, and incorrectly denied his motion for a new trial; and (3) his life sentence is both procedurally and substantively unreasonable.” For purposes of this post we’ll be focusing on (1) above.","What evidence did Ulbricht want to suppress, and why, and what does this have to do with crypto? There were two sets of evidence that Ulbricht wished to suppress at trial. The first was evidence obtained as part of pen\/trap orders to monitor IP traffic related to Ulbricht, and the second was evidence collected from warrants to search his laptop, Google, and Facebook accounts. We’re going to discuss the second set of evidence, but it is worth noting that the first set of evidence was the subject of an denied petition for certiorari to the Supreme Court of the United States earlier this year, and the second set of evidence was not. For those that are interested, here is&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.supremecourt.gov\/DocketPDF\/17\/17-950\/24860\/20171222095855755_Ulbricht%20cert%20petition.pdf\" target=\"_blank\" rel=\"nofollow noopener noreferrer\" data-href=\"https:\/\/www.supremecourt.gov\/DocketPDF\/17\/17-950\/24860\/20171222095855755_Ulbricht%20cert%20petition.pdf\" data-v-f87c67ca=\"\">the petition<\/a>&nbsp;to the Supreme Court.","So, what was in Ulbricht’s laptop, Google, and Facebook accounts? Evidence of tons of bitcoin transactions, social media postings corroborating his identity as the Dread Pirate Roberts, and more. Ulbricht was arrested in a public library in San Francisco with his laptop open, and a consequence of that arrest was, “[T]he government seized approximately $18 million worth of bitcoins from the wallet on Ulbricht’s laptop and analyzed their transaction history (through blockchain records) to determine that about 89% of the bitcoins on Ulbricht’s computer came from Silk Road servers located in Iceland.” Although that evidence is circumstantial, that evidence is ... compelling.","Perhaps those bitcoin arrived at Ulbricht’s laptop innocently? Ulbricht’s counsel advanced that theory in his opening statement, but as the court notes in a footnote in this decision “[n]o evidence about the source of those bitcoins was in fact presented by Ulbricht, and neither the expert disclosures presented to the district court nor Ulbricht’s arguments on appeal suggest that either Bellovin or Antonopoulos (<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">these were expert witnesses Ulbricht wanted to call at trial, but was unable to for other reasons not discussed here<\/em>) would have provided an analysis or explanation of Ulbricht’s bitcoin transactions that would have revealed a non-Silk Road source for Ulbricht’s bitcoins.”","Ultimately, Ulbricht tried to argue that the search of his laptop and his Google and Facebook accounts violated the Fourth Amendment’s particularity requirement that you have to know what it is you’re searching for, and that you can’t use what is known as a “general warrant” to just go searching around for anything and everything. The court did not find this argument compelling as it explained in a thorough discussion, stating in conclusion that the warrants “satisfied all three of the particularity requirements because they listed the subject offenses, described the things to be searched, and identified the information to be seized in relation to the charged crimes.”","As always, anything you put in writing, online, on your laptop, sent via passenger pigeon, or disseminated via skywriting can be considered evidence.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Silk Road servers","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ross Ulbricht","content":"PERSON"},{"type":"Evan Thomas","content":"PERSON"},{"type":"John\/Jane Doe","content":"PERSON"},{"type":"Bitmain","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Second Circuit Court of Appeals","content":"ORGANIZATION"},{"type":"Ulbricht","content":"LOCATION"},{"type":"Ulbricht","content":"PERSON"},{"type":"Bellovin","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Bitmain’s Binance","content":"PERSON"},{"type":"Iceland","content":"LOCATION"},{"type":"Seattle","content":"LOCATION"},{"type":"Steve","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Dread Pirate Roberts","content":"ORGANIZATION"},{"type":"Complaint","content":"ORGANIZATION"},{"type":"Rosario","content":"PERSON"},{"type":"AMF","content":"ORGANIZATION"},{"type":"Québec’s Financial Markets Administrative Tribunal","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"$18 million","content":"MONEY"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"John Doe","content":"PERSON"},{"type":"89%","content":"PERCENT"},{"type":"PlexCoin ICO","content":"ORGANIZATION"},{"type":"Ulbricht","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Québec","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"Dread Pirate Roberts","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"},{"type":"Quebec","content":"LOCATION"},{"type":"USA v. Ulbricht","content":"LOCATION"},{"type":"April 2018","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}