{"summary":"One month on, here’s a detailed look at multiple ways in which The Merge impacted the Ethereum blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177704\/five-key-ways-the-merge-affected-the-ethereum-blockchain","publishDate":"2022-10-18T15:15:01","id":12361,"type":null,"title":"Five key ways The Merge affected the Ethereum blockchain","category":["ETHEREUM"],"content":["A month has now passed since The Merge <a href=\"https:\/\/www.theblock.co\/post\/169299\/ethereum-activates-the-merge-as-it-shifts-to-proof-of-stake\" data-v-f87c67ca=\"\">took place<\/a>, switching Ethereum from a mining-based system to one focused on staking.","The launch went relatively smoothly and no major bugs have yet to emerge. But The Merge did have several significant impacts on the Ethereum blockchain that can be observed — two of which could prove tricky for the network in the long run.","Let’s take a look at some of the ways in which The Merge affected Ethereum.","The main purpose of The Merge was to change Ethereum’s current proof-of-work consensus mechanism to proof of stake. In doing so, the upgrade made the network far more energy efficient.","<span data-v-f87c67ca=\"\">Ethereum energy consumption. Image: Digiconomist<\/span>","After The Merge, Ethereum’s annual energy consumption fell from 80 TWh to merely 0.01 TWh per year, <a href=\"https:\/\/digiconomist.net\/ethereum-energy-consumption\" data-v-f87c67ca=\"\">according<\/a> to Digiconomist.&nbsp;","Using proof-of-stake, a single Ethereum transaction can be roughly translated to carbon emissions of up to 22 VISA transactions, a substantially lower carbon footprint when compared to its former design.","It’s worth noting that transactions aren’t directly linked to energy use and that this doesn’t include transactions made on Layer 2 networks.","After the transition, the amount of new ether being created has dropped by nearly 90%. This is a result of validator rewards being significantly smaller than the miner rewards issued under the old system.","The supply of ether has increased by nearly 6,500 ETH since The Merge; otherwise, the supply would have increased by an estimated 400,000 ETH, according to data tracking site ultrasound.money. Both figures take into account the amount of ETH burned during the transaction fee process.","<span data-v-f87c67ca=\"\">Ethereum's supply growth since The Merge. Image: Ultrasound.money<\/span>","As of now, Ethereum’s supply is still inflationary, with a supply growth rate of 0.06%. If activity on the network rises and more ETH is burned during the transaction fee process, it could become <a href=\"https:\/\/www.theblock.co\/post\/176102\/ethereums-weekly-supply-growth-turns-deflationary-for-first-time-since-merge\" data-v-f87c67ca=\"\">deflationary<\/a> — where more ETH is destroyed than created each day.&nbsp;","Following The Merge, proof of stake validators are now running the blockchain and are responsible for processing transactions.","A day after The Merge, on Sept.16, Ethereum’s validator participation rate, the metric to see all validators expected to verify blocks, fell off by 3%. This was a temporary bump in the transition as the participation rate returned to its optimum state in a matter of days. The participation rate currently sits at <a href=\"https:\/\/www.rated.network\/\" data-v-f87c67ca=\"\">99.5%<\/a>, which shows that most validators are online and performing their duties in block production and attestation with up-to-date clients.&nbsp;","The number of Ethereum node validators has increased to over 435,000 from nearly 420,000 a month after the Merge, according to <a href=\"https:\/\/beaconcha.in\/\" data-v-f87c67ca=\"\">data<\/a> from beaconcha.in. These validators have collectively staked about 13.2 million ether.","A downside of The Merge is that it has resulted in a handful of staking providers controlling the majority of validators on Ethereum.","Just four providers — Lido and exchanges Coinbase, Binance and Kraken — account for <a href=\"https:\/\/www.rated.network\/\" data-v-f87c67ca=\"\">more than 55%<\/a> of Ethereum’s validator nodes. Lido is different from the others because it is a liquid staking protocol that passes on the validator process to other validators but it still remains a potential point of centralization.","The centralization issue is expected to be at least partially resolved after Ethereum’s next upgrade, called Shanghai, which will let users unstake their tokens from these providers and potentially enable more competition.","Shanghai is slated to take place sometime in the next year.","After The Merge, Ethereum validators have been increasingly using MEV Boost, a software that enables a marketplace for maximum extractable value (MEV).","This software allows block builders to run what's called a “relay” that tells Ethereum validators which transactions they should prioritize in block production and receive MEV rewards.","MEV Boost represents a bit of a no-brainer for validators because it results in them making extra rewards, but this service has come with unwanted consequences.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/number-of-blocks-proposed-from-flashbots-mev-boost-relay\/embed\" title=\"Number of Blocks Proposed from Flashbots MEV-Boost Relay\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While there are multiple firms that run their relays for MEV Boost, the most widely used relay is offered by <a href=\"https:\/\/www.theblock.co\/post\/174386\/flashbots-now-accounts-for-39-of-ethereum-blocks-as-censorship-concerns-rise\" data-v-f87c67ca=\"\">Flashbots<\/a>. Its relay has been censoring transactions, refusing to process any anything connected to mixing protocol Tornado Cash to comply with U.S. Office of Foreign Assets Control (OFAC) sanctions against the decentralized crypto mixer.","Currently, <a href=\"https:\/\/transparency.flashbots.net\/\" data-v-f87c67ca=\"\">47%<\/a> of Ethereum blocks are built using Flashbots.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Sept.16","content":"DATE"},{"type":"55%","content":"PERCENT"},{"type":"Lido","content":"LOCATION"},{"type":"47%","content":"PERCENT"},{"type":"The Merge","content":"ORGANIZATION"},{"type":"0.06%","content":"PERCENT"},{"type":"U.S. Office of Foreign Assets Control (OFAC","content":"ORGANIZATION"},{"type":"99.5%","content":"PERCENT"},{"type":"Binance","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}