{"summary":"A Chinese crypto founder accused a venture-backed brokerage of fraud, only to retract the statement and praise the firm days later.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/66864\/chinese-fund-fraud-accusation-ieo","publishDate":"2020-05-29T17:39:23","id":12360,"type":null,"title":"A Chinese fund founder accused an IEO project of fraud, but later said it was a &#x27;misunderstanding&#x27;","category":["THE BLOCK"],"content":["On May 26, Qihan Lin began introducing Troy — a self-proclaimed crypto prime broker that raised an<a href=\"https:\/\/launchpad.binance.com\/\" data-v-f87c67ca=\"\"> Initial Exchange Offering<\/a> (IEO) on Binance — to a group of Chinese investors during a WeChat-based \"Ask Me Anything\" session.","\"We provide prime brokerage services to institutional investors and professional traders through the revolutionary fintech product TroyTrade, which combines spot trading, leverage trading, derivatives trading, data analysis, asset custody, mortgage lending, and other functions together into one single account,\" Lin said.&nbsp;","The conversation was then derailed as Fen Wang, the founder of crypto fund Consensus Lab, posted a slew of messages accusing Troy of swindling investors out of their money.&nbsp;","<em data-v-f87c67ca=\"\">\"Troy causes Consensus Lab terrible loss. It is the only project we invested last year that lost money.\"<\/em>","<em data-v-f87c67ca=\"\">\"Your reputation has collapsed in my mind and we will sue you. Your fundraising practice was similar to a fraud.\"&nbsp;<\/em>","<em data-v-f87c67ca=\"\">\"I personally invested $300,000, while the fund invested $1 million.\"&nbsp;<\/em>","Within hours, screenshots of Wang's messages soon circulated among the Chinese crypto community, and several other funds also revealed their own losses in Troy. One investor, Jun Zhang, <a href=\"https:\/\/www.weibo.com\/2110726370\/J3L2ICxr3?type=comment#_rnd1590771561652\" data-v-f87c67ca=\"\">posted<\/a> on Chinese social media site Weibo that his fund lost 70% in Troy. Another, crypto fund BlockArk CEO Allen Su, said his fund lost 50% through its investment, according to a screenshot shared with The Block.&nbsp;","These investors also formed a new group chat to discuss plans to recover their losses from Troy, with Wang claiming that he would take legal action against the project.&nbsp;","The market performance of Troy's native token, TROY, might be one of the reasons that precipitated the investor uproar.&nbsp;","Last August, Troy <a href=\"https:\/\/www.chainnews.com\/articles\/853933987788.htm\" data-v-f87c67ca=\"\">raised<\/a> \"several million dollars\" from BlockVC, Consensus Lab, NGC Ventures and others. An IEO was then held in December via Binance, through which TROY tokens were sold $0.005 apiece. The price has trended down since its debut, sliding from the initial $0.005 to $0.0041 at press time, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/troy\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CoinGecko<\/a> data. TROY fell to $0.001 during the Black Thursday market crash in March.&nbsp;","Several investors highlighted in their messages that Troy's relationship with BlockVC was cause for concern and triggered Wang's fraud allegations.","As Wang alleged, BlockVC was not only an investor of Troy but also the company that runs the project. The fund then convinced several investors to put money in Troy without disclosing its relationship with the project.&nbsp;","\"A few people from Block VC packages a Troy project and bought it themselves, but nobody called them out,\" Wang said.&nbsp;","Several investors alleged that they only put money in Troy because of BlockVC, according to screenshots reviewed by The Block. Additionally, some of BlockVC's limited partners (LPs) <a href=\"https:\/\/baijiahao.baidu.com\/s?id=1667987251127460225&amp;wfr=spider&amp;for=pc\" data-v-f87c67ca=\"\">had also reportedly complained<\/a> that the fund put 30% of their money into Troy without fully clarifying the two's relationship.&nbsp;","The situation took a dramatic turn two days later.&nbsp;On Thursday, Wang <a href=\"https:\/\/weibo.com\/7184554280\/J3ZEfjzz4?refer_flag=1001030103_\" data-v-f87c67ca=\"\">issued a statement<\/a> on social media praising BlockVC and Troy, claiming that there were some \"misunderstandings between BlockVC and Consensus Lab.\"&nbsp;","\"BlockVC is an excellent team in the field of crypto investment and research... Consensus Lab will continue working with BlockVC to support good projects and team,\" the statement read.&nbsp;","Wang said the teams behind BlockVC and Troy visited him the day after the AMA, explaining the relationship between the two companies and showed him some \"good progress\" that Troy had achieved. However, the details of their conversation were not disclosed.&nbsp;","BlockVC founder Kevin Xu also posted a public announcement on Weibo, attesting to the misunderstanding between Troy and Consensus Lab.&nbsp;","\"As an investor, we certainly hope that the projects we invest in can grow and become the power engine behind the progress of the industry. At the same time, as the leading investor of Troy, we will continue to promote the development of the brokerage business in the crypto asset industry and encourage Troy to have better performance in the future,\" Xu wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Weibo","content":"PERSON"},{"type":"May 26","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$0.0041","content":"MONEY"},{"type":"\"several million dollars","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"AMA","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Jun Zhang","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Fen Wang","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wang","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Wang","content":"ORGANIZATION"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"Allen Su","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Qihan Lin","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"\" Lin","content":"PERSON"},{"type":"Kevin Xu","content":"PERSON"},{"type":"$300,000","content":"MONEY"},{"type":"$0.001","content":"MONEY"},{"type":"$0.005","content":"MONEY"},{"type":"two days later","content":"DATE"}],"hashtag":["FUNDRAISING"],"authors":["Celia Wan","The Block"]}