{"summary":"Aave Companies is heading into the final phase of the proposed implementation of its decentralized GHO stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233419\/aave-companies-gho-stablecoin-proposal-ethereum","publishDate":"2023-06-07T04:06:54","id":12365,"type":null,"title":"Aave Companies proposes final GHO stablecoin rollout on Ethereum","category":["STABLECOINS"],"content":["Aave Companies, the key contributor to the decentralized finance platform, is heading into the final phase of <a href=\"https:\/\/www.theblock.co\/post\/156348\/defi-protocol-aave-proposes-creation-of-stablecoin-called-gho\" data-v-f87c67ca=\"\">the proposed implementation<\/a> of its decentralized GHO stablecoin —&nbsp;which is already operational on Ethereum’s Goerli testnet.","The stablecoin's final rollout will need two rounds of on-chain votes from the Aave community, including the first \"ARFC\" preliminary proposal and the final Aave Improvement Proposal. If these proposals get the green light from Aave's decentralized autonomous organization, GHO will be launched on the Ethereum mainnet, accessible to V3 users.","Stablecoins are cryptocurrencies engineered to minimize volatility by pegging to a stable asset or a group of assets — usually fiat currencies — backed by centralized reserves (like cash) or crypto assets. Aave will use the latter to back the value of GHO and issue it as an overcollateralized loan, similar to MakerDAO's DAI stablecoin.","If the proposal gains approval from the DAO, all interest generated from GHO loans would be channeled to the DAO treasury as extra income. This could potentially sway DAO members to vote in favor of the proposal, bolstering the financial sustainability of the project.","“The introduction of GHO would make stablecoin borrowing on the Aave Protocol more competitive and generate additional revenue for the Aave DAO by providing to the DAO treasury 100% of the interest payments made on GHO borrows,” Aave Companies wrote.","Aave Companies plans to leverage two of its smart contract systems — the V3 Ethereum Facilitator and the FlashMinter Facilitator — to issue the GHO stablecoin. The V3 Ethereum Facilitator enables users to deposit collateral and lend out GHO, with the collateral stored in the Ethereum mainnet pool. Users can secure their crypto assets as collateral to borrow GHO.","The FlashMinter Facilitator, the second system, allows for FlashMinting of GHO. FlashMinting is a variant of Flash Loans — an innovative concept pioneered by Aave that enables users to borrow assets without collateral, provided the loan is repaid within the same transaction block, which mitigates risk for lenders. This feature means users can mint (or create) GHO and repay it in a single transaction without needing to borrow assets from a liquidity pool separately.","Additionally, Aave Companies is considering implementing a multi-chain strategy after the launch of GHO on the Ethereum mainnet. Multi-chain strategies are gaining popularity in the DeFi space, given they enhance access to various user bases and alleviate risks tied to dependence on a single blockchain.","This proposal by Aave Companies comes just days after Curve Finance, one of the biggest decentralized exchanges, also <a href=\"https:\/\/www.theblock.co\/post\/229436\/curve-finance-deploys-crvusd-stablecoin-on-ethereum-mainnet\" data-v-f87c67ca=\"\">launched<\/a> its stablecoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"FlashMinting of GHO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Aave","content":"ORGANIZATION"},{"type":"Aave Improvement Proposal","content":"ORGANIZATION"},{"type":"GHO","content":"ORGANIZATION"},{"type":"Aave Companies","content":"ORGANIZATION"}],"hashtag":["AAVE","GOVERNANCE VOTES","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}