{"summary":"The bill aims to impose a two-year moratorium, specifically preventing new permits from being issued to carbon-based fueled proof-of-work mining operations that use behind-the-meter energy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143658\/new-york-assembly-passes-two-year-crypto-mining-moratorium-bill","publishDate":"2022-04-26T20:47:27","id":12363,"type":null,"title":"New York Assembly passes two-year crypto mining moratorium bill","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">The New York State Assembly voted to pass a bill that will essentially freeze current levels of crypto mining carbon emissions until the state can act on a comprehensive impact study.<\/span>","The bill passed with a vote tally of 95 in favor and 52 against. <span data-v-f87c67ca=\"\">It aims to impose a<\/span> two-year moratorium, specifically preventing new permits from being issued to carbon-based fueled proof-of-work mining operations that use behind-the-meter energy. Additionally, already established sites planning to increase the amount of energy consumed would not be able to get a permit renewal.","Democratic Assemblymember Anna Kelles, the main sponsor of the bill, said its goal was to ensure that the state meets measures set by <span data-v-f87c67ca=\"\">New York’s Climate Leadership and Community Protection Act (CLCPA), which was passed in 2019. The Assembly is the lower chamber of the New York State Legislature.<\/span>","<span data-v-f87c67ca=\"\">The bill also tasks the Department of Environmental Conservation (DEC) with conducting a General Environmental Impact Statement on all crypto mining operations in the state. The study is set to be completed within the span of a year, giving lawmakers time to act on the findings before the moratorium expires.<\/span>","<span data-v-f87c67ca=\"\">Legislators have been pushing for several months to temporarily halt the growth of crypto mining in the state before a comprehensive study could be conducted. An earlier version of the bill, which called for a three-year moratorium on a broader scope of mining facilities, died in the Assembly in June of last year.<\/span>","On Tuesday, members of the Assembly debated the bill for well over two hours. I<span data-v-f87c67ca=\"\">n an effort to dispel the idea that the moratorium would generally ban crypto mining, Kelles, the main sponsor of the bill, repeatedly insisted that it would only apply to a select number of fossil-fuel power plants.<\/span>","\"This bill is not retroactive in nature. (...) It is only specifically to power plants, of which we have about 30 in upstate and about 19 in downstate,\" said Kelles.","Republican Assemblyman Robert Smullen called the bill an \"anti-tech\" piece of legislation \"disguised as an environmental law.\"&nbsp;","Smullen went on to argue that the legislation would send the wrong signal to the financial services sector in New York and could possibly result in miners simply moving to other states and taking jobs with them.","\"We're going into a more cashless economy. And I think we should be welcoming these industries and figuring out how to reduce emissions elsewise,\" he said.","Kelles maintained that the bill would not hinder New York's ability to be a leader in crypto when it comes to other aspects of the industry, such as buying, trading and selling digital assets.","<span data-v-f87c67ca=\"\">Following China’s ban on crypto mining last year, the US has seen exponential growth in hashing power, with several miners repurposing previously deactivated power plants.<\/span>","<span data-v-f87c67ca=\"\">One such facility, run by Greenidge Generation in the Finger Lakes region, has been in the middle of a controversial permit renewal process in New York. Last month the DEC <a href=\"https:\/\/www.theblockcrypto.com\/post\/140081\/greenidge-permit-renewal-delayed-as-company-debates-with-regulators\" data-v-f87c67ca=\"\">pushed back the final decision<\/a> to June while it reviews the company’s proposed mitigation measures and close to 4,000 public comments.<\/span>","Republican Assemblyman Philip Palmesano said that Greenidge's plant had made a positive contribution in terms of taxes and job creation.","Kelles claimed that the agro-tourism sector in the Finger Lakes region, which employs 60,000 people in the area, had already reported negative impacts from Greenidge's plant in terms of sound, air and water pollution.&nbsp;","\"How many jobs are we creating for that pollution. And how many jobs have we lost?\" Kelles asked. \"We need need to talk about it as net job creation.”","The bill is currently still in committee in the New York State Senate.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York State Senate","content":"ORGANIZATION"},{"type":"Greenidge","content":"PERSON"},{"type":"Greenidge Generation","content":"ORGANIZATION"},{"type":"Robert Smullen","content":"PERSON"},{"type":"June of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"General Environmental Impact Statement","content":"ORGANIZATION"},{"type":"DEC","content":"ORGANIZATION"},{"type":"Kelles","content":"PERSON"},{"type":"Anna Kelles","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Smullen","content":"PERSON"},{"type":"New York State Legislature","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Philip Palmesano","content":"PERSON"},{"type":"Department of Environmental Conservation","content":"ORGANIZATION"},{"type":"New York State Assembly","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}