{"summary":"The report by JP Morgan also noted that Terra&#x27;s collapse had a limited knock-on effect on the rest of the DeFi ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148746\/vc-funding-to-help-crypto-avoid-a-long-winter-post-terras-collapse-jp-morgan","publishDate":"2022-05-25T11:25:40","id":12379,"type":null,"title":"VC funding to help crypto avoid a long winter post-Terra&#x27;s collapse: JP Morgan","category":["MARKETS"],"content":["As long as VC funding continues to plow into the crypto markets, a long winter should be avoided, according to analysts at JP Morgan.","In a research report on Wednesday, the investment bank wrote that VC funding is continue to flood into the crypto markets despite the fall of crypto's most prominent algorithmic stablecoin — and as long as this continues to happen, the outlook is bright.","“Thus far there is little evidence of VC funding drying up post Terra’s collapse. Of the $25 billion VC funding [year to date], almost $4 billion came after Terra. Our best guess is the VC funding will continue and a long winter similar to 2018\/2019 would be averted,” the report said. Yet if this funding dries up, a long winter could be on the cards, it noted.","The report also said that Terra's collapse has had limited knock-on effects on the rest of the DeFi ecosystem (despite calling it a \"significant blow to the crypto world\"). According to the bank, the Total Value Locked (TVL) in other DeFi projects appears to have been “relatively resilient” to its demise. TVL is a figure used to represent the value of cryptocurrencies locked up in DeFi protocols.","While Terra's collapse did sour investor sentiment, this hasn’t spilled over into other stablecoins. The report noted the differences between types of stablecoins, explaining that each design had a different risk-profile. It noted there was a modest pressure on the algorithmic stablecoin Frax and that Neutrino USD lost its peg.","<span data-v-f87c67ca=\"\">The report highlighted that, according to its estimates, bitcoin may currently be undervalued. <br data-v-f87c67ca=\"\">\n<\/span>","\"The bitcoin to gold [volume] ratio has declined modestly towards 4x, which in our framework would suggested an unchanged fair value of around $38k implying significant upside for digital assets from here,\" the report said.","Based on the price of bitcoin (BTC) at the time of writing, which was $29,774 according to Coinbase data via TradingView, it is currently 21% below this price.","<span data-v-f87c67ca=\"\">“The past month’s crypto market correction looks more like capitulation relative to last January\/February and going forward we see upside for bitcoin and crypto markets more generally,” said the report.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$25 billion","content":"MONEY"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"21%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$38k","content":"MONEY"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Neutrino USD","content":"ORGANIZATION"},{"type":"$29,774","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Adam Morgan McCarthy","The Block"]}