{"summary":"Over the last 217 days, the total supply of ether has reduced by 103,092 coins — worth more than $200 million at current prices.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227426\/ethereum-supply-100000-ether-merge","publishDate":"2023-04-21T01:17:45","id":12371,"type":null,"title":"Ether supply reduced by 100,000 coins since The Merge","category":["LAYER 1S"],"content":["Since The Merge moved Ethereum away from an energy-intensive proof-of-work consensus mechanism to a more environmentally friendly proof-of-stake method, the supply of ether has declined by more than 100,000 coins.","Over the last 217 days, the total supply of ether has <a href=\"https:\/\/ultrasound.money\" data-v-f87c67ca=\"\">declined<\/a>&nbsp;by 103,092 coins — worth more than $200 million at current prices — according to Ethereum tracking website ultrasound.money.","Were The Merge never to have happened and Ethereum remained secured by miners, as opposed to stakers, the ether supply would have increased by more than 2.52 million coins — or $4.9 billion.&nbsp;The supply of Ethereum's native coins would also have increased yearly by 3.53%.","Instead, post-Merge Ethereum's coin supply is down by 0.144% per year. Furthermore, ultrasound.money claims $1.2 billion is being removed from the ether supply over the same time frame.","<span data-v-f87c67ca=\"\">The supply of ether has declined by 0.144% yearly since The Merge. Source: ultrasound.money<\/span>","The current supply of ether is roughly 120,418,032 million coins.","Though The Merge has undoubtedly catalyzed Ethereum's reduction in native-coin supply, it did not itself implement the burning of ether. Instead, that tokenomic aspect was <a href=\"https:\/\/www.theblock.co\/linked\/125383\/more-than-1-million-eth-has-been-burned-following-eip-1559\" data-v-f87c67ca=\"\">triggered<\/a> by Ethereum Improvement Proposal 1559 — or EIP-1559, for short — which was pushed via the London upgrade.","Last August — or&nbsp;623 days ago, to be precise — Ethereum's London upgrade effectively split <a href=\"https:\/\/www.theblockcrypto.com\/news+\/114474\/how-do-ethereum-transaction-fees-work-now-that-eip-1559-is-live\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">transaction fees<\/a> into a base cost and a priority fee. The former is burned, while the latter served as a form of payment to miners — which no longer exist for the protocol.","EIP-1559 was also designed to exert deflationary pressure on the ether supply since the base fee gets burned and can no longer be used on the network — reducing the amount of inflation on the Ethereum network. But it,&nbsp;itself, hasn't decreased the blockchain's total supply. Since London went live, the total supply of ether has increased by 3.21 million coins.","On the subject of burning ether, that activity has <a href=\"https:\/\/www.theblock.co\/post\/227057\/ethereum-shapella-first-week-deposits-withdrawals-burn\" data-v-f87c67ca=\"\">increased<\/a> since Ethereum's Shapella upgrade opened up staked ether withdrawals just over one week ago.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$4.9 billion","content":"MONEY"},{"type":"3.53%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"$1.2 billion","content":"MONEY"},{"type":"0.144%","content":"PERCENT"},{"type":"1559","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}