{"summary":"Pro-crypto advocacy groups are warning that the decision in the Tornado Cash case could have wide-ranging effects for all software developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286828\/three-crypto-advocacy-groups-file-amicus-briefs-in-tornado-cash-developer-roman-storms-case","publishDate":"2024-04-06T15:59:19","id":12374,"type":null,"title":"Three crypto advocacy groups file amicus briefs in Tornado Cash developer Roman Storm&#x27;s case","category":["POLICY"],"content":["Tornado Cash developer Roman Storm, who was arrested in August and slapped with three charges related to his role as a co-founder of Ethereum privacy protocol Tornado Cash, has received support in the form of three amicus briefs from prominent pro-crypto organizations.&nbsp;","Storm <a href=\"https:\/\/www.theblock.co\/post\/285786\/arrested-tornado-cash-dev-roman-storm-motions-to-drop-fatally-flawed-charges\" data-v-f87c67ca=\"\">motioned<\/a> to drop the charges against him last week, claiming the government's argument was \"fatally flawed\" in its characterization of Tornado Cash's service and the various elements of blockchain technology. Roman Semenov, a Russian national and Tornado Cash co-founder who was hit with the same charges, is still at large, while Alexey Pertsev, another co-founder, is currently awaiting the results of his trial in the Netherlands with a verdict expected May 14.&nbsp;","The three amicus briefs were filed by Coin Center, the Blockchain Association, and the DeFi Education Fund. The briefs, though written and filed separately, make largely similar arguments against the government's characterization of the case in its indictment.&nbsp;","For instance, the government's <a href=\"https:\/\/www.justice.gov\/usao-sdny\/file\/1311391\/dl?inline\" data-v-f87c67ca=\"\">indictment<\/a> alleges that Semenov and Storm \"engaged in the business of transferring funds on behalf of the public\" but that Tornado Cash wasn't registered with the U.S. Financial Crimes Enforcement Network (FinCEN), leading to the charge of conspiracy to operate an unlicensed money transmitting business.&nbsp;","Yet the Blockchain Association, in its <a href=\"https:\/\/theblockchainassociation.org\/wp-content\/uploads\/2024\/04\/Storm-Amicus-BA-As-Filed.pdf\" data-v-f87c67ca=\"\">brief<\/a>, points out that this characterization goes against FinCEN's own definitions. \"Unless the intermediary exercises total independent control over the assets, money-transmitter liability cannot attach,\" the brief reads. \"Indeed, FinCEN’s own guidance recognizes that 'suppliers of …anonymizing software' are not money transmitters.\"","The brief goes on to explain in great detail how Tornado Cash works without giving its developers independent control over any user assets, and threatens that if the government's stance that Tornado Cash is a money-transmitting business holds, then \"...compliance with the Bank Secrecy Act could be impossible for developers, meaning the government’s interpretation is tantamount to a ban on anonymizing protocols.\"","Coin Center's brief focuses on arguments against the count of conspiracy to violate the International Economic Emergency Powers Act (IEEPA) and provides a First Amendment defense to the charges. The conspiracy count, which has to do with Tornado Cash's alleged sanctions violations, shouldn't hold up as \"Publishing decisions over the functionality of the software and how to release it were made long before any knowledge of the [North Korean state-sponsored hackers] Lazarus Group’s activities could have even existed,\" the brief <a href=\"https:\/\/www.coincenter.org\/app\/uploads\/2024\/04\/Coin-Center-Amicus-Brief-filed.pdf\" data-v-f87c67ca=\"\">argues<\/a>.","To argue that Tornado's founders colluded with Lazarus would be like suggesting \"the developers of the Linux open-source operating system confederated with the regime of Iran, merely by freely releasing a valuable computing tool that Iran would later use to operate computers related to its weapons programs,\" the brief continues.&nbsp;","The DeFi Education Fund's brief, in arguing against the charges, also presents a dire outlook on how the legal world could change if Storm were to lose his case. \"These theories of liability—if validated by the Court—would grant the government unlimited power to prosecute any software developer who writes code that is later used by a third party for nefarious purposes, merely because the developer becomes aware of that later use,\" the brief <a href=\"https:\/\/www.defieducationfund.org\/_files\/ugd\/84ba66_063f9d1fd563466cadfa3f5434f918e9.pdf\" data-v-f87c67ca=\"\">reads<\/a>. \"With no limiting principle in place, nearly all developers who create open-source software would be exposed to criminal liability for activity outside of their control years or decades later.\"","Government prosecutors have yet to respond to Storm's motion to dismiss the charges against him.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Lazarus","content":"PERSON"},{"type":"May 14","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"International Economic Emergency Powers","content":"ORGANIZATION"},{"type":"Alexey Pertsev","content":"PERSON"},{"type":"U.S. Financial Crimes Enforcement Network (FinCEN","content":"ORGANIZATION"},{"type":"Roman Semenov","content":"PERSON"},{"type":"Iran","content":"LOCATION"},{"type":"Semenov","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["LAWSUITS","SANCTIONS"],"authors":["Zack Abrams","The Block"]}