{"summary":"Yuga Labs dropped a new teaser for Otherside Thursday night that hints at a troubled backstory for the upcoming metaverse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167351\/new-otherside-clip-teases-dark-backstory-for-yuga-labs-kodas","publishDate":"2022-09-02T06:57:05","id":12377,"type":null,"title":"New Otherside clip teases dark backstory for Yuga Labs&#x27; Kodas","category":["GAMING AND METAVERSE"],"content":["Bored Ape Yacht Club creator Yuga Labs dropped a new teaser for its forthcoming online game Otherside on Thursday night, which hints at a troubled backstory.","The <a href=\"https:\/\/twitter.com\/OthersideMeta\/status\/1565523431529058305\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">two-minute clip<\/a> opens in a temple-like space full of statues of Kodas — the mysterious creatures created by Yuga which live in Otherside. It also included mages resembling some of the Otherdeed land NFTs, including mycelium, molten and botanical lands.","Blue light trickles around these images, but then the video zooms out to reveal an ominous red light surrounding and mixing with the blue. A single Koda with a sword on its back appears. It collects some of the blue light in a bottle.","But not sooner does it do so than a chaos portal opens up. The Koda runs desperately as the objects around it are sucked into the portal. A second, green chaos portal appears and, trapped between the two, the Koda is sucked into the red one.","It falls through the air and collapses on the ground as the bottle rolls into the water nearby. It travels with the current before it is fished out by the Bored Ape named Curtis, marking the start of a previous Otherside trailer released in May.","Little is known about The Kodas save for a few cryptic hints dropped by Yuga Labs. They are briefly mentioned in the <a href=\"https:\/\/www.theblock.co\/post\/157995\/yuga-labs-champions-openness-collaborative-development-in-otherside-litepaper\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Otherside litepaper<\/a> alongside something called “The Decoupling.”","A <a href=\"https:\/\/twitter.com\/LeonidasNFT\/status\/1505058932758360064\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">leaked pitch deck<\/a> for Otherside published online in March described them as the last surviving race of celestial creatures created during the Big Bang. However, Yuga Labs co-founder Gargamel described the pitch deck as old and outdated on Discord.&nbsp;","Not much is known either about the role The Kodas will play in the metaverse. Some Otherdeed land NFTs contain Kodas on their lots, and these NFTs tend to sell for much higher than their non-Koda counterparts.","The tweet accompanying the video also hinted about something coming in Q4. While it’s unlikely the company's metaverse is ready for rollout quite yet, it could be an indication that another trip is upcoming. The \"first trip,\" an early look at the world for NFT holders, took place on July 16.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Koda","content":"PERSON"},{"type":"Gargamel","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"July 16","content":"DATE"},{"type":"Curtis","content":"PERSON"},{"type":"night","content":"TIME"}],"hashtag":["OTHERSIDE","YUGA LABS"],"authors":["Callan Quinn","The Block"]}