{"summary":"Brazil&#x27;s long-awaited crypto bill could finally reach the president for a vote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190832\/brazils-long-awaited-crypto-bill-inches-to-the-finish-line-after-seven-years","publishDate":"2022-11-29T20:34:25","id":12373,"type":null,"title":"Brazil&#x27;s long-awaited crypto bill inches to the finish line after seven years","category":["COMPANIES"],"content":["After a series of legislative twists and turns spanning seven years, Brazil's long-awaited crypto bill could finally reach the president's desk.","Brazil's Chamber of Deputies voted on Tuesday to pass on a crypto regulation bill to Brazil's president, Jair Bolsonaro, whose term ends on Dec. 31 to make way for the return of Luiz Inácio Lula da Silva.","The crypto regulation is to define digital assets and their service providers, as well as help guard against money laundering and fraud. The bill <a href=\"https:\/\/www.theblock.co\/post\/144267\/brazil-inches-closer-to-finally-regulating-cryptocurrencies\" data-v-f87c67ca=\"\">gained momentum<\/a> after Brazil's Senate approved a version of it in April, but slowed in the past few months as it sat in the Chamber of Deputies awaiting a decision after several points in the Senate version were stripped out.","One of the most widely-debated topics had to do with a provision that would require crypto exchanges to follow certain guidelines for <a href=\"https:\/\/brazilcrypto.substack.com\/p\/breaking-brazils-congress-approves\" data-v-f87c67ca=\"\">segregating<\/a> client funds. According to the Brazilian crypto publication <a href=\"https:\/\/portaldobitcoin.uol.com.br\/lei-das-criptomoedas-e-aprovada-pela-camara-dos-deputados-e-vai-para-sancao-de-bolsonaro\/\" data-v-f87c67ca=\"\">Portal do Bitcoin<\/a>, lawmakers decided to put the asset segregation issue on hold to pass the larger bill today.&nbsp;","Regulating the crypto industry is especially relevant in Brazil due to the size of the market and the number of scams the country has seen in recent years. One of the most high-profile cases came to light when federal police <a href=\"https:\/\/www.theblock.co\/linked\/115738\/brazils-federal-police-seizes-nearly-28-million-in-crypto\" data-v-f87c67ca=\"\">seized<\/a> nearly $28 million related to an alleged system of pyramid schemes.","Brazil comes in at seventh place on Chainalysis' latest Global Crypto Adoption Index. The blockchain analytics firm calculated that the South American country had received nearly $142.7 billion in cryptocurrency between July 2021 and June 2022 — more than any other country in the region.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"Chamber of Deputies","content":"ORGANIZATION"},{"type":"Jair Bolsonaro","content":"PERSON"},{"type":"Dec. 31","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"$28 million","content":"MONEY"},{"type":"Luiz Inácio Lula da Silva","content":"ORGANIZATION"},{"type":"$142.7 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Kristin Majcher","The Block"]}