{"summary":"A cash crunch at Qredo has forced it to shutter a hybrid exchange project that launched in beta just a few months ago.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267769\/qredo-ankex-michael-moro-departure","publishDate":"2023-12-15T04:10:04","id":12389,"type":null,"title":"Qredo shutters derivatives exchange Ankex, Michael Moro departs","category":["COMPANIES"],"content":["A cash crunch at crypto infrastructure startup Qredo has forced it to shutter a hybrid exchange project launched in beta just a few months ago. &nbsp;","Ankex, which Qredo incubated and <a href=\"https:\/\/www.theblock.co\/post\/190507\/qredo-incubated-hybrid-crypto-exchange-breaks-cover\" data-v-f87c67ca=\"\">unveiled in November last year<\/a>, had been billed as a hybrid derivatives exchange combining centralized and decentralized features. Michael Moro, former chief executive of Genesis Global Capital, <a href=\"https:\/\/www.theblock.co\/post\/224765\/former-genesis-ceo-cryptocurency-derivatives-exchange\" data-v-f87c67ca=\"\">was hired to run Ankex in April<\/a> —&nbsp;joining some eight months after <a href=\"https:\/\/www.theblock.co\/post\/164014\/genesis-ceo-michael-moro-steps-down-from-role-effective-immediately\" data-v-f87c67ca=\"\">stepping down as CEO of Genesis<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/190311\/digital-currency-groups-genesis-global-files-for-bankruptcy-protection\" data-v-f87c67ca=\"\">a few months after the business filed for bankruptcy<\/a>. &nbsp;","However, the Ankex platform was recently shut down due to financial difficulties at Qredo, and Moro has left the business, according to people familiar with the matter. Parts of Ankex’s <a href=\"https:\/\/ankex.com\/\" data-v-f87c67ca=\"\">website<\/a>&nbsp;still work, while others —&nbsp;including links to its signup, login and support pages — no longer function.","A spokesperson for Qredo declined to comment.","Qredo, which was valued at $460 million when it <a href=\"https:\/\/www.theblock.co\/post\/132899\/crypto-startup-qredo-fundraise-tapiero\" data-v-f87c67ca=\"\">raised $80 million in a Series A round in February 2022<\/a>, appears to have come under significant financial pressure recently. In September, the same month that <a href=\"https:\/\/www.theblock.co\/post\/252096\/michael-moro-led-hybrid-crypto-exchange-ankex-launches-beta-platform\" data-v-f87c67ca=\"\">Ankex announced the launch of its beta platform<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/249007\/qredo-crypto-layoffs\" data-v-f87c67ca=\"\">Qredo cut around 50 jobs<\/a> to trim its annual expenses by 35%. It then <a href=\"https:\/\/www.theblock.co\/post\/260528\/crypto-qredo-more-layoffs-runway\" data-v-f87c67ca=\"\">laid off 50% of what staff remained<\/a> at the company in November.","At that time, it reportedly had just six months of runway — and was seeking fresh funding and exploring potential acquisitions.","In November, a spokesperson told The Block that the bear market had forced Qredo to refocus on its core business.&nbsp;","“Qredo saw a monthly average of $2.5 billion of transactional activity in H2 2022 and through Q1 2023 — this activity has fallen, along with overall market activity, throughout the course of this year,” they said. “With this prolonged crypto winter, Qredo has chosen to right-size its business and focus on the core areas of growth in web3 wallets and custody solutions.”","Ankex’s shuttering comes despite the offering fitting rather neatly with the in-vogue trends in crypto at present. It allowed users to self-custody their funds while attempting to replicate the user experience — in terms of liquidity, latency and support — that centralized venues offer.","On joining Ankex, after the demise of Geneis, Moro said he was “acutely aware of the importance of empowering traders to operate on trustless platforms while retaining full control of their assets at all times.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Moro","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Moro","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Geneis","content":"LOCATION"},{"type":"November last year","content":"DATE"},{"type":"November","content":"DATE"},{"type":"winter","content":"DATE"},{"type":"$460 million","content":"MONEY"},{"type":"February 2022","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Qredo","content":"LOCATION"},{"type":"Qredo","content":"PERSON"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}