{"summary":"After finding a wallet containing forgotten cryptocurrency, a Coinbase director managed to track down the owner of $322,000 worth of ETC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237996\/coinbase-director-finds-lost-crypto-worth-320000-for-stranger","publishDate":"2023-07-05T17:57:11","id":12392,"type":null,"title":"Coinbase director finds lost crypto worth $320,000 for stranger","category":["COMPANIES"],"content":["Conor Grogan, a product director at Coinbase, found over $320,000 worth of crypto for someone who didn't know the funds existed.&nbsp;","As Grogan explained in a Wednesday Twitter <a href=\"https:\/\/twitter.com\/jconorgrogan\/status\/1676689354071199744\" data-v-f87c67ca=\"\">thread<\/a>, the Ethereum blockchain forked in 2016 and resulted in <a href=\"https:\/\/www.theblock.co\/post\/167794\/ethereum-classic-hits-all-time-high-hash-rate-ahead-of-the-merge\" data-v-f87c67ca=\"\">Ethereum Classic<\/a>, with its native token ETC, and the main <a href=\"https:\/\/www.theblock.co\/post\/237671\/ethereum-erc-7265-circuit-breaker-defi-hacks\" data-v-f87c67ca=\"\">Ethereum<\/a> blockchain with ETH that we know today.","Those with onchain funds at the time of the fork would have been credited an equal amount of ETH for their ETC, but many people probably weren't aware they would have received those funds, Grogan said.","\"Forgetting you have funds onchain (or not keeping track of airdrops) is common,\" he said. \"I've found 6+ figures for people previously.\"&nbsp;","Grogan said he went through a list of accounts that hadn't touched their ETC balances, finding 20 addresses with over $250,000 worth of the tokens in the wallets. With the list narrowed down, Grogan had to find ways to track down the owners with no feasible way of actually identifying them.&nbsp;","\"Tagging isn't great for 2016-era Ethereum, and most of the activity that doxes people (ENS's, NFTs, Twitter) wasn't around yet,\" Grogan said. \"I ran into a number of dead ends; most users ended up sending their full balances to exchanges leading no paper trail to find out who owned them.\"&nbsp;","Grogan found an address containing \"0x475\" that appeared to be yet another dead end, until he saw that the wallet contained a cryptocurrency dubbed \"EOSDAC.\" Many holders of that token received an Ethereum airdrop in 2018, but had to first register their ETH address.","\"Using the airdropped amount and the snapshot date, I then I had a connection to an EOS wallet\" Grogan said. \"As it turns out, this EOS wallet has quite the history!\"","The owner of the 0x475 wallet had their life savings taken in a 2019 hack and had since engaged in a legal battle with their cybersecurity provider along with the crypto exchange Bitfinex. After lots of digging, Grogan said he was able to obtain the owner's legal name attached to that ETH address.&nbsp;","Grogan then contacted the owner, who proclaimed that they hadn't even known the funds had existed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"EOS","content":"ORGANIZATION"},{"type":"Grogan","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"$320,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Conor Grogan","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["MK Manoylov","The Block"]}