{"summary":"After legalizing bitcoin, the Central African Republic is now moving forward with plans to tokenize access to its vast mineral resources.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150041\/central-african-republic-announces-plan-to-tokenize-countrys-minerals","publishDate":"2022-06-03T07:52:17","id":12397,"type":null,"title":"Central African Republic announces plan to tokenize country&#x27;s minerals","category":["CRYPTOCURRENCY"],"content":["The Central African Republic (CAR) revealed the next step in its bitcoin adoption journey with plans to tokenize access to its natural resources, according to a statement <a href=\"https:\/\/twitter.com\/FA_Touadera\/status\/1532455939844063258\" data-v-f87c67ca=\"\">released<\/a> on Thursday.","The presidential news release said the CAR government will offer tokenized access to mineral resources to crypto and digital asset projects that establish a presence in the country. The natural resource tokenization drive will come under the auspices of <a href=\"https:\/\/www.theblockcrypto.com\/post\/148416\/central-african-republic-teases-project-sango-crypto-hub\" data-v-f87c67ca=\"\">Project Sango<\/a>.","The government announced Project Sango in May, after passing a law <a href=\"https:\/\/www.theblockcrypto.com\/post\/143738\/central-african-republic-adds-bitcoin-as-legal-currency-afp\" data-v-f87c67ca=\"\">recognizing bitcoin as legal tender<\/a> the previous month. CAR is the first African nation to adopt bitcoin as a recognized form of currency and the second in the world after El Salvador.","In addition to petroleum, CAR possesses other mineral deposits including diamonds, copper and rhodium. The country’s natural resources also include gold, limestone, cobalt and manganese, among others.","The landlocked African nation still remains one of the least developed countries in the world, in spite of its abundant natural resources. For President Faustin Archange Touadera, the tokenization of these “massive geological treasures” represents a means of creating new investment opportunities in the country.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Project Sango","content":"ORGANIZATION"},{"type":"Faustin Archange Touadera","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["TOKENIZATION"],"authors":["Osato Avan-Nomayo","The Block"]}