{"summary":"Popular Twitch streamer Mongraal received a $1.6 million bid for the key NFT he received upon winning the Dookey Dash game.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215354\/bidding-on-dookey-dash-winning-key-rises-to-1-6-million","publishDate":"2023-02-27T09:12:14","id":12396,"type":null,"title":"Bidding on Dookey Dash winning key rises to $1.6 million","category":["METAVERSE & NFT"],"content":["Popular Twitch streamer Kyle Jackson — known as Mongraal — received a bid of 999 ETH ($1.6 million) for the key NFT he received upon winning Yuga Labs's Dookey Dash game.","Only it doesn't look like that'll be enough.","Mongraal originally placed the NFT for sale at 2,222 ETH ($3.6 million). Until today, the only bid that had come close was a 690 ETH ($1.1 million) bid from United Planets DAO. Yet when this bid came through, Mongraal played hard ball. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Double it and I’ll accept<\/span>,\" he <a href=\"https:\/\/twitter.com\/Mongraal\/status\/1629494698166329344\" data-v-f87c67ca=\"\">tweeted<\/a>.","The latest bid of 999 ETH comes from Memeland, a project started by the team that created 9GAG — a website for sharing memes. Memeland seems to be focused on <a href=\"https:\/\/www.memeland.com\/\" data-v-f87c67ca=\"\">creating<\/a> a range of projects, from a Web3 version of TripAdvisor to a crypto staking service. The project owns 576 NFTs including eight Bored Apes, plus has created its own NFT collection called The Captainz.","While Memeland's bid comes closer to the amount that Mongraal implied he would accept, it's still nearly 30% shy. So far, the Twitch streamer has not addressed the new bid on Twitter.","Mongraal was awarded the key after clocking the highest score on the Dookey Dash game at the time of the deadline. As for what the key will unlock, that's still very much unknown.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$1.1 million","content":"MONEY"},{"type":"$1.6 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"United Planets DAO","content":"ORGANIZATION"},{"type":"$3.6 million","content":"MONEY"},{"type":"Memeland","content":"LOCATION"},{"type":"TripAdvisor","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Kyle Jackson","content":"PERSON"}],"hashtag":["BAYC","YUGA LABS"],"authors":["Tim Copeland","The Block"]}