{"summary":"South Korean crypto VC Hashed has confirmed to The Block that it is under investigation by the National Tax Service.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126540\/south-korea-crypto-vc-hashed-investigation-tax-authority-nts","publishDate":"2021-12-07T07:31:50","id":1239,"type":null,"title":"South Korean crypto VC Hashed confirms it is under tax investigation","category":["TAX"],"content":["Hashed, a crypto venture capital firm based in South Korea, has confirmed to The Block that it is under investigation by the National Tax Service (NTS).","Earlier today, Korean news outlet Aju News <a href=\"https:\/\/www.ajunews.com\/view\/20211206133231959\" data-v-f87c67ca=\"\">reported<\/a> that Hashed is under a \"special\" tax investigation by the 4th Bureau of Investigation from the Seoul Regional Tax Office within the NTS. This bureau is particularly known for conducting investigations into tax evasion and slush funds, per the report. A slush fund refers to a sum of money reserved for specific purposes in a business. Oftentimes, slush funds are not accounted for and used for personal gains or unlawful purposes.","A \"high-ranking\" NTS official did not confirm the Hashed investigation to Aju News but they said the agency does not start an investigation against a small firm unless it is related to tax evasion or a slush fund by a company's CEO.","But Edward Hong, head of growth at Hashed, told The Block that the investigation is not related to tax evasion or slush funds. He said \"it is impossible to evade taxes or create slush funds in the first place\" because there is currently no obligation to pay crypto taxes by individuals in South Korea.","Crypto taxation for individuals in South Korea was originally scheduled to be implemented from January 2022 but has now been deferred by one year to January 2023.","But isn't Hashed a corporation and not an individual? Hong said Hashed invests in crypto through its proprietary funds, which are fully owned by individual co-founders of the firm, and thus it will be liable to pay taxes as individuals and not as corporations. Corporations are anyway prohibited from investing in crypto in South Korea, he said.","The Hashed investigation started last month, said Hong, adding that it could end early next year. It is unclear what information the NTS has sought from Hashed, but Hong said the firm is cooperating with the investigation.","The news comes a few days after Hashed <a href=\"https:\/\/www.theblockcrypto.com\/linked\/125991\/south-korean-crypto-vc-hashed-launches-new-200-million-fund\" data-v-f87c67ca=\"\">launched its second crypto fund<\/a> worth $200 million to invest in Web3 startups, such as those focused on the Metaverse and DeFi. The firm was founded in 2017 and launched its first fund last year, worth $120 million.","It is unclear whether the investigation will lead to any legal proceedings against Hashed. The tax authority has conducted investigations into several crypto firms this year, including HN Group (the issuer of the HDAC token), Korea Digital Exchange (the operator of the local cryptocurrency exchange Flybit), ICONLOOP, Ground X, and Terra.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"NTS","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"January 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"January 2023","content":"DATE"},{"type":"Edward Hong","content":"PERSON"},{"type":"Korea Digital Exchange","content":"ORGANIZATION"},{"type":"Hong","content":"LOCATION"},{"type":"Aju News","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"Terra","content":"ORGANIZATION"},{"type":"HN Group","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"National Tax Service","content":"ORGANIZATION"},{"type":"4th Bureau of Investigation","content":"ORGANIZATION"},{"type":"Seoul","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}