{"summary":"Thousands of Iranians had their accounts blocked needlessly as Binance scrambles to comply with U.S. regulations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229094\/binance-iranians-accounts-blocked","publishDate":"2023-05-03T10:12:52","id":12390,"type":null,"title":"Binance unnecessarily blocked Iranian accounts from trading","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Binance, the world’s biggest cryptocurrency trading platform, has long been the subject of intense public, political and <a href=\"https:\/\/www.reuters.com\/business\/finance\/exclusive-crypto-exchange-binance-helped-iranian-firms-trade-8-billion-despite-2022-11-04\/\" data-v-f87c67ca=\"\">regulatory scrutiny<\/a> worldwide.<\/span>","<span data-v-f87c67ca=\"\">Among the most controversial allegations: <a href=\"https:\/\/www.reuters.com\/business\/finance\/exclusive-crypto-exchange-binance-helped-iranian-firms-trade-8-billion-despite-2022-11-04\/\" data-v-f87c67ca=\"\">reports<\/a> the company serviced traders and firms in Iran for years, despite U.S. sanctions that forbid such activity.<\/span>","While some critics allege the company hasn't done enough on the compliance front, it now appears the exchange might have gone too far in the opposite direction.","<span data-v-f87c67ca=\"\">To be clear, just because you're Iranian doesn't mean you are prohibited from using Binance services. You just can't live there. In thousands of cases, however, the company failed to make that distinction, with some Iranian customers having their accounts blocked when they should not have been.<\/span>","<span data-v-f87c67ca=\"\">Binance’s Global Head of Sanctions Chagri Poyraz said that while his company has come a long way in terms of improving compliance protocols, especially since last year, the trading platform’s efforts to rid its database of sanctioned clients often resulted in customers having their accounts blocked.<\/span>","<span data-v-f87c67ca=\"\">“It still is unfortunate. I’m not sugar coating it,\" Poyraz said in an interview with The Block, adding that he believes the issue has largely been resolved. “Maybe it got delayed because it took us up to six months' time to clear that backlog with all these accounts that were blocked and they <\/span><span data-v-f87c67ca=\"\">shouldn't<\/span><span data-v-f87c67ca=\"\"> have been blocked, but that’s being resolved.”<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Binance CEO Changpeng Zhao speaking in Paris in 2022.<\/span><\/em>","<span data-v-f87c67ca=\"\">When the Iranian customer accounts were blocked, they were generally told to withdraw their funds or, in some cases, Binance gave them the opportunity to prove they had legal residency outside of Iran. <\/span>","<span data-v-f87c67ca=\"\">But for those customers, proving they no longer lived in Iran sometimes took months, during which time the Iranian clients could not make any trades or move crypto from one wallet to another.<\/span>","<span data-v-f87c67ca=\"\">Inside Binance, the process of fielding calls from Iranian clients who had discovered their accounts had been blocked was not always a transparent one, according to three former customer service representatives. Dealing with Iranian customers could be difficult, they said, because sometimes they were instructed to refrain from explaining to Iranian clients the reason their accounts had been blocked and they needed to withdraw their funds was because of their ties to Iran.<\/span>","<span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">We couldn't tell them the reason for banning them,” one former employee said. Another ex-employee confirmed the prohibition: 'W<\/span>e were not able to tell them the truth.\"","<span data-v-f87c67ca=\"\">The trading platform said by email that its global sanctions policy establishes the minimum Binance operating requirements and guidelines to mitigate potential compliance, regulatory and reputational risks associated with violations and evasions of sanctions laws and regulations in jurisdictions where we operate; and the risk of conducting any business with sanctioned parties in any jurisdiction.<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Poyraz said that while Binance’s efforts to remove Iranian accounts sometimes ensnared Iranians who should have been allowed to continue using the platform, the company never aimed to single out one group of people. <\/span><span data-v-f87c67ca=\"\">“I do not profile people by their nationality, because nationality does not make them sanctioned,” he said.<\/span>","<span data-v-f87c67ca=\"\">“Dealing with comprehensive sanctioned countries is nuanced,\" added Tigran Gambaryan, head of financial crime compliance at Binance. \"We don’t do it based on nationality. We do it based on where they are located.” <\/span>","<span data-v-f87c67ca=\"\">But with more than 100 million active users and thousands of clients with <\/span><span data-v-f87c67ca=\"\">ties to Iran, Poyraz said the months-long process of deciphering which Iranian customers were in compliance and which were not had been both a complicated and time-consuming process.<\/span>","<span data-v-f87c67ca=\"\">A few factors have complicated the vetting of Iranian clients, according to Poyraz.<\/span>","<span data-v-f87c67ca=\"\">“Iran is a little bit tricky because it’s a big country, and lots of Iranians purchase KYC (accounts that have passed the know-your-customer compliance stage and are active) to be able to use services like Binance or other services. That is problematic,” he said. “I’m not saying every Iranian goes and purchases an already open Binance account, but they tend to do it more than the other countries.”<\/span>","<span data-v-f87c67ca=\"\">People wishing to buy crypto trading accounts that have already passed KYC protocols can do so on the dark web, according to Poyraz. Some crypto traders prefer to use larger trading platforms because they can provide account holders with significant benefits like more trading options and better liquidity. <\/span>","<span data-v-f87c67ca=\"\">Poyraz said the sanctions landscape with regard to Iranians has made it harder to remain compliant around the world. “Iranian sanctions are U.S. sanctions, so the European Union doesn’t really apply them,” he said. “So an Iranian can go and open an account in Germany … that also causes a whole different layer of confusion or complications.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlthough Binance.com does not operate in the United States, the company is following the Iran sanctions in the hopes of avoiding trouble, said Poyraz. Clients from the U.S. are only allowed to use Binance.US, which the company has said is a separate entity.<\/span>","<span data-v-f87c67ca=\"\">Two factors may have increased the number of Iranians actively trading crypto in recent years while living abroad. First, the “ascent of the ultra-conservative cleric Ebrahim Raisi as president” has spurred a “brain drain” with many Iranians seeking increased stability and opportunity abroad, according to the Stimson Center, a foreign affairs think tank. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nCiting an Iran-based agency that helps Iranians emigrate, Stimson also said roughly 500,000 Iranians left their homeland between 2010 and 2020.<\/span>","<span data-v-f87c67ca=\"\">Simultaneously, Iranians may have, because of their country’s history, embraced cryptocurrency more than other people from other nations, according to Eric Lob, both a non-resident scholar at the Middle East Institute and a professor at Florida International University.“They are always looking for ways to cope and do business” after decades of economic sanctions, he said. It’s also common for Iranians living abroad, said Lob, to be confronted with more scrutiny when “interfacing with financial institutions.”<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">For nearly two years, Binance said it has attempted to correct past lapses in compliance by bolstering its process of checks and balances. This has included hiring a <a href=\"https:\/\/www.binance.com\/en\/blog\/community\/expertise-in-the-binance-compliance-team-2440494994988411195\" data-v-f87c67ca=\"\">veteran team<\/a> skilled in anti-money laundering, financial crime detection and navigating government regulation. <\/span>","<span data-v-f87c67ca=\"\">Poyraz, w<\/span><span data-v-f87c67ca=\"\">ho has more than a decade of experience working in compliance and anti-money laundering for both the United Nations and HSBC, is among those hires, in addition to former U.S. lawmakers and a former supervisor at the U.K.’s <\/span><span data-v-f87c67ca=\"\">Financial Conduct Authority.<\/span>","<span data-v-f87c67ca=\"\">The company, according to Poyraz, has also invested significantly in technological tools that can detect when a customer is trying to pretend to be someone they are not or located in a nation Binance services without restrictions. In two years, Binance’s compliance division <a href=\"https:\/\/www.theblock.co\/post\/228442\/binances-650-manpower-increase-aimed-at-rehabilitating-rule-breaker-image-amid-us-crackdown\" data-v-f87c67ca=\"\">has grown<\/a> by about 650%, surging to roughly 750 employees from 100, Poyraz said.<\/span>","<span data-v-f87c67ca=\"\">Poyraz doesn’t shy away from Binance’s issues with compliance, which has included running afoul of regulators in the U.S., UK, Japan, <a href=\"https:\/\/www.theblock.co\/linked\/103143\/german-finance-regulator-issues-warning-about-binances-stock-tokens-offering\" data-v-f87c67ca=\"\">Germany<\/a> and the Netherlands. But he said he believes the trading platform has entered a new era.<\/span>","<span data-v-f87c67ca=\"\">“As of today, I think we are in a better place,” said Poyraz.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HSBC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"Ebrahim Raisi","content":"PERSON"},{"type":"Poyraz","content":"LOCATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Poyraz","content":"PERSON"},{"type":"Tigran Gambaryan","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"United Nations","content":"ORGANIZATION"},{"type":"U.K.’s <\/span><span data-v-f87c67ca=\"\">Financial Conduct Authority","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Florida International University","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Eric Lob","content":"PERSON"},{"type":"Stimson Center","content":"ORGANIZATION"},{"type":"650%","content":"PERCENT"},{"type":"Stimson","content":"PERSON"},{"type":"Middle East Institute","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Iran","content":"LOCATION"},{"type":"Global Head of Sanctions Chagri Poyraz","content":"ORGANIZATION"},{"type":"UK","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BINANCE"],"authors":["RT Watson","The Block"]}