{"summary":"In absolute terms, 2Q19 was a bright spot for crypto funds, offering by far the best performance since the benchmark started with crypto fund composite registering a 53.6% gain on the quarter\nOn a relative basis, however, direct spot returns of Bitcoin have outperformed the Vision Hill Crypto Fund Composite by nearly 100%, and the Bitwise 10 Large Cap Index by almost 70%\nWhen including performance to include all of 2018, all indices actually outperform BTC returns, Quantitative strategies are up close to 50% since last January (+70% absolute excess return on BTC)\nIn 2Q19, Fundamental and Opportunistic strategies generated median returns of ~50% each, with 25% of Fundamental funds registering > 80% returns in the quarter (a composite high)","author":["Ryan Todd","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36215\/bitcoin-outperformed-vision-hill-crypto-fund-composite-index-returns-by-more-than-100-in-1h19","publishDate":"2019-08-16T17:26:11","id":124,"type":null,"title":"Bitcoin outperformed Vision Hill Crypto Fund Composite index returns by more than 100% in 1H19","category":["Markets"],"content":["<a href=\"https:\/\/visionhill.com\/\" data-v-f87c67ca=\"\">Vision Hill Group<\/a> released their second quarter 2019 crypto hedge fund returns <a href=\"https:\/\/visionhill.com\/wp-content\/uploads\/2019\/08\/Q2-2019-Crypto-Hedge-Fund-Report.pdf\" data-v-f87c67ca=\"\">report<\/a>, a self-reported cryptoasset benchmark study that measures various fund performance (via <a href=\"https:\/\/visionhill.com\/benchmarks\/\" data-v-f87c67ca=\"\">Vision Hill Active Crypto Indices)<\/a> relative to Bitcoin and the broader crypto market.","In absolute terms, 2Q19 was a bright spot for crypto funds, offering by far the best performance since the benchmark started with crypto fund composite registering a 53.6% gain on the quarter (n = ~50) and is up 67% in 1H19. Through the first half of 2019, Fundamental crypto fund strategies (description below) are leading the composite, up over 80% on the year; while Opportunistic funds are up 65% and Quantitative funds are up 45%. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOn a relative basis, however, direct spot returns of Bitcoin have outperformed the Vision Hill Crypto Fund Composite by nearly 100%, and the <a href=\"https:\/\/www.bitwiseinvestments.com\/indexes\/Bitwise-10\" data-v-f87c67ca=\"\">Bitwise 10 Large Cap Index<\/a> by almost 70% in the first half of 2019.","","","<span data-v-f87c67ca=\"\">Source: Vision Hill Benchmarks, The Block<\/span>","&nbsp;","When considering a full cycle that includes data from last January, however, all strategies have actually outperformed bitcoin and the broader market, with Quantitative strategies leading the composite. Looking at the last 18 months, Quantitative focused funds are up close to 50% (includes a full bear market), which equates to more than 70% excess absolute returns over bitcoin during that span (non-risk adjusted).","","","<span data-v-f87c67ca=\"\">Source: Vision Hill Benchmarks, The Block<\/span>","&nbsp;","Looking at the distribution of fund returns, Fundamental and Opportunistic strategies each generated median returns of ~50%, with 25% of funds making more than 80% (Fundamental) and 55% (Opportunistic), respectively. Quantitative funds saw softer median returns relative to the rest of the composite, at 26% for the quarter, but still had 25% of funds returning more than 60%. Opportunistic strategies saw the tightest range of performance out of the group, as 75% of funds returned more than 22%.","","","<span data-v-f87c67ca=\"\">Source: Vision Hill Benchmarks, The Block<\/span>","&nbsp;","The study was produced using approximately 50 unique data points in Q2 across the three core strategies (Fundamental, Quantitative and Opportunistic), published as non-investable reference indices which act as a proxy for the overall composition of the crypto hedge fund landscape. The report also includes the caveat that the study should be considered a framework, rather than a long-term indicator of performance, as fund voluntary self-reporting can introduce biases (self-reporting, survivorship, and backfill). The asset manager hopes to continue to actively smooth out these issues overtime.","&nbsp;","<strong data-v-f87c67ca=\"\">Other highlights from the report include:<\/strong>","<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Fundamental strategies:<\/em> Long Only, Long\/Short, Hybrids; <br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Quantitative strategies:<\/em> Directional momentum, market neutral\/HFT-Arb, Long Volatility<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">Opportunistic strategies:<\/em> Credit, Generalized mining\/active network participation, Other<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<br data-v-f87c67ca=\"\">\nIf you’re a crypto fund that hasn’t connected with Vision Hill and would like to participate in next quarter’s benchmark study, reach out at <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"790d0b181a1210171e390f100a10161711101515571a1614\">[email&nbsp;protected]<\/a>.","Methodology on Crypto Fund index calculations can be found <a href=\"https:\/\/visionhill.com\/methodology\/\" data-v-f87c67ca=\"\">here<\/a>.","&nbsp;","<em data-v-f87c67ca=\"\">Note this article was updated to include charted index performance from Jan 2018 - June 2019, which pushed all indices to outperform Bitcoin over the last 18-months.<\/em>"],"hashtag":[]}