{"summary":"Binance Pool has launched its Ordinals Inscription Service, making it easier for users to inscribe additional data on the Bitcoin network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248333\/binance-pool-ordinals-inscription-service-bitcoin","publishDate":"2023-08-31T10:22:01","id":12404,"type":null,"title":"Binance Pool launches Ordinals Inscription Service for Bitcoin artifacts","category":["COMPANIES"],"content":["Binance Pool has launched its <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-pool-launches-ordinals-inscription-service-86073b843fac43f8a1df58936a8ab9ae\" data-v-f87c67ca=\"\">Ordinals Inscription Service<\/a>, making it easier for users to inscribe additional data onto the Bitcoin blockchain.","The tool enables data to be inscribed directly onto individual satoshis, the smallest unit of bitcoin, creating unique digital artifacts securely stored on the network, according to an announcement from the crypto mining pool today.","The <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Ordinals protocol came to prominence<\/a> earlier this year, enabling the creation of BRC-20 tokens and NFTs on Bitcoin.","Users of the service must have completed Binance's know-your-customer verification and own a Taproot address, also known as P2TR or Bech32m. A Taproot address is the most recent and advanced Bitcoin address format, characterized by its \"bc1p\" prefix and supported by several bitcoin wallets. Once set up, users can begin the inscription process, choosing between BRC-20, single image or text inscription types.","The BRC-20 option requires deployment before minting, with the number of inscriptions determined by the rules set during deployment. Users can then mint multiple BRC-20 tokens in one go.","For single images, due to Bitcoin block size limitations, files under 300KB are inscribed as they are while larger files undergo resizing, compression and conversion to the WEBP format, with metadata removed for security.","Finally for text inscriptions, Binance Pool said only single text inputs are accepted, with a maximum size of 300KB. Batch inscriptions are not supported.","Once users have paid the network and service fees, the inscription will be sent to their address but could take hours or days to confirm, depending on demand.","However, Binance Pool warned users that inscriptions, once generated, are permanent and cannot be altered or deleted, which users are solely responsible for. Furthermore, Binance does not guarantee the ability to trade or transfer inscriptions post-creation.","The rise in popularity of Ordinals and inscriptions on Bitcoin earlier this year also caused a surge in transactions and fees, fueling <a href=\"https:\/\/www.theblock.co\/post\/241945\/jameson-lopp-casa-bitcoin-lightning-network\" data-v-f87c67ca=\"\">debate over whether or not inscriptions should exist<\/a> on the network. Inscriptions rely on Bitcoin’s OP_RETURN function to store arbitrary data on the blockchain.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/transactions-on-the-bitcoin-network-daily\/embed\" title=\"Transactions on the Bitcoin Network (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BRC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance Pool","content":"ORGANIZATION"},{"type":"Ordinals Inscription Service","content":"ORGANIZATION"}],"hashtag":["BINANCE","BITCOIN"],"authors":["James Hunt","The Block"]}