{"summary":"Blur&#x27;s CEO, known as Pacman, urged creators to block the industry&#x27;s biggest NFT marketplace, for now. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212398\/blur-block-opensea","publishDate":"2023-02-16T05:51:39","id":12408,"type":null,"title":"Blur CEO urges creators to &#x27;block OpenSea&#x27;","category":["METAVERSE & NFT"],"content":["The battle lines were again drawn in the NFT creator royalty debate, as the CEO of NFT marketplace Blur made a case for creators to list on that platform rather than with industry heavyweight OpenSea.","After laying out the different scenarios in a <a href=\"https:\/\/mirror.xyz\/blurdao.eth\/vYOjzk4cQCQ7AtuJWWiZPoNZ04YKQmTMsos0NNq_hYs\" data-v-f87c67ca=\"\">blog post<\/a> Wednesday night, the recommended conclusion from the pseudonymous CEO, Pacman, was for creators to block the industry's biggest NFT marketplace, for now.&nbsp;","\"Our preference is that creators should be able to earn royalties on all marketplaces that they whitelist, rather than being forced to choose,\" they wrote. \"To encourage this, Blur enforces full royalties on collections that block trading on OpenSea.\"","\"It’s important to note that creators who implement the recommended option will be eligible to receive Season 2 rewards,\" Pacman added.&nbsp;","<span data-v-f87c67ca=\"\">A screenshot from Blur's blog post.<\/span>","Once championed as a prime use case for artists in the NFT space and a golden egg in the creator economy, what OpenSea dubs \"creator fees\" are generated through taking a cut on the resale of NFTs on the company's platform. Also known as royalties, they have been hailed as a way for artists to reap recurring benefits as their creations are sold.&nbsp;","Last year's shakeout in NFT royalties led to different businesses making their case for creators to list with them and be able to collect ongoing fees from sales of their work.&nbsp;","As it stands, creators can’t earn royalties on Blur and OpenSea simultaneously. They can only earn full royalties on OpenSea, or Blur — but not both together — due to the configuration of marketplace policies, according to the blog post.&nbsp;","In November, OpenSea shared a tool to help creators debuting new collections on the platform&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/183518\/opensea-creates-tool-to-help-nft-collections-enforce-royalties-on-chain\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">enforce royalties on-chain<\/a>. The code in the smart contract restricted NFT sales to marketplaces that enforce creator fees. It also said that month that creators had <a href=\"https:\/\/www.theblock.co\/post\/190900\/opensea-nft-creators-earned-1-billion-royalties\" data-v-f87c67ca=\"\">earned $1 billion<\/a> through royalty payments that year.&nbsp;","OpenSea did not immediately respond to a request for comment on Blur's blog post.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\/embed\" title=\"Ethereum NFT Marketplace Monthly Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The move comes on the heels of Blur's token launch, which took place on Tuesday, alongside news that the marketplace was set to close a private round at a <a href=\"https:\/\/www.theblock.co\/post\/210668\/nft-marketplace-blur-raise-billion-dollar-valuation\" data-v-f87c67ca=\"\">billion dollar valuation<\/a>, as first reported by The Block.","Blur has eaten into the market share of current industry incumbents since it launched in October. In January, it was the second largest Ethereum marketplace by monthly transaction volume, according to <a href=\"https:\/\/www.theblockresearch.com\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-volume\" data-v-f87c67ca=\"\">The Block Research<\/a>&nbsp;— perhaps due to its low trading fees and schedule of airdrops to loyal users.&nbsp;","Trading volume for its token <a href=\"https:\/\/www.theblock.co\/post\/211975\/crypto-prices-higher-blur-token-crosses-1-billion-in-volume-in-under-24-hours?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">crossed<\/a> the $1 billion mark in under 24 hours.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pacman","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$1 billion mark","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"January","content":"DATE"},{"type":"October","content":"DATE"},{"type":"night","content":"TIME"},{"type":"November","content":"DATE"}],"hashtag":["BLUR"],"authors":["Lucy Harley-McKeown","The Block"]}