{"summary":"Interoperability protocols joined together to express &quot;concern&quot; over LayerZero&#x27;s issuance of a wstETH OFT standard. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259869\/bridging-protocols-express-concern-over-layerzeros-wsteth-token-integration","publishDate":"2023-10-27T18:13:27","id":12400,"type":null,"title":"Bridging protocols express &#x27;concern&#x27; over LayerZero&#x27;s wstETH token integration","category":["CRYPTO ECOSYSTEMS"],"content":["Interoperability protocol LayerZero is facing a backlash for the way it portrayed the <a href=\"https:\/\/www.theblock.co\/post\/259467\/layerzero-introduces-omnichain-token-to-move-lidos-wsteth-across-avalanche-bnb-chain-and-scroll\" data-v-f87c67ca=\"\">integration of wstETH<\/a> on its omnichain fungible token (OFT) standard, a technology that's designed to move the token across three new blockchains.","Interoperability projects including Connext Network, ChainSafe and Sygma announced a unified call for open bridge standards in a Friday <a href=\"https:\/\/twitter.com\/connextnetwork\/status\/1717953446475620379?s=61&amp;t=Y_WyS4OCKBNhvZ63YMkojA\" data-v-f87c67ca=\"\">statement,<\/a> claiming that OFTs endorse vendor lock-ins and that \"token-issuing DAOs should be the ultimate arbiters of what version of their asset is canonical on a given chain.”","\"As a group of leading interoperability projects, we would like to express concern about the recent actions of LayerZero, their deployment of a proprietary representation of wstETH to Avalanche, BNB Chain and Scroll without support from the Lido DAO,\" the interoperability protocols <a href=\"https:\/\/twitter.com\/connextnetwork\/status\/1717953446475620379?s=61&amp;t=Y_WyS4OCKBNhvZ63YMkojA\" data-v-f87c67ca=\"\">wrote<\/a>. \"We believe this action is the direct consequence of a broken system of incentives around interoperability that can only be fixed through standardization and healthy competition at every layer of the bridge stack.”&nbsp;","The tension is between LayerZero's ability to create this token — which it can do across permissionless systems — and the question of whether Lido's governance officially endorses it.","A crypto researcher known as Hasu, who is a strategic advisor for LidoDAO, <a href=\"https:\/\/research.lido.fi\/t\/wsteth-on-avalanche-and-bnb-and-ownership-acceptance-by-lido-dao\/5749\/11\" data-v-f87c67ca=\"\">said<\/a> they were speechless about LayerZero's approach.","\"By unilaterally deploying a bridge and marketing it in an official-seeming way, it feels like you are trying to pressure the DAO into accepting your proposal to avoid liquidity fragmentation and bad UX for users,\" Hasu added. \"Driving users to it through marketing makes accepting an alternate bridge proposal more painful. These actions put the DAO, Lido stakers, and participating chains in a difficult position.\"","Regarding the community response, LayerZero told The Block that, \"the omnichain fungible-token standard is a multi-audited, open source set of reference contracts used by more than 75 projects to enable native, horizontally composable transfers between L1s and between L2s. More than $3 billion in value has been transferred by contracts that have integrated OFT.\"","\"By design, developers always maintain the ability to permissionlessly select their validation layer and can include other bridges as part of the immutable LayerZero framework. Once the Lido DAO accepts ownership of the contracts, wstETH on AVAX and BNB, a deployment organized with encouragement and feedback from Lido core team members, is entirely owned by Lido with no reliance on LayerZero Labs,\" it added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3 billion","content":"MONEY"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Connext Network","content":"ORGANIZATION"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Lido DAO","content":"LOCATION"},{"type":"OFT","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Hasu","content":"PERSON"}],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY"],"authors":["MK Manoylov","The Block"]}