{"summary":"Celestia will provide a specialized data availability solution to Layer 2 projects using Polygon CDK — including OKX, Immutable, Astar and others.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267170\/celestia-to-integrate-data-availability-layer-with-polygon-cdk","publishDate":"2023-12-12T12:11:50","id":12409,"type":null,"title":"Celestia to integrate data availability layer with Polygon CDK","category":["CRYPTO ECOSYSTEMS"],"content":["Celestia will integrate its data availability layer with Polygon Labs’ chain development kit, an open-source codebase used for developing Layer 2 chains.","This integration introduces a specialized data availability solution to Layer 2 projects using <a href=\"https:\/\/www.theblock.co\/post\/252306\/polygon-celo-proposal\" data-v-f87c67ca=\"\">Polygon CDK<\/a>, such as OKX, Immutable, Astar, IDEX, Palm Network and others. It aims to potentially reduce gas fees for these projects, which are part of Polygon 2.0, which purports to be an ecosystem of Layer 2 chains capable of interacting with one another.","Layer 2 networks developed on Polygon’s CDK employ zero-knowledge rollup technology. They aggregate transactions off-chain and finalize them in bundles on the mainnet. However, these chains necessitate verifying data availability, which means ensuring every network member can securely retrieve and confirm off-chain stored data.","A challenge arises as Ethereum, the network these chains often rely on, lacks a dedicated execution environment for its DA layer. As a result, Ethereum nodes must process and store data on-chain indefinitely, contributing to increased fees for Layer 2 solutions. This is where data availability solutions may come in.","Celestia’s strategy involves its own data availability solution that can serve storage bandwidth for multiple Layer 2 networks simultaneously. By enabling networks to run light nodes, this solution facilitates DA verification without imposing excessive strain on the network.&nbsp;","“Combined with interoperability and unified liquidity provided by Polygon 2.0, Celestia’s out-of-the-box solution will make creating new L2 chains as simple and affordable as deploying a smart contract,” said Sandeep Nailwal, co-founder of Polygon.","Unlike monolithic Layer 1 blockchains like Ethereum and Solana, Celestia aims to be a modular network. Its architecture is designed so that nodes will reach consensus on transactions in parallel across chains, executed in an off-chain manner.","In October 2022, Celestia Labs <a href=\"https:\/\/www.theblock.co\/post\/177841\/celestia-labs-hits-unicorn-status-in-latest-bet-on-modular-blockchains\" data-v-f87c67ca=\"\">raised<\/a> $55 million at a valuation exceeding $1 billion in a funding round led by Bain Capital and Polychain.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bain Capital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"IDEX","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Palm Network","content":"ORGANIZATION"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"Celestia Labs","content":"ORGANIZATION"},{"type":"Immutable","content":"LOCATION"},{"type":"Celestia","content":"LOCATION"},{"type":"$55 million","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":["DEVELOPER TOOLS","POLYGON"],"authors":["Vishal Chawla","The Block"]}