{"summary":"The options are designed to incentivize staff to share in the long-term growth of the business\nSome staff have expressed concerns about how the bonus structure works","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94999\/revolut-growth-shares-employees-plan-neobank","publishDate":"2021-02-16T11:14:23","id":1240,"type":null,"title":"Revolut rolls out ‘growth shares’ for employees – but the plan hinges on a big exit","category":["Fintech"],"content":["Revolut, the $5.5 billion digital bank, has introduced a new “growth shares” program which will serve as the de facto bonus structure for staff based in the UK, Ireland, France, Portugal and Sweden.","The new scheme is designed to lower the tax liability attached to shares held by employees if Revolut goes public or is sold. The startup employs more than 2,200 people globally.","But staff at Revolut have expressed concern over the new structure because of up-front fees of £1.95 and a “hurdle rate” – the price at which the growth shares can be converted into normal shares – of £91 per share. Revolut is offering staff interest-free loans to cover the cost of the up-front fees.&nbsp;","The growth shares will be subject to a lower rate of tax because of the hurdle. In <a href=\"https:\/\/www.bdo.co.uk\/en-gb\/insights\/tax\/global-employer-services\/growth-share-plan\" data-v-f87c67ca=\"\">a blog post<\/a> on growth shares, the accountancy firm BDO explained that any increase in share value under such schemes is “subject to Capital Gains Tax which is more attractive than income tax.” The firm added that growth shares offer a “significant benefit” to staff in high-growth firms.","The key point, however, is that the £91 per share hurdle rate is the same price paid by investors in <a href=\"https:\/\/techcrunch.com\/2020\/07\/24\/revolut-extends-series-d-round-to-580-million-with-80-million-in-new-funding\/\" data-v-f87c67ca=\"\">Revolut’s $580 million fundraise<\/a> last year, which valued the startup at $5.5 billion.","In other words, for staff to profit from their bonuses, Revolut would need to go public or be sold at a price far enough in excess of $5.5 billion that the pay-out also covers the up-front cost of purchasing the growth shares and Capital Gains Tax.&nbsp;&nbsp;","It's possible that staff could lose money on their bonuses – although it should be noted that Revolut boss Nikolay Storonsky has previously said he would not take the business public until it had <a href=\"https:\/\/www.fnlondon.com\/articles\/revolut-chief-eyes-20bn-valuation-before-any-ipo-20190621\" data-v-f87c67ca=\"\">achieved a valuation of at least $20 billion<\/a>.","“We’re aiming to give people a long-term incentive,” said a Revolut spokesperson. “Any long-term incentive is aimed at rewarding people for the future growth of the company and involving them in the future growth of the company.”","The introduction of the growth shares is the latest twist in a ten-month struggle to find the right incentivization program for employees.","At the start of the coronavirus pandemic, Revolut tried to cut costs by offering staff the <a href=\"https:\/\/www.fnlondon.com\/articles\/revolut-offers-salary-swap-scheme-as-founders-waive-pay-amid-covid-19-crisis-20200415\" data-v-f87c67ca=\"\">chance to swap part of their salary<\/a> for share options on a two-for-one basis, meaning £1 of salary could be exchanged for £2 in share options.","But the digital bank ran into difficulty in October when HMRC, the UK tax authority, <a href=\"https:\/\/www.fnlondon.com\/articles\/taxman-hikes-price-of-revolut-shares-by-more-than-one-hundred-times-20201005\" data-v-f87c67ca=\"\">hiked the price of shares<\/a> issued under Revolut's current share option scheme by more than one hundred times – making it more costly for staff to convert their options into equity.","Revolut tried to solve that issue with the launch of an “unapproved share scheme”, allowing companies to set a nominal conversion price, but which also requires staff who exercise their options to pay income tax.","But Revolut’s spokesperson said the firm wanted “to find a way that enables people to be rewarded and doesn’t expose to them high levels of tax.”","The introduction of the growth shares plan is the culmination of a project carried out by EY, the consultancy. Revolut held an online session with EY advisers on February 15, allowing staff to ask questions about the scheme."],"hashtag":["FINTECH"]}