{"summary":"Zoop raised $15 million in new investments and grants.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180446\/zoop-teams-up-with-ready-player-me-raises-15-million","publishDate":"2022-10-27T10:02:30","id":12419,"type":null,"title":"Zoop teams up with Ready Player Me, raises $15 million ","category":["NFTS"],"content":["Zoop, a digital celebrity collectibles trading platform, raised $15 million in grants and investments, and will partner with cross-game avatar company Ready Player Me, the company <a href=\"https:\/\/www.businesswire.com\/news\/home\/20221027005231\/en\/Zoop-Secures-15M-in-Backing-and-Formalizes-Partnership-with-Ready-Player-Me-Ahead-of-Global-Platform-Launch-on-Hedera\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">announced<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The company did not say where the $15 million in new grants and investments came from. Stokely, a former CEO of OnlyFans, launched Zoop in May with fellow co-CEO RJ Phillips. Zoop promises to pay celebrities 70% of the revenue from sales generated on its platform.","The new Ready Player Me partnership will allow players to use Zoop’s celebrity avatars in supported apps and games across multiple metaverses. Game developers will also be rewarded for the time users spend on their games.","“This presents a significant opportunity for Zoop to reimagine how the world’s biggest celebrities are connecting with their fans and transcending the one-sided social media engagements of the past,” Zoop co-CEO Tim Stokely said in a statement.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"RJ Phillips","content":"PERSON"},{"type":"$15 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Tim Stokely","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}