{"summary":"Munchables, a gaming platform based on Blast, saw the return of $62 million in ETH to a multisig wallet following a major security incident.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284927\/munchables-recovers-62-million-taken-in-security-breach","publishDate":"2024-03-27T02:39:42","id":12415,"type":null,"title":"Munchables recovers $62 million taken in security breach","category":["SECURITY"],"content":["Munchables, a gaming platform based on Blast, sawe the return of $62 million in ETH to a multisig wallet after a substantial financial setback <a href=\"https:\/\/www.theblock.co\/post\/284883\/web3-gaming-platform-munchables-loses-62-5-million-in-exploit-zachxbt?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">reported<\/a> yesterday due to unauthorized transactions.","The incident began with Munchables announcing a security hack, with suspicions directed toward an internal team member. Investigative efforts by on-chain detective ZachXBT suggested the involved individual might be linked to North Korean hackers, but this remains unclear.","The project’s smart contracts had granted the developer in question the power to transfer funds at their discretion, a capability misused in this instance.","Later, Munchables <a href=\"https:\/\/twitter.com\/_munchables_\/status\/1772846122236862789\" data-v-f87c67ca=\"\">updated<\/a> that the developer had agreed to unconditionally relinquish the private keys to the wallet holding Munchables’ assets.","Onchain data shows the wallet returned the misappropriated funds. A total of 17,412.6 ETH, worth about $62.8 million, was redirected to a 2\/3 multisig wallet, as <a href=\"https:\/\/twitter.com\/blocksecteam\/status\/1772869982445051923?s=61&amp;t=1fHi7_freu2FSc445GVtUg\" data-v-f87c67ca=\"\">noted<\/a> by security firm BlockSec. This wallet now contains $97 million in total assets, including the restored $62.8 million and the previously unaffected funds.","\"All user funds are safe,\" Munchables <a href=\"https:\/\/twitter.com\/_munchables_\/status\/1772873122280038801\" data-v-f87c67ca=\"\">stated,<\/a> adding that it will provide further updates in the coming days.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"North Korean","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"BlockSec","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$97 million","content":"MONEY"},{"type":"$62 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$62.8 million","content":"MONEY"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}