{"summary":"A recent internal presentation at Binance.US illustrates how the firm could move forward under certain circumstances.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/250779\/binance-us-wont-be-able-to-grow-until-cz-sells-stake-or-resolves-regulatory-issues-sources","publishDate":"2023-09-13T18:16:29","id":12414,"type":null,"title":"Binance.US can&#x27;t grow until CZ sells stake, fixes regulatory issues: sources","category":["COMPANIES"],"content":["Binance.US's options to grow are limited so long as Binance co-founder Changpeng \"CZ\" Zhao has a formal connection to the business, according to sources familiar with a company all-hands this week.&nbsp;","The U.S. arm, which saw its president and CEO Brian Shroder <a href=\"https:\/\/www.theblock.co\/post\/250617\/binance-us-cuts-staff-president-departs-sources\" data-v-f87c67ca=\"\">exit the firm<\/a> yesterday, has scaled back its operations and staff in the wake of the <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-101\" data-v-f87c67ca=\"\">Securities and Exchange Commission's lawsuit<\/a> against Binance and its allegations that Zhao can \"divert customer assets\" as he pleases. Binance said at the time of the suit that it would <a href=\"https:\/\/www.theblock.co\/post\/233186\/binance-says-it-will-defend-our-platform-vigorously-from-sec-lawsuit\" data-v-f87c67ca=\"\">defend its platform \"vigorously<\/a>.\"","In any case, the regulatory environment and Zhao's connection to Binance.US will serve as an impediment to the firm's growth, according to sources. During a company all-hands, staff were presented with three potential options for the business against the current backdrop and what would need to happen for those options to be viable.&nbsp;","The first option presented was to continue growth initiatives as planned. This would include new products, including stocks and futures trading as well as new licenses for derivatives trading. But this option needed Zhao to \"resolve\" his regulatory issues with the SEC, put his holdings in Binance.US into a blind trust or sell his shares entirely, the presentation states.","The second option involved a medium reduction in the company's burn while investing in the platform. This would allow for investment into certain platform upgrades such as its sub-account functionality and AWS\/infrastructure optimization. Yet this option required a willingness to invest in the company during the current bear market.","The third option was to effectively hibernate until there is a material improvement in the firm's situation. This option would result in a much lower burn rate, while maintaining normal business operations and licenses, the slides show.","The company has indeed been struggling since the SEC's lawsuit. Binance.US has seen its business shrink in recent months, and the firm's customers are no longer able to use U.S. dollars to purchase crypto on the platform. The firm's monthly volumes have collapsed, declining from $10.6 billion in January to $70 million this month, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","<span data-v-f87c67ca=\"\">Binance's monthly crypto exchange volume has been considerably reduced. Image: The Block's Data Dashboard.<\/span>","It appears that the firm choose to push forward with its third option. In addition to Shroder's exit, the firm laid off one third of its staff on Tuesday. The firm's chief legal officer Norman Reed has stepped in as interim head of the firm.","The firm could continue its growth plans following this hibernation period if Zhao is able to improve his regulatory situation or were Congress to pass some form of regulation that gives the firm further regulatory clarity, the presentation states. Failing that, a bull run could suffice, it notes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$10.6 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Norman Reed","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"Zhao","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Shroder","content":"PERSON"},{"type":"Shroder","content":"PERSON"},{"type":"AWS","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Frank Chaparro","The Block"]}