{"summary":"MetaMask’s bridge aggregator will support cross-chain crypto transfers across four EVM networks including Ethereum and Avalanche.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184863\/metamask-rolls-out-bridge-aggregator-for-cross-chain-crypto-transfers","publishDate":"2022-11-09T12:26:33","id":12413,"type":null,"title":"MetaMask rolls out bridge aggregator for cross-chain crypto transfers","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto wallet provider MetaMask has launched a new feature that will aggregate bridge services for users who want to transfer their crypto across different chains.","The release is in the beta stage, and MetaMask said in a <a href=\"https:\/\/metamask.io\/news\/latest\/meta-mask-launches-bridge-aggregator-in-dapp-to-easily-move-tokens-across-chains\/\" data-v-f87c67ca=\"\">blog post<\/a> that the service is part of its newly launched portfolio app.","Bridging in crypto involves the transfer of tokens from one chain to another, and the process requires the use of a bridge provider. MetaMask <a href=\"https:\/\/metamask.io\/news\/latest\/meta-mask-launches-bridge-aggregator-in-dapp-to-easily-move-tokens-across-chains\/\" data-v-f87c67ca=\"\">says<\/a> its bridge aggregator will support four bridge providers including Connext, Hop, Celer cBridge and Polygon Bridge.","Users will be able to move up to $10,000 of supported tokens using any of these bridges across Ethereum, Avalanche, BNB Smart Chain and Polygon. Supported tokens include ether and wrapped ether; popular stablecoins such as DAI; and native gas tokens like matic. The bridge aggregator will help users find the cheapest route for moving coins across supported networks.","MetaMask said it will not charge transaction fees for bridging crypto during the beta release. The platform is looking to expand its coverage to Layer 2 chains such as Optimism and Arbitrum.","Crypto bridges have become a <a href=\"https:\/\/www.theblock.co\/post\/156038\/how-a-fake-job-offer-took-down-the-worlds-most-popular-crypto-game\" data-v-f87c67ca=\"\">prime target for hackers,<\/a> with attacks leading to the theft of over $2.5 billion from cross-chain bridge protocols in the last two years. Some of these incidents include the <a href=\"https:\/\/www.theblock.co\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\">Ronin<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/114045\/at-least-611-million-stolen-in-massive-cross-chain-hack\" data-v-f87c67ca=\"\">Poly Network<\/a> hacks that saw more than $1 billion stolen from both platforms.","MetaMask said it carried out an extensive vetting process before selecting its preferred bridge providers. The crypto wallet provider added that the selected bridges met requirements for security and decentralization.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Connext","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Ronin","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$2.5 billion","content":"MONEY"},{"type":"MetaMask","content":"ORGANIZATION"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"last two years","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"Poly Network","content":"ORGANIZATION"}],"hashtag":["CROSS-CHAIN SWAPS","INTEROPERABILITY"],"authors":["Osato Avan-Nomayo","The Block"]}