{"summary":"The price of bitcoin has increased by almost 3% in the past 24 hours, as exchange reserves drop to multi-year lows.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286440\/bitcoin-exchange-reserves-drop-to-new-lows-cryptoquant","publishDate":"2024-04-04T12:33:44","id":12426,"type":null,"title":"Bitcoin exchange reserves drop to multi-year lows: CryptoQuant","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.38%\n    <\/span><\/a> <!----><\/span><\/span> exchange reserves have reached their lowest levels ever recorded by CryptoQuant data that spans back to early 2021.<\/span>","According to CryptoQuant <a href=\"https:\/\/cryptoquant.com\/asset\/btc\/chart\/exchange-flows\/exchange-reserve\" data-v-f87c67ca=\"\">data<\/a>, more than 90,700 <a href=\"https:\/\/www.theblock.co\/post\/285564\/spot-bitcoin-etf-inflows-good-friday\" data-v-f87c67ca=\"\">bitcoin<\/a> have been withdrawn from major cryptocurrency exchanges over the past month. This trend is reducing the liquid supply of bitcoin and suggests that investors are withdrawing their coins as part of a long-term holding strategy.","This outflow of bitcoin from exchanges to cold storage has been a multi-year-long trend, possibly driven by the rise in the digital asset's price and factors such as the approval of <a href=\"https:\/\/www.theblock.co\/post\/286429\/spot-bitcoin-etf-flows-turn-positive-for-the-week-grayscale-gbtc-outflows-slow\" data-v-f87c67ca=\"\">spot bitcoin ETFs<\/a> and anticipation surrounding the bitcoin <a href=\"https:\/\/www.theblock.co\/post\/286428\/bitcoins-recent-all-time-high-could-mean-the-halving-is-priced-in-say-coinbase-analysts\" data-v-f87c67ca=\"\">halving<\/a> event.","In July 2021, bitcoin exchange reserves hovered around the 2.8 million mark, indicating a decrease of approximately 900,000 coins since CryptoQuant started recording this metric.","<span data-v-f87c67ca=\"\">Bitcoin exchange reserves drop to record low. Image: CryptoQuant.<\/span>","However, Glassnode data indicates that of the bitcoin still traded on exchanges, there has been a significant transfer from long-term holders to short-term holders,&nbsp;this week's Glassnode <a href=\"https:\/\/insights.glassnode.com\/the-week-onchain-week-14-2024\/\" data-v-f87c67ca=\"\">report<\/a> said.","\"Following a historical tightness in supply, the divergence between long and short-term holder supply has started closing, and as prices rise, and unrealized profits held by investors increase, it entices long-term holders to part with their holdings,\" the Glassnode report added.","The report said the short-term holder supply has increased by around 1.121 million bitcoin, absorbing the long-term holder distribution pressure.","The bitcoin price increased by around 2.6% in the past 24 hours and was changing hands for $67,587 at 11:34 a.m. ET, according to <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc\" data-v-f87c67ca=\"\">The Block's Price Page<\/a>.&nbsp;","However, the largest digital asset by market capitalization is still down around 10% from its $73,000 all-time high recorded in mid-March. \"Strong economic indicators coming out of the U.S. could be dampening bitcoin's performance,\" Stocklytics analyst Neil Roarty said in an email to The Block.","Roarty further noted that the U.S. Federal Reserve is under no pressure to hasten the start of an interest rate cut cycle this year. He added that this circumstance might not bode well for bitcoin, speculating that such cuts would be necessary to propel its price as high as a forecast target of $100,000 in 2024.","\"Now all attention turns to Friday’s much-anticipated March jobs report from the Bureau of Labor Statistics. Forecasters predict another strong month, and if that’s indeed the case, the bitcoin bulls may need to settle in for a period of consolidation,\" he added.","In an email sent to The Block, Coinbase analysts also said that bitcoin would be affected by economic data coming out of the U.S. Analysts David Duong and David Han highlighted that an unexpected increase in U.S. manufacturing activity has \"driven the dollar to levels last seen in November.\" This aligns with data from TradingView, showing that the dollar index has surged by 1.24% in the past month alone.","When the dollar strengthens, dollar-denominated assets, such as bitcoin and gold, become more expensive. This could potentially lead to fewer people being able to pay the higher prices to buy them, leading to possible price corrections. Additionally, a sustained strong dollar can hinder borrowing and investment, leading to risk-averse behavior in the market. This may result in a reluctance among investors to invest in risk assets.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"David Han","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"David Duong","content":"PERSON"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"$67,587","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"1.24%","content":"PERCENT"},{"type":"11:34 a.m. ET","content":"TIME"},{"type":"+0.38%","content":"PERCENT"},{"type":"Neil Roarty","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$73,000","content":"MONEY"},{"type":"2.6%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Bureau of Labor Statistics","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"Glassnode","content":"PERSON"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}