{"summary":"Ethereum scaling solution zkSync has launched its next development phase called &quot;fair onboarding alpha.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212564\/zksync-opens-doors-to-ethereum-developers-while-network-remains-in-alpha","publishDate":"2023-02-16T10:38:45","id":12420,"type":null,"title":"ZkSync opens doors to Ethereum developers while network remains in alpha","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethereum scaling solution zkSync launched its next development phase called \"fair onboarding alpha,\" which allows certain registered projects to deploy onto the mainnet. The team has also renamed its existing network called zkSync 2.0 to zkSync Era.<\/span>","<span data-v-f87c67ca=\"\">ZkSync is currently in the midst of launching its version of a zkEVM, a ZK-Rollup Layer 2 scaling solution that can support the Ethereum Virtual Machine (EVM). In October, the project was <a href=\"https:\/\/www.theblock.co\/post\/180846\/matter-labs-releases-first-phase-of-zksync-2-0-mainnet-called-baby-alpha\" data-v-f87c67ca=\"\">launched<\/a> in its \"baby alpha\" phase and was for<\/span><span data-v-f87c67ca=\"\"> internal use only. At the end of this phase, the network was relaunched in what was called a regenesis event. This took into account changes to the code as a result of going through audits. The project has now moved to the second stage, the fair onboarding alpha.<\/span>","<span data-v-f87c67ca=\"\">During this onboarding alpha stage, registered projects will be able to deploy and test their apps on zkSync Era, with token bridging enabled for testing and deployment purposes. However, the mainnet will remain closed to end-users during this stage. Ongoing investments in audits and bug bounty programs will continue to ensure the security of the platform, the team noted. Once this phase is finished, the network will be opened up to all projects and users.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This comes as zkSync competitor Polygon recently said it<\/span> <a href=\"https:\/\/www.theblock.co\/post\/211517\/polygon-eyes-mainnet-beta-release-for-zkevm-layer-2-next-month\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">planned<\/span><\/a><span data-v-f87c67ca=\"\"> to launch its zkEVM network in March.<\/span>","<span data-v-f87c67ca=\"\">Over the past year, Layer 2 projects like Polygon, Starknet, zkSync, and Scroll have been fiercely competing to develop a functioning ZK-based Layer 2 that can natively support Ethereum apps. While none of these projects have yet released a product for public use, that could soon change, with zkEVMs from Polygon and others like zkSync ready to go live in the coming months. Matter Labs is also expected to release a new roadmap soon.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["ZKEVM","ZKSYNC"],"authors":["Vishal Chawla","The Block"]}