{"summary":"Virtu CEO Doug Cifu said its crypto market making activity has doubled between the first and second quarter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/113683\/market-making-giant-virtu-financial-is-now-active-on-coinbase-and-gemini","publishDate":"2021-08-05T12:31:52","id":12422,"type":null,"title":"Market making giant Virtu Financial is now active on Coinbase and Gemini","category":["CAPITAL MARKETS"],"content":["Virtu Financial, a multi-billion trading firm, has made a big move into the crypto market, announcing during its second-quarter earnings that it has been market making on major crypto venues.&nbsp;","\"Our expansion into cryptocurrency market making also continues to progress ... with crypto market-making doubling in Q2 versus Q1,\" noted CEO Doug Cifu.&nbsp;","The firm has been active in the crypto market through its <a href=\"https:\/\/www.theblockcrypto.com\/post\/95626\/virtu-financial-leans-into-crypto-as-designated-market-maker-for-canadian-bitcoin-etf\" data-v-f87c67ca=\"\">market making<\/a> in futures and exchange-traded products in Canada. Market making refers to the function firms like Virtu and Jump provide to exchanges, stepping in to buy or sell an asset when there isn't enough organic liquidity.","This is the first time Virtu has publicly said that it is trading spot bitcoin, the latest indication that Wall Street is warming up to the crypto asset class. A source told The Block that Virtu is market making on Coinbase and Gemini.&nbsp;","Looking to the future, Virtu is also looking to integrate crypto into its singe dealer platform VFX, which streams prices of assets like foreign exchange, precious metals and treasuries to its counter-parties.&nbsp;","\"We are also in the early stages of developing our ability to stream cryptocurrencies over our direct-to-dealer streaming liquidity platform, VFX,\" Cifu said.&nbsp;","The growth of its crypto operations was one bright spot in an earnings release that disappointed Wall Street. The firm's net trading income slid from $668.7 million a year ago to $341.8 million. The stock fell by more than 8% on Wednesday, but has pared some of those losses during today’s session.&nbsp;","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$668.7 million","content":"MONEY"},{"type":"$341.8 million","content":"MONEY"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Cifu","content":"PERSON"},{"type":"Doug Cifu","content":"PERSON"},{"type":"quarter","content":"DATE"}],"hashtag":["COINBASE","GEMINI"],"authors":["Frank Chaparro","The Block"]}