{"summary":"After FTX&#x27;s bankruptcy, Coinbase explored acquiring the failed company&#x27;s European unit amid interest to grow derivatives offerings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252659\/coinbase-mulled-buying-ftx-europe-post-bankruptcy-report","publishDate":"2023-09-22T17:03:43","id":12431,"type":null,"title":"Coinbase mulled buying FTX Europe post-bankruptcy: report","category":["BANKRUPTCY"],"content":["In the aftermath of FTX's bankruptcy in November of last year, rival U.S.-based exchange Coinbase considered acquiring the failed company's European unit, <a href=\"https:\/\/finance.yahoo.com\/news\/coinbase-pursued-ftx-europe-acquisition-120000734.html\" data-v-f87c67ca=\"\">according to Fortune<\/a>.","Documents show that Coinbase mulled buying FTX Europe as it explored expanding its crypto derivatives offerings, said the report. Talks never advanced to a \"late stage,\" the report also said.","While Coinbase is \"no longer pursuing the potential deal,\" the U.S.-based exchange continued to express interest in an acquisition sometime during this month, said Fortune.","Crypto derivatives make up a significant portion of the overall trading of digital currencies. JMP analysts <a href=\"https:\/\/www.theblock.co\/post\/245893\/coinbase-derivatives-staying-power-usa\" data-v-f87c67ca=\"\">have said<\/a> that Coinbase's expanding into derivatives adds to its upside case in the long term, given the derivatives market represents the bulk of trading activity.","Previous to the company's bankruptcy, FTX Europe had been adding tens of thousands of users, according to Fortune.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"November of last year","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"FTX Europe","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}