{"summary":"The SEC chair declined to comment directly on legislation that would direct his agency and commodities regulators to create a clearer pathway for an asset to transition from being a security to a commodity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240148\/gensler-says-too-early-to-say-if-ripple-ruling-will-lead-to-more-crypto-rules","publishDate":"2023-07-17T18:16:29","id":12438,"type":null,"title":"Gensler thinks its &#x27;too early&#x27; to say if Ripple ruling will lead to more crypto rules","category":["POLICY"],"content":["Securities and Exchange Commission Chair Gary Gensler said “it’s too early” to determine whether the agency he heads will draft more crypto-specific rules following a federal judge’s split decision in a high-profile enforcement case <a href=\"https:\/\/www.theblock.co\/post\/239559\/sec-faces-wake-up-call-after-ripple-ruling-though-appeal-likely\" data-v-f87c67ca=\"\">last week<\/a>.","Gensler went on to note that the SEC has proposed rule changes during his tenure that apply to digital assets.","“There’s rules on the books about what it means to be a securities exchange, a broker, and investment adviser, there are rules on the books,” Gensler said in an online interview with Yahoo Finance.","“We’ve also put forward or even adopted rules with regard to broker-dealers in this space called special purpose broker-dealers, we’ve put forward rules with regards to the safeguarding of assets, so we’ve done some of that, but again, we’ll continue to consider it,” he continued.","Companies and crypto industry advocates have pushed back against some of those proposed rules, which included applying the definition of an exchange to decentralized finance entities and making explicit that custodial rules also apply to digital assets.","The final point became a point of emphasis after high-profile bankruptcies at Celsius, Voyager Digital and FTX tied up billions in customer assets because they were held by the firms rather than a third-party custodian. Those customers are unlikely to see the return of their entire holdings at the end of those bankruptcy processes.","The financial markets regulator also challenged the concept of decentralized finance.","“This field is actually quite centralized,” Gensler said, arguing that decentralized projects sometimes have individuals with the title of CEO or chief technology officer, and that the assets are often held by less than 100 people. “Finance tends towards some centralization.”","“The investing public comes first, that’s how our securities laws were first written, companies raising money in the markets as well, and really protecting them and protecting the integrity of the markets as well,” he added.","Gensler declined to comment directly on the Ripple case, citing “ongoing litigation.” In addition to the possibility of <a href=\"https:\/\/www.theblock.co\/post\/239537\/sec-leaves-door-open-for-appeal-in-ripple-case\" data-v-f87c67ca=\"\">an appeal<\/a> of the split decision, which saw the judge side with the SEC on Ripple’s sales to institutional investors but with the company as to whether blind bid sales constituted securities violations, the SEC also has active enforcement cases against U.S. crypto giant Coinbase and global trading leader Binance.","The SEC chair also demurred when asked his thoughts about <a href=\"https:\/\/www.theblock.co\/post\/240020\/house-vote-on-crypto-stablecoin-bills-now-delayed-by-a-week\" data-v-f87c67ca=\"\">legislation<\/a> in the House of Representatives aimed at tweaking existing rules around digital assets to create a clear pathway for a security asset to become a commodity, as well as giving the Commodity Futures Trading Commission more power over spot markets.","“We are asked by members of Congress, both in the House and the Senate, and we generally give them our feedback directly rather than through the interviews on-air,” Gensler said. “I’m going to save our comments for any draft legislation for members who are asking us directly.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["CFTC","CONGRESS","DEXS","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"],"authors":["Colin Wilhelm","The Block"]}