{"summary":"Cryptocurrency exchange Gemini is expanding into custody\nIts new qualified custodian unit will offer users the ability to instantly trade cryptocurrencies from cold storage","author":["Martine Paris","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/39064\/gemini-expands-custody-offerings-with-instant-trades-from-cold-storage","publishDate":"2019-09-10T07:12:56","id":1243,"type":null,"title":"Gemini expands into custody with instant trades from cold storage","category":["Exchanges"],"content":["Gemini is diving deeper into the market for cryptocurrencies with the launch of a new qualified custody unit, the firm announced Tuesday.&nbsp;","<span data-v-f87c67ca=\"\">The firm, founded by Cameron and Tyler Winklevoss, announced the launch of Gemini Custody, which will serve as a qualified custodian, offering the ability to<\/span><span data-v-f87c67ca=\"\"> instantly trade certain cryptocurrencies from offline storage. In total, it will custody 18 assets, including<\/span><span data-v-f87c67ca=\"\">&nbsp;bitcoin, bitcoin cash, ether, litecoin, and 13 ethereum-based tokens, including Basic Attention Token. It is a striking number of coins considering Gemini's conservative listing approach — the exchange has only added support for <a href=\"https:\/\/gemini24.zendesk.com\/hc\/en-us\/articles\/115005868106-Which-digital-assets-does-Gemini-support-\" data-v-f87c67ca=\"\">six assets<\/a> since launching in 2015.<\/span>","The launch of the new business comes at a time of increased competition in the custody landscape. Recently, Coinbase has expanded its offering via the <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/coinbase-has-sealed-the-acquisition-of-xapos-institutional-custody-service-for-55-million\/\" data-v-f87c67ca=\"\">acquisition<\/a> of Xapo's institutional arm. At the same time, new players such as Anchorage and Fidelity Digital Assets have come online to offer investors a new way to store assets in what is known to be a volatile market. Still, investors have been crying for solutions that will balance security and the ability to move assets quickly to trade.&nbsp;","<span data-v-f87c67ca=\"\">In response, earlier this year Gemini rivals<\/span> <a href=\"https:\/\/www.theblockcrypto.com\/2019\/03\/13\/coinbase-has-unveiled-the-next-phase-of-its-otc-roll-out-and-it-shows-where-crypto-trading-is-heading\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase<\/span><\/a><span data-v-f87c67ca=\"\"> and BitGo released products that offer direct trading from offline storage by bringing together OTC services and custody offerings.<\/span> <a href=\"https:\/\/blog.bitgo.com\/with-bitgo-security-and-liquidity-go-hand-in-hand-6278ad048da7\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">In January<\/span><\/a><span data-v-f87c67ca=\"\">, BitGo, in partnership with Genesis Global Trading, started testing same-day settlement from cold storage and<\/span> <a href=\"https:\/\/blog.coinbase.com\/coinbase-custody-agency-otc-instant-liquidity-on-offline-funds-91f26cb4191b\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in March<\/span><\/a><span data-v-f87c67ca=\"\">, Coinbase Custody began offering instant trades.<\/span>","<span data-v-f87c67ca=\"\">Amidst an increasingly competitive landscape with industry titans, Gemini has sought ways to differentiate its product offerings. To get a better understanding of its market positioning, The Block spoke with Jeanine Hightower-Sellitto, Gemini’s Managing Director of Operations who joined a year ago from Nasdaq’s International Securities Exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The following is an edited transcript of our discussion:<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">How are you differentiating Gemini Custody instant trades from your competition?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">I believe that our offering for Gemini instant trading is unique in the crypto space for custody. We’re providing liquidity from cold storage for the exchange account for trading on the Limit Order Book that Gemini operates. There's a big difference between trading OTC and trading on a regulated listed order book.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">Can you explain how Gemini Custody’s instant trades work?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">For custody instant trades, we allow customers to trade on the exchange using the balances they have for those particular assets in cold storage without sacrificing any of the security in the withdrawal process. This provides customers immediate liquidity to their holdings that are held offline without having to miss any market opportunities for which they would want to be trading as assets on a real-time basis. So if there’s a price dislocation coming to market, you don’t have to wait the hours or longer for those assets to be actually physically delivered into the exchange account. We can credit your exchange account for the assets that you hold in cold storage and you’re able to initiate trading on those balances right away while we follow the full security feature set for withdrawing your assets from cold storage. We can give you the advance because we have a super liquid hot wallet for the exchange.<\/span>","<b data-v-f87c67ca=\"\">The Block:<\/b><span data-v-f87c67ca=\"\"> Is this a full rollout or are you in test mode?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">It’s a full rollout.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">What’s new in the feature set?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">The user interface has been live for a short period of time but the ability to initiate the transfer to the trading account for Gemini Custody instant trade is new. The ability to create unlimited sub-accounts for both custody accounts and exchange trading accounts is relatively new, we put out that release last Tuesday. The ability for customers to self-manage view-only access for account activity is new. Gemini Clearing for OTC trades was announced last Friday. Expanded custody support for the 13 ERC-20 tokens is new. [Gemini does not support ERC-20 tokens on the exchange, other than its stablecoin GUSD]<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">Are there additional fees for instant trades?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">There are no additional fees for instant trades. The trading fees follow the same fee schedule as those available on<\/span><a href=\"https:\/\/gemini.com\/custody\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">our website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">How many assets under custody does Gemini have? [BitGo claims more than<\/span><a href=\"https:\/\/www.theblockcrypto.com\/2019\/08\/14\/crypto-custodian-bitgo-says-xapo-clients-are-extremely-concerned-about-coinbase-deal\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">$2 billion<\/span><\/a><span data-v-f87c67ca=\"\">, CoinBase claims to be the world’s largest crypto custodian with ove<\/span>r <a href=\"https:\/\/blog.coinbase.com\/coinbase-custody-acquires-xapos-institutional-business-becoming-the-world-s-largest-crypto-2c1b46fc94c4\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">$7 billion<\/b><\/a> <span data-v-f87c67ca=\"\">resulting from its acquisition of Xapo’s institutional business in August]<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">We’ve never disclosed our assets under custody but it’s pretty meaningful in terms of size. We think customers should be evaluating their custodian based on the quality of their offering, their security profile and their operational procedures, and not necessarily because others have put assets there. It should be a thoughtful vetting process by each customer.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">How does your instant trades announcement tie into the opening of Gemini’s Chicago office? [Gemini opened their Chicago office<\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/29329\/gemini-is-chicago-bound-after-coinbases-exit-but-who-made-the-right-move\/\" data-v-f87c67ca=\"\"> i<span data-v-f87c67ca=\"\">n June<\/span><\/a><span data-v-f87c67ca=\"\"> as Coinbase exited the region and laid off a pool of engineers.]<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">They’re not necessarily tied. Chicago came about because there were qualified candidates we were seeking to hire in the Chicago area and it made sense for us to expand there based on that talent available in that area. It’s a really great place for us to draw talent from the traditional financial markets and trading environment.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">Do you see something special about the Chicago market?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">Personally, I do because I worked in the options markets for many years and Chicago is the home of options trading. There are a lot of options market participants that have migrated to crypto so I’m happy to see us with a presence there and catering to that customer base.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">Are there other markets that you’re looking at?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">We just announced that we’re expanding into Australia so international expansion is at the forefront of our minds. We already operate in 49 of the 50 U.S. states as well as Washington D.C., Puerto Rico, Canada, Hong Kong, Singapore, South Korea, United Kingdom. Bigger cities have large groups of individuals that may have an interest in crypto so we’re focused on those. There’s activity going on with ad campaigns in Miami, Houston and Los Angeles.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">What do you think is causing the rise in institutional investor interest in crypto?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">There are many things that help to increase an institutional investor’s participation in the market. Rising prices is always one of the biggest drivers.<\/span>","<b data-v-f87c67ca=\"\">The Block: <\/b><span data-v-f87c67ca=\"\">What obstacles are standing in the way of mass adoption of crypto for the institutional investor?<\/span>","<b data-v-f87c67ca=\"\">Hightower-Sellitto: <\/b><span data-v-f87c67ca=\"\">A clear regulatory framework would do wonders for spurring adoption. Who the regulator will be? What their expectations are? When those standards are met? I think we’ll get there but there is more work to be done.<\/span>","<em data-v-f87c67ca=\"\">This post was written by Martine Paris, a freelance reporter on technology and cryptocurrencies.&nbsp;<\/em>","<em data-v-f87c67ca=\"\">This post has been updated to correct the name of Gemini's new custody product. An earlier version of the article identified it as <span data-v-f87c67ca=\"\">Gemini Trust Company.<\/span><\/em>"],"hashtag":["GEMINI"]}