{"summary":"China’s ruling Communist Party has appointed bitcoin and crypto skeptic Pan Gongsheng as the top Party official of the People&#x27;s Bank of China (PBOC).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237512\/china-appoints-bitcoin-skeptic-as-top-communist-party-official-at-its-central-bank-wsj","publishDate":"2023-07-03T09:18:40","id":12434,"type":null,"title":"China appoints bitcoin skeptic as top Communist Party official at its central bank: WSJ","category":["CENTRAL BANKS"],"content":["China’s ruling Communist Party has appointed bitcoin and crypto skeptic Pan Gongsheng as the top Party official of the People's Bank of China (PBOC), <a href=\"https:\/\/www.wsj.com\/articles\/china-plans-to-appoint-a-new-central-bank-governor-56a878ea\" data-v-f87c67ca=\"\">according<\/a> to The Wall Street Journal, citing sources that say he will eventually rise to governor.","Pan, previously deputy governor at China’s central bank, will replace the retiring Yi Gang.","Pan has significant experience in the financial sector and joined the PBOC in 2012. Pan previously led the central bank’s group on internet financial risks remediation, which included regulating crypto firms and clamping down on cryptocurrency use in the country.","A long-term skeptic of the industry, Pan once said at an event in 2017, “If you sit by the river and watch, one day the corpse of Bitcoin will float in front of you,” local media <a href=\"https:\/\/finance.sina.cn\/china\/cjpl\/2017-12-04\/detail-ifypikwt6022160.d.html?from=wap\" data-v-f87c67ca=\"\">reported<\/a> at the time.","He also cited an article by French scholar Eric Pichet which stated, “The Bitcoin bubble is just the latest incarnation of crazy speculation,” with his appointment putting a damper on hopes of a crypto revival in China, despite more <a href=\"https:\/\/www.theblock.co\/post\/237483\/hong-kong-government-sets-up-web3-task-force-to-help-build-a-thriving-ecosystem\" data-v-f87c67ca=\"\">positive signs<\/a>&nbsp;from Hong Kong.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"People's Bank of China (PBOC","content":"ORGANIZATION"},{"type":"Communist Party","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PBOC","content":"ORGANIZATION"},{"type":"Eric Pichet","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Pan Gongsheng","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN PARLIAMENTS","BITCOIN"],"authors":["James Hunt","The Block"]}