{"summary":"Alameda Research Ltd., the hedge fund associated with bankrupt FTX, voluntarily dismissed its case against Grayscale Investments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273771\/alameda-research-voluntarily-drops-lawsuit-filed-against-grayscale-investments","publishDate":"2024-01-22T11:19:09","id":12435,"type":null,"title":"Alameda Research voluntarily drops lawsuit filed against Grayscale Investments","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Alameda Research Ltd., the hedge fund associated with bankrupt FTX, has voluntarily dismissed a lawsuit it had brought against Grayscale Investments. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">The fund also accordingly dropped its lawsuit against Grayscale CEO Michael Sonnenshein, Digital Currency Group and its CEO Barry Silbert.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The firm had been seeking <a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-debtors-file-lawsuit-against-grayscale-investments-llc-and-its-ceo-and-owners-301763694.html\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">injunctive relief<\/span><\/a> to \"allow redemptions and reduce fees in Grayscale trusts\" and unlock $9 billion or more in value for shareholders. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">John J. Ray lll, CEO of FTX, previously said the goal was to unlock value being \"suppressed by Grayscale's self-dealing and improper regulation ban.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We are pleased to confirm that Alameda Research, FTX's affiliated hedge fund, has voluntarily dismissed its lawsuit against Grayscale,\" a Grayscale spokeswoman said in a statement on Monday. \"Alameda's voluntary dismissal underscores Grayscale’s position that this legal action was entirely without merit.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Alameda's move to drop the lawsuit comes after Grayscale completed the conversion of its flagship GBTC fund into a spot ETF. It's since seen redemptions into the billions of dollars.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bitcoin ETFs were approved by the Securities and Exchange Commission earlier this month after judges in a D.C. court over the summer ruled that the SEC had to re-review a bid from Grayscale to convert its GBTC to a spot bitcoin ETF. Three judges in a D.C. court <\/span><span class=\"s3\" data-v-f87c67ca=\"\">found that the SEC was being \"arbitrary and capricious\" because it didn't explain its differential treatment between approving past bitcoin futures ETFs and spot bitcoin ETFs.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">Updated at 11 a.m. ET to note the lawsuit also was dismissed against other parties&nbsp;<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"11 a.m.","content":"TIME"},{"type":"November 2023","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Alameda Research Ltd.","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"John J. Ray lll","content":"PERSON"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"$9 billion","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"D.C.","content":"LOCATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}