{"summary":"Hong Kong’s Securities and Futures Commission has issued guidance for parties that take part in security token offerings (STOs). SFC warning reminds","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/17677\/hong-kongs-securities-and-futures-commission-warns-about-risks-associated-with-stos","publishDate":"2019-03-29T10:49:47","id":12441,"type":null,"title":"Hong Kong’s Securities and Futures Commission warns about risks associated with STOs","category":["SECURITY TOKEN"],"content":["<span data-v-f87c67ca=\"\">Hong Kong’s finance watchdog takes STOs under the microscope<\/span>","<span data-v-f87c67ca=\"\">SFC offers guidance regarding relevant licensing and registration, due diligence, and risks associated with digital assets<\/span>","<span data-v-f87c67ca=\"\">Hong Kong’s Securities and Futures Commission <a href=\"https:\/\/www.sfc.hk\/web\/EN\/news-and-announcements\/policy-statements-and-announcements\/statement-on-security-token-offerings.html\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">has issued guidance<\/a> for parties that take part in security token offerings (STOs). <\/span>","<span data-v-f87c67ca=\"\">SFC warning reminds investors to be cautious when dealing with digital assets, including security tokens, which have long been viewed as a safer alternative to so-called initial coin offerings. According to SFC, digital assets are at risk of volatility, hacking and fraud—and the regulator warns security tokens are not exempt from those risks.<\/span>","<span data-v-f87c67ca=\"\">Security tokens are asset-backed tokens that use blockchain technology, similarly to other crypto assets. They represent the ownership of assets like precious metals or real estate or are tied to economic rights, such as shares. At the moment, most security tokens are not offered to the general public but only to professional investors, requiring large initial investments.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">SFC reminds token issuers that Security Tokens are usually recognised as securities under Securities and Futures Ordinance. Therefore, they are subject to Hong Kong’s securities laws. The regulator also points out that a license is required to be able to deal in securities—and it affects both investors operating in Hong Kong and those dealing with Hong Kong investors. Those who fail to comply, unless exempted, may face criminal offense charges.<\/span>","<span data-v-f87c67ca=\"\">SFC also advises intermediaries to keep in mind three key issues: relevant licensing and registration, due diligence, and clear information for their clients.<\/span>","<span data-v-f87c67ca=\"\">“Where an intermediary markets or distributes Security Tokens, it must be licensed or registered for Type 1 regulated activity (dealing in securities) and the Security Tokens should only be offered to professional investors,” SFC writes.<\/span>","<span data-v-f87c67ca=\"\">Moreover, those who decide to distribute securities are required to proper due diligence. According to SFC, in order to learn about STOs and gain in-depth knowledge, an intermediary should at the very least scrutinise “the background and financial soundness of the management, development team and issuer as well as the existence of and rights attached to the assets which back the Security Tokens.” It is also on them to analyse the issuer’s white paper and any other materials referring to the STO in order not to mislead their clients.<\/span>","<span data-v-f87c67ca=\"\">Clients should obtain “clear and easily comprehensible” information regarding the STOs. Otherwise, if prospective investors receive unclear knowledge, they might not be able to make informed decisions. SFC also reminds about providing clients with warning statements regarding the risks associated with digital assets.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"’s Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Security Tokens","content":"ORGANIZATION"},{"type":"Securities and Futures Ordinance","content":"ORGANIZATION"},{"type":"STO","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":[],"authors":["Carol Gaszcz","The Block"]}