{"summary":"America&#x27;s crypto mayor Francis Suarez spoke to former Google CEO Eric Schmidt about artificial intelligence and more.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227635\/americas-crypto-mayor","publishDate":"2023-04-21T13:06:46","id":12454,"type":null,"title":"Did America&#x27;s crypto mayor just float the idea of running for President?","category":["COMPANIES"],"content":["City of Miami <a href=\"https:\/\/www.theblock.co\/post\/190422\/miamis-mayor-says-hes-still-taking-paycheck-in-bitcoin\" data-v-f87c67ca=\"\">Mayor Francis Suarez<\/a>, the first American politician to take his official salary in crypto, may have provided a hint about his broader political ambitions during a <a href=\"https:\/\/twitter.com\/nmcrooks\/status\/1649427526928801793\" data-v-f87c67ca=\"\">wide ranging discussion<\/a> on artificial intelligence with former Google CEO Eric Schmidt at the eMerge Americas 2023 conference in Miami on Friday.","\"I just came from New Hampshire. I won't tell you what I was doing over there,\" Suarez told Schmidt, who was quick note the state was important for Republicans in presidential elections.","\"The mayor is freezing himself to get ready to run in New Hampshire,\" Schmidt joked, soliciting widespread applause. \"That's the headline.\"","Suarez, a Republican who leads the U.S. Conference of Mayors, <a href=\"https:\/\/www.theblock.co\/post\/190422\/miamis-mayor-says-hes-still-taking-paycheck-in-bitcoin\" data-v-f87c67ca=\"\">in 2021 first announced<\/a> the plan to be paid in bitcoin just days before the cryptocurrency reached an all-time high of $68,789. He's also been a vocal proponent of positioning Miami as a new center of tech, finance and crypto.","Even with bitcoin falling about 60% from that high to currently trade around $27,289, Suarez has continued to be optimistic about the sector.&nbsp;","Suarez said he thinks the recent resurgence of artificial intelligence is a sign that the current crypto winter will end.","\"That's exciting for me,\" Suarez told The Block after the discussion with Schmidt. \"That's when the use cases come up. When you thawed out of that AI winter, that's when when all of these incredible use cases came up. I think that's a great opportunity for us.\"","Schmidt, who served as CEO of Google from 2001 to 2011, recounted a similar period of AI winter before the current explosion of language-based models.","\"Many decades ago, when I was a grad student, AI was really hot. And the only problem is none of it worked, for all sorts of reasons,\" Schmidt said in the discussion with Suarez, referring to a winter period during which he went on to work on other things. \"There was this explosion of new AI techniques that started in roughly 2011. And then all the sudden computers got better at vision than humans. That's a pretty big deal. And they they started playing games better than humans.\"","<em data-v-f87c67ca=\"\">(Updates with bitcoin price in fifth paragraph.)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27,289","content":"MONEY"},{"type":"$68,789","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Eric Schmidt","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2001","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Suarez","content":"PERSON"},{"type":"Schmidt","content":"PERSON"},{"type":"U.S. Conference of Mayors","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"New Hampshire","content":"LOCATION"},{"type":"winter","content":"DATE"},{"type":"Francis Suarez","content":"PERSON"},{"type":"\" Suarez","content":"PERSON"},{"type":"Friday","content":"DATE"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}