{"summary":"Thousands of traders have left millions of dollars of unclaimed funds on the Ethereum side of its main bridge with Polygon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190249\/polygon-bridge-holds-27-million-of-unclaimed-funds-zengo-finds","publishDate":"2022-11-28T09:23:05","id":12450,"type":null,"title":"Polygon bridge holds $27 million of unclaimed funds, ZenGo finds","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto users have left $27 million of funds unclaimed in the Polygon bridge, potentially due to the two-step withdrawal process.","This is the bridge between Ethereum and Polygon, where crypto users can send tokens between the two blockchains. When a user bridges from Ethereum to Polygon, it takes just one transaction. On the reverse side, users have to transfer their funds to Ethereum in an initial transaction, wait an hour or so and then claim their tokens in a second transaction —&nbsp;in order to properly withdraw them.","There are more than 35,000 transfers back to the Ethereum side of the bridge that aren’t matched by subsequent claims, according to crypto wallet <a href=\"https:\/\/zengo.com\/\" data-v-f87c67ca=\"\">ZenGo<\/a> in a <a href=\"https:\/\/zengo.com\/lost-in-translation-polygon-bridges-unclaimed-millions\/\" data-v-f87c67ca=\"\">blog post<\/a>. These transfers represent around $27 million of funds, split among ETH and the stablecoins USDT, USDC and DAI.","ZenGo shared this analysis with the Polygon team, prior to publication. The Polygon team paid the transaction fee on behalf of one user who had left $2 million of funds unclaimed on the bridge, so they got their funds back. This individual had originally sent the tokens back to the Ethereum side of the bridge in May but never finished the withdrawal process.&nbsp;","Claim transactions can be made by anyone, although the funds go to the person who owns the tokens. Whoever makes the claim transaction has to pay the transaction fee.","\"Although it’s hard to imagine how someone can just “forget” about millions of USD, we assume that it might be related to the fact that additional transactions are required and that the funds are not claimable immediately, therefore creating room for such mistakes,\" said ZenGo Co-Founder and CTO Tal Be'ery.","Not all of the funds have necessarily been forgotten about. Some may be in the process of being withdrawn to the Ethereum chain as noted by Polygon Chief Information Security Officer Mudit Gupta in a direct message on Twitter. Gupta added that some funds might have been accidentally sent to the Ethereum address.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$27 million","content":"MONEY"},{"type":"CTO Tal Be'ery","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Polygon Chief Information Security Officer Mudit Gupta","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"$2 million","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","INTEROPERABILITY"],"authors":["Tim Copeland","The Block"]}