{"summary":"The CFTC plans to bring to the table rulemaking this summer that would address risks and conflicts in vertically integrated models.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282028\/cftc-chair-behnam-says-agency-preparing-rulemaking-in-risks-for-new-market-structures-prediction-markets","publishDate":"2024-03-12T11:37:48","id":12457,"type":null,"title":"CFTC Chair Behnam says agency preparing rulemaking in risks for &#x27;new market structures&#x27;, prediction markets","category":["COMPANIES"],"content":["The Commodity Futures Trading Commission (CFTC) plans to introduce new regulatory proposals during the summer to manage the potential risks and conflicts of interest arising in vertically integrated business models.","These models, where a single company controls multiple levels of its supply chain or operations, have raised concerns even within the cryptocurrency industry.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">In prepared remarks on Tuesday at a Futures Industry Association conference in Florida, CFTC Chair Rostin Behnam said he expected the commission to consider a proposal in the coming months after receiving <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8734-23\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">comments<\/span><\/a> on \"the impact of affiliations of certain CFTC-regulated entities.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I was not surprised that by last summer, vertical integration, an outgrowth of electronification and DeFi, had grown,\" Behnam said. \"Our markets are no longer physically delineated by geographical separation of activities among distinguishable market actors.&nbsp; And, to be clear, there is nothing per se unreasonable or problematic about innovative approaches.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The request for comment yielded hundreds of comments from the likes of Coinbase and consumer advocacy groups.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">At the time of the request for comment last year, CFTC Commissioner Christy Goldsmith Romero highlighted her <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/opabehnam43#_ftnref13\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">concerns<\/span><\/a> about crypto firms' ability to serve as market makers, clearinghouses, lenders and custodians. She singled out FTX and warned that vertically integrated businesses in crypto present risks similar to what faced the crypto exchange when it collapsed in November 2022.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In an unregulated environment, the full extent of these conflicts may not be disclosed or resolved, which could lead to cascading losses and contagion risk,\" Romero said last year. \"It is our responsibility as a regulator to understand the risk and implement common sense regulation to address the risk.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFTC plans to consider a proposal that addresses the treatment of event contracts, Behnam said on Monday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"In the upcoming months, we anticipate considering a proposal to amend CFTC rules that address the treatment of certain types of event contracts, in order to provide additional regulatory clarity both for exchanges that seek to list event contracts, and for market participants,\" Behnam said.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Events markets, such as Kalshi and Polymarket, allow users to bet on the outcome of future events, from the total snowfall in New York City this month to the severity of a possible<\/span><span class=\"s5\" data-v-f87c67ca=\"\">&nbsp;recession this year. <\/span><span class=\"s4\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam also pushed back against criticism of how his agency handles crypto. Some have said it is a <a href=\"https:\/\/www.theblock.co\/post\/177367\/dont-expect-the-cftc-to-be-light-touch-if-it-gains-crypto-oversight-power-says-benham\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">less robust<\/span><\/a> regulator than the Securities and Exchange Commission, which Behnam has continually rebutted.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"There is nothing light touch when it comes to principles-based regulation,\" Behnam said. \"Rather, principles-based regulation preserves the concrete, foundational objectives of the underlying law while providing for flexibility and innovation.\"&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Florida","content":"LOCATION"},{"type":"Romero","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Kalshi","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Futures Industry Association","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Behnam","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"November 2022","content":"DATE"}],"hashtag":["CFTC","FTX"],"authors":["Sarah Wynn","The Block"]}