{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/16057\/mt-gox-ceo-karpeles-motion-to-dismiss-denied","publishDate":"2019-03-15T17:00:38","id":12461,"type":null,"title":"Mt. Gox CEO&#x27;s motion to dismiss is denied","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\". This week’s guest post by Preston Byrne is “PJB”","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Motto v. Karpeles, 2019 U.S. Dist. LEXIS 39254 (N.D. Il., March 12, 2019). [SDP]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","Litigation has a long tail, class actions in particular. This opinion deals with the Mt. Gox cryptocurrency exchange collapse in February 2014, and denies a motion to dismiss filed by the company’s CEO on personal jurisdiction ground.","Mark Karpeles was Mt. Gox’s President and CEO. Per the opinion (which relies on the complaint) As Mt. Gox’s President and CEO, Karpeles “controlled all aspects of Mt. Gox’s business from the ground up,” including software design and operation, public and customer interactions, and accounting practices. However, Karpeles was not responsible for “Mt. Gox’s day-to-day accounting” and did not personally respond to Motto’s and Greene’s communications to Mt. Gox. Karpeles also never made any specific decision to operate in Illinois and was unaware of which or how many Mt. Gox accounts were associated with Illinois.” (Note — the Court treats all of the allegations in the Complaint as true for purposes of this kind of motion. They haven’t been fully litigated yet, so they are all still allegations and it remains possible that the Plaintiffs will be unable to convince a judge or jury that they are true).","Plaintiffs sued Karpeles for losses they suffered after the exchange “went dark.” They alleged that he misrepresented the security and stability of the exchange and plead state claims arising out of the exchange’s collapse. It went to bankruptcy in Japan, and Karpeles was arrested by Japanese police and “[d]ue to these criminal proceedings [is] currently prohibited from leaving the country.”","In order to sue someone in a U.S. court, you have to have something called “personal jurisdiction” over them. There are a couple of ways you can get this — actual physical presence is one of them. But if you reach into a state and enter into contracts there, commit torts, or break laws, you can also be subject to personal jurisdiction. This is something that law students study in the first year of law school in civil procedure class and that practicing lawyers who focus on litigation deal with on a fairly regular basis.","Here, Karpeles argued that there were three reasons why there wasn’t personal jurisdiction against him in this case. First, he argued that he never visited Illinois. The Court said that this didn’t matter and that his virtual presence there was sufficient, even if the company hadn’t specifically targeted Illinois. Plaintiffs’ “contacts with the exchange were not random, isolated, or fortuitous, but rather the product of Mt. Gox’s virtual presence in Illinois, as some 7,056, or about 1.5%, of the addresses associated with Mt. Gox accounts came from Illinois.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSecond Karpeles argued it wouldn’t be fair to make him defend the lawsuit in Illinois because he can’t leave Japan. The court said it was “unclear” if any other U.S. state had a stronger interest in jurisdiction over these claims than Illinois and that forcing the plaintiffs to litigate their claims would place a significant burden on them. In addition, the Court reasoned that “the burden faced by Karpeles-his confinement to Japan arises from his alleged Mt. Gox-related misconduct.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThird, Karpeles argued that under something called the “Fiduciary Shield Doctrine” he shouldn’t be subject to personal jurisdiction in Illinois based solely on contacts with Illinois that arose over work for Mt. Gox. This doctrine doesn’t apply, however, where the defendant has “a sufficient interest in the firm’s actions to overcome the fiduciary shield.” Here, the Court reasoned that Karpeles’ ultimate ownership of 88% of Mt. Gox, deprives him of the fiduciary shield where, Plaintiffs allege that he propped up Mt. Gox’s value through intentionally fraudulent representations that he made and directed.”","Bottom line — this lawsuit stays in Illinois federal court and proceeds against Mark Karpeles personally. This is a putative class action though and these things take a long time to resolve, so we may be reading opinions in this case for several years to come. Also, if you run a business from outside of the United States and allegedly do harm to people inside the country, the fact that you can’t come home to defend yourself isn’t necessarily a defense.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March 12, 2019","content":"DATE"},{"type":"the Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"88%","content":"PERCENT"},{"type":"2019","content":"DATE"},{"type":"Illinois","content":"LOCATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Greene","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"Court","content":"ORGANIZATION"},{"type":"Mt. Gox","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Karpeles","content":"PERSON"},{"type":"Preston Byrne","content":"PERSON"},{"type":"1.5%","content":"PERCENT"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Motto v. Karpeles","content":"PERSON"},{"type":"February 2014","content":"DATE"},{"type":"Mark Karpeles","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"U.S. Dist","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"N.D. Il.","content":"LOCATION"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}