{"summary":"Ava Labs is releasing the mainnet for its Avalanche blockchain on September 21.\nThe mainnet launch will see Avalanche’s native token, AVAX, distributed to “rightful owners,” Ava Labs co-founder and CEO Emin Gün Sirer told The Block. ","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/77927\/avalanche-mainnet-launch-next-week","publishDate":"2020-09-16T10:01:35","id":1246,"type":null,"title":"Avalanche&#x27;s blockchain mainnet is going live next week","category":["Layer 1s"],"content":["Ava Labs, the blockchain development firm led by Cornell computer science professor Emin Gün Sirer, is launching the mainnet of its Avalanche blockchain on September 21.","The mainnet launch will see Avalanche going live with a genesis state, Sirer told The Block, meaning Avalanche's native token, AVAX, will be distributed to \"rightful owners.\" These include those who purchased the token in private and public sales, those who were awarded via grants, or earned by contributing to the Avalanche community.","Avalanche has been under development for the past 16 months and <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72597\/blockchain-project-ava-raises-42-million-in-a-public-token-sale\" data-v-f87c67ca=\"\">aspires to<\/a> outclass Ethereum 2.0, the Ethereum network's looming upgrade, at launch. It aims to achieve not only higher throughput (the number of transactions that a network can process per second) but also lower latency (the time it takes for nodes to agree that a transaction is valid).","\"Avalanche is built from the ground-up to scale both the transaction throughput and time-to-finality,\" Sirer told The Block. \"It's also ready for use starting next Monday, rather than in development with an uncertain timeframe.\"","As for which and how many apps will initially launch on Avalanche mainnet, Sirer told The Block that \"several projects are preparing to launch shortly after mainnet launch.\" Ava Labs is in \"discussions with a wide range of projects like stablecoins, lending, and swaps,\" according to Sirer, who declined to disclose the names of those projects.","Ava Labs appears to be specifically attracting decentralized finance (DeFi) projects to its mainnet. \"DeFi is only scratching the surface of its potential right now. High fees, network congestion, and long times to finality constrain the use cases that are possible,\" Sirer told The Block, adding that Ava Labs is \"investing heavily in grants to DeFi projects\" through its accelerator, Avalanche X.","\"In the coming weeks, grant projects like an atomic swaps platform and end-to-end testing suite will be live on Avalanche,\" Sirer added.","The Avalanche mainnet is being released following the completion of three testnets. Its latest testnet, the Everest Release, saw over 700 full, block-producing nodes participate. The ecosystem and community around Avalanche will determine the number of mainnet nodes, Sirer told The Block.","Ava Labs <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72597\/blockchain-project-ava-raises-42-million-in-a-public-token-sale\" data-v-f87c67ca=\"\">has raised $60 million<\/a> in total to date. Investors include Andreessen Horowitz (a16z), Galaxy Digital, and Bitmain, among others. Ava Labs isn't looking to raise more funds in the near future, according to Sirer."],"hashtag":["AVALANCHE","EMIN GUN SIRER"]}