{"summary":"Despite a slightly lower number of assets traded on Christmas Day, there&#x27;s consistent activity throughout the holiday season.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268899\/for-cryptos-largest-trading-operations-christmas-is-open-for-business","publishDate":"2023-12-25T14:01:24","id":12462,"type":null,"title":"For crypto&#x27;s largest trading operations, Christmas is open for business","category":["COMPANY INTELLIGENCE"],"content":["\"'Twas the night before Christmas, when all through the house, not a creature was stirring,\" except for the largest trading shops in crypto markets.","On the rare occasions when the world's capital markets close, such as on Christmas Day and New Year's Eve, crypto brokerage shops, market makers and over-the-counter trading operations remain open for business and continue to take orders and offer liquidity.","This characteristic stems from crypto markets being 24\/7 in general. Digital assets are exchanged continuously across public ledgers, crypto brokerages, exchanges, and a network of trading entities that collectively form the industry's emerging capital markets.","Notably, liquidity providers like Wintermute and GSR are mandated to uphold a certain level of presence, even on Christmas Day, serving as liquidity providers and managing over-the-counter trading desks. Market makers act as intermediaries, supplying buy and sell price quotes to ensure sufficient liquidity for traders to enter and exit specific assets. Meanwhile, an OTC desk caters to larger clients by facilitating off-exchange trading in significant volumes.","\"Crypto markets never sleep, and neither does Wintermute's OTC desk,\" noted Evgeny Gaevoy, co-founder of Wintermute. \"We are positioned to serve counter-parties from all geographies, recognizing that in some regions, including parts of Asia, Christmas is observed as a regular working day.\"","It's a similar story at GSR, which is also \"always staffed.\"","As for market dynamics over the holiday season, GSR's Richard Rosenblum said it can depend, noting that \"the base case is that you expect lower volatility.\"","\"But if there is a VOL catalyst that comes into play, then you'd anticipate even bigger moves than normal, as liquidity conditions are more challenged.\"","As a result, the volatility of volatility is typically higher on a holiday like Christmas.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-dvol-index-vol-of-vol\/embed\" title=\"BTC DVol Index Vol of Vol\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Rosenblum added that portfolios with exposure to derivatives need constant monitoring, which requires eyes on the screens during the more sleepy period between Christmas and New Year's.","\"Even if there were to be low client activity, when having a portfolio with options and derivatives, there is additional risk management and maintenance when the market moves around.\"","As for the number of tokens traded, Wintermute's Gaevoy said that crypto-native counter-parties trade throughout the holiday period, while most of TradFi shut their terminals and trading stations.&nbsp;","\"Historically, we've witnessed consistent activity levels during the holiday season, with a slightly lower amount of activity on Christmas Day,\" he said. \"As a source of liquidity for hundreds of tokens, we trade a wide range of assets throughout the year, including Christmas, though with a moderately lower number of unique assets traded compared to other days in December.\"","Even if Christmas turns out to be sanguine, Gaevoy mentions that activities usually pick up toward the end of the year.","\"We receive increased onboarding requests,\" he said. \"These are often driven by strategic considerations like the end-of-year tax, either for booking a trade or for operational needs such as settling invoices before year-end.\"","<i data-v-03de5780=\"\" data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, previously sat on The Block's board of directors from April 2023 to early November 2023 and remains a minority shareholder.<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Wintermute","content":"PERSON"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Richard Rosenblum","content":"PERSON"},{"type":"Rosenblum","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Christmas","content":"DATE"},{"type":"Gaevoy","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Christmas Day","content":"DATE"},{"type":"New Year's","content":"ORGANIZATION"}],"hashtag":["WINTERMUTE"],"authors":["Frank Chaparro","The Block"]}