{"summary":"U.S.-based crypto exchanges, including Coinbase and Binance.US, could face regulatory pressure to register with the SEC, JPMorgan said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234254\/jpmorgan-crypto-exchanges-register-sec","publishDate":"2023-06-12T11:51:26","id":12460,"type":null,"title":"JPMorgan says crypto exchanges may be forced to register with SEC","category":["POLICY"],"content":["United States-based crypto exchanges, including Coinbase and Binance.US — both of which were sued by the Securities and Exchange Commission last week — could potentially face regulatory pressure to register with the agency, according to JPMorgan strategists.","\"Eventually, the SEC position might be confirmed by lawmakers and Coinbase, Binance.US and other U.S. exchanges would have to register as brokers and most cryptocurrencies would be treated as securities,\" JPMorgan strategists led by Nikolaos Panigirtzoglou wrote in a note on Thursday. \"This could be more onerous and more costly for the crypto industry but there could be positives as well, as crypto markets would be subjected to similar regulations applied to traditional markets such as equities and thus offer more transparency and investor protection.\"","The SEC last week sued <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\">Binance, Binance.US<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">Coinbase<\/a> for allegedly violating U.S. securities laws. The regulator hopes courts will compel the firms to adhere to its regulations for stock exchanges or cease trading crypto assets in the country.","JPMorgan strategists said the SEC efforts increase the need for U.S. lawmakers to develop a clear regulatory framework this year. Without such clarity, crypto activity in the U.S. will likely shift outside the country and into decentralized entities, and venture capital funding for crypto will remain limited, according to the note.","Regulations will be positive as \"it would clear the industry from bad practices and bad actors, which in turn is necessary for the industry to mature and see more institutional participation,\" according to strategists.","In its lawsuits against Binance and Coinbase, the SEC <a href=\"https:\/\/www.theblock.co\/post\/233174\/solana-matic-cardano-others-securities-sec-binance-lawsuit\" data-v-f87c67ca=\"\">declared<\/a> <a href=\"https:\/\/www.theblock.co\/post\/233284\/sec-names-more-tokens-as-securities-including-chiliz-flow-near-and-nexo\" data-v-f87c67ca=\"\">over a dozen<\/a> crypto tokens as securities, including Solana's SOL and Polygon's MATIC.","If the SEC wins the battle, that could result in exchanges delisting these tokens and limiting their respective blockchains' potential development, according to JPMorgan strategists, who said that could benefit Ethereum.","\"Given that most of the tokens targeted by SEC are Ethereum competitors, often called in the crypto world Ethereum killers, [last] week's SEC actions raise the chance that Ethereum would further increase its dominance in smart contract blockchain space,\" strategists said.","JPMorgan specifically commented on BNB's classification as a security, saying in an unlikely scenario where Binance was to collapse, the BNB token could still retain some value as long as the BNB chain remains operational.","\"This assumption is admittedly far from given, since the Binance exchange sits currently at the centre of the [BNB] blockchain,\" strategists noted.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BINANCE","COINBASE"],"authors":["Yogita Khatri","The Block"]}