{"summary":"Crypto airdrops are again providing big rewards, largely to those gaming the system. That&#x27;s as long as they don’t get caught.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225215\/we-made-close-to-1-million-inside-the-murky-world-of-airdrop-farming","publishDate":"2023-04-06T10:56:16","id":12472,"type":null,"title":"&#x27;Airdrop farmers&#x27; tell us how they make millions","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto airdrops are back with a vengeance.","A truly crypto-only phenomenon, airdrops involve the distribution of crypto tokens to early adopters of protocols and platforms.&nbsp;","While it may sound unbelievable to the uninitiated, these airdrops can yield highly valuable tokens, sometimes worth thousands of dollars — if not more. Such windfalls have come and gone over the years, but have seen a recent revival thanks to Layer 2 networks like Optimism and, most recently, Arbitrum.&nbsp;","With so much potential money on offer, some on-chain users unsurprisingly try to grab as much of the airdrop supply for themselves as they can. These so-called “airdrop farmers” try to speculate which projects might conduct airdrops and make themselves eligible for as many tokens as possible. Such communities have picked up steam in the past year, with some hardcore players managing hundreds of wallets or more.&nbsp;","The rewards can be shockingly good to those who play the game right.","“We made close to $1 million,” said a pseudonymous Russian individual known as LEOresearch, referring to the total amount their team generated. “Blur gave us something like $300,000, Arbitrum gave us around $180,000, Aptos gave us $125,000 and Optimism, $120,000.”","LEOresearch has been operating in crypto since 2020. They maintain a Telegram channel that pushes crypto information to more than 56,000 Russian speakers from the Commonwealth of Independent States region, as well as an active side chat comprising 6,000 members.&nbsp;","During the crypto bull market, LEOresearch focused on making money by investing in token sales and offerings. Once the bear market hit, they looked for new ways to make money, pivoting to aidrops after the Aptos team conducted one in October 2022.","“After that, we decided to make a team with researchers, with software, with management, and make hunting [airdrops] a business for us, a big way to make money on a regular basis,” they said.","In some ways, airdrop hunting is a simple business. The core idea is to identify projects that are likely to issue a token to early adopters of the platform, then interact with that platform over a period of time, ideally involving significant amounts of money. Then, if an airdrop does take place, each wallet will receive an allocation — the payday.&nbsp;","But there are risks involved. Depending on the network, there will be some costs to using the network, including transaction and blockchain-to-blockchain bridging fees, trading fees and slippage, and so on. The more wallets used, the greater the cost.&nbsp;","If an airdrop then doesn’t happen, an airdrop farmer might lose money in the end.","In LEOresearch’s case, they only typically use a handful of wallets per person as it’s a slow, manual process. But they said they encourage their friends and family to follow the same strategies, amplifying the gains within their community.&nbsp;","On top of this, they have recently started trialing software that automatically makes transactions regularly while also randomizing the amounts and frequency of them — a move that makes airdrop farming far more efficient.","LEOresearch and his team have also built a community focused around airdrop farming and similar crypto strategies called NFD. The goal is to provide this community with research focused on helping them to maximize their chances of hitting an airdrop. They sold 2,000 NFTs that provide trial access to the platform, showing serious demand for airdrop farming among the wider crypto community.","A pseudonymous Russian crypto user called Auri said their first airdrop came from filling out a Google form for a project called Inverse Finance.&nbsp;","In March 2021, they lived rent-free in a dorm with a friend, spending just $400 monthly on expenses. When the airdrop occurred, they received 80 tokens worth $80,000 — all for just filling out a form.","Auri said the wider crypto market crash last spring wiped them out. But they stayed in crypto, engaging with projects that were at the pre-launch stage. Then came the Biconomy airdrop in Sept. 2021 where a bug in the code meant some people could receive much larger allocations.&nbsp;","“A couple of my friends made half a million from that error and I’m like, ‘what the hell am I even doing?\" they said.","From that moment on, they couldn’t help but start farming airdrops. They used 100 wallets to make transactions on the Arbitrum network in the hope that they might be eligible for a potential — but unconfirmed at the time — airdrop. They also made sure that these wallets weren’t clearly connected, as this would make it likely they would get excluded from the token distribution.","Auri said these wallets were eligible for the <a href=\"https:\/\/www.theblock.co\/post\/223313\/arbitrum-airdrop-strategy\" data-v-f87c67ca=\"\">airdrop<\/a> but didn’t share how much they made from it (there were multiple levels of rewards depending on certain requirements like transaction volume). The minimum airdrop was 625 tokens, suggesting they received at least 62,500 tokens — worth around $80,000 at launch time.","Auri says they’ve tried to farm between 10-20 projects with potential airdrops. They focus on the larger potential projects, reckoning that smaller ones are more likely to hunt out and remove airdrop farmers. They named Scroll, zkSync, Fuel and StarkNet as projects they’ve targeted. They said they do all of the transactions manually and use centralized exchanges to distribute the funds to wallets without connecting them. That and speaking with other farmers about the best strategies.","“I feel like all of the communities right now are about airdrops. The ones that I'm in, those are like small groups of people that I've met along the way. There’s no alpha in those sorts of groups, honestly. Everything is all so simple and obvious,” said Auri. “It’s all about the scale — that’s it.”","Some argue that a much wider range of projects could have potential airdrops. For instance, Alpha Drops, a website focused on providing information on airdrop farming, has strategies that target around 170 projects.&nbsp;","Alpha Drops founder Aram Barzani, 28, from Erbil, Kurdistan, said he set up the site in May 2022 as a clearer way to make this information available, having previously run a widely shared spreadsheet used by airdrop farmers. He said he saw a community growing around airdrops and soon saw a rapid growth in followers on Twitter.","Barzani said the strategies are mostly based on previous airdrops, especially those that provide clear checklists for how they allocated tokens. He said projects typically reward similar actions — such as transaction volumes or the number of smart contract interactions — and estimated that around 10 to 15% of projects would give out airdrops.","That said, he doesn’t see himself as an airdrop farmer. He will target projects with just a handful of wallets but go for high volumes to maximize hitting the criteria that give multiplier effects. For the Arbitrum airdrop, he made more than 1,000 transactions with around $300,000 in trading volume. This set him back $1,000 in transaction fees and other fees. But he received a $15,000 airdrop, more than making up for the cost.","Barzani is taking a much safer approach by only using a few wallets. That’s because airdrops try to root out airdrop farmers where they can identify them. Typically they look for clusters of wallets that are likely to be connected and eliminate them from the airdrop. This largely started with Hop Protocol’s airdrop in June 2022 and continues to this day — creating a back and forth in cracking down on farmers, forcing them to find new ones to evade detection.","Airdrop farming raises a host of ethical questions — but no clear answers.","In many ways, airdrop farmers simply use the protocols with many wallets when there is typically no public indication or guarantee that there will be an airdrop. If the project chooses to reward them with tokens, that doesn't mean they’ve broken any rules or agreements. That said, it’s typically seen as deliberately exploitative.","“A project is rewarding you for being a real user and wants you to keep using the project. But if you're farming with multiple wallets, you are trying to get the maximum reward from the project, which is supposed to be distributed to the people fairly. I think that's somehow not fair,” said Barzani.","Auri, who is more of a farmer, acknowledged their discomfort with the whole notion of airdrop farming.&nbsp; “For some reason, I do feel inside of me, I do feel a little bit uncomfortable about it, and I feel it is a form of a lie.”","Yet they justified it by claiming that big projects don’t try that hard to get rid of airdrop farmers, speculating that they would rather be too generous than too restrictive and annoy real users (as has happened with previous airdrops like <a href=\"https:\/\/www.theblockcrypto.com\/news+\/124393\/the-delicate-balance-of-getting-a-big-crypto-airdrop-right\" data-v-f87c67ca=\"\">Paraswap<\/a>).&nbsp;","“I don't know, I’ve become more and more cynical about crypto, unfortunately. Before [the Arbitrum airdrop] I was definitely feeling a little bit on the edge. But now, I feel like it's okay,” said Auri. “Like if that's the game that we play then just play the game.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$125,000","content":"MONEY"},{"type":"$400","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"$80,000","content":"MONEY"},{"type":"Alpha Drops","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"$180,000","content":"MONEY"},{"type":"$15,000","content":"MONEY"},{"type":"October 2022","content":"DATE"},{"type":"Aptos","content":"LOCATION"},{"type":"Commonwealth of Independent States","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"$120,000","content":"MONEY"},{"type":"spring","content":"DATE"},{"type":"Barzani","content":"PERSON"},{"type":"Inverse Finance","content":"ORGANIZATION"},{"type":"June 2022","content":"DATE"},{"type":"NFD","content":"ORGANIZATION"},{"type":"Sept. 2021","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"Auri","content":"PERSON"},{"type":"March 2021","content":"DATE"},{"type":"Arbitrum","content":"LOCATION"},{"type":"$1 million","content":"MONEY"},{"type":"Aram Barzani","content":"PERSON"},{"type":"$300,000","content":"MONEY"},{"type":"Erbil","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Kurdistan","content":"LOCATION"}],"hashtag":["APTOS","DAOS","DEXS","ETHEREUM","SCROLL","SUI","ZKSYNC"],"authors":["Tim Copeland","The Block"]}