{"summary":"Cybercriminals are increasingly resorting to hacking servers and devices remotely, forcing them to mine cryptocurrencies and bitcoin without their owners&#x27; knowledge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241339\/cryptojacking-attacks-surged-399-over-past-year-report-finds","publishDate":"2023-07-26T06:01:04","id":12477,"type":null,"title":"Cryptojacking attacks surged 399% over past year, report finds","category":["INFRASTRUCTURE"],"content":["Cybercriminals are increasingly resorting to hacking servers and devices remotely, forcing them to mine cryptocurrencies and bitcoin without their owners' knowledge.","Known as cryptojacking, a report by <a href=\"https:\/\/sonicwall.com\/\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=https:\/\/sonicwall.com\/&amp;source=gmail&amp;ust=1690367691160000&amp;usg=AOvVaw2dLTu4GG-A3wfbmaRY1jvN\" data-v-f87c67ca=\"\">SonicWall<\/a> found the attacks increased globally by 399% over the past 12 months.","\"This nefarious practice has become the new modus operandi for hackers, as organizations increasingly refuse to pay ransoms,\" SonicWall EMEA vice president Spencer Starkey said.","The <a href=\"https:\/\/www.theblock.co\/linked\/141985\/us-government-connects-north-korean-hacking-group-with-last-months-600-million-ronin-exploit\" data-v-f87c67ca=\"\">data suggested<\/a> cybercriminals have also pivoted to this more discrete method because of increased law enforcement activity and heavy sanctions.","“The seemingly endless digital assault on enterprises, governments and global citizens is intensifying, and the threat landscape continues to expand,\" SonicWall CEO Bob VanKirk said. \"Threat actors are relentless, and our data indicates they are more opportunistic than ever, targeting schools, state and local governments, and retail organizations at unprecedented rates.\"","\"The global increase of 399% in cryptojacking attacks has resulted in a greater accumulation of bitcoin by cybercriminals and nation-states,\" Starkey added.","The latest data showed that this type of attack rose 479% over the past year in the UK. In the US, meanwhile, there were 214 million attacks in 2023 alone, an increase of 340%, with the attacks&nbsp;plaguing enterprises, cities, airlines and even schools.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"340%","content":"PERCENT"},{"type":"UK","content":"ORGANIZATION"},{"type":"Starkey","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SonicWall EMEA","content":"ORGANIZATION"},{"type":"Spencer Starkey","content":"PERSON"},{"type":"479%","content":"PERCENT"},{"type":"Bob VanKirk","content":"PERSON"},{"type":"SonicWall","content":"ORGANIZATION"},{"type":"399%","content":"PERCENT"}],"hashtag":["MINING"],"authors":["Brian McGleenon","The Block"]}