{"summary":"Nexus Mutual will deposit $29 million in ETH from its treasury into Maple Finance.\nThe loan will see the DeFi insurer earn an annual yield of at least 9%.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163060\/nexus-mutual-to-invest-29-million-from-its-treasury-funds-into-maple-finance","publishDate":"2022-08-12T06:18:50","id":1247,"type":null,"title":"Nexus Mutual to invest $29 million of treasury funds into Maple Finance","category":["Governance"],"content":["The Nexus Mutual DAO has voted in favor of allocating 15,348 ether (ETH), which currently amounts to $29 million, from the DeFi insurer’s capital pool to earn yield on Maple Finance.","According to details from the voting <a href=\"https:\/\/app.nexusmutual.io\/governance\/view?proposalId=172\" data-v-f87c67ca=\"\">page<\/a>, the vote ended with almost unanimous approval from voters. The level of participation from the DAO was however not enough to reach the required quorum. As such, the Nexus Mutual advisory board’s decision was required to pass the vote.","The vote was based on a <a href=\"https:\/\/forum.nexusmutual.io\/t\/proposal-allocate-capital-to-maple-finance\/835\" data-v-f87c67ca=\"\">proposal<\/a> to invest 10% of the Nexus Mutual treasury into Maple Finance to earn yield. Maple Finance is a DeFi lender that has issued over <a href=\"https:\/\/www.maple.finance\/\" data-v-f87c67ca=\"\">$1.5 billion<\/a> worth of crypto loans <a href=\"https:\/\/www.theblock.co\/post\/105331\/defi-lending-platform-maple-finance-first-17-million-pool\" data-v-f87c67ca=\"\">since its inception in May 2019<\/a>. Nexus Mutual will deploy this capital into the Maven 11 Capital wrapped ETH (WETH) pool on Maple. <a href=\"https:\/\/www.theblock.co\/post\/126080\/maven-11-capital-closes-second-crypto-investment-fund-at-120-million\" data-v-f87c67ca=\"\">Maven 11 is a digital asset firm<\/a> and is one of the pool delegates on Maple Finance.","The reason for this investment is to enable Nexus Mutual to earn yield on its ETH holdings. According to the proposal document, only 20% of the ether in its capital pool is earning interest for the DeFi insurer. This 20% comes from Nexus Mutual’s staked ETH holdings.","Nexus Mutual will earn up to a 9% annual yield on the ether tokens it lends to Maple Finance via the Maven 11 WETH pool. The ETH lending itself will generate a 4% yield while the remaining 5% gains will come from MPL rewards generated from lending tokens on Maple. MPL is Maple’s native token.","According to the proposal, Nexus can earn additional revenue from the MPL rewards. One way to do this would be to sell the MPL rewards to ensure yields stay at a minimum of 9%. Alternatively, Nexus can also stake the MPL to receive staked MPL (xMPL) which can also earn additional yield for the DeFi insurer."],"hashtag":[]}