{"summary":"Genesis is halting digital asset derivatives trading through GGC International, the company said in an email to clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251107\/genesis-no-longer-offering-trading-services-through-any-business-units-memo","publishDate":"2023-09-14T10:59:50","id":12476,"type":null,"title":"Genesis no longer offering trading services through any business units","category":["COMPANIES"],"content":["The digital asset financial firm Genesis is halting digital asset derivatives trading through GGC International, the company said in an email to clients that was reviewed by The Block.&nbsp;","Genesis said the move means it will no longer offers trading services through any of its business entities. It said the decision \"was made voluntarily and for business reasons.\"","\"If you have open derivatives positions with GGCI, these positions will be honored through expiry, and we will support transactions with you that close or help you manage any such open positions,\" Genesis wrote in the email.","The termination will be effective as of Sept. 21 at 5:00 pm ET.&nbsp;","GGCI, owned by Genesis Bermuda Holdco, <a href=\"https:\/\/genesistrading.com\/legal\/regulatory-information#:~:text=GGC%20International%20Limited%20(%E2%80%9CGGCI%E2%80%9D,%E2%80%8D\" data-v-f87c67ca=\"\">facilitated<\/a> the firm's spot trading activity.&nbsp;","Genesis halting its digital asset derivative trading through GGCI comes nearly two weeks after the firm <a href=\"https:\/\/www.theblock.co\/post\/249280\/genesis-global-trading-sunsets-crypto-spot-trading-platform-coindesk\" data-v-f87c67ca=\"\">shuttered<\/a> Genesis Global Trading's over-the-counter platform on Sept. 5.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GGC International","content":"ORGANIZATION"},{"type":"Sept. 21","content":"DATE"},{"type":"5:00","content":"TIME"},{"type":"Genesis Bermuda Holdco","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"Sept. 5","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","Frank Chaparro","The Block"]}