{"summary":"Ronin, the blockchain network tied to the popular play-to-earn game Axie Infinity, suffered an exploit last week resulting in the loss of more than $600 million worth of crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit","publishDate":"2022-03-29T11:57:11","id":12482,"type":null,"title":"Axie Infinity&#x27;s Ethereum sidechain Ronin hit by $600 million exploit","category":["DEFI"],"content":["Ronin, the blockchain network tied to the popular play-to-earn game Axie Infinity, suffered an exploit last week resulting in the loss of more than $600 million worth of crypto.","<a href=\"https:\/\/roninblockchain.substack.com\/p\/community-alert-ronin-validators?s=w\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">In a blog post<\/a>, developers said that the exploit – which took place on March 23 but was discovered earlier Tuesday – resulted in the loss of 173,600 ETH (worth roughly $590 million at current prices) and 25.5 million worth of the stablecoin USDC. Specifically, five out of nine validators on the Ronin network were attacked and controlled during the incident. Validators serve a number of purposes, including the creation of transaction blocks and the updating of data oracles.","As the team explained:","\"Five validator private keys were hacked; 4 Sky Mavis validators and 1 Axie DAO. The validator key scheme is set up to be decentralized so that it limits an attack vector such as this, but the attacker found a backdoor through our gas-free RPC node, which they abused to get the signature for the Axie DAO validator. This traces back to November 2021 when the Axie DAO validator was allowlisted to distribute free transactions. This was discontinued in December 2021, but the Axie DAO validator IP was still on the allowlist.\"","\"Once the attacker got access to Sky Mavis systems they were able to get the signature from the Axie DAO validator by using the gas-free RPC,\" the post explained. Once those nodes were controlled, the attacker gained the ability to drain funds from the Ronin bridge. Bridges are software mechanisms for moving funds between blockchains.","Ronin was created by Sky Mavis, the developer of Axie Infinity. The blog post said that Sky Mavis \"discovered the security breach on March 29th, after a report that a user was unable to withdraw 5k ETH from the bridge.\"","Per the post, the majority of the funds are being held in this <a href=\"https:\/\/etherscan.io\/address\/0x098b716b8aaf21512996dc57eb0615e2383e2f96\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Ethereum addres<\/a>s. Etherscan has flagged the address as \"reported to [be] involved in a hack targeting the Ronin bridge.\"","\"We are working directly with various government agencies to ensure the criminals get brought to justice,\" the team said. \"We are in the process of discussing with Axie Infinity \/ Sky Mavis stakeholders about how to best move forward and ensure no users' funds are lost.\"","<em data-v-f87c67ca=\"\">This is a developing story and will be updated as more information becomes available.&nbsp;<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 29th","content":"DATE"},{"type":"Axie DAO","content":"ORGANIZATION"},{"type":"Axie Infinity \/ Sky Mavis","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"RPC","content":"ORGANIZATION"},{"type":"Mavis \"","content":"PERSON"},{"type":"March 23","content":"DATE"},{"type":"$590 million","content":"MONEY"},{"type":"December 2021","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ethereum addres<\/a>s. Etherscan","content":"LOCATION"},{"type":"Sky Mavis","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"Mavis","content":"PERSON"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}