{"summary":"The majority of Bitcoin ATMs are in the US, where growth has slowed to a crawl. But more ATMs are popping up in other countries.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200089\/bitcoin-atm-installations-flatline","publishDate":"2023-01-09T12:36:12","id":12481,"type":null,"title":"Bitcoin ATM installations flatline as crypto winter bites","category":["CRYPTO ECOSYSTEMS"],"content":["The growth of new bitcoin ATMs globally has essentially flatlined, with little progress since July 2022 — when bitcoin collapsed from all-time highs and fell as low as $23,000.","The number of bitcoin ATMs around the world is now 38,641, according to <a href=\"https:\/\/coinatmradar.com\/charts\/growth\/\" data-v-f87c67ca=\"\">Coin ATM Rader<\/a>. Although that’s up from 14,051 at the start of 2021, there has been little growth since the crypto market collapsed last year.&nbsp;","<span data-v-f87c67ca=\"\">The number of Bitcoin ATMs around the world. Image: Coin ATM Radar.<\/span>","While the majority of ATMs are in the U.S., where growth has subsided, a few other countries are still seeing some increases. There are 100 more ATMs in Europe since the start of last year, 430 more in Canada, 50 in Spain, 30 in Poland and 190 in Australia.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$23,000","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Australia","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Spain","content":"LOCATION"},{"type":"Poland","content":"LOCATION"},{"type":"Coin ATM Rader","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"the U.S.","content":"LOCATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Tim Copeland","The Block"]}