{"summary":"Leibowitz et al. v. iFinex et al., case 1:19-cv-09236, U.S. District Court, S.D.N.Y. There&#x27;s a passage in Hunter S. Thompson&#x27;s Fear &amp;amp; Loathing on the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42528\/fear-and-loathing-on-the-blockchain-liebowitz-et-al-v-ifinex-et-al","publishDate":"2019-10-08T17:38:22","id":1248,"type":null,"title":"Fear and Loathing on the Blockchain: Leibowitz et al. v. iFinex et al.","category":["BITCOIN"],"content":["<b data-v-f87c67ca=\"\">Leibowitz et al. v. iFinex et al.,&nbsp;<\/b>case 1:19-cv-09236, U.S. District Court, S.D.N.Y. [<a href=\"https:\/\/www.courtlistener.com\/recap\/gov.uscourts.nysd.524076\/gov.uscourts.nysd.524076.1.0.pdf\" data-v-f87c67ca=\"\">PDF<\/a>]","The claims made by the plaintiffs are spectacular. The plaintiffs allege unlawful market manipulation, principal-agent liability for market manipulation, aiding and abetting market manipulation, unlawful competition contrary to the Sherman Act, racketeering constituted by, among other things, operating an unlicensed money transmitting business, money laundering, and bank and wire fraud. Also named as co-defendants are Bitfinex senior executives and entities and persons implicated in the Department of Justice investigation into Crypto Capital Corp, an alleged international money laundering scheme which appears to have been truly immense in size.","Whether these claims are true or not is a matter for a New York jury to decide. What matters from our perspective, here and now, is (a) whether the claims are pleaded well enough to survive a 12(b)(6) dismissal for failure to state a claim (as this case was filed in federal court) and (b) how disclosures made in this case will shed light on Bitfinex\/Tether's operations, and other investigations of those operations, as the discovery process progresses.","Now that the complaint has been filed, assuming it will be properly served on all defendants, the next step in this litigation is for Bitfinex et al. to either file an answer or immediately file a motion to dismiss. In particular, we should look for Bitfinex et al. to challenge these pleadings under FRCP Rule 12(b)(6), failure to state a claim upon which relief can be granted, as \"a plaintiff’s obligation to provide the 'grounds' of his 'entitle[ment] to relief' requires more than labels and conclusions, and a formulaic recitation of the elements of a cause of action will not do.'\"&nbsp;<i data-v-f87c67ca=\"\">Bell Atlantic v. Twombly, 550 U.S. 544<\/i> (2007). In other words, you gotta provide some factual specificity. &nbsp;","Perhaps anticipating this, the allegations set out in the (95-page) complaint are given together with an unusually thorough factual background, and they tell the story of the entire 2017-18 cryptocurrency bubble and collapse through the lens of a keen-eyed detective who needs to get the court from zero to pro on all things cryptocurrency in a matter of pages. This is done expertly. After setting out a high-level, attention-grabbing summary that explains that \"Tether's mass issuance of USDT created the largest bubble in human history\" and that \"[i]n a brash display of lawlessness, Tether and Bitfinex continue to defraud the market,\" the complaint details Bitfinex's operations and structure, Tether, and the history of Tether's representations that it is constantly backed by U.S. dollars.","The complaint then digs into ancient Bitcoin history to explain how the cryptocurrency markets are uniquely susceptible to manipulation \"[underscoring how control over an exchange and the opportunity to make trades with non-existent money allowed a single individual to dramatically influence cryptocurrency prices,\" before embarking on a detailed treatment of how \"Bitfinex and Tether [allegedly] leveraged USDT and their control of the Bitfinex exchange to inflate one of the largest bubbles in history.","The complaint continues by exploring Bitfinex\/Tether's issues with access to the banking system, pointing out that while \"access to the U.S. financial system was an essential component\" of the scheme, \"conventional banks began shutting Tether and Bitfinex accounts down for money laundering and other compliance issues and \"Tether and Bitfinex [allegedly] became even more enmeshed with Crypto Capital,\" a firm which has been shut down by the U.S. Department of Justice, and allegedly began \"a complicated shell game of money laundering\" despite the fact that \"[s]tatements made by Bitfinex and Tether in that lawsuit underscore just how essential U.S. correspondent access was to their operations, and how losing it should have stopped their ability to operate and issue USDT.\"","\"Bitfinex and Tether were so desperate to access the U.S. financial system and U.S. dollars,\" the plaintiffs allege, \"that they were directing funds to Crypto Capital despite its clear connection to money laundering, account seizures, and an inability to move funds out.\" Despite these banking issues, the plaintiffs further allege that \"[i]n the short span of less than one month after Bitfinex and Tether closed the door to potential new market entrants, Tether issued more than 1 billion new USDT, all of which was supposed to be backed by U.S. dollars in bank accounts the Tether refused to disclose or audit.\"","The complaint continues by providing the Court with notice of the ongoing investigation into Bitfinex's operations by the Attorney General of the State of New York, in relation to which the plaintiffs further allege that disclosures arising in that investigation, \"[I]f were was (sic) any doubt before, it's now absolutely clear that Tether no longer has cash reserves to back USDT at a 1:1 ratio.\"","As a result of the facts laid out, the plaintiffs allege that Bitfinex is civilly liable to them for losses suffered in the cryptocurrency markets as a result of Bitfinex's \"Bank Fraud[,] Money Laundering[,] Monetary Transactions Derived from Specified Unlawful Activities[,] Operating an Unlicensed Money Transmitting Business[,] and Wire Fraud[.]\"","So what do we take away from this? To start, it is entirely possible that these allegations are untrue and Bitfinex and co. are veritable paragons of compliance and moral virtue. In the alternative, it's possible that every word of the complaint is true.","We just don't know.","What we do know is that the Bitfinex operation is under investigation from several angles and this new one is yet another straw on the proverbial camel's back. From my review of the pleadings, it seems to me that the plaintiffs' claims are backed by a sufficient factual basis that they will survive a 12(b)(6) motion to dismiss.","Being a civil case, protections Bitfinex might be able to rely on in other contexts, such as the Fourth Amendment in any criminal action, arguing that the Martin Act doesn't confer jurisdiction over Bitfinex's activities, or arguing that an administrative subpoena served on it by the New York Attorney General is overbroad, won't apply here. Discovery has the potential to be broader and deeper than Bitfinex has shown, to date, that it is comfortable with. The consequence of defaulting could be financially catastrophic. The burden of proof is lower, too, than it would be with a criminal case (balance of probabilities rather than beyond a reasonable doubt).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Leibowitz","content":"PERSON"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Bell Atlantic v. Twombly","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"18","content":"DATE"},{"type":"Crypto Capital","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Crypto Capital Corp","content":"ORGANIZATION"},{"type":"2007","content":"DATE"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Bitfinex\/Tether","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"the State of New York","content":"ORGANIZATION"}],"hashtag":[],"authors":["Preston Byrne","The Block"]}