{"summary":"The move means WazirX and Binance users won’t be able to use the off-chain option to send crypto between the two entities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162188\/binance-wazirxdisables-off-chain-transfers","publishDate":"2022-08-08T13:33:15","id":12480,"type":null,"title":"Binance disables off-chain transfers between itself and WazirX","category":["EXCHANGES"],"content":["Crypto exchange Binance will no longer support off-chain fund transfers between itself and WazirX as the relationship between the two firms sours.","The move, <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/f9fd6936e5264206a71c898f8a36f29e\" data-v-f87c67ca=\"\">announced<\/a> Monday, will take effect on August 11. It will mean WazirX and Binance users won’t be able to use the off-chain fund transfer option to deposit and withdraw crypto on the two platforms. Off-chain transactions occur outside of a blockchain network and are handled using a mechanism similar to that used on payment platforms.","On-chain deposit and withdrawal options between Binance and WazirX, however, will continue to work.","Binance's move comes as it continues to distance itself from WazirX, an Indian crypto exchange it once announced acquiring. After WazirX had its funds seized by Indian authorities last week, Binance said that it never completed the acquisition.","On Friday, India's Enforcement Directorate (ED), a law enforcement agency that investigates financial crimes, <a href=\"https:\/\/www.theblock.co\/post\/161727\/wazirx-bank-balances-frozen-ed-binance-crypto-exchange\" data-v-f87c67ca=\"\">froze<\/a> bank balances worth 647 million rupees (around $8 million) belonging to WazirX. ED is probing WazirX for its alleged money laundering role linked to Chinese loan apps that were involved in digital lending in India.","After the ED news broke, there was <a href=\"https:\/\/www.theblock.co\/post\/161907\/wazirx-ownership-row-enters-second-day-as-binance-ceo-calls-out-deception\" data-v-f87c67ca=\"\">a public debate<\/a> between Binance CEO Changpeng Zhao and WazirX founder Nischal Shetty over who owns WazirX. Zhao said Binance does not own WazirX and only purchased certain assets and intellectual property of WazirX. Shetty said Binance is the owner of WazirX.","\"Fact: we asked for transferring of WazirX system source code, deployment, operations, as recently as Feb this year. This was refused by WazirX. Binance do NOT have control on their systems. WazirX has been uncooperative with us, and looks like uncooperative with ED as well,\" Zhao said Saturday <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1555844644491202561?s=20&amp;t=Fv39-LsiSAfcRtGKGtLJ3g\" data-v-f87c67ca=\"\">on Twitter<\/a>.","Binance has said that WazirX is still operated and managed by Zanmai Labs, an Indian entity owned by Shetty and his co-founders. Zanmai has license from Binance to operate Indian rupee-crypto pairs in WazirX and Binance operates crypto to crypto pairs, according to Shetty.","\"In Feb, Binance team wanted control of Zanmai Naturally, if Binance desires control of Zanmai, they can acquire shares,\" Shetty <a href=\"https:\/\/twitter.com\/NischalShetty\/status\/1555903258794811393?s=20&amp;t=sB_hX_kU--aEyAkKQp1MhA\" data-v-f87c67ca=\"\">tweeted<\/a> Saturday, adding: \"Zanmai labs has been co-operating with ED from over 7 days and has submitted all the required data. We’ll continue to cooperate.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zanmai","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"August 11","content":"DATE"},{"type":"Enforcement Directorate (ED)","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Nischal Shetty","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"Zanmai Labs","content":"ORGANIZATION"},{"type":"Zanmai Naturally","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Shetty","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}