{"summary":"HKEX Synapse aims to create more efficient post-trade workflows with added transparency, efficiency and lower settlement risk.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254847\/hong-kong-exchanges-and-clearing-launches-daml-based-settlement-platform","publishDate":"2023-10-04T17:16:52","id":12499,"type":null,"title":"Hong Kong firm launches DAML-based settlement platform","category":["MARKETS"],"content":["Hong Kong Exchanges and Clearing Limited, a publicly traded market operator, is launching a blockchain-based settlement platform.","HKEX Synapse aims to boost operational efficiencies, lower settlement risks and bolster transparency by using smart contracts to augment post-trade workflows. It's part of a market access program connecting markets in <a href=\"https:\/\/www.theblock.co\/post\/252704\/hong-kong-to-disclose-crypto-license-applicants-in-wake-of-jpex-probes\" data-v-f87c67ca=\"\">Hong Kong<\/a> and mainland China called Stock Connect.","HKEX Synapse will launch on Oct. 9, according to a <a href=\"https:\/\/www.hkex.com.hk\/News\/News-Release\/2023\/231004news?sc_lang=en\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","“We are delighted to launch HKEX Synapse, a major enhancement to our Stock Connect infrastructure that will support the next phase of growth for international participation in Mainland China’s equity markets,\" Glenda So, HKEX Group Head of Emerging Business and FIC, said in a statement.","\"This technology-empowered platform will not only improve post-trade efficiencies, but will, over time, build a better, stronger ecosystem, supporting both market growth and investor growth strategies,\" So continued.","HKEX Synapse uses the open-source smart contract language <a href=\"https:\/\/www.theblock.co\/linked\/102464\/digital-asset-120-million-series-d\" data-v-f87c67ca=\"\">DAML<\/a>, which can synchronize data across blockchains and centralized databases.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Glenda So","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Mainland China","content":"LOCATION"},{"type":"HKEX Group Head of Emerging Business","content":"ORGANIZATION"},{"type":"FIC","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Oct. 9","content":"DATE"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}