{"summary":"Wemade’s net loss expanded to 189.5 billion won ($142.6 million) in the fourth quarter of last year from 74.4 billion won in the same period of 2022, its earnings report showed.","author":["Danny Park","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276168\/wemade-shares-q4-losses","publishDate":"2024-02-06T05:39:24","id":1249,"type":null,"title":"Wemade shares fall after it reports widening Q4 losses","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">South Korean Web3 game developer Wemade reported widening operating and net losses in the fourth quarter of last year, according to its latest earnings report.<\/span>","<span data-v-f87c67ca=\"\">The Kosdaq-listed firm announced on Tuesday that its net loss expanded to 189.5 billion won ($142.6 million) in the fourth quarter from 74.4 billion won in the same period of 2022, the <\/span><a href=\"https:\/\/dart.fss.or.kr\/dsaf001\/main.do?rcpNo=20240206900738\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">report<\/span><\/a><span data-v-f87c67ca=\"\"> showed.<\/span>","<span data-v-f87c67ca=\"\">The company recorded 70.8 billion Korean won in operating losses in the fourth quarter of 2023, compared to 28.7 billion won in the same period of the previous year. In the fourth quarter of last year, Wemade generated 118.4 billion won in sales, up 2.8% year-on-year.<\/span>","<span data-v-f87c67ca=\"\">Wemade’s stock closed down 2.25% at 49,950 won on Tuesday, according to its <\/span><a href=\"https:\/\/www.wemade.com\/IrEn\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">website<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The gaming firm told local news agency <\/span><a href=\"https:\/\/www.yna.co.kr\/view\/AKR20240206149751527?input=1195m\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Yonhap<\/span><\/a><span data-v-f87c67ca=\"\"> that the sales growth was fueled by the domestic launch of its game Night Crows and the licensing agreement for its “MIR” franchise. However, the firm saw widening operating losses due to rising sales-related and labor costs. Losses from stock investments by affiliated companies and decreased value of convertible bonds derivatives also contributed to the expansion of net losses, the company reportedly said.<\/span>","<span data-v-f87c67ca=\"\">The company launched its <\/span><a href=\"https:\/\/www.theblock.co\/post\/189787\/korean-exchanges-delist-wemade-native-token-wemix\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">native utility token WEMIX<\/span><\/a><span data-v-f87c67ca=\"\"> via its blockchain subsidiary Wemade Tree in 2020 after shifting its focus from video games to Web3 gaming. It has since pushed out its own mainnet and stablecoin.<\/span>","<span data-v-f87c67ca=\"\">Wemade is scheduled to hold its quarterly earnings call on Wednesday in Asia to disclose more details on its 2023 performance and upcoming plans for this year.<\/span>","<span data-v-f87c67ca=\"\">Wemade did not immediately respond to The Block’s request for comment.<\/span>"],"hashtag":["GAME"]}