{"summary":"The benefits of security tokens (also known as “digital securities,” “smart securities” or “programmable securities”) for issuers and investors have been written about at length. However, the benefits described often confuse the benefits of crowdfunding and other existing market dynamics with those of security tokens. In this article, we will attempt to provide clarity around the benefits of security tokens issued by private companies relative to the current market for private securities and misconceptions around security tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/16059\/security-tokens-misconceptions-and-benefits","publishDate":"2019-03-15T12:20:29","id":12497,"type":null,"title":"Security tokens: Misconceptions and Benefits","category":["SECURITY TOKEN"],"content":["The benefits of security tokens (also known as “digital securities,” “smart securities” or “programmable securities”) for issuers and investors have been written about at length. However, the benefits described often confuse the benefits of crowdfunding and other existing market dynamics with those of security tokens. In this article, we will attempt to provide clarity around the benefits of security tokens issued by private companies relative to the current market for private securities and misconceptions around security tokens.","<strong data-v-f87c67ca=\"\">#1: Security tokens give access to a global pool of capital. <\/strong>Access to capital from around the world was available for a long time before security tokens. As remains the case with sales of security tokens, investment documents are prepared and circulated to investors who sign them electronically. Laws are what permit more or less access to global capital and determine from which jurisdictions around the world issuers can raise capital. U.S. companies have been able to raise capital globally under Regulation S for decades. Most non-U.S. jurisdictions have similar laws that permit (or do not prohibit) capital to be raised globally. The sale of security tokens has not extended the reach of companies to raise capital outside of the jurisdiction of their incorporation.","<em data-v-f87c67ca=\"\">Security tokens are not what make it possible or even more efficient to raise capital globally. <\/em>","<strong data-v-f87c67ca=\"\">#2: Security tokens allow companies to sell securities to U.S. non-accredited investors.<\/strong> Securities laws are the only thing stopping companies from raising capital from non-accredited investors. Selling security tokens does not change those laws. Just as before the emergence of security tokens, the only way U.S. companies can sell securities to U.S. non-accredited investors in a general solicitation is through a registered offering (e.g., an IPO) or an exempt offering (e.g., Regulation A+, Rule 506(c) or Regulation CF). Companies can also sell securities to non-U.S., non-accredited investors under Regulation S so long as the sale is permitted in the jurisdiction where the person resides.","<em data-v-f87c67ca=\"\">Security tokens are not what makes it possible or even more efficient to raise capital from U.S. non-accredited investors. <\/em>","<strong data-v-f87c67ca=\"\">#3: Security tokens enable 24\/7 trading of private securities. <\/strong>Private securities could always be traded 24\/7. Two people could meet for coffee at midnight, sign transaction documents and pay and receive payment for the private securities. There is no doubt that transacting in that manner is slow and inefficient, but it could be done 24\/7. Conversely, when public companies begin to issue security tokens, subject to potentially problematic regulations of exchanges and exchange rules, we should begin to see 24\/7 trading of public securities, which was not previously possible because intermediaries could not make the transactions happen at all hours of the day.","<em data-v-f87c67ca=\"\">Security tokens are not what make it possible to trade private securities 24\/7. <\/em>","<strong data-v-f87c67ca=\"\">#4: Security tokens reduce the cost of issuing securities. <\/strong>The issuance of securities, whether it be traditional off-chain securities in tokenized form or native on-chain securities, will not be cheaper. Legal documents, such as private placement memoranda and purchase agreements, along with advisor fees, such as for legal and tax advice and broker-dealer placement agents, will not change. In the short term, those fees have been and will continue to be higher than with traditional securities. In the long term, those fees will be the same as for offerings of securities in their traditional form unless regulators determine less disclosure is required, which is highly unlikely.","<em data-v-f87c67ca=\"\">Security tokens are not currently resulting in reduced issuance costs. <\/em>","<strong data-v-f87c67ca=\"\">#5 Security tokens create liquidity for private securities. <\/strong>Private securities can already trade in secondary markets but the necessary infrastructure for that trading has never been developed in the same way it is currently being developed for security tokens. For example, buy and sell orders of traditional securities could be matched on an alternative trading system, which is the same type of “exchange” used for security tokens. However, because of other market factors and investor interest, that infrastructure was never fully developed to create a robust market in private securities.","<em data-v-f87c67ca=\"\">Security tokens are not what creates liquidity for private securities.<\/em>","<strong data-v-f87c67ca=\"\">#6: Security tokens enable fractional ownership of real-world assets. <\/strong>Real-world assets can already be fractionalized simply using a few pieces of paper that state what percentage of an asset each person owns. A perfect example is when people hold real estate as tenants in common, which is a form of ownership in which multiple people own a direct interest in the real estate. In addition, although it is atypical, fractional shares of stocks are permitted in most jurisdictions. Thus, fractional ownership of real-world assets is currently possible but inefficient.","<em data-v-f87c67ca=\"\">Security tokens are not what enables fractional ownership of real-world assets.<\/em>","<strong data-v-f87c67ca=\"\">#1: Security tokens will enable greater liquidity than traditional securities. <\/strong>Although security tokens do not create liquidity for private securities, they do enable increased liquidity. This is due to the frictionless transfer of security tokens and potential for removal of intermediaries that are either currently necessary or convenient in connection with a transfer of traditional securities. Before liquidity in security tokens increases, several pieces of infrastructure are required, some of which are far along in development and use, and others that do not appear to be focused on much by the community.","<strong data-v-f87c67ca=\"\">#2: Security tokens will enable the more efficient and cost-effective transfers of fractional interests in real-world assets. <\/strong>When anyone currently wants to sell a fractional interest in a real-world asset, it is a slow, time consuming and expensive process. When combined with the potential greater liquidity of security tokens, the transfer of fractional interests through security tokens will be much more cost-effective and efficient. It will make what used to be a nonviable option both viable and common, which will unlock greater value than currently exists in fractional interests of real-world assets.","<strong data-v-f87c67ca=\"\">#3: Security tokens will ensure greater compliance with laws. <\/strong>Securities and other laws around the world are highly complex when dealing in financial instruments like securities. Some of them allow secondary trading of private securities, others do not. Some of them require time to pass before secondary trading of private securities is permitted, others do not. Some of them put limits on who can sell private securities and how much of them can be sold in secondary markets, others do not. With smart contracts coded with the applicable securities and other compliance requirements globally governing the trading of security tokens, companies can ensure that their securities are always trading in compliance with applicable laws.","<strong data-v-f87c67ca=\"\">#4: Security tokens will enable more efficient cross-border trading. <\/strong>Cross-border trading of securities has always been expensive and time-consuming because each individual seller and buyer hires legal counsel and other parties to enable the trade to ensure compliance with laws and avoid fraud. With smart contracts governing the compliance functions of security tokens and ensuring receipt of payment for the securities, those tokens can flow cross-border seamlessly with the costs of compliance being spread across all market participants by the companies building the smart contracts used to govern trading.","<strong data-v-f87c67ca=\"\">#5: Security tokens will enable better cap table management. <\/strong>Cap table management is recognized as one of the biggest issues facing early-stage companies. Although solutions like Carta have facilitated cap table management, reducing costs and increasing accuracy, managing a company’s cap table still takes more time than anyone would like to spend on it. Security tokens provide a definite picture of a company’s cap table with all changes to the cap table automatically occurring upon transfers of the security tokens. Although it is surprising, the same benefits exist with public securities because the massive number of intermediaries handling book entries for the securities, which often are inaccurate or delayed in ways that are problematic for companies and investors.","<strong data-v-f87c67ca=\"\">#6: Security tokens will facilitate better corporate governance.<\/strong> Governance of companies with securities trading in secondary markets (which has commonly been public securities) but is becoming more common in private securities results in low stockholder engagement because stockholders generally hold their stock beneficially (i.e., indirectly). When companies hold votes on important matters, the beneficial holders of stock do not participate, except through the direct record holders of the stock, which is inefficient and results in lower participation by the real “owners” of the stock. In addition, record holders have been known to make mistakes when acting on behalf of beneficial holders of stock. Security tokens allow for an efficient way for investors to hold stock as record holders and be more actively engaged in stockholder decisions. In addition, in the future, security tokens will enable on-chain voting for corporate decisions, which will increase the accuracy of the historically problematic voting process.","<strong data-v-f87c67ca=\"\">#7: Security tokens will enable more efficient and transparent payment of distributions. <\/strong>Payments of distributions can be made with cryptocurrencies, stablecoins being an especially good option. The current process of mailing checks to stockholders when they receive distributions from companies is inefficient. At times, the amount of the check is less than it costs more to mail it. Beyond that issue, it is not logical to incur the cost and time involved with mailing checks when better solutions exist (and current better solutions are often not more cost effective than mailing checks). As confidence in stablecoins grows, the payment of distributions using stablecoins directly to the wallet in which investors hold their security tokens will make for much more efficient and cost-effective distributions. An even more obvious benefit is payments on debt, which can be increased in frequency and automated. In addition, with time, covenants could be required in loan documents for stablecoins on a transparent blockchain to be set aside in a wallet daily to ensure that the company behind the debt has the capital required to make payments on the debt, and creditors could tell immediately if the debtor is behind on its obligations.","<strong data-v-f87c67ca=\"\">#8: Security tokens will make it easier to include utility in securities. <\/strong>Although utility is not a core function or focus of security tokens, there is a benefit to embedding security tokens with utility. The value of security tokens in the hands of some investors who value the utility of the token may be higher than in the hands of others who do not. For example, if a security token gives holders discounts on products, then users of those products will pay more for those tokens than non-users. Of course, this is technically feasible without security tokens, but it will become much more seamless and efficient with them.","In some cases, the benefits set out above are realistic and achievable immediately. In most cases, the benefits are more aspirational and will be achieved with time. Even excluding the many misconceptions regarding the benefits of security tokens, the actual benefits that will be achieved through security tokens are game-changing for both public and private securities.","<em data-v-f87c67ca=\"\">Marc Boiron is a partner in the Fintech and Blockchain practice group of FisherBroyles. He advises clients on legal matters relating to blockchain technology, cryptocurrencies and security tokens.<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Disclaimer<\/strong>: This article does not constitute or substitute for legal advice or reading the rules and regulations we have summarized. In any particular case, you should consult with lawyers with experience on the topic of this article. Depending on your specific situation, answers other than those outlined in this article may be appropriate. Your use of this article alone creates no attorney-client relationship between you and FisherBroyles, LLP. Do not include confidential information in comments to or other feedback on this article, as these are neither confidential nor secure methods of communicating with us.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"midnight","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Marc Boiron","content":"PERSON"},{"type":"LLP","content":"ORGANIZATION"},{"type":"Carta","content":"ORGANIZATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}