{"summary":"Meta’s Reality Labs, the company’s metaverse-focused business, reported a $2.9 billion loss in the first quarter of 2022.\nZuckerberg said one near-term focus will be on helping creators make money in Horizon Worlds, its social VR platform.","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/143883\/zuckerberg-projects-confidence-despite-lack-of-profit-from-metaverse-project","publishDate":"2022-04-27T19:07:25","id":125,"type":null,"title":"Zuckerberg projects confident despite lack of profit for Reality Labs","category":["Startups"],"content":["Reality Labs, Meta’s business focused on building a virtual world where users can socialize, work, and play, is not yet profitable. But it is laying the groundwork for an “exciting 2030s,” said Meta CEO Mark Zuckerberg, in today’s after-hours earnings call.","Reality Labs <a href=\"https:\/\/www.theblockcrypto.com\/linked\/143867\/meta-says-its-metaverse-focused-unit-reality-labs-lost-2-9-billion-in-q1-2022?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">reported a loss of $2.9 billion<\/a> in the first quarter of 2022. \"I recognize it’s expensive to build this, it’s something that’s never been built before. And it’s a new paradigm for computing and social connection,\" Zuckerberg said.","\"So, over the next several years our goal from a financial perspective is to generate sufficient operating income growth from Family of Apps to fund the growth of investment in Reality Labs, while still growing our overall profitability.\"","One near-term focus, Zuckerberg said, will be on building out better hardware and Horizon Worlds, the company's latest social VR product, to help creators make money. Meta stirred controversy earlier this month when it said <a href=\"https:\/\/www.theblockcrypto.com\/post\/142001\/meta-begins-to-allow-sale-of-digital-goods-on-horizon-taking-nearly-half-in-transaction-fees\" data-v-f87c67ca=\"\">it would take nearly half of the earnings of any items sold on Horizon<\/a> as transaction fees.","“Our other focus for Horizon is building out the metaverse economy, and helping creators make a living working in the metaverse,\" said Zuckerberg. \"We expect to be meaningfully better at monetization than others in the space, and we expect that should become a sustainable advantage for our platforms as they develop.\"","On the hardware side, the company is working on developing virtual reality headsets. It is scheduled to release a higher-end VR headset, codenamed Project Cambria, later this year. That headset will be designed specifically for work use cases and eventually “replacing your laptop and work set up,” according to Zuckerberg. The hardware devices will also feature eye tracking and face tracking so users can make good eye contact in the virtual world.","Earlier this year, Meta Platforms lost over $250 billion in market value after a disappointing fourth quarter and first quarter outlook. Shares crashed around 26% when the company reported that daily active users fell by one million, due to increased competition from short-form video app TikTok.","The company has seen slowed growth in 2022, because of privacy changes to Apple’s iOS operating system that have made it hard to both target advertising to users and measure the outcome of those ads on the platform.","Meta stock soared after hours on earnings, up 17.5% in late trading."],"hashtag":["EARNINGS"]}