{"summary":"In 2004, Harvard University drop-out Mark Zuckerberg launched Facebook, a dorm-built site that would trigger and drive the social-media revolution.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/27667\/facebook-libra-cryptocurrency-calibra-launch","publishDate":"2019-06-18T05:00:14","id":12502,"type":null,"title":"Facebook releases plan for its Libra cryptocurrency to &#x27;meet the daily financial needs of billions of people&#x27;","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">In 2004, Harvard University drop-out Mark Zuckerberg launched <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37740\/facebooks-libra-documents-are-very-vague-says-switzerland-central-bank-official\" data-v-f87c67ca=\"\">Facebook<\/a>, a dorm-built site that would trigger and drive the social-media revolution. Fifteen years later, Zuckerberg’s <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37721\/facebook-hires-yet-another-lobbyist-for-libra-crypto-this-time-a-former-coinbase-executive-to-lead-the-efforts\" data-v-f87c67ca=\"\">Facebook<\/a> is hoping to jump-start a new revolution with its own cryptocurrency, finally revealing its plans in detail today.<\/span>","<span data-v-f87c67ca=\"\">It remains to be seen if <a href=\"https:\/\/www.theblockcrypto.com\/linked\/36637\/us-lawmakers-to-visit-switzerland-to-discuss-facebooks-libra-crypto-project\" data-v-f87c67ca=\"\">Facebook’s<\/a> cryptocurrency, <a href=\"http:\/\/libra.org\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Libra<\/a>, will have the same impact as its social network, but there’s no doubt this is one of the most noteworthy moves to date from a mainstream Fortune 100 company in the nascent digital assets market. <\/span>","<span data-v-f87c67ca=\"\">Libra is just part of the picture. Backed by a basket of currencies and government bonds, Libra will be part of a broader ecosystem, a new financial infrastructure <a href=\"https:\/\/www.theblockcrypto.com\/linked\/37430\/at-least-3-members-considering-cutting-ties-with-facebooks-libra-project-report\" data-v-f87c67ca=\"\">Facebook<\/a> hopes will play a role in the transformation of the lives of billions of people. Libra itself, and the network underpinning it, are set to launch in 2020. <\/span>","<span data-v-f87c67ca=\"\">“Libra holds the potential to provide billions of people around the world with access to a more inclusive, more open financial ecosystem,” said David Marcus, the Facebook executive at the helm of its cryptocurrency operation, Calibra, a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41045\/facebooks-david-marcus-justifies-building-a-payments-network-on-blockchain-instead-of-traditional-banking-system\" data-v-f87c67ca=\"\">Facebook<\/a> spin-out aimed at building solutions and products related Libra. <\/span>","<strong data-v-f87c67ca=\"\">Better than bitcoin?<\/strong>","<span data-v-f87c67ca=\"\">Following in the footsteps of Ethereum, Tezos, and the myriad offerings in the cryptocurrency landscape, at the heart of Libra is the Libra Association, a Switzerland-based organization that oversees the currency's development and its network's maintenance. The governance structure isn’t unique to the crypto world, but its inaugural members — each of which will have their own node granting them access to the network — include heavy hitters like Uber, PayPal, Visa, and Andreessen Horowitz. By the time Libra network fully launches, the association hopes to have 100 members, according to its white paper. <\/span>","<span data-v-f87c67ca=\"\">Founding members had to meet strict guidelines in line with its Evaluation Criteria. For instance, crypto hedge funds had to have an AUM above $1 billion while digital asset-focused custodians had to store at least $100 million. Non-crypto firms needed to have a market cap of more than $1 billion or boast customer balances equaling more than $500 million. A source familiar with <a href=\"https:\/\/www.theblockcrypto.com\/linked\/40576\/facebook-acquires-chatbot-maker-for-calibra-wallet\" data-v-f87c67ca=\"\">Facebook’s<\/a> ambitions said it was originally looking to involve Wall Street institutions such as Goldman Sachs and JPMorgan, but it was unable to secure their interest. JPMorgan announced the launch of its own settlement JPM Coin in February. <\/span>","","","<span data-v-f87c67ca=\"\">As for its network design, Libra <\/span><span data-v-f87c67ca=\"\">will start off on a permissioned blockchain, meaning only members of the Libra Association will be permitted to run the validator hardware required to participate in the consensus process. This is akin to the private blockchain instantiations supported by enterprise-focused firms like R3 and ConsenSys Solutions. <\/span><span data-v-f87c67ca=\"\">In Facebook's view, permissionless systems like Bitcoin are not ready for the big leagues — for now.<\/span>","<span data-v-f87c67ca=\"\">“The challenge is that as of today we do not believe that there is a proven solution that can deliver the scale, stability, and security needed to support billions of people and transactions across the globe through a permissionless network,” the whitepaper notes, conservatively quoting a throughput capacity of 1,000 transactions per second and a 10-second finality upon launch.<\/span>","<span data-v-f87c67ca=\"\">The permissioned nature of the Libra blockchain, with each of its 100 validator nodes operated by highly public entities, also means that it will be easier for stakeholders to coordinate in order to censor certain transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Libra team anticipates that most people will choose to use custodial wallets, such as <a href=\"https:\/\/www.theblockcrypto.com\/linked\/38721\/facebook-hires-two-more-lobbyists-for-libra-cryptocurrency-initiative\" data-v-f87c67ca=\"\">Facebook’s<\/a> Calibra, in which case the wallet providers manage their customers' private keys and can choose to provide protections such as insurance, fraud protection, and customer service. The Block found that Calibra is already <a href=\"https:\/\/www.docdroid.net\/544Gxxg\/calibra-msb-registration.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">registered as an MSB<\/a> with the FinCEN in all U.S. states. Alternatively, s<\/span>imilar to other public cryptocurrencies, users can choose to use non-custodial wallets where they are responsible for their own keys and funds.","<span data-v-f87c67ca=\"\">In many instances, Libra’s blockchain takes inspiration from others, using Ethereum’s account, gas, and smart contract model. Libra will also be open-source under an Apache 2.0 license, allowing developers to read, build, provide feedback, and take part in a bug bounty program. And yet Libra also brings its own innovations to the table in the form of its proprietary programming language and virtual machine, Move. Meanwhile, its LibraBFT consensus algorithm is closely modeled from the VMware's designed protocol, <\/span><a href=\"https:\/\/www.cs.unc.edu\/~reiter\/papers\/2019\/PODC.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">HotStuff<\/span><\/a><span data-v-f87c67ca=\"\">. <\/span>","<span data-v-f87c67ca=\"\">While the firm plans to transition Libra to a permissionless Proof-of-Stake based network within the next five years, the current estimated $280,000 annual cost to run a validator node may price out hobbyists. It’s also not clear how smooth the transition will be. As Facebook admits, such a process could face numerous economic, technical, and governance-related hurdles. For instance, the Libra network will have to evolve its governance and consensus systems to account for increased validator distribution without giving up the performance guarantees required of a global payment processor. <\/span>","<span data-v-f87c67ca=\"\">The association will also have to iron-out the details of automating the management of its reserves - the assets that back the Libra currency (a collection of low-volatility government bonds and currencies from central banks, likely starting with USD, GBP, EUR, and JPY). For now, the whitepaper mentions further exploration of how to automate both the verification of assets in the basket and the minting and burning of coins. Libra is not alone in this: the difficulty of bringing verifiably correct real-world data onto a blockchain is commonly known as the ‘oracle problem.’<\/span>","<b data-v-f87c67ca=\"\">Security token offering<\/b>","<span data-v-f87c67ca=\"\">Every cryptocurrency community touts its promise to revolutionize financial services by bringing the borderless virtues of the Internet to money. <\/span>","<span data-v-f87c67ca=\"\">Facebook is also betting that Libra will provide the foundations to meet the financial needs of billions of accounts. <\/span><span data-v-f87c67ca=\"\">To that end, Libra will have a war chest to execute on the firm's lofty goals with reserves from two sources: investors in the Libra Investment Token and Libra's users.<\/span>","<span data-v-f87c67ca=\"\">The issuance of the security token will cover the expenses of managing the network and supply members with coins which they can use to spur adoption among merchants and developers. Investors in the STO will receive rewards in the form of interest generated from the Libra reserves. Depending on the size of the Libra reserves, these dividends could be significant: with just 1.00% APR, a reserve of $160 billion worth of assets, the approximate size of Bitcoin’s network value, would generate $1.6 billion per year in relatively low overhead income, as per The Block's estimates.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Elephant in the room<\/strong>","<span data-v-f87c67ca=\"\">Despite controlling just 1% of the network, Facebook’s controversial brand could serve as a challenge to user adoption. <\/span>","<span data-v-f87c67ca=\"\">The social media giant has been marred by privacy concerns since the Cambridge Analytica scandal in 2018, and has struggled to properly manage its users’ information.<\/span>","<span data-v-f87c67ca=\"\">More recently, internal emails unearthed by The Wall Street Journal found potential connections between CEO Mark Zuckerberg and “problematic” practices regarding privacy. <\/span>","<span data-v-f87c67ca=\"\">Still, documents from the company suggest it has prioritized privacy and security. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">All non-custodial transactions will be pseudo-anonymous; much like other public cryptocurrencies. <\/span><span data-v-f87c67ca=\"\">In materials presented to reporters, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/38788\/jpmorgan-says-facebooks-libra-has-potential-to-grow-substantially-but-not-without-risks\" data-v-f87c67ca=\"\">Facebook<\/a> addressed the privacy concerns of potential users, noting that the Libra Association will not “hold personal data on people who use the blockchain... Further, all nodes will be run by Founding Members, who will be responsible for complying with applicable data protection laws.” <\/span>","<span data-v-f87c67ca=\"\">However, documents suggest that Facebook’s consumer-facing custodial wallet, Calibra, will require each user to comply with Know Your Customer (KYC) regulations.<\/span>","<b data-v-f87c67ca=\"\">What to expect next?<\/b>","<span data-v-f87c67ca=\"\">As is often good practice in the Wild West world of digital assets, readers would be smart to curb their enthusiasm. <\/span>","<span data-v-f87c67ca=\"\">There's no doubt today's headlines will be effective in pushing digital currencies further into the mainstream, but <a href=\"https:\/\/www.theblockcrypto.com\/linked\/40236\/facebook-ceo-mark-zuckerberg-in-washington-to-discuss-internet-regulation-with-senators\" data-v-f87c67ca=\"\">Facebook<\/a> and Libra Association's ambition plan is far from close to being executed. <\/span>","<span data-v-f87c67ca=\"\">Indeed, members of the consortium aren't even up to speed on how the project works,<\/span><a href=\"https:\/\/www.wsj.com\/articles\/facebooks-new-cryptocurrency-gets-big-backers-11560463312\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">as noted by The Wall Street Journal<\/span><\/a><span data-v-f87c67ca=\"\">. On the regulatory front, it is an open-ended question about how governments and regulatory authorities will feel about their currencies being challenged by a non-sovereign rival — even if Libra doesn't purport to be one. The documents explicitly say that Libra Blockchain itself will not be regulated but rather it will be developers building on the Libra Blockchain who will be responsible for complying with the laws and regulations in the jurisdictions in which they operate. <\/span>","<span data-v-f87c67ca=\"\">Moreover, the Libra Association itself does not offer any insights into the tax implications but says that \"<\/span>[it looks] forward to working with policymakers as they clarify the application of existing tax laws to cryptocurrencies, or in some cases to update those laws.\"","For those of us familiar with the stars, however, this all lines up. As Horoscope.com notes, Libras often are \"up in the clouds, and while he or she is amazing at making big plans, follow through can be tricky.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"EUR","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"AUM","content":"ORGANIZATION"},{"type":"MSB","content":"ORGANIZATION"},{"type":"David Marcus","content":"PERSON"},{"type":"1.00%","content":"PERCENT"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Libra","content":"PERSON"},{"type":"Libra","content":"LOCATION"},{"type":"2004","content":"DATE"},{"type":"Libra Association","content":"ORGANIZATION"},{"type":"STO","content":"ORGANIZATION"},{"type":"Zuckerberg","content":"PERSON"},{"type":"Calibra","content":"ORGANIZATION"},{"type":"$280,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"ConsenSys Solutions","content":"ORGANIZATION"},{"type":"$1.6 billion","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Harvard University","content":"ORGANIZATION"},{"type":"VMware","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Libra","content":"ORGANIZATION"},{"type":"Libra Investment Token","content":"ORGANIZATION"},{"type":"$160 billion","content":"MONEY"},{"type":"Facebook’s<\/a> Calibra","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Wild West","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"Cambridge Analytica","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["PAYMENTS"],"authors":["Frank Chaparro","The Block"]}