{"summary":"Franklin Templeton CEO Jenny Johnson reportedly holds bitcoin and ether, as well as Uniswap and SushiSwap governance tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265874\/franklin-templeton-ceo-bitcoin-ether-uniswap-sushiswap","publishDate":"2023-12-04T06:51:10","id":12505,"type":null,"title":"Franklin Templeton CEO holds BTC, ETH, UNI and SUSHI","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">Franklin Templeton's CEO, Jenny Johnson, has reportedly invested personally in cryptocurrencies — including bitcoin and ether, as well as <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Uniswap <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248366\/uniswap-uni-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/uni.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">UNI<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -3.92%\n    <\/span><\/a> <!----><\/span><\/span> and SushiSwap governance tokens.<\/span>","Those investments are \"small for my overall portfolio,\" Johnson <a href=\"https:\/\/fortune.com\/crypto\/2023\/12\/02\/franklin-templeton-jenny-johnson-bitcoin-etfs-crypto-investing-blockchain-technology\/amp\/\" data-v-f87c67ca=\"\">told<\/a> Fortune in an interview published on Saturday. This appears to be the first time Johnson has publicly disclosed her crypto investments.","Johnson, however, doesn't appear to be a fan of non-fungible tokens. She expressed a preference for mature investments with clear financial returns, stating that not all NFTs make sense from a personal investment perspective.","\"I tend to make investments in things that I think are anchored in having financial returns, because I think that you have better chances of success there,\" she said. \"There are some things that are like art in an NFT, where if two people love it, they will find a market price for it. And so, there's going to be opportunities in that space. Not all will be successful, not all will be good, but there will be some that are successful.\"","Franklin Templeton, with more than $1.3 trillion in assets under management, <a href=\"https:\/\/www.theblock.co\/post\/250478\/franklin-templeton-files-with-sec-for-spot-bitcoin-etf\" data-v-f87c67ca=\"\">filed<\/a> for a spot bitcoin exchange-traded fund with the Securities and Exchange Commission in September. The SEC has yet to approve a spot bitcoin ETF. Asked when the regulator could greenlight such a product, Johnson said she is uncertain about the approval timeline, mentioning that regulators are working on determining the best approach and should approve it in due course.","Several asset managers, including BlackRock and Fidelity, have sought approval for spot bitcoin ETFs. Johnson said \"there's obviously a demand for bitcoin, and I believe a spot ETF is a better way to access bitcoin.\"","Franklin Templeton has been actively exploring and adopting blockchain technology. In 2021, it <a href=\"https:\/\/www.theblock.co\/post\/228445\/franklin-templeton-fund-polygon\" data-v-f87c67ca=\"\">launched<\/a> a tokenized money-market fund and crypto-focused separately managed accounts. It is also a blockchain node validator. Johnson said in the interview that Franklin Templeton is a \"big believer\" in the crypto and blockchain space.","Johnson said blockchain technology will help enable the democratization of private markets, among other benefits. \"This is because the technology takes out the frictional costs associated with processing transactions. And if you can reduce the friction in transactions, then you can more easily securitize or fractionalize ownership of things that would have been operationally too difficult to consider,\" she said. \"Instead, you're able to create and transfer ownership of these hard-to-process assets much easier.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Uniswap <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248366\/uniswap-uni-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/uni.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">UNI","content":"ORGANIZATION"},{"type":"Johnson","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"Jenny Johnson","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"-3.92%","content":"PERCENT"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":["BITCOIN","DEXS","ETHEREUM","INVESTMENT FIRMS","TRADFI BANKS","UNISWAP"],"authors":["Yogita Khatri","The Block"]}