{"summary":"The funds let investors earn tokenized fund interests that are transferrable on-chain and approved by smart contracts. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200611\/ondo-finance-tokenized-treasuries-bonds","publishDate":"2023-01-10T13:18:17","id":12507,"type":null,"title":"Ondo Finance launches three tokenized U.S. Treasuries and bonds","category":["COMPANIES"],"content":["Ondo Finance, a DeFi firm offering decentralized investment opportunities, has launched tokenized versions of U.S. treasuries and bonds.&nbsp;","These tokenized products let stablecoin holders invest in bonds and treasuries, Ondo Finance noted in a company <a href=\"https:\/\/blog.ondo.finance\/announcing-tokenized-us-treasuries-and-bonds\/\" data-v-f87c67ca=\"\">blog post<\/a>. The three offerings upon launch include the U.S. Government Bond Fund, Short-Term Investment Grade Bond Fund and High Yield Corporate Bond Fund.&nbsp;","\"We envision these security tokens and protocols that support them as creating a compliant on-chain financial ecosystem supporting both permissioned and permissionless assets, ultimately improving the accessibility, transparency and efficiency of our markets,\" Ondo Finance founder and CEO Nathan Allman said.&nbsp;","Bond investors can net tokenized fund interests approved by smart contracts that are transferrable on-chain, according to the post. Ondo Finance earns a 0.15% annual management fee through these bonds.","Ondo Finance previously raised <a href=\"https:\/\/www.theblock.co\/post\/156116\/ondo-finance-raises-10-million-in-public-token-sale\" data-v-f87c67ca=\"\">$10 million<\/a> in a public token sale on July 6, 2022, The Block reported at the time. A few months before that, Peter Thiel's investment fund co-led a <a href=\"https:\/\/www.theblock.co\/post\/143769\/ondo-finance-raises-funding-peter-thiel-founders-fund\" data-v-f87c67ca=\"\">$20 million<\/a> Series A funding round for Ondo Finance in April 2022.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Short","content":"PERSON"},{"type":"Nathan Allman","content":"PERSON"},{"type":"July 6, 2022","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"0.15%","content":"PERCENT"},{"type":"$10 million","content":"MONEY"},{"type":"Ondo Finance","content":"ORGANIZATION"}],"hashtag":["SMART CONTRACTS"],"authors":["MK Manoylov","The Block"]}