{"summary":"After years of planning, Ethereum is approaching its highly anticipated blockchain upgrade called The Merge. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade","publishDate":"2022-09-01T10:20:00","id":12501,"type":null,"title":"The Merge: Everything you need to know about Ethereum&#x27;s big upgrade","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">After years of planning, Ethereum is approaching its highly anticipated blockchain upgrade called The Merge.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Assuming everything goes as planned, The Merge will be Ethereum's biggest moment to date as it permanently changes its underlying consensus mechanism, which is used to secure the blockchain network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The main purpose of The Merge is to change Ethereum’s current proof-of-work consensus mechanism to proof of stake to help the network be more energy efficient.<\/span>","<span data-v-f87c67ca=\"\">Technically the proof-of-stake chain, called the <a href=\"https:\/\/www.theblock.co\/post\/90818\/ethereum-2-eth2-whats-next-2021\" data-v-f87c67ca=\"\">Beacon Chain<\/a>, is already live but it’s not yet integrated with the main blockchain. When The Merge takes place it will take the current blockchain and merge it (hence the name) with the proof-of-stake chain. Afterwards, Ethereum will be running on proof of stake.<\/span>","<span data-v-f87c67ca=\"\">The reason why Ethereum’s development team wants to transition to proof of stake is primarily to make it energy-efficient.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Ethereum’s present consensus mechanism relies on mining in which computer chips are used to solve cryptographic puzzles. While proof of work is effective, it’s considered to be highly energy intensive and mining resulting in high amounts of carbon emissions. It is <\/span><a href=\"https:\/\/digiconomist.net\/ethereum-energy-consumption\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">estimated<\/span><\/a><span data-v-f87c67ca=\"\"> that the Ethereum network consumes ~75 terawatt-hours per year (TWh\/yr), which is about the same as Austria’s annual power consumption.<\/span>","<span data-v-f87c67ca=\"\">This is different in a proof-of-stake system, where the blockchain is secured by validators who are selected by staking tokens. Validators on Ethereum must stake 32 ether ($48,000) to be eligible. Anyone can be a validator node as long as they meet the stake requirement. Users can also pool their assets together by delegating their tokens to a validator and sharing in the rewards.<\/span>","<span data-v-f87c67ca=\"\">By putting up their own assets as collateral, users accept the risk that if they act maliciously, their stake could be slashed and they could lose their own funds. This is the incentive to be a positive actor on the network. It’s similar to <a href=\"https:\/\/www.theblock.co\/post\/160462\/as-the-ethereum-merge-approaches-a-key-miner-is-pushing-a-proof-of-work-fork\" data-v-f87c67ca=\"\">miners<\/a> who have to invest in mining equipment and pay for electricity to mine blocks. The idea is that it makes it more beneficial for network operators to behave positively than try to attack the network.<\/span>","<span data-v-f87c67ca=\"\">But by removing the mining process and replacing it with staking, this eliminates the steep costs related to acquiring expensive hardware and lots of electricity. As such, it has the potential to make the Ethereum project much more <a href=\"https:\/\/blog.ethereum.org\/2021\/05\/18\/country-power-no-more\" data-v-f87c67ca=\"\">energy-efficient<\/a> and reduce its carbon footprint.<\/span>","<span data-v-f87c67ca=\"\">The Ethereum team has predicted that switching off Ethereum's proof of work mechanism in favor of proof of stake will drastically cut down on this power expenditure by about 99.95%, resulting in an annual energy expenditure of 0.01 TWh\/yr.<\/span>","<span data-v-f87c67ca=\"\">The Ethereum Foundation <a href=\"https:\/\/www.theblock.co\/post\/165477\/ethereum-foundation-confirms-september-dates-for-the-merge\" data-v-f87c67ca=\"\">confirmed<\/a> that The Merge will be finalized between 10 and 20 September 2022. According to the organization, the event will take place in two stages: <\/span><span data-v-f87c67ca=\"\">Bellatrix and Paris.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The first part of The Merge called Bellatrix will happen at 11:34 am UTC on September 6 and will upgrade the Beacon Chain to make it ready for The Merge.<\/span>","<span data-v-f87c67ca=\"\">After this, in the second stage called Paris, the proof-of-work chain will hit the switch to proof of stake. The exact transition time isn't known but The Merge will execute when the network reaches a pre-set \"terminal total difficulty.\" Based on on-chain estimates, this is currently estimated to take place on September 15 — but it could fluctuate by a few days either side.<\/span>","<span data-v-f87c67ca=\"\">Ethereum developers have taken years of planning and iteration to shift to proof of stake.<\/span>","<span data-v-f87c67ca=\"\">The gradual development towards The Merge came in two milestones. The first was the creation of The Beacon Chain in December 2020, which kicked off the initial phase of the proof-of-stake transition.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Beacon Chain has functioned as a proof-of-stake network running parallel to Ethereum and where users can stake ether (ETH). The objective of launching the Beacon Chain ahead of time was to ensure there was enough ether staked on the network at the time of Ethereum switching over. Currently, the Beacon Chain has about 13.2 million of ether staked across <\/span><a href=\"https:\/\/beaconcha.in\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">418,000 validator nodes<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Another purpose of the Beacon Chain was to test the proof-of-stake consensus in production for a substantial period of time without affecting Ethereum's proof-of-work mainnet, which hosts billions of dollars worth of assets.<\/span>","<span data-v-f87c67ca=\"\">Throughout 2022, in preparation for The Merge, Ethereum developers carried out several <a href=\"https:\/\/www.theblock.co\/post\/156013\/ethereum-developers-activate-the-merge-on-sepolia-testnet\" data-v-f87c67ca=\"\">dress rehearsals<\/a> on test networks — dedicated clones of the Ethereum blockchain used for experimental purposes. The developers perform tests called shadow forks on the mainnet as well.<\/span>","<span data-v-f87c67ca=\"\">Multiple testnets, including <a href=\"https:\/\/www.theblock.co\/post\/150864\/ethereums-ropsten-proof-of-stake-test-merge-goes-live\" data-v-f87c67ca=\"\">Ropsten<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/156013\/ethereum-developers-activate-the-merge-on-sepolia-testnet\" data-v-f87c67ca=\"\">Sepolia<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/162913\/ethereums-final-proof-of-stake-test-merge-is-live-on-goerli\" data-v-f87c67ca=\"\">Goerli<\/a>, have already undergone The Merge and are running the full proof-of-stake code. These dress rehearsals helped the core developers to discover issues and improve the client software used to run Ethereum nodes, like Nethermind, Geth, and Erigon. This is to make The Merge transition go smoothly.<\/span>","<span data-v-f87c67ca=\"\">A common misconception among users is that The Merge will increase Ethereum’s overall network capacity, which is that it will make the blockchain faster and cheaper to use. In reality, that's not the case.<\/span>","<span data-v-f87c67ca=\"\">As the upgrade only changes Ethereum's consensus mechanism — how the network agrees on who gets to create blocks in the chain — it won’t particularly affect the rules governing transactions and fees. Similarly the time to process new blocks will change only slightly, reducing from 13 seconds to 12 seconds.<\/span>","<span data-v-f87c67ca=\"\">So even after The Merge, Ethereum may still be prone to congestion and transaction fee spikes during times of high demand. There are other plans for scaling via a system of multiple layers —&nbsp;including <a href=\"https:\/\/www.theblock.co\/post\/162098\/zk-rollups-likely-to-be-main-layer-2-solution-for-ethereum-says-vitalik-buterin\" data-v-f87c67ca=\"\">rollups<\/a> of multiple varieties — and the network will have some time to go to reach there.<\/span>","<span data-v-f87c67ca=\"\">At the same time, The Merge lays the groundwork for future scaling upgrades at the base layer like <a href=\"https:\/\/www.theblockresearch.com\/scaling-blockchains-with-sharding-111362\" data-v-f87c67ca=\"\">sharding<\/a>, which allows splitting up the blockchain into shards and allowing parallel processing of transactions across them.<\/span>","<span data-v-f87c67ca=\"\">The coming Merge has economic ramifications too. The Ethereum blockchain will face a huge reduction in issuance as soon as it upgrades to the new consensus mechanism. As such, there is potential for ether’s token supply to become deflationary.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Per <\/span><a href=\"https:\/\/ethereum.org\/en\/upgrades\/merge\/issuance\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">current estimates<\/span><\/a><span data-v-f87c67ca=\"\">, the rate of new ether creation will drop nearly 90% after The Merge due to the fact validator rewards will be significantly smaller than the miner rewards issued on proof of work.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A recent blog post on Ethereum’s main community website <\/span><a href=\"https:\/\/ethereum.org\/en\/upgrades\/merge\/issuance\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stated<\/span><\/a><span data-v-f87c67ca=\"\"> its proof-of-work chain pays 13,000 ETH each day to miners. After The Merge, the site estimated roughly 1,600 ETH will be paid in validator rewards, thus a reduction of 88%.<\/span>","<span data-v-f87c67ca=\"\">This fall in issuance comes not long after Ethereum introduced a burn fee. This is a fee on every blockchain transaction that doesn’t go to the miner (or the validator) but is burned and made inaccessible. The idea here is to slowly reduce the supply of ether over time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Since the burn fee was introduced, more than <a href=\"https:\/\/watchtheburn.com\/\" data-v-f87c67ca=\"\">2.6 million ETH<\/a> has been burned, worth about $3.76 billion at the current price of ether.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As a result, the Ethereum network will be issuing much less ETH each year and it will also continue to burn a large amount of ETH each year. If it burns more than it issues, then the network will be deflationary —&nbsp;with its supply decreasing every year instead of increasing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This will likely happen if the average gas price — a core part of transaction fees — is above 15-16 gwei.<\/span>","<span data-v-f87c67ca=\"\">Assuming The Merge goes successfully, it will remove one of Ethereum’s biggest issues — that of the environmental impact —&nbsp;and allow it to focus on its other core problems, mainly scaling to allow for more transactions at low costs.<\/span>","<span data-v-f87c67ca=\"\">With the environmental issue out of the way, this could have a big impact on the future of NFTs (most of which are on Ethereum). NFTs have many critics, which point both to technological issues and environmental ones. Without the latter issue, they may be more appealing to critics but it’s not necessarily a clean cut issue.<\/span>","<span data-v-f87c67ca=\"\">After The Merge, there could be security issues. The Merge will have no impact on contracts deployed on Ethereum and therefore apps should continue to run normally. But that won’t stop people from looking for potential issues to try to fix them or exploit them.<\/span>","<span data-v-f87c67ca=\"\">After The Merge, the staked ether on Ethereum will remain locked. Withdrawals will be enabled after the Shanghai upgrade, estimated to arrive at least 6-12 months after The Merge.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Austria","content":"LOCATION"},{"type":"Geth","content":"PERSON"},{"type":"September 6","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"Beacon Chain","content":"LOCATION"},{"type":"88%","content":"PERCENT"},{"type":"99.95%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"The Merge","content":"ORGANIZATION"},{"type":"$3.76 billion","content":"MONEY"},{"type":"Shanghai","content":"LOCATION"},{"type":"$48,000","content":"MONEY"},{"type":"16","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"12","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Ropsten","content":"PERSON"},{"type":"December 2020","content":"DATE"},{"type":"Bellatrix","content":"ORGANIZATION"},{"type":"Erigon","content":"ORGANIZATION"},{"type":"September 15","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"September 2022","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}