{"summary":"Paolo Ardoino expects a &quot;quantum leap&quot; in Bitcoin scaling solution adoption over the next few years, including the Lightning Network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258703\/bitfinex-ardoino-quantum-leap-bitcoin-scaling-adoption-lightning","publishDate":"2023-10-20T10:08:53","id":12519,"type":null,"title":"Bitfinex&#x27;s Ardoino expects &#x27;quantum leap&#x27; in Bitcoin scaling solution adoption","category":["LAYER 2S AND SCALING"],"content":["<span data-v-f87c67ca=\"\">Bitfinex CTO Paolo Ardoino said he expects a \"quantum leap\" in <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.71%\n    <\/span><\/a> <!----><\/span><\/span> scaling adoption over the next few years during a wide-ranging interview with The Block that covered the future of Bitcoin scalability and Lightning Network integration.<\/span>","Bitfinex was one of the early pioneers in Lightning adoption, and the first crypto exchange to integrate with the network. Many in the community have questioned why it has taken so long for other major exchanges to follow suit. However, Ardoino said it was essential to acknowledge the Lightning Network is still a relatively new technology, firmly in the development stage.","\"Consequently, concerns about its maturity and the complexities inherent in Layer 2 solutions are entirely valid,\" he said.","Embracing the challenge at Bitfinex, Ardoino said the integration led to substantial reductions in transaction costs and processing times for its users, giving it a competitive edge and opening up strategic partnerships as advocates for Lightning Network adoption.","\"These collaborative efforts have played a pivotal role in strengthening the ecosystem for Lightning transactions, bolstering network liquidity, and solidifying the protocol's legitimacy,\" Ardoino said. \"Today, Bitfinex proudly operates and manages two of the largest and most liquid nodes on the Lightning Network.\"","The Lightning Network operates as a network of bi-directional payment channels on top of the Bitcoin blockchain, designed to enable fast and cost-effective micropayments.","The Lightning Network is one of the key tenets of Bitfinex's <a href=\"https:\/\/www.bitfinex.com\/manifesto\/\" data-v-f87c67ca=\"\">Freedom Manifesto<\/a>, outlining its commitment to the cause of individual freedom from finance to free speech and privacy. \"We believe that Lightning represents one of the best solutions for scaling Bitcoin, expanding its accessibility as a store of value, and augmenting its utility as a payment method,\" Ardoino said.","Bitfinex's commitment to that cause is multifaceted, Ardoino added, dedicated to partnerships that promote Lightning Network adoption, educational initiatives that enhance public understanding and technical advancements that boost Lightning's benefits.","Beyond the Lightning Network, Ardoino also discussed Keet, a privacy-focused decentralized messaging platform with no access to user data, utilizing similar peer-to-peer technology that Bitcoin is premised on. The Bitfinex CTO acknowledged Keet isn't a scaling solution per se but said it was an important tool for protecting individual freedoms alongside an open, permissionless financial system.","Ardoino also said he saw RGB — a smart contracts system and off-chain protocol for Bitcoin and the Lightning Network — as representing the <a href=\"https:\/\/www.theblock.co\/post\/258350\/bitfinex-rgb-bitcoin-stablecoins\" data-v-f87c67ca=\"\">best opportunity<\/a> to issue USDT stablecoins on Bitcoin after Tether <a href=\"https:\/\/www.theblock.co\/post\/245976\/tether-discontinues-usdt-bitcoin-kusama-bitcoin-cash\" data-v-f87c67ca=\"\">discontinued Omni support<\/a> in August. However, he also appears to be a fan of <a href=\"https:\/\/www.theblock.co\/post\/258634\/taproot-assets-bitcoin-renaissance-elizabeth-stark\" data-v-f87c67ca=\"\">Taproot Assets<\/a> — which aims to transform Bitcoin into a scalable multi-asset network without compromising its core tenets — <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1714732506946134062\" data-v-f87c67ca=\"\">calling<\/a> it \"the future we deserve.\"","The Bitfinex CTO added that <a href=\"https:\/\/www.theblock.co\/post\/258167\/drivechains-bitcoin-game-changer-bitfinex-cto\" data-v-f87c67ca=\"\">drivechains in Bitcoin<\/a> could also be a \"game-changer\" — aspiring toward faster block times, improved privacy and more complex smart contract features. \"However, they require a change to Bitcoin which could threaten the stability of the mainnet,\" he said.","Lightning Network capacity and adoption remain relatively low compared to alternative Layer 2 networks. Lightning capacity witnessed a significant <a href=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\" data-v-f87c67ca=\"\">drop-off<\/a> in July, according to The Block's data dashboard, though it has subsequently rallied to reproach recent highs after a sharp upturn this month.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/lightning-networks-capacity-daily\/embed\" title=\"Lightning Network's Capacity\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"Many hesitations about the Lightning Network stem from its intricate nature and its current stage of development,\" Ardoino said. \"Even though it has demonstrated swift payments with minimal transaction fees, there remains a reluctance to embrace it fully.\"","As Bitcoin adoption accelerates and potentially challenges current payment methods, the Bitfinex CTO was confident there would be a shift toward alternatives like the Lightning Network. \"The more we collaborate with different exchanges and platforms on Lightning integration, the quicker we can disrupt the global payment landscape,\" he said.","Ardoino extended that analysis to Bitcoin sidechain solutions like Liquid, suggesting it faced similar challenges in terms of complexity and interoperability. \"I think as the technology evolves with better interoperability and stronger security, we will see more users and developers embrace them for their web3 projects,\" he added.","Earlier this year, the creator of the decentralized social media protocol <a href=\"https:\/\/www.theblock.co\/post\/207448\/nostr-based-decentralized-twitter-alternative-damus-goes-live-on-apple-app-store\" data-v-f87c67ca=\"\">Nostr<\/a>, Fiatjaf, described the Lightning Network as an \"<a href=\"https:\/\/www.theblock.co\/post\/241945\/jameson-lopp-casa-bitcoin-lightning-network\" data-v-f87c67ca=\"\">inelegant pile of ugly and complicated hacks<\/a>.\" Ardoino again emphasized the early stage of Lightning technology. \"While some may view its complexity as 'ugly,' it is still the most promising and accomplished Bitcoin scaling solution that’s on the market today,\" he said. \"I’m certain as more and more exchanges and platforms continue to integrate Lightning like we at Bitfinex have done, those criticisms will quieten down.\"","Another frequent criticism relates to the large number of users reliant on custodial wallet solutions like Wallet of Satoshi rather than taking control over their own assets.","\"It’s ultimately a question of utility and ease of use,\" Ardoino said. \"Many of the custodial solutions on the internet in general have the advantage of having better UI than their non-custodial counterparts, and it is up to us as developers to create non-custodial solutions that are just as seamless to use.\"","\"I certainly wholeheartedly endorse non-custodial solutions like wallets, not just for security reasons, but because the privacy it provides is a central tenet of the decentralized ethos of Bitcoin,\" he added. Synonym, where Ardoino serves as Chief Strategy Officer, is developing one such Lighting-compatible non-custodial wallet designed for greater ease of use.","\"In five years time, my hope would be for Lightning Network adoption to have continued to grow to the point where we are seeing greater interchain operability for Bitcoin across web3,\" Ardoino said. \"Bitcoin is a $500 billion asset that is hardly being utilized in DeFi, and I see that as a very real lost opportunity for the number of blockchains and networks out there.\"","\"As more members of the crypto industry utilize Bitcoin to enhance their liquidity, I believe we'll see Bitcoin scaling solutions take a quantum leap forward in their adoption in the next few years,\" he added.","Last week, stablecoin issuer Tether <a href=\"https:\/\/www.theblock.co\/post\/256298\/tether-paolo-ardoino-new-ceo\" data-v-f87c67ca=\"\">promoted<\/a> Ardoino to CEO. He remains in his position as Bitfinex CTO.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"RGB","content":"ORGANIZATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Keet","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Fiatjaf","content":"PERSON"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Ardoino","content":"PERSON"},{"type":"Bitfinex CTO","content":"ORGANIZATION"},{"type":"CTO Paolo Ardoino","content":"ORGANIZATION"},{"type":"$500 billion","content":"MONEY"},{"type":"+0.71%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}