{"summary":"A settlement appears to be imminent in a landmark insider trading case involving a former Coinbase employee and charges brought by the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224919\/former-coinbase-employee-insider-trading","publishDate":"2023-04-04T18:15:19","id":12513,"type":null,"title":"Former Coinbase employee ready to settle insider trading case with SEC","category":["POLICY"],"content":["The Securities and Exchange Commission appears poised to settle a landmark insider trading case focused on a former Coinbase product manager Ishan Wahi and his brother, Nikhil Wahi.","The details were included in a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.wawd.312176\/gov.uscourts.wawd.312176.103.0_1.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">joint court filing<\/a> submitted Monday.","Per the filing: \"At this time, the SEC has an agreement in principle with Ishan Wahi to resolve all of the SEC’s claims in this matter. The SEC and Nikhil Wahi are also in good faith discussions that may resolve the SEC’s claims.\"","Ishan Wahi had <a href=\"https:\/\/www.theblock.co\/post\/209118\/former-coinbase-manager-seeks-to-dismiss-watershed-insider-trading-case\" data-v-f87c67ca=\"\">previously sought to dismiss the civil charges<\/a> raised by the SEC, but <a href=\"https:\/\/www.theblock.co\/post\/209149\/former-coinbase-product-manager-pleads-guilty-to-criminal-charges-in-landmark-case\" data-v-f87c67ca=\"\">pleaded guilty<\/a> in February to related criminal wire fraud-related charges brought by the Justice Department.&nbsp;","Both the agency and the defendants want to postpone an upcoming April 6 deadline to the summer to give time for that settlement to be finalized. That requires approval by the politically-appointed chair of the SEC, Gary Gensler, the commission’s bipartisan panel of four other commissioners.","A settlement could have broader implications for much of the digital asset industry. The charges represent the first major crypto-related insider trading and factor around nine tokens listed by Coinbase that the SEC sees as unregistered securities. It also comes in the context of an ongoing investigation by the markets regulator into multiple aspects of Coinbase’s business.","The former Coinbase employee, Ishan Wahi, already pleaded guilty to wire fraud-related charges brought by the Justice Department in February. That plea made observers believe a key question in the SEC civil case may have mooted whether the nine tokens listed by Coinbase — that Wahi admitted to trading on with inside knowledge — are securities. The tokens in question are: AMP, RLY, DDX, XYO, RGT, LCX, POWR, DFX and KROM.","Other major trading firms, like Binance, Gemini, and Crypto.com, also list some or all of the tokens, meaning precedent over their determination in the Wahi case could be applied in enforcement actions against them if a court sees those tokens as unregistered securities. However, it's unclear whether a settlement would do so. The potential settlement also comes in the context of a recently disclosed investigation into Coinbase itself.","Late last month, Coinbase received a Wells notice, an official letter <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\">notifying them of an investigation by the SEC<\/a>. The agency is probing Coinbase's Earn and wallet products and overall exchange activity. Coinbase has not been accused of any wrongdoing in the Wahi case.","The civil charges were put on hold until Wahi could be sentenced in criminal proceedings. But Monday's filing makes it clear that the SEC and the Wahis filed to settle those charges, citing cooperation by the brothers with the regulator, but need more time for settlement approval.&nbsp;","“Any settlement recommended by SEC staff must be reviewed within the SEC and approved by the SEC’s Commissioners before it may be submitted to the Court for approval, a process that can take a number of weeks,” the letter notes.","The stipulation letter requests that the judge presiding over the case in the U.S. District Court for the Western District of Washington move the original April 6 deadline to June 15, with a reply deadline of July 15.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 15","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"April 6","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Western District","content":"ORGANIZATION"},{"type":"June 15","content":"DATE"},{"type":"the Justice Department","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Nikhil Wahi","content":"PERSON"}],"hashtag":["COINBASE","COURT HEARINGS","CRIME","SEC"],"authors":["Colin Wilhelm","The Block"]}