{"summary":"Cardano-focused development firm Coti plans to launch an Ethereum Layer 2 in an upcoming upgrade scheduled for release in 2024.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267416\/coti-plans-expansion-to-ethereum-ecosystem-with-layer-2-network","publishDate":"2023-12-13T10:00:05","id":12518,"type":null,"title":"Coti plans expansion to Ethereum ecosystem with Layer 2 network","category":["CRYPTO ECOSYSTEMS"],"content":["Coti, a blockchain developer known for operating projects on Cardano and its own network, is set to introduce an Ethereum Layer 2 as part of an upgrade scheduled for next year.`","The strategic move involves its flagship <a href=\"https:\/\/explorer.coti.io\/transactions\" data-v-f87c67ca=\"\">blockchain<\/a>, which uses Directed Acyclic Graph (DAG) technology, evolving into an Ethereum Layer 2 that supports native dapps.","Coti’s Ethereum Layer 2 network will have an emphasis on user privacy for dapps while drawing security from the Ethereum mainnet.","\"What changes is that Coti’s infrastructure, formerly a proprietary DAG-based protocol, becomes an EVM-compatible, privacy-centric Layer 2 on Ethereum,\" a Coti spokesperson told The Block.","The development network (devnet) for Coti V2 is scheduled for the second quarter of 2024, followed by a testnet and the anticipated mainnet launch by the end of the year.","Coti V2 will employ cryptography to preserve transaction privacy. It will implement a method known as <a href=\"https:\/\/crypto.stackexchange.com\/questions\/48081\/constructing-garbled-circuits\" data-v-f87c67ca=\"\">Garbled Circuits<\/a>, presented as an alternative to commonly used privacy-preserving solutions based on zero-knowledge techniques.","<a href=\"https:\/\/www.theblock.co\/post\/207023\/djed-cardanos-decentralized-stablecoin-goes-live-on-mainnet\" data-v-f87c67ca=\"\">Coti operates Djed<\/a>, a decentralized stablecoin on Cardano, developed in collaboration with Input Output, the network’s primary development firm. It also runs Ada Pay, a payment service on the same network.","The team at Coti confirmed that it would continue to work on Cardano-based projects. “Coti’s work with Cardano continues. We have a project built there called Djed, and that will continue to remain on Cardano,” it said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Cardano","content":"ORGANIZATION"},{"type":"Cardano","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coti","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ada","content":"ORGANIZATION"},{"type":"second quarter of 2024","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}