{"summary":"RTFKT will drop a phygital NFT mint of Nike-inspired shoes with web3 functionality for those only available to those in the United States.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192634\/nike-rtfkt-unveils-web3-sneakers","publishDate":"2022-12-06T13:50:25","id":12514,"type":null,"title":"Nike’s RTFKT hints at move-to-earn game via phygital drop","category":["NFT BRANDS"],"content":["RTFKT, a digital fashion and collectibles firm owned by Nike, unveiled what it said is the first native web3 sneaker.","Dubbed \"Cryptokicks iRL,\" the shoes have advanced features such as auto-lacing, enhanced lighting, haptic feedback, gesture control, walk detection and app connectivity. The sneakers will support NFC-NFT linking and NFC-NFT authentication with a special chip.","<em data-v-f87c67ca=\"\">Credit: RTFKT<\/em>","In a Monday tweet, RTFKT hinted that the sneakers might have a move-to-earn system, perhaps comparable to the Solana-based game Stepn that rewards users for walking or running. The company didn't immediately respond to a request for more information from The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nPublic mints for the shoes start on Dec. 14, and the drop is only available to users in the U.S. in a move that <a href=\"https:\/\/twitter.com\/RTFKT\/status\/1599828551607255040\" data-v-f87c67ca=\"\">irritated<\/a> some based elsewhere who expressed their displeasure on Twitter. The company said the geographic limitation was \"due to advanced tech and product regulation.\"","RTFKT raised <a href=\"https:\/\/www.theblock.co\/linked\/103837\/nft-startup-rtfkt-8-million-seed-a16z\" data-v-f87c67ca=\"\">$8 million<\/a> in seed funding led by the crypto investment firm a16z in May of last year. Nike <a href=\"https:\/\/www.theblock.co\/linked\/127417\/nike-buys-nft-collectables-startup-rtfkt\" data-v-f87c67ca=\"\">acquired<\/a> the company in December 2021.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2021","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Nike","content":"ORGANIZATION"},{"type":"May of last year","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Dec. 14","content":"DATE"},{"type":"$8 million","content":"MONEY"}],"hashtag":["RTFKT"],"authors":["MK Manoylov","The Block"]}