{"summary":"Core Scientific self-mined 1,221 BTC in July and sold 1,975 BTC, generating $44 million in proceeds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161742\/core-scientific-mined-10-4-more-bitcoin-in-june-despite-power-cuts","publishDate":"2022-08-05T11:50:21","id":12510,"type":null,"title":"Core Scientific mined 10.4% more bitcoin in July despite power cuts","category":["MINING"],"content":["Core Scientific self-mined 1,221 BTC in July — up by 10.4% compared with June, despite having to curtail power due to extreme temperatures in Texas.","Curtailment periods totaled 8,157 megawatt-hours in July. Earlier this week, rival <a href=\"https:\/\/www.theblock.co\/post\/161226\/riot-mined-28-less-bitcoin-in-july-and-earned-9-5-million-in-power-credits\" data-v-f87c67ca=\"\">Riot similarly reported that it had curtailed power by 11,717 megawatt-hours in July<\/a>.","Core Scientific also sold 1,975 BTC in July, generating about $44 million at an average price of $22,000 per bitcoin. It said it used those funds to expand capacity at its sites and to help pay the 100,000 ASIC order it placed with Bitmain in 2021, according to a statement on Friday.","The mining firm had sold 7,202 bitcoin in June, which represented a large majority of its bitcoin reserves at that point.","\"Core Scientific will continue to sell self-mined bitcoins to pay operating expenses, fund growth, retire debt and maintain liquidity,\" the company said.","The company also reported that it deployed a net total of 6,000 new self-mining machines. At the end of the month, Core Scientific had 195,000 miners, with a total hash rate of 19.3 exahash per second (EH\/s) — both in self-mining and hosting. Its self-mining hash rate was 10.9 EH\/s.&nbsp;","Last month, Core Scientific signed co-location agreements that <a href=\"https:\/\/www.theblock.co\/post\/159681\/core-scientific-signs-hosting-deal-worth-50-million-per-year\" data-v-f87c67ca=\"\">will generate $50 million per month in revenue<\/a> once the miners are deployed later this year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$22,000","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$44 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"10.4%","content":"PERCENT"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}