{"summary":"Aptos Labs has introduced a passwordless passkey authentication method for signing transactions on its Layer 1 blockchain network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277355\/aptos-passkey-authentication-transactions","publishDate":"2024-02-13T14:35:05","id":12526,"type":null,"title":"Aptos implements passwordless passkey authentication for transactions","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Aptos <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248385\/aptos-apt-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/aptos_round.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">APT<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.065%\n    <\/span><\/a> <!----><\/span><\/span> Labs has introduced a new way for users to sign transactions on its Layer 1 blockchain network: passkeys that eliminate the need for setting up passwords.<\/span>","\"We have made changes on the blockchain and created a novel passkey authenticator on Aptos that will take a transaction, the passkey signature, the passkey public key, and validate the transaction with that information,\" Avery Ching, co-founder and CTO of Aptos Labs, told The Block. \"This effectively enables a user to sign transactions with their passkey.\"","Currently, when users create an account in a crypto wallet, they generate a long code or private key, which needs to be kept safe. This key is usually encrypted with a password set by the user, Ching said. Forgetting this password means losing access to the wallet unless the key is stored elsewhere. However, with a passkey, logging in becomes possible without passwords, typically through Touch ID or Face ID.","Passkeys are more user-friendly and mirror the ease of use found in services like Apple Pay or Google Pay, Ching said.","\"Users will be able to store the private key for a passkey account directly on their device and sync their private key with their backup provider (e.g., iCloud or Google Password Manager). Then, when they want to sign a transaction, they can use the passkey directly to do so, rather than sending the request to a service to be signed,\" he added.","Other crypto projects, like Dynamic Wallet and Turnkey, also provide passkey authentication. However, in contrast to Aptos' system where users store their private key on their device, Dynamic Wallet and Turnkey keep the private key on systems such as Amazon Web Services Nitro Enclave, Ching said.","Aptos built its passkey authenticator in-house after ideating on it in early 2023, Ching said. While the authenticator is currently only implemented for the Aptos ecosystem, others could use it as it is open-sourced, Ching added. Aptos has utilized the WebAuthn standard and public-key cryptography for the authenticator.","Aptos Labs, backed by high-profile venture capital firms, launched its blockchain in October 2022. The firm <a href=\"https:\/\/www.theblock.co\/post\/159439\/aptos-closes-150-million-round-led-by-ftx-ventures-jump-crypto\" data-v-f87c67ca=\"\">has raised $350 million<\/a> in total funding from investors including a16z, Tiger Global, Multicoin Capital and Franklin Templeton.","The Aptos blockchain has a current total value locked standing at around $176 million compared to its closest competitor, Sui, which has a TVL of over $561 million, according to <a href=\"https:\/\/defillama.com\/chains\/Non-EVM\" data-v-f87c67ca=\"\">DeFiLlama data<\/a>.","Ching declined to comment on what factors may be hindering the growth of <a href=\"https:\/\/www.theblock.co\/post\/275915\/february-will-see-800-million-of-unlocks-from-avalanche-optimism-aptos-and-more\" data-v-f87c67ca=\"\">Aptos<\/a> and what steps the project is currently undertaking to address it.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$176 million","content":"MONEY"},{"type":"$350 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Google Password Manager)","content":"ORGANIZATION"},{"type":"+0.065%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"CTO of Aptos Labs","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"},{"type":"Sui","content":"LOCATION"},{"type":"Aptos","content":"LOCATION"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Dynamic Wallet","content":"ORGANIZATION"},{"type":"Ching","content":"PERSON"},{"type":"$561 million","content":"MONEY"},{"type":"Avery Ching","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Amazon Web Services Nitro Enclave","content":"ORGANIZATION"}],"hashtag":["APTOS"],"authors":["Yogita Khatri","The Block"]}