{"summary":"Tokenized funds necessitate fund managers to have more technological expertise, Moody&#x27;s analysts said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272622\/moodys-says-adoption-of-tokenized-funds-signals-untapped-market-potential","publishDate":"2024-01-15T07:24:15","id":12528,"type":null,"title":"Moody&#x27;s says adoption of tokenized funds signals &#x27;untapped market potential&#x27;","category":["COMPANIES"],"content":["Global financial services company Moody’s, known for its credit ratings, said that the growing adoption of blockchain-based tokenized funds is raising the efficiency of investing in assets like government bonds and signals “untapped market potential.”","Tokenized funds may also introduce tech-related risks, requiring fund managers to have more diverse technological expertise, Moody's analysts said in a <a href=\"https:\/\/www.moodys.com\/research\/DeFi-Digital-Assets-Cross-Region-Growing-adoption-of-tokenized-Sector-In-Depth--PBC_1390238\" data-v-f87c67ca=\"\">report<\/a> today.","The growth of fixed-income tokenized funds is mainly fueled by investment in government securities, with yields becoming more attractive following the recent series of interest rate hikes from the U.S. Federal Reserve, Moody’s said. Tokenized fund issuance by both traditional institutions and crypto companies backed by such securities grew to over $800 million on public blockchains by the end of 2023 from $100 million at the start of the year, according to the analysts.","<span data-v-f87c67ca=\"\">Issuance of tokenized funds backed by government securities on public blockchains. Image: <a href=\"https:\/\/www.moodys.com\/research\/DeFi-Digital-Assets-Cross-Region-Growing-adoption-of-tokenized-Sector-In-Depth--PBC_1390238\" data-v-f87c67ca=\"\">Moody’s<\/a>.<\/span>","“The largest issuance to date was carried out by Franklin Templeton, which initially registered share ownership of its U.S. Government Money Fund on the Stellar blockchain in 2021 and further extended the offer to Polygon blockchain in 2023,” Moody’s said.","Other examples include Swiss-based firm Backed Finance, which <a href=\"https:\/\/www.theblock.co\/post\/255176\/real-world-asset-project-backed-issues-tokenized-security-on-base\" data-v-f87c67ca=\"\">expanded<\/a> its Ethereum-based tokenized short-term U.S. Treasury bond ETF offering in October to Base, the Coinbase-incubated Layer 2 network.","UBS also issued a tokenized money market fund on the Ethereum public blockchain via its UBS Tokenize platform in the same month. Moody’s argues that in the absence of widely accepted stablecoins or central bank digital currencies (CBDCs), tokenized money market funds could be used as an alternative to stablecoin collateral in DeFi markets, though they may not be as liquid.","In November, SC Ventures, the investment and innovation arm of Standard Chartered, <a href=\"https:\/\/www.theblock.co\/post\/263035\/standard-chartered-sc-ventures-tokenization-libeara\" data-v-f87c67ca=\"\">launched<\/a> a tokenization platform called Libeara. Last week, SGD Delta Fund, a tokenized Singapore-dollar government bond fund, received an <a href=\"https:\/\/www.theblock.co\/post\/270304\/moodys-rates-first-fund-to-use-standard-chartered-units-tokenization-platform\" data-v-f87c67ca=\"\">AA rating<\/a> from Moody's after becoming the first fund to use Libeara.","Last week, Nomura's Laser Digital also <a href=\"https:\/\/www.theblock.co\/post\/271230\/nomura-laser-digital-unveils-polygon-powered-libre-protocol-brevan-howard\" data-v-f87c67ca=\"\">unveiled<\/a> Polygon-powered Libre protocol for Brevan Howard and Hamilton Lane funds.","Similar to traditional bond funds, tokenized funds typically invest in fixed-income long-term instruments, such as corporate or government bonds, or in short-term securities, such as bills and notes, the analysts said. However, the key difference lies in their digital nature, with shares of the fund represented as digital tokens on a distributed ledger, replacing centralized shareholder registers.","This enhances market liquidity and accessibility, decreases costs and enables fractionalization for traditional investors but also offers significant benefits to crypto investors — particularly in a high-yield environment where traditional assets become more attractive compared to volatile returns in DeFi, the analysts said.","<span data-v-f87c67ca=\"\">30-day weighted average lending rates on Compound v2 versus 3-month US Treasury yield. Image: <a href=\"https:\/\/www.moodys.com\/research\/DeFi-Digital-Assets-Cross-Region-Growing-adoption-of-tokenized-Sector-In-Depth--PBC_1390238\" data-v-f87c67ca=\"\">Moody’s<\/a>.<\/span>","Similar to regular bond funds, tokenized funds face risks related to underlying assets and fund management. However, tokenization also introduces additional complexities, requiring a much more diverse range of expertise, the analysts said.","Service providers in this space often have limited track records, increasing the risk of payment disruptions due to technological failures or bankruptcy. The exposure of fund collateral to stablecoins adds another layer of risk. Furthermore, the use of public blockchains in tokenized funds introduces vulnerabilities to additional technological risks, cyberattacks and governance issues, the analysts argue.","While the allure of tokenized funds is currently high, this interest might also diminish if there is another crypto bull market. Ultimately, despite the promise of technology-driven efficiencies, the framework supporting tokenized funds is still evolving, with a need for further development and standardization, Moody’s said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"Backed Finance","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"SC Ventures","content":"ORGANIZATION"},{"type":"Brevan Howard","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"US Treasury","content":"ORGANIZATION"},{"type":"SGD","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Laser Digital","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Moody’s","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"Hamilton Lane","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Swiss","content":"LOCATION"},{"type":"UBS Tokenize","content":"ORGANIZATION"},{"type":"Moody","content":"ORGANIZATION"},{"type":"$800 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Standard Chartered","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS","SECURITY TOKENS","TOKENIZATION"],"authors":["James Hunt","The Block"]}