{"summary":"Bitcoin miner CleanSpark pushed back its hashrate guidance for end of 2023 due to delays from partner Lancium.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195154\/bitcoin-miner-cleanspark-slashes-2023-hashrate-guidance-on-build-out-delays","publishDate":"2022-12-14T18:51:23","id":12521,"type":null,"title":"Bitcoin miner CleanSpark slashes 2023 hashrate guidance on build-out delays","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miner CleanSpark is lowering its 2023 hashrate guidance from 22.4 EH\/s to 16 EH\/s because of build-out delays coming from its infrastructure partner, Lancium.","\"Just recently, they informed us of capital constraints affecting their ability to meet their commitments,\"&nbsp;the company's CEO Zach Bradford <a href=\"https:\/\/www.theblock.co\/post\/194595\/bitcoin-miner-cleanspark-reports-42-3-million-net-loss-missing-estimates\" data-v-f87c67ca=\"\">during an earnings call<\/a> Wednesday said.","CleanSpark did, however, meet its 5.0 EH\/s year-end hashrate in October and is now projecting to reach 6.0 EH\/s by Dec. 31.","Lancium was expected to provide first 50 megawatts this month and the next 150 megawatts in the spring, Bradford said. Instead, that capacity only will be available in late 2023 — or even later, given current market conditions.","Margins in the industry are hurting amid higher costs and lower bitcoin prices. Some of the largest players are cash-strapped and struggling to pay bills.","CleanSpark, however, has been on the acquiring side, buying up two sites and several thousands of machines from competitors in recent months.","\"We have very little leverage on the balance sheet,\" said CFO Gary A. Vecchiarelli. \"While debt markets are currently closed for most mining companies. We continue to have positive conversations with lenders primarily because of our balance sheet and financial position.\"","The company reported a net loss was $42.3 million and revenue of $26.2 million for the three months ending in September, missing analyst estimates on both.","It's shares were down about 4% in after-hours trading, as of publication time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary A. Vecchiarelli","content":"PERSON"},{"type":"Dec. 31","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Zach Bradford","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"$42.3 million","content":"MONEY"},{"type":"$26.2 million","content":"MONEY"},{"type":"spring","content":"DATE"},{"type":"Lancium","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Bradford","content":"PERSON"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}