{"summary":"DeFi coverage protocol Nexus Mutual has swapped 14,390 ETH from its capital pool for Rocket Pool’s rETH liquid staking token.\nThe trade took place on CoW Swap, a DEX aggregator known for executing large trades from DAOs like Aave, ENS and others.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240750\/nexus-mutual-diversifies-27-3-million-into-rocket-eth-using-cow-swap","publishDate":"2023-07-21T12:10:49","id":1253,"type":null,"title":"Nexus Mutual diversifies $27.3 million into Rocket Pool ETH using CoW Swap","category":["Crypto Ecosystems"],"content":["Nexus Mutual, a DeFi coverage protocol, has swapped 14,390 ETH (equivalent to $27.3 million) from its “safety insurance module” for Rocket Pool’s rETH liquid staking token using the <a href=\"https:\/\/swap.cow.fi\/\" data-v-f87c67ca=\"\">CoW Swap<\/a> DEX aggregator. This ranks as one of the largest on-chain swaps ever conducted by Nexus Mutual as part of a broader diversification strategy for the coverage protocol.","On-chain <a href=\"https:\/\/etherscan.io\/address\/0x551d5500f613a4bec77ba8b834b5eed52ad5764f\" data-v-f87c67ca=\"\">data<\/a> indicates that Nexus Mutual executed its purchase of rETH in two transactions: one for <a href=\"https:\/\/etherscan.io\/tx\/0x3a2107a51f3c9ffff00b5eae0e7850a512e49f444a10bb31ce088b169fdaa40d\" data-v-f87c67ca=\"\">14,140 ETH<\/a> and the other for <a href=\"https:\/\/etherscan.io\/tx\/0xc6880c5cc0f56a7eed4c103a995837d787196a77111b54f7696dfda452dac37f\" data-v-f87c67ca=\"\">250 ETH<\/a>, relying on CoW Swap’s trade routes for the swap.","This transactions were conducted as part of Nexus Mutual’s diversification strategy. Within the Nexus Mutual DAO, an investment committee recommended reallocating funds from its insurance module, which provides coverage for security incidents like hacks, to liquid staked ether. As a result, the project <a href=\"https:\/\/app.nexusmutual.io\/governance\/view?proposalId=197\" data-v-f87c67ca=\"\">decided<\/a> to invest in Rocket Pool ether (rETH), an asset generated by the liquid staking project, Rocket Pool.","“Staking with the Rocket Pool protocol would amplify Nexus Mutual’s investment in liquid staked ETH while adding protocol diversity. This would consequently limit the risk of exposure to any single staking provider,” said a spokesperson from Nexus Mutual.","The Nexus Mutual team noted that it chose <a href=\"https:\/\/www.theblock.co\/post\/139832\/cowswap-unlocks-100-million-airdrop-for-its-early-supporters\" data-v-f87c67ca=\"\">CoW Swap<\/a> as its preferred DEX aggregator because of its price-matching capabilities, protection against maximal extractable value (MEV), and its ability to handle substantial volumes without significant slippage.","CoW Swap has previously facilitated transactions for other DAOs, such as Ethereum Name Service's <a href=\"https:\/\/www.theblock.co\/post\/209222\/ens-dao-votes-to-sell-16-5-million-of-eth-for-usdc-via-cow-swap\" data-v-f87c67ca=\"\">swap<\/a> of 10,000 ETH into USDC stablecoin in February. Just recently, the Aave community <a href=\"https:\/\/www.theblock.co\/post\/238686\/aave-dao-decides-to-swap-to-2-million-in-balancer-lp-tokens\" data-v-f87c67ca=\"\">acquired<\/a> $2 million in Balancer LP tokens using the protocol."],"hashtag":["ASSETS","DEXS","MEV","SMART CONTRACTS","STAKING"]}