{"summary":"The new proposal still calls for selling 10 million Lido DAO tokens to Dragonfly, but with a one-year lock-up this time around.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159848\/lido-proposes-new-terms-for-treasury-token-sale-to-dragonfly-capital","publishDate":"2022-07-27T10:01:09","id":12531,"type":null,"title":"Lido proposes new terms for treasury token sale to Dragonfly Capital","category":["GOVERNANCE"],"content":["Liquid staking giant Lido Finance has <a href=\"https:\/\/research.lido.fi\/t\/treasury-diversification-2-part-2\/2657\/5\" data-v-f87c67ca=\"\">submitted<\/a> a revamped proposal for the sale of Lido DAO (LDO) tokens to Dragonfly Capital, after the community voted against the previous plan.","The new proposal still calls for selling 10 million LDO tokens to Dragonfly. However, this sale will come with a one-year lockup. The lack of a vesting requirement in the previous arrangement was a major issue for the Lido DAO community.","The introduction of a vesting arrangement also means the tokens would be bought by Dragonfly Ventures, rather than Dragonfly Liquid. Both are entities under the Dragonfly Capital umbrella but the former has lock-ups and vesting requirements as part of its investment strategy.","Another change in this new proposal is the sale price. The previous plan was a flat rate of $1.45 per LDO. There is now a second pricing alternative that will be based on the seven-day average LDO price at the time the voting process ends, plus a 5% premium. Dragonfly will choose the higher of the two unless that price is above $2.25, at which point the venture capital firm can withdraw from the deal.","This new proposal will go to a vote today, July 27 at 06:00 p.m. EDT. There will be only two options for voters this time around: yay or nay.","The previous vote had three choices: agree to the proposal without lock-up, agree but with lock-up requirement, or disagree with the plan entirely.&nbsp;","The token sale to Dragonfly is half of a treasury diversification plan for Lido. The liquid staking giant wants to sell 20 million LDO tokens from its treasury to DAI stablecoin. Lido says the sale is to provide a two-year runway for the project amid the current bear market.","The previous vote failed to pass, as <a href=\"https:\/\/www.theblock.co\/post\/159521\/lido-dao-votes-no-to-selling-14-5-million-in-ldo-tokens-to-dragonfly-capital\" data-v-f87c67ca=\"\">reported by The Block<\/a>. This was despite the presence of a <a href=\"https:\/\/www.theblock.co\/post\/159165\/lido-dao-voting-on-proposed-14-5-million-token-sale-to-dragonfly-capital\" data-v-f87c67ca=\"\">whale wallet backer<\/a> that initially committed 15 million LDO tokens to support the proposal.","Dragonfly has come out to state that it was the entity behind the vote. Commenting in the Lido forum, Tom Schmidt, partner at Dragonfly <a href=\"https:\/\/research.lido.fi\/t\/treasury-diversification-2-part-2\/2657\/5\" data-v-f87c67ca=\"\">stated<\/a> that the VC firm did not have any malicious intent in backing the vote to sell tokens to its own firm.","“After conversations with the Lido team, at their suggestion, the Liquid team used their existing LDO to vote on the proposal out of the address “<a href=\"https:\/\/etherscan.io\/address\/0x641cE4240508eae5dCaeffE991F80941D683Ad64\" data-v-f87c67ca=\"\">0x641c,<\/a>”\" Schmidt stated in the governance forum.","\"While obvious in retrospect, at the time, the perception among us and the Lido team was - well, you guys bought these tokens on the open market, you’re not so big as to dictate the entire vote, so of course, you get to vote with them — they’re governance tokens after all, and owning tokens means you get to be a voice within the DAO. Lesson learned.”&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Tom Schmidt","content":"PERSON"},{"type":"Schmidt","content":"PERSON"},{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"$2.25","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"Dragonfly Liquid","content":"ORGANIZATION"},{"type":"$1.45","content":"MONEY"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"July 27","content":"DATE"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"06:00 p.m. EDT","content":"TIME"},{"type":"Dragonfly Ventures","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["LIDO FINANCE"],"authors":["Osato Avan-Nomayo","The Block"]}