{"summary":"The Nevada Financial Institutions Division has petitioned for an appointment of receivership over crypto custodian Prime Trust with the Eight Judicial District Court of Nevada.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236762\/nevada-regulator-files-petition-to-place-prime-trust-in-receivership","publishDate":"2023-06-27T13:23:03","id":12532,"type":null,"title":"Nevada regulator files petition to place Prime Trust in receivership","category":["COMPANIES"],"content":["The Nevada Financial Institutions Division has petitioned for an appointment of receivership over crypto custodian Prime Trust with the Eight Judicial District Court of Nevada, the regulator said Tuesday, alleging that the company didn't have funds to cover customer deposits and had also lost access to some wallets.&nbsp;","\"This action resulted from the Division’s determination that Prime is operating in an unsafe and unsound manner and is insolvent as specified in the Cease-and-Desist Order issued on June 21, 2023,\" the regulator said.","The petition seeks a receiver to take over the day-to-day operations of the company and \"thoroughly examine all its finances to determine the best option to protect Prime’s clients, either by rehabilitating and returning the company to private management or by liquidating the company.\"","The Nevada Financial Institutions Division said <a href=\"https:\/\/www.theblock.co\/post\/236097\/nevada-regulator-says-prime-trust-cant-meet-all-client-withdrawals\" data-v-f87c67ca=\"\">last week<\/a> that the company could not meet all customer withdrawals.","The custodian fell short, owing millions to its customers, the regulator said.","Prime Trust owes over $85 million in fiat currency to its clients, but has just under $3 million in cash, according to the filing. The company also owes over $69 million in digital currency to its clients, but currently has about $68 million in digital assets.","“As such, Prime would be unable to satisfy all of its withdrawals,” the Nevada regulator said.","According to the order, Prime contracted with Fireblocks, LLC, a digital asset security platform, in 2019 to store crypto. After the migration to Fireblocks, new management came in to Prime, and they were told all crypto was maintained and accessible on the Fireblocks platform, according to the regulator.","Later in January 2021, Prime reintroduced legacy wallet forwarding addresses to customers.","“It is understood Prime did so because of limitations associated with creating new wallets within the Fireblocks platform,” the regulator said. “Prime purportedly believed that these legacy wallets existed on the Fireblocks platform or were configured to forward to wallets accessible on the Fireblocks platform.”","However, Prime then found out in December 2021 that it could not access those legacy wallets and the crypto in them, the regulator said.","Prime Trust's board of managers agreed to the receivership, according to an attachment to the regulator's filing.","(<em data-v-f87c67ca=\"\">Updates story with information from order.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cease","content":"LOCATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"$85 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"$69 million","content":"MONEY"},{"type":"December 2021","content":"DATE"},{"type":"$68 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Nevada Financial Institutions Division","content":"ORGANIZATION"},{"type":"June 21, 2023","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Nevada","content":"LOCATION"},{"type":"Eight Judicial District Court of Nevada","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","Nathan Crooks","The Block"]}