{"summary":"The TIE, a crypto data analytics company, has done just that with TheTIE-LongOnly CopyPortfolio, available exclusively on eToro. As part of eToro’s CopyPortfolio platform, which allows users to allocate their funds into managed portfolios, the TIE’s CopyPortlio uses highly advanced natural language processing tools to determine market sentiment toward crypto on social networks, and then leverages the data for algorithmic trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/80204\/a-crypto-portfolio-that-beat-bitcoin-color-us-impressed","publishDate":"2020-10-07T11:50:53","id":12534,"type":null,"title":"A crypto portfolio that beat bitcoin? Color us impressed.","category":["THE BLOCK"],"content":["<strong data-v-f87c67ca=\"\">With The TIE CopyPortfolio available on eToro, investors can allocate funds based on one of digital currency’s biggest price drivers — tweets.<\/strong>","Ever heard of the Twitter Firehose? It is the full, real-time stream of every tweet sent over the social media platform. In those tweets are a lot of… opinions. And one topic that people love to share their Twitter opinions on is the constantly fluctuating cryptocurrency market.","It may come as a shock to some, but social sentiment, especially on Twitter, can actually be a somewhat oracular indicator of the market. Now, what if there was a way to harness the data from all those daily tweets, to create an algorithm for an investing strategy determined by the “wisdom of the crowd?”","The TIE, a crypto data analytics company, has done just that with <a href=\"https:\/\/ad.doubleclick.net\/ddm\/clk\/477699798;283664729;w\" data-v-f87c67ca=\"\">TheTIE-LongOnly CopyPortfolio<\/a>, available exclusively on <a href=\"https:\/\/ad.doubleclick.net\/ddm\/clk\/477597442;283664729;f\" data-v-f87c67ca=\"\">eToro<\/a>. As part of eToro’s <a href=\"https:\/\/ad.doubleclick.net\/ddm\/clk\/477699885;283664729;t\" data-v-f87c67ca=\"\">CopyPortfolio<\/a> platform, which allows users to allocate their funds into managed portfolios, the TIE’s CopyPortlio uses highly advanced natural language processing tools to determine market sentiment toward crypto on social networks, and then leverages the data for algorithmic trading.","How many tweets are we talking? Try more than 850 million per day, which are individually scanned by the TIE to extract all those useful crypto tidbits. Once sentiment and tweet volume reaches certain algorithm thresholds, the TIE’s quantitative models determine whether or not to allocate it to a long position (i.e., an expected increase in value).","Sounds complicated? That’s because it is. Luckily for eToro users, they can invest their funds using the <a href=\"https:\/\/ad.doubleclick.net\/ddm\/clk\/477699798;283664729;w\" data-v-f87c67ca=\"\">TIE’s CopyPortolio<\/a>, which algorithmically allocates to a subset of coins on a monthly basis. The portfolio rebalances monthly, based on how incoming social sentiment alters the algorithm.","So, what was all that talk about beating bitcoin in the headline? Glad you remembered. In the second quarter of 2020, the TIE’s portfolio bested all other CopyPortfolios on eToro’s platform. More than that, those who used the <a href=\"https:\/\/ad.doubleclick.net\/ddm\/clk\/477700524;283664729;s\" data-v-f87c67ca=\"\">TIE CopyPortfolio outperformed<\/a> those who invested solely in bitcoin, or the S&amp;P 500, or gold for that matter. Heard all that buzz about bitcoin being digital gold? Maybe that makes the TIE’s portfolio digital platinum.","For those interested in harnessing the wisdom of the crowd, the TIE CopyPortfolio requires a minimum investment of $2,000. Since it presents exposure to the highly volatile crypto market, the portfolio is designed for clients who are willing to take on a high level of risk in an actively managed approach.","The TIE CopyPortfolio has been trusted by some of the industry’s leading hedge funds and institutional investors and, based on the performance noted above, it’s no surprise. If you’re interested in a new approach to the crypto market, but don’t have the time to scroll through millions of tweets on a daily basis, the TIE CopyPortfolio may just be a worthwhile investment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"second quarter of 2020","content":"DATE"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"TIE CopyPortfolio","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}