{"summary":"The weekly crypto news circuit saw Sam Bankman-Fried extradited to the U.S. before posting $250 million bail.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197825\/bankman-fried-posts-bail-and-other-major-crypto-news-of-the-past-week","publishDate":"2022-12-24T09:44:31","id":1254,"type":null,"title":"Bankman-Fried posts bail and other major crypto news of the past week","category":["MARKETS"],"content":["The FTX saga continued to unfold this past week with disgraced former CEO Sam Bankman-Fried now out on bail. Some of Bankman-Fried’s associates have pleaded guilty to fraud charges and are said to be cooperating with investigators.","More exchanges published proofs of reserves in the wake of the FTX collapse. Still, such transparency efforts by crypto exchanges were dealt a blow as reports emerged that a major accounting firm was no longer willing to work with them.","The week saw bitcoin continue its sideways price action amid a broader market lull, with crypto miners bracing for the impact of a year-long bear market.","For these and more, here are the biggest crypto news stories from the past week:","Disgraced former FTX CEO Sam Bankman-Fried <a href=\"https:\/\/www.theblock.co\/post\/197573\/ellison-and-wang-guilty-pleas-unsealed-as-bankman-fried-granted-bail\" data-v-f87c67ca=\"\">posted bail<\/a> with a $250 million bond package after being extradited to the U.S. from the Bahamas earlier in the week. This came after Bankman-Fried had claimed to have only $100,000 to his name. He is due in court on Jan. 3.","Some of Bankman-Fried’s former associates at Alameda and FTX pleaded guilty to fraud charges. The past week saw unsealed court documents revealing the criminal charges laid against former Alameda Research CEO Caroline Ellison and FTX co-founder Gary Wang. The pair stood to face lengthy prison terms if found guilty, but may see reduced sentences for cooperating with investigators.","OKX <a href=\"https:\/\/www.theblock.co\/post\/197680\/okx-publishes-second-proof-of-reserves-report\" data-v-f87c67ca=\"\">published<\/a> its second proof-of-reserves report on Dec. 23. It showed the platform had a reserve ratio of 101% of its customer’s bitcoin holdings.","Crypto exchanges have been publishing such reports in the wake of the FTX collapse as a way to help <a href=\"https:\/\/www.theblock.co\/post\/196717\/exchanges-are-counting-on-proof-of-reserves-to-restore-consumer-confidence-says-bitstamp-us-ceo\" data-v-f87c67ca=\"\">restore customer confidence<\/a>. Still, the reports have been criticized for not showing complete pictures of the companies' financial health. Meanwhile, the U.S. Securities and Exchange Commission said that it will <a href=\"https:\/\/www.theblock.co\/post\/197648\/sec-scrutiny-proof-of-reserves\" data-v-f87c67ca=\"\">increase its scrutiny<\/a> of financial reports.","Bitcoin and the general crypto market <a href=\"https:\/\/www.theblock.co\/post\/197436\/bitcoin-unchanged-dogecoin-adds-gains-amid-market-lull\" data-v-f87c67ca=\"\">did not see<\/a> significant price changes this past week. BTC continues to be locked in a sideways price action since losing the $20,000 level in early November. Bitcoin spent the last week trading in a tight $500 range between $16,400 and $16,900.","Crypto mining stocks did not do any better as they tracked lower than the BTC price. Mining stocks also saw downward price action after Core Scientific’s Chapter 11 bankruptcy protection filing.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$250 million","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$500","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"Dec. 23","content":"DATE"},{"type":"101%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Jan. 3","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"$16,900","content":"MONEY"},{"type":"Gary Wang","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$16,400","content":"MONEY"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Osato Avan-Nomayo","The Block"]}