{"summary":"Outlier Ventures and Saudi Arabia&#x27;s NTDP have announced a strategic partnership to launch a web3 accelerator program in Riyadh.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284674\/outlier-ventures-and-saudi-arabias-ntdp-announce-web3-accelerator-program","publishDate":"2024-03-26T07:34:17","id":12545,"type":null,"title":"Outlier Ventures and Saudi Arabia announce web3 accelerator program","category":["COMPANIES"],"content":["Outlier Ventures and Saudi Arabia's National Technology Development Program have announced a strategic partnership to launch a web3 accelerator program in Riyadh.","A Memorandum of Understanding has been signed, and the accelerator program will start later this year and will be part of Saudi Arabia's Saudi Vision 2030 plan. The accelerator's focus will be to support web3 startups in <a href=\"https:\/\/www.theblock.co\/post\/209458\/saudi-arabia-the-sandbox-agree-to-collaborate-on-metaverse-projects\" data-v-f87c67ca=\"\">Saudi Arabia<\/a>, with <a href=\"https:\/\/www.theblock.co\/post\/252383\/outlier-ventures-appoints-stephan-apel-ceo-jamie-burke-becomes-chairman\" data-v-f87c67ca=\"\">Outlier Ventures<\/a> providing expertise on web3 product development, entity structuring and token design. Startups selected for this accelerator program will receive mentorship from leading figures in the web3 sector and potential investment opportunities.","\"We are looking forward to bringing our 10 years’ experience, in-house world-class expertise and track record of helping web3 startups develop, to help build out the web3 ecosystem in Saudi Arabia, providing support to early-stage entrepreneurs,\" Outlier Ventures CEO and Founding Partner Stephan Apel said.","\"This partnership reinforces our commitment to advancing technology and fostering innovation in Saudi Arabia. By harnessing their extensive global expertise and advanced capabilities in the web3 industry, Outlier Ventures will bring tangible value and make significant contributions to enhancing the Kingdom's technological infrastructure,\" NTDP CEO Ibrahim Neyaz said.","<a href=\"https:\/\/www.theblock.co\/post\/167798\/saudi-arabias-central-bank-hires-former-accenture-exec-as-crypto-chief\" data-v-f87c67ca=\"\">Saudi Arabia<\/a> has been pursuing policies and investments related to cryptocurrency, web3 and the metaverse.","In October, the strategic investment arm of Saudi Arabia's NEOM megaproject <a href=\"https:\/\/www.theblock.co\/post\/259977\/saudi-arabias-neom-megaproject-proposes-investing-50-million-in-animoca-brands\" data-v-f87c67ca=\"\">proposed<\/a> an investment of $50 million in Animoca Brands. According to a statement made in October 2023, the partnership's goal is to promote the development of web3 infrastructure in the NEOM region that is aligned with the Saudi Vision 2030 plan.","\"Web3 technology and infrastructure development will not only be an important foundation of NEOM’s tech stack and architecture but also has the potential to revolutionize global industries. By partnering with a market-leading company like Animoca Brands, we hope to accelerate web3 technology development and adoption,\" NEOM Investment Fund CEO Majid Mufti said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Saudi Arabia","content":"LOCATION"},{"type":"Ibrahim Neyaz","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Riyadh","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kingdom","content":"LOCATION"},{"type":"October 2023","content":"DATE"},{"type":"Saudi Vision","content":"ORGANIZATION"},{"type":"Memorandum of Understanding","content":"ORGANIZATION"},{"type":"National Technology Development Program","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Stephan Apel","content":"PERSON"},{"type":"Majid Mufti","content":"PERSON"},{"type":"NTDP","content":"ORGANIZATION"},{"type":"Outlier Ventures","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":["STARTUP ACCELERATORS","STRATEGIC INVESTMENTS"],"authors":["Brian McGleenon","The Block"]}