{"summary":"Jason Stone&#x27;s KeyFi Inc. filed a complaint against the lending platform on Thursday, accusing it of fraud and calling it a Ponzi Scheme.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156494\/celcius-accused-of-fraud-in-lawsuit-by-former-money-manager","publishDate":"2022-07-07T21:28:15","id":12542,"type":null,"title":"Celsius accused of fraud in lawsuit by former money manager","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">A former Celsius contractor has filed a lawsuit against the troubled crypto lender, accusing the firm of mismanagement and fraud—claiming it is owed money based on hundreds of millions in profits generated.<\/span>","<span data-v-f87c67ca=\"\">According to a <\/span><a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=RvF30Mz2IZW63s1mjjau2Q==\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\"> with the New York state court on Thursday KeyFi Inc., a company founded by Jason Stone, has accused Celsius of fraud as well as owing KeyFi millions of dollars from a profit sharing agreement. Stone was also an employee of Celsius Network during 2021.<\/span>","Here's a passage from the suit:","\"From August 2020 through March 2021, Plaintiff generated hundreds of millions of dollars in profits for the parties’ mutual benefit. Those profits came in the form of transaction fees, rewards for staking tokens, and other appreciating assets. As in any investment relationship, Plaintiff and Stone were responsible for generating a profit on the funds provided to them, while Celsius was responsible for ensuring that its investment strategies would not prevent it from repaying its depositors in kind.\"","<span data-v-f87c67ca=\"\">Twitter user&nbsp;<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">0xb1<\/span><span data-v-f87c67ca=\"\">—which sources close to The Block confirmed is Stone's anonymous account—took to the social media site to <\/span><a href=\"https:\/\/twitter.com\/0x_b1\/status\/1545153652624691200?s=20&amp;t=kXwtzngTQbMH6ItlL13waA\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">say<\/span><\/a><span data-v-f87c67ca=\"\">, “given the public speculation about the company’s solvency, and my observation of Celsius’ loose relationship with the truth, I feel it is only prudent to finally set the record straight. I have brought legal action against Celsius to settle this issue once and for all.”<\/span>","Stone declined to comment further on the record.&nbsp;","<span data-v-f87c67ca=\"\">KeyFi Inc worked with Celsius between August 2020 and April 2021 staking and deploying DeFi strategies for the lending platform, according to Stone’s post. Throughout this period KeyFi \"generated hundreds of millions of dollars in profits for the parties’ mutual benefit\" according to Thursday's filing.<\/span>","<span data-v-f87c67ca=\"\">The filing goes on to say that Celsius had assured Stone its risk management team was monitoring its activity and their trading teams were “adequately hedging any potential impermanent loss from our activities in liquidity pools.”<\/span>","<span data-v-f87c67ca=\"\">According to the post and per the filing Celsius had lied to KeyFi about this, with Stone’s company alleging Celsius's portfolio had “naked exposure to the market.”<\/span>","<span data-v-f87c67ca=\"\">The filing goes on to claim that Celsius suffered severe losses during the 2021 crypto bull run, beginning in January 2021, as it had recklessly and fraudulently failed to hedge its investments.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It then goes on to add that the lender began offering high interest rates as it faced a liquidity crisis in order to “lure new depositors” becoming a Ponzi scheme in the process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Celsius has come under intense scrutiny over the past month after halting withdrawals on June 12, a month to the day after the Terra blockchain began to collapse.<\/span>","<span data-v-f87c67ca=\"\">Following the collapse of the Terra blockchain and against a choppy macroeconomic backdrop that has affected broader financial markets cryptocurrencies have plunged in price. The troubled market has led to liquidity issues for several crypto companies, including other lenders such as Voyager Digital and BlockFi.<\/span>","<span data-v-f87c67ca=\"\">Celsius did not immediately respond to request for comment from The Block.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"KeyFi millions of dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"March 2021","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"KeyFi Inc.","content":"ORGANIZATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"Jason Stone","content":"PERSON"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"June 12","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","Frank Chaparro","The Block"]}