{"summary":"The Bank of England is seeking a proof of concept for a sample wallet for a Central Bank digital currency and will take applications through Dec. 23.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193894\/bank-of-england-opens-bids-for-cbdc-sample-wallet-proof-of-concept","publishDate":"2022-12-10T16:09:37","id":12546,"type":null,"title":"Bank of England opens bids for CBDC sample wallet proof of concept","category":["CRYPTO INFRASTRUCTURE"],"content":["The Bank of England is <a href=\"https:\/\/www.digitalmarketplace.service.gov.uk\/digital-outcomes-and-specialists\/opportunities\/18948\" data-v-f87c67ca=\"\">seeking<\/a> a proof of concept for a sample wallet for a Central Bank digital currency and will take applications through Dec. 23.","While the bank said it will not develop a user wallet itself, it wants to explore the \"end-to-end user journey as a way to sharpen functional requirements for both the Bank and private sector\" and make the CBDC product \"more tangible for internal and external stakeholders.\" Key deliverables include a wallet mobile app for both Android and iOS, a wallet website, an example merchant website and a back-end server.","The bank said it hasn't previously done any work on a sample wallet for a potential CBDC. The budget range for the initial five-month contract is 200,000 pounds ($245,200).&nbsp;","The bid process comes as Chancellor of the Exchequer Jeremy Hunt <a href=\"https:\/\/www.theblock.co\/post\/193536\/uk-financial-reforms-push-crypto-investment\" data-v-f87c67ca=\"\">on Friday<\/a> shared a package of 30 regulatory reforms for UK financial services that included the issuance of a digital pound. The so-called Edinburgh Reforms seek to boost economic growth post-Brexit and foster innovation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Hunt","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Central Bank","content":"ORGANIZATION"},{"type":"$245,200","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Edinburgh","content":"LOCATION"},{"type":"Bank","content":"ORGANIZATION"},{"type":"Dec. 23","content":"DATE"}],"hashtag":["BOE","WALLET MAKERS"],"authors":["Nathan Crooks","The Block"]}