{"summary":"The price of bitcoin topped the $30,000 mark for the first time since June 2022, continuing a crypto rally that began at the start of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225627\/bitcoin-tops-30000-mark","publishDate":"2023-04-10T23:34:05","id":1255,"type":null,"title":"Bitcoin tops $30,000 mark for first time since June 2022","category":["MARKETS"],"content":["The price of bitcoin topped the $30,000 mark for the first time since June 2022, continuing a crypto rally that began at the start of this year.","CoinGecko <a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">data<\/a> showed bitcoin topping $30,000 late this evening, before it dipped slightly under the mark again. The world’s foremost cryptocurrency had <a href=\"https:\/\/www.theblock.co\/post\/225607\/bitcoin-flirts-with-30000-ether-nears-2000-as-crypto-beats-lagging-equities\" data-v-f87c67ca=\"\">earlier hit the threshold<\/a> on crypto exchanges including Coinbase and OKX.","Bitcoin was last at $30,000 in June 2022, as it fell for a prolonged period from the dizzying heights of the 2021 bull market of the year before, which had seen it trading as high as $67,000, according to CoinGecko. Bitcoin fell precipitously from there to a low of around $16,000 late last year — a year marked by a string of catastrophes for the crypto sector, including the implosion of Sam Bankman-Fried’s FTX.","Bitcoin is up 79% on the year, its run underpinned by bank runs that called into question the resiliency of centralized banking options. Since the beginning of the year, bitcoin has gained 79%, while ether has risen 59%.","Rich Rosenblum, co-founder and president of GSR, the crypto market maker, said a desire for “de-dollarization” has helped spur bitcoin’s resurgence, suggesting that countries are buying gold and bitcoin as a means to gain independence from the U.S.","“On the world stage of sovereigns, a few billion dollars is small, but it can have a large impact on crypto, especially during a time of crimped liquidity,” he added.","Source: CoinGecko","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"$16,000","content":"MONEY"},{"type":"GSR","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$67,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Rich Rosenblum","content":"PERSON"},{"type":"few billion dollars","content":"MONEY"},{"type":"79%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"59%","content":"PERCENT"},{"type":"this evening","content":"TIME"},{"type":"CoinGecko","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}