{"summary":"South Korean prosecutors have asked the country’s foreign ministry to invalidate Terraform Labs founder Do Kwon’s passport, according to local media.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170338\/south-korean-authorities-seek-to-invalidate-do-kwons-passport-munhwa","publishDate":"2022-09-15T06:52:32","id":12553,"type":null,"title":"South Korean authorities seek to invalidate Do Kwon&#x27;s passport: Munhwa","category":["LEGAL"],"content":["South Korean prosecutors asked the country’s foreign ministry to invalidate Terraform Labs founder Do Kwon’s passport on Thursday, according to a <a href=\"http:\/\/www.munhwa.com\/news\/view.html?no=2022091501039921275002\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> by Korean newspaper Munhwa.","The news comes a day after the Seoul Southern District Prosecutors Office <a href=\"https:\/\/www.theblock.co\/post\/169825\/south-korean-court-issues-warrant-for-do-kwons-arrest\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">issued an arrest warrant<\/a> for Kwon, who has been charged under the Capital Markets Act along with five others. The prosecutors also asked for their passports to be invalidated — except for Nicholas Platias, another Terraform Labs founder, who is not a Korean national.","Due to the length of time it may take to invalidate the passports — local media suggests up to a month — authorities will continue to pressure Kwon to return to South Korea. His last known whereabouts were in Singapore, where he has been based for much of the Terra collapse, and invalidating his passport would make him unable to travel.","In May, the company's algorithmic stablecoin, TerraUSD, depegged from the dollar, ultimately collapsing the Terra ecosystem and wiping out around $40 billion in value. While Terraform Labs and related entity the Luna Foundation Guard attempted to repeg TerraUSD, they were ultimately unsuccessful.","Kwon has since released plans to try and rebuild the Terra ecosystem, but remains subject to lawsuits from angry investors.","In an <a href=\"https:\/\/www.theblock.co\/post\/163521\/south-korean-investigators-havent-reached-out-about-terra-collapse-says-do-kwon\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">interview<\/a> in August, he said he had not been contacted at all by Korean investigators and that it was hard to make a decision about returning to South Korea, but emphasized he wasn't in Singapore for the purpose of evading investigators. He added that dealing with due process was not a question of what you are prepared to face but how you are going to face it.","“W<span class=\"s1\" data-v-f87c67ca=\"\">hat we're going to do is we're just going to put out the the facts as we know them. We're going to be totally honest and deal with whatever consequences as they may be,” he said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Nicholas Platias","content":"PERSON"},{"type":"Seoul Southern District Prosecutors Office","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["CRIME","DO KWON"],"authors":["Callan Quinn","The Block"]}