{"summary":"Institutional crypto platform Utila has raised $11.5 million in seed funding from NFX, Wing VC and Framework Ventures, among others.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280621\/utila-seed-funding","publishDate":"2024-03-05T09:00:03","id":12551,"type":null,"title":"Institutional crypto platform Utila raises $11.5 million in seed funding","category":["VENTURE CAPITAL"],"content":["Utila has raised $11.5 million in a seed funding round co-led by NFX and Wing VC to support the development of its institutional crypto platform. Framework Ventures and angel investors — including Balaji Srinivasan, Charlie Songhurst and Surojit Chatterjee — also participated in the round, among others.","Utila enables institutions and developers to manage digital assets securely via its non-custodial chain-agnostic wallet. The platform has already been used by dozens of institutional investors and crypto-native firms to facilitate over $3 billion in transactions over the past six months, the firm claimed.","The funding was raised throughout 2023 and will be used to accelerate product development and expand Utila's current team of 25 people, a Utila spokesperson told The Block. Utila declined to disclose a valuation or comment on the structure of the round.","Utila is designed to assist companies with operational, regulatory and security issues related to crypto adoption, according to the team. It argues that existing institutional crypto wallets have been hampered by a complex user experience.","\"Switching to Utila from traditional custodial trust companies was a pivotal moment for 1Konto, addressing key challenges with an innovative and efficient solution,” Edwin Handschuh, co-founder and CEO of digital assets trading platform 1konto said. “Thanks to their intuitive UI\/UX that significantly reduces the learning curve and allows for quicker settlements with clients.\"","“Utila is making enterprise-grade wallets more accessible, usable and secure than ever before,” NFX General Partner Morgan Beller said.","Utilia’s non-custodial wallet enables organizations to retain control over their assets across various networks, including Bitcoin, Ethereum, Ethereum Virtual Machine-compatible chains and Solana.","The platform is powered by MPC (multi-party computation) key management and claims to offer onboarding in less than five minutes, integrating with clients’ exchange accounts, DeFi and bank accounts. MPC involves splitting a private key into parts distributed among multiple parties, allowing them to jointly execute crypto transactions without any single party ever having access to the entire key.","Utila’s customers include institutions such as hedge funds, OTC desks, market makers and prime brokers, utilizing Utila for their trading operations, alongside crypto-native organizations such as custodians, exchanges and token issuers, the firm explained.","\"Utila is more than just a crypto wallet; it's a comprehensive ecosystem that addresses the current challenges in the crypto asset management space,” Utila co-founder and CEO Bentzi Rabi said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Bentzi Rabi","content":"PERSON"},{"type":"Edwin Handschuh","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"NFX General Partner Morgan Beller","content":"ORGANIZATION"},{"type":"$11.5 million","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Utila","content":"LOCATION"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"NFX","content":"ORGANIZATION"},{"type":"Charlie Songhurst","content":"PERSON"},{"type":"Utila","content":"ORGANIZATION"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Surojit Chatterjee","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SEED &AMP; PRE-SEED","WALLET MAKERS"],"authors":["James Hunt","The Block"]}