{"summary":"Hong Kong is mulling regulation on Hong Kong dollar-linked stablecoins with some firms planning to issue such stablecoins this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285249\/animoca-brands-hong-kong-stablecoin","publishDate":"2024-03-28T03:40:49","id":12552,"type":null,"title":"Animoca Brands chairman foresees growth in Hong Kong’s crypto space with local stablecoins","category":["ASIA"],"content":["Hong Kong dollar-pegged <a href=\"https:\/\/www.theblock.co\/post\/283857\/conflux-aims-for-q2-launch-of-hkd-pegged-stablecoin-with-anchorx\" data-v-f87c67ca=\"\">stablecoins<\/a>, when allowed in Hong Kong, may secure their unique territory in the already saturated crypto market, Animoca Brands Chairman Yat Siu told The Block at the BUIDL Asia conference in Seoul on Thursday.","<span data-v-f87c67ca=\"\">“The interesting thing different about the Hong Kong dollar versus most other currencies is that it’s pegged to the U.S. dollar,” Siu said in the interview. “Therefore, if you want to have another kind of regulated currency that, however, is non-American, but is yet tied to an American system as in the U.S. dollar, I think the Hong Kong dollar becomes a very interesting proxy.”&nbsp;<\/span>","Hong Kong stablecoins could find a pool of sizable, unique demand as the HKD is a U.S. dollar equivalent that is not the U.S. dollar and is outside the U.S. territory, Siu explained.","The city has been gearing up to allow the issuance of local HKD-pegged stablecoins, wrapping up a <a href=\"https:\/\/www.theblock.co\/post\/269292\/hong-kong-proposes-licenses-should-be-required-for-stablecoin-issuers\" data-v-f87c67ca=\"\">public consultation<\/a> last month on regulating and licensing stablecoin issuers. The Hong Kong Monetary Authority, its de facto central bank, launched a sandbox to stimulate communication between authorities and stablecoin issuers in complying with upcoming stablecoin regulations. <span data-v-f87c67ca=\"\">Siu<\/span> added that he expects to see more stablecoin regulatory developments this year.","At the same time, Hong Kong is moving closer to approving its first line of spot bitcoin exchange-traded funds (ETFs), with multiple local finance firms, including Venture Smart Financial Holdings (VSFG), <a href=\"https:\/\/www.theblock.co\/post\/275718\/hong-kong-finance-firm-vsfg-targets-to-apply-for-spot-ethereum-etf-in-q2\" data-v-f87c67ca=\"\">submitting<\/a> their applications to the Securities and Futures Commission.","The approval of Hong Kong’s spot bitcoin ETFs may accelerate Web3 investments in the region, Siu told The Block.","<span data-v-f87c67ca=\"\">“It’s entirely possible that after Hong Kong approves bitcoin spot ETFs, it may actually have different types of ETFs ahead of the U.S. because it has broadly, more clarity in the regulatory framework,” said Siu, who also saw potential for spot ether ETFs or funds based on GameFi tokens.&nbsp;<\/span>","The Animoca chairman said that the Web3 market is “back in a pretty big way” in the crypto bull cycle, and that the market is “fundamentally much stronger” from the perspective of a Web3 investment company.","<span data-v-f87c67ca=\"\">“Certainly in the near term, near to mid-term, I think Web3 is an Asia narrative because of the situation in the U.S.,” said Siu, explaining the sensitivity of U.S.-based firms with the Securities and Exchange Commission. “You have more freedom and more flexibility in Asia.”<\/span>","Animoca is currently focused on expanding its educational platform, Open Campus, while increasing investments in the field of Web3 gaming, Siu added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"BUIDL Asia","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Venture Smart Financial Holdings","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Siu","content":"PERSON"},{"type":"HKD","content":"ORGANIZATION"},{"type":"” Siu","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Seoul","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["ANIMOCA BRANDS"],"authors":["Danny Park","The Block"]}