{"summary":"Lazzarin will oversee research and security teams at the venture capital fund. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/209855\/a16z-crypto-taps-eddy-lazzarin-as-new-chief-tech-officer","publishDate":"2023-02-08T15:28:39","id":12550,"type":null,"title":"a16z crypto taps Eddy Lazzarin as new chief tech officer","category":["COMPANIES"],"content":["Eddy Lazzarin is the new chief technology officer at venture capital fund a16z crypto.","He previously served as head of engineering at the firm.","A16z crypto said Wednesday that it promoted Eddy Lazzarin to chief technology officer to oversee research and security teams at the venture capital fund.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“It takes a truly special intellect to stand out among the technologists in this field, and we’re fortunate to have one of those people on our team,” a16z crypto founder and managing partner Chris Dixon wrote in a <a href=\"https:\/\/a16zcrypto.com\/eddy-lazzarin\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">blog post<\/span><\/a>.","Lazzarin, who previously served as the firm’s head of engineering, will continue to lead the engineering and data science teams. A16z crypto invests in crypto and web3 startups and has raised more than $7.6 billion, according to its <a href=\"https:\/\/a16zcrypto.com\/\" data-v-f87c67ca=\"\"><span class=\"s1\" data-v-f87c67ca=\"\">website<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7.6 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Eddy Lazzarin","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Chris Dixon","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}