{"summary":"The Solana wallet provider said that it plans to hunt down the hacker and try to make its users whole.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162959\/slope-no-conclusive-evidence-tying-4-million-solana-hack-to-its-own-security-flaw","publishDate":"2022-08-11T07:34:18","id":12567,"type":null,"title":"Slope: No ‘conclusive evidence’ tying $4 million Solana hack to its own security flaw","category":["SECURITY"],"content":["Slope Finance says there is no “conclusive evidence” tying the major Solana hack to the wallet's own security flaw, according to a <a href=\"https:\/\/slope-finance.medium.com\/slope-update-11-august-2022-31d678d7cd97\" data-v-f87c67ca=\"\">statement<\/a> by the Solana wallet provider on Thursday. It is still investigating the attack but said that auditors are nearing their conclusions.","Slope wallet users — and others — were <a href=\"https:\/\/www.theblock.co\/post\/161141\/solana-exploit-enters-second-day-as-ceo-points-to-attack-on-apple-hot-wallets\" data-v-f87c67ca=\"\">victims of a malicious exploit<\/a> earlier in August that led to the theft of over $4 million in solana (SOL) tokens from more than <a href=\"https:\/\/dune.com\/queries\/1131755\" data-v-f87c67ca=\"\">9,000 addresses<\/a>. Solana researchers <a href=\"https:\/\/www.theblock.co\/post\/161325\/solana-team-traces-exploit-back-to-slope-mobile-wallets\" data-v-f87c67ca=\"\">traced the hack to a vulnerability<\/a> in the Slope mobile wallets where <a href=\"https:\/\/www.theblock.co\/post\/161425\/slope-wallet-provider-saved-user-seed-phrases-in-plain-text-solana-security-researchers-find\" data-v-f87c67ca=\"\">seed phrases were stored in plain text<\/a>.","Even though Slope acknowledged there was indeed a vulnerability, it remains skeptical that this was the cause of the hack.","According to Slope, while the security flaw did exist, the number of wallet addresses drained in the attack exceeded the number of Slope's compromised addresses. Plus it only found that 1,444 of its compromised addresses were drained, far fewer than the total number that were drained.","The Solana wallet provider also stated that, despite the vulnerability, access to the server — where the seed phrase information was stored in plain text — was protected by end-to-end encryption. This server also had an additional three-factor authentication protocol set up for granting access, the statement added.","Based on these reasons, Slope said, \"there is no conclusive evidence from the auditors to link the Slope vulnerability to the exploit.\"","Slope said its investigations did not find any additional security issues. As such, the wallet provider says the latest patched version of the Slope wallet is safe for use. Slope did, however, decry the events of last week in its statement adding that the existence of the security flaw alone was enough to put user funds in danger.","“This is nowhere near the security standard that Slope set out to establish and maintain, and we are deeply regretful of these occurrences. Security is paramount to us, and our user base is everything. We should never have let this happen,” today’s announcement stated.","Following the hack, Slope <a href=\"https:\/\/www.theblock.co\/post\/161886\/slope-wallet-says-it-will-pay-10-bounty-if-attacker-returns-stolen-funds\" data-v-f87c67ca=\"\">offered a 10% bounty to the attackers<\/a> if they returned the stolen funds.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Slope","content":"LOCATION"},{"type":"Slope","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["SOLANA"],"authors":["Osato Avan-Nomayo","The Block"]}