{"summary":"Kim Kardashian has been charged by SEC for touting cryptocurrency on social media, the reality TV star will co-operate with the regulator in its ongoing investigation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174416\/sec-charges-kim-kardashian-for-unlawfully-promoting-ethereummax","publishDate":"2022-10-03T07:48:05","id":12568,"type":null,"title":"Kim Kardashian charged by SEC for unlawfully promoting EthereumMax","category":["REGULATION"],"content":["Kim Kardashian has been <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2022-183\" data-v-f87c67ca=\"\">charged<\/a> with unlawfully touting a crypto security by the Securities and Exchange Commission (SEC).","The regulator said that Kardashian didn't disclose the payment received for the promotion of EthereumMax's token. The star has agreed to pay $1.26 million in penalties and will work with the SEC on its ongoing investigation.","\"This case is a reminder that, when celebrities or influencers endorse investment opportunities, including crypto asset securities, it doesn’t mean those investment products are right for all investors,\" SEC Chair Gary Gensler <a href=\"https:\/\/twitter.com\/GaryGensler\/status\/1576897535427448832?t=tpSW9fGb-2x4YsYIGlr5Qw&amp;s=19\" data-v-f87c67ca=\"\">said<\/a> on Twitter.","Kardashian serves as a reminder to celebrities and others that they must disclose how much they are paid to promote investing in securities, as required by law, Gensler added.","The star failed to disclose that she received a payment of $250,000 for publishing a post to her Instagram account about EMAX tokens, the token offered by EthereumMax. The post included a link to the EtheruemMax website, with instructions on how to buy EMAX.","Under federal securities law celebrities, or individuals promoting a crypto asset security must disclose the nature, source and amount of compensation they received in exchange for the promotion, Gurbir S. Grewal, Director of the SEC’s Division of Enforcement said.","\"Investors are entitled to know whether the publicity of a security is unbiased, and Ms. Kardashian failed to disclose this information,\" Grewal concluded.","Kardashian didn’t admit to or deny any of the regulator's findings and agreed to pay $1.26 million. This fee includes approximately $260,000 in disgorgement – representing her promotional payment, plus prejudgment interest – as well as a $1,000,000 penalty.","The star also agreed not to promote any “crypto asset securities” for three years.","The SEC's investigation into EthereumMax is ongoing.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"$1,000,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Grewal","content":"PERSON"},{"type":"$260,000","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"EthereumMax","content":"ORGANIZATION"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"Kardashian","content":"PERSON"},{"type":"$1.26 million","content":"MONEY"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["SEC","SOCIAL MEDIA"],"authors":["Adam Morgan McCarthy","The Block"]}