{"summary":"Blockchain.com cofounder and CEO Peter Smith doesn’t see crypto credit markets making a comeback any time soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252447\/blockchain-ceo-crypto-credit-markets-3ac","publishDate":"2023-09-22T01:56:14","id":12560,"type":null,"title":"Blockchain.com CEO doesn&#x27;t see crypto credit markets &#x27;coming back in the same way&#x27; after 3AC","category":["COMPANIES"],"content":["Peter Smith, co-founder and CEO of one of the crypto sector’s biggest lenders in Blockchain.com, doesn’t see crypto credit markets making a comeback any time soon.","Blockchain.com was a major lender to the failed hedge fund Three Arrows Capital before it collapsed into bankruptcy a little over a year ago. At the time, Smith said in a letter to shareholders that the business&nbsp;<a href=\"https:\/\/www.reuters.com\/technology\/blockchaincom-faces-270-mln-hit-loans-bankrupt-three-arrows-coindesk-2022-07-08\/\" data-v-f87c67ca=\"\">faced a $270 million hit<\/a> on its loans to the group.","Speaking about the impact of 3AC’s collapse at the Token2049 conference in Singapore last week, Smith said the event had caused “a massive contraction in the credit markets.”","“I don’t see the credit markets coming back in the same way. I think applying the models from TradFi to crypto won’t work. I think you’ll see credit stay overcollateralized, which is where most credit deals are today,” he said.","“The crypto industry is going to need to find a way to finance liquidity and leverage in a more risk-controlled fashion, and I don’t think the industry has quite figured that out yet.”","<a href=\"https:\/\/www.theblock.co\/post\/158169\/three-arrows-capital-3ac-creditors-list-3-5-billion-crypto-affidavits\" data-v-f87c67ca=\"\">3AC owed creditors at least $3.5 billion when it filed for bankruptcy<\/a> last year, according to documents filed at the time. Since then, the fund’s liquidators, Teneo, have repeatedly complained about a lack of cooperation from co-founders Kyle Davies and Su Zhu.","In January, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-01-05\/3ac-liquidators-demand-documents-from-founders-via-twitter\" data-v-f87c67ca=\"\">Teneo tried to subpoena the pair via a post on X (formerly Twitter)<\/a>. More recently, in June, reports surfaced that Teneo <a href=\"https:\/\/www.theblock.co\/post\/236717\/3ac-liquidators-seek-1-3-billion-from-zhu-davies-bloomberg\" data-v-f87c67ca=\"\">aimed to recover $1.3 billion<\/a> from Davies and Zhu after alleging they were responsible for losses equal to that sum due to racking up debt in the months immediately before 3AC’s collapse.","In its pomp, 3AC reportedly managed some $10 billion in assets and invested in everything from liquid tokens to startup equity and NFTs. Its founders built up sizeable followings on social media with brash posts about their investment ideas. <a href=\"https:\/\/www.theblock.co\/linked\/149111\/su-zhu-says-his-supercycle-price-thesis-was-regrettably-wrong\" data-v-f87c67ca=\"\">Zhu once espoused a so-called “supercycle” thesis<\/a> that forecast the price of bitcoin hitting $2.5 million.","Such was 3AC’s standing in the industry that it was able to borrow vast sums while offering disclosures that were relatively light on detail. One example — an excerpt from a one-page letter entitled “AUM Report,” part of a collection of affidavits obtained by The Block last year — shows Davies disclosing the fund’s Net Asset Value to a lender in a single sentence.","“Crypto had been a relatively high-trust environment for a long time,” Smith said at the conference. “The Three Arrows collapse really was the first thing that made a lot of people question that, and it make the market really nervous about counter-party risk.”","“I can only speak in a general sense about the Three Arrows situation. The reality is that disclosures and risk reporting only work when the reports submitted are accurate.”","When pressed, Smith declined to comment specifically on whether the reports Blockchain.com received were inaccurate. Zhu and Davies did not immediately respond to requests for comment. Teneo did not respond to a request for comment.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kyle Davies","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Smith","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Peter Smith","content":"PERSON"},{"type":"$270 million","content":"MONEY"},{"type":"Davies","content":"PERSON"},{"type":"$3.5 billion","content":"MONEY"}],"hashtag":["CRYPTO BANKS AND LENDERS","INVESTMENT FIRMS","THREE ARROWS CAPITAL"],"authors":["Ryan Weeks","The Block"]}