{"summary":"Crypto firms pivoting toward AI amid the prolonged winter may have something new to be on the lookout for.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245414\/ai-tokens-may-risk-double-scrutiny-after-gary-gensler-takes-aim-at-artificial-intelligence","publishDate":"2023-08-15T16:11:30","id":12570,"type":null,"title":"AI tokens risk double scrutiny as Gensler takes aim at artificial intelligence","category":["POLICY"],"content":["Crypto firms pivoting toward <a href=\"https:\/\/www.theblock.co\/post\/241942\/ai-tokens-see-lowest-weekly-trading-volume-since-january\" data-v-f87c67ca=\"\">AI<\/a> amid the prolonged winter may have something new to be on the lookout for, with Securities and Exchange Commission chair Gary Gensler saying on Tuesday that he's got artificial intelligence on his radar.&nbsp;","Gensler, who's well known for leading a regulatory <a href=\"https:\/\/www.theblock.co\/post\/241820\/gensler-raises-concerns-about-fraud-and-manipulation-when-asked-about-bitcoin-etfs\" data-v-f87c67ca=\"\">crackdown<\/a> on crypto exchanges including Coinbase, used a lengthy <a href=\"https:\/\/twitter.com\/GaryGensler\/status\/1691473257805783040\" data-v-f87c67ca=\"\">thread<\/a> on the social network formerly known as Twitter to call AI \"the most transformative tech of our time.\" But he also said that \"bad actors\" could possibly use it to influence capital markets.&nbsp;","\"We @SECGov are technology neutral,\" <a href=\"https:\/\/www.theblock.co\/post\/240676\/gensler-declines-to-say-if-or-when-the-sec-might-appeal-ripple-decision\" data-v-f87c67ca=\"\">Gensler<\/a> wrote. \"We focus on the outcomes, rather than the tool itself. Securities laws, though, may be implicated depending upon how AI tech is used. Within our current authorities, we’re focused on protecting against both the micro &amp; macro challenges of AI.\"","The <a href=\"https:\/\/www.theblock.co\/post\/245442\/republicans-wants-the-sec-to-hand-over-documents-on-prometheum-license\" data-v-f87c67ca=\"\">SEC<\/a> chair highlighted AI's use in new fintech tools like robot-advisers and AI brokerage apps.","\"AI is used in finance for account openings, compliance programs, trading algorithms, sentiment analysis and more,\" he said, noting that the technology can creates more risk for consumers with its ability to significantly improve customer targeting and narrowcasting.&nbsp;","\"Under the securities laws, fraud is fraud,\" Gensler continued. \"The SEC is focused on identifying and prosecuting any form of fraud that might threaten investors, capital formation, or the markets more broadly,\" he said.","Many crypto firms capitalized on the interest in artificial intelligence tools after the launch of <a href=\"https:\/\/www.theblock.co\/post\/240758\/immunefi-chatgpt-generated-web3-bug-bounty-reports\" data-v-f87c67ca=\"\">ChatGPT<\/a> in November 2022, and blockchain technology and AI have converged to form a subset called AI cryptocurrencies.","The new tokens combine the innovations of both zeitgeists, and the top six AI coins by market capitalization are <a href=\"https:\/\/www.theblock.co\/post\/234561\/the-graph-arbitrum\" data-v-f87c67ca=\"\">The Graph<\/a>, Render, Injective, <a href=\"https:\/\/www.theblock.co\/post\/240257\/oasis-releases-framework-to-offer-privacy-to-third-party-evm-chains\" data-v-f87c67ca=\"\">Oasis Network<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/213413\/imgnai-ai-crypto-startup-raise\" data-v-f87c67ca=\"\">SingularityNET<\/a> and Fetch.ai.","Some of the tokens back protocols that use blockchains for building and monetizing AI applications, data and services. Others use the combination of blockchain and AI to automate blockchain-based trading and supply chain logistics.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Oasis Network","content":"ORGANIZATION"},{"type":"Injective","content":"LOCATION"},{"type":"November 2022","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Brian McGleenon","The Block"]}