{"summary":"The SEC presses firms to disclose if they have exposure to crypto or entities that have improperly safeguarded their customers&#x27; crypto assets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/193407\/sec-wants-firms-to-disclose-if-they-have-crypto-exposure","publishDate":"2022-12-08T15:35:00","id":12578,"type":null,"title":"SEC wants firms to disclose if they have crypto exposure","category":["LEGAL"],"content":["The U.S. Securities and Exchange Commission wants companies to publicly disclose if they have exposure to crypto assets, including whether they do business with any crypto-related companies.&nbsp;","The regulatory agency, which oversees disclosures for public companies in the U.S., said the guidance is due to, \"<span id=\"page186R_mcid16\" class=\"markedContent\" data-v-f87c67ca=\"\"><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">Recent bankruptcies and financial distress among crypto asset market participants,\" that occurred this year, most recently the high-profile implosion of FTX and its corporate family. \"I<span id=\"page186R_mcid32\" class=\"markedContent\" data-v-f87c67ca=\"\">n meeting their disclosure obligations, <\/span><span id=\"page186R_mcid33\" class=\"markedContent\" data-v-f87c67ca=\"\">companies should consider the need to address crypto asset market developments in their filings <\/span><span id=\"page186R_mcid34\" class=\"markedContent\" data-v-f87c67ca=\"\">generally, including in their business descriptions, risk factors, and management’s discussion and <\/span><span id=\"page186R_mcid35\" class=\"markedContent\" data-v-f87c67ca=\"\">analysis,\" the agency guidance continues.&nbsp;<\/span><\/span><\/span>","Firms must disclose if they have direct or indirect relations with companies that have filed for bankruptcy, experienced excessive redemptions or withdrawals of crypto assets, maintain unaccounted crypto assets of customers and experienced corporate compliance failures.","In addition, companies must describe how the bankruptcies of certain firms affected their businesses and that the company must take safeguards to protect its customers' crypto assets.&nbsp;","The news comes after FTX's collapse led to fears of financial contagion in crypto markets, as well as increased <a href=\"https:\/\/www.theblock.co\/post\/189351\/sec-facing-rising-scrutiny-after-ftxs-epic-implosion\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">scrutiny<\/a> of the SEC. The guidance will be posted to an SEC website, \"and is intended to be illustrative of the types of comments we might send to public company issuers if\/when applicable,\" an agency spokesperson told The Block.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX","SEC"],"authors":["MK Manoylov","Kollen Post","The Block"]}