{"summary":"Over 18,000 distinct assets have been minted since Taproot Assets&#x27; mainnet release, paving the way for assets like stablecoins on Bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258634\/taproot-assets-bitcoin-renaissance-elizabeth-stark","publishDate":"2023-10-20T06:46:54","id":1258,"type":null,"title":"Taproot Assets can help usher in the &#x27;Bitcoin Renaissance,&#x27; says Lightning Labs co-founder","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">Lightning Labs CEO and co-founder Elizabeth Stark told The Block Taproot Assets can help usher in the “<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.08%\n    <\/span><\/a> <!----><\/span><\/span> Renaissance,” making Lightning a multi-asset network and potentially “cementing Bitcoin's place as the internet of money.”<\/span>","Taproot Assets v0.3 was <a href=\"https:\/\/lightning.engineering\/posts\/2023-10-18-taproot-assets-v0.3\/\" data-v-f87c67ca=\"\">released on mainnet<\/a> alpha on Wednesday, paving the way for issuing stablecoins and other assets on Bitcoin. The release currently supports on-chain functionality, with Lightning support coming soon, according to Lightning Labs. The idea is to transform Bitcoin into a scalable multi-asset network without compromising its core tenets.","“Since the launch, we've been blown away by the level of developer activity with over 18,000 distinct assets minted on mainnet,” Stark said. “Mints can either create a single asset or a batch of assets of the same type — for instance, a mint could issue a certain asset with a supply of 21 million.”","In terms of the estimated timeline for Lightning support, “It's always a challenge to give exact timelines when it comes to protocol development, but the team says it's hard at work to get this out to the world as soon as possible,” Stark added. “We recently shipped v0.17 of our Lightning implementation LND with Taproot channel support, which was an important prerequisite for Taproot Assets on the Lightning Network. With the next halving quickly approaching, now's the time to accelerate development on Bitcoin.”","“The protocol only requires an issuer to make a single bitcoin transaction to mint an effectively unbounded amount of Taproot Assets, and all of the metadata describing those assets is stored off-chain, with only a cryptographic commitment to the assets stored on-chain,” Gentry told The Block. “Unlike other protocols that store data directly on the blockchain, which resulted in the congestion we’ve seen this past year, this design makes minting and transacting assets on-chain extremely efficient.”","“While the release supports mainnet, the alpha tag indicates that we expect the community to test it for potential bugs,” Gentry wrote in the announcement.","Lightning Network operates as a network of bi-directional payment channels on top of the Bitcoin blockchain, designed to enable fast and cost-effective micropayments.","The rise of stablecoins cannot be understated, with total stablecoin supply exceeding $122 billion, according to The Block’s data dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Lightning Labs said user demand for stablecoins is “overwhelming,” with stablecoin issuers holding more U.S. Treasuries than major developed countries like Germany and South Korea and countries like El Salvador already embracing <a href=\"https:\/\/www.theblock.co\/post\/107699\/el-salvador-becomes-the-first-country-ever-to-make-bitcoin-legal-tender\" data-v-f87c67ca=\"\">bitcoin as legal tender<\/a>.","<span data-v-f87c67ca=\"\">U.S. Treasuries held. Image: <a href=\"https:\/\/lightning.engineering\/posts\/2023-10-18-taproot-assets-v0.3\/\" data-v-f87c67ca=\"\">Lightning Labs via Hard Yaka<\/a>.<\/span>","Stablecoins' digital nature and potential for self-custody make them more accessible, adding to global utility. Their relative price stability also makes them attractive for billions of people compared to inflation-hit local currencies, Gentry argues, adding that Taproot Assets bringing stablecoins to bitcoin wallets will only accelerate the process.","The Ethereum and Tron networks currently dominate stablecoin demand, fueled by low-cost, fast transactions. However, Taproot Assets offers two major advantages as a stablecoin protocol: “it will integrate with the Lightning Network, which provides the instant settlement and low fee experience that stablecoin users continually demand, and it settles onto the Bitcoin blockchain, which is by far the most secure and reliable,” Gentry told The Block. “We continually hear from builders that if they could provide end users with stablecoins on their Bitcoin and Lightning infrastructure, they would, so we expect uptake to be swift.”","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/usdt-supply-by-blockchain-daily\/embed\" title=\"USDT Supply by Blockchain\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","“Our focus is on financial assets and especially stablecoins as that's where we've heard the most demand from our users and our community,” Stark added. “Many people in emerging markets that live under inflationary conditions are looking for low fee ways to transact with a stable USD value, or are otherwise hit with high fees and an unstable financial system. We've also seen increasing demand for USD machine-to-machine payments with the advent of AI agents and our L402 protocol for native payment authentication.”","Bitfinex CTO Paolo Ardoino <a href=\"https:\/\/www.theblock.co\/post\/258350\/bitfinex-rgb-bitcoin-stablecoins\" data-v-f87c67ca=\"\">recently<\/a> told The Block it saw RGB — a smart contracts system and off-chain protocol for Bitcoin and the Lightning Network — as representing the best opportunity to issue USDT on Bitcoin after discontinuing Omni support. However, he also appears to be a fan of Taproot Assets, <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1714732506946134062\" data-v-f87c67ca=\"\">calling<\/a> it “the future we deserve.”","Among other use cases opened up by the release, Lightning Labs envisions a future where global currencies are issued as Taproot Assets and foreign exchange transactions settled in an instant over the Lightning Network. Such Taproot Asset Lightning transactions would utilize existing bitcoin liquidity, allowing Lightning nodes to forward Taproot Assets transactions without knowing it, Gentry noted — boosting Bitcoin’s network effects and creating a global routing network for the internet of money.","Further, developers have also been experimenting with real-world assets like gold, U.S. Treasuries and corporate bonds, Gentry stated. “The ability to issue real-world assets on bitcoin will also be unlocked with the Taproot Assets protocol, including for example issuing a debt instrument,” Stark added. “We expect to see significant demand to have all sorts of financial assets issued on the most secure blockchain with the most value backing it up, aka Bitcoin.”","With the release of Taproot Assets v0.3, developers have the tools to start issuing, managing and exploring mainnet assets on-chain, the team said. The asset issuance APIs have been improved, and there's also support for tranched issuance, ensuring fungibility across assets minted at different times.","Taproot Assets v0.3 allows users to send and receive assets even if both parties aren't online simultaneously, and the new “Multiverse” mode enables “Universe” servers — repositories that store all the necessary information for a Taproot Asset — to support and track multiple assets, ensuring data reliability even if one server is offline.","Furthermore, Taproot Assets’ forward compatibility ensures that assets issued today remain functional, regardless of potential enhancements down the line.","The mainnet alpha development required significant improvements in security, scalability and developer experience, according to the team — including tools for performance testing and advanced security measures.","“Our team has had extensive experience building LND, the leading Lightning Network implementation,” Gentry told The Block. “They were able to leverage that experience in designing Taproot Assets, which maximizes scalability for users by minimizing the protocol’s on-chain footprint, just like Lightning does.”","“At the end of the day, our biggest challenge was our inability to clone roasbeef (Laolu Osuntokun, CTO of Lightning Labs and creator of the protocol),” Stark added.","The ultimate goal is clear: transforming Lightning into a multi-asset network, which Lightning Labs will now focus on following this Taproot Assets release.","“Once we have completed the payment channel functionality of the protocol, users will be able to send and receive the currency of their choice over the Lightning Network, using the existing bitcoin liquidity as a global routing currency and medium of exchange,” Gentry noted.","Prior to the mainnet launch, nearly 2,000 assets were minted on testnet, experimenting with stablecoins, collectibles and the potential for real-world assets. Projects like Joltz Rewards, Nostr Assets, Royllo, Deezy, Speed, DFX Swiss and Tiramisu Wallet are currently building out Taproot Assets infrastructure of web wallets, mobile wallets, open source software development kits, asset explorers, developer tools and Nostr integrations.","Lightning Labs released the initial <a href=\"https:\/\/www.theblock.co\/post\/173488\/lightning-labs-releases-initial-taro-protocol-code\" data-v-f87c67ca=\"\">Taro protocol code<\/a> in September 2022 as part of its goal to “bitcoinize the dollar.” However, the name was changed to Taproot Assets after blockchain startup <a href=\"https:\/\/www.theblock.co\/post\/219992\/blockchain-startup-tari-labs-wins-restraining-order-against-lightning-labs-over-taro-protocol\" data-v-f87c67ca=\"\">Tari Labs<\/a> won a temporary restraining order against the company, alleging Taro bore a similar name to its own trademark and offered similar services.","In July, Lightning Labs also released a new suite of tools designed for <a href=\"https:\/\/www.theblock.co\/post\/238250\/lightning-labs-releases-new-bitcoin-tools-for-ai-development\" data-v-f87c67ca=\"\">AI development<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"+1.08%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"RGB","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Lightning Labs via Hard Yaka","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"Gentry","content":"PERSON"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Laolu Osuntokun","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Germany","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Nostr integrations","content":"ORGANIZATION"},{"type":"$122 billion","content":"MONEY"},{"type":"Taproot Asset Lightning","content":"ORGANIZATION"},{"type":"Royllo","content":"PERSON"},{"type":"Deezy","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Joltz Rewards","content":"ORGANIZATION"},{"type":"Elizabeth Stark","content":"PERSON"},{"type":"Tari Labs","content":"PERSON"},{"type":"Taproot Assets","content":"ORGANIZATION"},{"type":"September 2022","content":"DATE"},{"type":"The Block Taproot Assets","content":"ORGANIZATION"},{"type":"Lightning Labs","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}