{"summary":"Digital Asset, creator of the open source DAML smart contract language, has secured $35 million in Series C funding, bringing the company’s total raised","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/50075\/digital-asset-raises-35m-series-c-as-it-looks-to-continue-focus-on-smart-contract-offerings","publishDate":"2019-12-11T09:00:25","id":12584,"type":null,"title":"Digital Asset raises $35M Series C as it looks to continue focus on smart contract offering","category":["TECHNOLOGY"],"content":["Digital Asset, creator of the open source DAML smart contract language, has secured $35 million in Series C funding, bringing the company’s total raised to $150 million.","Founded in 2014, the New York-based financial technology firm is currently led by Yuval Rooz, the company’s former COO who <a href=\"https:\/\/www.theblockcrypto.com\/post\/16430\/digital-asset-picks-new-ceo-after-exit-of-blythe-masters\" data-v-f87c67ca=\"\">took the position<\/a> of CEO in March after Wall Street veteran Blythe Masters stepped down alongside a number of other key personnel.&nbsp;","The company has previously <a href=\"https:\/\/www.crunchbase.com\/organization\/digital-asset-2\" data-v-f87c67ca=\"\">raised<\/a> from Goldman Sachs, Citigroup, JP Morgan, and Jefferson River Capital, and the Australian Securities Exchange (ASX), among other firms. According to a company spokesperson, the latest funding round was led by ASX and Jefferson River Capital. Other participants include both new and returning investors.&nbsp;","<strong data-v-f87c67ca=\"\">New product partners<\/strong>","Digital Asset <a href=\"https:\/\/hub.digitalasset.com\/hubfs\/Press%20Releases\/DAML_Open_Source_Press_Release_4.4.19.pdf\" data-v-f87c67ca=\"\">open sourced<\/a> DAML in April, making the source code for the program freely available to all developers under the very permissive Apache 2.0 license. As such, the firm says users can more easily modify the language to build their own applications or integrate it with other platforms. Since then, the company has integrated DAML with partners including VMware, Hyperledger Fabric, and Hyperledger Sawtooth.","The company intends to use its latest influx of investment to hire new headcounts, expand DAML enabled partner products, invent new developer tools for DAML users, and foster the formation of a DAML community through local events and meetups, a Digital Asset spokesperson told The Block. Specifically, it plans to use the funds to promote wider adoption of its <a href=\"https:\/\/projectdabl.com\/\" data-v-f87c67ca=\"\">project:DABL<\/a> launched in October—a new cloud-based development and deployment environment for DAML applications.","DAML is an open-source language for smart contracts—a vital component of the distributed ledger technology (DLT)—developed by Digital Asset. When companies handle multi-party financial agreements, they often need to synchronize duplicate versions of the same information through a cumbersome process. DLT automates certain functions for contract writers so they can focus on the underlying business logic rather than complex technical details.","“DAML allows you to focus only on what you need to do to differentiate your product and eliminate the complexity that doesn’t provide value to your organization,” said Rooz. “Ninety percent of development time is wasted on undifferentiated work. With this new funding we will go further on this mission to focus on the 10 percent value-add by providing a world class smart contract experience regardless of where your application runs.”&nbsp;","<strong data-v-f87c67ca=\"\">Headcount decline and shift<\/strong>","The injection of fresh capital follows reports of a declining headcount at Digital Asset. As reported by Business Insider's Dan DeFrancesco, the firm saw its headcount shrink by at least 25% since last April. Citing former employees, the exits were a mix of \"people leaving on their own accord as well as staff reductions.\" Some claimed the firm was strapped for cash after it was unable to scale its distributed ledger platform.&nbsp;","\"The execution of our strategy is the result of years of planning, engineering work and careful evaluation of the market opportunity rather than a reaction to external pressures or perceived failures,\" as a spokesperson described the shift.&nbsp;","In any case, it is no secret that over the last year Digital Asset has made a pivot. Despite making its name, and raising most of its capital, on the pitch that it would work with banks to implement blockchain technology to improve different functions such as trade processing, the firm has concentrated its efforts on DAML.&nbsp;","\"We also believe the DAML is a differentiator compared to everything else out there,\" Rooz told The Block during an interview in July. \"And what you're seeing recently is us putting a lot of emphasis on where we think DAML could cause a significant and positive change to the industry.\"","Indeed, the success of its original distributed ledger platform has been limited to one major firm. In August, Digital Asset teamed up with the $2 trillion ASX to help the firm replace its current CHESS system for equities clearing and settlement with a new DLT-based platform. The new system is set to start running in March-April 2021.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"ASX","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"April 2021","content":"DATE"},{"type":"Yuval Rooz","content":"PERSON"},{"type":"last April","content":"DATE"},{"type":"July","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"Rooz","content":"PERSON"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"Dan DeFrancesco","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"August","content":"DATE"},{"type":"Ninety percent","content":"PERCENT"},{"type":"$2 trillion","content":"MONEY"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"Digital Asset","content":"ORGANIZATION"},{"type":"Hyperledger Fabric","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Blythe Masters","content":"ORGANIZATION"},{"type":"VMware","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Jefferson River Capital","content":"ORGANIZATION"},{"type":"10 percent","content":"PERCENT"},{"type":"October","content":"DATE"},{"type":"DAML","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Yilun Cheng","Frank Chaparro","The Block"]}