{"summary":"Cryptocurrency data provider CoinMarketCap has launched a new page, where it publishes interest rates offered on several cryptocurrencies, to help users compare and choose a suitable product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43460\/coinmarketcap-now-publishes-interest-rates-on-cryptocurrencies-allowing-users-to-compare-and-choose","publishDate":"2019-10-16T10:00:04","id":12594,"type":null,"title":"CoinMarketCap now publishes interest rates on cryptocurrencies","category":["CRYPTOCURRENCY"],"content":["Cryptocurrency data provider CoinMarketCap has launched a new page, where it publishes interest rates offered on several cryptocurrencies, to help users compare and choose a suitable product.","Dubbed “<a href=\"https:\/\/interest.coinmarketcap.com\/\" data-v-f87c67ca=\"\">Interest by CoinMarketCap<\/a>,” the page has launched today with 33 cryptocurrencies and stablecoins. It covers information from major lending platforms, including BlockFi, Celsius Network, and Binance, among others. Users can find annualized interest rates, deposit terms such as minimum duration before realizing returns, and other information about these platforms.","The new offering took about 1.5 months of development - from concept to delivery, Carylyne Chan, chief strategy officer of CoinMarketCap, told The Block. “Our team started by researching interest rates, future prospects of rates in crypto, and analogs to traditional finance,” she added.","Just like how banks and other financial institutions provide deposit and loan services, cryptocurrency firms also do so. They offer interest rates to cryptocurrency and stablecoin depositors and lend these to users who may need it for margin trading, hedging, or as working capital.","The cryptocurrency lending sector is currently valued at <a href=\"https:\/\/www.theblockcrypto.com\/linked\/36152\/crypto-lending-sector-hits-nearly-5b-in-value-but-lenders-earn-less-than-2-interest-report\" data-v-f87c67ca=\"\">nearly $5 billion<\/a>, according to crypto credit assessment startup Graychain. And Celsius and Genesis have the highest volume with 65% of loan originations, per Graychain.","Having interest rates information in one place helps - LoanScan.io has already been providing such information. When asked how CoinMarketCap’s offering is different, Chan told The Block: “We think about this [offering] as part of the whole crypto space, not only focusing on the loans but as interest rates, which will lead us to other products related to it as well - such as detailed derivative data.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNotably, CoinMarketCap is not charging a fee from companies listed on the Interest page. “We will eventually introduce ads on to the page, similar to the main website,” to monetize the new offering, Chan told The Block.","CoinMarketCap has not raised any external funding to date and is “entirely bootstrapped,” said Chan, adding: “We don't plan to raise any funds soon; we can still continue bootstrapping and scaling at this point.”","There are currently 30 people working for CoinMarketCap. The figure was about 15 around this time last year, and 2 in the year before. The firm is “definitely” looking to hire more people, especially engineers, Chan told The Block.","CoinMarketCap is also hosting its inaugural conference, The Capital, next month in Singapore. It is expected to announce more new products at the time. While Chan did not disclose specific details, she said that the products will help to “deepen the experience for users” coming to CoinMarketCap.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIn June, bootstrapped CoinMarketCap also made its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/29082\/coinmarketcap-acquires-little-known-data-firm-as-it-seeks-to-improve-pricing-on-site\" data-v-f87c67ca=\"\">first acquisition<\/a> of tech startup Hashtag Capital, to provide a “true price” for cryptocurrencies.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Singapore","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"65%","content":"PERCENT"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Graychain","content":"LOCATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Carylyne Chan","content":"PERSON"}],"hashtag":["BINANCE","BLOCKFI"],"authors":["Yogita Khatri","The Block"]}