{"summary":"The world of NFTs has seen a huge leap over the past few years, and this trend has continued into 2022. Major NFT ecosystems have been rapidly growing in their NFT trading volume and application size. Besides Ethereum, numerous ecosystems, such as BNB Chain and Polygon, have developed their own market for NFTs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140581\/poly-network-is-building-cross-chain-nft-adoption-and-circulation","publishDate":"2022-04-06T09:00:25","id":12599,"type":null,"title":"Poly Network Is Building Cross-Chain NFT Adoption and Circulation","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The world of NFTs has seen a huge leap over the past few years, and this trend has continued into 2022. <\/span><span data-v-f87c67ca=\"\">Major NFT ecosystems have been rapidly growing in their NFT trading volume and application size. Besides Ethereum, numerous ecosystems, such as BNB Chain and Polygon, have developed their own market for NFTs.<\/span><\/span>","<span data-v-f87c67ca=\"\">However, one significant limitation of NFT projects is that they are usually minted and developed on one or two blockchains at the most. This approach has led to&nbsp; constraints such as a lack of interoperability--the sharing and access of data between two networks.<\/span>","<span data-v-f87c67ca=\"\">If an NFT is confined to just one blockchain, there can only be a limited number of transactions, which limits its stability and growth in price. Both users and NFT projects have a need to transfer NFTs to marketplaces and blockchains with better liquidity, such as Ethereum. NFT cross-chain can improve the current fragmentation of NFTs and enhance their liquidity. This provides users and projects with the opportunity to migrate their NFTs, when there isn’t enough liquidity on the chain they are on.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Another example of a limitation of the single blockchain approach, is that only the blockchain’s native token can be used to buy the NFTs developed on that network. For example, NFTs on Ethereum,one of the most popular NFT platforms, can only be purchased using ETH. Moreover, Ethereum is known for its exuberant gas fees (transaction fees), forcing users to spend a substantial amount of their NFT budgets on transaction fees alone.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">To provide an effective and innovative solution to this problem, and support the NFT ecosystem’s development, <\/span><span data-v-f87c67ca=\"\">Poly Network launched a cross-chain NFT bridge in 2021. Poly NFT Bridge helps expand NFT marketplaces to reach a wider audience and give NFTs more exposure through cross-chain capabilities.<\/span><\/span>","<span data-v-f87c67ca=\"\">Poly Network has done a great job of updating its official website. The new and refreshed website is now live and includes changes to navigation, with dropdown menus for both mobile and desktop versions. It also modified its content structure, improving readability.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">On the Poly NFT Bridge site, a host of practical and impactful changes were implemented to improve user experience. Check it out and explore: <\/span><a href=\"https:\/\/bridge.poly.network\/nft\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/bridge.poly.network\/nft<\/span><\/a><\/span>","<span data-v-f87c67ca=\"\"><\/span>","","<span data-v-f87c67ca=\"\">Cross-chain NFTs are the foundation and portal to the multi-chain metaverse. To unlock their full potential, the market needs a cross-chain interoperability protocol that is technically reliable and compatible both with digital assets and NFTs.<\/span>","<span data-v-f87c67ca=\"\">Poly Bridge, a cross-chain transfer bridge built on Poly Network, delivers NFT token transfers and contract cross-chain calls for heterogeneous chains. Poly NFT Bridge supports the popular NFT standards; ERC-721 and ERC-1155, with OpenSea verification API support. Users approve and lock their NFT tokens in the smart contracts, then Poly Bridge operators mint the corresponding NFT tokens using the same metadata.<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Users only need to log in to the Poly NFT Bridge page (<\/span><a href=\"https:\/\/bridge.poly.network\/nft\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/bridge.poly.network\/nft<\/span><\/a><span data-v-f87c67ca=\"\">), connect their wallet, select the NFT assets already held in the wallet, select the desired destination network, and finally click \"confirm\" to complete the NFT cross-chain transfer.<\/span><\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">For NFT projects interested in offering cross-chain transfers to their users, joining the Poly NFT Bridge is just as easy. In order to import NFTs to Poly Bridge, developers need to ensure their source chain NFT contract can support the ERC-721<\/span><a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-721\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> standard<\/span><\/a><span data-v-f87c67ca=\"\">. Besides the source chain NFT contract, they also need to develop and deploy the mapping NFT contracts on the target chain. Here are the three steps to assist you in completing the process.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Step 1. Development for mapping NFT contract<\/strong><\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Poly Network will provide a template for mapping NFT contracts. The mapping contracts should support ERC721, ERC721 Metadata and ERC721 Enumerable interfaces with the <\/span><a href=\"https:\/\/eips.ethereum.org\/EIPS\/eip-721\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ERC-721 standard<\/span><\/a><span data-v-f87c67ca=\"\">. The mapping contracts need to implement a minting interface. The method will be invoked by <\/span><a href=\"https:\/\/github.com\/rain-zxn\/dev-docs\/blob\/main\/Core_Smart_Contract\/Contract\/NFTLockProxy.md\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">NFTLockProxy<\/span><\/a><span data-v-f87c67ca=\"\"> in the Poly Network.&nbsp;<\/span><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Step 2. Information submission<\/strong><\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Contact Poly Network via <\/span><a href=\"https:\/\/discord.com\/invite\/y6MuEnq\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Discord<\/span><\/a><span data-v-f87c67ca=\"\">. Waiting for feedback from Poly Network. We'll send you an email when everything is completed.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Step 3. Test<\/strong><\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Click <\/span><a href=\"https:\/\/bridge.poly.network\/nft\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">here<\/span><\/a><span data-v-f87c67ca=\"\"> and follow the manual to test the NFT cross-chain transfer.&nbsp;<\/span><\/span>","<span data-v-f87c67ca=\"\">Web 3.0 is the evolution of communication, Crypto for currency, DeFi for finance, and NFTs for art. Poly Network's vision is to enhance connections between ledgers by providing interoperability in Web 3.0. Poly Network expects more partners to join in&nbsp; building a new industry criteria of cross-chain NFTs and expects to become the cornerstone for liquidity of the NFT market.<\/span>","<span data-v-f87c67ca=\"\">Poly Network is a global cross-chain protocol for implementing blockchain interoperability and building Web3.0 infrastructure. Poly Network has integrated 20+ blockchains, including Ethereum, BNB Chain, Polygon, Avalanche, Fantom, Arbitrum, Optimism, Metis, Boba, OKC, HECO, Neo, Ontology, Zilliqa, Gnosis Chain, etc. Since the launch, the protocol has enabled cross-chain asset transfer of more than 16 billion U.S. dollars involving more than 340,000 addresses on different blockchains.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.poly.network\/\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Website<\/b><\/a><b data-v-f87c67ca=\"\"> |<\/b><a href=\"https:\/\/t.me\/joinchat\/Hjv5NBrfO1C2LyODQfxVDw\" data-v-f87c67ca=\"\"> <b data-v-f87c67ca=\"\">Telegram<\/b><\/a><b data-v-f87c67ca=\"\"> |<\/b><a href=\"https:\/\/polynetwork.medium.com\/\" data-v-f87c67ca=\"\"> <b data-v-f87c67ca=\"\">Medium<\/b><\/a><b data-v-f87c67ca=\"\"> |<\/b><a href=\"https:\/\/twitter.com\/PolyNetwork2\" data-v-f87c67ca=\"\"> <b data-v-f87c67ca=\"\">Twitter<\/b><\/a><b data-v-f87c67ca=\"\"> |<\/b><a href=\"https:\/\/discord.com\/invite\/y6MuEnq\" data-v-f87c67ca=\"\"> <b data-v-f87c67ca=\"\">Discord<\/b><\/a><b data-v-f87c67ca=\"\"> |<\/b><a href=\"https:\/\/github.com\/polynetwork\" data-v-f87c67ca=\"\"> <b data-v-f87c67ca=\"\">Github<\/b><\/a><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Boba","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"1155","content":"DATE"},{"type":"Zilliqa","content":"LOCATION"},{"type":"OKC","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"ERC","content":"ORGANIZATION"},{"type":"NFT Bridge","content":"ORGANIZATION"},{"type":"OpenSea verification API","content":"ORGANIZATION"},{"type":"Poly Network via <\/span><a href=\"https:\/\/discord.com\/invite\/y6MuEnq\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Discord","content":"ORGANIZATION"},{"type":"Metis","content":"ORGANIZATION"},{"type":"Neo","content":"PERSON"},{"type":"Poly NFT","content":"ORGANIZATION"},{"type":"16 billion","content":"MONEY"},{"type":"Gnosis Chain","content":"ORGANIZATION"},{"type":"Poly Network","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}