{"summary":"CleanSpark expects to have all of the machines delivered by September, resulting in a 95% increase by the end of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225511\/cleanspark-buys-bitcoin-miners-double-capacity","publishDate":"2023-04-11T09:00:43","id":12600,"type":null,"title":"CleanSpark buys 45,000 Bitcoin miners for $145 million to nearly double its capacity","category":["COMPANIES"],"content":["Bitcoin mining company CleanSpark spent $145 million on 45,000 Bitcoin mining machines, planning to double its mining capacity by the end of the year.","All of the mining units are Antminer S19 XPs, which CleanSpark CEO Zach Bradford claims are the most efficient miners available on the market.","“This bear market has continued to provide us with opportunities to maximize ROI [return on investment] including the opportunity to purchase the industry’s best miner at an industry leading price,” said Bradford in a press release.","The manufacturer will aim to deliver 25,000 machines in August, with the rest arriving in September.","The machines will add 6.3 exahashes per second (EH\/s) of computing power to the company’s current 6.7 EH\/s of hash rate —&nbsp;a 95% increase.&nbsp;","This follows a <a href=\"https:\/\/www.theblock.co\/post\/211579\/cleanspark-buys-20000-miners-from-bitmain-bringing-bear-market-tally-to-46500\" data-v-f87c67ca=\"\">recent purchase<\/a> of 20,000 mining machines in February. These machines are in the process of being delivered and will add 2.44 EH\/s of hash rate when they are activated later this year.","CleanSpark claims it mines more than 90% of its bitcoin with low-carbon energy sources.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$145 million","content":"MONEY"},{"type":"Zach Bradford","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Bradford","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"95%","content":"PERCENT"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["Tim Copeland","The Block"]}