{"summary":"BlockFi said it will suspend withdrawals on its platform until it has greater clarity regarding the status of FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185753\/blockfi-suspends-withdrawals-after-ftx-collapse","publishDate":"2022-11-10T21:04:42","id":12602,"type":null,"title":"BlockFi suspends withdrawals after FTX collapse","category":["BANKRUPTCY"],"content":["<span data-v-f87c67ca=\"\">BlockFi suspended withdrawals on its platform until it has greater clarity regarding the collapse of FTX.<\/span>","<span data-v-f87c67ca=\"\">Crypto lender BlockFi suspended withdrawals and will not be able to operate business as usual given the lack of clarity over the status of FTX, the company said on Twitter.<\/span>","<span data-v-f87c67ca=\"\">“We are shocked and dismayed by the news regarding FTX and Alameda,” the company tweeted. For the time being BlockFi will limit platform activity, and client withdrawals will be paused “as is allowed under our Terms,” the company said. No exact time frame was specified in terms of service restoration.<\/span>","<span data-v-f87c67ca=\"\">Earlier in the day BlockFi said that it would delay the processing of ACH and wire transactions scheduled for Nov. 11 until Nov. 14, due to the observance of Veterans Day by its U.S. based-banking partner Silvergate. It is now unclear whether those delayed transactions will go through.<\/span>","<span data-v-f87c67ca=\"\">In July, BlockFi <\/span><a href=\"https:\/\/www.theblock.co\/post\/155516\/blockfi-strikes-680-million-credit-deal-with-ftx-us-outlines-acquisition-path\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">brokered<\/span><\/a><span data-v-f87c67ca=\"\"> a $680 million deal with FTX.US that included a $400 million credit line and an option for FTX to buy the firm for $280 million.<\/span>","<span data-v-f87c67ca=\"\">BlockFi did not immediately respond to The Block’s request for comment.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"$680 million","content":"MONEY"},{"type":"Nov. 11","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Nov. 14","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$280 million","content":"MONEY"}],"hashtag":["FTX"],"authors":["Jeremy Nation","The Block"]}