{"summary":"The Hong Kong-headquartered firm raised its latest funds from investors including Kronos Ventures, Cherry Crypto and Mechanism Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259345\/anboto-labs-funding","publishDate":"2023-10-26T02:35:05","id":12612,"type":null,"title":"Anboto Labs secures $3 million in funding, launches non-custodial trading platform","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">Anboto Labs, a Hong Kong-based crypto trading execution tool provider, has raised $3 million in funding and launched an institutional-grade non-custodial trading platform, the company said.<\/span>","<span data-v-f87c67ca=\"\">Anboto said in a statement shared with The Block that it secured the $3 million investment in the third quarter of this year from investors including Kronos Ventures, Cherry Crypto, Mechanism Capital, XBTO and Matrixport.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The fresh funds come on top of the $1.9 million the company raised last year, putting its valuation at $35 million, Guillaume Forcade, co-founder of Anboto, told The Block. <\/span><span data-v-f87c67ca=\"\">“We've been revenue-generating since day one and today we are excited to introduce our execution platform to a broader audience of experienced traders,” Forcade said. “With the public launch of our platform, Anboto can now scale to support thousands of traders simultaneously.”<\/span>","<span data-v-f87c67ca=\"\">Anboto said that the newly launched platform underwent an 18-month closed beta that registered $4 billion in trading volume across 20 exchanges and blockchain networks.<\/span>","<span data-v-f87c67ca=\"\">Anboto offers execution algorithms — such as TWAP, VWAP and iceberg — to provide optimal pricing and improved execution, according to the statement. It also allows users to sign up without the know-your-customer process, set up multi-factor authentication and whitelist IP addresses to enhance security, the company said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For the coming few months, Anboto said that it plans to expand its trading features, such as non-custodial prime services, in an attempt to “democratize access to institutional-grade execution tools for all crypto traders.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kronos Ventures","content":"ORGANIZATION"},{"type":"Anboto","content":"PERSON"},{"type":"$35 million","content":"MONEY"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Cherry Crypto","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"Guillaume Forcade","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"$1.9 million","content":"MONEY"},{"type":"Forcade","content":"PERSON"},{"type":"third quarter","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}