{"summary":"Offchain Labs has rolled out support for the Dencun upgrade in the Arbitrum ecosystem with the Atlas upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282497\/arbitrum-rolls-out-atlas-upgrade-integrating-use-of-blobs","publishDate":"2024-03-14T12:01:21","id":12610,"type":null,"title":"Arbitrum rolls out Atlas upgrade, adding Dencun support and blobs","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Offchain Labs, the core contributor to <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arbitrum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248386\/arbitrum-arb-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/photo_2023-03-29_21.47.00.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ARB<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -1.41%\n    <\/span><\/a> <!----><\/span><\/span>, has implemented the Dencun upgrade within the Arbitrum ecosystem through the ArbOS 20 upgrade, known as “Atlas.”<\/span>","The purpose of the Atlas upgrade on Arbitrum is to reduce Ethereum Layer 2 transaction costs by integrating the blob transactions feature, which became available following the recent <a href=\"https:\/\/www.theblock.co\/post\/282236\/ethereum-dencun-upgrade-blobs\" data-v-f87c67ca=\"\">Dencun launch<\/a>. This was implemented following a governance approval from Arbitrum DAO","The Dencun upgrade introduced yesterday has equipped Layer 2 networks with a novel transaction type known as blobs. These blobs create a new method for chains to store information on Ethereum, moving away from the conventional “calldata” approach, and paving the way for significant reductions in transaction fees for Layer 2 networks including Arbitrum.","To integrate blobs, Layer 2 chains themselves must carry out software updates, and Arbitrum is the latest network to do so.","Layer 2 networks like Optimism, Base, and Starknet, which implemented blob transactions immediately after Dencun have already <a href=\"https:\/\/www.theblock.co\/post\/282417\/ethereum-layer-2s-show-dramatic-drop-in-transaction-fees-after-dencun\" data-v-f87c67ca=\"\">seen significant reductions<\/a> in their average transaction fees.","For Arbitrum, Offchain Labs anticipates a reduction in the network’s minimum base fee from 0.1 gwei to 0.01 gwei, marking a decrease by a factor of ten. Previously at $0.5, Arbitrum’s average transaction fee could potentially decrease to about $0.05 following the Atlas upgrade.","“We are excited to see the Arbitrum DAO has voted to upgrade to ArbOS Atlas, which will bring significant benefits to the community in terms of improved transaction pricing,” said Steven Goldfeder, CEO and co-founder of Offchain Labs.","<a href=\"https:\/\/www.theblock.co\/post\/248265\/arbitrum-stylus-introduced-to-expand-language-support-for-ethereum-layer-2-dapps\" data-v-f87c67ca=\"\">Offchain Labs<\/a>&nbsp;stated that several service providers, including Altlayer, Caldera, Conduit, and Gelato, which focus on Arbitrum, will assist in the transition for individual Orbit chains that use Arbitrum's software stack. Furthermore, Offchain Labs clarified that the ArbOS Atlas upgrade can be implemented by Orbit chains without the need for approval from the Arbitrum DAO governance process.","<a href=\"https:\/\/www.theblock.co\/tag\/arbitrum\" data-v-f87c67ca=\"\">Arbitrum<\/a>&nbsp;stands as the most widely used Layer 2 network on Ethereum, based on the number of active wallets. It also boasts the highest total value locked among Layer 2 solutions, at nearly $3.5 billion, and supports popular decentralized apps such as Uniswap, GMX and Aave.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.5","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"-1.41%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Caldera","content":"LOCATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"Arbitrum DAO","content":"ORGANIZATION"},{"type":"GMX","content":"ORGANIZATION"},{"type":"Dencun","content":"PERSON"},{"type":"$0.05","content":"MONEY"},{"type":"$3.5 billion","content":"MONEY"},{"type":"Arbitrum","content":"ORGANIZATION"},{"type":"Offchain Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ARBITRUM","DEVELOPER TOOLS","PROTOCOLS","ROLLUPS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}