{"summary":"Oanda is launching a trading ecosystem for the U.S. market where users can trade bitcoin, ether and other cryptocurrencies against the dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177216\/oanda-launches-mobile-crypto-offering-in-u-s","publishDate":"2022-10-20T10:00:22","id":12611,"type":null,"title":"Oanda launches mobile crypto offering in U.S.","category":["EXCHANGES"],"content":["Oanda is launching a trading ecosystem for the U.S. market developed with the Paxos Trust Company.","The foreign exchange company's offering aims to position crypto access alongside forex portfolios via spot trading on Paxos's itBit exchange — by way of Oanda's mobile platform. Users can open new Paxos accounts and trade bitcoin, ether and other cryptocurrencies against the dollar.","The crypto offering and Paxos Trust partnership coincide with the unveiling of Oanda's new brand identity, according to a news release that \"reflects the company's emphasis on enabling smarter trading for its clients.\"","\"As the number of Americans seeking exposure to cryptocurrencies grows, it's becoming clear that digital assets should form part of a unified trading experience for active traders and sophisticated investors,\" Oanda CEO Gavin Bambury said in the release.","Oanda's offering is launching into a competitive market. \"We are a well-established and regulated forex broker, with a 25-year history and a stellar reputation for building apps and solutions for active traders,\" Jessica Beckstead, Oanda's North American managing director and U.S. CEO explained to The Block when asked about what sets the product apart.","\"We are now using that expertise to provide solutions for crypto traders so they can trade digital currencies and forex instruments in one app,\" Beckstead said, continuing, \"This also opens up the opportunity for crypto traders to access the dynamic and volatile forex market, at a time when central banks take diverging monetary policy paths to fight inflation and the G5 FX CVOL index has risen to its highest level since March 2020.\"","The launch doesn't come as a surprise as a news release published on Oanda's website on Sept. 22 <a href=\"https:\/\/www.oanda.com\/group\/media-center\/press-releases\/\" data-v-f87c67ca=\"\">announced<\/a> the partnership and crypto-offering plans.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sept. 22","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Paxos Trust Company","content":"ORGANIZATION"},{"type":"Jessica Beckstead","content":"PERSON"},{"type":"Paxos","content":"ORGANIZATION"},{"type":"Oanda","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Paxos Trust","content":"ORGANIZATION"},{"type":"Beckstead","content":"PERSON"},{"type":"Gavin Bambury","content":"PERSON"},{"type":"G5 FX CVOL","content":"ORGANIZATION"},{"type":"March 2020","content":"DATE"}],"hashtag":[],"authors":["Adam James","The Block"]}