{"summary":"Matter Labs opened its Ethereum Layer 2 network zkSync Era in alpha form to the wider public, becoming the first zkEVM to go live.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum","publishDate":"2023-03-24T09:00:41","id":12620,"type":null,"title":"ZkSync Era: First zkEVM goes live in major development for Ethereum","category":["CRYPTO ECOSYSTEMS"],"content":["Matter Labs opened access to its Layer 2 network zkSync Era to the wider public on Friday, marking the launch of the first zkEVM on the Ethereum blockchain.","ZkSync has been going through a <a href=\"https:\/\/www.theblock.co\/post\/178896\/zksync-to-launch-on-mainnet-this-month-what-you-need-to-know\" data-v-f87c67ca=\"\">slow rollout<\/a>. In October 2022 it <a href=\"https:\/\/www.theblock.co\/post\/180846\/matter-labs-releases-first-phase-of-zksync-2-0-mainnet-called-baby-alpha\" data-v-f87c67ca=\"\">launched<\/a> on the Ethereum mainnet in a baby alpha phase, for internal testing. In February, it <a href=\"https:\/\/www.theblock.co\/post\/212564\/zksync-opens-doors-to-ethereum-developers-while-network-remains-in-alpha\" data-v-f87c67ca=\"\">opened<\/a> the doors to development teams to get whitelisted access to the network and start experimenting with it. Today’s development brings the network, which remains in alpha, to everyone.","“For the first time ever, a zkEVM is available to the general audience,” said Matter Labs CEO Alex Gluchowski, in an interview. “To me, it's quite a mindblowing milestone for the entire Ethereum space.”","ZkSync Era is a Layer 2 network that uses zero-knowledge proofs to batch transactions together and record them on the Ethereum network. As a zkEVM, it maintains compatibility with the Ethereum Virtual Machine — the processor within the Ethereum blockchain. This means that developers can more easily port over applications to the network, where they can benefit from faster transactions and lower fees.","“It’s the Holy Grail of scaling Ethereum, simply because it's the only way you can scale Ethereum while fully preserving the core properties that make it so valuable,” said Gluchowski. He added that you don’t sacrifice trustlessness or security, as long as the protocol is implemented correctly.","Currently, many of the biggest Ethereum projects are already building on zkSync Era, according to Gluchowski. He mentioned popular DeFi projects Uniswap, Curve, Balancer, Maker and SushiSwap, as well as Circle, the company behind the USDC stablecoin, and crypto wallet maker Argent.","One of the key aspects of zkSync is that it comes with native support for account abstraction. This is a technology that enhances how crypto wallets work for users.&nbsp;","Typically, most crypto wallets are just standard addresses that can send and receive funds and interact with smart contracts. With account abstraction, crypto wallets are customizable and can be designed in more complicated ways that offer a wider range of functions.&nbsp;","For example, a wallet could be set up that requires multiple parties to sign transactions, or it could have two-factor authentication built in — or even be accessed through a username and password. Gluchowski said that by supporting native account abstraction, zkSync Era can add further security and make it easier for new users to get onboarded into crypto.","Matter Labs also highlighted that zkSync Era will provide a different level of data availability than other zkEVMs. Specifically it will publish state differences instead of transaction inputs. That means it will tell Ethereum the end result of the transactions —&nbsp;such as changing the balances of certain wallets — rather than giving all of the transaction information.","Matter Labs said this has benefits that include data compression, the ability to provide more frequent oracle updates, cheaper privacy and better integration with extensions that provide off-chain storage.","ZkSync Era’s launch won’t initially come with a token because the network remains largely centralized for now. As it is in alpha, Matter Labs can arbitrarily upgrade the network’s code. Plus, the company still controls the sequencer and the prover, two core components of how the network operates.&nbsp;","“There is no need for a token at this point. The token will be required once you want to decentralize the sequencer. Everything has to have its objective and justification. In order to have permissionless participation in the validator set, we don't have anything better than a token right now — like how you make it permissionless. But for now, since we are on this sequencer, it's not yet necessary,” said Gluchowski.","He estimated that the sequencer will be decentralized in around a year's time.","“Once the prover and the core virtual machine engine is solidified and stable, then we will introduce the decentralized sequencer mechanism with validators with some form of stake. We have an entire dedicated team working on this already,” he said.","Within its alpha phase, zkSync Era will have a greater focus on security and extra protections. These can be gradually phased out as the network shows that it is durable and becomes more mature.","Matter Labs has spent $3.8 million on testing and auditing the network. This includes seven external security audits with firms including OpenZeppelin and three internal audits. It's also had two public security contests and has an open-ended bug bounty program.","In order to protect the network in its initial launch, Matter Labs has added a 24-hour transaction confirmation delay — meaning that transactions won’t be deemed as confirmed for 24 hours. This is designed to give a greater buffer in case something goes wrong. This delay will be gradually removed.","The plan is to slowly hand over control of zkSync to its community. It will follow the model of zkSync Lite — the first version of the Layer 2 network, which isn’t a zkEVM — and introduce a security council, said Gluchowski. After a year or more, the network will be decentralized.&nbsp;","“We want to move to something that does not require any trust assumptions at all. What you as a user should trust is the open source code, math and the underlying network of Ethereum,” he said.","There are a lot of projects competing to bring out a zkEVM and capture the market. ZkSync's Era launch is set to be followed closely by Polygon’s zkEVM, slated for March 27, and then later by Scroll, which recently <a href=\"https:\/\/www.theblock.co\/post\/215343\/scrolls-zk-evm-layer-2-goes-live-on-ethereums-goerli-testnet\" data-v-f87c67ca=\"\">went live<\/a> on testnet.","The key difference between zkSync Era and projects like Polygon zkEVM and Scroll is that the latter two are bytecode compatible, while Era is not. Being bytecode compatible means the core code used for applications on Ethereum can be copied in their current form over to the Layer 2 networks, with few changes needed.","ZkSync Era requires projects to be compiled using its LLVM-based compiler in order to be used on its network. This means there is a bit of a gap between the two, but the compiling process doesn’t take long and shouldn’t require many changes, said Gluchowski, who added that there are benefits justifying this.","“We're not focusing on rigidly succeeding on backwards compatibility. That is not our goal. We want to leverage the maximum potential of zk-proofs for the future,” he said. “We're willing to deviate from the current standard in order to innovate faster.”","Gluchowski said this is what enables features like native account abstraction and offering the ability to pay for transactions using the token in question, rather than having a specific token required for transaction fees. Were zkSync to be constrained by being bytecode compatible, then it would be limited by the same things as Ethereum itself.","“If you go for bytecode compatibility, or if you’re going for full equivalence, you will stick to the old problems,” he added. “If you want to emulate some old gaming computer on a MacBook, you can do it. But you cannot emulate the macOS experience on some older things. You want to go first for maximum performance, then you can support backwards compatibility to an arbitrary degree with some performance penalty.”","As for optimistic rollups, which are alternative Layer 2 networks that don’t use zero-knowledge proofs, Gluchowski said that they will eventually need to adopt the technology. “I think that's the only way they can sustain into the future,” he said. “If they stick to [optimistic rollups], it's like trying to stick to horses in the age of cars.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.8 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Gluchowski","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Alex Gluchowski","content":"PERSON"},{"type":"MacBook","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"March 27","content":"DATE"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"},{"type":"Balancer","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","ZKEVM","ZKSYNC"],"authors":["Tim Copeland","The Block"]}