{"summary":"The crypto wallet market continues to heat up as companies try and address lingering concerns over scams and hacks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263969\/former-revolut-employees-launch-new-crypto-wallet-called-zeal","publishDate":"2023-11-21T09:52:58","id":1262,"type":null,"title":"Former Revolut employees launching new crypto wallet called Zeal","category":["COMPANIES"],"content":["Some former Revolut employees are entering the competitive digital-wallet space by launching their own solution designed to help users both safely manage crypto assets and engage with decentralized applications.","\"<span data-v-f87c67ca=\"\">The status quo for wallets is not good enough. Clunky wallets built for technocrats or the casino are hard to use and easy to lose money with,\" said Hannes Graah, a former Revolut vice president of growth who started building Zeal in 2022. \"People need a wallet that's safe, easy to use, and can be used seamlessly with blockchain networks and the real world.\"<\/span>","Zeal is currently invite only and plans to officially launch in the first quarter of next year, the company said.","Graah and Zeal will be up against a fair amount of competition as companies jockey to be the digital wallet of choice for not only crypto enthusiasts concerned about protecting their digital assets but also curious newcomers keen to securely buy cryptocurrencies and use web3 applications.","Companies big and small are investing in the digital-wallet market in the hopes of standing out. The world's largest cryptocurrency exchange, Binance, <a href=\"https:\/\/www.theblock.co\/post\/262106\/binance-announces-self-custody-crypto-wallet-during-conference\" data-v-f87c67ca=\"\">recently launched<\/a> its own self-custody wallet. Last month, leading software wallet provider Metamask <a href=\"https:\/\/www.theblock.co\/post\/260176\/metamask-and-blockaid-collaborate-to-introduce-native-security-alerts-in-wallet-extension\" data-v-f87c67ca=\"\">announced<\/a> it partnered with the security firm Blockaid in order to enhance security.","Zeal hopes to solve issues related to scams and hacks with a wallet that the company said \"<span data-v-f87c67ca=\"\">solves the security problem with advanced security checks and previews for web3 transactions that keep people safe from scams.\" Additionally, the Zeal wallet will allow users to transfer USDC stablecoins to their bank accounts for free, the company said in a statement.<\/span>","Investors in Zeal include <span data-v-f87c67ca=\"\">Galaxy, Framework, Variant Fund and Northzone, according to the statement. Zeal's \"knack for blending user-friendly design, robust security measures, and comprehensive on-chain asset visibility raises the bar for what we should demand from a wallet,\" Will Nuelle, general partner of Galaxy, said in the statement.<\/span>","Besides Revolut alumni, Zeal's team also includes former Coinbase and Spotify employees, the company said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"first quarter","content":"DATE"},{"type":"Galaxy","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Hannes Graah","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}