{"summary":"The Federal Reserve Bank of New York has completed an experiment focused on using a digital dollar for complex foreign exchange transactions running across different blockchains. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183076\/new-york-fed-completes-experiment-using-on-chain-digital-dollar","publishDate":"2022-11-04T10:18:30","id":12626,"type":null,"title":"New York Fed completes experiment using on-chain digital dollar","category":["POLICY"],"content":["An office within the Federal Reserve Bank of New York has completed a test of a central bank digital currency for wholesale, cross-border transactions, exchanging a U.S. digital dollar with experimental foreign currencies on separate blockchains.","The experiment known as <a href=\"https:\/\/www.newyorkfed.org\/aboutthefed\/nyic\/project-cedar\" data-v-f87c67ca=\"\">Project Cedar: Phase One<\/a> focused on the potential for central bank digital currencies to become viable options for large foreign currency transactions, though Federal Reserve Chair Jerome Powell and other board members of the U.S. central bank have made clear that the creation of a digital dollar is not a foregone conclusion.","The pilot beat the average clearing and settlement of transactions from two days to under 15 seconds, and completed the transaction at an “atomic” level, eliminating the risk that complicated cross-border trades might only partially go through.","Several countries already utilize non-blockchain, real-time payment systems, but they typically operate via a single currency. The New York Fed test cleared payments at a virtually instant speed between a digitized dollar and eight experimental currencies run on separate blockchains.","Despite the experiment’s positive outcome, the paper touting this result from the New York Fed made clear that the experiment was not a definitive conclusion. Still, the group behind the project touted the potential for an American central bank digital currency (CBDC) to improve large-scale cross-border payments.","“Project Cedar Phase I revealed promising applications of blockchain technology in modernizing critical payments infrastructure, and our inaugural experiment provides a strategic launch pad for further research and development regarding the future of money and payments from the U.S. perspective,” said Per von Zelowitz, director of the research center that ran the experiment within the New York Fed.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Federal Reserve Bank of New York","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Jerome Powell","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"New York Fed","content":"ORGANIZATION"},{"type":"Per von Zelowitz","content":"PERSON"}],"hashtag":[],"authors":["Colin Wilhelm","The Block"]}