{"summary":"The team behind health and fitness app Sweatcoin has raised a $13 million round as it seeks to deepen its web3 capabilities. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159979\/spartan-capital-leads-13-million-round-for-sweatcoin-developer-sweat-economy","publishDate":"2022-07-28T09:30:25","id":12632,"type":null,"title":"Spartan Capital leads $13 million round into Sweatcoin developer","category":["DEFI"],"content":["Sweat Economy, the team behind health app Sweatcoin, closed a $13 million round led by Spartan Capital.&nbsp;","According to an announcement this morning, Electric Capital, OKX Blockdream Ventures, Goodwater Capital and GSR Capital also participated in the round, which was comprised of both equity funding and a private token sale.&nbsp;","Sweat Economy will use the funds to expand usage of its native token SWEAT across its ecosystem, including on the Sweatcoin app. Sweatcoin rewards users with an off-chain currency for its daily steps, which can be used on discounts or donated to charity. It claims to have over 100 million users, making it the most downloaded health and fitness app of&nbsp; 2022, according to <a href=\"https:\/\/blog.apptopia.com\/sweatcoin-most-downloaded-app-worldwide-h1-2022\" data-v-f87c67ca=\"\">data collected by Apptopia<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">“Web3 onboarding can be daunting to many as it often involves a steep learning curve,\" said Spartan Capital founding partner Kelvin Koh in a statement. \"Sweatcoin is providing users with a new way to exercise and earn, all while lowering the entry barrier and reducing the technical know-how.\"&nbsp;<\/span>","Companies such as Stepn that have used tokenized incentives to encourage exercise have previously<a href=\"https:\/\/blockworks.co\/stepn-founder-wants-to-promote-healthy-body-and-mind-but-skeptics-question-the-apps-sustainability\/\" data-v-f87c67ca=\"\"> drawn criticism<\/a>&nbsp;over the sustainability of the business model.","Sweat Economy says that users of Sweatcoin have to opt-in to its on-chain currency, which can be traded 1:1 with Sweatcoin. It claims that over 11 million have done so and downloaded the wallet app in the process.","On September 12, the company will release to mark the release of the token, and the accompanying wallet, with a token generation event. This will be an event where the SWEAT token will be publically launched on both the Ethereum and Near blockchains.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Spartan Capital","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"OKX Blockdream Ventures","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$13 million","content":"MONEY"},{"type":"Apptopia","content":"ORGANIZATION"},{"type":"Electric Capital","content":"ORGANIZATION"},{"type":"Kelvin Koh","content":"PERSON"},{"type":"September 12","content":"DATE"},{"type":"GSR Capital","content":"ORGANIZATION"},{"type":"Sweatcoin","content":"PERSON"},{"type":"Goodwater Capital","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}