{"summary":"Former Binance.US CEO Brian Brooks believes stablecoin regulation benefits the U.S. dollar — even though regulators aren&#x27;t major proponents.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244581\/stablecoin-regulation-dollar-adoption-brian-brooks","publishDate":"2023-08-12T05:12:01","id":12634,"type":null,"title":"Stablecoin regulation good for dollar, says former Binance.US CEO","category":["U.S. POLICYMAKING"],"content":["Valor Capital Group partner Brian Brooks believes clear stablecoin regulations benefit the U.S. dollar — even as some U.S. lawmakers argue it could be harmful to the financial system and economy.&nbsp;","Brooks — the former CEO of Binance's U.S. arm and a former acting U.S. Comptroller of the Currency — told CNBC on Friday that the Biden administration's apparent opposition to stablecoins is less than ideal.","“If only the U.S. government would create a framework that allows dollars to back stablecoins in a regulated way, that demand would flourish,” Brooks <a href=\"https:\/\/www.cnbc.com\/2023\/08\/11\/stablecoins-give-the-us-a-way-to-make-the-dollar-relevant-again-says-valor-capitals-brooks.html\" data-v-f87c67ca=\"\">said<\/a>.","“That would be good for dollar adoption globally, but as long as we’re allowing governments to suppress stable coins, you have the sort of push-pull phenomenon, which is what creates the problem,\" he added.&nbsp;","Stablecoins are crypto assets — usually tokens — pegged to a fiat currency, such as the U.S. dollar, or another asset, such as gold.","Brooks cited foreign demand for U.S. dollar-pegged stablecoins in countries experiencing high inflation, where it may be difficult to open a U.S. dollar bank account, as a major driver.","“Demand for [stablecoins are] a way for us to make the dollar relevant again at a time when governments around the world are looking to decouple from the dollar,” Brooks also explained to CNBC.","“That’s really a pretty important policy issue,\" he added. \"It’s not about crypto, it’s about the role the United States plays in the financial system.”","Brooks' statements come at a time when stablecoins remain one of the hottest topics in the wider industry — particularly from a policy perspective.","Early this week, payments giant PayPal <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">announced<\/a> the launch of its own U.S. dollar-pegged stablecoin. The token will exist on the Ethereum blockchain, which JPMorgan <a href=\"https:\/\/www.theblock.co\/post\/243720\/jpmorgan-paypal-stablecoin-ethereum\" data-v-f87c67ca=\"\">believes<\/a> could boost activity and utility on the network.","Leading House Democrat Maxine Waters immediately&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/243991\/leading-democrat-maxine-waters-voices-concern-about-paypal-stablecoin\" data-v-f87c67ca=\"\">expressed<\/a> that she is \"deeply concerned\" about PayPal's stablecoin — and previously criticized a high-profile stablecoin bill that advanced last month as \"toxic and problematic.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brooks","content":"PERSON"},{"type":"House Democrat Maxine Waters","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Capital Group","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Brian Brooks","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam James","The Block"]}