{"summary":"The Brooklyn-headquartered ConsenSys has raised $65 million in new funding.\nAmong those backing the Ethereum-focused firm are JPMorgan, UBS, Mastercard as well as an array of investment firms and digital asset industry startups.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/101463\/consensys-closes-65-million-funding-round-backed-by-jpmorgan-mastercard-and-more","publishDate":"2021-04-13T09:00:12","id":1263,"type":null,"title":"ConsenSys closes $65 million funding round backed by JPMorgan, Mastercard and more","category":["Investments"],"content":["<a href=\"https:\/\/www.theblockcrypto.com\/daily\/13634\/a-former-consensys-exec-is-looking-to-raise-50m-for-a-fund-thatll-squeeze-more-alpha-out-of-ether\" data-v-f87c67ca=\"\">ConsenSys<\/a>, the Ethereum-focused software company, has raised $65 million from a group that includes a pair of major banks, a top financial services firm and an array of digital asset industry startups and investors.","Among those backing the formation round, according to a press statement shared with The Block, is <a href=\"https:\/\/www.theblockcrypto.com\/daily\/74687\/jpmorgan-consensys-investment-deal\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">JPMorgan<\/a>, whose involvement was reported by The Block last August. That same month, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/3152\/consensys-is-paring-back-one-of-its-major-projects-after-a-big-exec-exit\" data-v-f87c67ca=\"\">ConsenSys<\/a> confirmed that it had secured a strategic investment from JPM as well as acquired Quorum, the Wall Street bank's blockchain unit. Quorum is a private blockchain network developed within JPMorgan using the Ethereum technology stack as a basis.","UBS and Mastercard also took part in Tuesday's $65 million funding round, as well as FTX owner Alameda Research, Protocol Labs, Fenbushi, the Maker Foundation, The LAO, Liberty City Ventures, the Greater Bay Area Homeland Development Fund and Quotidian Ventures. <span data-v-f87c67ca=\"\">The $65 million was raised via a convertible note.<\/span>","\"When we set out to raise a round, it was important to us to patiently construct a diverse cap table, consistent with our belief that similar to how the web developed, the whole economy would join the revolutionaries on a next generation protocol,\" <a href=\"https:\/\/www.theblockcrypto.com\/linked\/18301\/consensys-and-ripple-labs-join-new-eu-blockchain-association-backed-by-105-members\" data-v-f87c67ca=\"\">ConsenSys<\/a> founder Joe Lubin said in a statement.","The participation by the Greater Bay Area Homeland Development Fund -- a private equity fund backed by both private and state-owned companies in China -- is notable, given <a href=\"https:\/\/www.theblockcrypto.com\/linked\/2529\/consensys-acquires-space-mining-company\" data-v-f87c67ca=\"\">ConsenSys's<\/a> activities in the region. In January, the firm announced that it was <a href=\"https:\/\/consensys.net\/blog\/press-release\/consensys-announces-partnership-with-chinas-blockchain-services-network\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">partnering<\/a> with the Blockchain-based Service Network (BSN) via integration with Quorum.","More broadly, the funding round is perhaps a sign that investors are as eager to bet on technology-focused firms as they are on those dedicated to digital asset investment services.","“Our investment in ConsenSys adds proven expertise in distributed ledger technology to our UBS Next portfolio,\" Mike Dargan, head of group technology for UBS, said in a statement. \"This investment underscores our commitment to working with fintechs and the broader tech ecosystem to shape the future of banking for the benefits of our clients.\"","At the same time, the new fundraise caps a period of reorganization and reinvention for the Brooklyn-based <a href=\"https:\/\/www.theblockcrypto.com\/linked\/32461\/consensys-owned-ethereum-infra-solution-provider-infura-launches-3-new-services\" data-v-f87c67ca=\"\">ConsenSys<\/a>. In February 2020, ConsenSys <a href=\"https:\/\/www.theblockcrypto.com\/post\/54898\/ethereum-consensys-software-investment-200-million-raise-layoffs\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">moved to divide<\/a> its business between software development and investment activity. As part of the process, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/22927\/molochdao-receives-700000-pledge-from-buterin-lubin-ethereum-foundation-and-consensys-employees\" data-v-f87c67ca=\"\">ConsenSys<\/a> conducted a round of layoffs, which followed a previous staff cut in December 2018.","\"The business is focused on two goals: providing developer tools and infrastructure for the developer, decentralized finance, and startup communities; and helping enterprises in the financial services, trade finance, and commerce sectors deploy and operationalize blockchain solutions,\" <a href=\"https:\/\/www.theblockcrypto.com\/linked\/26243\/former-consensys-capital-head-leaves-for-a-fund-that-plans-to-squeeze-more-alpha-out-of-web3-protocols\" data-v-f87c67ca=\"\">ConsenSys<\/a> said at the time."],"hashtag":[]}