{"summary":"Blockchain gaming studio Immutable, the developer of a popular collectible card game called “Gods Unchained,” has raised $15 million in Series A, aiming","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40631\/gods-unchained-developer-immutable-raises-15m-series-a-to-bring-blockchain-gaming-mainstream","publishDate":"2019-09-23T11:06:57","id":12637,"type":null,"title":"‘Gods Unchained’ developer Immutable raises $15M Series A to bring blockchain gaming mainstream","category":["GAMING AND METAVERSE"],"content":["Blockchain gaming studio Immutable, the developer of a popular collectible card game called “Gods Unchained,” has raised $15 million in Series A, aiming to bring blockchain-based gaming to the masses.","The round was led by investment firms Naspers Ventures and Galaxy Digital EOS VC Fund, with participation from Apex Capital Partners, according to an announcement Monday.","The funds will be utilized to further develop the Gods Unchained game and to build an open-source blockchain platform for developers to create “immutable assets” such as cards, skins and weapons, the firm said.","Tyler Perkins, VP of marketing at Immutable, told The Block that the firm previously raised $1.8 million, so today’s Series A round brings the total to $16.8 million. Perkins did not comment on the firm’s valuation with the round. The previous funding round was backed by Coinbase Ventures and Nirvana Capital, among others, to develop the Gods Unchained game.","The game is now being led by Chris Clay, the former director of popular video game “Magic The Gathering (MTG): Arena.” Clay was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35202\/former-magic-the-gathering-arena-game-director-joins-blockchain-card-game-gods-unchained\" data-v-f87c67ca=\"\">hired<\/a> by Immutable last month to lead the game’s development, including design improvements and optimizing the overall community experience.","The firm wants to make blockchain gaming mainstream with the new capital. “We’re developing an array of applications to provide a ‘noob-proof’ experience for users to jump in and easily interact with this new digital asset class,” Perkins told The Block.","To that end, Immutable is also looking to hire “roughly 30 more [people] over the next 3-6 months,” in addition to its current headcount of around 50 people, said Perkins.","Built on the Ethereum blockchain, Gods Unchained has been in beta mode since July, and claims to have already sold more than 4 million cards, generating over $4.5 million in revenue through its limited “Genesis Sale,” which ends on Oct. 10.","Earlier this year, the firm <a href=\"https:\/\/blog.godsunchained.com\/2019\/02\/11\/the-62000-card\/\" data-v-f87c67ca=\"\">sold<\/a> a card dubbed “Hyperion” for about $62,000, claiming to be the second most-valuable game card in the world, followed by the MTG's \"Black Lotus\" card for $87,000 and its \"Alpha Black Lotus\" card for $27,000.","It is interesting to note Galaxy Digital EOS VC Fund's investment in the Ethereum-based gaming startup. “True ownership of digital objects reflects the next paradigm for interactive content by aligning the long-term incentives of publishers, developers, creators, and players. We’re investing broadly in the studios that are best executing on this vision across a variety of video game genres,” Sam Englebardt, co-founder and co-head of principal investments at Galaxy Digital, said in the announcement.","Perkins told The Block “We don’t believe there will be one blockchain to rule them all. Our intention for the Immutable Platform is to serve as an overlay that supports multiple protocols, allowing game developers to choose the one which works best for them.”","In a similar development last year, blockchain gaming startup Mythical Games <a href=\"https:\/\/in.finance.yahoo.com\/news\/activision-alums-raise-16-million-233549993.html\" data-v-f87c67ca=\"\">raised<\/a> $16 million to build an EOS-focused blockchain game studio. The round was also backed by Galaxy Digital EOS VC Fund, as well as OKCoin, among other investors.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Tyler Perkins","content":"PERSON"},{"type":"$1.8 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Perkins","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Naspers Ventures","content":"ORGANIZATION"},{"type":"Chris Clay","content":"PERSON"},{"type":"Sam Englebardt","content":"PERSON"},{"type":"$87,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$4.5 million","content":"MONEY"},{"type":"Oct. 10","content":"DATE"},{"type":"$15 million","content":"MONEY"},{"type":"MTG","content":"ORGANIZATION"},{"type":"$16.8 million","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Nirvana Capital","content":"ORGANIZATION"},{"type":"$62,000","content":"MONEY"},{"type":"Alpha Black Lotus","content":"ORGANIZATION"},{"type":"$16 million","content":"MONEY"},{"type":"Apex Capital Partners","content":"ORGANIZATION"},{"type":"$27,000","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}