{"summary":"Crypto exchange Coinbase launched an advocacy organization to get the crypto community involved in legislation ahead of upcoming votes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244841\/coinbase-launches-advocacy-organization-ahead-of-upcoming-votes-on-key-legislation","publishDate":"2023-08-14T15:05:01","id":12633,"type":null,"title":"Coinbase launches advocacy organization ahead of upcoming legislation","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Crypto exchange Coinbase is launching an advocacy organization in a move to get the crypto community involved in legislation ahead of upcoming votes in the U.S. Congress.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Dubbed the \"Stand with Crypto Alliance,\" Coinbase says the group is “<\/span><span class=\"s2\" data-v-f87c67ca=\"\">crypto’s first true grassroots movement that will be organized onchain,” according to a <a href=\"https:\/\/www.coinbase.com\/blog\/introducing-the-stand-with-crypto-alliance\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">statement<\/span><\/a>.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">“By providing a launch pad, the Alliance is mobilizing the full force of the decentralized crypto community to tell lawmakers: Recess is over. America’s crypto constituency is strong – and will be holding them accountable this fall when Congress votes on common-sense legislation to protect consumers and their right to crypto,” Coinbase said.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Crypto advocates have ramped up efforts over the past few months to get legislation passed that would improve regulation of the crypto industry in the country. Some have criticized regulators, like the Securities and Exchange Commission, for what they call a regulation by enforcement approach.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Two <a href=\"https:\/\/www.theblock.co\/post\/241812\/historic-crypto-market-bill-approved-to-advance-to-full-us-house\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">bills<\/span><\/a> are teed up to be voted on in the full House, including one bill that would direct regulators to create a clear path for how a digital asset can transition from being a security to a commodity. The other would create a comprehensive framework to regulate payment stablecoins. Both passed certain House committees last month.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The SEC sued Coinbase in June for<\/span><span class=\"s4\" data-v-f87c67ca=\"\"> allegedly operating as an unregistered exchange, broker and clearing agency. <\/span><span class=\"s5\" data-v-f87c67ca=\"\">The regulator also charged the crypto behemoth for the unregistered offer and sale of securities tied to its staking-as-a-service program. <\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Coinbase has fought back, asking the court earlier this month to dismiss the case entirely.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“With respect to litigation with the SEC, I want to be very clear — we do think we can win, we expect to win,” Coinbase’s Chief Legal Officer Paul Grewal said during an <a href=\"https:\/\/www.theblock.co\/post\/243128\/coinbase-plans-friday-filing-to-seek-dismissal-of-secs-case-in-its-entirety\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">earnings call<\/span><\/a> this month. Grewal also said the exchange wants to work with the SEC and lawmakers to obtain “regulatory clarity.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alliance","content":"ORGANIZATION"},{"type":"fall","content":"DATE"},{"type":"Crypto Alliance","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE","CONGRESS","SEC"],"authors":["Sarah Wynn","The Block"]}