{"summary":"The Bank of England&#x27;s deputy governor said that crypto is integrating into traditional finance and should be regulated.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197659\/regulate-crypto-systematic-problems-boe","publishDate":"2022-12-23T05:00:46","id":12648,"type":null,"title":"Regulate crypto before &#x27;systematic problems&#x27; occur, BoE official says","category":["CENTRAL BANKS"],"content":["The Bank of England's deputy governor said that crypto is integrating into traditional finance and should be regulated to protect retail speculators and the broader financial system.&nbsp;","Sir Jon Cunliffe <a href=\"https:\/\/news.sky.com\/story\/ftx-collapse-shows-crypto-is-too-dangerous-not-to-regulate-bank-of-england-deputy-governor-says-12773169\" data-v-f87c67ca=\"\">told<\/a> Sky News that the central bank is considering steps to regulate the crypto \"casino\" to protect investors and mitigate systemic risk.","Concerning retail investors, Cunliffe shared the BoE's stance that individuals should be able to safely speculate on crypto, as they speculate in traditional markets.","\"I think for the majority of people, if they do want to be involved in speculation in [crypto] ... for consumer protection and market integrity, they should have a place to do that where they get the protection they would get in a similar activity in the UK,\" he said.","Cunliffe noted that crypto is becoming increasingly integrated into the traditional financial system, so it should be regulated sooner rather than later.&nbsp;","\"We had banks and investment funds and others who wanted to invest in it,\" he said. \"I think we should think about regulation before it becomes integrated with the financial system and before we could have a potential systemic problem.\"","Meanwhile, the Bank of England is <a href=\"https:\/\/www.theblock.co\/post\/193894\/bank-of-england-opens-bids-for-cbdc-sample-wallet-proof-of-concept\" data-v-f87c67ca=\"\">seeking<\/a> a proof of concept for a sample wallet for a central bank digital currency and will take applications through Dec. 23.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"Cunliffe","content":"PERSON"},{"type":"Jon Cunliffe","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dec. 23","content":"DATE"}],"hashtag":["BOE"],"authors":["Adam James","The Block"]}