{"summary":"Data storage platform Arweave has opened the doors to compete directly with Ethereum and makes some bold claims.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279215\/arweave-releases-testnet-for-absurdly-scalable-compute-layer-designed-for-social-media-ai","publishDate":"2024-02-27T10:00:05","id":12647,"type":null,"title":"Arweave releases testnet for ‘absurdly scalable’ compute layer designed for social media, AI","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">It was around early 2020 when the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Arweave <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248460\/arweave-ar-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/oRt6SiEN_400x400.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">AR<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.34%\n    <\/span><\/a> <!----><\/span><\/span> team had a big idea that its data storage platform could underpin a highly scalable blockchain network. Yet at the time, it didn’t know exactly how to make that happen.<\/span>","Cut to 2023 when the team was focused on using Arweave for a social media network. While working on plans for using tokens to represent ownership of content, it realized that a highly scalable network was needed to support a marketplace for such tokens. Then it decided to have a second go.","“So then we were like, okay, let's dust off those plans, can we finish that? Can we get it into a place where it works?” said Arweave founder Sam Williams. “And then we realized, yes, we could — and we just started building.”","Around a month ago, the team created an internal testnet for what it called Arweave AO. Williams said it’s now running on 220 different machines and a few projects have started building on it, ahead of the testnet going public Tuesday.&nbsp;","At the same time, activity on the main Arweave chain has picked up. Williams noted that the network has now seen <a href=\"https:\/\/twitter.com\/samecwilliams\/status\/1757541645501788386\" data-v-f87c67ca=\"\">3 billion transactions<\/a>, with 1 billion of those in less than two months. This has also resulted in the platform’s native token AR going deflationary.","Moving forward, the plan is to have multiple audits for Arweave AO before an eventual mainnet that the team anticipates should take place in 2024.","Arweave is a decentralized data storage platform that’s <a href=\"https:\/\/www.theblock.pro\/research\/mapping-out-arweaves-ecosystem-118779\" data-v-f87c67ca=\"\">used for everything<\/a> from storing metadata for NFTs to developer tools.&nbsp;","Built on top of this, Arweave AO is designed to be a scalable network that can support all sorts of smart contracts and blockchain protocols.","The core idea is that it splits up the three main parts of running a blockchain into separate components that can talk to one another and execute a high number of transactions, all at the same time.","“We took essentially the orchestration of a normal blockchain and sliced it up into different modular components and then made each of those into horizontally scalable subnetworks,” said Williams.","The team built an operating system on top of Arweave AO called AOS. It uses the programming language Lua, which is also used by games such as <a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\">Roblox<\/a> and Angry Birds. Williams said it’s possible to build a blockchain compatible with the Ethereum Virtual Machine on top of Arweave AO, or any other virtual machine. He said it has already implemented WebAssembly, which is used to write smart contracts.","Williams stressed that the difference between Arweave AO and other high-performance blockchains like Aptos and Sui is that it could support storing large amounts of data, such as AI models. This is largely due to the project being based on a data storage platform at its very core.","“We built a hyper parallel computer, by which we mean a computer that can run any number of threads in parallel at the same time,” said Wiliams. “It’s absurdly scalable.”","While Arweave was very Ethereum-aligned in its early days, Arweave AO now puts it in a competing position and Williams is certainly confident that it could rival it. “I think there's a very good shot that if we can communicate it correctly, this is the last decentralized smart contracting machine that really gains traction,” he said.","However, it’s a bold claim to be an Ethereum killer — especially before it’s even live.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arweave AO","content":"ORGANIZATION"},{"type":"Williams","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Williams","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sam Williams","content":"PERSON"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Wiliams","content":"PERSON"},{"type":"Arweave","content":"ORGANIZATION"},{"type":"Sui","content":"PERSON"},{"type":"Aptos","content":"LOCATION"},{"type":"+0.34%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":["APTOS","DEVELOPER TOOLS","MODULAR","SUI"],"authors":["Tim Copeland","The Block"]}