{"summary":"Multiple Cosmos projects led by Osmosis are funding the development of a new security model called “mesh security.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231317\/osmosis-axelar-and-akash-fund-mesh-security-model-for-cosmos-ecosystem","publishDate":"2023-05-18T09:00:22","id":12643,"type":null,"title":"Osmosis, Axelar and Akash fund mesh security model for Cosmos","category":["CRYPTO ECOSYSTEMS"],"content":["Osmosis, the largest decentralized finance network in the Cosmos ecosystem, is spearheading the development of a novel cross-chain security model termed “mesh security.” This model aims to combine staked assets from two or more blockchains, thereby bolstering the security of the Cosmos ecosystem against potential security breaches or validator staking takeovers.&nbsp;","The development of mesh security is being funded by <a href=\"https:\/\/www.theblock.co\/post\/193252\/cosmos-largest-dex-osmosis-launches-a-stableswap-exclusive\" data-v-f87c67ca=\"\">Osmosis<\/a>, in collaboration with <a href=\"https:\/\/www.theblock.co\/post\/229061\/axelar-enables-sommelier-defi-vaults-to-connect-to-arbitrum\" data-v-f87c67ca=\"\">Axelar<\/a>, Akash Network, and ATOM Accelerator DAO. According to a note shared with The Block, the necessary funds for this initiative will be provided to Cosmos developers through grants.&nbsp;","Mesh security allows Cosmos chains to consolidate their token security. This leads to significantly higher economic security than what a single chain can offer. “With the introduction of mesh security, we can approach security bidirectionally, meaning that two chains, like Osmosis and Juno for example, can provide security to each other,” Sunny Aggarwal, co-founder of Osmosis Labs said. Layer 1 blockchain Juno is also a major contributor to mesh security's design.","In this framework, validators of a particular blockchain will have the option to re-stake their bonded tokens to validators of their choice on a partnering chain — a concept that echoes the <a href=\"https:\/\/www.theblock.co\/post\/208015\/eigenlayer-series-a-round\" data-v-f87c67ca=\"\">Eigen Layer<\/a>'s model on Ethereum.","The initiative is projected to be completed over three phases, with each phase estimated to last around three months. Development and funding will proceed, with contributions from teams across the <a href=\"https:\/\/mapofzones.com\/\" data-v-f87c67ca=\"\">Cosmos ecosystem<\/a>. The final launch is anticipated to occur in the first quarter of 2024.","Cosmos developers recently launched a similar model called <a href=\"https:\/\/www.theblock.co\/post\/219219\/cosmos-hub-releases-replicated-security\" data-v-f87c67ca=\"\">replicated security<\/a> (originally called interchain security), which allows Cosmos blockchains to derive their security from the main, central chain known as the Cosmos Hub. Replicated security is tailored for chains that choose to rely entirely on the Cosmos Hub’s set of validators. The first blockchain to go live recently with this mechanism was <a href=\"https:\/\/www.theblock.co\/post\/230581\/cosmos-blockchain-neutron-goes-live-on-mainnet-with-replicated-security\" data-v-f87c67ca=\"\">Neutron<\/a>, a smart contract platform.&nbsp;","Unlike replicated security, which operates with a top-down security flow from a central chain, mesh security will be designed for already established application-specific chains who secure themselves by combining the value of their validator stakes, the Osmosis team explained.","“Mesh Security primarily targets app chains that already have their stakeholder sets and possess a sufficiently high market cap to secure themselves. Mesh merely provides additional security for them,” explained Aggarwal.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter of 2024","content":"DATE"},{"type":"ATOM Accelerator DAO","content":"ORGANIZATION"},{"type":"Mesh Security","content":"ORGANIZATION"},{"type":"Eigen Layer","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Akash Network","content":"ORGANIZATION"},{"type":"Cosmos","content":"ORGANIZATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Axelar","content":"PERSON"}],"hashtag":["COSMOS"],"authors":["Vishal Chawla","The Block"]}