{"summary":"Prices for GPUs have been steadily declining for the past few months, as demand from Etherium miners seems to be dwindling.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144954\/a-look-at-the-trends-driving-down-gpu-prices-and-what-this-means-for-ethereum-miners","publishDate":"2022-05-05T13:36:18","id":12640,"type":null,"title":"A look at the trends driving down GPU prices — and what this means for Ethereum miners","category":["MINING"],"content":["<span data-v-f87c67ca=\"\">It was not uncommon to see GPUs sell for hundreds of dollars above the suggested retail price during most of last year. The shortage of units even led some <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/94414\/ethereum-miners-gaming-laptops-gpu-shortage\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum miners to use their laptops to mine<\/span><\/a><span data-v-f87c67ca=\"\">. But that trend seems to now be reversing as demand for Ethereum miners has dwindled.<\/span>","<span data-v-f87c67ca=\"\">Prices for GPUs or graphics cards have been on a slow and steady decline since at least the beginning of 2022.<\/span>","<span data-v-f87c67ca=\"\">Mark D’Aria, CEO of Bitpro Consulting, a retailer of used GPUs, said that he’s seen prices decrease 3% to 4% every week since the beginning of the year.<\/span>","<span data-v-f87c67ca=\"\">The company tracks the selling prices of over 40 GPU models, spanning everything from the low to very high-end. Data shared with The Block shows that the average of that index was $760 on December 5 and $453 on April 17.<\/span>","<span data-v-f87c67ca=\"\">“What we’re basically seeing here is a shift in demand away from miners,” D’Aria told The Block. High Ethereum mining revenues help explain why the industry “completely” controlled the price of these GPUs in 2021, while in years prior there was “barely any demand” from miners, he explained.<\/span>","","","<span data-v-f87c67ca=\"\">Ethereum mining revenues hit a record high in May 2021, totaling $2.4 billion, according to data compiled by The Block Research. <\/span>","<span data-v-f87c67ca=\"\">But that number has been falling since November of last year, recovering slightly in March and April 2022. And in the meantime, the network has edged closer to switching to a proof of stake consensus mechanism that would not require GPUs.<\/span>","<span data-v-f87c67ca=\"\">Ethan Vera, COO of Luxor, which runs an Ethereum mining pool, said that Ethereum hash rate growth has stalled significantly in 2022 compared to last year, as a result of miners scaling down their investments, as well as “some sell pressure.” Pools enable miners to collectively contribute their hashing power and raise the chance of discovering a block together.&nbsp;<\/span>","According to data from The Block Research, Ethereum's hash rate grew by around 604.72 terahash\/second (TH\/s) between January 1, 2021 and January 1, 2022. It has continued rising in the past few months but at a slower rate. Between January 1 and May 2, the hash rate grew 106.94 TH\/s.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereums-hash-rate-daily\/embed\" title=\"Ethereum's Hash Rate (TH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">According to Vera, it has also become harder to raise money, given the uncertainty of Ethereum’s future.<\/span>","<span data-v-f87c67ca=\"\">“It's not like Bitcoin where the capital markets have an appetite for these machines. I definitely think capital flowing into the space has cooled down here in Q1 2022,” he said.<\/span>","<span data-v-f87c67ca=\"\">Ethereum’s transition to proof of work from proof of work has been in the works since 2016 and, while it has been delayed multiple times, developers <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/141609\/ethereum-largely-passes-first-major-test-for-proof-of-stake\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">successfully tested proof-of-stake on mainnet<\/span><\/a><span data-v-f87c67ca=\"\"> last month. Ethereum core developer Tim Beiko recently said that “the merge” would likely happen a few months after June.<\/span>","<span data-v-f87c67ca=\"\">“No firm date yet, but we're definitely in the final chapter of PoW on Ethereum,” he <\/span><a href=\"https:\/\/twitter.com\/TimBeiko\/status\/1514010098145759232?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1514010098145759232%7Ctwgr%5E%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2022-04-13%2Fethereum-developer-says-upgrade-will-be-later-than-june\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote on Twitter<\/span><\/a> earlier this month.","<span data-v-f87c67ca=\"\">With the shift, GPUs will no longer be needed. While proof-of-work requires miners to solve complicated mathematical problems, with proof-of-stake so-called validators stake ETH in order to participate in the system and are chosen at random to create new blocks.<\/span>","<span data-v-f87c67ca=\"\">Vera said that at least in the short term, most of the hardware used in Ethereum mining would become useless with proof-of-stake, but eventually, miners will find ways to repurpose GPUs.<\/span>","<span data-v-f87c67ca=\"\">“It would be hard for an Ethereum miner to liquidate their GPUs at a reasonable price if the change happened right away because the markets can be flooded,” Vera said. “Over the kind of mid-to-long-term, I think those GPUs can get repurposed.”<\/span>","<span data-v-f87c67ca=\"\">Several things seem to be been driving prices down.<\/span>","<span data-v-f87c67ca=\"\">“There are definitely a lot of factors that are kind of combining here,” said D’Aria. “The supply chain does seem to be clearing up a bit, at least in (the sense) that you can get new GPUs easier. I think a lot of that is just less miners buying everything off the shelves as soon as it hits the shelves.”<\/span>","<span data-v-f87c67ca=\"\">The amount of money each GPU is able to generate has also been consistently declining, according to data compiled by D’Aria.<\/span>","<span data-v-f87c67ca=\"\">“Since the beginning of the year, on average, people are losing more money net, even after what they mine. A lot of people are really surprised to hear that and don't believe me until I show them the numbers,” he said. “Anyone who's been holding on to GPU has made a mistake. They should have sold January 1.”<\/span>","<span data-v-f87c67ca=\"\">D’Aria said that different miners are taking varying approaches. Some are trying to get out ahead and sell their GPUs before the market gets flooded, while others are waiting to see what happens or have even kept building up their mining rigs.<\/span>","<span data-v-f87c67ca=\"\">The weather also likely plays a role in driving these trends. The closer we get to warmer months the more challenging it’s going to get to run GPUs with the heat outside.<\/span>","<span data-v-f87c67ca=\"\">One thing seems clear: “There’s a lot of factors kind of pushing people towards selling and there's really not a lot of factors pushing people towards buying right now,” said D’Aria.<\/span>","<span data-v-f87c67ca=\"\">On the other side, Vera believes that GPU prices are being driven down largely because of the supply chain or lack of demand in other categories.<\/span>","<span data-v-f87c67ca=\"\">It’s the higher-end part of the GPU market that has mostly been affected by Ethereum miners, according to D’Aria. For that reason, the prices for more expensive machines are declining slightly faster than the more affordable ones, he said.<\/span>","<span data-v-f87c67ca=\"\">“There was a much bigger demand for these super high-end GPUs that gamers never really were willing to pay on average that much for,” he said. “Because miners were willing to pay whatever it cost, Nvidia sold far more 3090s than they would have sold to just gamers (...) there was this massive amount of volume of the really high-end cards.”<\/span>","As an example,&nbsp;RTX 3080 sold for around $,1,942 on December 5 and $1,082 on April 17, according to <span data-v-f87c67ca=\"\">D’Aria's data. On the same dates, an RX480 went from $240 to $144. D'Aria said that prices of new GPUs on the retail market were tracking closely to the ones on the secondary market.<\/span>","<span data-v-f87c67ca=\"\">D’Aria also argued that some miners who have kept building have the misguided idea that they’ll simply be able to move on to mining other coins after Ethereum shifts to proof-of-stake. In reality, he explained, profitability would drop sharply as hashrate went over to those other coins.<\/span>","<span data-v-f87c67ca=\"\">“Even if you have free electricity it's questionable whether this is even worth your time,” he said. “​​What these of these new amateur miners don’t understand is that Ethereum is 97% of all GPU mining income right now.\"<\/span>","<span data-v-f87c67ca=\"\">Similarly, Vera said that “profitability per unit of computers is gonna drastically decline” as hundreds of thousands of GPUs shift to mining other coins, such as Ravencoin.<\/span>","<span data-v-f87c67ca=\"\">Vera estimated that, based on the available pool of hashing power, there is a combined value of around $11.4 billion in machines currently securing the Ethereum network. That number breaks down to $3 billion in old-generation GPUs, $7.3 billion in new-generation GPUs and $1 billion in ASICs<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Ethan Vera","content":"PERSON"},{"type":"Bitpro Consulting","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"4%","content":"PERCENT"},{"type":"$,1,942","content":"MONEY"},{"type":"January 1, 2022","content":"DATE"},{"type":"$2.4 billion","content":"MONEY"},{"type":"Vera","content":"PERSON"},{"type":"Twitter<\/span><\/a> earlier this month","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Vera","content":"ORGANIZATION"},{"type":"$7.3 billion","content":"MONEY"},{"type":"$760","content":"MONEY"},{"type":"$144","content":"MONEY"},{"type":"Luxor","content":"LOCATION"},{"type":"$240","content":"MONEY"},{"type":"May 2","content":"DATE"},{"type":"May 2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"November of last year","content":"DATE"},{"type":"$11.4 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"Ravencoin","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nvidia","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"GPU","content":"ORGANIZATION"},{"type":"December 5","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Tim Beiko","content":"PERSON"},{"type":"January 1, 2021","content":"DATE"},{"type":"$1,082","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"April 17","content":"DATE"},{"type":"January 1","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"$453","content":"MONEY"}],"hashtag":["ETHEREUM"],"authors":["Catarina Moura","The Block"]}