{"summary":"The dispute in the press parallels the SEC&#x27;s ongoing enforcement action against Ripple over XRP. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166302\/sec-v-ripple-battle-spills-over-into-wsj-op-ed-pages","publishDate":"2022-08-29T13:48:40","id":12654,"type":null,"title":"SEC v. Ripple battle spills over into WSJ op-ed pages","category":["POLICY"],"content":["The battle between crypto firm Ripple and the Securities and Exchange Commission (SEC) has moved into a new venue of sorts.&nbsp;","Early last week, SEC Chair Gary Gensler wrote an <a href=\"https:\/\/www.wsj.com\/articles\/the-sec-treats-crypto-like-the-rest-of-the-capital-markets-disclosure-compliance-security-investment-mutual-fund-protections-blockfi-bankruptcy-bitcoin-11660937246?mod=article_inline\" data-v-f87c67ca=\"\">op-ed<\/a> for the Wall Street Journal promoting his handling of crypto regulation during his time at the commission.","While many in the crypto industry lament his \"<a href=\"https:\/\/www.theblock.co\/post\/158559\/crypto-enforcement-takes-center-stage-in-sec-appearance-before-congress\" data-v-f87c67ca=\"\">regulation by enforcement<\/a>,\" Gensler has argued that he is simply applying the securities laws in a tech-neutral way.","\"Whether a car runs on gasoline or electricity, drivers and passengers deserve to be protected,\" Gensler wrote in his op-ed, using the analogy of seatbelt laws. \"There’s no reason to treat the crypto market differently from the rest of the capital markets just because it uses a different technology.\"","&nbsp;On August 28, the Wall Street Journal published a <a href=\"https:\/\/www.wsj.com\/articles\/sec-gensler-crypto-regulation-ripple-11661543286\" data-v-f87c67ca=\"\">letter<\/a> in response to Gensler's op-ed from Ripple's general counsel, Stu Alderoty.","Alderoty took issue with Gensler's core metaphor, writing:&nbsp;","\"Mr. Gensler writes that whether a car runs on gas or electricity, you still need a seat belt. No one disputes that. But electric cars don’t need gas, and in his analogy, it is gas that the SEC is selling. Mr. Gensler looks to punish anyone who isn’t buying it.\"","One of the highest-profile enforcement actions the SEC has undertaken against a <a href=\"https:\/\/www.theblock.co\/post\/157448\/judge-reaffirms-that-sec-must-produce-materials-related-to-hinman-speech-in-ripple-case\" data-v-f87c67ca=\"\">crypto firm is SEC v. Ripple<\/a>, which the commission launched in the twilight of prior Chair Jay Clayton's term.","The case hinges upon the relationship between Ripple and the token XRP, which the SEC calls a security. As one since-ousted marketing executive at Ripple once <a href=\"https:\/\/twitter.com\/CoryTV\/status\/1047985430988083201\" data-v-f87c67ca=\"\">put<\/a> it, the firm claims that \"Ripple’s relationship to XRP is akin [sic] Chevron’s relationship to oil.\" The more recent op-ed from Alderoty seems to imply that the SEC itself has become the Chevron in question.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Jay Clayton","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"\" Gensler","content":"PERSON"},{"type":"Stu Alderoty","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"August 28","content":"DATE"},{"type":"Chevron","content":"ORGANIZATION"}],"hashtag":["GARY GENSLER","XRP"],"authors":["Kollen Post","The Block"]}