{"summary":"The SEC said Voyager&#x27;s plan to sell crypto assets could violate securities laws as it objects to Binance.US&#x27;s acquisition plans.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214333\/sec-and-new-york-regulators-push-back-on-binance-uss-acquisition-of-voyager","publishDate":"2023-02-23T05:48:43","id":12666,"type":null,"title":"SEC and New York regulators push back on Binance.US&#x27;s acquisition of Voyager","category":["REGULATION"],"content":["The U.S. Securities and Exchange Commission (SEC), the New York Department of Financial Services (NYDFS) and the Attorney General of the State of New York have objected to Binance.US’s amended plan to acquire crypto lender Voyager.","The objections were filed as part of Voyager's bankruptcy proceedings in the Southern District of New York on Feb. 22.","Binance.US <a href=\"https:\/\/www.theblock.co\/post\/196216\/binance-us-buy-voyager-assets\" data-v-f87c67ca=\"\">entered<\/a> into a good faith agreement with Voyager to acquire the crypto lender's assets in December 2022. The exchange's&nbsp;<a href=\"https:\/\/techcrunch.com\/2022\/12\/19\/binance-us-to-buy-voyager-digitals-assets-for-1-billion\/\" data-v-f87c67ca=\"\">winning bid<\/a> of $1 billion beat other industry players such as CrossTower and Wave Financial. The acquisition is still subject to regulatory approval, however.","The SEC objects to the debtor's plans to sell crypto assets as part of its rebalancing plan and has concerns about the security of assets on Binance.US's platform.","\"Here, the transactions in crypto assets necessary to effectuate the rebalancing, the re-distribution of such assets to account holders, may violate the prohibition in Section 5 of the Securities Act of 1933 against the unregistered offer, sale, or delivery after sale of securities,\" said Therese Scheuer, senior trial counsel at the SEC, in the filing.","The regulator also raised concerns over whether Voyager could demonstrate that it complies with federal laws with this plan, questioned whether the acquisition is \"just a $20 million sale of Voyager’s customer list to Binance.US\" and also said the plan did not include adequate detail on the impact of potential regulatory action on the purchaser, Binance.US.&nbsp;","\"Regulatory actions, whether involving Voyager, Binance.US or both, could render the transactions in the plan impossible to consummate, thus making the plan unfeasible,\" said Scheuer in the filing.","Meanwhile, the NYDFS&nbsp;<a href=\"https:\/\/cases.stretto.com\/public\/x193\/11753\/PLEADINGS\/1175302222380000000174.pdf\" data-v-f87c67ca=\"\">alleges<\/a> the current plan “unfairly discriminates” against New Yorkers by delaying their recovery of assets compared to other creditors within the same class and criticized Voyager for illegally operating in the state of New York.","\"Even putting aside for the moment the debtors’ past violations of law, the debtors’ plan as proposed unfairly discriminates against these New Yorkers by materially delaying their recovery compared to creditors in the same class and by not allowing them the option to recover cryptocurrency instead of liquidated assets,\" said Kevin Puvalowski, acting executive deputy superintendent for NYDFS, in the filing.","This isn't the first time the regulators have pushed back on the deal. Federal and state agencies <a href=\"https:\/\/www.theblock.co\/post\/199276\/regulators-say-not-so-fast-to-binance-us-acquisition-of-voyager-digital\" data-v-f87c67ca=\"\">previously objected<\/a> to the sale, citing the possibility that assets could be moved offshore and more challenging to recover on behalf of consumers.&nbsp;","The ad hoc committee of equity holders has also submitted an objection to the amended acquisition plan.","Several regulatory actions have been taken against crypto companies as of late. Crypto exchange Kraken <a href=\"https:\/\/www.theblock.co\/post\/210332\/kraken-settles-sec-charges-over-its-staking-program\" data-v-f87c67ca=\"\">settled<\/a> with the SEC over the failing to register the offer and sale of its “crypto asset staking-as-a-service program” last week, paying a $30 million fine. Lender Nexo is set to <a href=\"https:\/\/www.theblock.co\/post\/210841\/nexo-will-stop-its-earn-interest-product-for-us-clients-in-april\" data-v-f87c67ca=\"\">close down<\/a> its earn program in the U.S. following a settlement with the SEC.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"State of New York","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Therese Scheuer","content":"PERSON"},{"type":"Feb. 22","content":"DATE"},{"type":"$30 million","content":"MONEY"},{"type":"1933","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Kevin Puvalowski","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"$20 million","content":"MONEY"},{"type":"Scheuer","content":"PERSON"},{"type":"CrossTower","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","BINANCE","SEC"],"authors":["Kari McMahon","The Block"]}