{"summary":"Republican candidate Vivek Ramaswamy, who had garnered some support from crypto executives, is out of the race. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272877\/crypto-friendly-vivek-ramaswamy-is-out-of-the-u-s-presidential-race","publishDate":"2024-01-16T11:16:23","id":12665,"type":null,"title":"Crypto-friendly Vivek Ramaswamy is out of the U.S. presidential race","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Republican presidential candidate Vivek Ramaswamy, who was one of the only candidates to have a designated crypto plan and garnered some support from crypto executives, is out of the race.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy announced the suspension of his candidacy late on Monday following results from the Iowa caucus.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"The people spoke loud &amp; clear about who they want,\" Ramaswamy posted on Monday night on X. \"Tonight I am suspending my campaign and endorsing Donald J. Trump and will do everything I can to make sure he is the next U.S. President. I am enormously proud of this team, this movement, and our country.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Former President Donald Trump clenched a win in the caucus and was followed by Florida Governor Ron DeSantis and former U.N. Ambassador Nikki Haley, according to reports.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Ramaswamy had garnered some support from crypto advocates over the past year, including Messari CEO Ryan Selkis.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Vivek is now the most influential libertarian in the country. And he’s pro crypto. Trump knows he’s an asset,\" Selkis <a href=\"https:\/\/twitter.com\/twobitidiot\/status\/1747120362750366067\" data-v-f87c67ca=\"\">posted<\/a> on X in response to Ramaswamy's drop out of the race.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Trump has not said publicly who he would pick as his vice president running mate if he wins the nomination. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">Trump has dabbled in NFTs, <a href=\"https:\/\/www.theblock.co\/post\/195431\/only-99-former-us-president-donald-trump-unveils-nft-trading-card-collection\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">releasing<\/span><\/a> a collection of 45,000 of them in December 2022. A year later, Trump <a href=\"https:\/\/www.theblock.co\/post\/267294\/trump-hawks-new-nfts-for-a-chance-to-win-a-piece-of-his-mugshot-suit\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">unveiled another<\/span><\/a>&nbsp;set of digital trading cards that give fans the chance at scoring perks like dinner with the former president, or nabbing a piece of the suit he wore when taken in by Georgia police after being indicted in August.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Crypto has been brought up a few times by Republican presidential candidates over the past year. Ramaswamy said last month that his plan in part would block regulation of self-hosted wallets and allow for the \"freedom to innovate without regulatory overreach.\" Meanwhile, Republican presidential candidate Ron DeSantis, in his capacity as the governor of Florida, blocked the use of CBDCs in his state in May.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Ramaswamy also criticized SEC Chair Gary Gensler during a debate last month. The SEC chair has been consistent in his stance that many cryptocurrencies are securities and need to follow securities laws, while urging crypto exchanges to register with his agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think it's nothing short of embarrassing that Gary Gensler, the current leader of the SEC, in front of Congress could not even say whether Ethereum counted as a regulated security or not,\" Ramaswamy said during the debate. \"This is just another example of the administrative state gone too far.\"&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ramaswamy","content":"PERSON"},{"type":"Ron DeSantis","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Trump","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"last month","content":"DATE"},{"type":"Donald J. Trump","content":"PERSON"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Iowa","content":"LOCATION"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Georgia","content":"LOCATION"},{"type":"\" Ramaswamy","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"Nikki Haley","content":"PERSON"},{"type":"Donald Trump","content":"PERSON"},{"type":"\" Ramaswamy","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"U.N.","content":"ORGANIZATION"},{"type":"Vivek","content":"PERSON"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}