{"summary":"The TradFi exchange took a step into crypto as its clearinghouse unit signed a deal to begin offering trading in bitcoin derivatives. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226180\/london-stock-exchange-bitcoin-lch-clearing","publishDate":"2023-04-13T10:12:34","id":12673,"type":null,"title":"London Stock Exchange unit to clear bitcoin derivatives","category":["COMPANIES"],"content":["London Stock Exchange Group took a step into crypto as its French clearinghouse unit signed a deal with an institutional-focused trading venue to offer trading in bitcoin derivatives.&nbsp;","LSE's LCH division plans to begin clearing bitcoin index futures and options for&nbsp;GFO-X, a UK-based startup founded in 2020, according to a <a href=\"https:\/\/www.lch.com\/resources\/press-releases\/lch-sa-provide-clearing-services-bitcoin-index-derivatives-gfo-x\" data-v-f87c67ca=\"\">statement<\/a>. The new venture will be known as&nbsp;LCH DigitalAssetClear.","Clearinghouses sit between the two sides of a trade and step in should one party default on their obligations. LCH, the world’s largest clearinghouse for derivatives, said clearing for the new digital assets venture will be entirely separated from other trading operations, including a segregated default fund.","LSE's move comes as bitcoin's price has climbed more than 80% this year, reigniting some institutional interest despite high-profile crypto bankruptcies and <a href=\"https:\/\/www.theblock.co\/post\/223485\/cftc-binance-suit-what-comes-next\" data-v-f87c67ca=\"\">regulatory action<\/a>.&nbsp;","The new index futures and options contracts will be based on the GFO-X\/Coin Metrics Bitcoin Reference Rate, a reference rate of the U.S. dollar price of bitcoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"London Stock Exchange Group","content":"ORGANIZATION"},{"type":"LCH","content":"ORGANIZATION"},{"type":"Coin Metrics Bitcoin Reference Rate","content":"ORGANIZATION"},{"type":"LSE","content":"ORGANIZATION"},{"type":"2020","content":"DATE"}],"hashtag":["TRADFI BANKS"],"authors":["Andrew Rummer","The Block"]}