{"summary":"One Trading, the crypto exchange that emerged earlier this year, will officially launch its new trading venue in the next few weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266449\/thiel-one-trading-launch-crypto","publishDate":"2023-12-07T05:05:02","id":12675,"type":null,"title":"Thiel-backed One Trading to launch, promising market-leading speed","category":["EXCHANGES"],"content":["One Trading, the crypto exchange that emerged as a spin-off from Bitpanda earlier this year, will officially launch its new trading venue in the next few weeks.","The business arrives in the market promising its F.A.S.T platform will be the “fastest-ever digital asset trading venue,” according to an announcement this morning. Specifically, One Trading claims its matching and risk engine operates at less than one microsecond and that users can perform over 200 round trips of price discovery, order creation and cancellation before a single order can be placed on established rival exchanges.","Amazon Web Services (AWS), the cloud services giant, independently tested the venue’s speed and found One Trading’s round trip of 112 microseconds beats the 126 microseconds on offer at London Stock Exchange Group’s Turquoise venue and is 1,000 times faster than CME’s global Matching Engine, according to today’s announcement.&nbsp;","“Our team has worked relentlessly to create a trading venue that redefines speed and efficiency. With F.A.S.T, we aim to empower our customers with unparalleled advantages in the competitive world of crypto trading,” said Josh Barraclough, CEO of One Trading.","One Trading will also launch with free trading on all crypto pairs to lure big institutional traders. It has applied for a MiFID II Trading Venue License in the European Union and plans to roll out derivatives and structured products in due course.&nbsp;","One Trading emerged when Bitpanda Pro, a unit of the Austrian exchange catering to institutional and professional crypto traders, <a href=\"https:\/\/www.theblock.co\/post\/236827\/bitpanda-pro-spins-out-under-josh-barraclough-raises-e30-million\" data-v-f87c67ca=\"\">broke away from the main business in June<\/a> — raising €30 million in a Series A round led by Peter Thiel’s Valar Venture. It's run by Josh Barraclough, who had overseen Bitpanda Pro and was a digital innovation head at JPMorgan before that.","The startup, which now has a headcount of 34, has been beta-testing its platform with market makers in recent weeks. Once live, the venue will be open to both institutions and retail customers — with colocation services on offer for the former.","One Trading will launch into a crowded market for crypto exchanges. CoinMarketCap alone tracks 227 spot exchanges globally, with a combined 24-hour volume of $434.34 billion, <a href=\"https:\/\/coinmarketcap.com\/rankings\/exchanges\/\" data-v-f87c67ca=\"\">according to its website<\/a>.","Greg McLoughlin, strategy and growth lead at One Trading, hopes its focus on speed will prove a differentiating factor. “Given the price discovery and execution advantage versus other venues we believe that we can be the central risk transfer venue for all major liquidity providers. On top of this, making it free to trade means that big institutions can exchange risk and execute at the lowest costs,” he told The Block.","“If you are an institution, you almost have a fiduciary responsibility to trade on our venue given the cost and execution advantage. Given the liquidity profiles coming on board we expect to have significant depth and the best pricing.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"London Stock Exchange Group’s Turquoise","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"European Union","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Amazon Web Services (AWS","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Peter Thiel’s Valar Venture","content":"ORGANIZATION"},{"type":"Greg McLoughlin","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Josh Barraclough","content":"PERSON"},{"type":"Bitpanda Pro","content":"PERSON"},{"type":"$434.34 billion","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"earlier this year","content":"DATE"},{"type":"Bitpanda","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}