{"summary":"The crypto exchange&#x27;s proposal features several unique ways of approaching trading, particularly disintermediation of clearing and altering margin levels in real time. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137304\/cftc-opens-up-ftx-uss-derivatives-trading-model-to-public-comment","publishDate":"2022-03-10T13:50:54","id":12681,"type":null,"title":"CFTC opens up FTX US&#x27;s derivatives trading model to public comment","category":["EXCHANGES"],"content":["FTX.US's plan to offer crypto derivatives is moving forward with the Commodity Futures Trading Commission announcing on Thursday that it would open up the exchange's plan for public comments.&nbsp;","The 30-day comment period would allow market participants to weigh in on FTX's plan to leverage the Derivatives Clearing Organization (DCO) license it obtained via its acquisition of LedgerX. The US-based firm has ambitions to offer crypto derivatives directly to users under the same umbrella as its spot trading offering — similar to its international affiliate FTX.&nbsp;","It's not clear when the CFTC will approve FTX.US's plans, but the 30-day comment period is the latest step in the firm's path to launch.&nbsp;","As for the comment period, the CFTC's questions focus on the unique risks of crypto trading, as well as the unique ways that crypto allows to mitigate those risks.","Unlike traditional derivatives exchanges in the US like the CME, FTX plans to offer its futures directly to users rather than through futures commission merchants, which typically handle clearing in traditional futures.&nbsp;","<strong data-v-f87c67ca=\"\">On the margin<\/strong>","Currently, FTX.US allows users who have at least $100,000 in assets on the platform to apply to trade margin in spot markets.","“The most critical piece of the application was going through the actual margin model. Very few new margin models have been approved in the history of the CFTC,” FTX.US president Brett Harrison told The Block.&nbsp;","The proposed system for margining would update its levels in more-or-less real-time — every 10 seconds or so rather than in the 24-hour windows that are the current standard. It would also allow the integrating of spot and futures portfolios, allowing traders in derivatives to use their spot holdings as collateral.","Harrison points out that the new model allows investors to put more of their portfolios to use and protects everyone from the sorts of market changes that accumulate over 24-hour intervals. In times of market volatility, those periods can result in cascading liquidations.&nbsp;","<span data-v-f87c67ca=\"\">“We can liquidate people in small batches and in a continuous fashion, but also make sure that people aren’t completely underwater,\" he said.&nbsp;<\/span>","Harrison further noted, that their registration with the CFTC is not limited to crypto. \"Crypto is our top priority, but farther down the line I think there is a real possibility that we could apply this to more traditional futures and options.”","FTX.US is the US affiliate of the global FTX exchange, which features significantly more trading offerings than US regulations currently allow. FTX.US has been working hard to obtain approval from American regulators, particularly the CFTC.","A major step was FTX.US's acquisition of <a href=\"https:\/\/www.theblockcrypto.com\/post\/116189\/ftx-us-met-with-the-cftcs-leadership-in-the-run-up-to-its-ledgerx-acquisition-announcement\" data-v-f87c67ca=\"\">registered derivatives exchange LedgerX<\/a> last fall. In November, the exchange also hired a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/123003\/ftx-us-hires-gensler-era-cftc-commissioner-to-spearhead-lobbyingarchive\" data-v-f87c67ca=\"\">former CFTC commissioner<\/a> to head up its lobbying.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Harrison","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"last fall","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Derivatives Clearing Organization (DCO","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Brett Harrison","content":"PERSON"}],"hashtag":["CFTC","DERIVATIVES","FTX"],"authors":["Kollen Post","The Block"]}