{"summary":"Polygon gas limits and a third-party relay contributed to an issue mining transactions for Lens Protocol, which said an update is coming soon.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180084\/lens-protocol-stalls-services-due-to-transaction-issues","publishDate":"2022-10-26T13:58:01","id":12689,"type":null,"title":"Lens Protocol stalls services due to transaction issues","category":["BLOCKCHAIN"],"content":["<em data-v-f87c67ca=\"\">Update: Lens Protocol in a tweet <a href=\"https:\/\/twitter.com\/LensProtocol\/status\/1585375325198090240?s=20&amp;t=Xox00iyI2FzAP8fwZ6pNag\" data-v-f87c67ca=\"\">said<\/a> the issue was resolved later on Wednesday.&nbsp;<\/em>","<span data-v-f87c67ca=\"\">Gas limits on the Polygon blockchain network coupled with a buildup queue on a third-party relay resulted in a transaction mining issue on Lens Protocol, the service reported.<\/span>","<span data-v-f87c67ca=\"\">As the issue persisted, users in the service's Discord channel reported they were unable to claim social media handles from the protocol. An update came from Lens once the mining problems are resolved, the protocol said in an <a href=\"https:\/\/twitter.com\/LensProtocol\/status\/1585287146566467589?s=20&amp;t=QZzXsdPY-rZZQHlYdwt3vw\" data-v-f87c67ca=\"\">announcement<\/a> on Twitter. The service said it had resolved the issue later in the day on Wednesday.<\/span>","<span data-v-f87c67ca=\"\">Since its February 2022 launch, more than 50 applications <a href=\"https:\/\/www.theblock.co\/post\/147337\/aaves-backbone-for-decentralized-social-media-lens-protocol-goes-live-on-polygon\" data-v-f87c67ca=\"\">reportedly<\/a> utilized Lens Protocol, a platform created by Aave developers that allows applications to plug into user-owned social data enabled via NFTs for authentication and monetization.<\/span>","<em data-v-f87c67ca=\"\">Editor's Note: This story has been updated throughout to reflect that Lens Protocol on Twitter said the issue has been resolved.&nbsp;<\/em>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Twitter","content":"DATE"},{"type":"February 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"}],"hashtag":["AAVE"],"authors":["Jeremy Nation","The Block"]}