{"summary":"Bitcoin is the perfect currency for AI systems, thanks to its digital nature, censorship resistance and provable scarcity, according to Arthur Hayes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238311\/bitcoin-ai-currency-arthur-hayes","publishDate":"2023-07-07T07:04:34","id":12682,"type":null,"title":"Bitcoin will be the currency of artificial intelligence, Arthur Hayes says","category":["PEOPLE"],"content":["Arthur Hayes, former CEO of Bitmex and now managing a family office named Maelstrom, views Bitcoin — with its inherent digital, anti-censorship, and limited nature — as the ultimate currency for artificial intelligence (AI) systems.","In his latest blog <a href=\"https:\/\/cryptohayes.substack.com\/p\/massa\" data-v-f87c67ca=\"\">post<\/a>, Hayes posits that the decentralized nature of the Bitcoin network and the control its network's users have over their own assets align with the probable characteristics of future AI economies.","As Bitcoin's value is intrinsically tied via mining to the cost of electricity — the “food of AI” as Hayes puts it — it provides an efficient and predictable store of value for AI systems over time, he argues, adding that “Bitcoin is the monetary instrument closest to representing pure energy.”","Moreover, Bitcoin's provable scarcity and censorship resistance offers AI-based technologies an advantage over other forms of currency, according to Hayes. While the supply of gold and fiat currencies can fluctuate, Bitcoin's supply is cryptographically limited, offering a predictable financial foundation for such systems that cannot be manipulated, Hayes said.","According to Hayes, if the AI economy adopts Bitcoin, the collision of the need to escape inflation within the fiat system and the drive to participate in the next phase of human and computer evolution could spur investors to overvalue Bitcoin's growth.","“If Bitcoin is seen as likely to be — or even starts to be — used by AIs, then we could see two separate manias combine into one mega mania: the mania of wanting to escape inflation within the fiat financial system, and the mania of wanting to own a piece of the next phase of human and computer evolution'\" Hayes said. \"The overlap of these two manias would likely drive investors to grossly overpay for growth, causing the value of the Bitcoin network to rise to silly levels.\"","Hayes's predictive model forecasts that by 2025 or 2026, the AI economy could be worth between 5% and 50% of global GDP, generating a potential surge in Bitcoin's value as high as $760,000 per coin. As market assumptions shift from this \"can never happen to maybe could happen,\" that represents the period of greatest opportunity for those long on Bitcoin, Hayes said.","While the future of AI and Bitcoin remains uncertain, “I plan to jump aboard the narrative hype wagon and profit,” he added.","In May, Hayes predicted a <a href=\"https:\/\/www.theblock.co\/post\/232399\/arthur-hayes-predicts-volatile-2023-followed-by-strong-bitcoin-rally\" data-v-f87c67ca=\"\">volatile year<\/a> for Bitcoin in 2023, followed by a strong rally from 2024.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"2026","content":"DATE"},{"type":"Hayes","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"AIs","content":"ORGANIZATION"},{"type":"$760,000","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["James Hunt","The Block"]}