{"summary":"The US Federal Reserve and the Federal Deposit Insurance Corporation (FDIC) issued a joint cease-and-desist letter to crypto firm Voyager Digital over claims regarding depository insurance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160174\/us-fed-fdic-accuse-voyager-digital-of-false-and-misleading-insurance-claims","publishDate":"2022-07-28T17:57:08","id":1268,"type":null,"title":"US Fed, FDIC accuse Voyager Digital of &#x27;false and misleading&#x27; insurance claims","category":["POLICY"],"content":["The US Federal Reserve and the Federal Deposit Insurance Corporation (FDIC) issued a joint cease-and-desist letter to crypto firm Voyager Digital over past claims regarding depository insurance.","The two said in <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/files\/bcreg20220728a1.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">their letter<\/a>:","\"Voyager has made various representations online, including its website, mobile app, and social media accounts, stating or suggesting that: (1) Voyager itself is FDIC-insured; (2) customers who invested with the Voyager cryptocurrency platform would receive FDIC insurance coverage for all funds provided to, held by, on, or with Voyager; and (3) the FDIC would insure customers against the failure of Voyager itself. These representations are false and misleading and, based on the information we have to date, it appears that the representations likely misled and were relied upon by customers who placed their funds with Voyager and do not have immediate access to their funds.\"","The firm's claims regarding FDIC insurance had come under scrutiny in the past. Its banking partner, Metropolitan Bank, issued a statement contradicting Voyager's past statements regarding such insurance, <a href=\"https:\/\/www.theblock.co\/post\/156065\/despite-voyagers-claims-its-bank-says-fdic-insurance-will-not-protect-customer-usd-deposits-from-firms-bankruptcy\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">as previously reported<\/a>. Voyager declared bankruptcy on July 6.","In its letter, the Fed and FDIC echoed Metropolitan's statement from that time.","\"Voyager maintains a deposit account for the benefit of its customers at Metropolitan Commercial Bank, which is supervised by the Board. Voyager is not itself insured by the FDIC, though, and so customers who invested through its cryptocurrency platform would not receive insurance coverage in the event of Voyager's failure.\"","The letter demanded that Voyager cease the alleged misrepresentations.&nbsp;","An emailed request for comment sent to Voyager's press inbox was not returned by press time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FDIC","content":"ORGANIZATION"},{"type":"US Federal Reserve","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"July 6","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Metropolitan Bank","content":"ORGANIZATION"},{"type":"Board","content":"ORGANIZATION"},{"type":"Metropolitan Commercial Bank","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation (FDIC","content":"ORGANIZATION"},{"type":"Voyager","content":"ORGANIZATION"}],"hashtag":["FDIC"],"authors":["Michael McSweeney","The Block"]}