{"summary":"The move will expand individual investors&#x27; access to private investment vehicles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169554\/kkr-experiments-with-making-pe-funds-available-on-avalanche","publishDate":"2022-09-13T06:41:10","id":12686,"type":null,"title":"KKR experiments with listing private equity investments on Avalanche: WSJ","category":["INSTITUTIONAL INVESTORS"],"content":["Private equity giant KKR is set to make part of one of its funds available on the public blockchain, according to a report in the Wall Street Journal on Tuesday.&nbsp;","The move will expand individual investors' access to private investment vehicles through a partnership with Securitize, which will tokenize part of KKR's second Health Care Strategic Growth Fund. This will live on the Avalanche blockchain and effectively give access to investors through a tokenized feeder fund, <a href=\"https:\/\/www.wsj.com\/articles\/kkr-makes-piece-of-pe-fund-available-on-public-blockchain-11663014955\" data-v-f87c67ca=\"\">the report said<\/a>.","Executives told the WSJ that this is the first time a PE giant such as KKR has used the blockchain in this way.&nbsp;","While this aims to broaden access to the fund, the bar is still high. Qualified purchasers of the tokenized assets will still typically have to hold at least $5 million in investable assets. Interested parties will also have to create a digital wallet and sign up with Securitize. The fund allows individuals to invest smaller amounts than would usually be required of institutions.","After a year of holding the security, it can then be sold to other qualified individuals on the secondary market.","This is not KKR's first dalliance with digital assets. In April <a href=\"https:\/\/www.theblock.co\/post\/143633\/multiple-ivy-league-universities-kkr-back-dragonflys-new-650-million-fund\" data-v-f87c67ca=\"\">The Block reported<\/a> that it was among firms that contributed to a $650 million fund launched by Dragonfly, the crypto investment firm led by Haseeb Qureshi and Tom Schmidt. <a href=\"https:\/\/www.theblock.co\/post\/127579\/crypto-bank-anchorage-series-d-funding-kkr-goldman-sachs-others\" data-v-f87c67ca=\"\">It also backed<\/a> crypto bank Anchorage at the end of last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Haseeb Qureshi","content":"PERSON"},{"type":"Health Care Strategic Growth Fund","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Anchorage","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"KKR","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"$650 million","content":"MONEY"},{"type":"Tom Schmidt","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":["AVALANCHE"],"authors":["Lucy Harley-McKeown","The Block"]}