{"summary":"The DeFi ecosystem is now a myriad of chains created with varying yet potentially overlapping — value propositions, user experiences and sector-specific features.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139689\/multichain-the-next-frontier-in-defi","publishDate":"2022-03-29T08:58:51","id":12683,"type":null,"title":"Multichain: The Next Frontier in DeFi","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The DeFi ecosystem is now a myriad of chains created with varying yet potentially overlapping — value propositions, user experiences and sector-specific features. On the surface, this may appear as a competitive environment. However, with a different mindset that encourages a cooperative multichain user solution, a synergistic DeFi ecosystem could very well transform into a nurturing space for all to thrive and scale.<\/span>","<span data-v-f87c67ca=\"\">With DeFi’s TVL dropping <\/span><a href=\"https:\/\/www.defipulse.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$23B<\/span><\/a><span data-v-f87c67ca=\"\"> since the start of the year, how are we to refuel for the next phase in DeFi adoption as the space matures? <\/span><span data-v-f87c67ca=\"\">A natural outcome is a specialisation of offerings to achieve elevated levels of liquidity and scalability. This represents the foundation for multichain’s role in facilitating and catalysing the next leap forward.<\/span>","<b data-v-f87c67ca=\"\">The Best of All Worlds<\/b>","<span data-v-f87c67ca=\"\">With innovations in interoperable blockchains, investors in the DeFi space can seamlessly exchange assets and value of their financial service protocols across different chains. The blockchain trilema (i.e., decentralisation, security and scalability) can be addressed with a cooperative multichain model that is expected to supercharge capital optimisation and DeFi yield opportunities in crypto.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Multichain offers the best of all worlds, where investors have access to a multitude of DeFi protocols and liquidity, in a secure and flexible manner.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In fact, various chain-stakeholders are stepping up in R&amp;D to explore the transactional flows and requirements of the likes of institutions and apply them to every layer of blockchain: consensus, settlement and security. Ultimately, they are producing hyper-personalised solutions that offer institution-grade security assurance for easier access to DeFi.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Adoption Appeal<\/b>","<span data-v-f87c67ca=\"\">Multichain will open the doors for more players to explore crypto, and this includes those with large capital pools and resources — the institutional players.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“<\/span><a href=\"https:\/\/www.mycactus.com\/en\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Cactus Custody<\/span><\/a><span data-v-f87c67ca=\"\">’s integration with Metamask Institutional is a DeFi Connector that allows our clients to safekeep their private keys in a qualified custodian and access DeFi on any mainstream EVM-compatible chains in a controlled manner. In essence, secure access to thousands of DApp on EVM chains on one platform”, said Cynthia Wu, Head of Sales and Business Development, <\/span><a href=\"https:\/\/www.matrixport.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Matrixport<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Institutions are already ramping up their interactions with protocols across multiple chains like Solana and Polygon — marking the multichain network as an essential element to bring in the next billion users into crypto.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">A Multi-Way Connection&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Bridging solutions hold the key to tapping into the full benefits of a stacked architecture — where Layer 1 players focus on consensus and settlement, with Layer 2 players offering specialisation and scalability for execution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">With this, the market dynamics could potentially evolve as well, seeing a few prominent Layer 1 players offering all-in-one solutions for mainstream needs and many smaller application-specific chains suited for niche appeals.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Growth and Beyond&nbsp;<\/b>","<span data-v-f87c67ca=\"\">With a <\/span><a href=\"https:\/\/www.bloomberg.com\/professional\/blog\/multi-chain-future-likely-as-ethereums-defi-dominance-declines\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">10x growth<\/span><\/a><span data-v-f87c67ca=\"\"> in layer 1 chains and <\/span><a href=\"https:\/\/defillama.com\/protocols\/Bridge\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$21.8 billion<\/span><\/a><span data-v-f87c67ca=\"\"> worth of crypto locked in bridging solutions of late, a multichain future is on the horizon.<\/span>","<span data-v-f87c67ca=\"\">As the multi-way interaction becomes increasingly prevalent, we can expect both small and big players to co-exist and complement each other in the ecosystem, ultimately enriching what DeFi has to offer — an epicentre of finance and innovation.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Metamask Institutional","content":"ORGANIZATION"},{"type":"Matrixport","content":"LOCATION"},{"type":"$21.8 billion","content":"MONEY"},{"type":"Multi-Way Connection","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$23B","content":"MONEY"},{"type":"Cynthia Wu","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Business Development","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}