{"summary":"PancakeSwap has launched on the Linea mainnet — the Consensys-powered Ethereum Layer 2 — as it continues its multichain expansion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247197\/pancakeswap-ethereum-linea-consensys","publishDate":"2023-08-24T09:00:00","id":12688,"type":null,"title":"PancakeSwap expands to Consensys-powered Ethereum Layer 2 Linea","category":["DEFI"],"content":["PancakeSwap, the second-largest decentralized exchange protocol, has launched on the Linea mainnet — the Consensys-powered Ethereum Layer 2 scaling network — as it continues its multichain expansion.","Linea will help users with lower gas fees, faster transactions and improved capital efficiency, PancakeSwap said Thursday.","As an Ethereum Layer 2, Linea processes transactions on its network before summarizing them on the main Ethereum blockchain, which helps speed up transactions and reduce fees. Linea is a zero-knowledge rollup network that launched its mainnet in July.","PancakeSwap will bring its swap and liquidity provisioning features to Linea. Swap in decentralized finance or DeFi refers to exchanging one token for another, while liquidity provisioning involves adding funds to a pool to facilitate trading and earn rewards.","After the swap and liquidity provisioning features, PancakeSwap is expected to bring its farm feature to Linea in the coming months. The farm feature allows users to stake their liquidity provider tokens and earn PancakeSwap's native CAKE token while keeping a position in their LP tokens. PancakeSwap is also expected to deploy its initial farm offering or IFO platform to Linea in the coming months, which gives early access to new tokens.","PancakeSwap first <a href=\"https:\/\/blog.pancakeswap.finance\/articles\/pancake-swap-joins-linea-voyage-s-de-fi-week-as-a-testnet-ecosystem-partner\" data-v-f87c67ca=\"\">collaborated<\/a> with the Linea team in June as a testnet ecosystem partner.","Linea is the seventh blockchain PancakeSwap has expanded to as it focuses on Ethereum scaling networks. Initially built on BNB Chain, PancakeSwap now supports Ethereum, Aptos, Polygon zkEVM, zkSync Era and <a href=\"https:\/\/www.theblock.co\/post\/244153\/pancakeswap-expands-to-ethereum-layer-2-arbitrum-one\" data-v-f87c67ca=\"\">Arbitrum One<\/a>.","PancakeSwap was launched in 2020 and has grown to become the second-largest decentralized exchange protocol, just after Uniswap, according to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>. Uniswap has yet to be made available on Linea. Its supported blockchains include Polygon, Optimism, Arbitrum and Base.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/dex-volume-monthly\/embed\" title=\"DEX Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Linea","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Aptos","content":"LOCATION"},{"type":"Uniswap","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"IFO","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","BASE","DEXS","ETHEREUM","OPTIMISM","POLYGON","SMART CONTRACTS","UNISWAP","ZKEVM","ZKSYNC"],"authors":["Yogita Khatri","The Block"]}