{"summary":"Base Testnet, a new Ethereum L2 developed by Coinbase, has integrated Chainlink to provide secure off-chain price feeds for developers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216978\/base-integrates-chainlink-for-secure-off-chain-price-feeds","publishDate":"2023-03-03T12:48:32","id":12692,"type":null,"title":"Base integrates Chainlink for secure off-chain price feeds","category":["CRYPTO ECOSYSTEMS"],"content":["<a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Base<\/span><\/a><span data-v-f87c67ca=\"\">, a new Ethereum Layer 2 developed by Coinbase, has integrated Chainlink on its testnet in a move to provide secure, off-chain price feeds to decentralized app developers.<\/span>","This development is particularly significant for Base, as it aims to offer developers a secure method of integrating off-chain data sources into their decentralized applications, positioning itself as a competitive Layer 2 solution in the Ethereum ecosystem.","Base has announced its participation in the \"Chainlink Scale\" program. As part of this program, Base will contribute towards covering some of the operational expenses associated with Chainlink services on its network. Additionally, it will help to reduce the gas expenses incurred by Chainlink nodes when submitting oracle reports on the Base network.","<span data-v-f87c67ca=\"\">“We’re super excited to launch Base with collaborators such as Chainlink, and to join the Chainlink SCALE program to empower developers with the critical data and services they need to build their applications,” Jesse Pollak, the Project Lead at Base said in a statement.<\/span>","Chainlink's&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/192357\/chainlink-staking-is-now-live-a-major-step-in-its-new-economics-2-0-plan\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">oracle network<\/a> is designed to enable smart contracts and applications to utilize off-chain data in a secure and decentralized manner. It is the most widely used oracle network in the industry with over 650,000 active users, according to <a href=\"https:\/\/dune.com\/sergiimk\/Oracle-Comparison-(Chainlink-API3-Band-Ocean)\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">data<\/a>&nbsp;from Dune Analytics.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Base","content":"ORGANIZATION"},{"type":"Chainlink","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}