{"summary":"Nigeria’s central bank has reportedly lifted some restrictions on cryptocurrency service providers, allowing firms to open bank accounts in the country.\nAfrica’s most-populous nation, Nigeria has experienced ongoing growth in crypto adoption. ","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269178\/nigeria-lifts-restrictions-on-bank-accounts-for-crypto-firms-businessday","publishDate":"2023-12-23T13:20:11","id":1270,"type":null,"title":"Nigeria lifts restrictions on bank accounts for crypto firms: BusinessDay","category":["International Policymaking"],"content":["The Central Bank of Nigeria (CBN) has lifted its restriction on cryptocurrency firms, known to regulators as Virtual Asset Service Providers (VASPs), from opening bank accounts in the country, according to a <a href=\"https:\/\/businessday.ng\/technology\/cryptocurrency\/article\/cbn-lifts-restrictions-on-crypto-exchanges-issues-guidelines\/\" data-v-f87c67ca=\"\">report<\/a> from Nigerian publication BusinessDay.&nbsp;","The new policy reverses a <a href=\"https:\/\/www.theblock.co\/post\/93975\/nigeria-central-bank-crypto-exchanges-warning\" data-v-f87c67ca=\"\">February 2021 order<\/a> from the Central Bank that had urged banks to immediately close accounts connected to digital asset activity, though it seemingly does not reverse the country's ban on banks transacting in cryptocurrency or holding digital assets themselves.","Furthermore, any VASPs in the country will need to be regulated by Nigeria's SEC before being allowed to operate in the country, and must deposit at least 500 million Naira (about $550,000 USD) in a bank account in order to score a license, which may affect smaller players in the market, according to the report.&nbsp;","Yellow Card, a pan-African exchange, plans on applying for a license \"immediately,\" according to a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-12-23\/yellow-card-seeks-exchange-license-after-nigeria-lifts-crypto-ban\" data-v-f87c67ca=\"\">report<\/a> in Bloomberg. The company's lack of a Nigerian bank account was the main obstacle standing in the way of their application for a license.&nbsp;","Nigeria, Africa's most populous nation, has seen <a href=\"https:\/\/www.reuters.com\/technology\/nigeria-crypto-usage-growing-further-report-says-2023-09-19\/\" data-v-f87c67ca=\"\">growing crypto adoption<\/a> in recent years, especially among its tech-savvy younger population. Crypto traders in the country often trade peer-to-peer as a result of the regulatory restrictions.&nbsp;"],"hashtag":[]}