{"summary":"Charles Randell has argued for the U.K. regulator to be handed more power in its efforts to oversee the promotion of cryptocurrencies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116733\/fca-chair-greater-powers-regulate-crypto-promotions","publishDate":"2021-09-06T10:31:16","id":12704,"type":null,"title":"FCA chair calls for greater powers to regulate crypto promotions","category":["REGULATION"],"content":["Charles Randell, chairman of the Financial Conduct Authority, has argued for the United Kingdom regulator to be handed more power in its efforts to oversee the promotion of cryptocurrencies.","In <a href=\"https:\/\/www.fca.org.uk\/news\/speeches\/risks-token-regulation\" data-v-f87c67ca=\"\">a speech<\/a> on September 6 at the Cambridge International Symposium on Economic Crime, Randell called for changes that would allow the watchdog to take action against misleading crypto advertisements for speculative tokens.","He said it is “absolutely imperative” that such promotions highlight the risks of a given investment, and that they must not given the impression that the token itself is regulated.","“And, since these promotions are nearly all online and often made by unidentifiable promoters in other jurisdictions, it’s imperative that any regulations in this area cover paid-for advertising on online platforms,” Randell added.","He highlighted the efforts of Kim Kardashian, who was recently paid to promote Ethereum Max via Instagram to her 250 million followers.","Randell’s comments come amid <a href=\"https:\/\/assets.publishing.service.gov.uk\/government\/uploads\/system\/uploads\/attachment_data\/file\/902891\/Cryptoasset_promotions_consultation.pdf\" data-v-f87c67ca=\"\">an ongoing consultation<\/a> by H.M. Treasury, the U.K.’s finance ministry, on the case for tighter regulation of certain crypto ads.","Randell also highlighted the “risk of contagion of the regulated business of authorised firms by unregulated activities in digital tokens” — seemingly in reference to mounting efforts by financial services firms to offer crypto trading to customers.","This point is particularly relevant to the fintech sector. Investment apps such as Freetrade, Plum and Trade Republic in Europe have <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103231\/trade-republic-neo-broker-crypto-trading\" data-v-f87c67ca=\"\">recently committed<\/a> to building crypto tools, while the neobank Revolut <a href=\"https:\/\/www.theblockcrypto.com\/post\/104266\/revolut-dogecoin-crypto-trading-tool\" data-v-f87c67ca=\"\">added Dogecoin<\/a> to its array of tokens in June.","“It’s essential that the boards of FCA authorised firms can show how they have addressed the risks that unregulated activities in relation to digital tokens can pose to those firms: to both their conduct, and their prudential soundness,” said Randell.","The FCA currently maintains <a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=CA\" data-v-f87c67ca=\"\">a register<\/a> of crypto-focused companies that meet its anti-money laundering requirements, as well as an interim list of applicants awaiting approval. It <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-bans-sale-crypto-derivatives-retail-consumers\" data-v-f87c67ca=\"\">banned the marketing of crypto derivatives<\/a> to retail investors in October 2020.","But <a href=\"https:\/\/www.theblockcrypto.com\/daily\/109841\/uk-fca-binance-ban-derivatives-spot-trading\" data-v-f87c67ca=\"\">a recent tussle<\/a> with global crypto giant Binance demonstrated the difficulties the watchdog faces in policing the sector via traditional means. Indeed, the FCA conceded in a memo in August that it was “not capable” of supervising Binance.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum Max","content":"PERSON"},{"type":"September 6","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Charles Randell","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"October 2020","content":"DATE"},{"type":"Randell","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"the Cambridge International Symposium on Economic Crime","content":"ORGANIZATION"},{"type":"Kim Kardashian","content":"PERSON"},{"type":"United Kingdom","content":"LOCATION"},{"type":"H.M. Treasury","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["BINANCE","FCA"],"authors":["Ryan Weeks","The Block"]}