{"summary":"Ethereum research group Optimism released today the alpha version of the Optimistic Virtual Machine (OVM), supporting all Ethereum smart contracts to adopt Optimistic Rollup. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55520\/ethereum-scaling-startup-optimism-announces-alpha-release-of-its-virtual-machine","publishDate":"2020-02-11T19:37:27","id":12701,"type":null,"title":"Ethereum scaling startup Optimism announces alpha release of its virtual machine","category":["ETHEREUM"],"content":["<span data-v-f87c67ca=\"\">Ethereum research group Optimism launched today the alpha version of the Optimistic Virtual Machine (OVM), intended to support all smart contracts to be deployed on Optimistic Rollup chains, a layer-2 Ethereum scaling solution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A modification of the Ethereum Virtual Machine, <a href=\"https:\/\/medium.com\/@optimismPBC\/optimistic-virtual-machine-alpha-cdf51f5d49e\" data-v-f87c67ca=\"\">OVM<\/a> is the virtual machine for Optimistic Rollup. The virtual machine allows developers to deploy smart contracts on the layer-2 solution as they appear on Layer1, with the same tooling and smart contract languages like Solidity.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The OVM was built as an L2-compatible virtual machine inside of the EVM. As such, OVM can run a fully virtualized EVM environment inside of the actual EVM and hence give developers a similar experience as interacting with the EVM.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Many layer 2 solutions, including ones that we ourselves have developed in the past, struggled with developer experience issues due to custom, non-standard tooling that presented massive learning curves… Our goal with the OVM is to make the developer experience completely unimpressive, and nearly invisible,” the startup said.<\/span>","<span data-v-f87c67ca=\"\">With <\/span><a href=\"https:\/\/www.theblockresearch.com\/optimistic-rollup-explained-44740\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Optimistic Rollup<\/span><\/a><span data-v-f87c67ca=\"\">, transactions are executed entirely off the Ethereum base chain. Operators receive all submitted transactions, execute them, and publish the latest state to OVM, with the state root subsequently being posted to the base chain. Since the Optimistic Rollup scheme assumes all transactions to be valid, a fraud-proof step may be conducted on the Ethereum Layer1 chain to challenge certain transactions that may be invalid.<\/span>","<span data-v-f87c67ca=\"\">Formally known as the Plasma Group, Optimism closed the non-profit organization in January after<\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/53017\/plasma-group-researchers-raise-3-5m-from-paradigm-and-ideo-to-start-new-company\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">raising a $3.5 million seed round<\/span><\/a><span data-v-f87c67ca=\"\"> from Paradigm and IDEO CoLab Ventures. It then relaunched as a for-profit startup to focus on developing Optimistic Rollup.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At the time, Optimism CEO Jinglan Wang told The Block that the new company will focus on helping developers implement the rollup solution. The alpha release of OVM is the first step towards that direction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The OVM is arguably the most difficult part of building a fully EVM compatible, generalized smart contract scaling solution. However, there’s still an enormous amount of work to be done,” the blog post stated.<\/span>","<span data-v-f87c67ca=\"\">Starting today, developers can begin deploying smart contracts using OVM and report bugs. However, since the alpha version is only a sandboxed environment for developers to test their contract deployment and migration, Optimism will not enable deposits and withdrawal via OVM until later.&nbsp; <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Plasma Group","content":"ORGANIZATION"},{"type":"IDEO CoLab Ventures","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Jinglan Wang","content":"PERSON"},{"type":"$3.5 million","content":"MONEY"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"OVM","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":[],"authors":["Celia Wan","The Block"]}