{"summary":"Synthetix founder Kain Warwick said that the XRP ruling was an unexpected win but that it’s not over yet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240229\/xrp-ruling-sec-synthetix-founder","publishDate":"2023-07-18T06:35:52","id":12700,"type":null,"title":"XRP ruling one of crypto’s first major wins over the SEC: Synthetix founder","category":["CRYPTO ECOSYSTEMS"],"content":["Synthetix founder Kain Warwick described the recent XRP ruling as one of crypto’s first major wins over the SEC.&nbsp;","“It was unexpected, I would say,” Warwick said, in an interview at ETHCC in Paris. “My view was that I thought there were a number of aspects of the case that we — the DeFi crypto community — were right about that maybe weren't going to win. To actually have almost all of those validated, and then some that we weren't even expecting to get wins on, it's pretty amazing right?”&nbsp;","The <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\">ruling<\/a> came in the lawsuit between the Securities and Exchange Commission and Ripple Labs. The judge ruled sales of XRP to institutional investors counted as unlawful securities sales but programmatic sales on exchanges didn’t.&nbsp;","“The implications of that are going to take a while to play out. And obviously, there's a chance of appeals and I don't think everyone should get too excited about this. There's an ongoing legal dispute and the SEC may appeal. And things could shift over time,” said Warwick.","“But certainly it's probably one of the first major wins that crypto’s had over the SEC in a while,” Warwick added.","Synthetix operates as a decentralized derivatives trading protocol with total deposits exceeding <a href=\"https:\/\/defillama.com\/protocol\/synthetix\" data-v-f87c67ca=\"\">$487 million<\/a> on Ethereum and the Optimism Layer 2 network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Warwick","content":"PERSON"},{"type":"Kain Warwick","content":"PERSON"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$487 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["XRP"],"authors":["Tim Copeland","The Block"]}