{"summary":"The project is designed to enable fund managers to tokenize, purchase and rebalance real-world asset positions across multiple blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263109\/jpmorgan-apollo-axelar-oasis-pro-provenance-blockchain-interoperability","publishDate":"2023-11-15T06:11:59","id":12713,"type":null,"title":"JPMorgan, Apollo team up with Axelar, Oasis Pro on blockchain interoperability","category":["COMPANIES"],"content":["JPMorgan’s Onyx Digital Assets team collaborated with asset and wealth managers WisdomTree and Apollo, blockchain technology providers Avalanche, Oasis Pro, Provenance Blockchain and Biconomy, plus interoperability solutions LayerZero Labs and Axelar on a blockchain interoperability proof-of-concept for investment-portfolio management.","The collaboration comes under the Monetary Authority of Singapore’s <a href=\"https:\/\/www.theblock.co\/post\/236361\/singapores-mas-sets-out-framework-for-responsible-digital-asset-ecosystem\" data-v-f87c67ca=\"\">Project Guardian<\/a> initiative — arguing for open and interoperable private networks that offer tokenized asset exchange utilizing decentralized finance protocols.","The JPMorgan-led project aims to demonstrate how blockchain technology can manage large-scale client portfolios, execute trades and enable automated portfolio management of tokenized financial assets, including alternatives such as private equity, private credit, real estate and infrastructure alongside liquid assets in discretionary portfolios, according to a statement.","The testnet system is designed to enable fund managers to tokenize, purchase and rebalance real-world asset positions across multiple blockchains, standardizing the processes for settling transactions on interoperable networks.","“Our goal is to create solutions that bring significant efficiencies and enable better outcomes for asset and wealth managers and investors through personalized, highly scalable portfolios, regardless of asset class or where those assets are managed and recorded,” head of Onyx Digital Assets Tyrone Lobban said. “The interoperability achieved through Project Guardian is a step forward in showing how tokenized traditional and alternative investments can be automatically managed across multiple systems.”","The Onyx Digital Assets team utilized the Axelar network to achieve interoperability with a private and permissioned Provenance Blockchain Zone — an appchain fully interoperable with the Provenance Blockchain mainnet.","“For Axelar network, interoperability doesn’t stop at the borders of any blockchain,” Axelar Inc. CEO Sergey Gorbunov said. “Public blockchains provide fast finality and transparency, and these attributes can be difference-makers in hybrid systems that integrate real-world assets as well as private blockchains and off-chain systems.”","“JPMorgan and Apollo’s use case is exactly why we designed interoperable private and permissioned Provenance Blockchain Zones,” Provenance Blockchain CEO Anthony Moro added. “With the support of Axelar and Oasis Pro, JPMorgan and Apollo demonstrated how portfolios could be rebalanced and trades executed between Onyx Digital Assets and Provenance Blockchain. This is believed to be a first-of-its-kind blockchain interoperability solution for institutional financial services.”","LayerZero also connected to Onyx with a permissioned Avalanche Evergreen Subnet, facilitating subscriptions and redemptions for WisdomTree funds. Avalanche Evergreen Subnets are individual blockchains customized for institutional applications, with features including EVM compatibility, smart contract deployment, network privacy and custom gas features.","“This initiative under Project Guardian fundamentally aligns with Ava Labs’ mission to provide the tools and tech to digitize and tokenize the world’s assets while harnessing the speed, scalability and customizability of Avalanche,” Ava Labs President John Wu said.","Oasis Pro — not to be confused with the privacy-focused blockchain Oasis Network — enabled the tokenization of assets, such as Apollo funds, on the platform. “Successfully delivering the solutions for portfolio rebalancing is a critical step in the evolution of traditional asset-management functions,” Oasis Pro CEO Pat LaVecchia said. “This next generation of technology will increase speed and efficiency across legacy systems.”","Concepts such as Biconomy’s Paymaster service also abstracted away the complexities of interacting with blockchains, including the need to pay for blockchain transaction fees.","The proof-of-concept is the latest foray into blockchain-based financial services for JPMorgan after rolling out <a href=\"https:\/\/www.theblock.co\/post\/262595\/jpmorgan-jpm-coin-programmable-payments\" data-v-f87c67ca=\"\">automatic payments<\/a> via its permissioned JPM Coin platform last week — a system that now handles <a href=\"https:\/\/www.theblock.co\/post\/259580\/jpmorgan-jpm-coin-billion-daily-transactions\" data-v-f87c67ca=\"\">$1 billion<\/a> in daily transactions.","In October, <a href=\"https:\/\/www.theblock.co\/post\/255829\/jpmorgan-blockchain-collateral-settlement-blackrock-barclays\" data-v-f87c67ca=\"\">JPMorgan's Tokenized Collateral Network<\/a>, a blockchain-based collateral settlement application, went live, enabling clients to utilize tokenized assets as collateral and completing its first transaction involving BlackRock and Barclays.","<em data-v-f87c67ca=\"\">Updated throughout to reflect involvement from WisdomTree, Avalanche, LayerZero and Biconomy.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tokenized Collateral Network","content":"ORGANIZATION"},{"type":"Provenance Blockchain mainnet","content":"ORGANIZATION"},{"type":"John Wu","content":"PERSON"},{"type":"Tyrone Lobban","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Barclays","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Pat LaVecchia","content":"PERSON"},{"type":"Onyx Digital Assets","content":"ORGANIZATION"},{"type":"Onyx Digital","content":"ORGANIZATION"},{"type":"Onyx Digital Assets and Provenance Blockchain","content":"ORGANIZATION"},{"type":"Onyx","content":"ORGANIZATION"},{"type":"Anthony Moro","content":"PERSON"},{"type":"Sergey Gorbunov","content":"PERSON"},{"type":"permissioned Provenance Blockchain Zones","content":"ORGANIZATION"},{"type":"” Axelar Inc","content":"ORGANIZATION"},{"type":"Provenance Blockchain","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Monetary Authority of Singapore’s <a href=\"https:\/\/www.theblock.co\/post\/236361\/singapores-mas-sets-out-framework-for-responsible-digital-asset-ecosystem\" data-v-f87c67ca=\"\">Project Guardian","content":"ORGANIZATION"}],"hashtag":["AVALANCHE","INTEROPERABILITY","TRADFI BANKS"],"authors":["James Hunt","The Block"]}