{"summary":"Crypto venture fundraising rose 1% in 2022, but deals involving companies focused primarily on Bitcoin skyrocketed 52.9%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228477\/bitcoin-native-deals","publishDate":"2023-04-27T09:00:50","id":12712,"type":null,"title":"Bitcoin-native deals are outperforming the overall crypto sector","category":["COMPANIES"],"content":["Bitcoin-native startups are outperforming the overall crypto sector in terms of venture capital deals, according to a <a href=\"https:\/\/tvp.fund\/whitepapers\/bitcoin-venture-capital-research\/\" data-v-f87c67ca=\"\">report<\/a> released Thursday by <a href=\"https:\/\/tvp.fund\/\" data-v-f87c67ca=\"\">Trammell Venture Partners<\/a>.","While the number of crypto venture fundraising deals rose 1% in 2022 from the previous year, deals involving companies focused primarily on Bitcoin skyrocketed 52.9%.","Total capital raised by firms founded \"with the first principle that bitcoin is the global monetary asset of the future\" also increased, rising 13.9% in 2022 to $343 million.","Despite the growth, TVP believes there's still a \"severe misallocation\" of capital, with companies focused on Bitcoin accounting for just 2% of total crypto deals last year and only 1.3% of venture dollars invested.","Bitcoin accounts for about 42% of the total crypto market capitalization, and the firm, which launched the first dedicated Bitcoin-native ecosystem-focused fund in 2021, sees advances such as the <a href=\"https:\/\/www.theblock.co\/post\/225538\/bitcoins-lightning-network-paypal\" data-v-f87c67ca=\"\">Lightning Network<\/a> making the segment ripe for fresh activity.&nbsp;","\"Bitcoin has already won the base monetary reserve layer for the Internet, full stop. It's just not broadly recognized as such,\" TVP managing director and founding partner Christopher Calicott said in an interview, adding that excitement in the sector is often directed toward projects and protocols that move faster.&nbsp;","While the Bitcoin network advances slowly by design, Calicott sees potential for growth in a number of areas, including stablecoins.","\"There's actually multiple paths to achieving that on Lightning,\" he said, referring to the Layer 2 network designed to sit on top of Bitcoin and allow faster transactions and smart contracts. \"We know the validated market. We're looking for the absolute best founders that are going to build it so we can back them in a spear-fishing kind of approach.\"","Speaking to other benefits of developing on Bitcoin, Calicott pointed to what he argued were growing perceptions of risk on rival blockchains including Solana and the post-Merge Ethereum.","\"That kind of rapid change and risk, of all the risks that an entrepreneur considers when starting a company, the last one they're going to take, given the option, is platform risk,\" he said. \"People are sleeping on Bitcoin and Lightening. It's a really vibrant time. You go to some of these technical meetups, and people that might in any other context be competitors are brainstorming, spitballing ideas together, and there's just like, a renewed excitement.\"","Based in Austin, Texas, TVP has deployed about 65% of its dedicated Bitcoin-native ecosystem-focused fund.","\"We're being very methodical,\" he said. \"There's not a moment where we can't write a check into the right company.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"13.9%","content":"PERCENT"},{"type":"Trammell Venture Partners","content":"ORGANIZATION"},{"type":"$343 million","content":"MONEY"},{"type":"TVP","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"65%","content":"PERCENT"},{"type":"42%","content":"PERCENT"},{"type":"Christopher Calicott","content":"PERSON"},{"type":"1.3%","content":"PERCENT"},{"type":"Texas","content":"LOCATION"},{"type":"52.9%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"Calicott","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}