{"summary":"The Bitcoin Miladys project released a bridge for Ethereum NFTs to be transferred to the Bitcoin blockchain. ","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232550\/you-can-now-bridge-ethereum-nfts-to-bitcoin-but-you-cant-get-them-back","publishDate":"2023-05-30T12:30:20","id":1271,"type":null,"title":"You can now bridge Ethereum NFTs to Bitcoin — but you can&#x27;t get them back","category":["Crypto Ecosystems"],"content":["The Bitcoin Miladys project <a href=\"https:\/\/twitter.com\/BitcoinMiladys\/status\/1663266300372701185\" data-v-f87c67ca=\"\">released<\/a> a bridge for Ethereum NFTs to be transferred to the Bitcoin blockchain.&nbsp;","This is part of the explosion of NFTs on Bitcoin, under the Ordinals umbrella — something that has led to <a href=\"https:\/\/www.theblock.co\/post\/232503\/bitcoin-transaction-fee-revenue-soared-this-month-thanks-to-ordinals\" data-v-f87c67ca=\"\">surging rewards<\/a> for Bitcoin miners.","Currently, most Ordinals are being created natively on the Bitcoin blockchain, including tokens representing common Ethereum collections (like Bitcoin Miladys) and entirely new projects. But the new bridge will allow pre-existing collections to be effectively transferred to Bitcoin, potentially leading to closer collaboration between the ecosystems on both blockchains.","There’s just one catch.","“Yes, it's a one way bridge,” the Bitcoin Miladys project told The Block via Twitter direct message. They explained that the original Ethereum NFT gets burned — made inaccessible and effectively destroyed — and a new token is created on Bitcoin that represents and is linked to it.","This is similar to projects that have burned real-life objects, including expensive artworks, and “turned” them into NFTs. There is still debate over the connection between the two.","Bitcoin Miladys said a target location is written in the transaction when the NFT is burned. Plus, in the newly created Bitcoin NFT, a signature links back to the original painting. This creates a link between the original NFT and the new version, one which is arguably stronger than when a physical object is destroyed.","Since the Bitcoin NFT now links back to the Ethereum NFT, you can do a lot more stuff with your NFT like dynamic metadata or just rich metadata overall that was not possible on Bitcoin before,” said Bitcoin Miladys.&nbsp;","This is the idea that the increased amount of metadata contained within the original Ethereum NFT would still be relevant to the Bitcoin NFT —&nbsp;and expand its effective metadata.","Bitcoin Miladys considered how a permissionless two-way bridge would work, one that would allow such NFTs to return to Ethereum. They said this would require the NFTs to be placed in escrow, and then it would be released once the blockchain detects the transfer back.&nbsp;","But they asked how you would deliver them back to the right address, considering that the NFT could have been bought on Bitcoin, meaning it shouldn’t go back to the person who originally transferred it over.","In the meantime, it’s now up to NFT owners to choose whether they want to burn their thousand-dollar NFT in the hope that it’ll retain its value on another chain."],"hashtag":[]}