{"summary":"MakerDAO increased its DAI savings rate from 3% to 8%, making it one of the highest rates offered by a major stablecoin issuer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243475\/makerdao-spark-dai-vpn","publishDate":"2023-08-07T02:40:31","id":12724,"type":null,"title":"MakerDAO&#x27;s Spark offers 8% yield on Dai, blocks VPN use on front end","category":["DEFI"],"content":["MakerDAO increased the yield on DAI, the third-largest stablecoin, from 3% to 8%, — positioning it as one of the highest rates currently provided by a major stablecoin issuer.&nbsp;","In line with the recent yield changes, on-chain data revealed a significant transaction from an individual wallet. A single crypto participant <a href=\"https:\/\/debank.com\/profile\/0x6555e1cc97d3cba6eaddebbcd7ca51d75771e0b8\" data-v-f87c67ca=\"\">transferred<\/a> 14.32 million DAI into MakerDAO, likely to benefit from the 8% yield. This savings yield is <a href=\"https:\/\/app.sparkprotocol.io\/sdai\/\" data-v-f87c67ca=\"\">offered<\/a> through MakerDAO’s lending platform, Spark.","The change coincides with Spark’s decision to restrict users from accessing the platform’s front end via virtual private networks. This move, unusual in the DeFi sector, is primarily designed to strictly geo-block users from specific geographies, including the United States.","Users attempting to access Spark with a VPN are warned: “Accessing this website via VPN is not allowed.” Spark’s terms of service <a href=\"https:\/\/www.sparkprotocol.io\/terms-of-use.html\" data-v-f87c67ca=\"\">detail<\/a> the platform’s stance on VPN usage, underscoring a resolute opposition to VPNs for evading geographical restrictions — a measure that appears to specifically target U.S.-based users.","<span data-v-f87c67ca=\"\">The Block independently verified that Spark is blocking VPN usage.<\/span>","As a software fork of Aave’s Version 3 lending protocol, Spark integrates direct lending capabilities within the MakerDAO ecosystem. Spark sources DAI liquidity directly from Maker and provides DAI loans, accepting assets such as ether, staked ether and DAI as collateral.","Spark operates independently of the MakerDAO protocol.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"8%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"VPN","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"}],"hashtag":["DAI","LENDING"],"authors":["Vishal Chawla","The Block"]}