{"summary":"News broke this week the Ontario Securities Commission is undertaking an enforcement action against Poloniex, a U.S.-headquartered crypto exchange that operates in Canada.\nThe OSC’s move signals that regulators in Canada are executing a shift in policy towards crypto exchanges that views the custody of customer funds as a potential investment contract i.e. a security. \nWhile the new policy has been a long time coming, the action against Poloniex signals a more aggressive stance.","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106206\/with-poloniex-action-canadas-securities-regulators-get-serious-about-crypto-exchange-oversight","publishDate":"2021-06-01T09:41:32","id":1273,"type":null,"title":"With Poloniex action, Canada&#x27;s securities regulators get serious about crypto exchange oversight","category":["Exchanges"],"content":["The Ontario Securities Commission (OSC) appears to be kicking off a new era of compliance for crypto exchanges operating in Canada, based on the specifics of OSC's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/106012\/ontario-regulator-accuses-poloniex-of-disregarding-securities-laws-in-enforcement-against-crypto-exchange\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">enforcement action against Poloniex<\/a>.&nbsp;","Since the <a href=\"https:\/\/www.securities-administrators.ca\/aboutcsa.aspx?id=1862\" data-v-f87c67ca=\"\">beginning of 2020<\/a>, the Canadian Securities Administrators (CSA) had been signaling to exchanges that things were going to change. The CSA encompasses Canada's various provincial and territorial securities authorities, the largest of which is the OSC, which regulates the Toronto Stock Exchange.&nbsp;","Like the U.S., Canadian authorities are comfortable treating decentralized crypto assets like bitcoin or ether as commodities rather than securities.","The Poloniex enforcement action documents indicate, however, that exchanges holding custody of their customers' crypto assets would fall under the purview of securities regulations.","Here's the relevant text:","Grant Vingoe, the chairman and CEO of the OSC, spoke about this state of affairs during a virtual event earlier this month.&nbsp;","\"What the investor ends up having is a ledger entry. They're subject to the creditworthiness of the platform and its willingness to deliver,\" Vingoe <a href=\"https:\/\/youtu.be\/mjwkgnlykjg?t=2067\" data-v-f87c67ca=\"\">said<\/a>.&nbsp;","He went on to say:","Indeed, it was in keeping with this policy that the OSC <a href=\"https:\/\/www.osc.ca\/en\/news-events\/news\/osc-working-ensure-crypto-asset-trading-platforms-comply-securities-law\" data-v-f87c67ca=\"\">notified<\/a> crypto exchanges in March that they had until April 19 to contact the regulator as to how to get their operations in line with these regulatory expectations. At the heart of the Poloniex action is its alleged failure to contact the OSC.&nbsp;","The significance of the Poloniex action is that it signals the OSC isn't taking an idle approach. A representative for the OSC told The Block that 70 exchanges had reached out to begin compliance talks. However, \"to date, there is only one crypto asset dealer registered with Canadian securities regulators (WealthSimple).\"","Though it's unlikely that the OSC will need to begin proceedings against all of these exchanges, one possible outcome is that some market participants will exit the market entirely.","\"With respect to Ontario, it says that Poloniex did not respond to its correspondence to engage in the regulatory process and ergo, it is forced by a Canadian government agency now, to exit the country,\" lawyer Christine Duhaime told The Block in an email.","Duhaime went on to say:","Poloniex could not be reached for comment by the time of publication."],"hashtag":["SEC"]}