{"summary":"MakerDAO is set to execute what the protocol has called its most important deployments of 2022 which includes compensation for delegates.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194316\/makerdao-to-execute-bundled-governance-actions-including-pay-for-delegates","publishDate":"2022-12-12T18:43:06","id":12731,"type":null,"title":"MakerDAO to execute bundled governance actions, including pay for delegates","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO, the decentralized autonomous organization behind the Maker DeFi project, is set to execute eight governance proposals that have been voted on by the community in what the protocol has called its “most important deployments of 2022.”","The DAO’s delegates <a href=\"https:\/\/vote.makerdao.com\/executive\/template-executive-vote-recognized-delegate-compensation-gno-onboarding-blocktower-credit-rwa-vaults-onboarding-renbtc-offboarding-mkr-vesting-momc-parameter-changes-dai-savings-rate-adjustment-starknet-bridge-parameter-changes-december-09-2022#proposal-detail\" data-v-f87c67ca=\"\">voted<\/a> on the proposals on Dec. 11. The bundle includes a compensation package for recognized delegates, the onboarding of Gnosis DAO (GNO) token as collateral for DAI and raising the DAI savings rate from 0.01% to 1%. <a href=\"https:\/\/www.theblock.co\/post\/189921\/makerdao-delegates-approve-gnosisdao-token-as-dai-collateral\" data-v-f87c67ca=\"\">The Block previously reported<\/a> that the DAO was looking to adopt <a href=\"https:\/\/www.theblock.co\/post\/171316\/makerdao-governance-votes-yes-to-adding-gnosisdao-token-as-collateral-for-dai\" data-v-f87c67ca=\"\">GNO as collateral<\/a> for minting its stablecoin DAI.","Maker delegates are part of the MakerDAO ecosystem and have been given voting power by other community members to vote on their behalf. Every Maker (MKR) token holder can participate in&nbsp;&nbsp;governance of the DAO. Some token holders do not wish to do so and delegate their voting power.","A total of 20 maker delegates will receive a total of 103,230 DAI ($103,230) following the execution of the proposal bundle. The compensation is a reward for the recognized delegates for voting regularly on governance issues.","Other governance actions contained in the bundle include the onboarding of multiple BlockTower credit vaults and the removal of the renBTC vault. The latter action removes renBTC as collateral for minting DAI. MakerDAO is also set to make a few changes to its open market committee and Starknet bridge parameters.","MakerDAO’s decision to <a href=\"https:\/\/www.theblock.co\/post\/189884\/makerdao-passes-vote-to-close-alameda-linked-renbtc-as-stablecoin-collateral\" data-v-f87c67ca=\"\">offboard the renBTC vault<\/a> comes as Ren, a DeFi protocol used for <a href=\"https:\/\/www.theblock.co\/linked\/66533\/rens-new-network-bridges-ethereum-with-bitcoin-bitcoin-cash-and-zcash\" data-v-f87c67ca=\"\">wrapping and bridging crypto assets<\/a>, is winding down its version 1.0. Wrapping is a process where native Layer 1 tokens like bitcoin are tokenized so they can be used on a network like Ethereum. Bridging, meanwhile, is the process of transferring crypto tokens from one network to another.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRen’s future was&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/188584\/funding-for-defi-protocol-ren-in-limbo-after-alameda-collapse\" data-v-f87c67ca=\"\">thrown into disarray<\/a> amid the collapse of FTX and sister trading firm Alameda Research, which had acquired it last year and held the project's treasure. Funding expected to run out at the end of the year, and the project recently stated that it was sunsetting its version 1.0 in favor of a community-owned upgrade. Users have since been <a href=\"https:\/\/www.theblock.co\/post\/193274\/alameda-backed-ren-warns-users-of-losses-as-it-plans-to-wind-down-protocol\" data-v-f87c67ca=\"\">warned to unwrap their wrapped assets<\/a> to avoid suffering losses.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 11","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"0.01%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Ren","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$103,230","content":"MONEY"}],"hashtag":["DAI","DAOS","GOVERNANCE VOTES","STARKNET"],"authors":["Osato Avan-Nomayo","The Block"]}