{"summary":"Unstoppable Domains released the domain ending .polygon in partnership with Polygon Labs, making it easier to send crypto and interact with apps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219619\/unstoppable-domains-releases-web3-domain-names-for-polygon-blockchain","publishDate":"2023-03-14T09:00:44","id":12734,"type":null,"title":"Unstoppable Domains releases web3 domain names for Polygon blockchain","category":["CRYPTO ECOSYSTEMS"],"content":["Unstoppable Domains released the domain ending .polygon in partnership with Polygon Labs. This will make it easier for anyone to send money over the Polygon blockchain through applications that support this service.","Crypto domain names are used to replace the long alphanumeric strings that are used to identify wallets publicly. The idea is that they're easy to type and remember. While such domain services need to be integrated by crypto wallets and applications, Unstoppable Domains says it will be possible to use .polygon domains across 750 applications, games and metaverses.","\"Web3 domains will give our community a digital identity that they fully own, so they can log into dapps without giving away their personal information and transact crypto without lengthy wallet addresses,” said Sanket Shah, vice president and head of growth at Polygon Labs, in a press release.","Those wanting to use the service must buy the domains from Unstoppable Domains, with the sale starting March 16. After the sale, the company will put premium domains, like gamer.polygon, up for sale.","<em data-v-f87c67ca=\"\">Updated Sanket Shah's positions a Polygon Labs.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sanket Shah","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"March 16","content":"DATE"}],"hashtag":["POLYGON"],"authors":["Tim Copeland","The Block"]}