{"summary":"The Bank for International Settlements Innovation Hub is starting a tokenization project and continuing its CBDC privacy of payments study.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274009\/bis-confirms-tokenization-project-as-part-of-six-projects-for-2024","publishDate":"2024-01-23T10:01:30","id":12744,"type":null,"title":"BIS confirms tokenization project as part of six projects for 2024","category":["POLICY"],"content":["The Bank for International Settlements (BIS) Innovation Hub intends to launch a blockchain-based <a href=\"https:\/\/www.theblock.co\/post\/270304\/moodys-rates-first-fund-to-use-standard-chartered-units-tokenization-platform\" data-v-f87c67ca=\"\">tokenization<\/a> project and further develop its central bank digital currency (CBDC) privacy testing program.","On Tuesday, the BIS <a href=\"https:\/\/www.bis.org\/about\/bisih\/about.htm\" data-v-f87c67ca=\"\">announced<\/a> six new projects as part of its 2024 Innovation Hub work program. These included projects involving cyber security, fighting financial crime, central bank digital currencies (CBDCs) and green finance.","One of the BIS's new initiatives is called <a href=\"https:\/\/www.bis.org\/about\/bisih\/topics\/fmis\/promissa.htm\" data-v-f87c67ca=\"\">Project Promissa<\/a>, which represents a collaboration involving the BIS, the Swiss National Bank, and the World Bank. Its objective is to develop a proof-of-concept for a platform designed to facilitate digital tokenized promissory notes.","\"The project will use distributed ledger technology to simplify their management and transparency,\" the BIS announcement said. \"Tokenization is an important area where we have already launched one project and are planning more initiatives,\" BIS Innovation Hub Head Cecilia Skingsley added.","A promissory note is a financial instrument that outlines the commitment of one party to repay a specific amount of money to another at a predetermined time, representing a form of debt. According to the BIS, most promissory notes, which play a prominent role in the financial system, are still paper-based, and the institution plans to conclude the proof-of-concept by early 2025.","Another announcement from the BIS Innovation Hub is that its Hong Kong Centre is set to continue with Project Aurum, which is studying the privacy of payments in retail <a href=\"https:\/\/www.theblock.co\/post\/253206\/bis-wants-countries-to-set-up-legal-frameworks-to-support-cbdcs\" data-v-f87c67ca=\"\">CBDCs<\/a>. \"The goal is to leverage expertise from academia and privacy regulators to advance central banks' understanding of privacy in the design of CBDC systems,\" the BIS Innovation Hub said.","Project Aurum is conducted jointly between the BIS and the <a href=\"https:\/\/www.theblock.co\/post\/271458\/hong-kong-asset-managers-spot-crypto-etf-hashkey\" data-v-f87c67ca=\"\">Hong Kong Monetary Authority<\/a> (HKMA). According to the BIS, \"Aurum is a full-stack CBDC system comprising a wholesale interbank system and a retail e-wallet system.\"","The aim of the project is to research and develop two different types of tokens — an intermediated CBDC and a <a href=\"https:\/\/www.theblock.co\/learn\/251859\/the-different-types-of-stablecoins-explained\" data-v-f87c67ca=\"\">stablecoin<\/a> backed by CBDCs — that operate within the interbank system.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Cecilia Skingsley","content":"PERSON"},{"type":"Aurum","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Swiss National Bank","content":"ORGANIZATION"},{"type":"the World Bank","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Hong Kong Monetary Authority<\/a> (HKMA","content":"ORGANIZATION"},{"type":"Bank for International Settlements (BIS","content":"ORGANIZATION"},{"type":"Hong Kong Centre","content":"LOCATION"},{"type":"Project Aurum","content":"ORGANIZATION"}],"hashtag":["CBDCS"],"authors":["Brian McGleenon","The Block"]}