{"summary":"Crossmint, an enterprise blockchain platform, has acquired Winter, a Y Combinator-backed NFT payments infrastructure startup.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279995\/enterprise-blockchain-platform-crossmint-acquires-y-combinator-backed-winter","publishDate":"2024-02-29T15:00:03","id":12741,"type":null,"title":"Enterprise blockchain platform Crossmint acquires Y Combinator-backed NFT payments infra startup Winter","category":["DEALS"],"content":["Crossmint, an enterprise blockchain platform that enables companies to integrate digital assets into their business, has acquired Winter, a Y Combinator-backed NFT payments infrastructure startup.","Crossmint did not disclose the size of the deal, but co-founder Rodri Fernandez told The Block that it was financed with cash. Crossmint began talks with Winter earlier this month and closed the deal last week, Fernandez said.","As part of the acquisition, Crossmint has also launched a new cross-chain payments product.","Founded in February 2022, Crossmint says it has served over 30,000 companies to date, including major Fortune 500 brands such as Mastercard, Etihad Airways, Johnny Walker, and AC Milan. Last December, for instance, Crossmint helped AC Milan tokenize its stadium, enabling the football club's fans to acquire a plot of land at the stadium.","Crossmint's product suite includes embedded wallets, tokenization, payments, token-gating, and identity tools. Currently, 55 people work for Crossmint, Fernandez said.","Winter, on the other hand, was a smaller startup with six employees, and none of them will be joining Crossmint, including Winter founder and CEO Michael Luo, Fernandez said.","Winter was founded in 2021 and offered an NFT payment <a href=\"https:\/\/www.theblock.co\/post\/268972\/crypto-vc-funding-2023-recap\" data-v-f87c67ca=\"\">infrastructure<\/a> that allowed users to purchase NFTs with fiat or cross-chain payments. Winter claims to have served hundreds of companies, including Fox Corporation, the National Football League, and Mythical Games.","Fernandez declined to comment on whether Crossmint and Winter are profitable and how much <a href=\"https:\/\/www.theblock.co\/post\/262389\/lightspeed-faction-crypto-venture-fund\" data-v-f87c67ca=\"\">funding<\/a> each startup has raised to date.","Crossmint has today launched a new cross-chain payments product. It allows users to purchase NFTs from any chain, paying with any cryptocurrency, in one single transaction.","\"Traditionally, users wanting to purchase NFTs on a different chain would have to bridge their cryptocurrency. This is expensive and can take over 15 minutes,\" said Fernandez. \"With Crossmint’s checkout, users can buy an NFT on a different chain in one single transaction, in seconds, at a fraction of the cost.\"","While the feature had been in the works, the Winter acquisition helped expand the new product's capabilities.&nbsp;","\"The product we are launching today is independent, but we are leveraging some of Winter's code for it,\" Fernandez added. \"It allows us to add more chains and some functionality we didn't have.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"AC Milan","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"National Football League","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Winter earlier this month","content":"DATE"},{"type":"Crossmint","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fernandez","content":"PERSON"},{"type":"February 2022","content":"DATE"},{"type":"Michael Luo","content":"PERSON"},{"type":"Winter","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"Johnny Walker","content":"PERSON"},{"type":"Etihad Airways","content":"ORGANIZATION"},{"type":"AC Milan tokenize","content":"ORGANIZATION"},{"type":"Fox Corporation","content":"ORGANIZATION"},{"type":"Rodri Fernandez","content":"PERSON"}],"hashtag":["CRYPTO","PRIVATE COMPANY M&AMP;A","TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}