{"summary":"Bitcoin mining difficulty has increased by 9.26%, the largest increase since January and the third jump in a row.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166757\/bitcoin-mining-difficulty-jumps-9-26-in-the-largest-increase-since-january","publishDate":"2022-08-31T09:46:15","id":12743,"type":null,"title":"Bitcoin mining difficulty jumps 9.26% in the largest increase since January","category":["MINING"],"content":["Bitcoin mining difficulty has increased by 9.26%, the biggest adjustment since January and the third positive one in a row.","The change is reflected in data&nbsp;<a href=\"https:\/\/btc.com\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">published Thursday by BTC.com<\/a>, which tracks network mining difficulty and posts an update as adjustments take place roughly every two weeks.","The network's hash rate has also gone up by over 12% since August 18, the date of the last update, according to data compiled by The Block Research.","Mining difficulty had fallen significantly earlier in the summer, as bitcoin miners, particularly in Texas, <a href=\"https:\/\/www.theblock.co\/post\/156974\/as-texas-grid-operator-calls-for-energy-conservation-some-bitcoin-miners-paused-operations\" data-v-f87c67ca=\"\">turned off their machines<\/a> in response to peak power demand due to the extreme heat.","The growth in hash rate is due to \"a combination of heat waves finally subsiding (on a global level) and facilities slowly coming online,\" said Kevin Zhang, senior vice president of mining strategy at Foundry, which runs the Foundry USA mining pool. \"There's also the added kicker of the higher efficiency Bitmain S19 XP's finally hitting the market as well!\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoins-hash-rate-daily\/embed\" title=\"Bitcoin's Hash Rate (EH\/s, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Mining difficulty refers to the complexity of the mathematical process behind mining, during which miners are repeatedly trying to find a hash below a set level. Miners that \"discover\" this hash win the reward for the next transaction block. The difficulty&nbsp;adjusts every 2,016 blocks (roughly every two weeks) in sync with the network's hash rate.","<em data-v-f87c67ca=\"\">This piece has been updated with statements from Kevin Zhang<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kevin Zhang","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"9.26%","content":"PERCENT"},{"type":"12%","content":"PERCENT"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"August 18","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"Foundry","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}