{"summary":"The Tornado Cash DAO has voted to add its governance to the multisig set of its treasury wallet over arrests and de-platforming fears.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163274\/tornado-cash-dao-votes-to-take-partial-control-over-treasury-funds","publishDate":"2022-08-12T10:19:19","id":12740,"type":null,"title":"Tornado Cash DAO votes to take partial control over treasury funds","category":["GOVERNANCE"],"content":["The Tornado Cash DAO community has voted in favor of adding the DAO’s governance as a signatory to the treasury’s multi-signatory (multisig) wallet. The <a href=\"https:\/\/etherscan.io\/address\/0x5efda50f22d34f262c29268506c5fa42cb56a1ce\" data-v-f87c67ca=\"\">treasury<\/a> looks after about $21.6 million across three different wallets.","This vote began on Wednesday, based on a <a href=\"https:\/\/torn.community\/t\/adding-the-governance-as-multisig-signer\/3002\" data-v-f87c67ca=\"\">proposal<\/a> on the Tornado Cash DAO governance page, and ended today with <a href=\"https:\/\/snapshot.org\/#\/torn-community.eth\/proposal\/0xf3c9036fab08e94d483d87e7e6589bfef2230ca3d31d6d7aaefcc50b5ef9ecbe\" data-v-f87c67ca=\"\">100%<\/a> approval from all 12 participants. These 12 participants contributed 51,000 TORN tokens to push the vote to completion.","The voting process was hastily put together with the SnapShot initiated together with the proposal. Usually, there is a delay between a proposal being filed and the commencement on-chain. This lag is to create adequate time for the community to discuss the matter at hand. But it would have taken too long for the DAO.","“As it is very important, we need to move on fast on this subject. I will make a snapshot vote today so you guys can vote on it during 3 days,” said the Tornado Cash DAO member who filed the proposal.","With the vote passed, the DAO’s treasury will now become a four-of-six multisig instead of the previous four-of-five multisig arrangement. The Tornado DAO governance will now be added as a signatory to the treasury wallet. Multisig wallets require a specific minimum number of signatories to approve a transaction. In this case, four out of the six signers must approve any transaction from the treasury.&nbsp;","In practice, this means that if the core developers want to make a transaction involving the treasury, they will need to get signatures from at least four of the six multisig holders. Since one of these holders is now the DAO, they may need to ask the DAO to approve a signature. This would require the DAO to vote on whether to do so.","The DAO’s decision to increase its multisig signers is in case something happens to two signatories. This is over fears that people associated with the DAO, including members of the multisig, could be targeted by law enforcement following the recently imposed US sanctions. <a href=\"https:\/\/www.theblock.co\/post\/163206\/suspected-tornado-cash-developer-arrested-in-amsterdam\" data-v-f87c67ca=\"\">As previously reported by The Block<\/a>, one Tornado Cash developer has already been arrested in The Netherlands. It is unclear if he was arrested simply for being a Tornado Cash developer or for being a relayer on the network (officials said the person had <span data-v-2bf786c3=\"\" data-v-f87c67ca=\"\">made large-scale profits from the protocol<\/span>).","Tornado Cash is also facing multiple cases of de-platforming. The protocol’s Discord and governance forum pages are <a href=\"https:\/\/www.theblock.co\/post\/163228\/tornado-cashs-discord-server-and-governance-forum-shuttered-amid-arrest?utm_source=cryptopanic&amp;utm_medium=rss\" data-v-f87c67ca=\"\">no longer accessible<\/a>. Its email, website, and GitHub pages have also been removed since the US sanctions were announced earlier in the week. Centralized blockchain node services Infura and Alchemy have also <a href=\"https:\/\/www.theblock.co\/post\/162402\/infura-and-alchemy-blocking-access-to-tornado-cash\" data-v-f87c67ca=\"\">blocked access<\/a> to the crypto mixer’s front-end, plus Circle has frozen all USDC that was in the sanctioned addresses.","With Tornado Cash's governance forum now offline, it will be harder for the DAO to organize itself and vote on approving any treasury transactions.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$21.6 million","content":"MONEY"},{"type":"The Netherlands","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"GitHub","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}