{"summary":"Kyber Network and BitGo are coordinating the migration to a new multisig smart contract for the Wrapped Bitcoin DAO.\nThis migration is taking place because some of the original multisig signers have become inactive.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189991\/wrapped-bitcoin-dao-removes-ftx-nine-others-in-move-to-new-multisig","publishDate":"2022-11-25T10:50:21","id":1275,"type":null,"title":"Wrapped Bitcoin DAO removes FTX, nine others in move to new multisig","category":["Crypto Ecosystems"],"content":["WBTC DAO, the community that administers the Wrapped Bitcoin (WBTC) project, is moving to a new smart contract multisig, replacing signers that are no longer active. The new set of signers will be responsible for signing transactions and making changes to the wrapped token’s contract if necessary.","This migration is taking place according to a pull <a href=\"https:\/\/github.com\/WrappedBTC\/DAO\/pull\/12\" data-v-f87c67ca=\"\">request<\/a> on the project’s GitHub, submitted by Kyber Network CEO Victor Tran. Tran <a href=\"https:\/\/twitter.com\/vutran54\/status\/1596115908191457280\" data-v-f87c67ca=\"\">stated<\/a> that Kyber and WBTC custodian BitGo are coordinating the migration to this new multisig.","The new WBTC DAO multisig will have 13 signers with eight needed to achieve quorum on any matter. There were 18 signers in the previous multisig formed over three years ago. At the time, 11 signers were needed to form a consensus on any decision.","The new multisig list contains seven members from the original set, including DeFi lender Compound and Layer 2 exchange Loopring alongside Kyber and BitGo. Oracle protocol Chainlink and DeFi liquidity platform Balancer are among the six new additions to the list. The likes of FTX, Airswap and MakerDAO have been removed as members of the multisig.","Tran noted that several of the original signers removed from the list had become inactive or had lost control of their keys. This situation could lead to diminished availability of the multisig if there are not enough signers to achieve a consensus. The signers are responsible for voting on amendments to the WBTC contracts. These amendments can include upgrades or modifications to the WBTC contracts as well as the selection of a new custodian for the token.","The multisig migration is coming at a time when WBTC is experiencing its longest de-pegging from bitcoin. <a href=\"https:\/\/www.theblock.co\/post\/2290\/a-bitcoin-backed-ethereum-token-is-coming-to-market-in-2019-and-it-could-help-a-struggling-corner-of-the-crypto-market\" data-v-f87c67ca=\"\">WBTC is a wrapped version of bitcoin<\/a> that is supposed to maintain 1:1 parity with BTC. WBTC began losing its peg to bitcoin in the wake of the FTX collapse and is currently 0.86% below its BTC peg."],"hashtag":["FTX"]}