{"summary":"Kraken product director Shannon Kurtas tells The Block that the increase is mainly due to the 5x increase in use of the exchange&#x27;s Pro app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240124\/kraken-share-of-us-spot-trading-volumes-reaches-18-month-high","publishDate":"2023-07-17T16:51:06","id":12750,"type":null,"title":"Kraken share of US spot trading volumes reaches 18-month high","category":["COMPANIES"],"content":["Crypto exchange Kraken saw its share of U.S. spot volume more than double in the past 18 months.","The increase coincides with increased interest in the <a href=\"https:\/\/www.theblock.co\/post\/194886\/kraken-pro-launch\" data-v-f87c67ca=\"\">Kraken Pro app<\/a>, which allows users to access spot trading, margin trading and staking. The platform experienced a five-fold increase in users from January to June 2023.&nbsp;","\"We’ve seen a dramatic increase in usage and activity of clients for using the new Pro platform versus the previous platforms,\" Kraken product director Shannon Kurtas told The Block. \"It's a segment that we've doubled down on for the past 18 months.\"","Kurtas said that Kraken's global spot market share doubled within the last 18 months as well, though it's still not as high in the U.S.","\"In Euro-quoted markets, we been a leader for quite a number of years, and our share has gone from 35% to just over 50% in the past 12 months,\" Kurtas said.&nbsp;","Kurtas added that the exchange will add a number of features to augment user experience, such as price alerts to keep users informed of their favorite markets and engaged with the platform.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/usd-support-exchange-volume-market-share\/embed\" title=\"USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shannon Kurtas","content":"PERSON"},{"type":"Kraken Pro app","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Euro","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"last 18 months","content":"DATE"},{"type":"Kurtas","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":["KRAKEN"],"authors":["MK Manoylov","The Block"]}