{"summary":"Analog, a blockchain interoperability project, has $16 million in a private token round at a $120 million valuation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277171\/blockchain-interoperability-project-analog-token-funding-valuation","publishDate":"2024-02-12T12:00:02","id":12756,"type":null,"title":"Blockchain interoperability project Analog raises token round at $120 million valuation","category":["DEALS"],"content":["Analog, a blockchain interoperability project building cross-chain communication infrastructure, has raised $16 million in a seed and strategic funding round.","Tribe Capital led the round, with NGC Ventures, Wintermute, GSR, NEAR, Orange DAO, Mike Novogratz’s Samara Asset Group, Balaji Srinivasan and others participating, Analog said Monday. The firm started raising the round in October and closed it in December, Analog co-founder Victor Young told The Block. The funding was realized via a simple agreement for future tokens, or SAFT, Young said, adding that the round brought Analog’s fully diluted valuation to $120 million.","Young, a blockchain developer and investor, founded Analog in 2021 with Sanchal Ranjan, a former Y Combinator-backed entrepreneur and currently a “genesis member” of Orange DAO. Young said that Analog’s core team is based in Bangkok and Zurich.","Analog is building cross-chain communication tools for interoperability across multiple blockchain networks. Its core products include Timechain, a Rust language-based blockchain network; a generic message-passing protocol; Analog Watch, a developer-facing product; and Timegraph SDK and API suite that will allow application builders to compose applications across multiple chains.","Analog can be compared with <a href=\"https:\/\/www.theblock.co\/post\/263109\/jpmorgan-apollo-axelar-oasis-pro-provenance-blockchain-interoperability\" data-v-f87c67ca=\"\">Axelar<\/a> or <a href=\"https:\/\/www.theblock.co\/post\/266698\/layerzero-says-its-targeting-token-launch-for-first-half-of-2024\" data-v-f87c67ca=\"\">LayerZero<\/a>, but Young said Analog is more developer-focused.","“We are building all the necessary features for cross-chain development as a single toolkit as opposed to relying on third parties such as oracles to achieve the desired functionality,” he said. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAnalog is built on Substrate, Young added, noting that it will allow the upgradability of Analog easier than its competitors if there are new proving mechanisms.","Analog’s public “incentivized” testnet is scheduled to be released at the end of the first quarter or early second quarter, Young said. The mainnet is planned to launch in the late second quarter, he added.","There are currently 30 people working for Analog, and Young is looking to hire more people across functions, including engineering and business development, with fresh capital in hand.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"Samara Asset Group","content":"ORGANIZATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Analog","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Bangkok","content":"LOCATION"},{"type":"early second quarter","content":"DATE"},{"type":"Timechain","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Balaji Srinivasan","content":"PERSON"},{"type":"Analog Watch","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Orange DAO","content":"ORGANIZATION"},{"type":"Zurich","content":"LOCATION"},{"type":"Victor Young","content":"PERSON"},{"type":"Timegraph SDK","content":"ORGANIZATION"},{"type":"Young","content":"ORGANIZATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"end of the first quarter","content":"DATE"},{"type":"Sanchal Ranjan","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"late second quarter","content":"DATE"},{"type":"December","content":"DATE"},{"type":"NGC Ventures","content":"ORGANIZATION"},{"type":"Young","content":"PERSON"},{"type":"SAFT","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$16 million","content":"MONEY"}],"hashtag":["ASIA","CRYPTO","DECENTRALIZED INFRASTRUCTURE","DEVELOPER TOOLS","INTEROPERABILITY","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}