{"summary":"Eventus is a leading global provider of trade surveillance, transaction monitoring solutions, and market risk for digital asset exchanges, along with other asset classes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108211\/what-to-watch-in-digital-asset-markets-this-year","publishDate":"2021-06-11T11:48:51","id":12763,"type":null,"title":"What to Watch in Digital Asset Markets This Year","category":["SPONSORED"],"content":["The world is finally catching on to what we’ve known for years—that digital assets will play an important role in the future of financial markets. The speed, transparency, and security benefits of digital assets are undeniable, which have led to explosive growth in markets that have only been around for about a decade. Yet we are just starting to realize the potential and application of digital assets.","As familiarity with digital assets grows, many market, policy, and regulatory questions surrounding their use remain unanswered. Globally, policymakers and regulators are taking notice of the size and prominence of digital assets and formulating plans toward solutions that balance consumer protection with continued innovation.","Now is the time to convene leading institutional market participants with key regulators, legislators, and thought leaders so we can grapple with some of the biggest questions facing the industry.","<a href=\"http:\/\/www.theadam.io\/\" data-v-f87c67ca=\"\">The Association for Digital Asset Markets (ADAM)<\/a> and <a href=\"https:\/\/www.eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus Systems<\/a> are doing just that—collaborating on a two-day virtual conference this month to bring together digital asset thought leaders. ADAM is a private, nonprofit association of firms that operate in the digital asset marketplace. The association is a standards-setting body, and all of its members agree to abide by a Code of Conduct, which promotes integrity, fairness, and efficiency in digital asset markets. Eventus is a leading global provider of trade surveillance, transaction monitoring solutions, and market risk for digital asset exchanges, along with other asset classes.","<a href=\"https:\/\/event.on24.com\/eventRegistration\/EventLobbyServlet?target=reg20.jsp&amp;referrer=https%3A%2F%2Finfo.eventussystems.com&amp;eventid=3164803&amp;sessionid=1&amp;key=3DA5FC819A778BB9017C779A5724CC37&amp;regTag=2389002&amp;V2=false&amp;sourcepage=register\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Shining a Light on Digital Asset Markets 2021<\/em><\/a> will feature discussions on the structure of digital asset markets and the evolution of markets from traditional to digital. Market infrastructure will also be in focus—with panels exploring custody, trading, and other issues. Experts will delve into considerations for the buy-side, and other key voices will discuss the potential for a bitcoin ETF.","The conference will feature leading regulators from the Securities and Exchange Commission and the Commodity Futures Trading Commission, as well as foreign governments to offer perspectives on the different and evolving regulatory approaches domestically and globally. Surveillance remains a critically important discussion— as digital asset markets work to ensure the integrity and safety of their markets as they increasingly attract institutional market participants – and co-host Eventus will discuss best practices and elicit feedback from others in this space on what priorities should be for market participants. Lastly, we will host a discussion on SROs and new crypto legislation and oversight developing on Capitol Hill.","With confirmed speakers including MicroStrategy CEO Michael Saylor, Grayscale CEO Michael Sonnenshein, SEC Commissioner Hester Peirce, CFTC Commissioner Dawn Stump, and other thought leaders, individuals in this space should tune into the discussions, which begin at 10AM ET on June 22 and June 23. For a complete list of confirmed speakers and to register to join the conference, <a href=\"https:\/\/event.on24.com\/eventRegistration\/EventLobbyServlet?target=reg20.jsp&amp;mode=preview&amp;eventid=3164823&amp;sessionid=1&amp;key=537BE0597A63FEBE352854A47AFCCB2A&amp;regTag=2389002&amp;V2=false&amp;sourcepage=register\" data-v-f87c67ca=\"\">click here<\/a>.","The world of digital assets is here to stay—and will only grow in prominence. Better understand the rapidly evolving landscape from the very players shaping it by attending the <em data-v-f87c67ca=\"\">Shining a Light on Digital Asset Markets <\/em>virtual conference.","<em data-v-f87c67ca=\"\">Michelle Bond is CEO of the Association for Digital Asset Markets (ADAM). Travis Schwab is CEO of Eventus.&nbsp; &nbsp;<\/em>","&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ","","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Michelle Bond","content":"PERSON"},{"type":"SROs","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"the Association for Digital Asset Markets (ADAM","content":"ORGANIZATION"},{"type":"Travis Schwab","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Association for Digital Asset Markets","content":"ORGANIZATION"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"CFTC Commissioner Dawn Stump","content":"ORGANIZATION"},{"type":"June 22","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"June 23","content":"DATE"},{"type":"Digital Asset Markets","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}