{"summary":"Crypto lender BlockFi is now letting users buy crypto via cash and then earn interest on that crypto. &quot;Initially, only USD is supported and funds wired to BlockFi will be instantly converted to Gemini Dollar (GUSD) and held in clients&#x27; interest accounts earning 8.6% APY,&quot; Zac Prince, founder and CEO of BlockFi, told The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/58257\/crypto-lender-blockfi-now-supports-cash-transfers-via-silvergate-bank","publishDate":"2020-03-10T09:01:23","id":12760,"type":null,"title":"Crypto lender BlockFi now supports cash transfers via Silvergate Bank","category":["LENDING"],"content":["Crypto lender BlockFi is now letting users buy crypto via cash and then earn interest on that crypto.","The initiative is being supported by crypto-friendly Silvergate Bank, which operates a 24\/7 payment network called the Silvergate Exchange Network (SEN).","\"Initially, only USD is supported and funds wired to BlockFi will be instantly converted to Gemini Dollar (GUSD) and held in clients' interest accounts earning 8.6% APY [Annual Percentage Yield],\" Zac Prince, founder and CEO of BlockFi, told The Block.","Prince added that international wires in different currencies are also accepted, but they will be converted into USD.","BlockFi said the move will allow non-crypto users to buy their first $10 worth of crypto and earn interest on it.","\"It opens the door for a whole new customer base for BlockFi: individuals who are looking for strong investment opportunities but don't yet own cryptocurrency,\" Prince told The Block, adding that anyone can now \"immediately begin earning 8.6% interest through BlockFi, whether they own crypto or not.\"","BlockFi claims to be the only retail crypto lender supporting cash transfers.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Florida license<\/strong><\/span>","The firm has today also announced that it recently received a money services business license for the State of Florida, the state equivalent to a standard money transmitter license. As a result, BlockFi is now active in all 50 U.S. states, as well as over 100 other countries.","Founded in 2018, BlockFi has grown significantly within two years. The firm's revenues grew over 20 times in 2019, and it currently boasts more than $650 million in assets on the platform, with a 0% loss rate across its entire loan portfolio since the launch.","BlockFi is backed by notable investors, including Valar Ventures and Morgan Creek Digital. The firm has raised <a href=\"https:\/\/www.crunchbase.com\/organization\/blockfi-inc\" data-v-f87c67ca=\"\">over $100 million<\/a> in funding to date, according to Crunchbase. Most recently, it <a href=\"https:\/\/www.theblockcrypto.com\/post\/55812\/blockfi-raises-30-million-as-it-looks-to-become-more-than-just-a-lender\" data-v-f87c67ca=\"\">raised<\/a> $30 million in a Series B round.","Flush with cash, BlockFi is now also <a href=\"https:\/\/www.theblockcrypto.com\/post\/55812\/blockfi-raises-30-million-as-it-looks-to-become-more-than-just-a-lender\" data-v-f87c67ca=\"\">planning to<\/a> venture into the institutional lending business, as well as launch a bitcoin-rewards credit card.","\"We will be associated less and less with the crypto lending category and more and more be identified as a diversified financial-services entity,\" Prince told The Block last month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"8.6%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"Zac Prince","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"the State of Florida","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Silvergate Exchange Network (SEN","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"$650 million","content":"MONEY"},{"type":"0%","content":"PERCENT"},{"type":"Valar Ventures","content":"ORGANIZATION"}],"hashtag":["BLOCKFI"],"authors":["Yogita Khatri","The Block"]}