{"summary":"“This is our moment to shine,” Coinbase CEO Brian Armstrong told employees in a communication obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194804\/coinbase-ceo-says-market-fear-and-volatility-are-a-moment-to-shine","publishDate":"2022-12-13T19:37:56","id":12768,"type":null,"title":"Coinbase CEO says market fear and volatility are a &#x27;moment to shine&#x27;","category":["COMPANIES"],"content":["With Coinbase's shares are at an all-time low, CEO Brian Armstrong sent out a memo to staff reassuring them that unlike other struggling or failed crypto exchanges, their company would persevere.","“This is our moment to shine,” wrote Armstrong in a communication obtained by The Block. “It was not always easy, as we saw competitors skirt rules and rocket up in value and media attention.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nArmstrong also urged employees to be “prepared to serve” customers amid market volatility, citing what he called “large withdrawals happening on Binance” as potentially a contributing factor.","The 39-year-old chief executive also sought to remind staff that Coinbase does not have material exposure to rival Binance, <span data-v-f87c67ca=\"\">safely stores customer assets<\/span> and possesses $5 billion on its balance sheet. Coinbase shares closed Tuesday's trading session below $39 apiece, marking an all-time low. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe comments come on the heels of weeks of turmoil spurred by liquidity uncertainty and crisis, bankruptcies and layoffs spurred by the collapse of multi-billion dollar crypto exchange FTX.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$39","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}