{"summary":"The CFTC commissioner has begun a push for new digital asset rules to increase the CFTC&#x27;s oversight of the sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/205688\/cftcs-johnson-makes-a-call-to-action-following-ftx-fallout","publishDate":"2023-01-25T17:04:46","id":12765,"type":null,"title":"CFTC&#x27;s Johnson makes a call to action following FTX fallout","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Commodity Futures Trading Commission Commissioner Kristin Johnson is advocating for the agency to introduce new cryptocurrency rules while also calling on Congress to enhance the agency’s authority. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Democratic commissioner said she is encouraging CFTC Chair Rostin Behnam and fellow commissioners to “consider with the utmost urgency initiating a notice and comment process,” in a speech given at Duke University on Jan. 21, but only shared publicly on Wednesday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Johnson said the process should ensure the agency has more visibility into the financial health and risk management of any business that is seeking to acquire a significant stake in a firm that is registered with the agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Johnson’s comments come after the spectacular fall of FTX, which she mentioned throughout the speech. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">FTX got a judge’s approval earlier this month <a href=\"https:\/\/www.theblock.co\/post\/201953\/ftx-approval-sell-ledgerx\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">to sell<\/span><\/a> LedgerX, which it bought in 2021 and is registered as a derivatives clearing organization with the agency. Johnson said the anticipated the final auction date for bids will take place in early March. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“In order to fulfill our customer protection, market integrity, and market stability mandate, the commission should have the authority to engage in an appropriate level of due diligence,” Johnson said in the speech.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Johnson offered solutions to fix gaps in regulation, some of which she said will only require CFTC action. The fixes will in part expand prohibitions on the commingling of customer assets, restrictions on the treatment of customer funds, prevent liquidity crises, establish requirements for conflicts of interest policies and establish authority for the CFTC to conduct due diligence on businesses that seek to buy CFTC licenses businesses. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Johnson also urged Congress to adopt legislation that closes the gap in the agency’s oversight of crypto spot markets. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“The introduction of legislation could address the extraterritoriality issues outlined about and grant the CFTC and other regulators greater visibility into crypto-markets,” Johnson said. &nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">FTX filed for bankruptcy in November, and U.S. authorities brought charges against its former CEO Sam Bankman-Fried soon after. The Justice Department, the CFTC and the Securities and Exchange Commission also brought their own civil charges.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Jan. 21","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Duke University","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Kristin Johnson","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}