{"summary":"A governor at the Federal Reserve is pushing back on several areas of crypto industry speculation for the Fed’s engagement with crypto. \nKey among them is the push for a digital dollar. Governor Bowman says that FedNow likely solves the issues a digital dollar would solve. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164085\/federal-reserve-governor-pumps-the-brakes-on-us-cbdc-in-favor-of-fednow","publishDate":"2022-08-17T13:15:15","id":1276,"type":null,"title":"Federal Reserve governor pumps the brakes on US CBDC in favor of FedNow","category":["Policy"],"content":["A leader at the Federal Reserve is pumping the brakes on speculation surrounding crypto engagement from the regulator.","In an August 17 <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/speech\/bowman20220817a.htm\" data-v-f87c67ca=\"\">speech<\/a>, Federal Reserve Governor Michelle Bowman took issue with many key areas of the Fed's work and its crossover with fintech and crypto industry concerns.&nbsp;","Key among them is the push for a US central bank digital dollar, or CBDC, also known as a digital dollar. The subject of much political speculation, a digital dollar has <a href=\"https:\/\/www.theblock.co\/post\/154972\/congressional-democrats-plot-path-forward-on-digital-dollar-while-they-have-the-majority\" data-v-f87c67ca=\"\">grown increasingly contentious<\/a> over the past year.","Bowman said that the Fed's plans for FedNow will fill the niche many envision for a US CBDC.&nbsp;","\"The FedNow Service will enable financial institutions of every size, and in every community across America, to provide safe and efficient instant payment services. It is intended to be a flexible, neutral platform that will support a broad variety of instant payments,\" Bowman said.&nbsp;\"My expectation is that FedNow addresses the issues that some have raised about the need for a CBDC.\"","Bowman also took an oblique potshot at the crypto industry's hope for banks working with crypto assets.","\"I am hearing more discussions involving banks' interest in offering services involving crypto-assets. The chatter seems to originate more from those outside the banking industry, but I'll put that aside for now,\" she said.","Turning to <a href=\"https:\/\/www.theblock.co\/post\/163628\/federal-reserve-opens-up-master-account-access-to-banks-with-novel-charters-in-win-for-crypto-and-fintech\" data-v-f87c67ca=\"\">recent guidelines on requests for Fed \"master accounts,\"<\/a> Bowman also struck a tentative tone.","She said:","Effectively, Bowman is warning that the backlog of requests for master accounts won't disappear any time soon.&nbsp;"],"hashtag":["FEDERAL RESERVE"]}