{"summary":"Bankman-Fried has sufficient access to a laptop to review discovery in jail, prosecutors said Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249366\/sam-bankman-frieds-lawyers-reiterate-jail-release-request-doj-says-laptop-access-sufficient","publishDate":"2023-09-05T22:50:42","id":12767,"type":null,"title":"Sam Bankman-Fried’s lawyers reiterate jail release request, DOJ says laptop access sufficient","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Sam Bankman-Fried, the jailed founder of collapsed crypto exchange FTX, has been given enough time with access to a laptop to review discovery, prosecutors said Tuesday, as Bankman-Fried awaits a trial that is currently set for early October.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/253\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">letter<\/span><\/a><span data-v-f87c67ca=\"\"> submitted to Judge ​​Lewis A. Kaplan, the U.S. Department of Justice said that Bankman-Fried, who is currently detained at the Metropolitan Detention Center, has access to an air-gapped laptop at a visiting room from 8:00 a.m. to 7:00 p.m. on weekdays, and from 8:00 a.m. to 3:30 p.m. on weekends and holidays.<\/span>","<span data-v-f87c67ca=\"\">\"To date, there have been no reported issues with the functionality of the USB ports and software applications utilized thus far,\" the prosecutors said, adding that he currently has three hard drives and that the MDC has approved the use of a second air-gapped laptop, which can be stored in an area adjacent to his housing unit for increased convenience.<\/span>","<span data-v-f87c67ca=\"\">The prosecutors’ report came after the judge on Aug. 30 instructed them to submit a letter outlining the status of Bankman-Fried’s access to discovery.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried’s lawyers, however, argued in a <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/254\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Tuesday filing<\/span><\/a><span data-v-f87c67ca=\"\"> that even under the current system, Bankman-Fried “will not have a meaningful opportunity to prepare his defense.”<\/span>","<span data-v-f87c67ca=\"\">\"Friday, September 1, 2023, was the first day Mr. Bankman-Fried could work a full day with his materials at the MDC. But contrary to the plan, MDC staff told Mr. Bankman-Fried that he had to leave the visiting room at around 2:30pm and return to his unit for the count. This deprived him of 4.5 hours of possible work time,\" his lawyers said.<\/span>","<span data-v-f87c67ca=\"\">Sam Bankman-Fried's attorneys have been <\/span><a href=\"https:\/\/www.theblock.co\/post\/247689\/sam-bankman-frieds-lawyers-ask-for-temporary-release-from-jail\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">urging the district court to grant the former FTX CEO's temporary release<\/span><\/a><span data-v-f87c67ca=\"\"> from jail to review documents ahead of his upcoming trial.<\/span>","<span data-v-f87c67ca=\"\">His attorneys on Tuesday reiterated their request for Bankman-Fried’s temporary release.<\/span>","<span data-v-f87c67ca=\"\">Another point of the argument centers around the conditions at the 500 Pearl Street cell block. Prosecutors said Banman-Fried has access to an internet-enabled laptop at least two days per week at the cellblock, and the laptop has been \"updated with a new 9-cell battery provided by defense counsel that has approximately 8 hours battery life.\"<\/span>","<span data-v-f87c67ca=\"\">Banman-Fried’s attorneys argued that it is too soon to know whether the procedures in the 500 Pearl Street cell block will work as promised. \"[The] last time he was produced to the cell block, it was effectively wasted time because the internet was unreliable and intermittent at best and the battery life of the laptop he was permitted to use there did not provide enough charge for a full 5 hours of work.\"<\/span>","<span data-v-f87c67ca=\"\">\"Hence, we are similarly skeptical that the cell block procedures will work as promised,\" the lawyer said.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"8:00 a.m.","content":"TIME"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"3:30 p.m.","content":"TIME"},{"type":"USB","content":"ORGANIZATION"},{"type":"Aug. 30","content":"DATE"},{"type":"MDC","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Banman","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Metropolitan Detention Center","content":"ORGANIZATION"},{"type":"7:00 p.m.","content":"TIME"},{"type":"weekdays","content":"DATE"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"September 1, 2023","content":"DATE"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Timmy Shen","The Block"]}