{"summary":"Bitmex launched its &quot;Proof of Liability&quot; system, which lets all depositors self-verify their liabilities in the crypto exchange&#x27;s total liability balance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191330\/bitmex-to-allow-depositors-to-self-verify-liabilities","publishDate":"2022-12-01T09:33:58","id":12778,"type":null,"title":"Bitmex to allow depositors to self-verify liabilities","category":["EXCHANGES"],"content":["Bitmex launched a system that will allow all depositors to self-verify their liabilities in the crypto exchange's total liability balance sheet.","The company's \"Proof of Liability,\" or PoL, system does not use a third-party auditor and preserves client privacy via Merkle tree, a cryptographic data structure, according to a blog <a href=\"https:\/\/blog.bitmex.com\/bitmex-pol-system-now-live\/\" data-v-f87c67ca=\"\">post<\/a> on Bitmex's website.","The update accompanies Bitmex snapshots of reserves and liabilities that are <a href=\"https:\/\/public.bitmex.com\/?prefix=data\/porl\/\" data-v-f87c67ca=\"\">published<\/a> every Tuesday and Thursday.","To self-verify liabilities on Bitmex, users must download the latest liability snapshot and install an open-source tool from GitHub. The tool can be run from the Terminal application on Mac or Linux via a short series of commands. Bitmex depositors also have their nonces, arbitrary numbers allowing cross-references against the exchange's published liabilities, available on their individual \"My Account\" pages.","<span data-v-f87c67ca=\"\">An example output from BitMEX's PoL process. Source: BitMEX<\/span>","The new PoL system from Bitmex comes after the high-profile collapses of crypto exchange FTX and its associated trading firm, Alameda Research, which has <a href=\"https:\/\/www.theblock.co\/post\/187240\/exchanges-rushed-to-show-proof-of-reserves-its-not-enough\" data-v-f87c67ca=\"\">spurred<\/a> calls for greater transparency from centralized exchanges.","Bitmex&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/184955\/bitmex-to-proceed-with-token-launch-says-no-exposure-to-ftx\" data-v-f87c67ca=\"\">claimed<\/a> no exposure to FTX, its exchange token (FTT) or Alameda Research.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Merkle","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Bitmex","content":"ORGANIZATION"},{"type":"Bitmex","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BITMEX"],"authors":["Adam James","The Block"]}