{"summary":"An Immunefi researcher was rewarded for finding a critical vulnerability on three parachains in the Polkadot ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199718\/immunefi-researcher-saves-200-million-from-potential-theft-on-three-polkadot-parachains","publishDate":"2023-01-06T07:16:13","id":12770,"type":null,"title":"Immunefi researcher saves $200 million from potential theft on three Polkadot parachains","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">A security researcher discovered a software vulnerability that could have been exploited to steal as much as $200 million from three Ethereum-compatible parachains on Polkadot — Moonbeam, Astar Network and<\/span><a href=\"https:\/\/www.theblock.co\/post\/174981\/acala-restores-full-operations-after-users-error-minted-3-billion-ausd\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Acala.<\/span><\/a>","<span data-v-f87c67ca=\"\">The researcher, known as pwning.eth, found and reported the critical vulnerability in June in a software called Frontier that is used for \"wrapping\" native tokens on the three blockchain projects (or parachains) on the Polkadot network. The report was submitted on the crypto-focused bug-hunting platform Immunefi on June 27, but only recently disclosed.<\/span>","<span data-v-f87c67ca=\"\">\"Pwning.eth found a bug that impacted the entire Polkadot ecosystem and would allow hackers to steal over $200 million across Moonbeam, Astar Network, and Acala,\" a representative from Immunefi told The Block. \"They were all vulnerable to a bug that could have allowed malicious users to mint wrapped native tokens.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In this case, wrapping is the process of converting the native crypto assets of blockchains into tokens that can be more readily supported by apps. It is done with the use of a smart contract, which holds the native tokens in escrow and issues the wrapped tokens to the user.<\/span>","<span data-v-f87c67ca=\"\">The vulnerability on the three chains could have been abused to mint unlimited wrapped tokens, including wrapped astar (WASTR) on Astar, wrapped moonbeam (WGLMR) on Moonbeam, and wrapped moonriver (WMOVR) on Moonriver, a sister network of Moonbeam.<\/span>","<span data-v-f87c67ca=\"\">The estimated value of assets exposed to the vulnerability was about $200 million across the three parachains, Immunefi said. After the vulnerability was reported, the three parachain teams worked to fix it and released an emergency patch before any malicious actors could exploit it. No funds were lost.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Moonbeam and Astar, which have active bug-bounty programs with Immunefi, awarded $1 million to the ethical hacker through Immunefi. Parity, developer of the Frontier Library, decided to contribute $250,000 toward the $1 million reward, despite not having a bug bounty with Immunefi.<\/span>","<span data-v-f87c67ca=\"\">Pwning.eth is no stranger to finding critical bugs and being awarded large sums. In early 2022, the white-hat hacker was rewarded with a<\/span><a href=\"https:\/\/www.theblock.co\/post\/150500\/aurora-labs-pays-6-million-reward-to-hacker-that-saved-70000-eth-from-getting-stolen\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> $6 million bounty<\/span><\/a><span data-v-f87c67ca=\"\"> after discovering a vulnerability in Aurora, an EVM compatible blockchain for NEAR Protocol, saving about 70,000 ETH worth $200 million at the time.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"Aurora","content":"LOCATION"},{"type":"Moonriver","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Moonbeam","content":"LOCATION"},{"type":"Immunefi","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Astar Network","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"June 27","content":"DATE"},{"type":"$6 million","content":"MONEY"},{"type":"Frontier Library","content":"ORGANIZATION"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":["HACKS"],"authors":["Vishal Chawla","The Block"]}