{"summary":"OpenSea&#x27;s new UX means creators will be able to launch their collections with dedicated drop pages.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171145\/opensea-upgrades-nft-drops-with-immersive-minting-experience","publishDate":"2022-09-20T05:28:14","id":12773,"type":null,"title":"OpenSea upgrades NFT drops with &#x27;immersive minting experience&#x27;","category":["NFTS"],"content":["NFT marketplace giant OpenSea announced on Monday that it has upgraded its process for minting NFTs with a new \"immersive\" drop experience.&nbsp;","Creators will be able to launch their collections with dedicated drop pages and greater discoverability, it said in a <a href=\"https:\/\/opensea.io\/blog\/announcements\/drops-on-opensea-an-immersive-and-secure-minting-experience\/\" data-v-f87c67ca=\"\">blog post<\/a>. Alongside this, collectors will now be able to mint directly from an OpenSea page.","Drop pages will include information about the drop, the minting schedule, a countdown clock and an NFT gallery.&nbsp;","This will come with a new service called SeaDrop, an open source contract which means that those launching NFTs don’t need to create custom smart contracts.","\"With our new drops experience, we are providing creators with the technical foundation to mint their projects without compromising creativity,\" OpenSea wrote. \"Also, collectors can come to one trusted destination for both minting and future sales and purchases.\"","The move comes amid a period of change for NFT marketplaces and service providers, as companies look to offer something different from their competitors amid a prolonged bear market. OpenSea has long dominated as a host for NFT drops and sales, however challengers offering multi-chain options and ways to <a href=\"https:\/\/www.theblock.co\/post\/163497\/an-nft-market-maker-set-0-royalties-sparking-concerns-about-the-future-of-artist-compensation\" data-v-f87c67ca=\"\">bypass royalties<\/a> have gained traction in recent months.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/opensea-vs-looksrare-volume\/embed\" title=\"Opensea vs LooksRare Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","There has also been fragmentation in the market as companies move to offer bespoke NFT minting services. MoonPay's HyperMint platform, which it <a href=\"https:\/\/www.theblock.co\/post\/153119\/moonpay-officially-launches-utility-nft-minting-service-hypermint\" data-v-f87c67ca=\"\">launched in June<\/a>, promised to do just that with a machine it created for creators and brands to mint millions of utility NFTs at a time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"}],"hashtag":["LOOKSRARE","MAGIC EDEN","OPENSEA"],"authors":["Lucy Harley-McKeown","The Block"]}