{"summary":"Ethereum scaling solution StarkWare has pushed out an open-source full-node client implementation called Papyrus.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201471\/starkware-rolls-out-open-source-client-papyrus-for-starknet","publishDate":"2023-01-12T08:13:24","id":12788,"type":null,"title":"StarkWare rolls out open-source client Papyrus for StarkNet","category":["CRYPTO ECOSYSTEMS"],"content":["StarkWare has debuted another full node client for its scaling solution StarkNet called Papyrus, which is written in the Rust programming language. This will enable a more diverse set of implementations of the scaling solution, potentially bolstering security and decentralization.","Papyrus will improve the project’s transaction throughput capabilities, the team <a href=\"https:\/\/medium.com\/starkware\/papyrus-an-open-source-starknet-full-node-396f7cd90202\" data-v-f87c67ca=\"\">announced<\/a> on Wednesday. It joins Pathfinder as the second Rust-coded full-node client. StarkNet also has another full-node client called Juno that is being coded in Golang.&nbsp;","The newly released node will help expand StarkNet’s performance and decentralization, the announcement stated. Papyrus will reportedly enhance the StarkNet Sequencer’s block production capabilities. The Sequencer is the tool responsible for ordering and executing transactions on StarkNet. Papyrus will provide an efficient storage layer to help improve the Sequencer’s throughput.","StarkWare has previously outlined its growth map for StarkNet with a focus on functionality, scalability, and decentralization in that order. The team says it has <a href=\"https:\/\/www.theblock.co\/post\/175800\/an-ethereum-team-has-warped-uniswap-onto-starknet\" data-v-f87c67ca=\"\">achieved excellent functionality<\/a> with <a href=\"https:\/\/www.theblock.co\/post\/196442\/visa-proposes-using-starknet-for-automatic-recurring-payments\" data-v-f87c67ca=\"\">Visa recently proposing<\/a> to use StarkNet for recurring payments. Now, attention is moving to system performance concerns with the aim of improving scalability, hence the rollout of Papyrus.","The introduction of Papyrus will also help the push toward greater decentralization, the team stated, as it is an open-source node client. This move is part of efforts to open-source the project’s wider technology stack.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Golang","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"}],"hashtag":["STARKNET"],"authors":["Osato Avan-Nomayo","The Block"]}