{"summary":"The Justice Minister in Montenegro has told people in private meetings he plans extradite Kwon to the U.S. but not until ruling on an appeal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266585\/do-kwon-will-be-extradited-to-us-by-montenegro-justice-minister-wsj","publishDate":"2023-12-07T11:33:41","id":12786,"type":null,"title":"Do Kwon will be extradited to US by Montenegro Justice Minister: WSJ","category":["PEOPLE"],"content":["Weeks after a Montenegro high court approved the extradition of Do Kwon, a top official has agreed with the ruling and eventually plans to extradite the Terraform Labs co-founder to the U.S., according to a report from The Wall Street Journal.","In \"closed-door discussions,\" Justice Minister Andrej Milovic said he plans to extradite Kwon to the U.S., the WSJ reported, citing anonymous sources. Kwon has been in a jail in Montenegro for months on charges of document forgery.","The extradition is sought for <a href=\"https:\/\/www.theblock.co\/post\/264599\/do-kwon-extradition-approved\" data-v-f87c67ca=\"\">charges related<\/a> to financial crimes. Kwon previously agreed to be extradited to South Korea, but Milovic was expected to make the final decision on which country would take precedence.","Milovic has not yet announced his decision and may wait for the country’s courts to rule on a last-ditch appeal by Kwon against the court ruling, the WSJ said.","The U.S. has made headlines in recent months first for prosecuting former FTX CEO Sam Bankman-Fried and then most recently charging Binance's Changpeng \"CZ\" Zhao for anti-money laundering and sanctions violations. Zhao pled guilty as Binance agreed to pay more than $4 billion in fines.","Kwon became the target of a worldwide search in late 2022 after global police body Interpol reportedly <a href=\"https:\/\/www.theblock.co\/post\/172739\/south-korea-says-interpol-has-issued-a-red-notice-for-do-kwon-bloomberg-says\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">issued<\/a> a so-called red notice for him as a result of the collapse of the two tokens he created, TerraUSD and Luna. The collapse of the tokens wiped out about $40 billion.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Andrej Milovic","content":"PERSON"},{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Kwon","content":"PERSON"},{"type":"Luna","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Interpol","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Milovic","content":"PERSON"},{"type":"Montenegro","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}