{"summary":"Uniswap DAO has expressed support for investing $12 million in a potential governance token of the Ekubo decentralized exchange.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/259922\/uniswap-dao-to-invest-12-million-of-uni-for-20-share-in-ekubos-future-governance-token","publishDate":"2023-10-29T09:40:53","id":12781,"type":null,"title":"Uniswap DAO temperature check shows support for investing $12 million of UNI for 20% share in Ekubo&#x27;s future governance token","category":["CRYPTO ECOSYSTEMS"],"content":["<em data-v-f87c67ca=\"\">Correction: An earlier version of this article said the proposal had passed a full vote when it was just a temperature check. The article has been updated to reflect this.<\/em>","The Uniswap DAO has express support in a temperature check for a proposal to invest 3 million UNI ($12 million) from its treasury into decentralized exchange Ekubo, in exchange for a 20% share of a potential governance token.","\"We at Ekubo, Inc. believe this is a vitally important step in the decentralization of Uniswap protocol development, effectively onboarding the Ekubo team as core developers,\" said Ekubo founder Moody Salem in <a href=\"https:\/\/gov.uniswap.org\/t\/temperature-check-invest-in-ekubo-protocol\/22146\" data-v-f87c67ca=\"\">the initial proposal<\/a>.","The <a href=\"https:\/\/snapshot.org\/#\/uniswap\/proposal\/0x738fbd583c272b91322c4fae5d692387001445069398ce52b7cdc5c9a16105d6\" data-v-f87c67ca=\"\">vote on Snapshot<\/a> has 21 million UNI tokens for and 12 million tokens against, meaning 63% of tokens that voted were in favor of the move. Five token holders compromised 97% of the vote in favor of the move. There were more than 3,500 votes in total.","Salem said he was a former engineer lead at Uniswap — and the fifth employee at the company — before starting Ekubo and that he contributed considerably to its codebase. Ekubo is a decentralized exchange on Starknet and has $2.5 million of value locked in its smart contracts, per <a href=\"https:\/\/defillama.com\/protocol\/ekubo\" data-v-f87c67ca=\"\">DefiLlama<\/a>.","If the proposal passes a proper vote, the 3 million tokens, which will be liquid, will be used to fund Ekubo's operations as well as contribution to the Uniswap protocol, Salem said. \"Much of the work will be to deliver public goods to the Starknet ecosystem, including standard token, governance, and incentives contracts written in Cairo, all of which are necessary to scale Starknet to the same level of usage as competing L2s,\" he added.","Salem said Ekubo will create a governance token within one month following the proposal passing, with 20% of its supply going to the Uniswap DAO's treasury. Ekubo will have control over the remaining tokens and any potential distribution. The token will be native to Starknet. The proposal will also require Uniswap's license to be updated, giving Ekubo a grant for unlimited use of Uniswap v4.","Behind the considerable number of votes against the proposal were many comments criticizing it in the discussion forum.","Doo Wan Nam, co-founder at StableLab, <a href=\"https:\/\/gov.uniswap.org\/t\/temperature-check-invest-in-ekubo-protocol\/22146\/2\" data-v-f87c67ca=\"\">noted<\/a>, \" If this proposal is passed, I think the Uniswap governance should seriously reflect on what is the role of governance and accountability.\"","Crypto market making firm Wintermute also said it <a href=\"https:\/\/gov.uniswap.org\/t\/temperature-check-invest-in-ekubo-protocol\/22146\/4\" data-v-f87c67ca=\"\">wouldn't support the proposal<\/a> due to the implied $60 million token valuation.","Keyrock, another market making firm, took issue with the quick turnaround of the proposal. \"We simply can’t justify allocating any sum of UNI that is to be sold on the market for a VC investment while there is no framework or committee conducting longer [due diligence] than 2-3weeks,\" it said.","<em data-v-f87c67ca=\"\">Disclaimer: Evgeny Gaevoy, the founder and CEO of Wintermute, sits on The Block's board of directors and is a shareholder.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"3 million","content":"MONEY"},{"type":"$12 million","content":"MONEY"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Salem","content":"PERSON"},{"type":"Doo Wan Nam","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"97%","content":"PERCENT"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Uniswap v4","content":"ORGANIZATION"},{"type":"63%","content":"PERCENT"},{"type":"Cairo","content":"LOCATION"},{"type":"Moody Salem","content":"ORGANIZATION"},{"type":"Evgeny Gaevoy","content":"PERSON"},{"type":"Uniswap DAO","content":"ORGANIZATION"},{"type":"Ekubo","content":"PERSON"},{"type":"Ekubo","content":"LOCATION"},{"type":"$60 million","content":"MONEY"},{"type":"Ekubo, Inc.","content":"ORGANIZATION"},{"type":"Ekubo","content":"ORGANIZATION"}],"hashtag":["DAOS","DEXS","GOVERNANCE VOTES","STARKNET","UNISWAP"],"authors":["Tim Copeland","The Block"]}