{"summary":"Amber Group said it reproduced the recent Wintermute hack by calculating the market maker&#x27;s private key.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174055\/amber-group-reproduces-wintermute-exploit-in-48-hours-using-an-apple-macbook","publishDate":"2022-09-30T12:00:44","id":12795,"type":null,"title":"Amber Group reproduces Wintermute exploit in 48 hours using an Apple MacBook","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">After conducting an investigation into the recent <\/span><a href=\"https:\/\/www.theblock.co\/post\/171135\/crypto-market-maker-wintermute-hacked-for-160-million\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$160 million exploit<\/span><\/a> of Wintermute<span data-v-f87c67ca=\"\">, digital assets firm Amber Group <a href=\"https:\/\/twitter.com\/ambergroup_io\/status\/1574779648357302272\" data-v-f87c67ca=\"\">said<\/a> it was able to repeat the full attack vector.<\/span>","<span data-v-f87c67ca=\"\">Amber said it recalculated the private key of the address that market-making firm Wintermute had used. It also <a href=\"https:\/\/etherscan.io\/tx\/0x2b64b221b1a9869fa08d09c5fe2236baee37332b473589f8f90f07ea2ccb2e6b\" data-v-f87c67ca=\"\">signed<\/a> a transaction from Wintermute's hacked address and <a href=\"https:\/\/twitter.com\/ambergroup_io\/status\/1574898240306413568\" data-v-f87c67ca=\"\">left<\/a> an on-chain message to prove its claim.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In its analysis of the hack, Amber said that it took the firm only two days to crack the private key with the help of a MacBook M1 computer. <\/span><span data-v-f87c67ca=\"\">To do this, the firm launched a brute force attack that extracted the seed phrase for Wintermute's address<\/span><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We have reproduced the recent Wintermute hack. Figured out the algorithm to build the exploit. We were able to reproduce the private key on a MacBook M1 with 16G memory in &lt;48h,” Amber Group <\/span><a href=\"https:\/\/twitter.com\/ambergroup_io\/status\/1574779648357302272\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted <\/span><\/a>&nbsp;i<span data-v-f87c67ca=\"\">n a tweet.<\/span>","<span data-v-f87c67ca=\"\">On Sept. 20, crypto market-making firm Wintermute was hacked for $160 million from its Ethereum vault. The vault relied on an admin address, which was targeted to extract the private key to move the funds.<\/span>","<span data-v-f87c67ca=\"\">Wintermute’s hacked admin account was a “vanity address,” a type of crypto address containing identifiable names or numbers within them — or which have a particular style — and can be generated using certain online tools including Profanity. Security analysts at 1inch <\/span><a href=\"https:\/\/www.theblock.co\/post\/170359\/1inch-claims-potential-exploit-on-profanity-generated-ethereum-addresses\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">found<\/span><\/a><span data-v-f87c67ca=\"\"> that private keys of vanity addresses generated with Profanity could be calculated by malicious hackers to steal funds.<\/span>","<span data-v-f87c67ca=\"\">Several days after the exploit of Wintermute, Amber decided to conduct its own investigation. The firm went on to determine that it too could extract the private key belonging to Wintermute’s vanity address and estimate the hardware and time requirements to crack the address generated by Profanity.<\/span>","<span data-v-f87c67ca=\"\">In its independent analysis, Amber explained that Profanity relied on a particular algorithm to generate large sets of public and private addresses that had certain desirable characters. The Profanity tool created millions of addresses per second and searched for the desired letters or digits that were requested by users as custom wallet addresses. Still, the process used to generate those addresses lacked randomness, and private keys could be reverse-calculated with GPUs.<\/span>","<span data-v-f87c67ca=\"\">“We figured out how Profanity divides the job on GPUs. Based on that, we can efficiently compute the private key of any public key generated by Profanity. We pre-compute a public key table, then do reverse computation until we find the public key in the table,” Amber Group said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"$160 million","content":"MONEY"},{"type":"Sept. 20","content":"DATE"},{"type":"Amber Group","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"MacBook","content":"ORGANIZATION"},{"type":"Amber","content":"ORGANIZATION"}],"hashtag":["WINTERMUTE"],"authors":["Vishal Chawla","The Block"]}