{"summary":"Walmart plans to &quot;reinvent retail&quot; by allowing customers to purchase physical versions of items they use within its House Flip virtual world.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252032\/walmart-metaverse-expansion","publishDate":"2023-09-20T08:00:16","id":12790,"type":null,"title":"Walmart plans to expand its commercial strategy in the metaverse","category":["METAVERSE"],"content":["Walmart plans to \"reinvent retail\" by allowing customers to purchase physical versions of items they use within its House Flip virtual world.","The retailer plans to add new décor items from Mainstays and Better Homes and Gardens into House Flip, to allow users to virtually browse and then purchase the physical version.","Speaking to <a href=\"https:\/\/venturebeat.com\/metaverse\/walmart-to-revolutionize-retail-with-expansive-commercial-strategy-in-the-metaverse\/\" data-v-f87c67ca=\"\">VentureBeat<\/a>, Walmart General Manager of Metaverse Commerce Thomas Kang said customers will be able to check out for both physical and virtual goods using their Walmart account without leaving the virtual environment. “We have a chance to reshape and reinvent retail in ways that are good for the customers,” Kang, a manager at Walmart's innovation arm, added in the interview.","Earlier this year, Walmart teamed up with game developer FUN-GI on House Flip, a mobile virtual environment available on iOS and Android that allows players to renovate and sell virtual homes.","Walmart has also entered the virtual fashion space with its Scoop clothing brand. According to the VentureBeat report, customers can outfit avatars with virtual clothing within Zepeto, Asia’s largest metaverse platform.","“We want to help companies and brands sell their products in virtual worlds,” Kang said. He added that Walmart will test more experiences in virtual worlds over the next year. “We see limitless potential with this emerging technology, and we’re excited to explore its possibilities.”","Kang also said that Walmart is considering giving customers a virtual item when they purchase physical items in-store. “We can use our physical locations as places to engage customers. For example, if you buy something physical, we may be able to give you something virtual for free.”","He added that Walmart wants these virtual shopping environments accessible via any device. He also stressed that virtual environments should align with Walmart's values and meet the needs of all its customers. “We believe in digital citizenship and want to make sure that we are creating safe spaces for everybody. We want to be leaders in trust and safety in that environment,” he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Zepeto","content":"LOCATION"},{"type":"House Flip","content":"ORGANIZATION"},{"type":"Kang","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Walmart","content":"ORGANIZATION"},{"type":"Walmart General Manager of Metaverse Commerce Thomas Kang","content":"ORGANIZATION"},{"type":"” Kang","content":"PERSON"},{"type":"Asia","content":"LOCATION"}],"hashtag":["VR"],"authors":["Brian McGleenon","The Block"]}