{"summary":"The enterprise-grade liquid staking protocol Liquid Collective has launched on Coinbase Prime and Bitcoin Suisse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/217705\/liquid-collective-launches-on-coinbase-prime-and-bitcoin-suisse","publishDate":"2023-03-07T12:06:12","id":12791,"type":null,"title":"Liquid Collective launches on Coinbase Prime and Bitcoin Suisse","category":["INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Software development company Alluvial launched Liquid Collective, an enterprise-grade liquid staking protocol, on Coinbase Prime and Bitcoin Suisse.<\/span>","<span data-v-f87c67ca=\"\">Customers of the institutional crypto platforms can access the liquid staking solution as of today, enabling them to stake ether, receiving the protocol’s liquid staking token <\/span><a href=\"https:\/\/etherscan.io\/token\/0x8c1bed5b9a0928467c9b1341da1d7bd5e10b6549\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">LsETH<\/span><\/a><span data-v-f87c67ca=\"\"> in return. LsETH trading will also be available on Coinbase in most jurisdictions, according to a statement from Alluvial.<\/span>","<span data-v-f87c67ca=\"\">Instead of weighing up the opportunity cost of simply locking tokens with direct ether staking, LsETH, like other liquid staking solutions, frees up that liquidity to be transferred, stored, traded and utilized in other DeFi protocols while still accruing staking rewards for helping to secure the Ethereum network. Holders will also be protected from slashing (seizure penalties from events like network outages and node operator failures) with a built-in coverage system in partnership with decentralized crypto insurance provider Nexus Mutual and supported by Liquid Collective’s <\/span><a href=\"https:\/\/liquidcollective.io\/#:~:text=What%20is%20the%20Protocol%20Service%20Fee%3F\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">service fee<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">“Currently, just over <\/span><a href=\"https:\/\/dune.com\/hildobby\/eth2-staking\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">14%<\/span><\/a><span data-v-f87c67ca=\"\"> of the entire Ethereum supply is being staked, but before more institutional investors can reasonably participate, those staking ether will need to be able to use it in other ways while still meeting their compliance requirements,” said Alluvial co-founder and CEO Matt Leisinger. “The launch of Liquid Collective will bridge that gap and meet the growing demand among institutional clients looking to participate in the security of the Ethereum network without sacrificing liquidity.”<\/span>","<span data-v-f87c67ca=\"\">Liquid Collective aims to provide a decentralized and non-custodial standard for enterprise-grade liquid staking, addressing the need for security and compliance while increasing liquidity and composability for the web3 economy.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"http:\/\/liquidcollective.io\/eth-liquid-staking-live\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">protocol<\/span><\/a><span data-v-f87c67ca=\"\"> takes an “API-first” approach, enabling integrators like Coinbase Prime and Bitcoin Suisse to offer their customers access to ether liquid staking via their own platforms.<\/span>","<span data-v-f87c67ca=\"\">“Liquid Collective is uniquely positioned to offer an enterprise-grade liquid staking product with robust slashing coverage and a forward-looking compliance approach to our institutional clients. We’re excited to support this new liquid staking standard as part of our multi-product strategy,” said Coinbase VP of Custody Aaron Schnarch.<\/span>","<span data-v-f87c67ca=\"\">All users minting LsETH through the Liquid Collective protocol, regardless of exchange, custodian or multi-wallet integrator used, will undergo know-your-customer (KYC) and anti-money laundering (AML) compliance checks before deposit and withdrawal, in partnership with the global compliance specialist Exiger.<\/span>","<span data-v-f87c67ca=\"\">“The AML and KYC-compliant solution by Liquid Collective enables us to provide higher capital efficiency and liquidity to our Swiss institutional clients. As the first Swiss-incorporated Liquid Collective integrator, Bitcoin Suisse is proud to participate in the further institutionalization of crypto-financial services in Switzerland for the benefit of the crypto ecosystem,” said Bitcoin Suisse Chief Product Officer Michael Gauckler.<\/span>","<span data-v-f87c67ca=\"\">Liquid Collective is powered by validator service providers such as Coinbase Cloud. Its Ethereum development was led by enterprise staking provider Kiln, with support from Alluvial.<\/span>","<span data-v-f87c67ca=\"\">Alluvial first <\/span><a href=\"https:\/\/www.theblock.co\/post\/171400\/kraken-joins-consortium-to-build-enterprise-grade-liquid-staking-protocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> Liquid Collective in September, built in collaboration with a diverse group of ecosystem participants, including Kraken, Coinbase, Figment, Staked, Kiln, Acala and Rome Blockchain Labs. Bitcoin Suisse <\/span><a href=\"https:\/\/www.theblock.co\/post\/206972\/bitcoin-suisse-to-offer-ethereum-liquid-staking-for-swiss-market-and-joins-liquid-collective\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">joined<\/span><\/a><span data-v-f87c67ca=\"\"> the project in January.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Rome Blockchain Labs","content":"ORGANIZATION"},{"type":"Nexus Mutual","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bitcoin Suisse","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Liquid Collective","content":"ORGANIZATION"},{"type":"Michael Gauckler","content":"PERSON"},{"type":"14%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"Alluvial","content":"ORGANIZATION"},{"type":"Coinbase VP of Custody Aaron Schnarch","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Coinbase Prime","content":"ORGANIZATION"},{"type":"Coinbase Cloud","content":"ORGANIZATION"},{"type":"Matt Leisinger","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["BITCOIN","COINBASE","ETHEREUM","LIDO FINANCE","STAKING","STAKING FIRMS"],"authors":["James Hunt","The Block"]}