{"summary":"FINRA granted Prometheum Ember Capital the ability to offer clearing and settlement services late on Wednesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268883\/prometheum-gets-the-go-ahead-from-finra-to-offer-digital-asset-securities-clearing-services","publishDate":"2023-12-21T11:52:14","id":12803,"type":null,"title":"Prometheum gets the go-ahead from FINRA to offer digital asset securities clearing services","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Financial Industry Regulatory Authority granted Prometheum Ember Capital the ability to offer clearing and settlement services in a move that is likely to rattle the crypto industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/245442\/republicans-wants-the-sec-to-hand-over-documents-on-prometheum-license\" data-v-f87c67ca=\"\">Prometheum<\/a>, a lesser-known digital asset firm, received approval from FINRA to allow for digital asset securities clearing and settlement services through its special purpose broker dealer license, which it obtained this past year from the Securities and Exchange Commission.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"We really feel that this transition of crypto to federally-regulated ecosystems is a major step forward for the industry as we still need a responsible way for the American public to participate in the digital asset space,\" said Aaron Kaplan, co-chief executive officer at Prometheum, in an interview with The Block.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prometheum said it plans to begin offering custodial services to institutional clients, including asset management firms and hedge funds by the first quarter of this coming year. Institutional and retail trading will launch shortly after, Kaplan said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prometheum's steps forward come as the SEC has consistently warned that crypto exchanges need to register with the agency. Over the past year, it's charged Coinbase, Binance and Kraken for allegedly operating as an unregistered exchange, broker, dealer and clearinghouse. Meanwhile, crypto firms have argued that it's not possible to register with the agency.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Prometheum itself has faced the ire of the industry, with probes coming from the Blockchain Association and Republican lawmakers. The Blockchain Association <a href=\"https:\/\/www.theblock.co\/post\/239239\/blockchain-association-demands-probe-into-sec-approval-of-prometheum\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">alleged<\/span><\/a> that the firm had a \"sweetheart deal\" with the SEC in July.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"We are concerned that the Commission granted Prometheum a 'sweetheart' deal in exchange for support of the Commission's policy goals, or that Prometheum is leveraging personal connections with the Commission to gain an unfair advantage in the market,\" according to a letter requesting the investigation.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry, R-N.C. also asked the SEC to <a href=\"https:\/\/www.theblock.co\/post\/245442\/republicans-wants-the-sec-to-hand-over-documents-on-prometheum-license\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">hand<\/span><\/a> over information while inquiring about documents in August related to a license issued to Prometheum.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Some Republican lawmakers, who have been critical of the SEC, say the timing of it all \"raise serious questions\" as they work on legislation to regulate crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">When asked on Thursday what message Kaplan has to those who say it's not possible to register with the SEC, he said working with the law instead of against it helps.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"By keeping your head down and working within the regulation and trying to work within the law as opposed to change the law, one can achieve success when properly registering under the securities law as evidenced by first the approval for the special purpose broker dealer and now the approval to clear and settle.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Prometheum","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"first quarter","content":"DATE"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}