{"summary":"Hong Kong police have arrested eight people on suspicion of conspiracy to defraud related to crypto exchange JPEX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251689\/hong-kong-police-receive-1600-complaints-involving-152-million-in-alleged-jpex-fraud","publishDate":"2023-09-19T06:46:16","id":12804,"type":null,"title":"Hong Kong police receive complaints involving $152 million in JPEX probe","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Hong Kong police have arrested eight people on suspicion of conspiracy to defraud related to cryptocurrency exchange JPEX, the police said in a <\/span><a href=\"https:\/\/www.youtube.com\/live\/g6SvAFURsFs?si=J541D_cnmpDiajlS\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">press briefing<\/span><\/a><span data-v-f87c67ca=\"\"> today.<\/span>","<span data-v-f87c67ca=\"\">As of Monday night local time, the police had received 1,641 complaints surrounding the JPEX case with claims that they failed to withdraw their holdings at the exchange. The amount of assets involved, according to the complaints, amounted to around HK$1.19 billion ($152 million), the police said.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">In a police force action dubbed “tieguan” or “iron gate,” the authorities raided 20 locations in the city and seized cash, jewelry, computers and phones worth about HK$8 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For arrested suspects, the police force froze around HK$15 million in their relevant bank accounts, as well as their properties worth about HK$44 million, according to the briefing. The police is also considering confiscation of more than HK$60 million in alleged criminal proceeds.<\/span>","<span data-v-f87c67ca=\"\">On Monday, <\/span><span data-v-f87c67ca=\"\">the police <\/span><a href=\"https:\/\/www.theblock.co\/post\/251374\/hong-kong-influencer-arrested-over-jpex-links-amid-probe-reports\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">arrested Joseph Lam, a crypto influencer and a former lawyer<\/span><\/a><span data-v-f87c67ca=\"\">, for his alleged association with JPEX.<\/span>","<span data-v-f87c67ca=\"\">The police’s probe into JPEX came after the Securities and Futures Commission <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/news-and-announcements\/news\/doc?refNo=23PR101\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">warned<\/span><\/a><span data-v-f87c67ca=\"\"> last week that crypto influencers and the trading platform have “made false or misleading statements on social media” to suggest that JPEX has applied for a virtual asset trading license in Hong Kong.<\/span>","<span data-v-f87c67ca=\"\">In response to the police action, JPEX <\/span><a href=\"https:\/\/blog.jp-ex.io\/en\/jpex-special-announcement-20230918\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said on Monday<\/span><\/a><span data-v-f87c67ca=\"\"> that it received “unfair treatment” from the authorities.<\/span>","<span data-v-f87c67ca=\"\">“When other cryptocurrency exchanges announced their entry into the Hong Kong market and began extensive promotion, JPEX was subjected to continuous unfair treatment,” the exchange said. “The SFC sent letters to all our partners, requesting the cessation of cooperation with the platform. On September 13, 2023, the SFC issued a statement against the JPEX cryptocurrency trading platform, causing third-party market makers partnered with the platform to maliciously freeze funds, leading to operational difficulties.”<\/span>","<span data-v-f87c67ca=\"\">JPEX <\/span><a href=\"https:\/\/blog.jp-ex.io\/en\/jpex-special-announcement-20230917\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said on Sunday<\/span><\/a><span data-v-f87c67ca=\"\"> that it has <\/span><a href=\"https:\/\/www.theblock.co\/post\/251358\/jpex-exchange-suspends-certain-operations-hikes-fees-amid-liquidity-crisis\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">suspended some operations and raised withdrawal fees<\/span><\/a><span data-v-f87c67ca=\"\"> following an ongoing liquidity crisis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In today's briefing, Elizabeth Wong, Director of Licensing and Head of Fintech Unit, Intermediaries of the SFC, said that the agency has listed JPEX as an unregistered company and suspicious website since July 2022.<\/span>","<span data-v-f87c67ca=\"\">Wong said that after Hong Kong’s crypto retail trading licensing regime took effect in June this year, all trading platforms with no intention to apply for a license must cease their operations in Hong Kong. Still, JPEX did not apply for a license or shut down operations.<\/span>","<span data-v-f87c67ca=\"\">Wang added that the SFC warned the public on Aug. 7 about the risks of unlicensed crypto exchanges, but “JPEX went from bad to worse,” so the SFC then, <\/span><a href=\"https:\/\/apps.sfc.hk\/edistributionWeb\/gateway\/EN\/news-and-announcements\/news\/doc?refNo=23PR101\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">on Sept. 13, named the exchange in a public statement<\/span><\/a><span data-v-f87c67ca=\"\"> and asked crypto influencers and over-the-counter money exchanges to stop promoting JPEX.<\/span>","<span data-v-f87c67ca=\"\">Vivian Lee, a superintendent of police of Hong Kong Police’s commercial crime bureau, said at the briefing that the SFC referred the case to the police last Thursday, and the authorities started to receive complaints about failing to withdraw assets from JPEX.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Lee added that JPEX’s token JPC cannot be traded on other major exchanges and thus comes with low liquidity. Under the condition that JPEX has a withdrawal limit of 1,000 USDT, the exchange even increased the transaction fee to 999 USDT, effectively restricting withdrawals, according to Lee.<\/span>","<span data-v-f87c67ca=\"\">Mak Wai-kwong, an acting chief inspector of the police’s commercial crime bureau, said that the police continue to carry out the probe and may arrest more suspects.<\/span>","<span data-v-f87c67ca=\"\">Unlike its neighboring Chinese mainland’s broader crackdown on cryptocurrency trading and mining, Hong Kong has rolled out the welcome mat for crypto firms this year — even going so far <\/span><a href=\"https:\/\/www.theblock.co\/post\/228743\/hong-kong-crypto-bank-accounts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as encouraging banks to work with them<\/span><\/a><span data-v-f87c67ca=\"\">. In October 2022, Hong Kong authorities released a series of <\/span><a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/31\/P2022103000454.htm?fontSize=1\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">policy statements<\/span><\/a><span data-v-f87c67ca=\"\"> about cryptocurrencies to strengthen its position as a global financial center.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In June, Hong Kong officially started its crypto retail trading licensing regime, allowing licensed exchanges to offer retail trading services. The SFC, however, has only granted a relatively small number of licenses so far.<\/span>","<span data-v-f87c67ca=\"\">Livio Weng, chief operating officer of HashKey, one of the exchanges that have obtained the retail trading license, told The Block today that the SFC has put out over-100-pages-long guidance for crypto exchanges on all sorts of requirements, including the protection of customer funds.<\/span>","<span data-v-f87c67ca=\"\">“We urge the general public [in Hong Kong] to choose licensed financial institutions for their investment activities whenever possible. This can effectively safeguard their asset security, especially for newcomers who lack experience in crypto investments,” Weng said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang added, “from an industry perspective, the most urgent task at hand is to expedite the licensing process, innovate mechanisms and empower licensed exchanges with competitiveness. This will help prevent the proliferation of subpar entities in the market and restore a healthy market order.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HK$1.19 billion ($152 million","content":"MONEY"},{"type":"last Thursday","content":"DATE"},{"type":"night local time","content":"TIME"},{"type":"Aug. 7","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"Mak Wai-kwong","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"Sept. 13","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"JPEX","content":"ORGANIZATION"},{"type":"HK$8 million","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"June this year","content":"DATE"},{"type":"HK$60 million","content":"MONEY"},{"type":"Elizabeth Wong","content":"PERSON"},{"type":"September 13, 2023","content":"DATE"},{"type":"HK$44 million","content":"MONEY"},{"type":"Joseph Lam","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"Wong","content":"PERSON"},{"type":"HK$15 million","content":"MONEY"},{"type":"JPC","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"},{"type":"Vivian Lee","content":"PERSON"}],"hashtag":["ASIAN REGULATION"],"authors":["Timmy Shen","The Block"]}