{"summary":"UK investment funds get the green light for tokenization, aiming to improve efficiency, transparency and competitiveness in the sector.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264603\/uk-investment-funds-get-green-light-for-tokenization","publishDate":"2023-11-24T08:37:23","id":12801,"type":null,"title":"UK investment funds get green light for tokenization","category":["COMPANIES"],"content":["UK investment funds have been given the approval for tokenization, with the country’s government keen to leverage blockchain technology for the asset management industry, according to trade body The Investment Association.","Fund tokenization has the potential to improve efficiency, transparency and international competitiveness in the investment management sector, The Investment Association said in a <a href=\"https:\/\/www.theia.org\/news\/press-releases\/uk-funds-given-green-light-tokenisation-development\" data-v-f87c67ca=\"\">statement<\/a>.","The initial stage, in collaboration with the UK Treasury, financial regulator the Financial Conduct Authority (FCA) and investment managers like BlackRock, was published today as part of the Technology Working Group of the Government's Asset Management Taskforce roadmap. The “UK Fund Tokenisation — A Blueprint for Implementation” <a href=\"https:\/\/www.theia.org\/sites\/default\/files\/2023-11\/UK%20Fund%20Tokenisation%20-%20A%20Blueprint%20for%20Implementation.pdf\" data-v-f87c67ca=\"\">report<\/a> outlines a baseline model for tokenization that is designed to work within the existing legal and regulatory framework, which firms can implement straight away.","The model allows FCA-authorized funds to adopt tokenization for sales and redemption transactions, provided they meet specific criteria, such as investment portfolios only comprising mainstream investment assets and maintaining conventional valuation and settlement processes.","“Fund tokenization has great potential to revolutionize how our industry operates, by enabling greater efficiency and liquidity, enhanced risk management and the creation of more bespoke portfolios,” Michelle Scrimgeour, Chair of the Working Group and Chief Executive Officer at Legal &amp; General Investment Management, said. “It is vital the UK remains at the forefront of technological development.”","“We welcome the report today which identifies a way forward for tokenization and has concluded that there are no significant regulatory barriers to the adoption of the proposed baseline model,” Sarah Pritchard, Executive Director, Markets and Executive Director, International at the FCA added.","The news follows an <a href=\"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector\" data-v-f87c67ca=\"\">announcement<\/a> from UK Finance Minister Jeremy Hunt earlier this week, outlining legislation to expand the country’s digital assets sector via its Digital Securities Sandbox initiative.","The Digital Securities Sandbox aims to facilitate the adoption of digital assets across financial markets and is expected to begin in Q1, 2024. It differs from the FCA’s <a href=\"https:\/\/www.fca.org.uk\/news\/news-stories\/launch-permanent-digital-sandbox\" data-v-f87c67ca=\"\">Digital Sandbox<\/a>, launched in August, which aims to support firms in the early stages of digital product development.","In June, UK Prime Minister Rishi Sunak expressed a desire to provide regulatory clarity regarding how crypto businesses should register and operate in the UK, <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">announcing<\/a> plans to turn the country into a web3 hub.","The UK is not the only country seeking to advance the tokenization of funds, with JPMorgan <a href=\"https:\/\/www.theblock.co\/post\/263109\/jpmorgan-apollo-axelar-oasis-pro-provenance-blockchain-interoperability\" data-v-f87c67ca=\"\">teaming up<\/a> with asset managers and crypto projects, including WisdomTree, Apollo, Avalanche, LayerZero Labs and Axelar on a blockchain interoperability proof-of-concept for investment-portfolio management last week.","The collaboration, under the Monetary Authority of Singapore’s <a href=\"https:\/\/www.theblock.co\/post\/236361\/singapores-mas-sets-out-framework-for-responsible-digital-asset-ecosystem\" data-v-f87c67ca=\"\">Project Guardian<\/a> initiative, is designed to enable fund managers to tokenize, purchase and rebalance real-world asset positions across multiple blockchains.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Jeremy Hunt","content":"PERSON"},{"type":"FCA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Sarah Pritchard","content":"PERSON"},{"type":"The Investment Association","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Legal &amp; General Investment Management","content":"ORGANIZATION"},{"type":"UK Finance","content":"ORGANIZATION"},{"type":"Digital Securities Sandbox","content":"ORGANIZATION"},{"type":"Technology Working Group of the Government's Asset Management Taskforce","content":"ORGANIZATION"},{"type":"Michelle Scrimgeour","content":"PERSON"},{"type":"Monetary Authority of Singapore’s <a href=\"https:\/\/www.theblock.co\/post\/236361\/singapores-mas-sets-out-framework-for-responsible-digital-asset-ecosystem\" data-v-f87c67ca=\"\">Project Guardian","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"Working Group","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"LayerZero Labs","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"UK Treasury","content":"ORGANIZATION"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"}],"hashtag":["INVESTMENT FIRMS","UK PARLIAMENT"],"authors":["James Hunt","The Block"]}