{"summary":"The U.S. Securities and Exchange Commission (SEC) has deleted its proposed definition of &quot;digital assets&quot; from the final Form PF rules.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229489\/sec-gary-gensler-digital-assets-definition","publishDate":"2023-05-04T08:25:02","id":12806,"type":null,"title":"SEC removes definition of &#x27;digital assets&#x27; from final hedge fund rules","category":["POLICY"],"content":["The U.S. Securities and Exchange Commission (SEC) has deleted its once-proposed definition of \"digital assets\" from its final hedge fund reporting rules.","\"We proposed adding 'digital assets' as a new term to the Form PF Glossary of Terms. The Commission and staff are continuing to consider this term and are not adopting 'digital assets' as part of this rule at this time,\" <a href=\"https:\/\/www.sec.gov\/rules\/final\/2023\/ia-6297.pdf\" data-v-f87c67ca=\"\">the SEC said Wednesday<\/a> in its final Form PF rules document.","Form PF (private fund) rules pertain to investment advisers who manage private funds with assets over a certain threshold. Under these rules, investment advisers must regularly provide detailed information about their funds to the SEC, including the types of assets held, leverage employed and the counterparty credit risk of each fund. The aim of the rules is to help the SEC monitor potential risks to the financial system posed by large private funds.","<a href=\"https:\/\/www.sec.gov\/rules\/proposed\/2022\/ia-6083.pdf\" data-v-f87c67ca=\"\">The SEC had initially included the proposed definition of digital assets<\/a> in its draft hedge fund reporting rules in August last year but has now stepped back. The definition was: \"An asset that is issued and\/or transferred using distributed ledger or blockchain technology ('distributed ledger technology'), including, but not limited to, so-called 'virtual currencies,' 'coins,' and 'tokens.'\"","If the definition of digital assets had been included, it would have marked the SEC's initial official statement of what digital assets actually entail. <a href=\"https:\/\/www.theblock.co\/post\/226344\/sec-poised-to-increase-scrutiny-of-defi?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Notably, last month, the SEC said it would revisit its definition of an \"exchange\" to possibly include decentralized finance (DeFi).<\/a>","\"Make no mistake: many crypto trading platforms already come under the current definition of an exchange and thus have an existing duty to comply with the securities laws,\" SEC Chairman Gary Gensler said at the time. \"Yet these platforms are acting as if they have a choice to comply with our laws. They don't.\"","The SEC, under Gensler's leadership, has been actively pursuing legal action against crypto companies. <a href=\"https:\/\/www.theblock.co\/post\/226648\/sec-lawsuit-bittrex-crypto\" data-v-f87c67ca=\"\">The agency filed a lawsuit against Bittrex last month<\/a>, alleging it was operating as an \"unregistered national securities exchange, broker, and clearing agency.\" <a href=\"https:\/\/www.theblock.co\/post\/222427\/what-comes-next-after-coinbases-wells-notice\" data-v-f87c67ca=\"\">In March, the SEC issued Coinbase a Wells Notice<\/a> regarding aspects of its exchange, staking service Coinbase Earn and Coinbase Wallet.","<a href=\"https:\/\/www.theblock.co\/post\/228047\/coinbase-sues-the-sec-for-answer-on-rule-specific-to-digital-assets\" data-v-f87c67ca=\"\">Coinbase then sued the SEC<\/a> in order to force the agency to respond to a petition that the company filed demanding the SEC publish specific rules for digital assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"August last year","content":"DATE"}],"hashtag":["SEC"],"authors":["Yogita Khatri","The Block"]}