{"summary":"NFT holders left disappointed by the Elementals sale have dumped their Azukis, pushing the floor price even lower.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237484\/azuki-floor-price-crumbles-with-holders-down-21500-per-nft","publishDate":"2023-07-03T07:02:12","id":12814,"type":null,"title":"Azuki floor price crumbles, with holders down $21,500 per NFT","category":["METAVERSE & NFT"],"content":["NFT project Azuki’s floor price has crumbled since its <a href=\"https:\/\/www.theblock.co\/post\/236681\/azuki-nft-collections-ends-elemental-mint-with-37-5-million-before-it-was-ever-open-to-the-public?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Elementals NFT sale<\/a>, with holders down around $21,500 per NFT.","The floor price of the main Azuki NFT collection — the lowest available price in the collection — has fallen from 17 ether ($33,300) to 6 ether ($11,800), according to OpenSea <a href=\"https:\/\/opensea.io\/collection\/azuki\/activity\" data-v-f87c67ca=\"\">data<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">An increase in sales has pushed the Azuki floor price lower following the Elementals sale. Image: OpenSea.<\/span>","The Elementals collection, which was only sold to Azuki NFT holders because they scooped them all up before the public sale, is faring badly too. These NFTs were sold with a starting price of 2 ether, which would drop over time during the dutch auction. Yet following the sale they opened with a floor price of just 1.6 ether ($3,100) — which has now fallen to 0.84 ether ($1,600).","As a result, NFT holders are down around 11 ether ($21,600) for each of their main NFTs and 1.15 ether ($2,250) for each NFT they bought in the recent sale. Unsurprisingly, the community has been quite frustrated.","“The whales and OG made their disappointment very clear to the team, just not going public to vent their frustration. Lots of these convo happen in private DM,” <a href=\"https:\/\/twitter.com\/Arthur_0x\/status\/1675003447358414848\" data-v-f87c67ca=\"\">said<\/a> DeFiance Capital founder Arthur Cheong on Twitter. “Lots of whales made it clear that this is the last chance they have to make it right.”","Cheong, who repped an Azuki as his Twitter profile picture for a long time, is now selling his collection of four rare NFTs. He had spent 127 ether ($250,000) on the collection.","Following the Elementals sale, there was a <a href=\"https:\/\/www.theblock.co\/post\/237081\/long-term-azuki-holders-selling-jumps-817-after-elemental-drop-nansen?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">big increase<\/a> in sales. There were 1,335 NFT transactions on June 27 alone, resulting in 14,800 ether ($29 million) of trading volume, according to Nansen.","<span data-v-f87c67ca=\"\">There was a huge increase in transaction volume as the Azuki floor price crashed. Image: Nansen.<\/span>","While the Azuki project raked in $37.5 million from the Elementals sale, it has also continued to rake in royalties on sales of the collection on secondary NFT marketplaces. The project has brought in 17,340 ether ($34 million) in all-time royalties, according to Nansen.","While these royalties were largely from OpenSea, they now come in primarily through Blur. That said, the effective royalty rate dropped toward the end of 2022 and royalties have considerably decreased in volume.","Azuki, however, isn’t laughing all the way to the bank. The project has <a href=\"https:\/\/www.theblock.co\/post\/236923\/azuki-elementals-nft?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">acknowledged<\/a> that it missed the mark on the Elementals sale and said that it wants to make things right.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1,600","content":"MONEY"},{"type":"$250,000","content":"MONEY"},{"type":"$34 million","content":"MONEY"},{"type":"$33,300","content":"MONEY"},{"type":"$3,100","content":"MONEY"},{"type":"DeFiance Capital","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Elementals NFT","content":"ORGANIZATION"},{"type":"$29 million","content":"MONEY"},{"type":"Azuki NFT","content":"ORGANIZATION"},{"type":"$37.5 million","content":"MONEY"},{"type":"Azuki","content":"LOCATION"},{"type":"OG","content":"ORGANIZATION"},{"type":"$21,500","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$21,600","content":"MONEY"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"$2,250","content":"MONEY"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"$11,800","content":"MONEY"},{"type":"June 27","content":"DATE"}],"hashtag":["AZUKI"],"authors":["Tim Copeland","The Block"]}