{"summary":"The first block trade of a ETH\/BTC futures contract was executed on CME Group, according to trading firm Cumberland. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242308\/cumberland-xbto-group-execute-first-block-trade-of-eth-btc-contract-on-cme-group","publishDate":"2023-07-31T13:00:31","id":12815,"type":null,"title":"Cumberland, XBTO execute first ETH\/BTC contract block trade on CME","category":["EXCHANGES"],"content":["The first block trade of an <a href=\"https:\/\/www.theblock.co\/post\/241738\/higher-tech-stocks-benefit-ether-more-than-bitcoin-cme-group-says\" data-v-f87c67ca=\"\">ETH\/BTC<\/a> futures contract was executed on CME Group, according to trading firm Cumberland.&nbsp;","While the crypto market has seen spot trading activity stuck in the doldrums, liquidity is stabilizing on futures and options markets with new flows and products. CME Group is already home to a wide-range of crypto derivatives, including its flagship bitcoin futures and options products.&nbsp;","As for the new ETH\/BTC contract, it will provide traders with a way to express a view on the value of bitcoin versus the Ethereum ecosystem as a store of value, Cumberland noted. Its counterparty in the block trade was crypto firm XBTO Group.&nbsp;","\"This contract allows institutional market participants to express these views without worrying about custody nor margin on unregulated exchanges,\" the firm <a href=\"https:\/\/twitter.com\/CumberlandSays\/status\/1686032982899924992?s=20\" data-v-f87c67ca=\"\">said<\/a>. \"This is yet another step forward in the maturation of the crypto derivatives market – becoming more sophisticated in structure, thereby fulfilling a need of its user base.\"","The bitcoin futures and options market has been more robust this quarter as traders opt for markets with more federal oversight as well as bilateral arrangements with sophisticated counterparties. Trading volumes for CME bitcoin futures contract hit a monthly high for the year this month, clocking in at $55.78 billion for July, according to The Block's data dashboard.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/average-daily-volume-of-cme-bitcoin-futures-monthly\/embed\" title=\"Volume and OI of CME Bitcoin futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"XBTO Group","content":"ORGANIZATION"},{"type":"$55.78 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"July","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}