{"summary":"After a two-year wait, the Flare token airdrop has finally happened with 4.28 billion flr tokens released to recipients today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200258\/flare-token-airdrop-finally-happens-after-two-year-wait","publishDate":"2023-01-09T19:00:46","id":12813,"type":null,"title":"Flare token airdrop finally happens after two-year wait","category":["CRYPTO ECOSYSTEMS"],"content":["The Flare token airdrop finally happened after a two-year wait, with billions of tokens distributed to millions of recipients on Monday.","Originally scheduled for distribution in 2020, the airdrop occurred at 6:59 p.m. EST on Monday. The token distribution saw 4.28 billion flr tokens — Flare’s native coin — shared among qualified recipients who were selected based on a snapshot taken in December 2020 that captured wallets holding at least 1 xrp at the time.","The 4.28 billion flr airdropped to users constitutes the initial airdrop for the project and amount to 15% of the project’s total supply. The remaining 85% will be distributed over the next three years, Flare stated in an announcement on Monday. This secondary phased distribution will proceed based on a community <a href=\"https:\/\/flare.network\/fip01\/\" data-v-f87c67ca=\"\">vote<\/a> within the Flare network community.","Holders of the flr tokens from today’s airdrop will be able to vote on the governance proposal for the secondary distribution. To do so, they will have to wrap their flr tokens.","While today’s airdrop marks the official flr token distribution, users have been able to trade the coin on exchanges like Bitrue and Poloniex using an IOU token.","Flare started out as a project that aimed to create a DeFi eocsystem for Ripple, which is why the airdrop was linked to xrp. The project has since been modified over the last two years and now aims to provide smart contract solutions for blockchains that lack the capability to operate with smart contracts.","The Flare blockchain is a Layer 1 network that encompasses data acquisition protocols and an oracle service, with its Time Series Oracle providing highly decentralized prices and data feeds to crypto apps without the need for centralized data providers. Flare says its oracle service has about 100 independent data providers that deliver reliable data every three minutes.","“Flare’s objective is to enable developers to build applications that securely access more data,” Flare Co-founder and CEO Hugo Philion said in the announcement. “This could enable new use cases to be built, such as triggering a Flare smart contract action with a payment made on another chain, or with input from an internet\/web2 API.”","The project <a href=\"https:\/\/www.theblock.co\/post\/107564\/smart-contract-platform-flare-raises-11-3-million-in-a-funding-round\" data-v-f87c67ca=\"\">raised $11.3 million<\/a> in a June 2021 funding round led by Hong Kong blockchain outfit Kenetic Capital. The likes of Digital Currency Group and Coinfund also participated in the capital raise.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinfund","content":"ORGANIZATION"},{"type":"June 2021","content":"DATE"},{"type":"Time Series Oracle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"85%","content":"PERCENT"},{"type":"last two years","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"December 2020","content":"DATE"},{"type":"6:59 p.m. EST","content":"TIME"},{"type":"Monday","content":"DATE"},{"type":"Hugo Philion","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"4.28 billion","content":"MONEY"},{"type":"Bitrue","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"$11.3 million","content":"MONEY"}],"hashtag":["DEVELOPER TOOLS","SMART CONTRACTS"],"authors":["Osato Avan-Nomayo","The Block"]}