{"summary":"Voyager is extending the timeline of its bidding and potential restructuring processes with a new final sale date of September 6.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/165996\/voyager-extends-deadline-for-bids-to-september-6","publishDate":"2022-08-26T15:46:54","id":12816,"type":null,"title":"Voyager extends deadline for bids to September 6","category":["LEGAL"],"content":["Voyager is extending the timeline for its bidding and restructuring processes, the firm said in a <a href=\"https:\/\/www.investvoyager.com\/blog\/claims-process-crypto-next-steps\/\" data-v-f87c67ca=\"\">blog post<\/a> this week.","Originally, bids were to be submitted by today with a sale hearing slated for September 8. Now, the firm says it's moved the deadline to September 6 at noon EST with a sale hearing to take place on September 29.","\"Separately, since the establishment of a bid deadline for Voyager, existing and potentially new bidders have requested additional time to get information and submit their offers,\" said the firm.","Bids may take a variety of forms, from simply offering to purchase the firm's assets to proposing a restructuring plan or even offering assistance in the reorganization. When all the bids are in, Voyager counsel will examine which proposals provide the most value for customers and creditors, though the proposals may range considerably in what they offer, from a dollar amount to level of assistance in the reorganization.","Bidders are kept confidential during the process, with approved parties signing confidentiality agreements and the court-approved bidding procedures stipulating, \"there must be no communications between and amongst Acceptable Bidders, unless the Debtors, after consultation with the Committee, have previously authorized such communication in writing.\" However, FTX and its sister firm Alameda caused a stir when it publicized its <a href=\"https:\/\/www.theblock.co\/post\/159209\/ftx-alameda-propose-early-liquidity-plan-for-voyager-digital-customers\" data-v-f87c67ca=\"\">offer<\/a> two weeks after Voyager declared bankruptcy. Though the bidding procedures were not yet finalized, the move put the firms at odds with Voyager's counsel, who <a href=\"https:\/\/www.theblock.co\/post\/159387\/voyager-document-says-ftx-alameda-proposal-has-misleading-or-outright-false-claims\" data-v-f87c67ca=\"\">said<\/a> that FTX had submitted a lowball offer and by publicizing it the firm had failed to respect the bidding process.","FTX's Sam Bankman-Fried has touted the offer as a means of providing early liquidity and a way for customers to receive a portion of their assets without a longer and more expensive bankruptcy process.","\"The goal of our joint proposal is to help establish a better way to resolve an insolvent crypto business – a way that allows customers to obtain early liquidity and reclaim a portion of their assets without forcing them to speculate on bankruptcy outcomes and take one-sided risks,\" he said in a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-proposes-joint-plan-to-offer-early-liquidity-to-voyager-digitals-customers-in-bankruptcy-proceeding-301591902.html\" data-v-f87c67ca=\"\">statement<\/a> in late July when FTX and Alameda announced their bid.","Because of FTX's public statements, counsel said in a recent hearing presentation, some companies had expressed concerns that FTX had a leg up in the process, discouraging them from bidding. Counsel sought to dispel that notion, saying it had already received bids \"that are higher and better than AlamedaFTX's proposal.\" Counsel also sent a cease and desist letter to the firm regarding its public statements, saying its tweets, press releases, and a TV interview were inaccurate. FTX did not immediately respond to request for comment.","Voyager <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">entered<\/a> Chapter 11 bankruptcy proceedings in July after halting activity on its platform. As of August 4, Voyager counsel said 22 parties were in meaningful discussions to place bids and that multiple offers had been received.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 8","content":"DATE"},{"type":"EST","content":"ORGANIZATION"},{"type":"September 6","content":"DATE"},{"type":"August 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Committee","content":"ORGANIZATION"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"September 29","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}