{"summary":"It&#x27;s the second highly-public call for an investigation related to Prometheum, a company that recently received approval from the SEC for a special purpose broker dealer, this week.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239239\/blockchain-association-demands-probe-into-sec-approval-of-prometheum","publishDate":"2023-07-12T13:43:17","id":12821,"type":null,"title":"Blockchain Association demands probe into SEC approval of Prometheum","category":["COMPANIES"],"content":["Crypto industry advocates continue to try to turn up the heat on Prometheum, a previously little-known digital asset firm, after its co-CEO argued in congressional testimony that existing securities laws are sufficient for governing the sector in the U.S.","The Blockchain Association, an industry group that includes Circle, Kraken and Digital Currency Group among its members, asked the inspector general of the Securities and Exchange Commission to investigate the agency’s granting of a special purpose broker dealer license to Prometheum. The startup received the license in May, approximately a month before executive Aaron Kaplan testified on digital assets policy before the House Financial Services Committee in mid-June, when he said that new crypto-specific rules were not necessary.","“Although the licensure itself may not raise ethics concerns, the facts surrounding it are concerning,” the letter <a href=\"https:\/\/theblockchainassociation.org\/wp-content\/uploads\/2023\/07\/BA-SEC-OIG-Letter-Re-Prometheum-2023-07-12.pdf\" data-v-f87c67ca=\"\">reads.<\/a>","The group complains that Prometheum was granted a special purpose broker dealer license, which also must be approved by the securities industry's self-regulatory organization FINRA, despite other applications by crypto firms being rejected. The Blockchain Association also alleges that Prometheum's broker-dealer and alternative trading system violate regulatory guidance to separate those functions, a stated concern of the SEC in its cases against Coinbase and Binance.","“We are concerned that the Commission granted Prometheum a ‘sweetheart’ deal in exchange for support of the Commission’s policy goals, or that Prometheum is leveraging personal connections with the Commission to gain an unfair advantage in the market,” a letter requesting the investigation, sent on Wednesday, reads.","The group does not provide direct evidence of a connection between Kaplan’s congressional appearance and the approval beyond timing of the two. Kaplan had previously advocated for applying existing securities laws to digital assets before the SEC granted Prometheum the license. Prometheum has yet to begin listing assets for trades, another detail cited in the letter.","The demand for the SEC's internal but independent watchdog to investigate the matter echoes a <a href=\"https:\/\/www.theblock.co\/post\/238718\/republican-lawmakers-ask-justice-department-sec-to-investigate-prometheum\" data-v-f87c67ca=\"\">similar request<\/a> from a handful of congressional Republicans made yesterday for a criminal and civil investigation's into Prometheum and Kaplan.&nbsp;","The trade group also singles out SEC Chair Gary Gensler, a lightning rod for the digital asset industry.","“Most significantly, we are concerned that Chair Gensler is using Prometheum and the SPBD licensure process as a means to thwart congressional efforts toward legislation by continuing to spread the false narrative that the law is already clear with regard to digital asset securities,” the letter continues. “The industry is waiting for answers and we urge your office to open an investigation to either uncover any impropriety or confirm that these inferences bear no weight.”","The SEC remains undefeated in over 100 enforcement cases involving crypto, as it has applied existing securities laws to digital assets since the 2017 initial coin offering boom, though many of those cases are settled before a judge can make a ruling. A summary judgement in a major enforcement case brought by the SEC against digital asset firm Ripple over its XRP token is expected soon.","Asked about the association’s letter during a press availability on Wednesday, Gensler declined to comment.","<em data-v-f87c67ca=\"\">Sarah Wynn contributed to this report. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Prometheum","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"Sarah Wynn","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["CONGRESS","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"],"authors":["Colin Wilhelm","The Block"]}