{"summary":"It has been 200 days since Ethereum transitioned from proof-of-work to proof of stake, and the total supply of ether has decreased significantly.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224471\/ethereum-merge-200-days-later","publishDate":"2023-04-03T04:58:04","id":12828,"type":null,"title":"Ethereum, 200 days after The Merge: $4 billion in ether not added to supply","category":["LAYER 1S"],"content":["Exactly 200 days after Ethereum switched from the energy-intensive proof-of-work consensus mechanism to proof of stake, the impact of the network's tokenomics change have been made clear.","When The Merge took place it lowered the amount of rewards given to those running the network. Combined with the previously introduced burning mechanism — that burns a portion of fees generated through transactions — this has had the effect of reducing the supply of ether.","Since The Merge, the total supply of ether decreased by 75,000 ($134.5 million), representing an annual decrease of 0.114%. For comparison, were <a href=\"https:\/\/www.theblock.co\/post\/177704\/five-key-ways-the-merge-affected-the-ethereum-blockchain\" data-v-f87c67ca=\"\">The Merge<\/a> never to happen, the total supply of ether would have increased by 2.2 million — worth more than $4 billion at current prices.","<span data-v-f87c67ca=\"\">The total supply of ether has decreased steadily over recent months. Source: ultrasound.money<\/span>","With The Merge, however, came the temporary inability to unstake staked ether — an action that will become available shortly when Ethereum's Shanghai upgrade is <a href=\"https:\/\/www.theblock.co\/post\/215604\/ethereum-takes-step-closer-to-shanghai-capella-with-deployment-on-sepolia-testnet\" data-v-f87c67ca=\"\">implemented<\/a> on April 12.","Shanghai will allow those who staked ether to withdraw their staked coins — but not all at once — and staking pools will be able to determine when they release the rewards.","Coinbase, for example, stated that it would begin accepting unstaking requests 24 hours after Shanghai completes. However, the exchange also <a href=\"https:\/\/twitter.com\/coinbase\/status\/1636047283245531141\" data-v-f87c67ca=\"\">noted<\/a> that \"demand for unstaking will be high soon after the upgrade and it may take the protocol weeks to months to process unstaking requests.\"","Ether staking behemoth Lido Finance <a href=\"https:\/\/twitter.com\/LidoFinance\/status\/1635739580136652825\" data-v-f87c67ca=\"\">shared<\/a> its expectations that stETH withdrawals won't launch on the mainnet until around mid-May — after code audits are complete and a two-week safety margin has been observed.","The potentially lengthy wait times are primarily due to technical on-chain limitations. Only 16 partial withdrawal requests — which comprise only staking rewards — can be processed every approximately 12 seconds. Because of this, the queue to withdraw when Shanghai goes live may become lengthy.&nbsp;Full withdrawals — when a validator completely removes itself from the Ethereum blockchain — may also take a relatively long time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lido Finance","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"mid-May","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$134.5 million","content":"MONEY"},{"type":"0.114%","content":"PERCENT"},{"type":"April 12","content":"DATE"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Adam James","The Block"]}