{"summary":"EigenLayer plans to adopt a shared security model that will allow over ETH re-stakes to be simultaneously used for all network services.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273732\/eigenlayer-plans-shared-security-model-for-dapps","publishDate":"2024-01-22T12:24:30","id":12831,"type":null,"title":"EigenLayer plans shared security model for dapps","category":["CRYPTO ECOSYSTEMS"],"content":["Re-staking protocol EigenLayer plans to adopt a \"shared security\" system, a mechanism allowing protocols to join the network by leveraging a common pool of ETH stakes.","EigenLayer offers a protocol for users to deposit and \"re-stake\" ether from various liquid staking tokens, aiming to allocate those funds to secure third-party networks. The project's first stage was <a href=\"https:\/\/www.theblock.co\/post\/234627\/eigenlayer-goes-live-on-ethereum-with-initial-17-million-deposit-limit\" data-v-f87c67ca=\"\">released<\/a> on the Ethereum mainnet in June 2023.","In the future, the team intends to nudge the project into a major decentralized application platform and enable other projects to launch, leveraging the so-called shared security.","That version will enable the amount of ETH re-stakes on EigenLayer — currently <a href=\"https:\/\/defillama.com\/protocol\/eigenlayer\" data-v-f87c67ca=\"\">over $1.7 billion<\/a> — to be supplied to all services developed on the network simultaneously for the sake of a common security mechanism. This would make it economically unviable for an attacker to take down any given protocol.","“You need $1 billion capital as an attacker to go and attack any one service, and there is a certain rigidity, a certain hardening of security when you pool security together,” EigenLayer founder Sreeram Kannan noted.","Such shared security models have previously been introduced by projects like <a href=\"https:\/\/wiki.polkadot.network\/docs\/polkadot-v1\" data-v-f87c67ca=\"\">Polkadot<\/a>, although the mechanisms differ vastly.","Polkadot is an ecosystem of blockchains secured by a relay chain and native token called DOT, whereas EigenLayer will empower ETH stakers and those holding ETH <a href=\"https:\/\/www.theblock.co\/post\/268312\/eigenlayer-deposits-increased-lst-caps\" data-v-f87c67ca=\"\">liquid staking tokens<\/a> (LSTs) to re-stake those assets in order to economically secure blockchains or services that don’t necessarily run on Ethereum.","EigenLayer will also let ETH stakers opt in to subject their ETH to additional slashing risk for securing Ethereum ecosystem services such as rollups, oracles, <a href=\"https:\/\/www.theblock.co\/post\/250483\/eigenlabs-gears-up-to-launch-upcoming-data-availability-solution\" data-v-f87c67ca=\"\">data availability<\/a> platforms, or similar services. In return, these stakers&nbsp; (or re-stakers) earn yield from those services.","Projects built on top of the framework could buy insurance for a subset of the overall network stake, EigenLayer said. This insurance will function as a safety net that, in the unlikely event the network fails to secure the project, would enable it to receive a certain amount of funds. The payouts would theoretically come from the staked ETH that may be slashed if those stakes are removed. EigenLayer refers to this as “attributable shared security.”","According to EigenLayer, the chance of such slashing is minimal and is only intended as a guarantee of provisioning economic security for protocols built top of the platform.","EigenLabs — the team behind EigenLayer — <a href=\"https:\/\/www.theblock.co\/post\/222901\/eigenlayer-series-a\" data-v-f87c67ca=\"\">closed a $50 million<\/a> Series A funding round led by Blockchain Capital in March 2023. The total amount of value in EigenLayer’s smart contracts recently reached $1.7 billion.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"EigenLayer","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"June 2023","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE","PROTOCOLS","SMART CONTRACTS","STAKING"],"authors":["Vishal Chawla","The Block"]}