{"summary":"&quot;We are what Vanguard would be like if it were decentralized,&quot; commented Alongside co-founder Austin Diamond.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260708\/a16z-backed-crypto-index-platform-moves-on-chain-with-v2-launch","publishDate":"2023-11-02T13:00:03","id":12832,"type":null,"title":"A16z-backed crypto index platform moves on-chain with v2 launch","category":["COMPANIES"],"content":["Jack Bogle revolutionized the stock trading world by providing a low-cost index fund option for individual investors. Now, half a century after Vanguard's inception, a startup backed by a16z aims to disrupt the world of cryptocurrency investments using blockchain technology.","Alongside, which provides cryptocurrency investors with exposure to a basket of the top 15 cryptocurrencies through a single token, announced on Thursday the launch of its V2, which will fully migrate the product onto the blockchain.","\"We are what Vanguard would be like if it were decentralized,\" commented Alongside co-founder Austin Diamond.","It might seem ambitious for a startup that has raised just $11 million from investors such as Coinbase, asset management firm Franklin Templeton, and the previously mentioned San Francisco-based firm on Market Street.","Nevertheless, the company is optimistic that its V2 release will attract cryptocurrency investors seeking a more decentralized approach to investing in a wide range of tokens. Of course, the market already offers various basket indexes, including options such as the 21Shares Crypto Basket Index ETP and the Bitwise 10 Crypto Index Fund.","Through V2 of AMKT, Alongside will offer traders a means to acquire the top 15 cryptocurrency assets using a structure that reduces much of the centralization found in traditional fund structures. Typically, ETFs are managed by a diverse array of participants, each handling various aspects while charging their own fees. These participants include custodians responsible for storing the underlying shares, transfer agents tasked with recording and maintaining records, and, of course, the fund issuer.","\"The goal is to leverage what crypto is good at, removing intermediaries, to offer a better, faster, cheaper, and globally available index products,\" the firm said in a press release.&nbsp;","V1 of the token relied on a wrapped asset model with Coinbase as the custodian, while v2 moves custody entirely on-chain.&nbsp;","To be sure, not everything can be decentralized. The firm is still working on exploring how to decentralize the methodology of the fund — that's to say the rules that determine the parameters around the makeup of a fund, or the constituents to use ETF parlance.&nbsp;","\"The most difficult thing to fully decentralize is the methodology, which we'd like to be strictly rules based but currently requires some discretion to clarify whether an asset is a stablecoin or a wrapped asset that could be double counted for example,\" Diamond added. 'That is left to holder governance and gets executed via a 4 of 8 multisig where Alongside doesn't have a majority.\"","Regarding U.S. market participants eagerly awaiting a bitcoin spot ETF, they can now include AMKT on the list of assets that the Securities and Exchange Commission is \"protecting\" them against.","\"Funny history though — the first ETF launched in Canada because the SEC dragged their feet for three years (despite the idea for ETFs being an SEC idea following the flash crash of 87),\" Diamond added. \"Also Gensler wrote a book in defense of index funds\/passive ETFs in 2002.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"$11 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2002","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gensler","content":"PERSON"},{"type":"AMKT","content":"ORGANIZATION"},{"type":"Jack Bogle","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Austin Diamond","content":"ORGANIZATION"},{"type":"Vanguard","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}