{"summary":"Ben Edgington, lead product owner for ConsenSys&#x27; Teku Ethereum 2.0 client, opines on the future trajectory of the Eth2 initiative.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90818\/ethereum-2-eth2-whats-next-2021","publishDate":"2021-01-11T14:46:57","id":12837,"type":null,"title":"Beyond the Beacon Chain: what&#x27;s next for Eth2?","category":["ETHEREUM"],"content":["<i data-v-f87c67ca=\"\">Ben Edgington is Lead Product Owner for the Teku Ethereum 2.0 client at ConsenSys, and <a href=\"https:\/\/eth2.news\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a long-time chronicler of Ethereum 2.0’s progress<\/a>.<\/i>","In 1492, Christopher Columbus thought that he’d reached the East Indies. In fact, he’d happened upon an astonishing new world. Sometimes, when arriving after an arduous journey, it’s good to take stock and re-plan. To take advantage of new opportunities that present themselves.","That’s kind of where we are with Ethereum 2.0 at the start of 2021. At the start of the year, we committed to delivering the Eth2 Beacon Chain, and recently we achieved it. It feels like the end of a long and hard journey.","But it is also only the beginning. We’ve come far, and now we can see further. As we survey the landscape ahead, we are beginning to appreciate new opportunities coming into view.","For the major part of this article I want to cover our new three-fold roadmap for 2021: “the merge” between Eth1 and Eth2, sharding, and light clients. These are three separate streams that will progress in parallel. But first indulge me in celebrating a little success.","The Beacon Chain is the foundation for Ethereum’s future. It implements Proof of Stake rather than Proof of Work as its governing mechanism, and supports the scalability and security to sustain Ethereum for years to come.","This is what went live on the 1st of December. I call it “proof of Proof of Stake”. It is our high-value demonstration that securing a massively distributed, global, permissionless network in this way is practical and effective. The Beacon Chain doesn’t yet do much besides run itself, and we’ll come to that, but it is nonetheless the most challenging deliverable of the Ethereum 2.0 project.","As I write, four weeks have passed since genesis, and things are going wonderfully. The Beacon Chain already dwarfs any other Proof of Stake system. Over two million ETH, worth $1.5 billion, has been committed to the <a href=\"https:\/\/www.duneanalytics.com\/hagaetc\/eth2-0-deposits\" data-v-f87c67ca=\"\">deposit contract<\/a>. This accounts for more than forty-six thousand currently live validators, with another twenty thousand in a three-week-long queue to get in. And deposit rates are showing no sign of slowing down. It won’t be many days until 2% of the total supply of ETH is locked in the deposit contract. This is an immense vote of confidence from 4,000 unique depositors, and thousands more who made deposits via staking services.","So far, the stakers’ confidence has been well placed. It’s still early days, but the Beacon Chain has run flawlessly to date, with around 99% participation (a key metric of network health) and not a single issue or incident.","Hundreds of people were involved in designing and building the Beacon Chain over the last two and a half years. It has been a massively open community project, led by the Ethereum Foundation, implemented by client development teams <a href=\"https:\/\/consensys.net\/knowledge-base\/ethereum-2\/teku\" data-v-f87c67ca=\"\">like my own<\/a>, and supported by a huge and varied cast of contributors.","It’s been an incredible journey. But it's only the first step.","So, what’s next?","A year ago, Ethereum 2.0 had a neat and tidy, linear roadmap. Phase 0 (the beacon chain) was to be followed by Phase 1 (sharding for scalability), which was to be followed by Phase 2 (abstract execution engines), and finally, Eth1 would be merged into Eth2 on top of this superstructure. Then the Phase 2 design began to look like it would take longer than expected, and, at the same time, pressure started growing to get Eth1 merged into Eth2 as early as possible. So we inserted a Phase 1.5, in which a “lift and shift” of Eth1 into an Eth2 shard could be performed directly.","Alongside that, a whole new scaling paradigm emerged that doesn’t rely on sharding at all. This is “rollups”, and, in October this year, Vitalik proposed a new <a href=\"https:\/\/ethereum-magicians.org\/t\/a-rollup-centric-ethereum-roadmap\/4698\" data-v-f87c67ca=\"\">rollup-centric Ethereum roadmap<\/a>, as the route to scalability. <a href=\"https:\/\/ethereum.org\/en\/developers\/docs\/layer-2-scaling\/#rollups\" data-v-f87c67ca=\"\">Rollups<\/a> are a so-called Layer 2 technology that take much of the burden of computation and storage out of the blockchain, and use the chain just enough to benefit from its security guarantees. They come in different forms — zk-rollups and optimistic rollups—with different trade-offs, and the technology is nascent. But it is looking very likely that rollups could provide much of the scalability Ethereum needs, even before Ethereum 2.0 is fully delivered.","Also in the mix are stateless Ethereum (although rollups might relieve some of the pressure of Ethereum’s state bloat), and promising new cryptographic techniques like <a href=\"https:\/\/dankradfeist.de\/ethereum\/2020\/06\/16\/kate-polynomial-commitments.html\" data-v-f87c67ca=\"\">Kate commitments<\/a> (pronounced “kah-tay”) that suggest exciting new directions.","With all this going on, our nice, neat, three-phase roadmap has now morphed into the spider’s web from Vitalik’s <a href=\"https:\/\/twitter.com\/VitalikButerin\/status\/1333922620857745408\" data-v-f87c67ca=\"\">recent update<\/a>.","Can we weave all these threads into a coherent tapestry? I believe that if any community can make this work, it’s the Ethereum community.","I recently re-read the wonderful book <i data-v-f87c67ca=\"\">When Genius Failed<\/i> by Roger Lowenstein, who writes of Robert C. Merton, “He had the disease of perfect belief, which makes compromise impossible”. It was this rigidity that eventually caused his hedge fund to implode. Ethereum frequently suffers the inverse criticism: that we are constantly rewriting our roadmap; perhaps even appearing as if we are making it up as we go along.","But this is actually one of the drivers of Ethereum’s success. Unlike Merton, we are a community of pragmatists who do what it takes to get the job done. When the facts change, we change; when opportunities present themselves, we grasp them. We love to explore new and wild frontiers, and adapt and change on the way.","Happily, we believe that, with the Beacon Chain done, we have a good view of the landscape ahead and how 2021 will progress. Making rollups the central pivot for scalability allows us to decouple our tasks, and attack the next stages in parallel.","Thus, the next year will be a three-pronged attack: “the merge” between Eth1 and Eth2, sharding, and light clients. In the new model, these are independent tasks and that proceed together. It doesn’t much matter in what order they are delivered.","The merge is the point at which we move Eth1 off Proof of Work and onto Proof of Stake. The current best candidate for achieving this is to build Eth1 <a href=\"https:\/\/ethresear.ch\/t\/executable-beacon-chain\/8271?u=benjaminion\" data-v-f87c67ca=\"\">directly into the beacon chain<\/a> that we already have. Eth1 won’t be an execution environment, as originally conceived; it won’t even be a shard. Rather, the EVM will remain the enshrined, core engine of Ethereum. This will make life super-simple for devs and application providers: pretty much everything remains the same as it is today, we just get to turn off mining.","In our old, linear roadmap, turning off Proof of Work was quite a distant prospect, occurring after Phase 2. In the new plan, we’re looking at implementing a testnet within the next few weeks.","The second prong, sharding (formerly Phase 1), is already quite well defined, and nearing a point at which we can begin implementing it in clients. The approach to sharding has shifted under the new roadmap. Previously, shards would be responsible both for ordering data, and for executing data. This brought complexities such as cross-shard transactions. With the rollup centric roadmap, shards only need to take care of ordering data. Rollups are data-hungry; the more data they have the faster they can go.","Consider my turbo-powered car. It’s fun, but it also serves to illustrate how rollups and sharding combine to soup-up the Ethereum virtual machine (EVM). The EVM has proven to be powerful and flexible, but it is starved of the oxygen it needs to accelerate faster: data. Rollups dramatically boost the available power by compressing the data like a fuel–air mix and forcing it into the engine under pressure, much like a turbocharger in a car, or a compressor in a jet. This can be, and is being, implemented on the current Ethereum chain. When we add sharding to this, it will be as if we’d strapped another sixty-four compressors onto the front of our already turbo-charged engine: a multi-stage turbo. The gains of rollups and sharding compound, delivering enormous scalability.","The third, independent, relatively minor prong is to put in place infrastructure for light clients. This makes the system usable by applications that don’t want to run the whole thing. Light clients will allow users to prove things about what’s happening in Ethereum 2.0 without running an Eth2 node, which becomes increasingly important with sharding. The whole point of sharding is that not everybody needs to run every shard.","Assuming the beacon chain continues to run smoothly, the task for the first weeks of 2021 is to flesh out these three work-streams into delivery plans.","The very first reference to Ethereum 2.0 I’ve managed to track down is from Vitalik, some <a href=\"https:\/\/www.reddit.com\/r\/ethereum\/comments\/282s03\/ethereum_ceo_charles_hoskinson_will_be_moving_on\/ci76xzc\/\" data-v-f87c67ca=\"\">six-and-a-half years ago<\/a>. Somewhat prophetically, he opens with, “We've changed our plans quite a lot over the past few months.” Apparently, ‘twas ever thus! He closes with, “we will either solve the scalability and consensus problems or die trying.”","The Beacon Chain solves the consensus problems. And, by the end of 2021, we will know whether we’ve solved scalability or not. You’d better believe we’ll deliver or die trying — that’s the one constant in this ever-changing world.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Merton","content":"PERSON"},{"type":"last two and a half years","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Christopher Columbus","content":"PERSON"},{"type":"Beacon Chain","content":"LOCATION"},{"type":"99%","content":"PERCENT"},{"type":"Vitalik","content":"LOCATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Kate","content":"PERSON"},{"type":"1st of December","content":"DATE"},{"type":"Ben Edgington","content":"PERSON"},{"type":"Roger Lowenstein","content":"PERSON"},{"type":"East Indies","content":"LOCATION"},{"type":"Robert C. Merton","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"1492","content":"DATE"},{"type":"Proof of Stake","content":"ORGANIZATION"},{"type":"a-half years ago","content":"DATE"},{"type":"October","content":"DATE"},{"type":"EVM","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Ben Edgington","The Block"]}