{"summary":"Bitcoin has already surpassed gold within investors&#x27; portfolios in volatility-adjusted terms, according to JPMorgan analysts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281216\/jpmorgan-bitcoin-gold-investors-portfolios","publishDate":"2024-03-07T15:03:24","id":12835,"type":null,"title":"JPMorgan says unrealistic to expect bitcoin to match gold within portfolios in notional amounts","category":["MARKETS"],"content":["Despite large inflows into recently-launched spot bitcoin exchange-traded funds in the U.S., it would be unrealistic to expect bitcoin to match the notional amounts of gold within investors' portfolios, according to a recent analyst report.","The report, issued by a team of JPMorgan analysts led by Nikolaos Panigirtzoglou, noted on Thursday that risk is the critical factor often ignored in the argument suggesting bitcoin should match gold in investors' portfolios. This argument posits that bitcoin's market capitalization would need to climb to $3.3 trillion — the value of gold held for investment purposes — thereby implying bitcoin's price will more than double.","Most investors consider risk and volatility when allocating across asset classes, the analysts said. Given that the volatility of bitcoin is approximately 3.7 times higher than that of gold, they concluded that expecting bitcoin to match gold within investors' portfolios in notional amounts would be unrealistic.","The analysts argued that if bitcoin were assumed to match gold in terms of risk capital (the funds designated for speculative activities), the implied allocation would shrink to $0.9 trillion, a figure derived by dividing $3.3 trillion by 3.7.","\"This implies a bitcoin price of $45,000, significantly lower from current levels. In other words, at $66,000 currently, the implied allocation to bitcoin within investors' portfolios has already surpassed that of gold in vol adjusted terms,\" the analysts said.","Of the $3.3 trillion total amount of <a href=\"https:\/\/www.theblock.co\/learn\/245718\/how-is-bitcoin-similar-to-gold\" data-v-f87c67ca=\"\">gold<\/a> held for investment purposes, only 7% or $230 billion is held in fund format, with the rest in the form of bars and coins, the analysts said.","Using gold as a benchmark and applying the same volatility ratio of 3.7, it suggests a potential bitcoin ETF size of approximately $62 billion (that is, $230 billion divided by 3.7), the analysts noted. They added that this represents a \"realistic target\" for the potential size of spot bitcoin ETFs over time, possibly within a period of two to three years. However, much of the implied net inflow could result from a continued rotational shift from existing instruments to ETFs, they noted.","Spot bitcoin ETFs outside of Grayscale bitcoin trust have already witnessed a cumulative inflow of $19 billion since their launch — nearly half of the $36 billion rotational shift <a href=\"https:\/\/www.theblock.co\/post\/272099\/jpmorgan-spot-bitcoin-etfs-36-billion-inflows\" data-v-f87c67ca=\"\">JPMorgan previously anticipated<\/a> throughout 2024.","After accounting for the total $10 billion outflow from GBTC to date, the net inflow into overall spot bitcoin ETFs stands at $9 billion, which the analysts still consider a \"significant\" number.","However, they expressed skepticism that the entire $9 billion represents new money entering the crypto space, as retail investors are probably shifting from existing instruments and venues to new spot bitcoin ETFs.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$62 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"$3.3 trillion","content":"MONEY"},{"type":"$45,000","content":"MONEY"},{"type":"$230 billion","content":"MONEY"},{"type":"$0.9 trillion","content":"MONEY"},{"type":"$9 billion","content":"MONEY"},{"type":"Nikolaos Panigirtzoglou","content":"PERSON"},{"type":"$66,000","content":"MONEY"},{"type":"$19 billion","content":"MONEY"},{"type":"$36 billion","content":"MONEY"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","JPMORGAN","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}