{"summary":"Figment and Nexus Mutual have partnered to offer an ETH Slashing Cover product, protecting customers against validator slashing risks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239343\/figment-nexus-mutual-ethereum-slashing-cover","publishDate":"2023-07-13T09:00:44","id":12843,"type":null,"title":"Figment partners with Nexus Mutual to enhance Ethereum slashing cover","category":["LAYER 1S"],"content":["Staking infrastructure platform Figment and crypto protection provider Nexus Mutual have joined forces to offer Figment customers additional protection against validator slashing risks with the launch of \"ETH Slashing Cover.\"","The product aims to provide comprehensive coverage against validator double-sign slashing risks, according to a statement from Nexus Mutual. These risks refer to potential penalties Ethereum validators may face for engaging in malicious behavior, specifically the act of signing conflicting blocks or messages. Slashing can result in the loss of a portion or all of the validator's staked assets and impact their reputation on the network.","\"Top-class institutions realize that even with the most reliable set-ups, there is always the risk of something going wrong,” Nexus Mutual founder Hugh Karp said in the statement. “Giving their customers access to first-in-class cover is simply the responsible thing to do.\"","Nexus Mutual said that with ETH Slashing Cover, Figment customers can potentially protect themselves against the risks of double-sign slashing events for up to 1 ETH per validator. By combining Figment's existing coverage with this new offering, Figment customers can gain an extra layer of protection and achieve up to 100% coverage against slashing risks for their staked ether, according to Nexus Mutual.","Figment claims to manage over $3 billion in total assets staked, with nearly 5% of all staked ether on Figment validators.","“Figment operates some of the industry’s most robust infrastructure, reducing the possibility and magnitude of double-sign slashing risk,” Figment founder and CEO Lorien Gabel added. “Now, Figment and Nexus Mutual can give delegators a way to further hedge against double-sign slashing risks while minimally impacting rewards.”","DeFi cover (as an alternative to traditional insurance services) is a growing sector within the crypto industry, paying out <a href=\"https:\/\/www.theblock.co\/post\/221423\/more-than-90-of-all-time-defi-insurance-payout-value-was-in-2022-opencover\" data-v-f87c67ca=\"\">$34.4 million<\/a> worth of claims in 2022, according to OpenCover.","Nexus Mutual said it has protected over $4.4 billion in crypto assets since 2019, paying out over $17 million in claims.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nexus Mutual","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Lorien Gabel","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Figment","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$34.4 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"ETH Slashing Cover","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"” Nexus Mutual","content":"ORGANIZATION"},{"type":"Hugh Karp","content":"PERSON"},{"type":"$17 million","content":"MONEY"},{"type":"$4.4 billion","content":"MONEY"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","STAKING"],"authors":["James Hunt","The Block"]}