{"summary":"Eligible users have until Dec. 27 to claim their SAFE token airdrop and become part of the SafeDAO governance community.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173332\/safe-token-airdrop-goes-live-with-43000-users-eligible-for-reward","publishDate":"2022-09-28T06:16:36","id":12847,"type":null,"title":"Safe token airdrop goes live with 43,000 users eligible for reward","category":["CRYPTOCURRENCY"],"content":["Safe, formerly Gnosis Safe, a decentralized crypto custodian, has announced that its SAFE token airdrop is now live with over 43,000 users eligible to claim the coins.","The <a href=\"https:\/\/www.theblock.co\/post\/164361\/gnosis-safe-confirms-safe-token-airdrop-to-more-than-21000-users\" data-v-f87c67ca=\"\">airdrop<\/a> is part of the launch of SafeDAO, the decentralized autonomous organization that emerged following <a href=\"https:\/\/www.theblock.co\/post\/157050\/gnosis-safe-raises-100-million-led-by-1kx-as-it-rebrands-to-safe\" data-v-f87c67ca=\"\">Gnosis Safe’s rebrand to Safe<\/a>. Eligible users have until 12:00 AM CET on Dec. 27, 2022, to claim their SAFE tokens. Users can claim the tokens on both the Safe mobile and web app.","The airdrop amounts to about 18% of the SAFE token supply of one billion coins. The remaining tokens will be distributed among core contributors, backers, <a href=\"https:\/\/www.theblock.co\/post\/134253\/safe-foundation-proposed-steward-of-the-gnosis-safe-ecosystem-plans-to-raise-100-million\" data-v-f87c67ca=\"\">ecosystem guardians<\/a>, and GnosisDAO.","SAFE token holders will now have voting power on SafeDAO. Token holders can also delegate their voting power to guardians whose interests align with theirs on governance DAO governance issues.","“We are excited to finally hand over the ownership of Safe to the community through the Safe token and SafeDAO,” said Safe co-founder Lukas Schor, adding, “As a public good and fundamental infrastructure for web3, we know that only decentralized governance can guarantee the long-term neutrality of the project.”","The DAO held a community challenge to remove <a href=\"https:\/\/www.theblock.co\/post\/148417\/optimism-cracks-down-on-airdrop-farmers\" data-v-f87c67ca=\"\">sybil airdrop hunters<\/a> — people who interact with projects solely in the hopes of claiming future airdrops. They do so by creating many wallet addresses that perform one transaction on these projects so as to qualify for any future retroactive airdrop. These airdrop hunters often sell the tokens immediately upon receiving them, an action that can drive down the price of the coin. SafeDAO <a href=\"https:\/\/twitter.com\/safe\/status\/1574699072899862528\" data-v-f87c67ca=\"\">announced<\/a> that it removed over 12,000 addresses tied to sybil airdrop hunters, saving 2.9 million SAFE tokens in the process.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"Gnosis Safe","content":"PERSON"},{"type":"Gnosis","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Dec. 27, 2022","content":"DATE"},{"type":"Lukas Schor","content":"PERSON"}],"hashtag":["AIRDROP"],"authors":["Osato Avan-Nomayo","The Block"]}