{"summary":"Crypto exchange Huobi quietly fixed a data breach that could have resulted in the &quot;largest crypto theft in history.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237460\/huobi-data-breach","publishDate":"2023-07-03T06:25:06","id":12848,"type":null,"title":"Huobi fixes data breach that leaked contact details for 4,960 users","category":["COMPANIES"],"content":["Crypto exchange Huobi quietly fixed a data breach that had reportedly put users’ assets at risk since June 2021.","The breach involved the exposure of credentials granting write privileges to all of Huobi's AWS S3 buckets, which the company uses for its cloud storage, <a href=\"https:\/\/phillips.technology\/blog\/huobi-crypto-aws\/\" data-v-f87c67ca=\"\">according<\/a> to white hat hacker and citizen journalist Aaron Phillips.","Anyone with access to the credentials could have modified content on Huobi's domains, including huobi.com and hbfile.net. Additionally, user data and internal documents were also at risk of exposure, Phillips said.","The severity of the breach was significant, Phillips added, alleging that it had the potential for attackers to “carry out the largest crypto theft in history.” Huobi, which handles over <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\" data-v-f87c67ca=\"\">$10 billion<\/a> in monthly trading volume according to The Block’s data dashboard, deleted the compromised account and secured its cloud storage on June 20, Phillips <a href=\"https:\/\/phillips.technology\/blog\/huobi-crypto-aws\/\" data-v-f87c67ca=\"\">reported<\/a>.","Phillips found no evidence the breach was used to carry out an attack.","Phillips highlighted the vulnerability of Huobi's content delivery networks (CDNs) and websites, which can lead to the injection of malicious scripts. The CDNs could have compromised every Huobi login page, potentially affecting every user who logged into a Huobi website or app over the last two years, he said.","It risked users losing their account and crypto assets and exposed sensitive information, such as contact details and account balances of crypto users. This included a database of crypto whales and Huobi’s over-the-counter (OTC) trade data, Phillips said.","\"The incident this time involved the leakage of user contact information on a small scale (4,960 individuals),\" Huobi said in an email to The Block. \"The type of information leaked does not involve sensitive information and does not affect user accounts and fund security. The incident occurred on June 22, 2021, due to improper operations by personnel related to the S3 bucket in the testing environment of the Huobi Japanese AWS site. The relevant user information was completely isolated on October 8, 2022.\"","\"Huobi Japanese site and Huobi Global site are completely different entities. After being discovered by a white hat team, the Huobi Security Team promptly took action on June 21, 2023, immediately closing the relevant file access permissions. The current issue has been fixed, and all related user information has been deleted. We appreciate the contributions made by the white hat team to Huobi’s security,\" Huobi added.","Huobi's response to the breach ultimately resolved the issue and secured its cloud storage. However, it took months for the white hat to receive a response from Huobi, and the leaked credentials remained online even after he first notified Huobi of the issue in June 2022, Phillips said.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"June 2021","content":"DATE"},{"type":"June 20","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"last two years","content":"DATE"},{"type":"Huobi Security Team","content":"ORGANIZATION"},{"type":"October 8, 2022","content":"DATE"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"Phillips","content":"PERSON"},{"type":"June 21, 2023","content":"DATE"},{"type":"S3","content":"ORGANIZATION"},{"type":"June 22, 2021","content":"DATE"},{"type":"AWS","content":"ORGANIZATION"},{"type":"Aaron Phillips","content":"PERSON"},{"type":"Huobi","content":"LOCATION"},{"type":"Huobi","content":"PERSON"}],"hashtag":["EXPLOITS","HTX"],"authors":["James Hunt","The Block"]}