{"summary":"Huobi Technology Holdings Limited, a leading virtual asset services platform, participated in the 2nd Annual Private Wealth Asia Forum in Hong Kong.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/122319\/huobi-tech-discusses-virtual-asset-investments-at-private-wealth-asia-forum-in-hong-kong","publishDate":"2021-10-29T09:00:01","id":12840,"type":null,"title":"Huobi Tech Discusses Virtual Asset Investments at Private Wealth Asia Forum in Hong Kong","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">HONG KONG — OCTOBER 29th, 2021 — Huobi Technology Holdings Limited (Huobi Tech, stock code: 1611), a leading virtual asset services platform, participated in the 2nd Annual Private Wealth Asia Forum in Hong Kong. Jenny Lau and Gillian Wu, representatives of Huobi Tech, spoke during a session and roundtable discussion about the role of virtual assets as an alternative asset class and how they are becoming important investment tools as Bitcoin, Ethereum, and other cryptocurrencies enter the mainstream market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The 2nd Annual Private Wealth Asia Forum in Hong Kong brought together hundreds of executives to discuss capital allocations into all sorts of investment vehicles. The program was developed to meet the needs of private wealth investors. Attendees were primarily C-level executives from Asia’s private client and wealth management industry.<\/span>","<span data-v-f87c67ca=\"\">During the first session titled ‘<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">How to Best Take Advantage of Opportunistic Alternative Investments<\/span><\/i><span data-v-f87c67ca=\"\">,’ panelists discussed the current macro-environmental issues within the wealth management space, including regulation, technological development, changes in macroeconomic demographics, economic policies, and more amid the global market volatility caused by COVID-19. By 2025, the pandemic will have <\/span><a href=\"https:\/\/www.mckinsey.com\/business-functions\/risk-and-resilience\/our-insights\/covid-19-implications-for-business\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">cost the world<\/span><\/a><span data-v-f87c67ca=\"\"> between USD16 trillion and USD35 trillion, according to a new report from McKinsey &amp; Company.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When addressing the question of whether alternative asset investments, including virtual assets, add value to investors’ portfolios, Gillian Wu, CEO of Huobi Asset Management, which is a subsidiary of Huobi Tech, discussed the risk-return aspects of assets and how investment portfolios consider the cumulative impact of assets to evaluate the risks and returns of the broader portfolio. Cryptocurrencies like Bitcoin have almost no correlation to other asset classes, and therefore provide clear diversification benefits. According to RIA Digital Asset Council reports, one percent of Bitcoin exposure will not reduce the fixed return of the overall return on investment (ROI) but provide a higher risk-adjusted return. In other words, virtual assets are becoming important mainstream investment tools.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This message was also underscored during a roundtable discussion hosted by Huobi Tech titled ‘<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Virtual Assets as an Alternative Asset Class<\/span><\/i><span data-v-f87c67ca=\"\">’. During the roundtable, some investors voiced their optimism for virtual assets but also shared concerns about compliance and safety. Jenny Lau, Head of Hong Kong office, Huobi Trust Hong Kong which is another subsidiary of Huobi Tech, acknowledged the validity of these concerns and cited the importance of licensed virtual asset custodians. Virtual asset custodians can address risk via risk control measures and lower the threshold for investors to enter the virtual asset space. Furthermore, custodians can customize their custody solutions to meet the different needs of their investors.<\/span>","<span data-v-f87c67ca=\"\">To wrap up the discussion, Jenny Lau introduced Huobi Trust Hong Kong, a one-stop virtual asset service platform that aims to provide asset custody, wealth management, private customization, family trust services, and more to clients who need secure or risk-isolated asset storage. Since its incorporation as a registered trust company in Hong Kong in April 2021 , the assets under custody of Huobi Trust Hong Kong has exceeded more than USD2 billion as of the end of September 2021.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To find out more about Huobi Technology: <\/span><a href=\"https:\/\/huobitech.com\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">https:\/\/huobitech.com<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"2nd Annual Private Wealth Asia Forum","content":"ORGANIZATION"},{"type":"OCTOBER 29th, 2021","content":"DATE"},{"type":"Huobi Asset Management","content":"ORGANIZATION"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Huobi Technology Holdings Limited (Huobi Tech","content":"ORGANIZATION"},{"type":"Gillian Wu","content":"PERSON"},{"type":"one percent","content":"PERCENT"},{"type":"Huobi Tech","content":"ORGANIZATION"},{"type":"Huobi Trust Hong Kong","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"RIA Digital Asset Council","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Jenny Lau","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"McKinsey &amp; Company","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}