{"summary":"Visa tested a solution to enable users to pay onchain gas fees on Ethereum’s Goerli testnet using account abstraction technology.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/244371\/visa-unveils-experimental-solution-to-abstract-away-gas-fees","publishDate":"2023-08-11T07:55:17","id":12854,"type":null,"title":"Visa unveils experimental solution to abstract away gas fees","category":["CRYPTO ECOSYSTEMS"],"content":["Global payments giant Visa <a href=\"https:\/\/twitter.com\/digitalmustafa\/status\/1689741716084215809\" data-v-f87c67ca=\"\">introduced<\/a> an experimental solution on Ethereum that removes some of the barriers associated with paying gas fees on the network.&nbsp;","The experimental solution on Ethereum's Goerli testnet streamlines the interaction between users and the network by leveraging account abstraction technology and the ERC-4337 standard, <a href=\"https:\/\/usa.visa.com\/solutions\/crypto\/paying-blockchain-gas-fees-with-card.html\" data-v-f87c67ca=\"\">according<\/a> to Visa. By doing so, the need for end-users to maintain ether (ETH), Ethereum’s native cryptocurrency, for transaction or “gas” fees is eliminated. Users will still have to technically pay a gas fee, but the method allows them to pay with any token such as USDC or USDT—removing a layer of friction in Ethereum payments. Visa can cover those fees as well.&nbsp;","Managing ETH balance for gas fees can be challenging for certain users because they have to convert fiat money into ETH through a third-party onramp like a Coinbase or Moonpay. This could lead to overpayment or underpayment due to fluctuating gas fees. Visa’s research team recognized this problem and introduced this new solution as an effective way to overcome these gas-related challenges, with the innovation centered on enabling the wallet itself to cover gas costs.","The key component of this solution is a \"paymaster\" – a specialized smart contract. This is not a new concept for Visa, as they’ve previously explored this avenue, according to Mustafa Bedawala, staff product manager at Visa. The paymaster functions as a sponsor for gas fees on user contract accounts, making it possible for users to pay onchain gas fees directly through their Visa card without needing to handle native blockchain tokens.","“This is a new and expanded experimental solution from the prior one in which we are accepting fiat and covering onchain fees on behalf of users using our offchain solution. It will simply appear to users in the same way that regular card-based payments are made for their onchain fee cost,” Bedawala told The Block.&nbsp;","Visa <a href=\"https:\/\/www.theblock.co\/post\/231411\/visa-taps-ethereums-goerli-testnet-to-experiment-with-account-abstraction\" data-v-f87c67ca=\"\">deployed<\/a> the paymaster contract in May on the Goerli testnet, aiming to take advantage of <a href=\"https:\/\/www.theblock.co\/post\/216504\/ethereum-developers-deploy-entrypoint-to-let-wallets-operate-as-smart-contracts\" data-v-f87c67ca=\"\">account abstraction<\/a> and enhance the contracts’ applicability to user accounts and enable wallets to carry out complex tasks autonomously and manage transaction costs on other accounts’ behalf. This experimentation was thoroughly documented in a report, with the new feature serving as an addition to the existing deployment.","Visa initially expressed its interest in account abstraction in a <a href=\"https:\/\/usa.visa.com\/visa-everywhere\/blog\/bdp\/2022\/12\/16\/exploring-new-avenues-1671230603572.html\" data-v-f87c67ca=\"\">blog post<\/a> in December 2022. However, at that time, the functionality for account abstraction had not been implemented on Ethereum. Subsequently, in March 2023, developers made significant progress and introduced ERC-4337, code that enabled account abstraction on Ethereum through specialized smart contracts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mustafa Bedawala","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"4337","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"March 2023","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}