{"summary":"Crypto exchange CoinFLEX has paused withdrawals due to &quot;extreme market conditions and continued uncertainty involving a counterparty.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153871\/coinflex-halts-withdrawals-amid-extreme-market-conditions","publishDate":"2022-06-23T14:30:13","id":12852,"type":null,"title":"CoinFLEX halts withdrawals amid &#x27;extreme market conditions&#x27;","category":["EXCHANGES"],"content":["Crypto exchange CoinFLEX <a href=\"https:\/\/coinflex.com\/blog\/coinflex-update-on-withdrawals\/\" data-v-f87c67ca=\"\">announced<\/a> today it's pausing all withdrawals due to \"extreme market conditions and continued uncertainty involving a counterparty.\"","The firm said that the counterparty is not Three Arrows Capital or any lending firm. \"We are confident that this situation can be repaired fully with a restoration of all functionality, namely withdrawals.\"","Both Three Arrows Capital and lending protocol Celsius are facing significant fallout from liquidity issues. Celsius <a href=\"https:\/\/www.theblock.co\/post\/152230\/citigroup-celsius-advising-after-withdrawal-freeze\" data-v-f87c67ca=\"\">paused<\/a> withdrawals and transactions last week and has yet to communicate a path forward. Three Arrows Capital is facing <a href=\"https:\/\/www.theblock.co\/linked\/152092\/after-facing-hundreds-of-millions-of-dollars-in-liquidations-three-arrows-capitals-future-is-uncertain\" data-v-f87c67ca=\"\">potential insolvency<\/a> in the aftermath due to lender liquidation and is struggling to make good with clients.&nbsp;","CoinFLEX provided an estimated timeline for a path forward. It hopes to give an update on the situation by June 27th and have withdrawals operating by June 30th. Though, those dates are based on the firm's current understanding of the situation, it said, and it plans to give more clarity on the details as soon as possible.","\"We fully expect to resume withdrawals in a better position as soon as possible,\" said the post. \"We will fully communicate with you as we find out more.\"","In 2019, CoinFLEX emerged as a platform for physically-delivered futures. Since then, it overhauled its <a href=\"https:\/\/www.theblock.co\/post\/69782\/coinflex-overhauls-strategy-to-focus-on-building-a-repo-market-for-the-crypto-industry\" data-v-f87c67ca=\"\">strategy<\/a> in 2020 to focus on building a repo market for crypto. Its <a href=\"https:\/\/www.coindesk.com\/markets\/2019\/03\/13\/polychain-dcg-invest-in-crypto-futures-exchange-coinflex\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">backers<\/a> include Polychain Capital and Digital Currency Group.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 30th","content":"DATE"},{"type":"last week","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"June 27th","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Polychain Capital and Digital Currency Group","content":"ORGANIZATION"},{"type":"2019","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}