{"summary":"Molecule has raised $13 million in seed funding in a round led by venture capital firm Northpond Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151539\/decentralized-science-platform-molecule-raises-13-million-in-seed-funding","publishDate":"2022-06-13T08:00:32","id":12866,"type":null,"title":"Decentralized science platform Molecule raises $13 million in seed funding","category":["WEB3"],"content":["Molecule, a platform where medical research projects can receive funding via decentralized autonomous organizations (DAOs), has raised $13 million in seed funding in a round led by biotech venture capital firm Northpond Ventures.","Other participants in the round included Backed VC, Shine Capital, Speedinvest and former Coinbase CTO Balaji Srinivasan, according to a press release today. This is Molecule's first raise in the web3 space.&nbsp;","Molecule is part of a nascent movement called decentralized science (DeSci) that emerged from web3, explained founder Tyler Golato in an interview with The Block. This is the idea that instead of a science ecosystem that relies on centralized bodies of research and funding, funding for research can be crowdfunded and decentralized in terms of ownership.&nbsp;","\"Imagine if insulin was collectively owned and governed by diabetics — how would they price the drug, access it and how would information be shared within that community,\" said Golato whose background is primarily in biochemistry and biology research. \"It's this idea of trying to take an industry that is anti-collaborative and monopolistic and figure out a way to open that to a broader group of people who have the most skin in the game.\"&nbsp;","Molecule aims to build this ecosystem through its platform, a marketplace for researchers to list projects which are non-fungible tokens (NFTs) intended to signal intellectual property. Current projects on the platform include a Newcastle University study into molecular aging and a University of Copenhagen project into longevity. These projects receive funding via DAOs, usually in a stablecoin such as USD Coin.&nbsp;","Currently, much of the funding comes via its associated DAO named VitaDAO. However, with part of the new funding, Molecule plans to build out an accelerator framework for biotech DAOs that target specific diseases that it will initially support with $100,000 seed checks with the hope that it becomes self-funded. Much of the funding will also be used to build out its team, particularly in the engineering space and to create a non-profit foundation to steward the Molecule protocol.&nbsp;","\"The broader vision is to create a DeSci ecosystem that won't just consist of DAOs funding research but also hopefully pharmaceutical companies along with the general public investing into these research projects,\" explained Golato.&nbsp;","The Molecule team, however, recognized that one of its biggest obstacles was likely to be the lack of public knowledge on DeSci. In particular, they noted that it was hard to convince the tier one law firm hired by its lead investor to do due diligence on its round. Golato also said that it even had to explain the fundamentals of web3 to its lead investor.&nbsp;","\"It was a lot of learning. It was getting them to understand tokenomics, non-profit foundations that steward a protocol, and the idea of investing into an ecosystem, not a company\" he said. \"All of these structures are very foreign to an organization that is used to typically investing in [centralized companies] and taking a massive ownership stake.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Shine Capital","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Northpond Ventures","content":"ORGANIZATION"},{"type":"USD Coin","content":"ORGANIZATION"},{"type":"Golato","content":"PERSON"},{"type":"Newcastle University","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$13 million","content":"MONEY"},{"type":"Tyler Golato","content":"PERSON"},{"type":"University of Copenhagen","content":"ORGANIZATION"},{"type":"Coinbase CTO Balaji Srinivasan","content":"ORGANIZATION"}],"hashtag":["DAOS"],"authors":["Tom Matsuda","The Block"]}