{"summary":"Rep. Patrick McHenry, R-N.C., said he aims to get a measure to rescind the SECs bulletin that sets standards for firms that custody crypto. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275780\/rep-mchenry-seeks-to-get-measure-to-repeal-sec-accounting-bulletin-across-the-finish-line","publishDate":"2024-02-02T11:18:11","id":12869,"type":null,"title":"Rep. McHenry seeks to get measure to repeal SEC accounting bulletin &#x27;across the finish line&#x27;","category":["THE BLOCK"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">House Financial Services Committee Chair Patrick McHenry, R-N.C., said he aims to get a measure to rescind a Securities and Exchange Commission bulletin that sets certain accounting standards for firms that custody crypto.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Cynthia Lummis, R-Wyo., and Reps. Mike Flood, R-Neb., and Wiley Nickel, D-N.C., introduced a joint <a href=\"https:\/\/www.lummis.senate.gov\/wp-content\/uploads\/EHF23B09.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">resolution<\/span><\/a> to block the SEC's Staff Accounting Bulletin No. 121, known as SAB 121, on Thursday. The bulletin <\/span><span class=\"s3\" data-v-f87c67ca=\"\">requires firms that custody crypto to record customer crypto holdings as liabilities on their balance sheets.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"There is bipartisan agreement SAB 121 undermines consumer protection and leaves customers' digital assets vulnerable,\" McHenry said on X on Thursday. \"I look forward to getting this measure across the finish line to overturn it.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">McHenry, who has been friendly to crypto, has led multiple efforts to advance crypto bills and holds weight as the House Financial Services Committee chair, which has jurisdiction over the SEC.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">SAB 121 has received pushback from crypto advocates since it was issued in March 2022, as some called it \"<a href=\"https:\/\/theblockchainassociation.org\/blockchainassociation-statement-on-gao-decision-on-sab-121\/\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">illogical<\/span><\/a>.\" Others said it should have been done in the form of an official rule. SEC Chair Gary Gensler has stood by the bulletin citing concerns for customers in bankruptcy court.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The Financial Services Forum, an advocacy organization for banks, laid out its concerns on Thursday in a statement about the resolution.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">“The nation’s largest banks are subject to the highest level of prudential requirements,\" the forum said. \"Unfortunately, significant capital requirements contained in the SEC’s SAB 121 have effectively precluded banks today from being able to safely offer digital asset custody services.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">It was expected for lawmakers to bring up SAB 121 in 2024 after the agency watchdog Government Accountability Office said in October that the guidance needs to, by law, go in front of Congress before it can become effective.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The bulletin is subject to the Congressional Review Act that requires agencies to submit a report on the rule to Congress, according to GAO. The CRA, enacted in 1996, aims to bolster congressional oversight of agency rulemaking. Lawmakers on Thursday filed that joint resolution under the CRA.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Flood accused the SEC of overreaching on Thursday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The SEC issued SAB 121 without conferring with prudential regulators despite the accounting standard’s effects on financial institutions’ treatment of custodial assets, and the SEC issued SAB 121 without going through the notice-and-comment process,\" Flood said in a statement.&nbsp; \"In the face of overreach by a regulator, it is the role of Congress to serve as a check.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Wiley Nickel","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Government Accountability Office","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Financial Services Forum","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Wyo.","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"1996","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"Neb.","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"GAO","content":"ORGANIZATION"},{"type":"CRA","content":"ORGANIZATION"},{"type":"SAB","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Mike Flood","content":"PERSON"},{"type":"McHenry","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}