{"summary":"With a major election looming in the U.S., a vote currently running at Compound might not seem to be the most important issue of the day. Still, the firm","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/2617\/compound-the-crypto-borrowing-and-lending-marketplace-wants-users-to-pick-a-stablecoin","publishDate":"2018-11-01T19:59:24","id":12864,"type":null,"title":"Compound, the crypto borrowing and lending marketplace, wants users to pick a stablecoin","category":["STABLECOINS"],"content":["With a major election looming in the U.S., <a href=\"https:\/\/app.compound.finance\/#Vote\" data-v-f87c67ca=\"\">a vote currently running at Compound<\/a> might not seem to be the most important issue of the day. Still, the firm is giving users a voice in which stablecoin to list on its marketplace. The vote is open through Election Day in the U.S., next Tuesday November 6.","[related id=1]Compound launched its crypto money market in September, allowing investors to earn money on their cryptocurrencies by lending them out. The other side of that coin (!) is that Compound facilitates&nbsp;<em data-v-f87c67ca=\"\">borrowing<\/em> crypto as well. This makes it easier to short a specific currency, betting its price will fall. Compound currently supports ether, augur, basic attention token and 0x.&nbsp;","\"<span class=\"s1\" data-v-f87c67ca=\"\">Our protocol, which is entirely smart contracts, lets anyone borrow assets or earn an interest rate,\" CEO Robert Leshner told&nbsp;<em data-v-f87c67ca=\"\">The Block<\/em>. To date, about $5.2 million worth of crypto has been lent out on Compound's marketplace. While growth has been strong, Compound users told the company they wanted additional ways to invest.<\/span>","\"The number one request... has been for us to add a stablecoin,\" Leshner said. \"People want to earn interest on what looks like a dollar, instead of a more volatile asset.\" And as with everything on Compound, more investors equals more capital to lend. \"It's easier to add leverage or go long if you're borrowing [what amounts to a dollar], instead of ether.\"","Compound CEO Robert Leshner","Rather than select the stablecoin for Compound, the company decided to let its customers decide. The company has been running the poll for a few days already, and dai has an early lead with more than half of the hundreds of votes cast. One third of those voting have selected USD coin. gemini dollar, TrueUSD, and paxos are the other three contenders, with none faring especially well early on.&nbsp;","The vote has an anti-gaming mechanism: It requires an Ethereum address that has used the Compound protocol. While this does add some friction, it also makes manipulation of the outcome much harder to achieve.&nbsp;","Leshner expects the interest rate paid on whatever stablecoin Compound lists to be similar to that currently paid out on U.S. dollars but he admits to some uncertainty. \"We'll start to test some basic economic principles,\" he said.","<em data-v-f87c67ca=\"\">The Block<\/em> asked Lesher why tether, the first major stablecoin, wasn't part of the poll. Tether has seen controversy lately as it <a href=\"https:\/\/twitter.com\/lawmaster\/status\/1051791322158440448\" data-v-f87c67ca=\"\">slid significantly below the one dollar mark<\/a>. Recently, things have begun to normalize however as the organizers behind tether found a new banking relationship and updated some disclosures.","<span class=\"s1\" data-v-f87c67ca=\"\">[related id=2]Still, tether won't be in the mix for Compound. \"We're allowing the community to vote on assets which we deem to be above a reasonable standard,\" Leshner said. \"<\/span>Tether does not meet a reasonable standard of transparency to allow community to vote on it.\"","Leshner explained Tether would need to provide an accounting of the reserves backing the stablecoin. \"<span class=\"s1\" data-v-f87c67ca=\"\">The others are all providing regular attestations of funds, typically on a weekly basis,\" he said, adding they seem to have no difficulty doing so.<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compound","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5.2 million","content":"MONEY"},{"type":"Lesher","content":"PERSON"},{"type":"Leshner","content":"PERSON"},{"type":"Tuesday November 6","content":"DATE"},{"type":"Robert Leshner","content":"PERSON"}],"hashtag":[],"authors":["Mark Rogowsky","The Block"]}