{"summary":"Metaverse platform MG Land appears to have come out of nowhere to become one of the most-traded NFT collections in the first quarter.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223913\/bored-ape-metaverse-wash-trading","publishDate":"2023-03-30T07:06:14","id":1286,"type":null,"title":"Is MG Land really the hottest metaverse property? It could be wash trading","category":["NFT COLLECTIONS"],"content":["<span data-v-f87c67ca=\"\">Sales for Bored Ape’s Otherdeed metaverse land NFTs — easily the hottest virtual property brand around — have been booming during the first quarter of this year, closing in on $120 million in volume.<\/span>","<span data-v-f87c67ca=\"\">The rise in the collection's trading volume means Otherdeed tokens rank as the second-best-selling NFT collection during the first quarter of this year. Bored Ape Yacht Club, also tied to Otherdeeds and the Otherside metaverse platform-in-development, is the top-selling collection. Bored Apes and Otherdeeds are both a creation of the highly-touted NFT shop Yuga Labs.<\/span>","<span data-v-f87c67ca=\"\">This month, however, sales volumes for a lesser-known collection, also tied to a nascent metaverse platform called MG Lands, have been holding their own; even outpacing Otherdeeds’ sales at one point. However, it appears MG Lands’ rapid ascendance from relative obscurity might be, instead of a feel-good business story, another case of artificial “wash” trading.<\/span>","<span data-v-f87c67ca=\"\">“When we compare the highest sales of MG Land with those of Otherdeeds, there is a significant contrast in the duration between a buyer's first transaction and the sale for MG Land,\" said The Block researcher Brad Kay, explaining: \"Out of the top 20 sales for MG Land, 19 of the buyers had their first transaction on the same day as the sale. In contrast, every single buyer within the top 20 sales for Otherdeeds have wallets created months or years prior to the sale occurring, indicating that the buyers and sales were not bots or wash trades like those found on MG Land.”<\/span>","<span data-v-f87c67ca=\"\">Wash trading is when assets are traded between wallets owned by the same individual or company. It can create not only artificial volume but also manipulate the price.<\/span>","<span data-v-f87c67ca=\"\">Those top 19 sales all closed between roughly $27,500 and $28,500 per NFT. For the month of March, MG Lands has <a href=\"https:\/\/www.cryptoslam.io\/mg-land?tab=historical_sales_volume\" data-v-f87c67ca=\"\">amassed<\/a> $27.1 million in trading volume, <\/span><span data-v-f87c67ca=\"\">according to CryptoSlam<\/span><span data-v-f87c67ca=\"\">. After a couple of days of strong trading, Otherdeed NFTs <a href=\"https:\/\/www.cryptoslam.io\/otherdeed?tab=historical_sales_volume\" data-v-f87c67ca=\"\">pushed<\/a> past MG Lands and now have a <\/span><span data-v-f87c67ca=\"\">total volume <\/span><span data-v-f87c67ca=\"\">of nearly $30 million.<\/span>","","","<span data-v-f87c67ca=\"\">MG Land is a metaverse composed of 10,000 pieces of virtual land NFTs. The platform is designed to let people bring their character NFTs from different popular collections — such as Bored Apes, Doodles and Azuki — into its online world. People are then supposed to be able to customize their piece of virtual land and create a space to play games and trade. MG Land is <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/whitepaper.mg.land\/faqs\/team\" data-v-f87c67ca=\"\">based<\/a> in Singapore<\/span><span data-v-f87c67ca=\"\"> and is part of the Metagame Group, which was founded by a Mr. Chennywong.<\/span>","The Block contacted MG Land for comment but had not heard back before publishing.","<span data-v-f87c67ca=\"\">LandVault CEO Sam Huber said during an interview with The Block that he can’t perceive any particular reason for MG Land to be performing so well, even if it’s trying to affiliate itself with top-tier NFT collections.<\/span>","<span data-v-f87c67ca=\"\">Last week, web3 data analytics firm DappRadar published — prematurely, because the end of the fiscal period is later this week — a first-quarter of 2023 report entitled <\/span><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">Virtual Worlds Soar: Record Land Sales Generate $311 million.” The report touted the three months while stating: “<\/span><span data-v-f87c67ca=\"\">land trading reached an all-time high [during the quarter] with 147,000 trades. MG Land emerged as a top performer, making almost $60 million in trading volume and 45,219 in sales.”<\/span>","<span data-v-f87c67ca=\"\">DappRadar offered a caveat in its report: “The high level of trading volume is mainly because NFT whales use this NFT collection to collect BLUR tokens for the upcoming airdrop on the Blur NFT marketplace.”<\/span>","<span data-v-f87c67ca=\"\">Launched last year, Blur has been <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/217458\/blur-captures-84-of-eth-based-nft-transactions-in-first-week-of-march\" data-v-f87c67ca=\"\">offering<\/a> incentives<\/span><span data-v-f87c67ca=\"\"> to people willing to trade using its platform. Blur’s generous bonus plan aimed at wooing traders <\/span><span data-v-f87c67ca=\"\">may have <a href=\"https:\/\/www.theblock.co\/post\/221344\/why-nft-wash-trading-was-up-126-in-february\" data-v-f87c67ca=\"\">spurred<\/a><\/span><span data-v-f87c67ca=\"\"> some wash trading.<\/span>","\"While the volume of sales was split between Blur and Opensea, with 32.46% coming from Blur and 67.52% from Opensea in February, things shifted in March,\" DappRadar blockchain analyst Sara Gherghelas added in an emailed comment.&nbsp;","Over the past month, 70.36% of sales of that collection came from Blur while only 29.57% came from Opensea, DappRadar data shows.","\"These trends confirm that MG Land has become a popular choice for NFT whales looking to farm on Blur,” said Gherghelas.","<span data-v-f87c67ca=\"\">DappRadar’s arguably lackadaisical analysis of how well MG Land sales had performed appeared to earn the ire of at least one famous NFT watcher on Twitter. “<\/span><span data-v-f87c67ca=\"\">Even the crypto media doesn't get NFT wash-trading,\" @Punk9059 tweeted, adding: \"Article about how land sales are popping off, when it's all due to MG Land fake sales.\"<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","","","<span data-v-f87c67ca=\"\">The Block contacted DappRadar for comment but did not receive a reply before publication.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Regardless of MG Land’s dubious trading volumes, LandVault’s Huber is pleased to see the recent uptick in trading volume, and he’s optimistic virtual land sales have a bright future — creating utility that drives people to major platforms like Bored Apes’ Otherside, The Sandbox and Decentraland is vital, he said.<\/span>","<span data-v-f87c67ca=\"\">“There’s been some exciting things happening with the metaverse in the Sandbox and Decentraland but I think the market is still down,” he said. “We’re not back into a gold rush just yet.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Huber","content":"PERSON"},{"type":"Brad Kay","content":"PERSON"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"Huber","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Metagame Group","content":"ORGANIZATION"},{"type":"quarter of 2023","content":"DATE"},{"type":"$311 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"32.46%","content":"PERCENT"},{"type":"67.52%","content":"PERCENT"},{"type":"$27,500","content":"MONEY"},{"type":"the first quarter","content":"DATE"},{"type":"Gherghelas","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"$28,500","content":"MONEY"},{"type":"Sara Gherghelas","content":"PERSON"},{"type":"Chennywong","content":"PERSON"},{"type":"29.57%","content":"PERCENT"},{"type":"$30 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Blur NFT","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"$27.1 million","content":"MONEY"},{"type":"70.36%","content":"PERCENT"},{"type":"Opensea","content":"PERSON"},{"type":"Opensea","content":"LOCATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Otherdeeds","content":"PERSON"}],"hashtag":["BAYC","OTHERSIDE","YUGA LABS"],"authors":["RT Watson","Lucy Harley-McKeown","The Block"]}