{"summary":"Decentralized exchange platform Orion Protocol suffered a $3 million hack on Thursday, caused by a reentrancy vulnerability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/208394\/decentralized-exchange-orion-protocol-hacked-for-3-million","publishDate":"2023-02-03T06:01:26","id":1287,"type":null,"title":"Decentralized exchange Orion Protocol hacked for $3 million","category":["CRYPTO ECOSYSTEMS"],"content":["Orion Protocol, a lesser-known decentralized exchange platform, suffered a major security hack on Thursday.","An attacker made off with a total of $3 million in project assets locked in its smart contracts on Ethereum and BNB Chain.","The exploit was carried out using a reentrancy technique, security firm PeckShield <a href=\"https:\/\/twitter.com\/peckshield\/status\/1621337925228306433\" data-v-f87c67ca=\"\">found<\/a>. A reentrancy vulnerability in a smart contract happens when an attacker repeatedly calls a function and extracts assets from it before the contract updates its internal state. The vulnerability can result from a bug in the smart contract or from insufficient security measures.","The Orion Protocol team acknowledged the hack and temporarily paused its deposit function. Orion Protocol CEO, Alexey Koloskov, <a href=\"https:\/\/twitter.com\/alexeykoloskov\/status\/1621269283178160128\" data-v-f87c67ca=\"\">claimed<\/a> that users did not lose any funds, only the company's funds were taken. \"We want to reassure our users that no user experienced any loss during this incident.\"","Koloskov <a href=\"https:\/\/twitter.com\/alexeykoloskov\/status\/1621269268959477763\" data-v-f87c67ca=\"\">added<\/a> that the vulnerability may have been introduced due to the development team's use of third-party software libraries to write the smart contracts. Going forward, Koloskov <a href=\"https:\/\/twitter.com\/alexeykoloskov\/status\/1621269276924563456\" data-v-f87c67ca=\"\">added<\/a> that the team will rely only on in-house developers to write their contracts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alexey Koloskov","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Koloskov","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Orion Protocol","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"}],"hashtag":["DEXS","HACKS"],"authors":["Vishal Chawla","The Block"]}