{"summary":"India is using its position as head of the G20 group of nations to advocate for the development of global rules for crypto assets.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242731\/india-uses-g20-presidency-to-strengthen-global-crypto-regulation","publishDate":"2023-08-02T08:46:59","id":1287,"type":null,"title":"India uses G20 presidency to strengthen global crypto regulation","category":["Policy"],"content":["India is keen to prioritize global coordination on cryptocurrency rules as head of the G20 group of nations.&nbsp;","The world's largest country by population has released a G20 presidency input note proposing a path for the development of globally coordinated rules for crypto assets. The international push for clearer policies on crypto assets has gained momentum under the Indian G20 Presidency, which began December 2022.","\"There is still need for coordination in consistent implementation of crypto asset regulations and guidance put in place by different jurisdictions. We hope this will help prioritize areas of work essential to achieving a comprehensive, cohesive and coordinated global policy and regulatory framework,\" the note said.","Tuesday's <a href=\"https:\/\/www.g20.org\/content\/dam\/gtwenty\/gtwenty_new\/document\/Presidency_note_on_Framework_for_Crypto_Assets.pdf\" data-v-f87c67ca=\"\">input note<\/a> concurs with Financial Stability Board (FSB) and the International Monetary Fund (IMF) guidelines which are set to be published in September. The coming IMF\/FSB paper will outline a regulatory and supervisory approach towards unbacked crypto assets, stablecoins and decentralized finance (DeFi). However, India has expanded on the framework with a range of action points addressed to the two international organizations.","India wants the IMF and FSB to examine regulatory arbitrage, the corporate practice of opting for jurisdictions with favorable laws. Other action points include calls for the <a href=\"https:\/\/www.theblock.co\/post\/236199\/imf-crypto-ban\" data-v-f87c67ca=\"\">IMF<\/a> to assess macro-financial risks associated with emerging market and developing economies. Outreach initiatives are suggested to raise awareness of risks, focusing on jurisdictions with high crypto adoption.","The FSB and IMF are tasked with implementing continuous oversight of crypto-asset risks, with an emphasize on cross-border information sharing, and consumer protection. The input note advised for the provision of technical assistance to regulators and monitoring standard implementation, coordinated by the IMF and <a href=\"https:\/\/www.theblock.co\/post\/194464\/fsb-global-crypto-regulation-2023\" data-v-f87c67ca=\"\">FSB<\/a>.","\"The IMF and FSB will have the responsibility to coordinate and work with all concerned international organizations and standard setters to formulate a work plan, time line and detailed roadmap within their mandate and in the areas relevant to them,\" the note said.","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The framework is informed by other international organizations that have developed specific regulatory framework's within their mandates.<\/span> The&nbsp;Financial Action Task Force&nbsp;(<a href=\"https:\/\/www.theblock.co\/linked\/152830\/fatf-to-publish-travel-rule-implementation-report-this-month\" data-v-f87c67ca=\"\">FATF<\/a>) imposed global anti-money laundering standards for crypto assets, including imposition of the Travel Rule. <\/span>","<span data-v-f87c67ca=\"\">The Organization for Economic Co-operation and Development (OECD) has brought out a Crypto Asset Reporting Framework, which provides for the automatic exchange of tax relevant information on crypto assets. And, the Basel Committee on Banking Supervision (BCBS) and Bank of International Settlements (BIS) have issued guidance for banks on crypto asset exposures and management risks.<\/span>"],"hashtag":["ASIAN REGULATION"]}