{"summary":"Bitcoin reached its highest point since August on Wednesday as crypto markets rallied in line with equities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212298\/bitcoin-price-reaches-6-month-high-above-24000","publishDate":"2023-02-15T18:02:06","id":12882,"type":null,"title":"Bitcoin price reaches 6-month high above $24,000","category":["MARKETS"],"content":["Bitcoin reached its highest point since Aug. 17, and its drawdown in 2022 might have something to do with it.&nbsp;","The leading cryptocurrency by market cap was trading at $24,260 by 5:30 p.m. EST, up 9%, according to TradingView data.&nbsp;","<a href=\"https:\/\/www.tradingview.com\/chart\/xAJYa739\/?symbol=COINBASE%3ABTCUSD\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BTCUSD chart by TradingView<\/span><\/a>","Bitcoin plunged 65% in 2022, which makes it an interesting liquidity play, according to Noelle Acheson, former head of market insights at Genesis.&nbsp;","\"BTC is one of the most sensitive liquidity plays right now – its whopping drawdown last year, its lack of cash flows to discount, its strong floor given its various use cases,\" she <a href=\"https:\/\/twitter.com\/NoelleInMadrid\/status\/1625943442516807699?s=20\" data-v-f87c67ca=\"\">said<\/a>.","Lower volatility in stocks and bonds, lower oil prices, and a weakening U.S. dollar have benefited bitcoin. The U.S. dollar index — a measure of the U.S. dollar versus a basket of six other currencies — has surrendered a significant portion of its gains from last year. The DXY reached a 24-year high of around 114 in September.&nbsp;","<a href=\"https:\/\/www.tradingview.com\/symbols\/TVC-DXY\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DXY chart by TradingView<\/span><\/a>","While there are other risk assets sensitive to a liquidity recovery, none has experienced as significant a drawdown as bitcoin — which benefits from \"long-term accumulators who see BTC as a store of value.\" The cryptocurrency also benefits from having no cash flows to discount, Acheson added, making it less susceptible to higher rates than stocks and less sensitive to adverse economic news coming down the line.&nbsp;","\"What it has is actual, potential, and growing utility, the valuation of which will move more on narrative than data,\" Acheson said, adding, \"BTC's narrative is multi-faceted; this also lends its floor strong support. For some, it's a store of value; for others, an early-stage liquid tech investment; for many, pure speculation, partially based on narratives driven by the first two. Complicated and fascinating.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$24,260","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Aug. 17","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"5:30 p.m. EST","content":"TIME"},{"type":"September","content":"DATE"},{"type":"Acheson","content":"PERSON"},{"type":"Noelle Acheson","content":"PERSON"}],"hashtag":["BITCOIN","COINBASE","ECONOMIC INDICATORS"],"authors":["Adam Morgan McCarthy","The Block"]}