{"summary":"ZkSync 2.0 will go live on mainnet before the end of 2021 and will support Ethereum’s two main scripting languages: Solidity and Vyper.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158740\/ethereum-scaling-solution-zksync-announces-mainnet-launch-in-100-days","publishDate":"2022-07-20T11:17:10","id":12887,"type":null,"title":"Ethereum scaling solution zkSync announces mainnet launch in 100 days","category":["LAYER 2S AND SCALING"],"content":["ZkSync, an Ethereum Layer 2 scaling solution, will go live on mainnet in the next three months, the project <a href=\"https:\/\/matterlabs.medium.com\/100-days-to-mainnet-6f230893bd73\" data-v-f87c67ca=\"\">announced<\/a> on Wednesday.","ZK stands for zero knowledge and zkSync is a scaling technology based on zero-knowledge rollups. ZkRollups is one of the methods used by Layer 2 networks to enable faster and cheaper transactions than is possible on the Ethereum mainnet. Other solutions include optimistic rollups, sidechains, and state channels.","According to the announcement by the project’s developer Matter Labs, zkSync 2.0 will be compatible with the Ethereum Virtual Machine (EVM) upon its launch. The project is hoping to become the first zk proof-based scaling solution for EVM smart contracts available in a live production environment upon its mainnet launch.","As such, zkSync will also support Solidity and Vyper, which are both scripting languages for EVM-based apps. The announcement also stated that zkSync 2.0 will have backward compatibility with older versions of the solutions. This is to make it easier for project developers to upgrade to the new version.","The mainnet launch will be a three-step process. The first stage will happen in November without any external projects. This will be followed by audits and then a fair alpha launch as the second stage. The final stage will be the full mainnet launch slated for the end of 2022.","Today’s announcement did not include any mention of a possible token for zkSync. Optimism, another Ethereum Layer 2 recently <a href=\"https:\/\/www.theblock.co\/linked\/149464\/optimisms-governance-token-officially-goes-live\" data-v-f87c67ca=\"\">launched its native token<\/a>, while StarkNet has <a href=\"https:\/\/www.theblock.co\/post\/157323\/starkware-confirms-launch-of-starknet-token-with-no-airdrops-until-next-year\" data-v-f87c67ca=\"\">announced<\/a> that it is launching one.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["ETHEREUM","ZKSYNC"],"authors":["Osato Avan-Nomayo","The Block"]}