{"summary":"The Singapore High Court has granted Zipmex just over three months to resolve its liquidity issues, a source tells The Block.\nThe troubled crypto exchange was seeking six months for its moratorium extension.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163503\/zipmex-three-month-moratorium-extension","publishDate":"2022-08-15T03:48:57","id":1288,"type":null,"title":"Zipmex gets over three-month moratorium extension to resolve its liquidity crisis","category":["Asia"],"content":["Troubled South Asian crypto exchange Zipmex, which abruptly halted client withdrawals last month and sought protection from creditors, has received just over three months to sort out its liquidity issues, a source with direct knowledge of the matter told The Block.","The Singapore High Court granted Zipmex Group a moratorium extension until December 2 at a hearing today, the source said. Zipmex Group had initially sought an extension of up to six months for its five entities: Zipmex, Zipmex Asia, Zipmex Thailand, Zipmex Indonesia and Zipmex Australia, to avoid any potential creditor lawsuits.","Asian crypto lender <a href=\"https:\/\/www.theblock.co\/post\/160510\/vauld-gets-three-month-moratorium-extension-to-continue-exploring-options\" data-v-f87c67ca=\"\">Vauld<\/a>, which like Zipmex halted withdrawals in July, also received a three month moratorium extension&nbsp;earlier this month from the Singapore High Court to continue exploring its options.&nbsp;","Zipmex's liquidity crisis was triggered by exposure to Babel Finance and Celsius, two crypto lenders that suspended withdrawals in June. As a result, Zipmex itself was forced to briefly pause withdrawals before resuming them for certain assets. It&nbsp;is currently working towards resolving the situation in the hope of re-enabling fund transfers between its Z and Trade wallets.","Zipmex's Z wallet allowed users to opt for its ZipUp+ feature to deposit their crypto holdings and earn rewards. The Trade wallet allowed users to deposit fiat currency and trade and store cryptocurrencies. This wallet also enables fiat and crypto withdrawals.&nbsp;","Since halting transfers and withdrawals last month, Zipmex has gradually resumed operations, transferring unaffected crypto assets from customers’ Z wallets to their Trade wallets, including solana (SOL), XRP and cardano (ADA). Zipmex recently said it plans to gradually transfer bitcoin (BTC) and ether (ETH) in phases to all customers as well.&nbsp;","“We remain committed to complete transfers of all customers’ assets in a gradual manner and to accelerating all actions to resume the full service of Z Wallet,” said the firm.","Zipmex is currently <a href=\"https:\/\/www.theblock.co\/post\/158895\/zipmex-says-its-exploring-all-available-options\" data-v-f87c67ca=\"\">seeking to raise funds<\/a>. It recently <a href=\"https:\/\/zipmex.com\/announcements\/official-statement-gl-010822\/\" data-v-f87c67ca=\"\">said<\/a> it had signed a memorandum of understanding with two investors. \"As we know this is time-critical, Zipmex and its investors are expediting due diligence as much as possible to bring forward a resolution for customers,\" it added.&nbsp;"],"hashtag":[]}