{"summary":"MIT and Harvard alumni have teamed up to launch a startup accelerator focused on supporting early-stage web3 founders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281396\/mit-harvard-blockchain-accelerator-web3-crypto","publishDate":"2024-03-08T12:00:02","id":12899,"type":null,"title":"MIT and Harvard alumni launch startup accelerator to support web3 founders","category":["COMPANIES"],"content":["Massachusetts Institute of Technology and Harvard alumni have teamed up to launch a startup accelerator focused on supporting early-stage web3 founders associated with either institution.","The accelerator, dubbed MIT x Harvard Blockchain Accelerator, is a non-dilutive program, meaning it will not make any investments in accepted startups. \"The accelerator does not take any equity in the startups we accelerate,\" Sam Lehman, a core contributor to the accelerator, told The Block. \"We do not have any plans to invest or offer grants in the near term; we are focused on pure mentorship.\"","Lehman, Luke Xie, and Hannah Shen from MIT, along with Liang Wu from Harvard, are the four core contributors to the accelerator.","The accelerator's founding mentors are also from either of the two institutions, including Tieshun Roquerre, aka \"Pacman,\" the founder of the NFT marketplace Blur and the Ethereum Layer 2 Blast; Keone Hon and Eunice Giarta, co-founders of Layer 1 blockchain developer Monad Labs; Kenny Li, co-founder of Layer 2 network Manta; and Mirza Uddin, head of business development at Injective Labs, the maker of a Cosmos-based Layer 1 blockchain network.","Some unidentified members from crypto firms, including a16z, Avalanche, Dragonfly, Galaxy Digital, Nascent and Polygon, are also the accelerator's mentors. Lehman said that he cannot name these individuals explicitly due to the policies of these respective firms.","To become part of the accelerator, startups' founding teams must also have at least one member associated with either of the two institutions, Lehman said. They could be current students (undergraduate or graduate), alumni, faculty, researchers and staff, he said.","<a href=\"https:\/\/sba.sites.stanford.edu\/accelerator-teams\" data-v-f87c67ca=\"\">Stanford University also runs<\/a> a similar blockchain accelerator that has launched companies like Modulus Labs, Nocturne, Zero Gravity and Caldera.","The accelerator's first cohort program will begin next month and conclude in June. The core contributors are currently accepting applications. They, along with leaders of the two institutions' student clubs, will then review all applications and make final decisions on whom to take in the cohort, Lehman said.","When asked how the accelerator stands to gain since it is non-dilutive, Lehman said the program's goal is to \"make the MIT &amp; Harvard alumni ecosystems and the broader Cambridge crypto ecosystem as strong as possible.\"","Lehman is also a core contributor at the Beacon accelerator, which was <a href=\"https:\/\/www.theblock.co\/post\/196492\/polygon-co-founder-launches-web3-startup-accelerator-beacon\" data-v-f87c67ca=\"\">launched<\/a> in 2022 by Polygon co-founder Sandeep Nailwal. Beacon is part of Nailwal's crypto venture firm Symbolic Capital, where Lehman is also a principal. Lehman said the MIT x Harvard blockchain accelerator is \"completely separate\" from his work with Beacon.","As well, Xie is also involved with Press Start Capital, a fellowship program or pre-accelerator for crypto founders. Lehman said Xie's work with the accelerator is also completely separate from his work at Press Start.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Luke Xie","content":"PERSON"},{"type":"Keone Hon","content":"ORGANIZATION"},{"type":"Harvard","content":"LOCATION"},{"type":"Mirza Uddin","content":"PERSON"},{"type":"Injective Labs","content":"ORGANIZATION"},{"type":"Hannah Shen","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kenny Li","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Liang Wu","content":"PERSON"},{"type":"Eunice Giarta","content":"PERSON"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"Harvard Blockchain Accelerator","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cambridge","content":"LOCATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Press Start Capital","content":"ORGANIZATION"},{"type":"Lehman","content":"PERSON"},{"type":"Xie","content":"PERSON"},{"type":"Harvard","content":"ORGANIZATION"},{"type":"Beacon","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Massachusetts Institute of Technology","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"Nocturne","content":"LOCATION"},{"type":"Nailwal","content":"ORGANIZATION"},{"type":"Symbolic Capital","content":"ORGANIZATION"},{"type":"Sam Lehman","content":"PERSON"},{"type":"Caldera","content":"PERSON"},{"type":"MIT x Harvard","content":"ORGANIZATION"},{"type":"MIT &amp; Harvard","content":"ORGANIZATION"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Manta","content":"LOCATION"},{"type":"June","content":"DATE"}],"hashtag":["ANDREESSEN HOROWITZ","DRAGONFLY CAPITAL"],"authors":["Yogita Khatri","The Block"]}