{"summary":"Ethereum creator Vitalik Buterin has criticized El Salvador president Nayib Bukele for forcing businesses in the country to adopt bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119980\/vitalik-buterin-calls-out-bitcoin-maximalists-el-salvador-comments","publishDate":"2021-10-09T10:52:47","id":12897,"type":null,"title":"Buterin calls out &#x27;Bitcoin maximalists&#x27; for supporting El Salvador president","category":["BITCOIN"],"content":["Ethereum creator Vitalik Buterin criticized El Salvador president Nayib Bukele on Friday for forcing businesses in the country to adopt bitcoin. Buterin also called out \"Bitcoin maximalists\" for supporting Bukele.","\"Making it mandatory for businesses to accept a specific cryptocurrency is contrary to the ideals of freedom that are supposed to be so important to the crypto space,\" Buterin <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/q3udz3\/comment\/hfv3zee\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">wrote<\/a> in a Reddit post.&nbsp;","Last month, bitcoin became legal tender in El Salvador. It is optional for the country's individuals to use the cryptocurrency, but all companies <a href=\"https:\/\/www.theblockcrypto.com\/news+\/118348\/a-whos-who-behind-el-salvadors-chivo-bitcoin-wallet-project\" data-v-f87c67ca=\"\">must accept bitcoin<\/a> as long as they have the technology to do so.","\"Every economic agent must accept bitcoin as payment when offered to him by whoever acquires a good or service,\" article 7 of <a href=\"https:\/\/twitter.com\/nayibbukele\/status\/1402446890466217985\/photo\/2\" data-v-f87c67ca=\"\">El Salvador's Bitcoin Law<\/a> reads. \"Those who, by evident and notorious fact, do not have access to the technologies that allow them to carry out transactions in bitcoin are excluded from the obligation expressed in Art. 7 of this law. The State will promote the necessary training and mechanisms so that the population can access bitcoin transactions.\"","This strategy of pushing bitcoin to people with almost no prior attempt to educate them is \"reckless\" and \"risks a large number of innocent people getting hacked or scammed,\" according to Buterin.","\"Shame on everyone (ok, fine, I'll call out the main people responsible: shame on Bitcoin maximalists) who are uncritically praising him [Bukele],\" wrote Buterin.","Would Buterin say the same things about Ethereum maximalists if El Salvador selected ether (ETH) as legal tender? Asked one Reddit user.","Buterin responded by <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/q3udz3\/comment\/hfy13na\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">saying<\/a> that he had criticized Ethereum users and applications several times. Elsewhere in the thread, he said mandating \"a specific cryptocurrency\" is opposed to crypto's idea of freedom.","Another Reddit user wondered if Bukele bought bitcoin at a low price and he wanted it to go up, so he brought the bitcoin law into the country. That is a \"simpler and dumber hypothesis,\" <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/q3udz3\/comment\/hfvf386\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">according to Buterin<\/a>.","\"Both for political reasons and because he's a human being like the rest of us, he just loves being praised by people he considers powerful (ie. Americans). Bitcoin maximalists are a very easy community to get to praise you: you just have to be in a position of power and do or say nice things about them and their coin,\" said Buterin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"State","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"El Salvador","content":"LOCATION"},{"type":"Art. 7","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Nayib Bukele","content":"PERSON"},{"type":"El Salvador","content":"ORGANIZATION"}],"hashtag":["BITCOIN","ETHEREUM"],"authors":["Yogita Khatri","The Block"]}