{"summary":"Starknet Foundation clarified a draft airdrop plan is still under development and will be shared when details are finalized.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265588\/starknet-foundation-confirms-screenshots-showing-draft-airdrop-plans-says-snapshot-already-taken","publishDate":"2023-12-01T05:28:25","id":12892,"type":null,"title":"Starknet Foundation confirms screenshots showing draft airdrop plans, says snapshot already taken","category":["CRYPTO ECOSYSTEMS"],"content":["The Starknet Foundation, the organization behind the Ethereum Layer 2 network Starknet, addressed speculations about its forthcoming airdrop, which arose following the circulation of two <a href=\"https:\/\/twitter.com\/Auri_0x\/status\/1730231069692023016\" data-v-f87c67ca=\"\">screenshots<\/a> on social media.","This screenshots, taken from pages that briefly appeared on Starknet’s website, led to widespread user speculation. They showed a list of criteria for the airdrop, explaining what kinds of crypto activity would qualify an address for the airdrop. But the pages appeared to be an early draft since some of the copy was missing and the project's own name was misspelt.","On the incident, the Starknet Foundation said,&nbsp; “Tech teams build and test different front ends, some of which see the light of day and some which don’t.”","The foundation emphasized that the screenshots depicted draft plans still under development. “We will share the finalized official criteria and details around the provision allocations when they are ready,” it said.","Additionally, the foundation confirmed an eligibility cutoff date for the airdrop has already been determined, making it clear that no further user actions would affect eligibility.","The plan concerning an airdrop is not unexpected. The possibility of a community reward had already been mentioned a year ago during an announcement about a Stark token.","In an 2022 <a href=\"https:\/\/www.theblock.co\/post\/157323\/starkware-confirms-launch-of-starknet-token-with-no-airdrops-until-next-year\" data-v-f87c67ca=\"\">announcement<\/a>, the Starknet Foundation detailed that a total of 10 billion Stark (STRK) tokens would be issued. Of these, 50% would be retained by the organization, with the remainder allocated to core developers, ecosystem contributors, and the community.","Starknet operates as a decentralized Layer 2 network on Ethereum, employing a zero-knowledge roll-up solution. This approach involves condensing multiple transactions on an off-chain layer and then publishing them collectively on the Ethereum network.","StarkWare, known for inventing the Stark cryptographic proofs mechanism, was the original architect of Starknet. The project’s development is now led by the Starknet Foundation.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Starknet Foundation","content":"ORGANIZATION"}],"hashtag":["STARKNET"],"authors":["Vishal Chawla","The Block"]}