{"summary":"Recently, Topia launched the first Layer2 shared data availability layer protocol at the Montenegro Edcon Super Demo, aiming to bring an interconnected data availability layer to Ethereum&#x27;s Layer2 and to connect data availability for thousands of future Layer2s.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231585\/topia-releases-the-first-layer2-shared-da-layer-protocol-at-montenegro-edcon-super-demo","publishDate":"2023-05-20T09:00:54","id":12906,"type":null,"title":"Topia Releases the First Layer2 Shared DA Layer Protocol at Montenegro Edcon Super Demo","category":["SPONSORED"],"content":["&nbsp;","&nbsp;","<span data-v-f87c67ca=\"\">Since Celestia introduced a modular blockchain architecture, Data Availability (DA) has become a separate module to address the challenge of blockchain scalability. With Ethereum's Layer2 becoming increasingly abundant, the issue of data availability in Layer2 is becoming more urgent. Recently, Topia launched the first Layer2 shared data availability layer protocol at the Montenegro Edcon Super Demo, aiming to bring an interconnected data availability layer to Ethereum's Layer2 and to connect data availability for thousands of future Layer2s.<\/span>","<span data-v-f87c67ca=\"\">Unlike other DA projects like Celestia and Polygon Avial, which create a DA for their own blockchains, Topia is creating a shared DA layer for all future Ethereum Layer2s. Therefore, Topia will seamlessly integrate with Ethereum's mature Layer2 and developer ecosystem.<\/span>","<span data-v-f87c67ca=\"\">Topia will create a dedicated Layer2 for this DA layer network. On this Layer2, Topia's storage can be seamlessly integrated and undergo specific optimizations, such as supporting concurrent transactions and allowing contracts to directly access Topia storage. This is an important step towards achieving the ideal of \"Layer2 Interconnection\". All applications built on Topia storage and Layer2, regardless of their diversity and quantity, will share the same Topia storage.<\/span>","","","<span data-v-f87c67ca=\"\">This provides a native solution for cross-chain communication. At the Montenegro Edcon Super Demo Day, Topia released a Proof of Concept (POC) for cross-chain communication implemented through the shared DA layer, becoming the first Layer2 shared DA layer protocol.<\/span>","<span data-v-f87c67ca=\"\">Topia's future vision is to achieve two phases of goals for the Ethereum ecosystem: <\/span><span data-v-f87c67ca=\"\">First, to provide a shared DA layer specifically optimized for Ethereum Layer2; <\/span><span data-v-f87c67ca=\"\">Second, to enable data communication between Layer2s, realizing \"Layer2 Data Interconnection\"!<\/span>","<span data-v-f87c67ca=\"\">On top of Topia's data interconnected shared DA layer network, unique \"cross-Layer2 data applications\" will grow, ranging from NFT and NFT exchanges across all Layer2, to social media, personal data markets, and blockchain games, and so on. Imagine, your blockchain game equipment data on Arbitrum can be seamlessly used on Scroll; your personal credit data accumulated on OP can be seamlessly invoked on ZKSync. Layer2 data will no longer be independent rivers but a fully circulating ocean, and Topia is the vital canal connecting all Layer2 data rivers.<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Topia","content":"ORGANIZATION"},{"type":"Celestia","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Montenegro Edcon Super Demo Day","content":"ORGANIZATION"},{"type":"Montenegro Edcon Super Demo","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Polygon Avial","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Data Availability (DA)","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}