{"summary":"ConsenSys CEO Joseph Lubin said that he thinks The Merge will be enormously impactful and that there will be little disruption to the end user.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169870\/consensys-ceo-joseph-lubin-the-merge-will-be-enormously-impactful","publishDate":"2022-09-14T05:45:01","id":12900,"type":null,"title":"ConsenSys CEO Joseph Lubin: The Merge will be ‘enormously impactful’","category":["THE MERGE"],"content":["<span data-v-f87c67ca=\"\">ConsenSys CEO Joseph Lubin said that he thinks The Merge will be \"enormously impactful\" and that there will be little disruption to the end user.<\/span>","<span data-v-f87c67ca=\"\">In an <\/span><a href=\"https:\/\/twitter.com\/BloombergTV\/status\/1569766854649946116\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">interview<\/span><\/a><span data-v-f87c67ca=\"\"> with Bloomberg TV on The Merge, the Ethereum co-founder also described the event as \"probably nothing,\" explaining that it will be “very likely nothing in the sense that there is no disruption that’s going to be experienced by end users.”<\/span>","<span data-v-f87c67ca=\"\">He added, “It’ll be as smooth as if your iPhone or your laptop has upgraded its operating system automatically overnight.”<\/span>","<span data-v-f87c67ca=\"\">ConsenSys is the blockchain software technology company behind crypto wallet MetaMask and Ethereum infrastructure platform Infura. It recently <\/span><a href=\"https:\/\/www.theblock.co\/linked\/154855\/consensys-starkware-ink-deal-to-bring-zk-rollups-to-metamask-and-infura\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">inked a deal<\/span><\/a><span data-v-f87c67ca=\"\"> with StarkWare to bring ZK-rollups to those products.<\/span>","<span data-v-f87c67ca=\"\">Lubin closed off the interview by discussing the history of the ecosystem, suggesting that The Merge was the third major event to happen in crypto after the advent of Bitcoin and the development of Ethereum.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bloomberg TV","content":"ORGANIZATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"2023","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["James Hunt","The Block"]}