{"summary":"The Optimism hacker has fulfilled a promise to return the coins but only transferred 17 million out of the 18 million OP tokens in their wallet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/151344\/hacker-returns-17-million-op-tokens","publishDate":"2022-06-10T09:51:18","id":12909,"type":null,"title":"Hacker returns 17 million OP tokens","category":["HACKS"],"content":["The exploiter who stole 20 million Optimism (OP) tokens from crypto market maker Wintermute has returned 17 million of those coins to the Optimism contract address.","Data from Etherscan show 17 transfers of 1 million OP tokens each <a href=\"https:\/\/optimistic.etherscan.io\/tx\/0xa2018ca667390d7f6026fab6b114a7b1e6272a68463b895f3c370da024459674\" data-v-f87c67ca=\"\">beginning<\/a> at 12:09 PM UTC with the final transaction happening at 12: 31 PM UTC Friday.","\"We see today’s news as a very positive development: the Optimism foundation has been made whole and can focus on building and growing the ecosystem. The person who discovered the exploit chose to wear a white hat, setting a good precedent for the whole crypto community. And Wintermute, while having to accept the bounty as a loss, can now fully focus on providing liquidity for the OP token,\" said a spokesperson for Wintermute.","The exploiter still has 1 million OP tokens left in the wallet as of the time of publishing. The attacker previously sent 1 million coins <a href=\"https:\/\/www.theblockcrypto.com\/post\/151039\/optimism-exploiter-sends-1-million-op-tokens-to-vitalik-buterins-wallet\" data-v-f87c67ca=\"\">to Ethereum co-creator Vitalik Buterin<\/a> and also sold another 1 million immediately following the hack.","By returning the funds, the attacker has made good on an <a href=\"https:\/\/www.theblockcrypto.com\/post\/151039\/optimism-exploiter-sends-1-million-op-tokens-to-vitalik-buterins-wallet\" data-v-f87c67ca=\"\">earlier promise to do so<\/a>, albeit, 3 million tokens short. Wintermute had initially given the hacker one week to return the funds while promising not to pursue any legal actions.","The hacker was able to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/150966\/attacker-snipes-20-million-op-tokens-intended-for-wintermute-loan\" data-v-f87c67ca=\"\">access the funds<\/a> because Wintermute provided an undeployed multi-signature wallet to Optimism to receive a 20 million OP token grant from the latter.","<em data-v-f87c67ca=\"\">This article has been updated with a comment from Wintermute.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Wintermute","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"}],"hashtag":["OPTIMISM","WINTERMUTE"],"authors":["Osato Avan-Nomayo","The Block"]}