{"summary":"Decrypt and Rug Radio, two Web3-focused news organizations, have signed a letter of intent to merge their operations next year, according to Axios.","author":["Zack Abrams","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266890\/decrypt-rug-radio-to-combine-in-merger-of-equals-axios","publishDate":"2023-12-10T12:13:48","id":1291,"type":null,"title":"Decrypt, Rug Radio to combine in &#x27;merger of equals&#x27;: Axios","category":["Mergers &amp; Acquisitions"],"content":["Crypto and Web3 news site Decrypt and decentralized, creator-focused media project Rug Radio will merge operations next year, combining forces while retaining brand independence, according to a <a href=\"https:\/\/www.axios.com\/2023\/12\/10\/decrypt-rug-radio-merge-crypto\" data-v-f87c67ca=\"\">report<\/a> from Axios.","The merger is seen as complementary, with Decrypt's text-focused content on its website pairing with Rug Radio's audio and video podcast content. Josh Quittner, the CEO of Decrypt, Farokh Sarmad, founder and co-CEO of Rug Radio, and Loxley Fernandes, Rug Radio's other CEO, will maintain leadership positions of the new holding company.&nbsp;","The brands will retain their branding, identity, and staff. Each company claimed around $3 million in annual revenue from ad sales and said its employees would remain with the organizations following the merge, which Fernandes described as a \"merger of equals.\"&nbsp;","The announcement comes at a particularly active time for crypto media deals. Bullish, a crypto exchange run by Ex-NSE President Tom Farley, recently <a href=\"https:\/\/www.theblock.co\/post\/263788\/ex-nyse-president-tom-farleys-bullish-buys-coindesk-in-all-cash-deal\" data-v-f87c67ca=\"\">purchased<\/a> crypto news outlet CoinDesk in an all-cash deal, while Singaporean venture capital firm Foresight Ventures recently purchased a majority interest in <a href=\"https:\/\/www.axios.com\/pro\/fintech-deals\/2023\/11\/13\/the-block-70-million-foresight-ventures\" data-v-f87c67ca=\"\">The Block<\/a>.&nbsp;"],"hashtag":["PRIVATE COMPANY M&AMP;A"]}