{"summary":"The Bank of International Settlements published a plan to protect CBDCs against cyber attacks originating from the DeFi domain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238319\/bank-of-international-settlements-plans-to-protect-cbdcs-from-defi-cyber-attacks","publishDate":"2023-07-07T10:25:03","id":12912,"type":null,"title":"BIS plans to protect CBDCs from DeFi cyber attacks","category":["POLICY"],"content":["The Bank of International Settlements published a plan to protect central bank digital currencies against the same sort of hacks and breaches that plague the market for decentralized finance.&nbsp;","The <a href=\"https:\/\/www.bis.org\/publ\/othp70.htm\" data-v-f87c67ca=\"\">framework<\/a> targets risks found in the DeFi sector that could threaten CBDCs that utilize DLT and smart contracts technology.","\"The large-value attacks on DLT protocols and smart contracts in the DeFi space underscore the potential operational and reputational risks,\" the report stated. \"Recent examples of smart contract hacks, which have led to the loss of a significant amount of value in DeFi, serve as an example of the potential security risks <a href=\"https:\/\/www.theblock.co\/post\/237790\/bank-of-england-teams-up-with-wallet-maker-for-cbdc-privacy\" data-v-f87c67ca=\"\">CBDC systems<\/a> could face.\"","The study said the rise of internet, telecommunication networks and devices has resulted in a diverse, complex, and swiftly evolving cyber threat landscape. The BIS suggests these risks could extend to DLT-related attacks against consensus protocols, cross-chain bridges, oracles, and smart contracts, as well as offline CBDC components.","The <a href=\"https:\/\/www.theblock.co\/post\/235800\/bis-makes-case-for-unified-ledger-but-describes-crypto-as-a-flawed-system\" data-v-f87c67ca=\"\">BIS framework<\/a>, published Thursday, is part of Project Polaris that's aiming to create \"secure and resilient CBDC systems, offline and online.\"","Project Polaris plans to give global central banks a framework for CBDC design, implementation, planning and operational considerations.","The BIS framework suggests central banks upgrade their procedures to fend off these type of attacks, and create \"security and resilience functional teams.\" These teams would be involved in each phase of a CBDC program to ensure requirements are implemented to counteract cyber attacks.","\"Central banks should recognize the complexity and new threat landscape brought by CBDC systems, adopt modern enabling technologies supporting security and resilience where appropriate,\" the report added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polaris","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"DLT","content":"ORGANIZATION"},{"type":"BIS","content":"ORGANIZATION"},{"type":"Bank of International Settlements","content":"ORGANIZATION"}],"hashtag":["CBDCS"],"authors":["Brian McGleenon","Frank Chaparro","The Block"]}