{"summary":"A CFTC commissioner proposed splitting the definition for retail customer between household","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177330\/cftc-commissioner-proposes-new-tiered-retail-customer-definitions","publishDate":"2022-10-14T15:40:36","id":12910,"type":null,"title":"CFTC commissioner proposes new, tiered retail customer definitions","category":["POLICY"],"content":["Commodities Futures Trading Commissioner Christy Goldsmith Romero is proposing a new retail investor definition for her agency, she said during a financial conference on Friday.","“I’m proposing a new definition of retail that divides between household retail, and then professional and high net worth,” Goldsmith Romero said. “Therefore we can tailor rules to one group and the other.”<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","As it stands now, the CFTC definition of a retail customer is an individual with total assets that do not exceed $10 million, or $5 million if the individual is entering into an agreement, contract or transaction to manage risk, as long as the customer does not qualify as an eligible contract participant under other regulations. The definition for retail is so broad, the commissioner noted, that it includes people who make less than $50,000 in the markets to hedge funds that make millions of dollars.","“What I propose is that we break that definition of retail in two, and then we can target rules and regulations to regular household people that may not be needed for a hedge fund or a millionaire. And then we can expand access,” Goldsmith Romero said. “There's a great opportunity to expand access to financial markets.”<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The growing digital asset market was the catalyst for Goldsmith Romero’s new proposal, the commissioner told The Block in a telephone interview. Sixteen percent of Americans have purchased digital assets, according to a digital asset <a href=\"https:\/\/www.whitehouse.gov\/briefing-room\/statements-releases\/2022\/09\/16\/fact-sheet-white-house-releases-first-ever-comprehensive-framework-for-responsible-development-of-digital-assets\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"0\" data-v-f87c67ca=\"\"><span class=\"x_s1\" data-v-f87c67ca=\"\">report<\/span><\/a> released by the White House.","Goldsmith Romero is weighing whether to split the new definitions based on a dollar amount, or differentiate between the two tiers using other factors, like whether an investor is a licensed securities professional. Goldsmith Romero said her goal is to expand access to financial markets for regular people, and that she was driven by President Joe Biden’s executive order on digital assets.<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“If we continue to think of retail as including hedge funds, as including, you know, someone with up to $10 million, some millionaire with eight, nine, ten million dollars, we’re not really targeting our customer protections in a way that is going to be safe and affordable,” Goldsmith Romero said.<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The CFTC commissioner plans to release a written proposal soon and will seek input from the public and policymakers on what a new definition should look like.<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The Democratic commissioner first mentioned her plan at the Financial Markets Quality Conference hosted by Georgetown University's McDonough School of Business. Goldsmith Romero appeared with Securities and Exchange Commissioner Mark Uyeda, a Republican appointee.&nbsp;","The hourlong discussion also touched on other aspects of digital assets. Washington lawmakers and regulators are paying increased attention to the crypto industry after this spring’s market crash.<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The lack of regulation in crypto markets could lead “the most vulnerable people” to get hurt, Goldsmith Romero noted, because many investors in the United States are used to having consumer protections. Uyeda echoed that view, saying regulation shouldn’t “strangle the market” but help it prosper.<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“You want to invest in a regulated market. I think we just start there. Let's start at the top. Let’s get it regulated,” Goldsmith Romero said.<span class=\"x_apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goldsmith Romero","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"McDonough School of Business","content":"ORGANIZATION"},{"type":"ten million dollars","content":"MONEY"},{"type":"White House","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"Securities and Exchange Commissioner Mark Uyeda","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Georgetown University","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"Financial Markets Quality Conference","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Stephanie Murray","The Block"]}