{"summary":"Derivatives protocol dYdX announced on Monday that Charles d’Haussy will serve as the chief executive officer of the independent dYdX Foundation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175875\/dydx-hires-former-consensys-director-as-foundation-ceo","publishDate":"2022-10-10T10:18:13","id":12914,"type":null,"title":"dYdX hires former ConsenSys director as foundation CEO","category":["HIRING"],"content":["dYdX, the derivatives protocol, has tapped Charles d’Haussy as the new chief executive of its foundation.","Charles d’Haussy, who previously spent almost four years working at ConsenSys most recently as global head of business development, was announced as CEO of the foundation on Monday. The dYdX Foundation is independent not-for-profit foundation based in Switzerland and set up to grow awareness of the protocol.","In his role as CEO, he will be expected to drive growth and develop the dYdX protocol, community, and dYdX DAO. The new chief executive <a href=\"https:\/\/dydx.foundation\/blog\/welcome-charles-dhaussy-as-ceo-of-dydx-foundation\" data-v-f87c67ca=\"\">said<\/a> he is keen to work with the technology, community and staff at dYdX, in order to democratize access to financial opportunities.","d’Haussy's cross-industry experience of engaging with different stakeholders will be valuable to the foundation, as it works toward its next stage of growth, according to Arthur Cheong, president of the dYdX Foundation council.&nbsp;","While the announcement was made on Monday d'Haussy began working with the Foundation on September 26, he told The Block via Twitter.&nbsp;","<em data-v-f87c67ca=\"\">Correction: Updated to reflect Charles d’Haussy's most recent role at ConsenSys was global head of business development.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles d’Haussy","content":"PERSON"},{"type":"Foundation","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"September 26","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"dYdX Foundation","content":"ORGANIZATION"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}