{"summary":"Reddit Data DAO, or r\/datadao, reward users for contributing their Reddit data and lets users vote on what to do with the collective data.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286311\/paradigm-backed-startup-vana-launches-dao-letting-reddit-users-control-their-personal-data","publishDate":"2024-04-03T15:27:08","id":12924,"type":null,"title":"Vana launches DAO helping Reddit users control their personal data","category":["COMPANIES"],"content":["Vana, a San Francisco-based startup letting users control their personal data, launched a data decentralized autonomous organization (DAO) for the social media platform Reddit.&nbsp;","Called the Reddit Data DAO, or r\/datadao, the platform rewards users for contributing their Reddit data and lets them vote on what to do with the collective data, such as renting it out to AI companies for model training. It's also the first data DAO launched on Vana, the firm's CEO Anna Kazlauskas told The Block.&nbsp;","The DAO offers an alternative to <a href=\"https:\/\/www.theblock.co\/post\/258016\/reddit-plans-to-sunset-its-blockchain-based-reward-service-community-points\" data-v-f87c67ca=\"\">Reddit<\/a> negotiating a deal with AI firms to sell user data, which could net Reddit <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2024-02-16\/reddit-is-said-to-sign-ai-content-licensing-deal-ahead-of-ipo\" data-v-f87c67ca=\"\">$60 million<\/a> annually. In the coming years, Reddit could make over $200 million in revenue from selling user data to third parties to train AI models, Wired <a href=\"https:\/\/www.wired.com\/story\/reddits-sale-user-data-ai-training-draws-ftc-investigation\/\" data-v-f87c67ca=\"\">reports<\/a>.&nbsp;","\"Why is that $200 million going straight to Reddit rather than the users who actually created the data?\" <a href=\"https:\/\/www.rdatadao.org\/home\" data-v-f87c67ca=\"\">writes<\/a> Reddit Data DAO on its website. \"r\/datadao can vote to use the data to start our own version of Reddit, directly sell our data to AI companies or use our collective power to get Reddit to pay us directly.\"","Users incorporate their <a href=\"https:\/\/www.theblock.co\/post\/278723\/reddit-holds-immaterial-amounts-of-bitcoin-and-ether-on-its-books\" data-v-f87c67ca=\"\">Reddit<\/a> account and personal data onto the DAO. The DAO then gives the user rewards for uploading their personal data and Reddit Karma, or a community point system reflecting someone's reputation on Reddit. Users can claim their points in a crypto wallet. \"The more you contribute, the greater your share of the karma points,\" the DAO added.","Vana also announced on Wednesday that it raised $18 million in a funding round in 2022, which had previously not been public, according to a company spokesperson.","<a href=\"https:\/\/www.theblock.co\/post\/286147\/paradigm-in-talks-of-raising-up-to-850-million-for-new-crypto-fund-report\" data-v-f87c67ca=\"\">Paradigm<\/a> led that round, which saw additional support from Casey Caruso, Packy McCormick and Polychain Capital. Kazlauskas confirmed that Vana's total funding to date is $20 million.","\"Major internet platforms often hoard information and content generated by users, and are building the next big technological wave with that data — without the permission of users,\" Kazlauskas said. \"At Vana, we believe users should have control over their data and ownership in the models they help create.\"","\"Today’s launch of the Reddit Data DAO is part of that effort, as it establishes a community-owned data treasury that allows users to sell their data to AI companies, leverage the treasury to negotiate for compensation from Reddit, or seed content on a new, user-owned platform,\" Kazlauskas added.","The Reddit Data DAO is the first data DAO Vana offers as a way for users to take control from Big Tech firms over their data.&nbsp;","\"A data DAO is a decentralized entity that allows users to pool and govern their data, rewarding contributors with a dataset-specific token that represents ownership of the particular dataset,\" Kazlauskas wrote in a Tuesday <a href=\"https:\/\/anna.kazlausk.as\/posts\/data-daos\" data-v-f87c67ca=\"\">post<\/a>. \"It’s a bit like a labor union for data.\"&nbsp;","Vana's name derives from the Buddhist term \"Nirvana\" to reference setting data free. The firm was founded in 2021 and has since amassed 1.1 million users and trained over 700,000 AI models, according to Vana's website.","<em data-v-f87c67ca=\"\">(Corrects the number of Vana's users.)<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Vana","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"DAO Vana","content":"ORGANIZATION"},{"type":"Vana","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Casey Caruso","content":"PERSON"},{"type":"Reddit Data DAO","content":"ORGANIZATION"},{"type":"$60 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Kazlauskas","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"Anna Kazlauskas","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Packy McCormick","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"Reddit Karma","content":"LOCATION"}],"hashtag":["DAOS","IDENTITY"],"authors":["MK Manoylov","The Block"]}