{"summary":"Experts think the move by HMRC is a sign of changing attitudes to targeting this relatively new area.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134462\/why-the-uk-authorities-1-4-million-nft-seizure-isnt-groundbreaking","publishDate":"2022-02-16T11:58:12","id":12932,"type":null,"title":"Why the UK authorities’ £1.4 million NFT seizure isn’t groundbreaking","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Cyber security officials poured cold water on the idea that a recent move to seize crypto assets in the UK, including three NFTs, had broken new ground.&nbsp;<\/span>","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/134088\/uk-taxman-siezes-first-nfts-in-1-4-million-fraud-probe\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Earlier this week<\/span><\/a><span data-v-f87c67ca=\"\">, the UK’s tax authority arrested three people on suspicion of attempting to defraud it of £1.4 million.<\/span>","<span data-v-f87c67ca=\"\">HM Revenue and Customs (HMRC) said the move to recover NFTs was a first, and part of a probe into a suspected Value Added Tax (VAT) fraud involving 250 alleged fake companies. VAT is a broad-based consumption tax assessed on the value added to goods and services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Assets can be recovered by authorities for a variety of reasons: to target money laundering, as a smoking gun in a criminal investigation, or as the suspected proceeds of fraud, to name a few.<\/span>","<span data-v-f87c67ca=\"\">The NFTs were seized alongside £5,000 worth of other crypto assets. Officials said that the seizure was a \"warning to anyone who thinks they can use crypto assets to hide money.\"<\/span>","<span data-v-f87c67ca=\"\">Seizing NFTs is not as simple as a right-click and save-to-desktop. Government agencies around the world possess a range of custody solutions for storing digital assets, and some create their own storage if they don’t want to go through a third party. Others will use approved third-party custodians, like the ones outlined by the UK’s Financial Conduct Authority.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Other techniques include the application of freezing orders on accounts holding digital goods – a measure that takes control of an existing wallet. It is akin to changing the locks on a house while wrongdoing is investigated at the property. Many criminals give away keys in return for more lenient sentencing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As this plays out, asset recovery specialists in the UK are less than impressed with the touted novelty of HMRC’s haul. While the processes are new, the practice of repossessing property to fight fraud has been around for decades.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the UK, there is no difference in the law when it comes to the treatment of digital or non-digital assets. Physical gold is treated the same way as bitcoin or an NFT, says Aidan Larkin, CEO and co-founder of Asset Reality, a firm that manages and realizes seized and confiscated assets for public and private sector clients globally.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While this is not new, Larkin thinks that the move by HMRC is a sign of changing attitudes to targeting this relatively new area. He argues it was a warning shot, at a time when other countries are still debating how to treat cryptocurrencies and NFTs in the law.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Because of the widespread adoption of crypto assets we should be seeing many more of these seizures,” he says. “The blueprint for dealing with this type of thing was laid out by the IRS – it is only a matter of time before we see other digital assets seized.”<\/span>","<span data-v-f87c67ca=\"\">“The thing to celebrate is that this is a large suspected fraud case they haven’t shied away from.”<\/span>","<span data-v-f87c67ca=\"\">Larkin thinks that if other governments follow suit and treat digital assets as part of everyday recovery strategies, there is a lot of value to be recovered for society.<\/span>","<span data-v-f87c67ca=\"\">Behind the scenes, UK authorities are quietly ramping up training on how to track down and solve cyber crimes that involve cryptocurrency transactions.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nick Furneaux, managing director of CSITech, a digital investigations and training agency which operates across the world, says his team are working at “absolute bleeding capacity” with training courses for forces in both the UK and US.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Furneaux believes that as more crypto assets are recovered, we are set to see interesting examples of the Proceeds of Crime Act playing out. This would include the resale of any seized NFTs at a later date via auction if suspects are found guilty of wrongdoing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the wake of this, both Furneaux and Larkin think we will see more big headline crypto seizures coming through legal systems around the world.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aidan Larkin","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nick Furneaux","content":"PERSON"},{"type":"Asset Reality","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Larkin","content":"PERSON"},{"type":"UK’s Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Furneaux","content":"PERSON"},{"type":"HMRC","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}