{"summary":"Anchorage Digital will provide FusionIQ&#x27;s institutional and financial advisor clients regulated digital asset access. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276261\/anchorage-digital-partners-with-wealth-manager-fusioniq-to-offer-institutional-clients-digital-asset-access","publishDate":"2024-02-07T09:02:03","id":12935,"type":null,"title":"Anchorage Digital partners with wealth manager FusionIQ to offer institutional clients digital asset access","category":["COMPANIES"],"content":["Crypto platform Anchorage Digital has partnered with the Massachusetts-based wealth management firm FusionIQ.","The collaboration will allow FusionIQ's clients comprised of institutions and financial advisors to access digital assets provided by Anchorage Digital, according to a statement. The deal also gives registered investment advisors a compliance-focused framework for offering direct ownership of digital assets.&nbsp;","\"Our partnership ensures financial advisors and institutions using the multi-custodian FusionIQ One platform are ready to participate in the next institutional-led crypto bull market,” Anchorage Digital CEO and co-founder Nathan McCauley said in a statement.","McCauley added that, \"We are integrated with FusionIQ via APIs to allow advisors to seamlessly and efficiently connect to our digital asset infrastructure,\" and that Anchorage Digital's partnership with FusionIQ will rollout \"soon,\" he told The Block in an email.","In November 2023, Anchorage Digital announced a partnership that gave separately managed accounts to registered investment advisors, The Block previously <a href=\"https:\/\/www.theblock.co\/post\/263334\/anchorage-digital-launches-custody-and-trading-separately-managed-accounts-for-registered-investment-advisors\" data-v-f87c67ca=\"\">reported<\/a>. By collaborating with Eaglebrook Advisors and Onramp Invest, the firm could offer RIAs compliance and security-focused custody and settlement services.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Nathan McCauley","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Eaglebrook Advisors","content":"ORGANIZATION"},{"type":"McCauley","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Massachusetts","content":"LOCATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}