{"summary":"Klaytn said the platform provides what it claims to be the first tokenized gold available on DeFi outside of the Ethereum ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270063\/south-korean-klaytn-gold-rwa-defi-platform","publishDate":"2024-01-02T21:00:02","id":12936,"type":null,"title":"South Korean blockchain Klaytn onboards gold RWA DeFi platform","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Klaytn <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248433\/klaytn-klay-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/klaytn.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">KLAY<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.33%\n    <\/span><\/a> <!----><\/span><\/span> Foundation, the establishment behind the South Korea-born public blockchain Klaytn, announced today that it has onboarded $GPC (Gold-Pegged Coin) and its supporting DeFi platform Goldstation on its blockchain.<\/span><\/span>","<span data-v-f87c67ca=\"\">Klaytn, the blockchain developed by South Korean internet giant Kakao, said in a statement shared with The Block that CREDER, a South Korea-based digital transformation firm, launched the $GPC token, making it the first gold token to be offered on DeFi outside of Ethereum. It is also the first tokenized gold that does not charge a percentage-based fee for transactions, according to Klaytn.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Klaytn said $GPC users will benefit from Klaytn blockchain’s low gas fees, allowing them to allocate small investments to purchase gold. Crossing out percentage-based transaction fees could also ensure the cost-effectiveness of trading gold tokens on DeFi, Klaytn added.<\/span>","<span data-v-f87c67ca=\"\">“Klaytn Foundation has been working together with CREDER’s meticulous preparation for $GPC and Goldstation,” Sam Seo, representative director of Klaytn Foundation, said in the statement. “Moving forward, we will closely cooperate with them to deliver more diverse metal RWA tokenization projects for the domestic and global markets.”<\/span>","<span data-v-f87c67ca=\"\">Goldstation said it will commence services, including $GPC staking, on Jan. 24. The platform intends to start by serving South Korean residents but plans to launch globally in the future.<\/span>","<span data-v-f87c67ca=\"\">Klaytn blockchain has expanded its use cases to DeFi, real-world asset tokenization and the Bank of Korea’s CBDC pilot project. For example, in November, it partnered with a shipping unit of Korindo, an Indonesian conglomerate, to <\/span><a href=\"https:\/\/www.theblock.co\/post\/261933\/klaytn-plans-to-explore-ship-asset-tokenization-with-korindo-neopin\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">explore tokenization practices with ship-related assets<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"$GPC","content":"MONEY"},{"type":"Kakao","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Klaytn","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jan. 24","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Bank of Korea","content":"ORGANIZATION"},{"type":"-0.33%","content":"PERCENT"},{"type":"Korindo","content":"LOCATION"},{"type":"Klaytn Foundation","content":"ORGANIZATION"},{"type":"Sam Seo","content":"PERSON"}],"hashtag":["KLAYTN"],"authors":["Danny Park","The Block"]}