{"summary":"A new lawsuit has been filed against Binance Holdings, alleging that the crypto exchange confiscated funds from a community manager and admin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/60296\/lawsuit-binance-2018-dispute-300k-community-crypto","publishDate":"2020-03-30T14:16:25","id":12948,"type":null,"title":"Lawsuit alleges that Binance confiscated nearly $300k in crypto from former community moderator amid dispute in 2018","category":["LEGAL"],"content":["A new lawsuit alleges that Binance confiscated the funds of a community moderator and admin who was also a user of the crypto exchange after a dispute between the two sides","The lawsuit was filed on March 27 by Steven Reynolds against Binance Holdings Ltd in the United States District Court for the Northern District of California, San Francisco.&nbsp;In the complaint, Reynolds – who is represented by Anne Edwards of Smith, Gambrell &amp; Russell, LLP – says that in mid-2017, he began to provide services \"to support Binance's online communications with English speaking customers,\" including the operation of community and media channels.","These services are said to have ended that December. Reynolds claimed in the complaint that he was paid in the form of Binance Coin (BNB) as compensation during the period. According to the complaint, Reynolds continued to use Binance \"to buy and sell cryptocurrencies and continued to store digital currencies in his Binance account.\"&nbsp;","A search for Reynolds' Binance-related services indicates that he served as a \"team admin\" for a Binance community Slack channel, according to <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/6u802a\/dnt_proof_of_binance_listing_by_steve_reynolds\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a Reddit post<\/a> from August 2017. Reynolds is also cited as a \"BNB Admin\" in an article by <a href=\"https:\/\/cryptocoremedia.com\/binance-vote-evidence-builds-on-possible-vote-manipulation\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CryptoCoreMedia<\/a> from September 2017 about a vote held by Binance to determine a new coin listing.","Reynolds alleged that in January 2018, Binance contacted him about a channel he operated on chat app Telegram, asking him to delete it. As the complaint states:","Binance allegedly requested that Reynolds delete the group chat. \"However, the app settings did not permit chats to be deleted once opened to the public.&nbsp;Days later, Binance contacted Reynolds again and requested that he remove any reference to Binance in the group chat and change the chat’s name. Reynolds complied with this request,\" according to the complaint.","As the complaint goes on to state:","\"Later the same day, however, Reynolds was contacted by Binance’s CEO,&nbsp;Changpeng Zhao, who demanded that Reynolds delete the chat or remove all of the&nbsp;participants. Reynolds initially resisted but was immediately threatened by Zhao with legal and financial damages unless he complied. Then, within minutes, Binance carried out Zhao’s threats. Without Reynolds' consent, Binance unilaterally lowered Reynolds' withdrawal limit in his account to zero. Reynolds’ account was effectively frozen, as he was restricted from withdrawing any of his assets. Binance then locked Reynolds out of his account entirely. He could not log in using his username and password. Reynolds attempted to restore his account through Binance customer service, but his access was restricted. Reynolds could no longer access his account, and he could not access his digital currency assets stored thereon. At the time, Reynolds' Binance account was holding approximately $285,000 worth of digital currencies. Months later, on or about March 31, 2018, Reynolds was able to regain access to his Binance account. However, his account balance was zero.\"","According to the complaint, Reynolds has alleged that \"Binance had, without Reynolds' consent or authorization, wrongfully confiscated all of the digital assets that Reynolds owned and stored on the Binance platform.\"","In a subsequent section of the complaint, Reynolds claimed that he requested that his funds be returned during a face-to-face encounter between him and Zhao. \"Several months after that, in or around July 2018, Reynolds met Zhao face to face at the TechCrunch technology conference being held in Zug, Switzerland. Reynolds asked Zhao to return his confiscated property, but Zhao refused,\" the complaint alleged.","Reynolds, according to the complaint, is seeking a jury trial. He has asked the court to award him \"damages for all injuries suffered as a result of Defendants' wrongdoing in an amount to be determined at trial but believed to be not less than $337,500.\" That figure accounts for the amount of money Reynolds believes he would have made had he sold his account holdings in the \"subsequent months\" after the confiscation.","Reynolds is also seeking punitive damages, legal and attorney's fees, and \"[a]ll such other and further relief as the Court deems necessary, just and proper.\"","On the topic of jurisdiction and Reyndolds' standing to sue in the United States, the complaint states that \"[c]ommencing in 2017, Binance purposefully directed its activities&nbsp;at residents of this forum by making its website, Binance.com,&nbsp;available to citizens of&nbsp;this state and providing a platform for United States customers&nbsp;to buy, sell and store&nbsp;digital assets on their Binance user account.\"","Reynolds also referenced Binance US, which operates as a separate legal company from Binance and licenses its technology, including the trading engine. Yet according to the complaint, Reynolds has alleged that \"Binance controls Binance US and uses Binance US as an agent and instrumentality to continue to serve Binance’s United States customers\".","Edwards did not respond to a request for comment by press time.&nbsp;","When reached for comment, a spokesperson for Binance told The Block that Reynolds first worked as a volunteer community member (or \"angel\") before being formally hired as a community moderator in September 2017.","Binance confirmed that the relationship ended that December, and that \"as part of the termination closing procedure, we asked Steve to transfer ownership and admin control of all platforms and chat groups he was moderating for Binance.\" The representative alleged that Reynolds \"refused to transfer ownership or control of a 9000+ user Telegram chat group -- which was the main group we were using to provide customer support for our users at that time, 'Binance Support' (@binance_support) -- and insisted on renaming the group and keeping all of the users for his personal use, even after repeated communication from Binance.\"","The representative claimed that the request was made to avoid \"misrepresentation or possible abuse for unethical or illegal causes.\"","\"Steve refused and told us, 'I don’t care',\" the representative said. \"He insisted on keeping the 9000+ users who joined the Binance Support Group for his personal and future use, and did not inform users of why the group name had changed or what its new purpose was. Steve then kicked out the Binance moderators from the misappropriated chat group,&nbsp;nullifying our efforts to warn and protect the users left in the group.\"","The representative went on to say:","\"[Zhao] tried to ask Steve to do the right thing by giving up the misappropriated chat group or&nbsp;at least removing all of the Binance community users from the group to eliminate risk of&nbsp;misrepresentation or fraud, but Steve refused. Steve said that Binance can keep the&nbsp;crypto in his Binance account, but he will not release the users in the misappropriated&nbsp;chat group. While working as a Binance community moderator, Steve also displayed other highly&nbsp;questionable behaviours, including funnelling leads for Binance to his personal LinkedIn&nbsp;account, and publishing a post on Reddit claiming to offer Binance users personal<br data-v-f87c67ca=\"\">\nservices with their accounts.&nbsp;After the debacle in 2018, we wanted to sue Steve for damages but we could not locate&nbsp;him.\"","The Binance representative also shared a chat conversation segment, during which Reynolds is seen saying that \"I'm not going to do that CZ, but I promise you that I will only ever have positive things to say about Binance.\"","\"Steve's last words with [Zhao] (on Jan 8, 2018) show that he had accepted that his account was locked and he understands the position,\" the representative said.","<em data-v-f87c67ca=\"\">A full copy of the complaint can be found below:<\/em>","<a title=\"View Reynolds v. Binance Holdings Ltd. (1) on Scribd\" href=\"https:\/\/www.scribd.com\/document\/453988525\/Reynolds-v-Binance-Holdings-Ltd-1#from_embed\" data-v-f87c67ca=\"\">Reynolds v. Binance Holdings Ltd. (1)<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe id=\"doc_70898\" class=\"scribd_iframe_embed\" title=\"Reynolds v. Binance Holdings Ltd. (1)\" src=\"https:\/\/www.scribd.com\/embeds\/453988525\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-9slgOTfcGMu4DdMEkBgB\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"false\" data-aspect-ratio=\"0.75\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Reddit","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Switzerland","content":"LOCATION"},{"type":"March 27","content":"DATE"},{"type":"Binance Holdings Ltd","content":"ORGANIZATION"},{"type":"Reynolds","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"$337,500","content":"MONEY"},{"type":"Anne Edwards","content":"PERSON"},{"type":"Binance Coin (BNB","content":"ORGANIZATION"},{"type":"United States District Court","content":"ORGANIZATION"},{"type":"Steve","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance US","content":"ORGANIZATION"},{"type":"9000","content":"DATE"},{"type":"Jan 8, 2018","content":"DATE"},{"type":"Steven Reynolds","content":"PERSON"},{"type":"September 2017","content":"DATE"},{"type":"Binance Support Group","content":"ORGANIZATION"},{"type":"Reynolds v. Binance Holdings Ltd.","content":"ORGANIZATION"},{"type":"March 31, 2018","content":"DATE"},{"type":"$285,000","content":"MONEY"},{"type":"July 2018","content":"DATE"},{"type":"Zug","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Smith, Gambrell &amp; Russell, LLP","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"CryptoCoreMedia","content":"ORGANIZATION"},{"type":"Edwards","content":"PERSON"},{"type":"MichaelPatrickMcSweeney","content":"ORGANIZATION"},{"type":"Reynolds","content":"PERSON"},{"type":"Reyndolds","content":"PERSON"},{"type":"January 2018","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Northern District of California","content":"ORGANIZATION"},{"type":"United States","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"August 2017","content":"DATE"}],"hashtag":["BINANCE","BNB"],"authors":["Michael McSweeney","The Block"]}