{"summary":"FTX&#x27;s new CEO John Ray stressed in an employee all hands that the firm is not in communication with former CEO Sam Bankman-Fried.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190999\/ftx-ceo-stresses-bankman-fried-ellison-no-longer-involved-in-operations","publishDate":"2022-11-30T10:38:02","id":12941,"type":null,"title":"FTX CEO stresses Bankman-Fried, Ellison no longer involved in operations","category":["CRYPTO INFRASTRUCTURE"],"content":["FTX CEO John Ray stressed in a company all-hands this week that the firm has not been communicating or \"dealing with\" former senior executives, including its co-founder Sam Bankman-Fried.&nbsp;","The call between Ray and FTX and FTX.US employees provided few specifics on how the bankruptcy process was unfolding, but the restructuring expert tried to ease anxious employees by noting that \"things will relax a bit.\"","FTX filed for bankruptcy protection earlier this month following the implosion of its native FTT token and revelations that the company misappropriated customer funds.&nbsp;","\"We're getting more and more control over the situation,\" he added.&nbsp;","Ray — who led the restructuring of Enron during its bankruptcy — also stressed that former CEO Sam Bankman-Fried and other members of his inner circle, including former Alameda CEO Caroline Ellison, were no longer involved in the company's day-to-day operations despite tweets from the former billionaire that he would work to make customers whole, and that the firm is not communicating with the former executives.","Ray also said the company would be implementing a pay cap, suggesting that bonuses won't be given out to employees, according to a person familiar with the situation. He also asked workers to exercise caution on social media and to not answer questions from the press.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"John Ray","content":"PERSON"},{"type":"Ray","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}