{"summary":"JPMorgan expressed doubt about the sustainability of the recent crypto market surge, stating that the &quot;crypto rally looks overdone.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262324\/jpmorgan-crypto-rally-looks-overdone","publishDate":"2023-11-09T05:12:19","id":12944,"type":null,"title":"JPMorgan says &#x27;crypto rally looks overdone&#x27;","category":["MARKETS"],"content":["JPMorgan analysts expressed doubt about the sustainability of the recent crypto market surge, stating that the \"crypto rally looks overdone.\"","The analysts identified two major factors that have seemingly led crypto to rally over the past month.","The first is the prospect of a spot bitcoin ETF approval in the U.S., which&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/259587\/what-would-a-spot-bitcoin-etf-approval-mean-for-the-industry\" data-v-f87c67ca=\"\">could bring<\/a> in new money to crypto markets, and the potential for such an approval to be seen as a victory for the crypto industry and a loss for the Securities and Exchange Commission, potentially leading to a more lenient SEC approach in the future, JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a report on Wednesday. However, the analysts are \"skeptical\" of both these factors or arguments.","\"First, instead of fresh capital entering the crypto industry to be invested in the newly-approved ETFs, we see as a more likely scenario existing capital shifting from existing bitcoin products such as the Grayscale bitcoin trust, bitcoin futures ETFs and publicly listed bitcoin mining companies, into the newly-approved spot bitcoin ETFs,\" the JPMorgan analysts said.","Further, they <a href=\"https:\/\/www.theblock.co\/post\/238316\/jpmorgan-bitcoin-etf-approval-comments\" data-v-f87c67ca=\"\">reiterated<\/a> that spot bitcoin ETFs already exist in Canada and Europe and have garnered little interest from investors since their launch, and thus, they remain skeptical that fresh capital will enter the newly approved spot bitcoin ETFs in the U.S.","The second main factor driving the recent crypto rally is the SEC's defeat in its&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/258581\/ripple-celebrates-dismissed-lawsuit-calling-it-a-surrender-by-the-sec\" data-v-f87c67ca=\"\">Ripple<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/262279\/the-sec-has-opened-talks-with-grayscale-over-its-bid-for-a-spot-bitcoin-etf-conversion-report\" data-v-f87c67ca=\"\">Grayscale<\/a> legal cases. But despite these apparent losses, it's uncertain if crypto regulations will ease in the future, according to the JPMorgan analysts.","\"It is far from clear that the regulatory tightening of the crypto industry will lessen significantly going forward given how unregulated this industry is,\" the analysts said. \"U.S. crypto industry regulations are still pending and we do not believe U.S. lawmakers would shift their stance because of the above two legal cases especially with the memories from the FTX fraud still fresh.\"","Another reason some are optimistic about the future of crypto markets is the upcoming <a href=\"https:\/\/www.theblock.co\/learn\/245698\/what-is-a-bitcoin-halving\" data-v-f87c67ca=\"\">Bitcoin halving<\/a> event in April\/May 2024. The idea is that this event, which reduces the supply of new bitcoins, could lead to a higher bitcoin price. However, according to the JPMorgan analysts, the halving event is already priced in.","\"This argument seems unconvincing as the bitcoin halving event and its effect are predictable and in our opinion are well factored into bitcoin price,\" they said.","\"For example, looking at the bitcoin production cost after the halving event using current hash rates and difficulty would suggest that the production cost would rise from $21,000 currently to around $43,000. However, the current price at around $35,000 would be consistent with around a 20% drop in the hash rate as miners in higher cost locations or with less efficient hardware exit the market, which seems reasonable to us. This suggests that the halving event could already be largely in the price.\"","Overall, the analysts are \"cautious on crypto markets going forward with a high chance of 'buy the rumor\/sell the fact' effect post the forthcoming SEC approval of spot bitcoin ETFs.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"$35,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May 2024","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"$43,000","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"$21,000","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":["INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}