{"summary":"Developers from Polygon unveiled their Layer 2 scaling solution, Polygon zkEVM, which is a zero-knowledge-based rollup network that is natively compatible with Ethereum apps.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution","publishDate":"2023-03-27T10:00:03","id":12943,"type":null,"title":"Polygon Labs unveils zkEVM Layer 2 to help scale Ethereum","category":["CRYPTO ECOSYSTEMS"],"content":["Scaling project Polygon has released a highly anticipated zero-knowledge-based rollup network, with Ethereum founder Vitalik Buterin set to perform the first symbolic transaction in a YouTube broadcast scheduled for 10:30 a.m. EDT.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe network, called Polygon zkEVM, was under development for a year and provides a scalability solution for Ethereum apps, with ZK-rollups performing off-chain computations on a secondary layer to enable faster and cheaper transactions while still maintaining Ethereum's security as a priority.","The network is EVM-equivalent, meaning it will support the same code as Ethereum and allow developers to use their existing tooling and infrastructure. The mainnet is permissionless, and anyone can bridge assets and use them in zkEVM native apps, according to the development team.","&nbsp;\"With zkEVM, you will be able to deploy any Ethereum application without any modifications, using existing Ethereum developer tools like Remix, and interact with the network using standard wallets like Metamask,\" Polygon co-founder Mihailo Bjelic said in an interview. \"Close to 6,000 smart contracts were deployed on the testnet without any single modification without any problem.\"","A ZK-rollup is a Layer 2 scaling solution for blockchain networks, such as Ethereum, that sets out to improve transaction throughput and reduce transaction fees. It works by aggregating a large number of transactions off-chain into a single batch, which is then submitted to the main chain as a single transaction. Most ZK-rollups don't have natively supported Ethereum applications, which is starting to change with the public release of a few zkEVMs.","<span data-v-f87c67ca=\"\">The launch of Polygon's zkEVM has attracted more than 50 projects from the crypto, web3 and gaming spaces, including dApps such as Lens and Aavegotchi, DeFi projects 0xvix and Quickswap, as well as Etherscan, Phantom, Midnight Society, Luganodes, Celer, Gameswift, and Yeeha Games. In addition to these projects, the Uniswap decentralized exchange and Aave lending protocol also have<\/span><a href=\"https:\/\/www.theblock.pro\/news\/post\/216830\/aave-starts-governance-discussion-to-deploy-on-upcoming-polygon-zkevm-mainnet\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">floated<\/span><\/a><span data-v-f87c67ca=\"\"> governance proposals in a process for joining the Polygon zkEVM Mainnet Beta.<\/span>","<span data-v-f87c67ca=\"\">Polygon Labs, the developer of the network, has subjected the zkEVM to two independent audits and one internal audit over a period of nearly four months to ensure its security. However, the team has still advised users to exercise caution in terms of security, as the network is still in beta phase.<\/span>","<span data-v-f87c67ca=\"\">The team has made all aspects of the zkEVM open-source under an AGPL v3 license to share their code and encourage collaboration with the developer community.<\/span>","<span data-v-f87c67ca=\"\">The<\/span><a href=\"https:\/\/www.theblock.co\/post\/221420\/polygon-to-help-develop-immutable-zkevm-secured-by-matic-stakers\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">zkEVM technology<\/span><\/a><span data-v-f87c67ca=\"\"> has been identified as a major area of focus for scaling the Ethereum network, and several blockchain projects, including Polygon, Starknet, ZkSync, and Scroll, have been competing over the past year to develop a functional ZK-based Layer 2 solution capable of natively supporting Ethereum apps. So far, only ZkSync's chain called <a href=\"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum\" data-v-f87c67ca=\"\">Era<\/a> and Polygon have finalized the release of their ZK-rollup networks on the mainnet.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mihailo Bjelic","content":"PERSON"},{"type":"Midnight Society","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gameswift","content":"PERSON"},{"type":"Luganodes","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Polygon zkEVM Mainnet Beta","content":"ORGANIZATION"},{"type":"10:30 a.m. EDT","content":"TIME"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["POLYGON","ZKEVM","ZKSYNC"],"authors":["Vishal Chawla","The Block"]}