{"summary":"Dapper Labs, which runs the NBA Top Shot NFT platform, was able to sell 2300 packs in minutes, but a series of technical issues disrupted its drop process.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/94252\/nba-top-shot-legendary-drop-issues","publishDate":"2021-02-09T16:38:30","id":12942,"type":null,"title":"Users flooded NBA Top Shot&#x27;s &#x27;Legendary Drop&#x27; last weekend. Tech issues left some disappointed","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Pete Balestracci, known on Twitter as @PlungeFather, was feeling pretty excited this past weekend as he waited with friends for NFT marketplace NBA Top Shot to begin its latest drop.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Balestracci was one of the thousands of users who participated in NBA Top Shot’s “Legendary Drop” on February 6. But while Dapper Labs, which runs the platform, was able to successfully sell just over 2,300 packs of digitally licensed collectibles in a matter of minutes, several technical issues disrupted the process and left expectant users like Balestracci disappointed and pack-less.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">So what happened exactly?<\/span>","<span data-v-f87c67ca=\"\">In late 2020, Dapper Labs, best known for creating the Ethereum-based CryptoKitties dapp, <\/span><a href=\"https:\/\/www.ledgerinsights.com\/dapper-labs-opens-nba-top-shot-blockchain-collectibles-app\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> that the NBA Top Shot blockchain app was available for use worldwide. This new platform would enable users to collect and trade digitized \"moments\" from the game. Users could buy or sell these digital collectibles for real money after going through a KYC verification process requiring a government-issued form of ID and other personal information.<\/span>","<span data-v-f87c67ca=\"\">Dapper Labs raised $12 million for the project and received support from numerous investors, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/74188\/nba-investors-dapper-labs-funding\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">including a group of NBA players.<\/span><\/a>&nbsp;<span data-v-f87c67ca=\"\">NBA Top Shot has hosted a number of drops since then but has faced several technical issues while doing so.<\/span>","At the heart of Top Shot are the packs. One can think of them as digital versions of packs of trading cards, but instead of holding physical cards in, say, a collection binder, the contents of Top Shot packs contain non-fungible tokens (NFTs) that, upon purchase, are then held in the buyer's wallet.&nbsp;","<span data-v-f87c67ca=\"\">In its latest sale on February 6, due to an increase in demand and secondary market prices, the platform increased the price of their Legendary packs by 350%, from $230 to $999. However, the problems that occurred during the drop this weekend stemmed largely from the queuing system used to organize participants.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Balestracci, who joined the platform about three weeks ago, it seemed that the technology the Dapper team was using was being “inundated” and “overwhelmed” by the sheer number of users trying to acquire packs at the same time.<\/span>","<span data-v-f87c67ca=\"\">“There was apprehension as we approached the Holo drop – what could be a much bigger and more valuable pack,” he told The Block. “Most brand-new users to the platform hadn’t really seen any inkling of what this might look like.”<\/span>","<span data-v-f87c67ca=\"\">No one knew exactly when the pack drop would happen until the night before. The process seemed fairly simple: users entered the line and would be randomly assigned a queue number. The orders would then be processed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That’s not exactly how things went down. A few minutes after waiting in line, participants like Balestracci started to see tweets and Discord messages suggesting the sale had begun. But things turned around quickly. The queue stopped, the Discord shut down, and a brief period of chaos ensued as users tried to figure out what was happening and if they were going to get a pack – particularly those at the front of the line with a queue number below 2,300 (as 2,300 packs were going to be sold).&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tech entrepreneur Drew Austin was also participating, and his sister was assigned queue number 500 – meaning she held an early spot in line. Austin said he was sure she was going to get her first pack. But by the time it was her turn in line, the packs had sold out. Austin’s sister, who should have gotten a pack based on her place in line, never received one.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Shortly after the drop, the Dapper Labs team published a <\/span><a href=\"https:\/\/blog.nbatopshot.com\/posts\/holo-icon-drop-retro\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> detailing the situation. Before the main drop on Saturday, the team had held a test drop to try out a new queuing provider. What they failed to anticipate was that the queue provider did not check the identifier used. So, if the user was a valid Top Shot user and participated in the test drop, they were essentially already cleared and could join the queue on Saturday using the identifier issued the day before.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The team used an analogy to explain the situation. It would be like getting your wrist stamped before walking into a nightclub on Friday night, and then going back to the same club on Saturday and not having to pay for another wrist stamp because the bouncer saw your stamp from the night before. Thus, you’d be able to enter the club without technically having a stamp.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Balestracci, a source of frustration for many participants was that while the drop process certainly showed improvements from previous pack drops – i.e., there weren’t accounts accumulating massive numbers of these packs various means – the 2,300 packs sold mostly went to people that had already gotten packs from the test drop the night before.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It’s not just that I didn’t have a chance in this one, but those individual accounts that benefitted had already benefitted,” Balestracci said. “I have confidence in the Dapper team but what is challenging is that they know they’ve had issues and there are many other companies that have gone through and utilized similar technologies without the same issues.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Dapper Labs’ blog post, the team aims to improve its communication and has said it will not drop another pack in the same manner, using a queue system, until the issue has been completely resolved.&nbsp;<\/span>","According to CEO and co-founder of Dapper Labs Roham Gharegozlou, \"2331 packs went to 2331 accounts so distribution was good BUT due to a bug many bypassed the queue.\"","\"We're very sorry for ppl who waited but didn't get pack – we will make it up to you,\" he <a href=\"https:\/\/twitter.com\/rohamg\/status\/1358186027819565056\" data-v-f87c67ca=\"\">tweeted<\/a> on February 6 following the drop.&nbsp;","Thus far, Top Shot users remain onboard with the project and the team's efforts to shore up the process.","<span data-v-f87c67ca=\"\">“It’s easy for people to go onto Discord and hate on the team. But the reality is that every time they release a pack, there will be more people,” Austin told The Block. “When you’re doing things first, you will come across unexpected roadblocks. While in this case, they were trying to build a rocket ship while flying the plane, the Dapper Labs team is 100% trying to fix things.”<\/span>","<span data-v-f87c67ca=\"\">Balestracci said the team’s decision to not use a queue system is a smart move but said the gaps in communication between the technical and the macro aspects can be hard to navigate.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It’s a double-edged sword – if you are too transparent about technical failures you are experiencing, you are giving folks the chance to comment and criticize what your actions were,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Balestracci said while he appreciates honesty and forthrightness, there is an inherent psychology to companies being fully transparent with their users.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“A lot of companies are being less transparent about what’s going to happen when you get into a line. You know you have to show up, there is some randomization. The only output I get is congrats you got it vs. sike you didn’t, which I think is a much easier pill to swallow than being in a line and feeling like you’re entitled to a pack,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During the drop, Balestracci created a <\/span><a href=\"https:\/\/twitter.com\/PlungeFather\/status\/1358162632642019335\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">poll<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter in which he asked his followers what they would do if NBA Top Shot announced another Legendary Drop in a few hours with the same collectibles makeup. Over 60% of people said they would “#F5Gang like always” – they’d refresh and try their luck again.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There is a recognition that this sucks, but people know it’s a beta. People know there are going to be challenges but they’re willing to stomach that and endure because the product on the other end of it is really cool,” Balestracci said. “I’m willing to go through this roughly painful drop experience in order to try and secure this product. I’d be willing to bet that the 12% of the people in my poll that said they weren’t sure what they’d do would end up jumping into the drop too.”<\/span>","<span data-v-f87c67ca=\"\">Austin said he definitely plans to participate in future NBA Top Shot drops, too.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think they’re onto something huge. I’m a big believer. I know they will work out the kinks eventually, they have the resources, the team, the right investors behind them. It’s only a matter of time before they get it right,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For Austin, the fact of the matter is simple: “If we all got packs they wouldn’t be valuable anymore!” <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Balestracci","content":"PERSON"},{"type":"ppl","content":"ORGANIZATION"},{"type":"Balestracci","content":"LOCATION"},{"type":"$12 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"350%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"$999","content":"MONEY"},{"type":"Roham Gharegozlou","content":"PERSON"},{"type":"NBA","content":"ORGANIZATION"},{"type":"Balestracci","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Pete Balestracci","content":"PERSON"},{"type":"night","content":"TIME"},{"type":"February 6","content":"DATE"},{"type":"$230","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Saniya More","The Block"]}