{"summary":"Ethereum scaling and security startup StarkWare has announced the close of a $75 million funding round led by Paradigm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99211\/starkware-funding-round-ethereum-paradigm","publishDate":"2021-03-24T12:01:44","id":12952,"type":null,"title":"StarkWare raises $75 million in Series B funding round led by Paradigm ","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">As Ethereum's scaling efforts heat up, one Israeli-based startup hopes a new $75 million funding round will position it as the infrastructure backbone across decentralized finance, non-fungible tokens, and security.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">StarkWare Industries, which provides scaling and security solutions to overcome the limitations of Ethereum’s existing technology, announced Wednesday a Series B fundraise led by crypto VC firm Paradigm. Paradigm previously led StarkWare's $30 million fundraise in 2018.<\/span>","\"StarkWare is emblematic of companies with which Paradigm seeks to partner: a world class team tackling an extremely important problem with stunning growth,\" commented Paradigm's Matt Huang. \"We are excited to double down and help them scale DeFi, NFTs and Ethereum more&nbsp;broadly.\"","<span data-v-f87c67ca=\"\">Previous investors, including Sequoia, Founders Fund, and Pantera participated in the round alongside new investors like Three Arrows and Alameda Research.<\/span>","<span data-v-f87c67ca=\"\">The fresh funding comes on the heels of a period of growth, with headcount doubling in 2020 and demand for its services soaring “by every conceivable metric,” according to Uri Kolodny and Eli Ben-Sasson, who founded the firm with Michael Riabzev and Alessandro Chiesa.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThat stands to reason, given the market backdrop. As ether and other digital assets climbed to new heights, the Ethereum network itself has hit a scaling roadblock. This state of affairs has made it increasingly more expensive to transact on Ethereum, with the average transaction fee on Ethereum climbing above $18 this week compared to the roughly $0.08 it cost at the beginning of 2020.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/average-transaction-fee-on-ethereum\/embed\" title=\"Average Transaction Fee on Ethereum (7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","StarkWare’s Cairo is a service that leverages cryptography to boost transaction throughput by moving much of the heavy computational work off-chain without compromising the network’s security. Transaction throughput refers to the number of transactions per second that a network can handle at a given time.","<span data-v-f87c67ca=\"\">The firm is currently working on the staged roll-out of StarkNet, its permissionless decentralized ZK-Rollup.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“It will allow any developer the ability to scale their dApp using STARKs, in an Ethereum-like experience for both developers and users,” Kolodny described.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ZK-Rollups are meant to be the be-all and end-all scaling solution in Ethereum. If StarkWare is successful in its deployment of StarkNet, then the firm would be among the most important technologies in the cryptocurrency market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But the firm has competition in another technology: <a href=\"https:\/\/www.theblockcrypto.com\/linked\/96004\/ethereum-optimism-scaling-a16z-funding\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Optimistic Rollups<\/a>. <\/span><span data-v-f87c67ca=\"\">The alternative layer 2 scaling solution is generally thought to enable applications to interact with each other directly -- while in ZK-Rollups are siloed in their own environment.<\/span>","<span data-v-f87c67ca=\"\">With Optimistic Rollups, virtually anyone can connect to a “clone” of Ethereum that has more throughput whereas ZK-Rollup requires folks to have to connect their application with their own Rollup. With <\/span><span data-v-f87c67ca=\"\">StarkNet, ZK-Rollups will have the same properties as Optimistic Rollups, according to StarkWare.<\/span>","<span data-v-f87c67ca=\"\">“StarkWare offers the lowest cost, highest throughput solution with privacy on Ethereum,” said Kyle Davies of Three Arrows. “Decentralized scalability is now.”<\/span>","<span data-v-f87c67ca=\"\">That’s good timing, considering the surge in activity across the market for non-fungible tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the last several months, the non-fungible token market–which runs the gamut of tokens tied to art, music, sports, and even food—has heated up, with artists selling their works for eye-watering prices. Digital artist Beeple recently sold his 5000-day collection for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98047\/christies-beeple-auction-ends-digital-art\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a staggering $69.4 million<\/a>.&nbsp;&nbsp;<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/nft-overview\/weekly-trade-volume-of-nfts\/embed\" title=\"Weekly Trade Volume of NFTs\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Kolodny and Ben-Sasson said the firm has struck deals with “several high profile projects that we haven’t announced yet.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">They said the scaling needs in the market are unique and more geared toward ZK-Rollups.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The benefit of ZK-Rollups is that they offer Ethereum's security, which far exceeds that of sidechains. If users start trading NFTs in the [millions of dollars], the security of the underlying blockchain becomes a critical issue.”<\/span>","<span data-v-f87c67ca=\"\">Outside of the NFT space, StarkWare has announced partnerships with dYdX and Immutable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">dYdX had over 100,000 signups to the alpha version of their ZK Rollup exchange.<\/span>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Disclosure:<\/strong> Pantera is an investor in The Block.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kolodny","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Eli Ben-Sasson","content":"PERSON"},{"type":"Cairo","content":"LOCATION"},{"type":"$18","content":"MONEY"},{"type":"$69.4 million","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$75 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Michael Riabzev","content":"PERSON"},{"type":"[millions of dollars","content":"MONEY"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"5000","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Alessandro Chiesa","content":"PERSON"},{"type":"Kyle Davies","content":"PERSON"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ben","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"Matt Huang","content":"PERSON"},{"type":"Sasson","content":"PERSON"},{"type":"StarkWare Industries","content":"ORGANIZATION"},{"type":"Uri Kolodny","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$0.08","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["ETHEREUM","PARADIGM"],"authors":["Frank Chaparro","The Block"]}