{"summary":"The SEC has given consent to a bitcoin futures fund, which will invest in cash-settled futures. Dalia Blass, Director of the SEC’s Division of Investment Management, gave the agency’s reasoning for approving the new fund, citing it as an example of her recent efforts to engage the fund industry.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49740\/15-billion-asset-manager-is-the-latest-to-receive-sec-approval-for-its-bitcoin-futures-fund","publishDate":"2019-12-09T14:11:31","id":1295,"type":null,"title":"SEC green-lights $15 billion asset manager&#x27;s bitcoin futures fund","category":["BITCOIN"],"content":["A new bitcoin futures fund managed by the $15 billion asset manager Stone Ridge has been approved by the U.S. Securities and Exchange Commission (SEC). While firms like <a href=\"https:\/\/www.theblockcrypto.com\/daily\/47574\/galaxy-digital-takes-another-swing-at-crypto-asset-management-but-the-landscape-is-more-competitive-than-ever\" data-v-f87c67ca=\"\">Galaxy Digital<\/a> and <a href=\"https:\/\/www.wsj.com\/articles\/van-eck-solidx-to-offer-limited-version-of-bitcoin-exchange-traded-fund-11567503003\" data-v-f87c67ca=\"\">VanEck<\/a> have recently rolled out similarly structured funds, the new fund intends to invest only in cash-settled futures, which addresses regulatory concerns regarding potential market manipulation and has won it a personal endorsement from SEC official Dalia Blass.","Stone Ridge Trust VI <a href=\"https:\/\/www.theblockcrypto.com\/linked\/41920\/a-new-bitcoin-futures-fund-has-been-filed-with-sec\" data-v-f87c67ca=\"\">filed<\/a> the registration statement for the NYDIG Bitcoin Strategy Fund in October. After two subsequent amendments, the registration went into effect on Monday. According to an NYDIG spokesperson, the fund is the first to be approved by the SEC.&nbsp;","<a href=\"https:\/\/www.stoneridgefunds.com\/\" data-v-f87c67ca=\"\">Stone Ridge Funds<\/a>, a subsidiary of Stone Ridge Holdings Group targeted at institutional clients with long-term horizons, will act as the new fund’s investment advisor, according to the filings. By Aug. 30, the group has managed approximately $15 billion worth of assets.","The new fund is “a non-diversified, closed-end management investment company,” the <a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1764894\/000119312519301050\/d693146dn2a.htm\" data-v-f87c67ca=\"\">filings<\/a> say. Its shares are not listed on any exchange and only institutional traders can invest at a price of $10 per share. Shareholders may not sell or repurchase their shares on a daily basis but can only periodically sell portions of their shares back to the fund. This feature is designed to only draw in long-term investors with sustainable investment goals and relatively high-risk tolerance. Furthermore, the NYDIG Bitcoin Strategy Fund will not directly invest in digital assets like Bitcoin, the filings claim but will focus on investing in bitcoin futures contracts.","<strong data-v-f87c67ca=\"\">\"Prime example\"<\/strong>","The new fund came as a result of the SEC’s recent effort to engage the fund industry in conversations about investor protection, according to last week’s <a href=\"https:\/\/www.sec.gov\/news\/speech\/blass-keynote-address-2019-ici-securities-law-developments-conference\" data-v-f87c67ca=\"\">speech<\/a> by Director of the SEC’s Division of Investment Management, Dalia Blass.","In her speech, Blass gave the agency’s rationale for supporting the fund. Firstly, the fund will only invest in cash-settled futures, which will mitigate the risks and challenges involved in direct holdings of digital assets. Secondly, since the fund is a closed-end interval fund that does not offer daily redemptions, it will not suffer from large, short-term liquidity demands by market makers and its price will remain relatively stable. Moreover, the fund has taken measures to prevent potential manipulation, including offering substantive risk disclosures, recruiting only registered investment advisers, and setting an initial cap of $25 million to limit the fund's size and growth trajectory. At the same time, however, she emphasized that “no investment products are absolutely risk-free,” which she said is particularly true when it comes to newly emergent investment strategies like those seen in the digital asset market.","Blass considers the NYDIG Bitcoin Strategy Fund a “prime example” of the SEC’s recent engagement efforts and claimed that the agency “welcome[s] and value[s] constructive industry engagement regarding new products and novel investment strategies.” SEC Commissioner Hester Peirce echoed Blass’s restrained optimism and <a href=\"https:\/\/twitter.com\/HesterPeirce\/status\/1202360725022400512?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> that the launch of the new fund shows “a bit of progress” in this regard.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SEC’s Division of Investment Management","content":"ORGANIZATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$10","content":"MONEY"},{"type":"Stone Ridge","content":"ORGANIZATION"},{"type":"Aug. 30","content":"DATE"},{"type":"VanEck","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Blass","content":"PERSON"},{"type":"NYDIG Bitcoin Strategy Fund","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Stone Ridge Holdings Group","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Dalia Blass","content":"PERSON"}],"hashtag":["SEC"],"authors":["Yilun Cheng","The Block"]}