{"summary":"Crypto exchange Binance and stablecoin issuer Circle submitted feedback to the UK government as the country considers a new framework to govern both trading and lending of digital assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229138\/binance-circle-uk-crypto-regulatory-framework","publishDate":"2023-05-02T16:00:26","id":12950,"type":null,"title":"Crypto giants Binance, Circle provide UK feedback on legal framework","category":["COMPANIES"],"content":["Crypto exchange Binance and stablecoin issuer Circle submitted feedback to the UK government as the <a href=\"https:\/\/www.theblock.co\/post\/228970\/a16z-crypto-uk-regulation\" data-v-f87c67ca=\"\">country considers a new framework<\/a> to govern both trading and lending of digital assets.","Binance, by far the <a href=\"https:\/\/coinmarketcap.com\/rankings\/exchanges\/\" data-v-f87c67ca=\"\">largest exchange<\/a> in the world in terms of volume, said that special attention needed to be paid to consumer protection, market integrity and financial stability. It warned, however, that disproportionate regulation could \"inadvertently stifle innovation and growth, remove choice and competition, and potentially drive consumers to unregulated markets or operators.\"","\"Achieving this balance is not easy,\" the company <a href=\"https:\/\/bin.bnbstatic.com\/static\/policy-doc\/binance-response-hmt-future-financial-services-regulatory-regime-for-cryptoassets.pdf\" data-v-f87c67ca=\"\">wrote in a letter<\/a> to the country's Treasury, which had <a href=\"https:\/\/www.theblock.co\/post\/207488\/the-uk-finally-reveals-plan-to-regulate-crypto-trading-and-lending\" data-v-f87c67ca=\"\">solicited input in February<\/a> after unveiling an initial plan.&nbsp;","While disclosure requirements should \"provide the right information to consumers,\" Binance said it questioned whether trading venues can \"take on the responsibilities of the issuer in a traditional sense\" when there is no issuer. It also said that decentralized finance needs to be \"carefully defined,\" with differences considered and accommodated in the drafting of new rules.&nbsp;","\"Listings\/delistings should be handled by exchanges, and exchanges should be held responsible for providing the correct information to consumers based on clear disclosure rules, and performing sufficient due diligence,\" Binance CEO Changpeng \"CZ\" Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1653437862598017024\" data-v-f87c67ca=\"\">wrote on Twitter<\/a>, adding that the company supported the introduction of a Crypto Market Abuse Regime \"to mitigate the risks and challenges specific to crypto.\"","The feedback comes as global regulators are figuring out how to regulate the industry. Last month, the European Union officially passed its <a href=\"https:\/\/www.theblock.co\/post\/227309\/mica-european-union-crypto-regulation-passes\" data-v-f87c67ca=\"\">Markets in Crypto Assets (MiCA) regulation<\/a> after lawmakers in the European Parliament approved the rules. And in the U.S.,And in this U.S., there are calls for more clarity from the industry amid increased regulatory scrutiny from the <a href=\"https:\/\/www.theblock.co\/post\/228065\/coinbase-stand-with-crypto-campaign-sec\" data-v-f87c67ca=\"\">SEC and CFTC<\/a>.","&nbsp;","","","Circle, meanwhile, said it agreed with the UK government's objectives \"to bring cryptoassets into the UK regulatory perimeter and create proportionate and agile rules so that digital asset firms can thrive and provide innovative and cost-reducing financial services to the UK market.\"","The company, which manages the USDC stablecoin, said the country should make the registration process for digital asset firms \"simple and transparent, with clear indicative timelines and feedback from supervisors on what constitutes good or bad practices.\"&nbsp;","\"Circle urged HM Treasury to swiftly disclose its plans for the regulation of fiat-backed payment stablecoins,\" <a href=\"https:\/\/www.circle.com\/blog\/circles-response-to-uk-future-financial-services-regulatory-regime-for-cryptoassets-consultation-and-call-for-evidence\" data-v-f87c67ca=\"\">the company said in a blog post<\/a>. \"Circle requested additional clarity on the distinction between what constitutes ‘cryptoasset’ activity versus activity related to payment stablecoins involved in payment service provision.\"","The UK's consultation process comes as companies have been accusing the primary regulator on the other side of the Atlantic, the U.S. Securities and Exchange Commission, of <a href=\"https:\/\/www.theblock.co\/post\/228970\/a16z-crypto-uk-regulation\" data-v-f87c67ca=\"\">dragging its feet<\/a> on providing clear rules for the sector.&nbsp;","A16z crypto, the venture capital fund, said yesterday that it's <a href=\"https:\/\/www.theblock.co\/post\/228970\/a16z-crypto-uk-regulation\" data-v-f87c67ca=\"\">urging the UK to consider a \"more nuanced approach\"<\/a> to the pending legislation and said \"a 'one-size-fits-all' approach to the regulation of cryptoasset transactions would not be consistent with the Treasury’s core design principle of 'same risk, same regulatory outcome.'\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"European Parliament","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Atlantic","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"HM Treasury","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Crypto Market Abuse Regime","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BINANCE","USDC"],"authors":["Nathan Crooks","The Block"]}