{"summary":"Graham Newhall, a senior advisor to the DeFi Education Fund, opines on the future of DeFi regulation in the United States.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128848\/can-defi-break-out-of-the-partisan-trap-in-2022","publishDate":"2021-12-31T08:52:52","id":12958,"type":null,"title":"Can DeFi break out of the partisan trap in 2022?","category":["OP-ED"],"content":["<em data-v-f87c67ca=\"\">Graham Newhall is a senior advisor to the DeFi Education Fund.<\/em>","As the public becomes more aware of decentralized finance in the coming year, we may witness the continuation of an unfortunate, parallel trend: criticism and support of DeFi from national politicians becoming increasingly partisan.","This is a lamentable (but perhaps expected) outcome, given that so many of our country’s most important questions become almost immediately mired in partisan bickering the moment those issues arise in the public consciousness.","Some of that partisanship reflects real differences in opinion (if we take our politicians’ words at face value). For instance, we could predict, generally, whether a Republican or Democrat would be in favor of new offshore drilling licenses. Democrats, as a rule, care more about the impact of fossil fuel production on the climate, while Republicans favor the expansion of domestic investment projects. These differences fluctuate depending on where an elected official hails from, but the patterns hold if we zoom out.","So, what do those two camps think of DeFi, and is it possible to short circuit the partisan loop in 2022 before it gets set in stone?","What has become abundantly clear is that our national politicians are waking up (many of them belatedly) to the inroads crypto has made into the mainstream over the past few years. No longer the domain of Reddit traders and early adopters, crypto is quickly becoming a “normal” asset that some of the country’s savviest businesspeople admit to holding as part of a well-balanced portfolio. Many Americans are convinced that the government should support the safe development of crypto and DeFi networks, if for no other reason than to keep the American financial system at the forefront of innovation.","According to the respondents of an October Future Majority poll, a combined 28% have either already invested in crypto or would consider doing so in the near future. And, true to the open and democratizing nature of permissionless crypto networks, Asian, Black and Hispanic Americans are more likely to hold crypto than their white counterparts.","Adding to the awareness that crypto and DeFi are generating in the minds of the public was the August battle over the crypto broker provision in the now-passed infrastructure bill. Building on that episode, a recent poll from Punchbowl indicated that 5% of Congressional staffers expect crypto policy to be a major issue in the coming legislative session.","So: the general public is interested and engaged on questions relevant to the future of crypto and DeFi. Some of the country’s most renowned businesspeople accept crypto as part of a well-balanced portfolio, and even Hill staffers expect to deal with crypto more and more in the coming years.","Why, then, do we hear that leading Democrats continue to characterize the entire crypto ecosystem as an investor-rugging Wild West?","It is true that several recent pro-crypto bills have garnered bipartisan support, but the macro trend of high profile luminaries of both parties either supporting or decrying the growth of crypto is becoming increasingly obvious. When Sean Hannity amends his avatar with laser eyes, crypto and DeFi have fallen into the partisan trap.","Part of the problem is the current state of our politics, with any and every issue susceptible to the polarizing effects of partisanship. That Sean Hannity would embrace a topic that Elizabeth Warren rejects is no surprise, of course. It’s also due to a trait of decentralized networks that is simultaneously one of their greatest strengths and weaknesses. Because they are still relatively new and because the potential of DeFi networks is so vast, this technology can mean one thing to one group, and another thing to an opposing group, and both can feel like legitimate positions.","If you feel that the current financial system is unbalanced, with the bulk of its rewards going to very few people, you may see the same problems in crypto markets, latching onto any news about hacks and shitcoin scams to support such a view. Likewise, if you support an individual’s right to determine their own financial future and you support homegrown entrepreneurs building tools to support that financial future, then being pro-crypto is a no-brainer.","Hence, we see the battle lines of Democratic opposition and Republican support for the development of crypto and DeFi networks. However, by retreating to familiar partisan positions (consumer protection vs. pro-business self-determinism), both Republicans and Democrats are missing the bigger picture for the potential of DeFi.","Let’s take the Democratic position first. If you are an average progressive Democrat in 2021, you may believe some or all of the following: Big Tech has too much control over our time and minds; financial inequality and the racial wealth gap are eating away at what should be shared prosperity; and Big Finance has too much control over access to lending and other important, life-building financial services. DeFi may not be able to provide an easy-to-use service to fix all of these problems at the moment, but, in theory, wouldn’t an open network, free from the sway of the loathsome Big Tech and Bank sectors — and, by the nature of its code open to any American regardless of race, sex, or age — be something a progressive Democrat should embrace and embrace warmly? As an elected official, you can and should be concerned by investor protection in crypto networks, as well as trying to promote fairer economics in this new financial system. But, it is possible to hold both positions simultaneously and express this sentiment: as a Democrat, I want my constituents to have access to cutting-edge, open, and safe financial services so that they may build a better life for themselves and their family.","For Republicans, the embrace of crypto is clearer, not only as a way to differentiate themselves from Democrats but also as a reflection of their history as a pro-business and pro-investor party. There is another dimension a well-meaning Republican might explore, that also aligns with long-held, general principles: reducing the role of government in an individual’s life. Supporting services that provide enhanced security and online protection, whether from hackers or government surveillance, fits snugly with the general Republican position that the government should do less, rather than more, in Americans’ lives. As a Republican, support for crypto and DeFi can be more well-rounded, and as a Republican, I want my constituents to benefit from technological innovations that are being pioneered here in the U.S., giving them the power to determine their own financial futures, free from overbearing and unproductive government intrusion.","These types of clarifying statements for Republicans and Democrats are easy to write down, but will we hear them from our representatives in 2022?","I think it’s more likely than not for two reasons: crypto is no longer an issue that can be ignored and\/or demonized without evidence (as has often been the case), and the coming legislative sessions is a sort of “gimme” given that not many bills of note pass in an election year. As we saw in early December’s House Financial Services Committee hearing with several crypto executives, the tenor of the debate and the tone of criticism have shifted towards a more open, curious perspective, in relative terms. Perhaps Democrats have warmed to the benefits crypto networks can provide. Or, perhaps they’re worried that Republicans have seized an issue they cannot afford to be left behind on. Or both.","Either way, the coming Congressional year provides a unique moment: not much is going to pass, so representatives can perhaps be freer to express themselves more openly on a range of issues, including crypto. Secondly, given the bipartisan and growing support for crypto among the constituents of these representatives, they may find engaging on crypto issues is good for their political prospects as well.","This confluence of trends bodes well for crypto and DeFi to break out of their partisan prison.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Congressional","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Graham Newhall","content":"PERSON"},{"type":"’s House Financial Services Committee","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"28%","content":"PERCENT"},{"type":"Punchbowl","content":"LOCATION"},{"type":"Sean Hannity","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Bank","content":"ORGANIZATION"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"Big Finance","content":"ORGANIZATION"}],"hashtag":["CONGRESS"],"authors":["Contributor Network","The Block"]}