{"summary":"Coinbase has withdrawn from Japan amid current market conditions with customers told to withdraw their assets","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203201\/coinbase-halts-operations-in-japan-citing-market-conditions","publishDate":"2023-01-18T04:56:26","id":12957,"type":null,"title":"Coinbase halts operations in Japan citing &#x27;market conditions&#x27;","category":["COMPANIES"],"content":["Crypto exchange Coinbase has paused its business in Japan and has advised customers to withdraw their assets from the platform, the company announced on Wednesday.","Coinbase blamed the current market conditions for the move. The exchange <a href=\"https:\/\/www.coinbase.com\/blog\/halting-operations-in-japan\" data-v-f87c67ca=\"\">stated<\/a> that it would do a complete post-mortem of its operations in the country following the decision.","Coinbase Japan customers have until Feb. 16 to withdraw their assets. Users can choose to withdraw their funds in either fiat or crypto, the announcement stated. Those who fail to do so after Feb. 17 will have to liaise with Japan’s Legal Affairs Bureau — the country’s civil administrative office.","Coinbase began <a href=\"https:\/\/www.theblock.co\/linked\/114994\/coinbase-japan-mufg-crypto-exchange\" data-v-f87c67ca=\"\">operating in Japan<\/a> in 2021 after partnering with Japanese financial firm Mitsubishi UFJ Financial Group. This move came five years after the exchange initially stated its bid to <a href=\"https:\/\/www.theblock.co\/linked\/57443\/coinbase-yet-to-receive-operating-license-in-japan\" data-v-f87c67ca=\"\">establish a presence in the country<\/a>.","Wednesday’s announcement comes barely a week after the company <a href=\"https:\/\/www.theblock.co\/post\/200383\/coinbase-to-cut-20-of-staff-in-latest-round-of-layoffs\" data-v-f87c67ca=\"\">announced a third round of job cuts<\/a>. The exchange has so far removed 2,110 employees from its workforce since June 2022.","Crypto companies continue to deal with the fallout from the year-long bear market both in the crypto and broader financial markets. The crypto scene has also had to navigate significant events like the Terra ecosystem collapse and the FTX bankruptcy.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Feb. 16","content":"DATE"},{"type":"Feb. 17","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"Mitsubishi UFJ Financial Group","content":"ORGANIZATION"},{"type":"Crypto exchange Coinbase","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Osato Avan-Nomayo","The Block"]}