{"summary":"Robinhood announced on Tuesday that it is set to buy Cove Markets, a cross-exchange trading platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127475\/robinhood-buys-cross-exchange-trading-platform-cove-markets","publishDate":"2021-12-14T16:40:46","id":12968,"type":null,"title":"Robinhood buys cross-exchange trading platform Cove Markets","category":["MARKETS"],"content":["Robinhood announced on Tuesday that it bought Cove Markets, a cross-exchange trading platform.","Cove co-founders Scott Knudsen and Victor Glava and the markets team will join the Robinhood crypto team.&nbsp;","Robinhood said in a release announcing the deal that the pair \"share a common goal in making investing in cryptocurrencies simpler and lower cost\". &nbsp;","Cove, which was founded three years ago, lets customers manage accounts across multiple exchange platforms as well as aggregating reams of data. It is set to give Robinhood's crypto product a more sophisticated edge.&nbsp;","“Scott, Victor and the Cove Markets team will bolster our crypto trading platform and help us strengthen our leadership in the crypto industry,” said Christine Brown, chief operating officer of Robinhood Crypto. “Their wealth of experience in trading execution and crypto market infrastructure will help us to build more powerful trading capabilities, bringing the benefits of better competition in the crypto markets to our customers.”","The acquisition is the first for Robinhood's crypto arm and follows its $140 million cash buyout of Say Technologies, its first major purchase since its IPO in July.&nbsp;","Earlier this week it also said it is preparing to <a href=\"https:\/\/www.theblockcrypto.com\/post\/127186\/robinhood-onboards-chainalysis-in-preparation-for-crypto-wallet-launch\" data-v-f87c67ca=\"\">rollout a crypto wallet<\/a>, integrating analytics tools from leading crypto intelligence firm Chainalysis.","Currently, Robinhood offers users exposure to the price movements of various cryptocurrencies on its brokerage app, which also offers more traditional stock trading. However, users cannot withdraw or deposit crypto off-platform.&nbsp;","In September, Robinhood&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/118271\/robinhood-rolling-out-crypto-wallet-transfer-features\" data-v-f87c67ca=\"\">announced plans to change this<\/a>&nbsp;and allow users to move tokens as they would be able to on a crypto exchange like Coinbase or Kraken. That is primarily a regulatory challenge, as the expectations for such a widely used platform to protect against money laundering are quite high.&nbsp;","Since Robinhood went public its stock price has taken a hammering. On Tuesday it was trading at around $18.50, down from all time highs near $70.&nbsp;","<em data-v-f87c67ca=\"\">Update: A line suggesting that the deal would make it easier for Robinhood users to manage their accounts was removed on December 15, after a spokesperson clarified that the firm will not be providing its customers access to platforms through an API, as Cove did.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Victor","content":"PERSON"},{"type":"$18.50","content":"MONEY"},{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"Victor Glava","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Robinhood crypto","content":"ORGANIZATION"},{"type":"Scott","content":"PERSON"},{"type":"Say Technologies","content":"ORGANIZATION"},{"type":"Christine Brown","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$140 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"December 15","content":"DATE"},{"type":"Cove Markets","content":"ORGANIZATION"},{"type":"$70","content":"MONEY"},{"type":"Scott Knudsen","content":"PERSON"},{"type":"Cove","content":"ORGANIZATION"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}