{"summary":"Binance will suspended support for deposits and withdrawals of several cross-chain bridge tokens associated with the Multichain project.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237759\/binance-to-suspend-transfers-of-several-tokens-tied-to-multichain-following-may-incident","publishDate":"2023-07-05T06:01:16","id":12962,"type":null,"title":"Binance to suspend transfers of several tokens tied to Multichain","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto exchange Binance is suspending support for deposits and withdrawals of several cross-chain bridge tokens tied to the Multichain project.","The suspension, set to start on July 7, will remain in place on Binance.com until further notice, as stated in an <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/updates-on-the-suspension-of-deposits-withdrawals-for-multichain-bridged-tokens-3c7d279dd37043bd8290ac718b5c08a4\" data-v-f87c67ca=\"\">announcement<\/a>. The suspension includes an array of tokens minted on Multichain across different networks. It particularly impacts tokens deployed on BNB Smart Chain, including tokens such as Polkastarter (POLS), Alchemy Pay (ACH), and Beefy.Finance (BIFI) and Harvest Finance (FARM).","Tokens minted through the bridge on Fantom, including Beefy.Finance (BIFI) and Alpaca Finance (ALPACA), are also part of the affected list. Travala (AVA), a token minted on Ethereum’s bridge, was also included.","Binance has not specified the reason for suspending assets tied to the Multichain bridge. The exchange merely noted that this is a follow-up to a previous action taken against Multichain on May 24. At the time, Binance <a href=\"https:\/\/www.theblock.co\/post\/232175\/binance-suspends-deposits-for-10-bridged-tokens-over-multichain-situation\" data-v-f87c67ca=\"\">temporarily suspended<\/a> support for deposits of some tokens transferred via Multichain, citing complications with the Multichain protocol.&nbsp;","Despite the ongoing suspension related to the Multichain project, Binance maintains that its users can continue to deposit and withdraw the impacted tokens through other networks supported by the exchange. This means those assets can proceed uninterrupted, provided they do not involve the Multichain project.","The Multichain bridge currently oversees over <a href=\"https:\/\/defillama.com\/protocol\/multichain\" data-v-f87c67ca=\"\">$1.3 billion<\/a> in assets minted through its cross-chain platform. This includes $698 million minted on Ethereum, $339 million on BNB Smart Chain, and $92 million on Fantom, per DeFiLlama data.","In May, the Multichain project experienced difficulties with processing bridge transfers, resulting in numerous stuck transactions. Several pathways of Multichain’s cross-chain bridge, including Kava, zkSync, and Polygon zkEVM, were not operational during the crisis.","Initially, the Multichain team ascribed the problem to technical hiccups. However, later they <a href=\"https:\/\/twitter.com\/MultichainOrg\/status\/1661443109019062272\" data-v-f87c67ca=\"\">clarified<\/a> that while most bridge routes were functioning as expected, a few remained non-operational due to reasons categorized under the broader term, “force majeure.” The project later admitted that it couldn't contact Multichain CEO <span data-v-25901368=\"\" data-v-f87c67ca=\"\">Zhaojun — seemingly confirming rumors that he was detained by Chinese police and had partial control over the project's upgrade functions.<\/span> As of now, the platform's bridge routes appear to have returned to their normal functioning state.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 24","content":"DATE"},{"type":"July 7","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Alpaca Finance","content":"ORGANIZATION"},{"type":"$339 million","content":"MONEY"},{"type":"$92 million","content":"MONEY"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"Multichain","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"$698 million","content":"MONEY"},{"type":"BNB","content":"ORGANIZATION"},{"type":"AVA)","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Harvest Finance","content":"ORGANIZATION"}],"hashtag":["ASSETS"],"authors":["Vishal Chawla","The Block"]}