{"summary":"Stablecoin issuer Tether said today — seemingly for the first time — that it holds no Chinese commercial paper.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159815\/tether-says-that-it-holds-no-chinese-commercial-paper","publishDate":"2022-07-27T08:33:56","id":12967,"type":null,"title":"Tether says that it holds no Chinese commercial paper","category":["TETHER"],"content":["Stablecoin issuer Tether said today that it holds no Chinese commercial paper, seemingly the first time it has made this statement.","In a <a href=\"https:\/\/tether.to\/en\/tether-combats-false-information-to-preserve-the-reputation-of-the-cryptocurrency-ecosystem\/\" data-v-f87c67ca=\"\">statement<\/a>, Tether outlined that it has reduced its commercial paper exposure by $4.7 billion since the <a href=\"https:\/\/tether.to\/en\/tether-continues-to-reduce-commercial-paper-holdings-as-it-solidifies-its-position-as-the-most-transparent-stablecoin\/\" data-v-f87c67ca=\"\">start of this month<\/a>. It currently holds $3.7 billion of commercial paper in its reserves, down 88% from $30 billion in July 2021.","Tether also took aim at critics. \"With that in mind, Tether would like to again reiterate to naysayers who continue to spread falsities about its commercial paper holdings, that you are wrong,\" it said.","This may relate to questions around Tether's commercial paper holdings. When Tether first revealed a breakdown of the reserves backing the tether stablecoin, it <a href=\"https:\/\/www.theblock.co\/post\/104780\/tether-usdt-reserves-breakdown-first-time-since-launch\" data-v-f87c67ca=\"\">showed<\/a> that just under 50% of the reserves were made up of commercial paper. From this point on, critics then questioned that its significant exposure might be mostly made up of Chinese commercial paper — something that could put the stablecoin at risk.","For a long time, Tether never explicity denied that it had exposure to Chinese commercial paper. In September 2021, it <a href=\"https:\/\/www.theblock.co\/post\/117733\/tether-says-it-doesnt-hold-any-commercial-paper-issued-by-evergrande\" data-v-f87c67ca=\"\">denied<\/a> that it had any exposure to commercial paper issued by troubled Chinese real estate giant Evergrande. At the time, it acknowledged that it held international commercial paper but would not specify if it had any exposure to Chinese commercial paper.","Yet in October 2021, Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/features\/2021-10-07\/crypto-mystery-where-s-the-69-billion-backing-the-stablecoin-tether?sref=ImPL49tv\" data-v-f87c67ca=\"\">reported<\/a> that Wall Street traders were unaware of any new entrant buying up large amounts of commercial paper (Tether's holdings would have made it the seventh-largest holder of commercial paper). This suggested that the commercial paper was from oversees. The same report claimed that a document of Tether's reserves showed that it had made billions of dollars' worth of short-term loans to large Chinese companies.","In June 2022, Tether <a href=\"https:\/\/tether.to\/en\/tether-condemns-false-rumours-about-its-commercial-paper-holdings\/\" data-v-f87c67ca=\"\">denied<\/a> rumors that the majority of its commercial paper was Chinese or Asian but it did not specify whether it had any exposure in general. It kept reiterating that it was focused on reducing its commercial paper holdings, something that it had been working on over the last year.","Today's notice appears to be the first time it has clarified its exposure to Chinese commercial paper in general. When asked whether Tether previously owned Chinese commercial paper and has now sold all of its holdings, Tether did not answer the question directly but stated any commercial paper it previously had was rated A2 or better.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"Tether","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"$4.7 billion","content":"MONEY"},{"type":"88%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"October 2021","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$3.7 billion","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["TETHER"],"authors":["Tim Copeland","The Block"]}