{"summary":"DeFi developer Andre Cronje calls for regulations and the birth of a new crypto age driven by trust and not by greed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142299\/andre-cronje-crypto-culture-has-strangled-crypto-ethos","publishDate":"2022-04-18T11:13:50","id":1297,"type":null,"title":"Andre Cronje: &#x27;Crypto culture has strangled crypto ethos&#x27;","category":["DEFI"],"content":["The popular and controversial DeFi architect Andre Cronje has decried the nature of “crypto culture” arguing that it stands in contrast to the ethos of the emerging ecosystem in a blog <a href=\"https:\/\/andrecronje.medium.com\/the-rise-and-fall-of-crypto-culture-3d0e6fd3e0e9\" data-v-f87c67ca=\"\">post<\/a> published Monday.","According to Cronje, crypto culture with its drive for wealth is stifling the more noble pursuits associated with crypto's ethos.","\"I have long been vocal on my disdain of crypto culture, and my love for crypto ethos. Reading that might sound weird, but crypto ethos is concept like self-sovereign rights, self custody, self empowerment. Crypto culture is concepts like wealth, entitlement, enrichment, and ego,\" Cronje stated.","Cronje also argued that many crypto builders have an insufficient understanding of monetary policy.","According to Cronje, it appears DeFi developers read Wikipedia articles on things like bonds, debt instruments, and seigniorage and think “they can do it better.”","According to the article, the crypto builders of today seem to be repeating the same mistakes made by those who designed the current monetary policies in mainstream finance.","The DeFi developer called for more regulation, stating that a robust legal framework is necessary to protect participants. Under such a regulatory framework, Cronje predicted the rise of a new crypto ecosystem driven by trust and not by greed.","When this new crypto age emerges, the current culture-driven iteration will become the badlands populated by rogue actors and their unknown wallets lurking in the shadows, Cronje stated.","While not explicitly indicating a return to the crypto scene, Cronje did state that he was excited about the future of the industry:","\"We are entering a new age, the current iteration will become the badlands, where unknown wallets lurk in the shadows, we will see the rise of a new blockchain economy, not one driven by greed, but instead driven by trust, not trustlessness. There is an irony in having come full circle, yet I find myself more excited than ever. I won’t step foot into the badlands again, but I’m vastly excited about this new future.\"","In March, Cronje and Fantom Foundation developer Anton Nell <a href=\"https:\/\/www.theblockcrypto.com\/linked\/136545\/fantom-tvl-slumps-as-colleague-tweets-andre-cronje-is-quitting-defi\" data-v-f87c67ca=\"\">exited the crypto space<\/a>. Their departure came just weeks after the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/133937\/what-the-heck-is-ve-33-and-why-did-it-cause-fantom-to-take-off\" data-v-f87c67ca=\"\">launch of Solidly<\/a> and its yield optimizer protocol Solidex on the Fantom chain.","The value of Fantom’s DeFi ecosystem declined after the departure, and both Solidly and Solidex have seen significant dips in activity since early March.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Fantom","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"Anton Nell","content":"PERSON"},{"type":"Cronje","content":"LOCATION"},{"type":"Fantom’s DeFi","content":"ORGANIZATION"},{"type":"Cronje","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}