{"summary":"&quot;Looking at the data and the intent, as a signal from the retail side, we are probably at December 2020 or January 2021,&quot; Kris Marzsalek told CNBC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282986\/crypto-ceo-bitcoin-price-healthy","publishDate":"2024-03-17T06:11:08","id":12972,"type":null,"title":"Crypto.com&#x27;s CEO believes bitcoin price in December 2020 phase of cycle","category":["MARKETS"],"content":["The price of bitcoin has increased more than 150% from this time a year ago, and the CEO of Crypto.com believes inflows into the new spot exchange-traded funds have primarily driven the foremost cryptocurrency's run-up. He also thinks that we're probably in the December 2020 or January 2021 stage of the last cycle, and the current price correction is \"healthy.\"","Speaking to CNBC's Squawk Box, Kris Marzsalek <a href=\"https:\/\/www.youtube.com\/watch?v=u3KArEgmqFw\" data-v-f87c67ca=\"\">shared<\/a> his belief that bitcoin's bullish run has been \"predominantly driven by the inflows from the Bitcoin ETFs.\"","\"This is a very successful product,\" he said. \"There is a problem of supply, so it has to be reflected in the price.\"","Indeed, the success of the new spot bitcoin ETF products is hardly up for debate among pundits both inside and outside of the wider crypto industry. On March 12 alone, <a href=\"https:\/\/www.theblock.co\/post\/282137\/bitcoin-etf-inflows-1-billion-usd\" data-v-f87c67ca=\"\">net spot bitcoin ETF inflows hit over $1 billion<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-flows\/embed\" title=\"Spot Bitcoin ETF Flows\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","When asked about the current correction — the price of bitcoin has declined from new all-time highs above $73,000 to roughly $65,000 — Marzsalek said that he believes \"it's a healthy move removing some of the leverage built up in the system.\"","\"What we want to avoid is sudden super-aggressive spikes,\" Crypto.com's CEO explained. \"We would really like to see a steady inflows into the industry, into bitcoin, and other coins — that will allow us to have a run of about 12 to 18 months.\"","The price of bitcoin is currently hovering above $66,000, according to The Block's price <a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-f87c67ca=\"\">data<\/a>.","When asked where retail participants sit in the equation of bitcoin's current market dynamics, Marzsalek said he believes we still have a way to go in this cycle. \"We sit on a ton of proprietary data, so we can look back at what happened in the 2021 cycle from a retail perspective and compare it to what's happening now,\" he explained.","\"Looking at the data and the intent, as a signal from the retail side, we are probably at December 2020 or January 2021.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/alternative-crypto-metrics\/web-traffic\/google-search-volumes\/embed\" title=\"Google Search Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Marzsalek elaborated that the metrics suggest what is currently happening to bitcoin's price is primarily driven by the options market — and that \"this level of volatility is actually pretty low compared to what we've seen in previous cycles.\"","\"I think you would see a steady ramp up, and that's what we want,\" he said, adding: \"This is an asset that you want to hold for decades.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$65,000","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"$73,000","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"March 12","content":"DATE"},{"type":"Marzsalek","content":"PERSON"},{"type":"December 2020","content":"DATE"},{"type":"Kris Marzsalek","content":"PERSON"},{"type":"150%","content":"PERCENT"},{"type":"$66,000","content":"MONEY"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["Adam James","The Block"]}