{"summary":"Matter Labs hired former Activision Blizzard Vice President of Community Michael Lee to lead its growth efforts.\nThe company is behind the zkSync Layer 2 network that runs on top of Ethereum.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231929\/matter-labs-activision-blizzard-michael-lee","publishDate":"2023-05-24T10:00:54","id":1297,"type":null,"title":"Matter Labs hires Activision Blizzard exec to boost zkSync gaming plans","category":["Crypto Ecosystems"],"content":["Matter Labs hired former Activision Blizzard Vice President of Community Michael Lee as its senior vice president of growth, to focus on bringing gaming to its zkSync platform.","At Activision, Lee was focused on its 400 million-strong community across its major games, such as Call of Duty and Overwatch.","\"Crypto is still waiting for its killer app. My personal thesis is — only an epic game has the potential to launch to a million players overnight and quickly scale to ten million if beautifully designed and fun to play,” Lee said in a statement.","Lee will be focused on amplifying zkSync in the gaming sector and using it to reach a wider audience beyond just crypto natives. <a href=\"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum\" data-v-f87c67ca=\"\">ZkSync<\/a> is a Layer 2 network built on Ethereum that offers faster transactions at a lower cost, while still relying on Ethereum’s level of security.","“Currently, the lack of proper infrastructure has been a massive blocker,” Lee said, adding that zkSync would support game development by AAA studios or crypto-curious elite game developers.","This isn’t his first foray into crypto. Prior to Activision, Lee was a vice president at Dfinity, the makers of the Internet Computer Protocol, where he similarly focused on global marketing and communications.","Nor is this the first Activision executive to move into the crypto realm in recent weeks. Last month, Daniel Alegre, former president and chief operating officer of Activision, <a href=\"https:\/\/twitter.com\/dalegre\/status\/1641793257293111296\" data-v-f87c67ca=\"\">joined<\/a> Yuga Labs — the company behind Bored Ape Yacht Club — as CEO.","Matter Labs has already made some headway into the gaming sphere. There are 13 games being developed on the network and two of them are already live. Among them, WEMADE, creator of the game Legend of Mir — which has sold over 500 million copies — is <a href=\"https:\/\/blog.matter-labs.io\/the-future-of-blockchain-gaming-with-wemade-97bebfef223f\" data-v-f87c67ca=\"\">building a game<\/a> called WEMIX."],"hashtag":["ETHEREUM","ZKSYNC"]}