{"summary":"Bitcoin clocked in record highs on several exchanges this morning, and crypto&#x27;s largest trading desk say the activity is bringing volumes to record highs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/86020\/crypto-otc-trading-bitcoin-record-volume","publishDate":"2020-11-30T16:56:55","id":12982,"type":null,"title":"Crypto&#x27;s largest over-the-counter trading desks are reporting record volumes","category":["BITCOIN"],"content":["Bitcoin prices have continued their upward trajectory, and the market's largest over-the-counter trading shops have gone along for the ride.","During the heady days of 2017, trading firms like Genesis Global Trading and B2C2 saw trade sizes in the tens of millions as bitcoin soared to nearly $20,000. The most recent rally bears some similarities to that period, with trading desks reporting even higher volumes than they saw during the last cycle.&nbsp;","At Genesis, OTC volumes are more than six times higher than what they were during the 2017 peak. Since 2017, crypto traders have moved from Skype and Telegram to electronic trading interfaces. At the same time, more institutions have entered the OTC market, which Genesis says is driving the current rally.&nbsp;","According to CEO Michael Moro, the firm is \"seeing much more institutional buying than in 2017.\"","\"Genesis spot desk saw continued institutional BTC spot and call buying as the sell-off on Thanksgiving morning allowed for a good opportunity to average into a long position,\" Moro added.&nbsp;","Last week, Genesis saw spot trading volumes hit $600 million, according to a source. New institutions, ranging from family offices to passive funds, have helped drive those volumes, according to Genesis.&nbsp;It's a similar story at Mike Novogratz's Galaxy Digital, which also runs an over-the-counter trading desk. Galaxy, which wasn't active in the 2017 cycle, is currently clocking in record volumes of its own — a trend also driven by new institutions.&nbsp;","\"Flows through our desk are showing that new, larger institutional players are driving the market at this point, in terms of BTC specifically,\" said trading lead Tim Plakas. \"More crypto-native participants are still active, but definitely more focused on the ETH\/DeFi space with core positions in BTC already put in place.\"","\"In typical crypto fashion, we’ve made a weekend round trip over the long US holiday stretch. BTC is back above $19k and ETH above $600, a +16% and +25% gain from recent lows, respectively,\" a note from the firm's trading desk to counterparties noted.&nbsp;","Elsewhere, cryptocurrency exchanges are also seeing a surge in volumes, as indicated by <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/spot\" data-v-f87c67ca=\"\">data<\/a> compiled by The Block. Total volumes hit $289 billion in November—the third highest month on record.&nbsp;","<iframe title=\"Cryptocurrency Exchange Volume\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","As for what comes next, both Genesis and Galaxy are preparing for what might be a sustained rally.","\"As stated in our Nov 26 commentary below, even on the dip we were constructive given the lack of panic selling from our counterparties,\" said Plakas. \"Pull-backs will happen after massive run-ups, but we think overall risk is to the upside here.\"","As for Genesis, the message was a straightforward one — as they put it, there are \"A LOT more buyers than sellers.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michael Moro","content":"PERSON"},{"type":"$289 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$600","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"+25%","content":"PERCENT"},{"type":"+16%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"OTC","content":"ORGANIZATION"},{"type":"$19k","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Plakas","content":"PERSON"},{"type":"Tim Plakas","content":"PERSON"},{"type":"Skype","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}