{"summary":"Bitcoin mining accounts for 0.10% of greenhouse gas emissions globally, according to a new report from the Cambridge Centre for Alternative Finance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172842\/bitcoin-mining-represents-0-1-of-global-greenhouse-gas-emissions-study-finds","publishDate":"2022-09-27T03:00:52","id":12981,"type":null,"title":"Bitcoin mining represents 0.1% of global greenhouse gas emissions, study finds","category":["BITCOIN"],"content":["Bitcoin mining accounts for roughly 0.10% of global greenhouse gas emissions, a new report from the Cambridge Centre for Alternative Finance (CCAF) found.","That figure amounts to 48.35 million tons of carbon dioxide annually, per the report. The institute also estimated that 37.6% of the energy used by the industry comes from sustainable sources, according to the data published Tuesday.","The numbers are based on the geographical distribution of bitcoin mining in January. CCAF took its <a href=\"https:\/\/www.theblock.co\/post\/147162\/new-data-suggest-many-china-based-bitcoin-miners-may-have-moved-underground-after-the-ban\" data-v-f87c67ca=\"\">most recent data<\/a> and combined it with public information on how electricity is being generated in different regions.","It's important to note that the numbers don't capture \"activities that might be expected to reduce emissions,\" like the use of flare gas, energy produced behind the meter, and waste heat recovery.","\"We're simply lacking the data to capture that,\" said Alexander Neumueller, Cambridge Bitcoin Electricity Consumption Index's project lead and author of the report.","CCAF's estimate on the percentage of sustainable energy use contrasts with the 59.5% that the Bitcoin Mining Council <a href=\"https:\/\/bitcoinminingcouncil.com\/bitcoin-mining-electricity-mix-increased-to-59-5-sustainable-in-q2-%202022\/#:%7E:text=Based%20on%20this%20data%20it,the%20most%20sustainable%20industries%20globally.\" data-v-f87c67ca=\"\">came up with<\/a> in reference to the second quarter of 2022 after surveying mining companies.","The report addressed the discrepancy between those who believe bitcoin will undo environmental progress and those who, on the contrary, think it might help combat climate change.","\"Observing the arguments of both sides, some claims seem rather far-fetched and based on over-simplifications, while others are based on scant information,\" the report says. \"Interest groups on both sides are vying for interpretive authority to sway public opinion in their favour (sic) and persuade policymakers as to the necessity of regulations.\"","A White House report on <a href=\"https:\/\/www.theblock.co\/post\/168621\/white-house-report-proposes-possible-restrictions-on-proof-of-work-crypto-mining\" data-v-f87c67ca=\"\">crypto assets and climate published earlier this month<\/a> encouraged regulators to work towards reducing greenhouse gas emissions and stated that the administration or Congress might consider restrictions down the line if all else fails. On the other hand, it suggested that certain types of energy used to power bitcoin mines could have a positive impact on emissions.","In response to the White House report, Marathon CEO Fred Thiel <a href=\"https:\/\/www.theblock.co\/post\/170492\/marathons-thiel-regulators-should-incentivize-renewables-for-bitcoin-miners\" data-v-f87c67ca=\"\">said that U.S. regulators should create incentives<\/a> for bitcoin miners to use renewable energy and disincentives for fossil fuel-based sources.","The current annual estimate of greenhouse gas emissions from bitcoin mining (as of Sept. 21) is 14.1% lower than in 2021, according to CCAF's findings.","\"A significant decrease in mining profitability led to a decline in electricity consumption despite substantial increases in hashrate,\" the report says.","It points towards a possible increase in the efficiency of mining hardware, as the revenue decline encourages miners to retire older and less efficient hardware.","\"Even if the hashrate is increasing, this does not necessarily translate into increased demand of electricity consumption if the efficiency of the devices is increasing,\" Neumueller said. \"Miners are rational economic agents. They would not run something just for running. They would turn off machines that are not profitable and then continue with the more profitable ones.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"0.10%","content":"PERCENT"},{"type":"Cambridge Centre for Alternative Finance","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"CCAF","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"37.6%","content":"PERCENT"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"second quarter of 2022","content":"DATE"},{"type":"Fred Thiel","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Neumueller","content":"PERSON"},{"type":"14.1%","content":"PERCENT"},{"type":"Sept. 21","content":"DATE"},{"type":"Bitcoin Mining Council","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Cambridge","content":"LOCATION"},{"type":"59.5%","content":"PERCENT"},{"type":"Alexander Neumueller","content":"PERSON"}],"hashtag":["MINING"],"authors":["Catarina Moura","The Block"]}