{"summary":"The US Federal Reserve raised rates by 75 basis points in an attempt to fight hot inflation in the U.S.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171658\/us-federal-reserve-hikes-interest-rates-by-tk-basis-points","publishDate":"2022-09-21T14:06:19","id":12992,"type":null,"title":"U.S. Federal Reserve hikes interest rates by 75 basis points","category":["MARKETS"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The U.S. Federal Reserve has raised the US federal funds rate by 75 basis points and marking a 15-year high.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Wednesday’s decision was largely expected, with the market pricing in a rise of 75 basis points ahead of time. <\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">\"The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run. In support of these goals, the Committee decided to raise the target range for the federal funds rate to 3 to 3-1\/4 percent and anticipates that ongoing increases in the target range will be appropriate,\" the Fed <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/pressreleases\/monetary20220921a.htm\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said<\/a>.<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The move is intended to fight inflation which remains <a href=\"https:\/\/www.theblock.co\/post\/169220\/u-s-inflation-comes-in-above-estimates-8-3-year-on-year-and-0-1-month-on-month\" data-v-f87c67ca=\"\">hot<\/a>, having risen 0.1% month-on-month from July to August and 8.3% year-on-year in August. Jerome Powell <a href=\"https:\/\/www.theblock.co\/post\/165927\/markets-whipsaw-following-jerome-powells-hawkish-speech-at-jackson-hole\" data-v-f87c67ca=\"\">said<\/a> in August that today's decision would depend on the \"totality of the incoming data and the evolving outlook.\"<\/span>","Source: <a href=\"https:\/\/www.federalreserve.gov\/releases\/h15\/\" data-v-f87c67ca=\"\">Federal Reserve<\/a>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The price of bitcoin gyrated around $19,000&nbsp;on the news, having traded close to $19,500 prior to the announcement. <\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">At the time of writing, bitcoin is trading hands at about $18,900 according to TradingView data.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","With crypto prices stuck in the doldrums and without any major events on the calendar following last week's Merge, it's unclear what could boost prices in the near term.","Speaking to The Block ahead of the announcement, James Malcolm, head of FX strategy at UBS, spoke to this point.","\"Now the Merge is over and activity in the space has sagged back it’s difficult to envisage a new catalyst for crypto beyond a simple recovery in risk assets,\" he said. Malcolm went on to say that a slightly more dovish Fed would be an example of such a catalyst, however, the threat of tighter regulation should weigh on crypto going forward.&nbsp;","Malcolm went on to say there is a disconnect between crypto advocates and potential adopters that is \"seemingly impossible bridge.\" Notably, he said advocates need to \"amend their message and recognize setbacks and address remaining hurdles, rather than just keep reiterating how they think this is the next best innovation since the internet.\"","Finally, traditional asset managers have specific needs and constraints according to Malcolm, and longstanding legal and regulatory hurdles can’t be brushed aside by increasingly tired hype.","\"Crypto service providers still refuse to meet them where they are, metaphorically speaking, and address their specific concerns. And infrastructure-wise, what the space calls an ‘institutional grade offering’ is quite different from what we understand that to be, in terms of prime brokerage services, liquidity provision, and so on,\" he concluded.&nbsp;","Michael Brown, head of market insights at Caxton, told The Block that more aggressive action from the Fed — primarily via hawkish messaging through a steep upward revision to the dot plot this year and next — will be bearish for risk assets in general, including crypto.","\"With the Fed funds rate set to rise to a 15-year high, the era of cheap money is certainly at an end, and with downside economic risks mounting, the outlook remains poor for crypto in general,\" he said.&nbsp;","Conversely crypto investment firm QCP Capital said in its Wednesday market report that it expected a 75 basis point increase, with a downshift to 50 basis points in the next meeting. The firm went on to say this could be enough to drive a relief rally in markets.&nbsp;","source: QCP Capital","\"Every FOMC meeting this year has preceded an uptick in markets,\" per the above chart QCP shared in its update. \"How long this rally lasts is another question though,\" the QCP team wrote.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"8.3%","content":"PERCENT"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"3-1\/4 percent","content":"PERCENT"},{"type":"Michael Brown","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"UBS","content":"ORGANIZATION"},{"type":"0.1%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"James Malcolm","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"2 percent","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"$19,000","content":"MONEY"},{"type":"Committee","content":"ORGANIZATION"},{"type":"$19,500","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"$18,900","content":"MONEY"},{"type":"Malcolm","content":"LOCATION"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"Every FOMC","content":"ORGANIZATION"},{"type":"Caxton","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE","JEROME POWELL"],"authors":["Adam Morgan McCarthy","The Block"]}