{"summary":"Robinhood has taken heat for one of its major money makers: payment for order flow. But they&#x27;re not the only retail broker raking in millions from the controversial practice.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68875\/not-just-robinhood-brokers-combined-big-traders","publishDate":"2020-06-22T14:56:27","id":12995,"type":null,"title":"Not just Robinhood: These three brokers combined made more than $300 million from big trading firms in Q1","category":["MARKETS"],"content":["Three of the best-known brokerage firms raked in more than $300 million by routing stock and options order flow to the world's fastest traders during the first quarter of 2020, according to recent filings.","<a href=\"https:\/\/www.tradersmagazine.com\/departments\/equities\/sec-grants-temporary-relief-for-rule-606-compliance\/\" data-v-f87c67ca=\"\">A rule change<\/a> implemented at the beginning of the year requires brokers to disclose more information about their order routing activity. The resulting disclosures illustrate for the first time exactly how much money these firms generate from payment for order flow (PFOF), a controversial Wall Street practice. As The Block <a href=\"https:\/\/www.theblockcrypto.com\/daily\/68121\/new-filing-shows-robinhood-brought-in-close-to-100-million-by-offloading-order-flow-in-the-first-quarter\" data-v-f87c67ca=\"\">first reported<\/a> last week, popular millennial-aimed brokerage firm Robinhood received more than $90 million in PFOF payments during the first quarter.&nbsp;","The practice — which refers to the compensation an electronic market maker will pay a retail broker in exchange for their clients' orders — is one of the main ways such firms make money. Retail brokers can route their customer orders directly to exchange venues, but most simply route orders to large electronic market makers. Detractors of the practice say it creates conflicts of interest between brokers and their clients, whereas advocates note that trading firms have an obligation to execute those client orders at the best possible price.&nbsp;","In any case, there's no doubt that PFOF has become a vital source of revenue for retail brokers, according to the new 606 data. Historically, brokers made money from commissions, but the once-ubiquitous per-trade-fees dropped precipitously over the last decade.","At the end of last year, fee compression forced the hands of most brokers, leading&nbsp;<a href=\"https:\/\/www.marketwatch.com\/story\/fidelity-cuts-fees-to-0-as-it-jumps-on-zero-commission-bandwagon-2019-10-10\" data-v-f87c67ca=\"\">Fidelity<\/a>, <a href=\"https:\/\/www.cnbc.com\/2019\/10\/02\/e-trade-drops-commissions-on-trades-joining-schwab-td-ameritrade-in-brokerage-fee-war.html\" data-v-f87c67ca=\"\">E*Trade<\/a>, <a href=\"https:\/\/www.cnbc.com\/2019\/10\/01\/charles-schwab-is-eliminating-online-commissions-for-trading-in-us-stocks-and-etfs.html\" data-v-f87c67ca=\"\">Charles Schwab<\/a>&nbsp;and <a href=\"https:\/\/www.cnbc.com\/2019\/10\/02\/the-end-of-commissions-for-stock-trading-is-near-as-td-ameritrade-cuts-to-zero-matching-schwab.html\" data-v-f87c67ca=\"\">TDAmeritrade<\/a> to bring their fees to zero for stock trades. In 2018, commissions accounted for a sizable portion of brokerage firms' revenue. <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-10-10\/brokers-profit-from-you-even-if-they-don-t-charge-for-trading?sref=w3vFo7gi\" data-v-f87c67ca=\"\">Data<\/a> from that year shows such fees accounted for just 7% of Charles Schwab's net revenue whereas they comprised more than 36% of TDAmeritrade's revenues and 17% of E*Trade's.","As for PFOF, TDAmeritrade led its main rivals in total payments, according to data compiled by The Block. In total, trading firms paid TDAmeritrade over $200 million to its brokerage and clearing divisions. For TDAmeritrade, payments totaled approximately $103.2 million. Citadel Securities accounted for more than 41% of those payments, followed by Global Execution Brokers, Morgan Stanley and Virtu Financial. Virtu Financial and Citadel Securities, the sister company of hedge fund Citadel, are among the most notable electronic market makers.&nbsp;","&nbsp;","According to filings for TD's clearing division, TDAmeritrade Clearing Inc, received approximately $100.9 million in payments. Citadel Securities accounted for 36.2% of those payments.&nbsp;","","","Meanwhile, E*Trade brought in $79.5 million from PFOF, according to its own filings for the first quarter.","Interestingly, Morgan Stanley accounted for 17% of its payments, the second-highest next to Citadel. At the beginning of the year, Morgan Stanley <a href=\"https:\/\/www.nytimes.com\/2020\/02\/20\/business\/morgan-stanley-etrade.html\" data-v-f87c67ca=\"\">agreed to purchase<\/a>&nbsp;E*Trade in a $13 billion deal.","Charles Schwab — which has <a href=\"https:\/\/pressroom.aboutschwab.com\/press-release\/corporate-and-financial-news\/charles-schwab-corporation-acquire-td-ameritrade\" data-v-f87c67ca=\"\">its own deal<\/a> to acquire TDAmeritrade in the works — brought in $53 million from PFOF in Q1. Its payments were also relatively evenly distributed. Citadel's share accounted for 29% whereas Virtu and Wolverine accounted for 13.1% and 12.5%, respectively.&nbsp;","To be sure, PFOF is just one part of the overall market structure story.","Trading firms compete vigorously for retail order flow and, in doing so, help drive down costs for those clients, according to TDAmeritrade.","\"We believe competition among various market destinations encourages innovation, price improvement, and other benefits that deliver not just quality executions, but a best-in-class client experience,\" the firm said in a statement, adding:","\"The revenue we earn, which reflects the high volume of trades our firm handles, allows us to continue investing in that experience: broad security selection, cutting-edge tools, comprehensive education, and superior service.\"","Shane Swanson of Greenwich Associates similarly remarked that the competition among trading firms has resulted in price improvement for end-clients.&nbsp;","Brokers are required to route orders to where they will be executed at the best price, not where they will get the highest payment. Although that doesn't always happen, the aggregate price improvement that clients of retail brokers see by offloading their orders is an order of magnitude higher than what brokers receive in PFOF, Swanson said.&nbsp;","\"The price improvement customers of brokers see is in the billions,\" he said.&nbsp;","A representative of Citadel Securities said the firm's aggregate price improvement for marketable equity orders topped $322 million in the first quarter. According to a supplemental slideshow for Virtu's first quarter earnings, the firm's aggregate price improvement across order types stood at $264 million — a 182% increase relative to the fourth quarter of 2019.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$100.9 million","content":"MONEY"},{"type":"TD","content":"ORGANIZATION"},{"type":"36.2%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"12.5%","content":"PERCENT"},{"type":"$53 million","content":"MONEY"},{"type":"29%","content":"PERCENT"},{"type":"$90 million","content":"MONEY"},{"type":"Charles Schwab","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"$264 million","content":"MONEY"},{"type":"$103.2 million","content":"MONEY"},{"type":"Greenwich Associates","content":"ORGANIZATION"},{"type":"Swanson","content":"PERSON"},{"type":"182%","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"$322 million","content":"MONEY"},{"type":"Citadel","content":"LOCATION"},{"type":"7%","content":"PERCENT"},{"type":"the first quarter","content":"DATE"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"13.1%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Virtu","content":"ORGANIZATION"},{"type":"Shane Swanson","content":"PERSON"},{"type":"first quarter of 2020","content":"DATE"},{"type":"41%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"TDAmeritrade Clearing Inc","content":"ORGANIZATION"},{"type":"Citadel","content":"ORGANIZATION"},{"type":"36%","content":"PERCENT"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"$79.5 million","content":"MONEY"},{"type":"fourth quarter of 2019","content":"DATE"},{"type":"$13 billion","content":"MONEY"}],"hashtag":["ROBINHOOD"],"authors":["Frank Chaparro","John Dantoni","The Block"]}