{"summary":"DeFiance Capital, Arthur Cheong&#x27;s crypto investment firm, is back in the game after getting hit by the now-bankrupt crypto hedge fund Three Arrows Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219264\/defiance-capital-completes-first-close-of-100-million-liquid-token-fund","publishDate":"2023-03-13T11:55:07","id":12999,"type":null,"title":"DeFiance Capital completes first close of $100 million liquid token fund","category":["COMPANIES"],"content":["Arthur Cheong's crypto investment firm is back in the game after getting hit by the now-bankrupt crypto hedge fund Three Arrows Capital.","DeFiance Capital completed the first close of a new $100 million liquid token fund by raising \"eight figures\" in the process, two sources with direct knowledge of the matter told The Block. While that could mean anything between $10 million and $99 million, the initial raise came in under $50 million, said one of the sources.","The Block <a href=\"https:\/\/www.theblock.co\/post\/174077\/arthur-cheongs-defiance-capital-raising-100-million-to-invest-in-liquid-tokens\" data-v-f87c67ca=\"\">first reported<\/a> in September that DeFiance was seeking $100 million for a liquid token fund and that almost half the amount had been committed. Some of those commitments were reduced after the FTX exchange collapsed in November, but the fund still managed to close the first tranche and began investing this month, the source said.","\"A good mix of investors\" backed the vehicle, including crypto funds of funds, family offices and some of DeFiance's existing investors, the source added.","DeFiance Capital was founded in 2020 in Singapore by Cheong, a popular crypto personality with over 145,000 Twitter followers. While it once described itself as a \"sub-fund and share class of Three Arrows Capital,\" DeFiance <a href=\"https:\/\/www.theblock.co\/post\/157740\/defiance-capital-distances-itself-from-bankrupt-crypto-fund-three-arrows-capital\" data-v-f87c67ca=\"\">distanced<\/a>&nbsp;itself from 3AC after it collapsed last June and said it was \"an entirely separate and independent crypto-focused investment fund.\"","3AC, once one of the biggest crypto hedge funds, failed to meet margin calls of its leveraged positions when crypto prices tanked last year. The company is currently undergoing liquidation proceedings in a British Virgin Islands court, and DeFiance is one of 3AC's creditors and is working with liquidators to gain access to assets of its first fund that's worth \"significantly more than $100 million,\" according to the source.","Launching amid a bear market, DeFiance's liquid token fund is aiming to grab up tokens that are currently trading below venture round valuations.","\"Multiple venture-backed projects have launched tokens which have proceeded to slump below their IDO\/IEO [initial DEX offering\/ initial exchange offering] valuations,\" read a draft article written by DeFiance on liquid token investing that was obtained by The Block.","\"A handful of project tokens are even trading below their latest private round valuations,\" the article continued. \"This situation is further exacerbated by the onset of the bear market, which has led to indiscriminate selling of assets across the board. Thus, we believe that multiple crypto startups would have listed tokens with extremely favorable risk-reward profiles.\"","DeFiance declined to comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cheong","content":"ORGANIZATION"},{"type":"DeFiance","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"last June","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"$99 million","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["NEW VC FUNDS"],"authors":["Yogita Khatri","The Block"]}