{"summary":"Compound has approved a decision to pause four assets with low market liquidity.\nThis is to protect Compound from security attacks involving price manipulation. ","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179688\/compound-suspends-four-tokens-with-low-liquidity-as-lending-assets","publishDate":"2022-10-25T10:57:45","id":130,"type":null,"title":"Compound suspends four tokens with low liquidity as lending assets","category":["Lending"],"content":["<span data-v-f87c67ca=\"\">Decentralized lending protocol Compound is pausing the use of four tokens as lending collateral on the platform. This means that the protocol will not allow users to deposit these assets and take loans, in order to protect the protocol from market manipulation attacks.<\/span>","<span data-v-f87c67ca=\"\">Compound's governance members approved<\/span> <a href=\"https:\/\/compound.finance\/governance\/proposals\/131\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Proposal-131<\/span><\/a><span data-v-f87c67ca=\"\">, which asked to pause assets with low liquidity from being used as lending collateral, on Monday. The tokens are 0x (ZRX), basic attention token (BAT), maker (MKR) and yearn finance (YFI). <\/span><span data-v-f87c67ca=\"\">The members passed the proposal with overwhelming support, with 554,126 votes in favor of it, representing 99.99% of the votes. Only a single voter went against the proposal.<\/span>","<span data-v-f87c67ca=\"\">The four assets were found to have unfavorable liquidity profiles, the proposal stated. Prices of assets with low liquidity can be easily manipulated. T<\/span><span data-v-f87c67ca=\"\">he proposal comes after Mango Markets, a popular lending market on Solana, suffered a <a href=\"https:\/\/www.theblock.co\/post\/177736\/privacy-policy\" data-v-f87c67ca=\"\">$114 million<\/a> price manipulation attack earlier this month. <\/span>","<span data-v-f87c67ca=\"\">Compound founder Robert Leshner, who voted in favor of Proposal-131, <a href=\"https:\/\/www.youtube.com\/watch?v=ESO107lWeqI\" data-v-f87c67ca=\"\">said<\/a> on the Unchained Podcast that lending protocols should review their risk parameters in response to that Mango exploit. He added that it served as a wakeup call for lending protocols, including Compound Finance. An external <a href=\"https:\/\/github.com\/volt-protocol\/volt-protocol-core\/blob\/develop\/audits\/venue-audits\/compound.md\" data-v-f87c67ca=\"\">review<\/a> of the Compound Finance codebase found that certain tokens used on Compound could potentially be manipulated to steal funds.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Every protocol has to address the risk parameters assuming that some black hat hacker is going to try to exploit it. It’s a great wake up call for every DeFi project on every single blockchain to take this as a wake-up call,” Leshner<\/span> <span data-v-f87c67ca=\"\">said<\/span>, referring to<span data-v-f87c67ca=\"\"> the Mango Markets exploit.<\/span>","<span data-v-f87c67ca=\"\">A similar <\/span><a href=\"https:\/\/governance.aave.com\/t\/arc-price-manipulation-implications-on-aave-october-2022\/10262\/11\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">discussion<\/span><\/a><span data-v-f87c67ca=\"\"> has been going on among governance members at Aave, the largest lending protocol on Ethereum. Chaos Labs, a crypto risk management firm has suggested turning off the use of ren (REN) and 0x protocol (ZRX) as collateral assets immediately on Aave. Aave is yet to propose a vote to disable those collateral assets.<\/span>"],"hashtag":["LENDING"]}