{"summary":"This is Part 1 of a multi-part comprehensive series on blockchain-based gaming by Zane Huffman: Twitter @jeffthedunker The series is a culmination of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34646\/blockchain-gaming-part-i-the-opportunity","publishDate":"2019-08-02T18:53:46","id":13005,"type":null,"title":"Blockchain Gaming Part I: The opportunity","category":["TECHNOLOGY"],"content":["<em data-v-f87c67ca=\"\">This is Part 1 of a multi-part comprehensive series on blockchain-based gaming by <a href=\"https:\/\/twitter.com\/jeffthedunker\" data-v-f87c67ca=\"\">Zane Huffman<\/a>: Twitter @jeffthedunker<\/em>","<em data-v-f87c67ca=\"\">The series is a culmination of historical accounts and interviews with a number of blockchain and crypto based game projects, sprinkled in with opinions on the current state of gaming.<\/em>","<span data-v-f87c67ca=\"\">Beyond just store of value and medium of exchange properties, cryptocurrency and blockchain technology encompass a number of nuanced applications. This emerging technology enables, alongside units of value, the capacity to transact data and information between participants and broadcast these values to the larger network. This elevated usage of cryptocurrency has seen experimentation in industries and niches across the board. Of the first initiatives, the space has persistently seen a strong push in the integration of blockchain and crypto into online gaming.<\/span>","<span data-v-f87c67ca=\"\">As the overarching crypto space continues to mature and grow, so to does the blockchain gaming niche. The current state of the niche represents a race between enterprise corporations and crypto startups across the largest blockchains to be the first to create and share the infrastructure to harbor the gaming environments of tomorrow and create the first blockbuster blockchain game.<\/span>","<span data-v-f87c67ca=\"\">However, in order to ignite the spark that will in turn ignite the gaming revolution, builders and developers in blockchain gaming must overcome the failures of their predecessors and build solutions to the cost, speed, and scalability concerns that have inhibited past and current developments.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">The worldwide video game industry generated a sizeable <\/span><a href=\"https:\/\/www.gamesindustry.biz\/articles\/2018-12-17-gamesindustry-biz-presents-the-year-in-numbers-2018\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">US$134.9 billion in 2018<\/span><\/a><span data-v-f87c67ca=\"\">, and with strong growth each year, that number is expected to continue to increase at impressive rates. It’s also one of the most popular industries in the world - <\/span><a href=\"https:\/\/gamegavel.com\/mobile-gaming-statistics\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">there are more than 2.3 billion gamers worldwide<\/span><\/a><span data-v-f87c67ca=\"\">. That figure represents a third of the world’s population; <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">everyone <\/span><\/i><span data-v-f87c67ca=\"\">is gaming.<\/span>","","","","","<span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\nDespite this growth, the video game industry still suffers from a number of shortcomings that have left both consumers and producers dissatisfied. The current trends of video games have directed activity away from Triple A masterpieces to “freemium” pay-to-win mobile games. These mobile games are designed to be addicting and drain players for as much money as possible, and <\/span><b data-v-f87c67ca=\"\">not <\/b><span data-v-f87c67ca=\"\">to be fun.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In suit with the mobile market, PC and console game development has also regressed in certain metrics. The industry has become increasingly accepting of the marketing and sale of unfinished and incomplete games, with core components added later as downloadable content for additional pay. Alternatively, developers earn their profit with unfinished “early-access” games and subsequently abandon their projects in search of the next payday.<\/span>","<span data-v-f87c67ca=\"\">Unfortunately, the video game industry is oversaturated with subpar content, where quality is substituted with aggressive marketing. Indie developers looking to bring their dream games to fruition get the short end of this stick. By certain estimates- the average indie developer can expect to <\/span><a href=\"https:\/\/www.gamasutra.com\/view\/news\/221533\/Game_Developer_Salary_Survey_2014_The_results_are_in.php\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">barely earn US$10,000 a year<\/span><\/a><span data-v-f87c67ca=\"\">. This is far below that of a minimum wage job anywhere in the U.S.<\/span>","<span data-v-f87c67ca=\"\">Alas, game development is becoming increasingly centralized to the biggest forces in the industry. In 2018, <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/2018_in_video_gaming\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">seven of the top 10<\/span><\/a><span data-v-f87c67ca=\"\"> highest grossing games worldwide were games owned or partially owned by Tencent.<\/span>","<span data-v-f87c67ca=\"\">So, in a broad overview, today’s video game industry looks like one dominated by several Triple A companies that push out increasingly expensive, frustrating, and unrewarding games for the global population of billions of gamers. Small-time and indie developers are crushed by their enterprise counterparts, and their labor rarely pays off. Essentially, <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Nobody <\/span><\/i><span data-v-f87c67ca=\"\">is having fun.<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">Fortunately, blockchain provides solutions to the woes of the global gaming industry. Game currencies, items, avatars, gameplay inputs, and even entire games can be propagated on and secured by the blockchain. Proper execution of blockchain into online games suggests players can interact with one another and the games they play in a manner that has never before been possible. It also suggests that developers can formulate new genres of games by emphasizing gameplay elements unique to blockchain gaming.<\/span>","<span data-v-f87c67ca=\"\">Primarily, blockchain gaming is exciting as it can empower players and improve their experience. The following are several of the primary benefits players can enjoy through blockchain gaming.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","&nbsp;","&nbsp;","&nbsp;","","","<span data-v-f87c67ca=\"\">While it’s certainly important to improve the experience of gamers, it’s also necessary to understand the benefit developers have by incorporating blockchain into their game development. After all, if it’s nothing but headaches, developers simply would not bother. When applied intuitively, there are a range of benefits for developers to enjoy while building blockchain games.<\/span>","&nbsp;","Zane was first exposed to Bitcoin in 2013 through a gaming community that utilized Bitcoin. Since then, he's followed gaming closely while immersing himself further in the cryptocurrency space. In 2015, he began working as a freelance writer for several crypto news blogs, and today continues to work as a freelance writer for various projects and websites in the space, primarily focusing on educational and technical content. His pinpoint area of focus within cryptocurrency continues to be gaming.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"US$134.9 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Zane Huffman","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"US$10,000","content":"MONEY"}],"hashtag":[],"authors":["Contributor Network","The Block"]}