{"summary":"Coinbase Wallet will now show transaction previews for transactions, in a way that should help prevent NFT scams.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206684\/coinbase-wallet-shows-transaction-previews-to-protect-against-nft-scams","publishDate":"2023-01-30T10:51:04","id":13006,"type":null,"title":"Coinbase Wallet shows transaction previews to protect against NFT scams","category":["CRYPTO ECOSYSTEMS"],"content":["Coinbase Wallet has added transaction previews for its users to include a visual representation of what actions they are taking when signing transactions, in the company's latest move to help prevent common NFT scams.","Coinbase Wallet is the standalone non-custodial wallet offered by crypto exchange Coinbase and is separate from the wallet features contained in its main exchange app. The new feature comes within a week of experienced NFT user and Moonbirds founder Kevin Rose <a href=\"https:\/\/www.theblock.co\/post\/205606\/moonbirds-creator-kevin-rose-hacked-at-least-1-million-in-nfts-stolen?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">getting phished<\/a> for more than $1 million of NFTs after signing a malicious transaction — something that this kind of new feature is designed to help prevent.","The transaction preview will show the user how their balance is expected to change based on the transaction they are signing, according to a <a href=\"https:\/\/www.coinbase.com\/blog\/making-web3-exploration-more-secure-with-coinbase-wallet\" data-v-f87c67ca=\"\">blog post<\/a>. Similarly, the wallet will highlight when a decentralized application (dapp) is requesting approval to withdraw tokens — including NFTs — from the user's wallet. Both features are only available on the Ethereum and Polygon networks.","Coinbase Wallet has added wider support for Ledger hardware wallets and expanded wallet customization, letting its users create multiple sets of wallets that work across multiple blockchains. In a few weeks, it intends to make it easier to view and revoke token permissions (where a user allows an application to interact with tokens in their wallet).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Moonbirds","content":"ORGANIZATION"},{"type":"Kevin Rose","content":"PERSON"}],"hashtag":["BAYC","COINBASE","HACKS"],"authors":["Tim Copeland","The Block"]}