{"summary":"Stephane Gosselin, who formerly co-founded Flashbots, has released a Telegram bot for executing tokens swaps on Ethereum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262356\/flashbots-co-founder-unveils-telegram-trading-bot-alfred","publishDate":"2023-11-09T11:08:05","id":13000,"type":null,"title":"Flashbots co-founder unveils Telegram trading bot &#x27;Alfred&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Stephane Gosselin, who previously co-founded the MEV-focused research firm Flashbots, has introduced Alfred — a new bot on Telegram aiming to facilitate user-friendly execution of token swaps and protect against maximal extractable value (MEV) profits generated by re-ordering of transactions.","Having left Flashbots last year, Gosselin is now the CEO of Frontier Research and has forayed into Telegram bots, a niche that has seen significant interest but has also faced challenges around product maturity and user security.","<span data-v-f87c67ca=\"\">He has co-developed Alfred in partnership with another research firm, Kolibrio, to counteract the issue of maximal extractable value in on-chain swaps caused by front-running and rebalancing of liquidity pools on <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.43%\n    <\/span><\/a> <!----><\/span><\/span>. Overall, the bot aims to give users advanced trading tools, besides protection against MEV within the social messaging app’s interface.<\/span>","\"I am excited to introduce Alfred and work on improving user experience in web3. Alfred leverages all the exciting innovations brought by the transaction supply chain to create delightful on chain interactions,\" Gosselin told The Block in a statement.","In 2020, Gosselin, along with other co-founders, started working on Flashbots, a research and development firm focusing on MEV. There, he contributed to designing the MEV supply chain.","He <a href=\"https:\/\/www.theblock.co\/post\/175709\/flashbots-co-founder-steps-down-after-disagreements-with-team-over-censorship\" data-v-f87c67ca=\"\">departed<\/a> from Flashbots in October 2022 following disagreements related to reported censorship of transactions by the firm's <a href=\"https:\/\/www.theblock.co\/post\/210443\/more-than-100000-eth-has-gone-through-mev-boost-since-the-merge\" data-v-f87c67ca=\"\">MEV Boost<\/a> software. The software was reportedly filtering out Ethereum transactions connected with OFAC-sanctioned Tornado Cash.","In July 2023, the Paradigm-backed firm <a href=\"https:\/\/www.google.com\/search?q=flasbots+raised+theblock.co&amp;oq=flasbots+raised+theblock.co&amp;gs_lcrp=EgZjaHJvbWUyBggAEEUYOdIBCDg3MDJqMGoxqAIAsAIA&amp;sourceid=chrome&amp;ie=UTF-8\" data-v-f87c67ca=\"\">raised<\/a> $60 million at a valuation of $1 billion.","The Alfred bot enters a competitive arena with several existing projects, including Unibot, Banana Gun, and Maestro, and began operations last week. As a Telegram bot, it targets Ethereum users with features designed for token sniping and swapping, while safeguarding transactions against front-running by malicious bots, a prevalent issue in decentralized finance.","The use of Alfred is straightforward: users command the Alfred bot in a Telegram chat, which presents a menu to create a new wallet. Alfred then generates a private key and corresponding address directly within the chat. Users can then start swapping tokens.","The project marks a shift away from the common practice of anonymity among founders of Telegram bot projects. It also emerges in a context where the trustworthiness and security of Telegram bots created by unidentified developers has been repeatedly <a href=\"https:\/\/www.theblock.co\/post\/241386\/telegram-crypto-bots\" data-v-f87c67ca=\"\">questioned<\/a>.","Over the past few months, a growing number of crypto traders have been drawn to bots integrated with the messaging app Telegram, such as Unibot. However, there are security concerns, particularly regarding how these bots manage user assets.","Last month, the router contract that Unibot had deployed was <a href=\"https:\/\/www.theblock.co\/post\/260133\/unibot-confirms-exploit-and-promises-compensation-as-token-price-plunges\" data-v-f87c67ca=\"\">exploited<\/a>, resulting in a loss of over $600,000. This was due to a critical vulnerability that allowed an intruder to use a \"transferFrom()\" function to empty approved tokens directly from Unibot user wallets. The attack was similar to the one that targeted Maestro, another Telegram trading bot, <a href=\"https:\/\/www.theblock.co\/post\/259338\/maestro-telegram-bot-suffers-a-contract-exploit-500000-of-eth-stolen?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">leading<\/a> to a loss of roughly $500,000 a week prior.","In response to security, the team acknowledges that while Alfred strives for a non-custodial experience, it may not provide the same level of security as hardware wallets or web-based wallets. Rather, it's aiming to make swaps user-friendly, shield them from front-running, and ensure user accounts are relatively secure from potential malicious incidents.","Unlike most other Telegram bots, Alfred does not have a plan for a dedicated token at the moment. “Alfred does not currently have a token, as our focus is on product development,” the team at Frontier said. It is considering various revenue models, which may include implementing a service fee for transactions made through the bot.","<em data-v-f87c67ca=\"\">Updated with a comment from Frontier.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gosselin","content":"PERSON"},{"type":"Unibot","content":"LOCATION"},{"type":"Unibot","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Frontier","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$600,000","content":"MONEY"},{"type":"Alfred","content":"PERSON"},{"type":"Kolibrio","content":"PERSON"},{"type":"CEO of Frontier Research","content":"ORGANIZATION"},{"type":"bot","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"},{"type":"Alfred bot","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Paradigm","content":"LOCATION"},{"type":"$60 million","content":"MONEY"},{"type":"-0.43%","content":"PERCENT"},{"type":"Telegram bot","content":"ORGANIZATION"},{"type":"Stephane Gosselin","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"MEV","content":"ORGANIZATION"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}