{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/24807\/multilevel-marketing-token-based-pyramid-scheme-sued-for-securities-law-violations-by-sec","publishDate":"2019-05-27T09:47:01","id":13011,"type":null,"title":"Alleged multilevel marketing token-based pyramid scheme sued for securities law violations by SEC","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] SEC v. Pacheco et al., Case №5:19-cv-958 (CD Cal. filed May 22, 2019)[NMR]<\/strong><\/em><br data-v-f87c67ca=\"\">\nThis newly filed SEC complaint in Central District of California is about an alleged pyramid scheme involving a multilevel marketing business directed to e-commerce education that, for reasons, rewarded users with a cryptocurrency called “PRO Currency.” Sigh. The SEC is alleging violations of securities laws, in particular, the anti-fraud parts, and well, you know the story, but let’s get to the alleged facts in this case.","Who is Pacheco? Daniel Pacheco is a resident of California who the SEC alleges was the mastermind behind this scheme. Pacheco was the sole member of two companies, IPro Solutions LLC and IPro Network LLC, collectively IPro, that sold materials to investors that “purported to educate purchasers on how to establish and operate a successful e-commerce business.” Okay, fine. For an additional $50 annual fee you could become a sales associate for the company. Allegedly, from 2017–2018, IPro grew to 20,000 members and $26.5 million through the sale of its packages. Wow. I guess a lot of people liked this idea. As the SEC explains:","there were three ways purchasers of the IPro packages could potentially make money: (i) by putting into effect the e-commerce lessons taught in the IPro packages’ instructional materials and starting an online retail business; (ii) by paying the $50 activation fee, becoming an IPro member, and then recruiting new members to IPro who would buy packages, who would in turn recruit others new members to IPro, and so on; and (iii) by converting rewards points — earned when purchasing IPro packages and when recruiting others to IPro — into PRO Currency, with the hope that the cryptocurrency would appreciate in value.","Look, there are legitimate multi-level marketing businesses, but it is a very particular industry, and throwing in a bespoke cryptocurrency as part of the rewards system seems, well, unnecessary. Pacheco allegedly gave public statements, and posted videos online, extolling the usability of PRO Currency and comparing the speculative potential of PRO Currency to bitcoin. If true, not a great idea. In fact, Pacheco managed to get PRO Currency listed on more than one exchange.","What went wrong? Well, according to the SEC Pacheco racked up $18 million in expenses unrelated to the payment of commissions and bonuses due to the IPro members. What sort of expenses? A couple listed in the complaint are a $2.5 million home, $150,000 for a Rolls-Royce (maybe an old dinged up Ghost?), and sending $1.925 million to an entity controlled by his daughter. If all that is true, that’s also not a great idea. As the SEC put it the “misallocation of resources left insufficient IPro funds available for the payment of commissions and bonuses owed to IPro investors.” Yikes.","The SEC’s complaint walks through why this situation was a Ponzi scheme, and why the recruitment bonus constituted an investment contract, but ultimately Pacheco’s companies went belly up, so how does the SEC plan to collect? Well, there are also relief defendants in this case that the SEC has included to try and obtain relief from. Essentially, a relief defendant is someone who has received ill-gotten gains as a result of someone else’s illegal activity, and it would be an affront to justice for them to keep said gains. These particular defendants will almost definitely contest their involvement and claim their right to the ill-gotten funds, whether they will be successful is an open question. Amazingly, despite the fact that PRO Currency was supposed to be used in an ecosystem that was going to be built by the now failed IPro entities, PRO Currency is still a thing. This space.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$50","content":"MONEY"},{"type":"$150,000","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$26.5 million","content":"MONEY"},{"type":"$1.925 million","content":"MONEY"},{"type":"Central District of California","content":"LOCATION"},{"type":"IPro Network LLC","content":"ORGANIZATION"},{"type":"Pacheco","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"2017–2018","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"IPro Solutions LLC","content":"ORGANIZATION"},{"type":"Daniel Pacheco","content":"PERSON"},{"type":"$2.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Cal","content":"LOCATION"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"SEC Pacheco","content":"ORGANIZATION"},{"type":"$18 million","content":"MONEY"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"IPro","content":"ORGANIZATION"},{"type":"PRO Currency","content":"ORGANIZATION"},{"type":"May 22, 2019","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"Palley","content":"PERSON"},{"type":"Royce","content":"PERSON"}],"hashtag":["SEC"],"authors":["Nelson Rosario","The Block"]}