{"summary":"The Block Research was commissioned by Lukka and S&amp;P Dow Jones Indices to create The State of the Digital Assets Data and Infrastructure Landscape, 2021, which provides an overview of the computer hardware, application software, professional processes, and most importantly, the companies needed to turn crude blockchain and digital assets market data into actionable resources.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112692\/the-state-of-the-digital-assets-data-and-infrastructure-landscape-2021","publishDate":"2021-07-28T12:27:43","id":13017,"type":null,"title":"The State of the Digital Assets Data and Infrastructure Landscape, 2021","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\">The Block Research was commissioned by <strong data-v-f87c67ca=\"\">Lukka<\/strong> and <strong data-v-f87c67ca=\"\">S&amp;P Dow Jones Indices<\/strong> to create <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The State of the Digital Assets Data and Infrastructure Landscape, 2021<\/span><\/i><span data-v-f87c67ca=\"\">, which provides an overview of the computer hardware, application software, professional processes, and most importantly, the companies needed to turn crude blockchain and digital assets market data into actionable resources.<\/span>","<span data-v-f87c67ca=\"\">The prevailing industry tide is generated through the monetization of digital assets by miners securing blockchain networks and exchanges facilitating the trade of these assets among market participants. Similar to their traditional financial system counterparts, miners (central banks) and exchanges (financial institutions) are stewards of the blockchain economy, allowing for the origination and flow of digital assets (value) and related data throughout the ecosystem online; all economic fruit within the industry stem from vines rooted in sources of raw data.<\/span>","Complete the form below to view the report in its entirety.","<span data-v-f87c67ca=\"\">Companies featured in this report are among those economic agents that use computing infrastructure and data science services to aggregate, cleanse, organize and analyze raw data sources, transforming their emissions into strategic resources for clients seeking to further understand and monetize the digital assets ecosystem. Our representative sample set highlights 42 firms across four industry verticals – infrastructure, staking, on-chain metrics, and market data – helping readers understand why the digital assets ecosystem was able to grow to over $2 trillion in the second quarter of 2021.&nbsp;<\/span>","","","<b data-v-f87c67ca=\"\">Part I: Infrastructure&nbsp;<\/b>","<span data-v-f87c67ca=\"\">All complex systems need appropriate infrastructure to function properly, and the digital assets ecosystem is no different.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Similar to a nation’s oil and gas infrastructure, which is made up of pipelines, drillers, refiners, processors, distributors, etc., the components that generate, transmit, store, cleanse and dispense blockchain data are the backbone of the digital assets industry. Nodes, computing hardware, software applications, cloud architectures, and APIs are among the elements necessary to create blockchain-related products and services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Infrastructure providers serve as the bedrock upon which many blockchain businesses build their services.&nbsp;<\/span>","","","<b data-v-f87c67ca=\"\">Part II: Staking<\/b>","<span data-v-f87c67ca=\"\">New to this year’s report is the staking section, which highlights staking providers and servicing firms within the digital assets ecosystem. Staking providers are blockchain-as-a-service companies that offer solutions allowing crypto token holders to earn a yield on their digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Staking can be viewed as an extension of blockchain infrastructure, and it is now big business.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Staked’s <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The State of Staking Q2<\/span><\/i><span data-v-f87c67ca=\"\"> report, the total market capitalization of this segment reached $450 billion in April 2021 from $179 billion in January of this year. 151% quarter-over-quarter growth has blockchain protocol teams, exchanges, and investors wondering how they can earn a piece of the staking pie.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firms and infrastructure discussed in this section are among those making it happen.<\/span>","","","<b data-v-f87c67ca=\"\">Part III: On-Chain Data&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Data produced by a blockchain is theoretically publicly accessible, but procuring actionable insights from that data requires additional work; raw data must be extracted, parsed, and cleansed from protocols using nodes. On-chain metrics providers offer services that convert raw and unorganized blockchain data into user-friendly and digestible information. Most firms use algorithmic strategies to aggregate and synthesize data into metrics such as transaction counts, exchange flows, and value settled.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On-chain data firms do a lot of low-level work. They run their own nodes internally and are highly reliant on DevOps engineers. Instead of exposing the nodes to customers, like infrastructure providers, they’re providing organized data and even tailored insights to clients. Some firms allow customers to access organized data through their API, which means that the client doesn’t need to handle the back-end work. Others might provide the client with a SQL database or give them access to a Google BigQuery, which lets them interface with the data as they see fit.&nbsp;<\/span>","","","<b data-v-f87c67ca=\"\">Part IV: Market Data&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Market data firms are integral to the digital assets ecosystem.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">Unlike equity markets, where spot trading data comes from the NASDAQ and the NYSE and the majority of derivatives data comes from a handful of financial markets companies [Chicago Mercantile Exchange (CME) Group, Intercontinental Exchange (ICE) or Chicago Board Options Exchange (CBOE)], available market data in the digital assets ecosystem is fragmented across numerous digital asset exchanges and more recently decentralized finance (DeFi) protocols.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The original business model for market data firms involved buying data directly from exchanges. Data engineers would then ingest and organize said data into actionable information for clients, a process more commonly known as extract, transform, load (ETL) in general computing. Quite frankly, these companies look more like data science companies than crypto firms.<\/span>","<span data-v-f87c67ca=\"\">Market data issues mostly revolve around the lack of data standardization; having to deal with thousands of spreadsheets is not an uncommon occurrence. Scattered datasets require skilled practitioners for data collection, computing infrastructure to transport and store market data, and computation-intensive resources for heavy data processing.<\/span>","<span data-v-f87c67ca=\"\">Since the vast majority of stakeholders are those seeking to financialize digital assets (i.e. investors, speculators, miners, etc.), the core use case for market data is to backtest trading strategies. The “Market Data Granularity Pyramid” examines the different categories of market data and talks about their relationship to backtesting; readers should always keep backtesting in mind when thinking about digital assets market data.&nbsp;<\/span>","","","<b data-v-f87c67ca=\"\">Key Takeaways&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Two major themes are present throughout this year’s report: maturation and institutionalization.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The industry has come a long way since the grassroots days of cypherpunks and hobbyists, with billion-dollar businesses, such as Coinbase, integrating with the traditional financial markets and digital assets further establishing themselves as legitimate investments, contracts, and vehicles. Increased demand for actionable intelligence among global stakeholders has led to labor, entrepreneurship, capital, and other factors of production pouring into the space, further accelerating progression.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Providers across our four segments have developed identities outside of the generic data narratives of years past. Armed with wisdom from experience, those that remain are consolidating at both the industry level – as made evident by nine noteworthy acquisitions having taken place already this year – and the organizational level, with firms increasing their offerings across tiers of the “Digital Assets Data &amp; Infrastructure Hierarchy of Needs.”&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">In close, if data is the new oil, and blockchain is the foundation for the new internet, then the companies laying the infrastructure and establishing processes to procure and refine digital assets data are uniquely positioned to capitalize on the continued expansion of the next web: the value of which is priceless.&nbsp;&nbsp;<\/span>","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Staked’s <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The State","content":"ORGANIZATION"},{"type":"$2 trillion","content":"MONEY"},{"type":"Chain Data","content":"ORGANIZATION"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Market Data","content":"ORGANIZATION"},{"type":"Digital Assets Data","content":"ORGANIZATION"},{"type":"Google BigQuery","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"“Digital Assets Data &amp; Infrastructure Hierarchy of Needs","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$179 billion","content":"MONEY"},{"type":"the second quarter of 2021","content":"DATE"},{"type":"151%","content":"PERCENT"},{"type":"CBOE","content":"ORGANIZATION"},{"type":"$450 billion","content":"MONEY"},{"type":"Chicago Board Options Exchange","content":"ORGANIZATION"},{"type":"Chicago Mercantile Exchange (CME) Group","content":"ORGANIZATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}