{"summary":"Grayscale Investments sent a strong signal ahead of an anticipated ruling in its ongoing lawsuit against the SEC, saying that it’s hiring for its ETF team. ","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/245983\/grayscale-is-hiring-for-etf-team-as-bitcoin-decision-looms","publishDate":"2023-08-17T09:55:30","id":1301,"type":null,"title":"Grayscale is hiring for ETF team as bitcoin decision looms","category":["Companies"],"content":["Grayscale Investments appeared to send an optimistic <a href=\"https:\/\/twitter.com\/grayscale\/status\/1692163372241056254?s=46\" data-v-f87c67ca=\"\">signal<\/a> about an upcoming ruling in a widely watched lawsuit with the Securities and Exchange Commission that many expect could come as early as tomorrow, saying it's hiring for its ETF team.","The digital currency asset manager is seeking a \"highly capable, analytical, and proactive Senior Associate, ETFs\" to support the development of its ETF business.&nbsp;","\"This role will be on the ground floor of building an ETF issuer and will work across various internal stakeholders and external business partners including sub-advisors, market makers, compliance, sales, and custodians,\" the company said in a <a href=\"https:\/\/boards.greenhouse.io\/grayscaleinvestments\/jobs\/5643892003\" data-v-f87c67ca=\"\">job posting<\/a>.&nbsp;","<span class=\"s3\" data-v-f87c67ca=\"\">The asset manager <a href=\"https:\/\/www.theblock.co\/post\/244512\/pending-grayscale-ruling-could-tip-balance-in-race-for-bitcoin-etf\" data-v-f87c67ca=\"\">sued the SEC<\/a> last year <\/span><span class=\"s1\" data-v-f87c67ca=\"\">for rejecting its proposal to convert its flagship fund, GBTC, into a spot bitcoin ETF, and a decision from the court is imminent. The result will be <a href=\"https:\/\/www.theblock.co\/post\/245830\/bitcoin-price-spot-etf-tom-lee\" data-v-f87c67ca=\"\">widely watched<\/a>, as it could affect the regulator's ongoing review process for a wave of recent filings from other asset managers for spot bitcoin funds.<\/span>","A win for Grayscale would be seen a positive sign for the sector, while a loss could signal that dreams for a spot fund will continue to face <a href=\"https:\/\/www.theblock.co\/post\/244297\/sec-asks-for-new-comments-about-ark-bitcoin-etf-in-apparent-delay\" data-v-f87c67ca=\"\">regulatory headwinds<\/a>.&nbsp;"],"hashtag":["SEC"]}