{"summary":"Blockchain security firm CertiK has reached a valuation of $2 billion in a new funding round from heavyweights including Goldman Sachs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141019\/certik-raises-88-million-valuation-2-billion-goldman-sachs-others","publishDate":"2022-04-07T08:00:26","id":13019,"type":null,"title":"Blockchain security firm CertiK reaches $2 billion valuation","category":["VENTURE CAPITAL"],"content":["Blockchain security firm CertiK has reached a valuation of $2 billion in a new funding round, as a rise in crypto scams underlines the need for more security and protection.","The firm has raised $88 million in a Series B3 round. Insight Partners, Tiger Global, and Advent International co-led the round, with Goldman Sachs, Sequoia Capital and Lightspeed Venture Partners also participating.","The new funding round comes just three months after CertiK <a href=\"https:\/\/www.theblockcrypto.com\/post\/125892\/blockchain-auditing-firm-certik-raises-another-80-million-in-series-b2-funding\" data-v-f87c67ca=\"\">raised<\/a> $80 million in a Series B2 funding round at a nearly $1 billion valuation.","So what led to the double valuation in three months?","CertiK co-founder Ronghui Gu told The Block that it was triggered by the firm's growing revenue and increasing demand for its services. CertiK says its revenue increased 12 times last year and profits surged by 3,000 times. Gu declined to share absolute numbers since CertiK is a private company.","Founded in 2018, New York-based CertiK audits smart contracts of blockchain projects to ensure they are secure to launch and use. Hacks and exploits are commonplace in crypto. Last year, over $1.3 billion in crypto assets were lost to cybercriminals, according to CertiK. This year thus far, over $1 billion in crypto has already been lost due to major attacks such as <a href=\"https:\/\/www.theblockcrypto.com\/post\/139761\/axie-infinitys-ethereum-sidechain-ronin-hit-by-600-million-exploit\" data-v-f87c67ca=\"\">Ronin Network<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/132909\/wormhole-replenishes-its-blockchain-bridge-after-325-million-exploit\" data-v-f87c67ca=\"\">Wormhole<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/largest-defi-exploits\/embed\" title=\"Largest DeFi exploits\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Gu said recent security incidents have made project developers realize that a security audit is \"not just a nice to have.\"","CertiK claims to have protected over $300 billion worth of crypto assets to date by serving over 2,500 enterprise clients. Its clients include Aave, Polygon and Terra.","With fresh capital in hand, CertiK plans to continue enhancing its offerings. Gu said the firm aims to be \"the one-stop vendor for all project needs.\"","To that end, CertiK also looks to expand its current team of around 200 people, said Gu. The firm is hiring for multiple roles, including engineering and business development.","The Series B3 round brings CertiK's total funding to date to over $240 million. Gu said the firm isn't looking to raise more funds in the near future and it doesn't have any IPO plans.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$88 million","content":"MONEY"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"$300 billion","content":"MONEY"},{"type":"$240 million","content":"MONEY"},{"type":"Ronin Network","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Ronghui Gu","content":"PERSON"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["GOLDMAN SACHS","TIGER GLOBAL"],"authors":["Yogita Khatri","The Block"]}