{"summary":"The core developers at Helium have proposed to migrate the project to Solana in a move that aims to achieve additional scalability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166705\/helium-developers-propose-a-full-migration-to-the-solana-blockchain","publishDate":"2022-08-31T07:48:26","id":1301,"type":null,"title":"Helium developers propose a full migration to the Solana blockchain","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">The core developers at Helium have proposed to migrate the project to Solana in a move that aims to achieve additional scalability.<\/span>","<span data-v-f87c67ca=\"\">On Tuesday, the Helium developers put forward a proposal<\/span> <a href=\"https:\/\/decrypt.co\/108616\/helium-migration-solana-wireless-crypto-network\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"HIP 70\"<\/span><\/a><span data-v-f87c67ca=\"\"> that suggests the project should deprecate its own blockchain and migrate all of its blockchain-related operations to Solana. The team cited Solana's fast and cheap transactions for its decision to choose it for a potential migration.<\/span>","<span data-v-f87c67ca=\"\">The proposal argues that the migration will be a needed step in further scaling Helium's decentralized wireless network. Currently, Helium functions as a low-power wide-area network (LPWAN), consisting of nearly<\/span> <a href=\"https:\/\/explorer.helium.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">1 million<\/span><\/a><span data-v-f87c67ca=\"\"> Internet of Things (IoT) devices called hotspots. The team claims to have various clients that make use of the network for enterprise use cases.<\/span>","<span data-v-f87c67ca=\"\">The wireless network leverages blockchain primarily as an incentivization layer to help drive growth. Here, the team pays its users in native helium tokens as an incentive to install hotspot devices to help expand the network’s connectivity.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">The team has explained that the Helium blockchain has been facing scaling complexities related to the large number of hotspots on its network, a reason why it wants to make use of a more scalable chain. Hence, the latest proposal hopes to outsource Helium’s blockchain layer to Solana, which it says would be better suited for the project due to its faster speed.<\/span>","<span data-v-f87c67ca=\"\">Post the migration, the network will continue to use the same hotspot devices but the rewards will be paid on Solana. To do so, the<\/span> <a href=\"https:\/\/www.helium.com\/token\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">native tokens<\/span><\/a><span data-v-f87c67ca=\"\"> used by Helium such as helium (HNT) and data credits (DC), would have to be redeployed to Solana among other things.<\/span>","<span data-v-f87c67ca=\"\">Yet another change introduced in the proposal is to start using oracles, a piece of software that connects blockchains to external systems. The team said that oracles will allow data to securely move between off-chain devices and the Solana blockchain.<\/span>","<span data-v-f87c67ca=\"\">The proposal is in a discussion phase and will be put to a community vote on September 12, according to an official<\/span> <a href=\"https:\/\/medium.com\/helium-foundation\/hip-70-helium-core-team-proposes-to-migrate-to-solana-e7ea23a042e7\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> from Helium Foundation. <\/span>","Helium raised a <a href=\"https:\/\/www.theblock.co\/linked\/134744\/helium-raises-200-million-report\" data-v-f87c67ca=\"\">$200 million<\/a> Series D at a $1.2 billion valuation in February.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September 12","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Helium Foundation","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"IoT","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["SOLANA"],"authors":["Vishal Chawla","The Block"]}