{"summary":"Kraken Security Labs announced that they had performed an attack against Trezor’s cryptocurrency hardware wallets and found that hackers can extract the seeds in under 15 minutes.\nThe flaw is inherent to the wallet hardware and cannot be fixed, according to Kraken, but users can protect their assets by turning on the BIP39 passphrase and ensuring physical control over their wallets.","author":["Yilun Cheng","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/54631\/kraken-security-labs-hackers-can-exploit-trezor-hardware-wallets-with-only-15-minutes-of-physical-access-to-the-device","publishDate":"2020-01-31T11:52:34","id":1302,"type":null,"title":"Kraken Security Labs identified flaw in Trezor’s cryptocurrency hardware wallets","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">Kraken Security Labs has identified a critical security flaw in Trezor’s cryptocurrency hardware wallets, which allows hackers to extract seeds in under 15 minutes.<\/span>","<span data-v-f87c67ca=\"\">In a Friday <\/span><a href=\"https:\/\/blog.kraken.com\/post\/3662\/kraken-identifies-critical-flaw-in-trezor-hardware-wallets\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\">, Kraken claimed that hackers can possibly exploit voltage glitching and extract encrypted seeds from the Trezor One and Trezor Model T wallets with only 15 minutes of physical access to the device.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Trezor has been <\/span><span data-v-f87c67ca=\"\">aware of this vulnerability <\/span><span data-v-f87c67ca=\"\">since designing the products, the post contended. Before publicly announcing the security flaw, Kraken in Oct. 2019 revealed details of the attack to Trezor. <\/span><span data-v-f87c67ca=\"\">Ledger’s security team, Ledger Donjon, also <\/span><a href=\"https:\/\/donjon.ledger.com\/Unfixable-Key-Extraction-Attack-on-Trezor\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">conducted<\/span><\/a><span data-v-f87c67ca=\"\"> similar research last year.&nbsp;<\/span>","According to Kraken Chief Security Officer Nick Percoco, the flaw is an inherent to the microcontroller used in Trezor's wallets, which is why the vulnerability persists despite Trezor's knowledge of it.&nbsp;","\"It's a flaw that's present in the hardware, not something they can just put a formal update on and fix it for all their customers,\" he told The Block. \"To address this problem, they would essentially need to put out a new device.\"","<span data-v-f87c67ca=\"\">Following Kraken's blog post, Trezor cited<\/span><span data-v-f87c67ca=\"\"> in a <a href=\"https:\/\/twitter.com\/trezor\/status\/1223258540716044288?s=21\" data-v-f87c67ca=\"\">tweet<\/a> its official response to Ledger’s research dated Mar. 2019. According to the response, the attack cannot happen remotely and will not work if users turn on the BIP 39 passphrase.&nbsp;<\/span>","\"Physical access is a threat to 6-9% of people, according to our research,\" Trezor said <a href=\"https:\/\/twitter.com\/Trezor\/status\/1223274538605084672\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in a subsequent tweet<\/a>. \"If a physical access is a part of someone's threat model, we advice to use a Passphrase feature. But again, physical access is not a widespread case.\"","Percoco confirmed Trezor's claims. \"We would not have been able to perform this attack if there were a BIP 39 passphrase, but unfortunately, the passphrase is an optional addition that not all users enable,\" he said. \" So the real recommendations here are, one, make sure that you are controlling physical access to your Trezor wallet, and, two, add that that additional passphrase to the wallet.\"<b data-v-f87c67ca=\"\"><\/b>","Kraken previously <a href=\"https:\/\/blog.kraken.com\/post\/3245\/flaw-found-in-keepkey-crypto-hardware-wallet\/\" data-v-f87c67ca=\"\">performed<\/a> a similar attack against the KeepKey wallet. In light of the two sets of research, Kraken concluded in the blog post that \"t<span data-v-f87c67ca=\"\">hese chips are not designed to store secrets and... vendors like Trezor and KeepKey should not solely rely on them to secure your cryptocurrency.<\/span>\"","Percoco said Kraken decided to make the announcement in order to bring awareness to this kind of vulnerability.&nbsp;","<b data-v-f87c67ca=\"\"><\/b><i data-v-f87c67ca=\"\">\"<\/i>This is for our clients and for the users within the Bitcoin community to be aware that they need to take the additional precautions when using a hardware wallet to ensure that their seeds are protected,\" he said.&nbsp;"],"hashtag":["KRAKEN"]}