{"summary":"A vote has passed that will enable BendDAO to carry out major protocol changes, incentivizing healthy NFT liquidation auctions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164987\/benddao-fixing-nft-liquidations-could-lead-to-bored-apes-selling-at-a-discount","publishDate":"2022-08-23T09:44:28","id":13023,"type":null,"title":"BendDAO fixing NFT liquidations could lead to Bored Apes selling at a discount","category":["GOVERNANCE"],"content":["The BendDAO community has <a href=\"https:\/\/snapshot.org\/#\/benddao.eth\/proposal\/0x055c065c8f088b123590d904786d2b7511f9520cee06b2fb93b5b9fcbd62790b\" data-v-f87c67ca=\"\">voted<\/a> to change its liquidation protocol for NFT auctions, in a move that could see items from popular collections like Bored Apes being sold at highly discounted prices.","BendDAO itself is a non-fungible token (NFT) finance platform. The protocol enables NFT owners to deposit their NFTs as collateral to borrow ether (ETH). Lenders can deposit ETH to earn interest from the platform.","Data from Snapshot show the vote ended with a 97% approval from participants who pooled 60,000 veBEND tokens in support of the proposed changes. BendDAO’s native token is BEND and veBEND is the staked version of the coin that offers voting privileges to holders.","The vote will reduce the current requirements for liquidating NFTs when loans have become undercollateralized. It will slowly lower the requirements, encouraging liquidators to liquidate the loans and help the platform work as it's supposed to — and avoid building up too much bad debt.","This just-concluded vote was in response to <a href=\"https:\/\/www.theblock.co\/post\/164828\/nft-lender-benddao-begins-vote-to-change-protocol-amid-liquidity-crisis\" data-v-f87c67ca=\"\">the platform's liquidity issues<\/a>. Some BendDAO lenders carried out a bank run on the platform last week amid fears of rising bad debt within the platform. Some borrowers had begun to default on their loans as the rapidly falling floor prices of their NFT collateral and the high-interest rate for borrowing made repayments difficult.","When borrowers default on their loan positions on BendDAO, their NFT collateral goes up for a liquidation <a href=\"https:\/\/www.benddao.xyz\/app\/auction\/loans-in-auction\" data-v-f87c67ca=\"\">auction<\/a>. Liquidators bid on the NFTs to service the debt.","The platform’s previous liquidation parameters were, however, not attractive for liquidators. BendDAO’s liquidation process required that starting bids were at least 95% of the NFT’s floor price. The process also required liquidators to lock up their ETH for 48 hours. This meant that NFTs were not getting liquidated.","With the vote passed, the liquidation threshold will reduce by 5% on a weekly basis. This seven-day rolling drawdown will begin with 85% on August 30 up until a baseline of 70% on September 20. The threshold here refers to the spread between the starting bid for the liquidation auctions and the floor price of the affected NFT collateral","September 20 might become a target for NFT whales due to a number of factors. The threshold falling to 70% on that date could mean that several blue-chip NFTs can be scooped on the cheap. This is because starting bids can be set at a price much lower than the floor price of the NFT on marketplaces like OpenSea. If the floor price falls before September 20, the spread could be even become much greater.","BendDAO only accepts seven popular NFTs as collateral. These are Bored Ape Yacht Club, CryptoPunks, Mutant Ape Yacht Club, CloneX, Space Doodles, Doodles, and Azuki. Data from the project’s website show that as many as 600 of these popular NFTs could be up for liquidation by late September if market conditions remain largely unchanged. BendDAO currently owes over 13,000 ETH ($21 million) to lenders. The platform needs these liquidations to pay off its creditors while also trying not to rack up bad debt from defaulted loans.","The BendDAO auctions are already drawing attention in the NFT market. DeFine, another NFT finance platform, is looking to scoop a Bored Ape during the auction. DeFine DAO is currently <a href=\"https:\/\/app.define.one\/vote\/mainnet\/0xab8e8d9bb650a0c3f91bac1357f90d5efab0d5f7\/10\" data-v-f87c67ca=\"\">voting<\/a> on a governance proposal to buy a Bored Ape during the auction using funds from its <a href=\"https:\/\/app.define.one\/treasury\" data-v-f87c67ca=\"\">$3.3 million<\/a> treasury. The vote, which ends on Wednesday, already has 96% of participants in support of the move.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"$21 million","content":"MONEY"},{"type":"85%","content":"PERCENT"},{"type":"96%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"September 20","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"August 30","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}