{"summary":"Crypto exchange Coinbase said Monday that it is increasing its support for stablecoins with an investment in Circle.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246634\/coinbase-taking-stake-in-circle-launching-usdc-on-six-new-blockchains","publishDate":"2023-08-21T16:35:48","id":13022,"type":null,"title":"Coinbase takes stake in Circle, launching USDC on six new blockchains","category":["COMPANIES"],"content":["Crypto exchange Coinbase said Monday that it is increasing its support for stablecoins by \"taking an equity stake\" in Circle.&nbsp;","As part of an agreement announced in a joint <a href=\"https:\/\/www.coinbase.com\/blog\/ushering-in-the-next-chapter-for-usdc\" data-v-f87c67ca=\"\">blog post<\/a>, Circle will take full control over USDC issuance and governance. The stablecoin will be launching on six new blockchains, the statement also said.&nbsp;","Exact terms of Coinbase's investment weren't disclosed.&nbsp;","\"The nature of the investment means that Coinbase and Circle will now have even greater strategic and economic alignment on the future of the financial system,\" Coinbase CEO Brian Armstrong and Circle CEO Jeremy Allaire said in the statement.&nbsp;","USDC will launch on the new blockchains sometime between September and October, the companies said.","\"Coinbase is committed to the long term success of the stablecoin ecosystem and USDC, specifically,\" they continued, adding that both companies will continue to generate revenue from USDC reserves interest income.","\"Under the parties’ new arrangement, this revenue will continue to be shared based on the amount of USDC held on each of our&nbsp; platforms, and additionally we will now equally share in interest income generated from the broader distribution and usage of USDC,\" they said.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/243100\/coinbase-q2-revenues-beat-estimates-but-usdc-interest-income-falls-to-151-million\" data-v-f87c67ca=\"\">Earlier this month<\/a> Coinbase reported it generated $151 million in USDC stablecoin interest income during the second quarter. That was down from <a href=\"https:\/\/www.theblock.co\/post\/229585\/coinbase-earnings-crypto-exchange-2\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$199 million<\/a> in USDC interest income in the previous quarter. Coinbase cited a 28% decrease in USDC market cap as a contributing factor.","Coinbase took to Twitter to state that buying a stake in Circle and changing the governance of USDC should not impact the financial outlook given when the company reported its second quarter earnings.","Traditional payments giant PayPal, also earlier this month, announced it is launching a stablecoin with the help of Paxos, which will issue the token on the Ethereum blockchain under the label PYUSD. The new stablecoin will be “fully backed by U.S. dollar deposits, short-term Treasuries and similar cash equivalents,\" PayPal said.","PayPay's decision to release its own stablecoin has been met with mixed sentiment.&nbsp;","<em data-v-f87c67ca=\"\">Updates with further details on Coinbase and Circle's plans in addition to information about PayPal's own stablecoin.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"$199 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$151 million","content":"MONEY"},{"type":"Coinbase and Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"October","content":"DATE"},{"type":"second quarter","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}