{"summary":"President Milei&#x27;s victory appeared to signal Argentina would begin to embrace crypto on a larger scale, but now that appears in doubt.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287008\/argentinas-dreams-of-greater-crypto-adoption-imperiled-by-new-regulation-mileis-shifting-rhetoric","publishDate":"2024-04-08T12:03:02","id":1302,"type":null,"title":"Argentina&#x27;s dreams of greater crypto adoption imperiled by new regulation, Milei&#x27;s shifting rhetoric","category":["INTERNATIONAL POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">When libertarian politician Javier Milei was elected president of Argentina towards the end of last year, many in the worlds of traditional finance and digital assets speculated that the <a href=\"https:\/\/www.theblock.co\/post\/263865\/argentinas-new-president-could-supercharge-nations-use-of-crypto\" data-v-f87c67ca=\"\">seemingly pro-Bitcoin leader might<\/a> help spur increased use of cryptocurrencies in South America's second-largest economy.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But after new regulation was <a href=\"https:\/\/www.forbes.com\/sites\/digital-assets\/2024\/03\/31\/argentina-unveiled-mandatory-registry-for-bitcoin-and-crypto-platforms\/?sh=760ff42e59fe\" data-v-f87c67ca=\"\">recently unveiled<\/a> — which requires both companies and individuals working with, or trading, digital assets to register with the government — many are wondering if Argentina is now steering away from <\/span><span data-v-f87c67ca=\"\">a new era defined by less regulation and greater use of cryptocurrencies.<\/span>","Critics of the new regulation see it as adding an unnecessary layer of compliance that will complicate crypto adoption rather than encourage it.","<span data-v-f87c67ca=\"\">“It seems in the opposite direction with respect to Milei's rhetoric,” said Hernan Yellati, who is both Argentinian and a partner at Borderless Capital. The firm recently <a href=\"https:\/\/www.theblock.co\/post\/284544\/borderless-captial-acquires-quant-firm-ctf-capital-plans-latam-hq-in-argentina\" data-v-f87c67ca=\"\">announced plans<\/a> to open a Latin American headquarters in Argentina, a country it said is leading the way in terms of digital asset innovation.<\/span>","<span data-v-f87c67ca=\"\">Milei’s ascendancy and Argentina’s monetary woes appeared to set the stage for reform and increased use of crypto, especially bitcoin. \"His presidency could pave the way for <\/span><a href=\"https:\/\/www.grayscale.com\/research\/market-commentary\/market-byte-bitcoin-surges-as-milei-wins-presidency-in-argentina?utm_source=market-analysis-&amp;-research&amp;utm_medium=email&amp;utm_campaign=11\/20\/2023---market-byte-&amp;utm_id=&amp;utm_term=investors&amp;utm_content=&amp;mkt_tok=MDAwLUVVRS0xMjUAAAGPjOtBcVXbA50pPua9rU9TxkBuFQ5JtYLwtZALGinjZ2jIO_QUeY2FY-3RIz-L-SJjjdEs-4fRLoPML825lMOHSx42xu0Fs5kQhkJiSRPU\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">greater acceptance<\/span><\/a><span data-v-f87c67ca=\"\"> and integration of cryptocurrencies in Argentina's economy, offering a potential solution to the long-standing issues of inflation and financial instability,\" Grayscale Research said the day after Milei’s electoral victory.<\/span>","In December, two weeks after Milei took office, in what appeared to be a sign that his government was committed to embracing digital assets, <a href=\"https:\/\/www.theblock.co\/post\/268893\/argentinas-new-government-gives-early-nod-to-bitcoin-says-crypto-can-be-used-in-contracts\" data-v-f87c67ca=\"\">Argentina announced<\/a> that bitcoin could be used as currency in official contracts. Many Argentinians have turned to crypto as an alternative as their local peso has eroded in value.","<span data-v-f87c67ca=\"\">While Yellati said it appears the registration rule is a holdover from the previous administration, undoing the regulation could take time. “Even though the government may continue with its rhetoric of less regulation and market freedom, we may see significant delays and sand in the wheels to undo this specific regulation,” he told The Block. \"I would expect some more clarity from the government in the coming days, considering the negative repercussions.\"<\/span>","<span data-v-f87c67ca=\"\">Bitso Argentina Country Manager Julián Colombo downplayed the potential impact of the new regulation and the idea that Milei is a true advocate for digital assets. \"I don't see a political implication of the level that some media are giving to [the new regulation],” Colombo told The Block. “President Milei is not personally involved in this process and, contrary to what has been said during the campaign, he is not a president for whom cryptocurrencies are a priority at this time.”<\/span>","<span data-v-f87c67ca=\"\">Bitso is a leading crypto firm in Latin America. Founded in Mexico in 2014, the company said it had 8 million users at the end of last year.<\/span>","<span data-v-f87c67ca=\"\">When Milei was elected last November, Ruslan Lienkha, chief of markets at YouHodler, said he expected that the use of crypto could eventually be “much broader” in Argentina under the new president. Now, Lienkha said it appears Milei may be changing his tune.<\/span>","<span data-v-f87c67ca=\"\">“There is nothing bad in the registration rule itself. However, it would be a possible step towards\" older policy, he told The Block. “We also can notice the change in Melei's rhetoric, after he decided to postpone central bank removal and dollarization.”<\/span>","<span data-v-f87c67ca=\"\">While many hoped Milei would pave the way for increased use of crypto, the new president was also expected to deliver on promises of central bank reform and the dollarization of the economy, a measure that could ameliorate Argentina’s massive problems with hyperinflation and currency depreciation. But then last week, Milei <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2024-04-05\/milei-sees-long-slog-ahead-to-bring-argentina-reforms-he-pledged?sref=QkiN9npb\" data-v-f87c67ca=\"\">told Bloomberg<\/a> his plans for reform are going to take longer than he hoped.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Milei","content":"ORGANIZATION"},{"type":"Ruslan Lienkha","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Lienkha","content":"PERSON"},{"type":"South America","content":"LOCATION"},{"type":"Argentina","content":"LOCATION"},{"type":"Yellati","content":"PERSON"},{"type":"Javier Milei","content":"PERSON"},{"type":"Bitso Argentina Country Manager Julián Colombo","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Milei","content":"PERSON"},{"type":"Mexico","content":"LOCATION"},{"type":"Hernan Yellati","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Melei","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"Grayscale Research","content":"ORGANIZATION"},{"type":"Colombo","content":"LOCATION"},{"type":"last November","content":"DATE"}],"hashtag":[],"authors":["RT Watson","The Block"]}