{"summary":"The Soroban phase 2 went live today on mainnet, allowing the creation of user-ready decentralized applications on Stellar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283446\/smart-contracts-finally-arrive-on-stellar-network-with-soroban-launch-on-mainnet","publishDate":"2024-03-19T12:00:05","id":13033,"type":null,"title":"Smart contracts platform Soroban finally arrives on Stellar network","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">The <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Stellar <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248370\/stellar-xlm-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Stellar_symbol_black_RGB.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">XLM<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.78%\n    <\/span><\/a> <!----><\/span><\/span> Development Foundation (SDF) rolled out <\/span><a href=\"https:\/\/www.theblock.pro\/news\/post\/255868\/stellar-conducts-security-checks-for-upcoming-smart-contracts-platform-soroban\" data-v-f87c67ca=\"\">Soroban<\/a>, a smart contracts platform on the payment-focused network, marking one of the most significant upgrades in the project’s ten-year history.","After a two-year testing phase, Soroban's mainnet phase 2 went live today, allowing the creation of user-ready decentralized applications.","Soroban offers developers a new mechanism to deploy smart contracts, expanding the ecosystem of applications built on the Stellar blockchain. The platform leverages WebAssembly (WASM)—a binary code format tailored for traditional web and blockchain integrations.","Stellar’s introduction of smart contracts aims to broaden the network’s use beyond crypto payments to include decentralized finance (DeFi) and other financial services.&nbsp;","SDF has also allocated $100 million to a Soroban adoption fund to support development on this new platform. The fund has funded over 160 projects, focusing on leveraging Stellar’s smart contract capabilities for various applications. Projects building on Stellar include bridge projects, Axelar, Allbridge, the Band Protocol oracle, and DeFi newcomers including Sworoswap and Blend.","Jed McCaleb and Joyce Kim co-founded Stellar in 2014. It is an open-source blockchain network focused on enabling cross-border transactions.","Initially, Stellar operated on a system akin to Ripple since it was conceptualized as a fork. However, facing challenges and driven by the aspiration for a unique solution, Stellar introduced a completely revamped codebase with a renewed consensus mechanism termed the Stellar Consensus Protocol (SCP).","Although Stellar has supported smart contracts in the past, the core team has progressively focused on developing Soroban as a general-purpose and developer-friendly platform to deploy WASM-based high-performance dapps.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Axelar","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"+0.78%","content":"PERCENT"},{"type":"Jed McCaleb","content":"PERSON"},{"type":"Joyce Kim","content":"PERSON"},{"type":"Allbridge","content":"PERSON"},{"type":"SDF","content":"ORGANIZATION"},{"type":"Stellar Consensus Protocol (SCP","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Vishal Chawla","The Block"]}