{"summary":"The XRP Ledger is testing its first EVM-compatible sidechain.\nThe sidechain is expected to go live next year.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177686\/the-xrp-ledger-tests-first-sidechain-compatible-with-ethereum-apps","publishDate":"2022-10-17T11:28:54","id":1303,"type":null,"title":"The XRP Ledger tests first sidechain compatible with Ethereum apps","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">The XRP Ledger is testing its Ethereum Virtual Machine (EVM) sidechain that aims to bring Ethereum smart contracts to the XRP Ledger,&nbsp; the blockchain’s core development team RippleX <a href=\"https:\/\/dev.to\/ripplexdev\/an-evm-sidechain-for-the-xrp-ledger-1pbi\" data-v-f87c67ca=\"\">announced<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The sidechain, a parallel-running blockchain, will bring Ethereum-based smart contracts to<\/span> <a href=\"https:\/\/www.theblock.co\/linked\/118981\/ripple-creator-fund-250-million-fund-nft-xrp-ledger\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">XRP Ledger<\/span><\/a><span data-v-f87c67ca=\"\">, a blockchain associated with cross-border payments firm Ripple.<\/span>","<span data-v-f87c67ca=\"\">The sidechain has been developed by a firm called Peersyst and is still in this first phase of development and unavailable for public testing, according to RippleX. This means for now, it is only available on XRP Ledger's Devnet, a restricted experimental network used for testing on XRP Ledger. The second phase will begin in early 2023, and will feature a permissionless EVM sidechain that's open to the public.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While the XRP Ledger already supports native smart contracts, the network does not currently support the Ethereum Virtual Machine (EVM), a computing environment commonly used by Ethereum developers to write applications.<\/span>","<span data-v-f87c67ca=\"\">Once it’s deployed on mainnet in the second quarter of 2023, the sidechain will allow developers to write apps in Solidity, the main programming language on Ethereum and make it interoperable with the XRP Ledger via a bridge, said RippleX.<\/span>","<span data-v-f87c67ca=\"\">It will also let developers use the XRP Ledger's native asset called XRP within the sidechain environment.<\/span>","<span data-v-f87c67ca=\"\">“The release means developers no longer have to choose between XRPL or EMV-compatible blockchains; they can have the best of both worlds,” RippleX stated.<\/span>"],"hashtag":["XRP"]}