{"summary":"Shift in leadership comes as a host of firms like BlackRock and Grayscale Investments expect Coinbase to custody their assets. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269714\/coinbase-changes-head-of-custody-amid-rush-for-spot-bitcoin-etf-approval","publishDate":"2023-12-29T16:20:15","id":13035,"type":null,"title":"Coinbase changes head of custody amid rush for spot bitcoin ETF approval","category":["COMPANIES"],"content":["Coinbase earlier this year hired a new executive to head its custody department as the cryptocurrency exchange is expected to provide custody services to traditional financial institutions that have filed for spot bitcoin ETFs.","Coinbase's former CEO of the custody division, Aaron Schnarch, left the firm in recent weeks but was replaced as head of custodial services in August by Rick Schonberg, according to a Coinbase spokesperson.","The move came as major financial firms like BlackRock, Franklin Templeton and <a href=\"https:\/\/www.theblock.co\/post\/230148\/grayscale-worried-sec-ban-coinbase\" data-v-f87c67ca=\"\">Grayscale Investments<\/a> have tasked Coinbase to provide custodial services, should their funds be approved. Crypto as a whole is anxiously awaiting to see if the new ETFs are approved.","Before Schnarch took over as Coinbase Custody CEO, he worked as the company's vice president of product management, custody and prime platform.&nbsp;","Schonberg previously served as the global head of product development for the British clearing house group LCH and senior managing director for the financial services firm State Street, in addition to four years at Goldman Sachs, according to his LinkedIn <a href=\"https:\/\/www.linkedin.com\/in\/rickschonberg\/\" data-v-f87c67ca=\"\">profile<\/a>.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Schnarch","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Coinbase Custody CEO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase spokesperson","content":"ORGANIZATION"},{"type":"LCH","content":"ORGANIZATION"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Aaron Schnarch","content":"PERSON"},{"type":"Rick Schonberg","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"State Street","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["COINBASE","EXITS","HIRING"],"authors":["MK Manoylov","The Block"]}