{"summary":"HashKey COO Livio Weng told The Block that the exchange will only offer bitcoin and ether trading for retail customers at first.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247368\/hashkey-crypto-retail-trading-hong-kong","publishDate":"2023-08-25T04:46:43","id":13032,"type":null,"title":"HashKey to start crypto retail trading service in Hong Kong next Monday","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">HashKey Exchange, an Asia-based cryptocurrency exchange, is set to start offering crypto trading services to retail clients starting from Aug. 28, its executive said.<\/span>","<span data-v-f87c67ca=\"\">In an interview with The Block, Livio Weng, HashKey’s chief operating officer, said the exchange will commence its retail trading services for bitcoin and ether — the two largest cryptocurrencies in circulation — only.&nbsp;<\/span><span data-v-f87c67ca=\"\">Weng said offering trading services for the two tokens can fulfill most retail investors’ needs.<\/span>","<span data-v-f87c67ca=\"\">The new operation comes after HashKey, earlier this month, became the first crypto outfit in Hong Kong to <\/span><a href=\"https:\/\/www.theblock.co\/post\/242897\/hashkey-obtains-first-license-in-hong-kong-to-offer-crypto-retail-trading\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">obtain a license<\/span><\/a><span data-v-f87c67ca=\"\"> under the city’s new licensing regime, which permits crypto trading platforms to offer retail services.<\/span>","<span data-v-f87c67ca=\"\">Weng added that both the company and Hong Kong’s financial regulator hold a more prudent approach toward offering retail trading services.&nbsp;<\/span><span data-v-f87c67ca=\"\">“We thought it’d be better to be more prudent,” Weng said. “In a bearish market environment, there could be higher risks trading the so-called altcoins, so we hope to offer tokens that come with relatively lower risks at first.”<\/span>","<span data-v-f87c67ca=\"\">In an attempt to diversify its retail channels, HashKey is currently in talks with roughly five local brokerages in Hong Kong to establish entries connected to HashKey’s crypto trading services, according to Weng.<\/span>","<span data-v-f87c67ca=\"\">“We’re looking to offer crypto trading services directly to investors on these brokerage’s platforms,” Weng said. “This could potentially bring in tens of millions of users who trade Hong Kong stocks on these platforms.”<\/span>","<span data-v-f87c67ca=\"\">HashKey requires users to link their bank cards to deposit via fiat currency with the exchange. “We’ll support deposits made in Hong Kong dollars and U.S. dollars,” Weng said.<\/span>","<span data-v-f87c67ca=\"\">Weng added that HashKey doesn’t allow Chinese mainland users to register. “We strictly prohibit users from Chinese IP addresses to register on our platform,” he said.<\/span>","<span data-v-f87c67ca=\"\">Unlike its neighboring Hong Kong — which is actively developing the crypto and Web3 industries — China banned all crypto transactions on the mainland in September 2021.<\/span>","<span data-v-f87c67ca=\"\">HashKey has placed high hopes in its retail services, according to Weng: “We hope to grow our registered user base to between 500,000 to 1 million by the end of this year.&nbsp;<\/span><span data-v-f87c67ca=\"\">We’re also anticipating a more bullish market next year. If that’s the case, we would target to serve 10 million users by 2025.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Aug. 28","content":"DATE"},{"type":"Weng","content":"PERSON"},{"type":"September 2021","content":"DATE"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"Livio Weng","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["ASIAN REGULATION","HASHKEY"],"authors":["Timmy Shen","The Block"]}