{"summary":"This report analyzes the current state of Bitcoin&#x27;s expansion beyond its core base layer protocol in two key areas – (i) payments and asset issuance protocols and (ii) general-purpose protocols. It gives an overview of projects in both areas and compares them based on design trade-offs and performance metrics.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153283\/bitcoin-beyond-the-base-layer-commissioned-by-trust-machines","publishDate":"2022-06-21T09:25:41","id":1304,"type":null,"title":"Bitcoin: Beyond the Base Layer- Commissioned by Trust Machines","category":["RESEARCH"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research was commissioned by Trust Machines to create “Bitcoin: Beyond the Base Layer”. To access the full report in PDF format, please fill out the form below:&nbsp;<\/b>","<b data-v-f87c67ca=\"\">Executive Summary<\/b>","<span data-v-f87c67ca=\"\">This report analyzes the current state of Bitcoin's expansion beyond its core base layer protocol in two key areas – (i) payments and asset issuance protocols and (ii) general-purpose protocols. It gives an overview of projects in both areas and compares them based on design trade-offs and performance metrics.<\/span>","<span data-v-f87c67ca=\"\">The report finds several key developments:<\/span>","<b data-v-f87c67ca=\"\">Bitcoin's Base Layer Stands to Benefit from Increased Application Development<\/b>","<span data-v-f87c67ca=\"\">Bitcoin's falling block subsidy creates a need for recurring transaction fee revenue to ensure its long-term security. Bitcoin-based protocols that enhance Bitcoin's scalability and broaden its use cases could dramatically expand its total user base and generate sustainable transaction fee revenue.<\/span>","<b data-v-f87c67ca=\"\">Bitcoin-based Applications Can Unlock Value for Users<\/b>","<span data-v-f87c67ca=\"\">Bitcoin-based protocols can provide users with relatively high levels of security and dependability. Market data showcases underlying user demand to put BTC to productive use in decentralized finance (DeFi) applications – but much of this demand is being absorbed by Ethereum and other layer-1 blockchains. Bitcoin-based applications can allow users to deploy capital directly within Bitcoin's established security framework – thus avoiding the heightened centralization risks associated with bridging and deploying BTC on layer-1 networks.&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Extending Bitcoin's Use Cases is a Multi-Front Exercise &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; <\/b>","<span data-v-f87c67ca=\"\">Lightning Network, Bitcoin's layer-two scaling solution, has grown significantly in the last two years. While efforts to extend its functionality (beyond facilitating BTC payments) are underway, its network does not support general-purpose application development.<\/span>","<span data-v-f87c67ca=\"\">Projects focused on providing general-purpose support, such as RSK and Stacks, have taken novel approaches based on learnings from previous attempts to add functionality on top of Bitcoin. Both of these networks employ their own respective data ledgers (to avoid congesting Bitcoin's base layer) and use cross-chain consensus mechanisms to leverage Bitcoin's underlying security. These consensus mechanisms reside at the center of their networks and impact their relative security and performance.<\/span>","<b data-v-f87c67ca=\"\">Bitcoin-based App Development Still Lags Layer-1 Blockchains<\/b>","<span data-v-f87c67ca=\"\">Infrastructure improvements are needed to match the developer and user experience of Ethereum and other Ethereum Virtual Machine (EVM) compatible blockchains. Increased investment into Bitcoin-based protocol development organizations is an encouraging sign for improvement in this area. On a year-to-date basis, these organizations have collectively received ~$400 million in funding.<\/span>","<em data-v-f87c67ca=\"\">Note: Following publication of this report, The Block Research was notified that one of the data sets included in the report (Total Value Locked) was restated by a third-party data provider. Accordingly, figures related to Total Value Locked (TVL) on Stacks are overstated in historical periods analyzed in the report. TVL on Stacks is currently ~$15 million compared to ~$90million as previously highlighted in the report. Please refer to <a href=\"https:\/\/defillama.com\/chain\/Stacks?currency=USD\" data-v-f87c67ca=\"\">DeFiLlama<\/a> for the updated figures. <\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"RSK","content":"ORGANIZATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Trust Machines","content":"ORGANIZATION"},{"type":"last two years","content":"DATE"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"Increased Application Development","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"$90million","content":"MONEY"},{"type":"Applications Can Unlock Value for Users","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["The Block Research","The Block"]}