{"summary":"The new GOP whip has bashed the Securities and Exchange Commission after the collapse of crypto exchange FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187373\/crypto-friendly-emmer-wins-key-house-leadership-post","publishDate":"2022-11-15T16:34:00","id":13040,"type":null,"title":"Crypto-friendly Emmer wins key House leadership post ","category":["POLICY"],"content":["An outspoken proponent of digital assets just won a high-ranking post in Congress.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Rep. Tom Emmer, R-Minn., won the race for House GOP whip, according to multiple <a href=\"https:\/\/thehill.com\/homenews\/house\/3736897-house-gop-picks-emmer-as-gop-whip-scalise-as-leader\/\" data-v-f87c67ca=\"\">reports<\/a>. The Minnesota congressman will be responsible for keeping Republicans in line on key votes when the new Congress begins in January. He beat Rep. Jim Banks, R-Ind., in a runoff.","Due to the close nature of this year's midterm elections, neither party has cemented a majority, but Republicans are expected to narrowly reclaim the House of Representatives. That would make Emmer the new House majority whip.&nbsp;","<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">Emmer's office did not immediately respond to a request for comment.<\/span>","Emmer’s new role as party whip could give new attention to cryptocurrency issues, though he will also have to grapple with what will figure to be one of the narrowest House majorities in U.S. history. A current member of the House Financial Services Committee, Emmer filed a bill in January to ban the Federal Reserve from issuing a central bank digital currency directly to individuals. He more <a href=\"https:\/\/twitter.com\/RepTomEmmer\/status\/1590717374801809409?s=20&amp;t=VOYmwDN2UzVmdnl4HaFtZA\" data-v-f87c67ca=\"\">recently took aim<\/a> at the Securities and Exchange Commission after the collapse of crypto exchange FTX.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","As National Republican Campaign Committee chair the last two election cycles, Emmer helped elect several of his House colleagues, a fact that likely aided him in the leadership race -- though Republicans fell short of the expected 'wave' of seats they'd hoped to gain heading into midterms.&nbsp;","The new Congress could take significant action on cryptocurrency bills next year, especially after FTX filed for bankruptcy protection. Lawmakers on the House Financial Services Committee spent months drafting a bipartisan bill to regulate stablecoins in the U.S. Meanwhile, former FTX CEO Sam Bankman-Fried advocated heavily for a bill that would grant new regulatory authority to the Commodity Futures Trading Commission, before the exchange collapsed.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Jim Banks","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Ind.","content":"LOCATION"},{"type":"Emmer","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Minnesota","content":"LOCATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"narrowest House","content":"ORGANIZATION"},{"type":"National Republican Campaign Committee","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Minn.","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"House GOP","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"}],"hashtag":["HOUSE FINANCIAL SERVICES COMMITTEE"],"authors":["Stephanie Murray","The Block"]}