{"summary":"South Korea’s top financial regulator said that it will stand by its rule that restricts financial institutions from launching crypto ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271837\/south-korea-reiterates-crypto-etf-ban","publishDate":"2024-01-11T03:19:33","id":13057,"type":null,"title":"South Korea reiterates ban on crypto ETFs despite US approval: report","category":["INTERNATIONAL POLICYMAKING"],"content":["<span data-v-f87c67ca=\"\">South Korea’s top financial regulator said today that it will stand by its rule that restricts financial institutions from launching cryptocurrency exchange-traded funds, local media reported.<\/span>","<span data-v-f87c67ca=\"\">An official of the country’s Financial Services Commission <\/span><a href=\"https:\/\/www.khan.co.kr\/economy\/finance\/article\/202401111541001\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">told<\/span><\/a><span data-v-f87c67ca=\"\"> local news outlet Kyunghyang that <a href=\"https:\/\/www.theblock.co\/post\/271341\/spot-bitcoin-etfs-can-start-trading-as-sec-clears-final-hurdle\" data-v-f87c67ca=\"\">the approval of spot bitcoin ETFs in the U.S.<\/a> is not an event that would prompt the Korean regulator to lift the ban or reconsider it. The report cited the stability of the financial markets and investor protection as reasons for upholding the current restrictions.<\/span>","<span data-v-f87c67ca=\"\">The country’s <\/span><a href=\"https:\/\/elaw.klri.re.kr\/kor_service\/lawView.do?hseq=62466&amp;lang=ENG\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">capital markets act<\/span><\/a><span data-v-f87c67ca=\"\"> currently limits the scope of underlying assets for investment contract securities, such as ETFs, to financial investment instruments, currencies and ordinary commodities, which does not include crypto. South Korea does not acknowledge cryptocurrencies as financial assets and has banned financial institutions from investing in crypto since 2017.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">South Korea is developing a two-part crypto regulation, with the first part passed last year and set to go into effect in July 2024. It is constructing the second part of its crypto act, which aims to set clear rules regarding the issuance, listing and delisting of cryptocurrencies.<\/span>","<span data-v-f87c67ca=\"\">The FSC did not immediately respond to The Block’s enquiry for comments.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"’s Financial Services Commission","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"FSC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July 2024","content":"DATE"}],"hashtag":["ASIAN REGULATION"],"authors":["Danny Park","The Block"]}