{"summary":"A lobbying push from FTX CEO Sam Bankman-Fried over a bill to create a new regime around bitcoin and other digital assets has been met with resistance from DeFi advocates in Washington. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182827\/defi-advocates-push-back-against-ftx-backed-crypto-bill","publishDate":"2022-11-04T08:00:02","id":13052,"type":null,"title":"DeFi advocates push back against FTX-backed crypto bill","category":["POLICY"],"content":["Decentralized finance advocates are scrambling to slow the passage of a digital asset regulation bill until next year, teeing up a struggle between some of crypto’s largest players, with Washington lawmakers in the middle. &nbsp;","Sens. Debbie Stabenow, D-Mich., and John Boozman, R-Ark., authored legislation in recent months to broaden the Commodity Futures Trading Commission’s authority so the agency directly oversees and regulates markets that make up a majority of volume and value exchange of cryptocurrency trading. The bill, titled the Digital Commodities Consumer Protection Act, has an unusual coalition of supporters that include CFTC Chair Rostin Behnam, who testified in support of the bill in September, and FTX CEO Sam Bankman-Fried.","The FTX chief has flexed significant political muscle over the last year, meeting frequently with policymakers in Washington and pouring millions of dollars into political races this midterm cycle. Bankman-Fried gave $23 million to his Protect Our Future super PAC, which supported Democratic primary candidates as part of its focus on pandemic preparedness. The exchange mogul also has given thousands to individual lawmakers and other political action committees.","Though the DCCPA could ultimately result in a clearer legal structure around large portions of crypto markets, much of the industry has begun to push back, as decentralized finance projects especially worry about being left out in the cold. The bill applies only to cryptocurrencies that could be labelled digital commodities, and most DeFi tokens are unlikely to fall under that category.&nbsp;","What had been a behind-closed-doors disagreement between Bankman-Fried and other portions of the industry spilled out into the open via Twitter after The Block reported on negotiations around the bill, including the possibility of a mandated regulatory study of DeFi. The FTX CEO published a detailed \"<a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjN7o6Cuvz6AhWiJn0KHePxDIcQFnoECA8QAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F178485%2Fsbf-posts-regulatory-manual-for-crypto-and-ftx-cautions-against-locking-in-defi-policy&amp;usg=AOvVaw0qHf5GWNhnR4ly4bGAJyN5\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"0\" data-v-f87c67ca=\"\">manual<\/a>\" to his own policy views.","A recent dinner gathering in Washington of industry representatives and digital currency advocates served as an in-real-life foreshadowing of the very online meltdown reaction to Bankman-Fried’s policy statements.","Earlier this month Messari CEO Ryan Selkis brought together a group that included DeFi Education Fund, the Crypto Council for Innovation, the Blockchain Association, Coin Center and FTX.&nbsp;","\"We convened a small policy-focused meeting of some of Messari's customers, investors and partners during DC Fintech Week (when many crypto policy folks were in the same place),” Selkis said in an email.&nbsp;“It's important we get this right, without rushing to pass legislation that could inadvertently hurt emerging protocols and software developers,” he added.","Bankman-Fried, who was in town for one of his latest Washington visits, was invited but arrived late to the gathering at the Kimpton Banneker Hotel near D.C.’s Logan Circle. At dinner he voiced his support for the legislation, according to multiple people present. Participants insist the tone of debate never took the more vitriolic direction of later tweets from DeFi supporters aimed at the FTX CEO, but a dividing line among those most engaged in crypto advocacy in Washington became clear after Bankman-Fried’s arrival.","DeFi proponents argued the bill he supports favors exchanges like FTX, whose commodity offerings — definitely bitcoin, <a href=\"https:\/\/www.theblock.co\/post\/179423\/cftc-and-sec-chairs-may-disagree-over-whether-ether-is-a-security\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"1\" data-v-f87c67ca=\"\">probably ether<\/a> — would be regulated by the CFTC. Others, including Bankman-Fried, characterized the bill as a step in the right direction for crypto.&nbsp;","“I won't push against the community's strategy,” Bankman-Fried said in a <a href=\"https:\/\/www.theblock.co\/post\/181157\/ftxs-bankman-fried-to-let-crypto-twitter-take-the-wheel-on-digital-asset-policy\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"2\" data-v-f87c67ca=\"\">live-streamed debate<\/a> on the topic with ShapeShift CEO Erik Voorhees last Friday. “Even where I think it might not be the most effective way to accomplish the goal.”","Staff at the Senate Agriculture Committee also have <a href=\"https:\/\/www.theblock.co\/post\/178088\/senate-committee-negotiating-sec-sign-off-on-digital-commodity-definition\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"3\" data-v-f87c67ca=\"\">discussed giving the Securities and Exchange Commission formal sign off<\/a> before the CFTC determines whether a digital asset is a commodity. The committee holds jurisdiction over the regulator because most commodities are agricultural products, though bitcoin and other digital commodities don’t fall neatly into the same rules as soy or corn futures. Stabenow, the committee chair, has signaled she wants to hold a committee vote on the bill before the end of the year.","The likelihood that the bill is passed into law in the next several months is slim, but not impossible, said Alex Grieve, vice president of Tiger Hill Partners, an advocacy firm that represent clients in the digital asset industry. There’s likely not enough time for the bill to move on its own during what remains of this Congress, meaning it would need to catch a ride with must-pass legislation, likely a government funding package in the lame-duck session expected to take place after midterm elections.","“Given the litany of other congressional priorities before the end of the year, inclusion in any final omnibus package is far from certain, and it will likely continue to be a topic of debate and consideration for the new Congress,” Grieve said in a written response.&nbsp;","Still, the possibility of the bill getting a ride with a larger piece of legislation <a href=\"https:\/\/www.theblock.co\/post\/178542\/sam-bankman-fried-draws-fire-from-defi-proponents-after-regulation-proposal\" data-v-f87c67ca=\"\">worries<\/a> some DeFi proponents.","“This is yet another example of centralized, CeFi [centralized finance] crypto trying to pull up the ladder behind them. They’ve made their money, they’ve got their dominant market positions so they want to build a moat around their businesses,” said PaperImperium, a MakerDAO <a href=\"https:\/\/www.coindesk.com\/tech\/2021\/10\/14\/meet-the-defi-delegate-knocking-on-the-doors-of-congress\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"4\" data-v-f87c67ca=\"\">delegate<\/a> who uses a pseudonym and advocates on behalf of DeFi projects.&nbsp;","The skeptics also include Alliance DAO, a web3 accelerator and founder community, which opposes the bill as it is written.","“In a perfect world, Congress takes a breather and revisits this next year as a specific bill, not as part of another legislative process,” said Alliance DAO’s Dane Lund. “When you sweep things into an omnibus package, it is often an underhanded way of passing things that otherwise would not pass.”","Despite rancor over the bill coming from portions of the DeFi community, Bankman-Fried said he is “optimistic” about the legislation in an Oct. 23 <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1584095480359059456\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"5\" data-v-f87c67ca=\"\">tweet<\/a>. But the FTX founder is waiting to see the final bill text, he noted.","&nbsp;","<em data-v-f87c67ca=\"\">With additional reporting by Stephanie Murray.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"John Boozman","content":"PERSON"},{"type":"DC Fintech Week (","content":"ORGANIZATION"},{"type":"Stephanie Murray","content":"PERSON"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Tiger Hill Partners","content":"ORGANIZATION"},{"type":"Debbie Stabenow","content":"PERSON"},{"type":"Messari","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$23 million","content":"MONEY"},{"type":"Kimpton Banneker Hotel","content":"ORGANIZATION"},{"type":"Oct. 23","content":"DATE"},{"type":"millions of dollars","content":"MONEY"},{"type":"Selkis","content":"PERSON"},{"type":"Alex Grieve","content":"PERSON"},{"type":"Grieve","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"Alliance DAO","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Erik Voorhees","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Mich.","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Ark.","content":"LOCATION"},{"type":"Logan Circle","content":"LOCATION"},{"type":"D.C.","content":"LOCATION"},{"type":"Senate Agriculture Committee","content":"ORGANIZATION"},{"type":"Dane Lund","content":"PERSON"}],"hashtag":["SEC"],"authors":["Colin Wilhelm","The Block"]}