{"summary":"With Binance set to pay a $4 billion fine and its CEO potentially facing jail time, crypto pundits weigh in on its future.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264379\/where-does-binance-go-from-here","publishDate":"2023-11-22T14:55:18","id":13056,"type":null,"title":"Where does Binance go from here?","category":["CRYPTO ECOSYSTEMS"],"content":["The largest crypto exchange in the world has been hit by probably the biggest blow to ever impact a player in the industry. That's both financially, with a $4 billion fine, and metaphysically, with its CEO stepping down.","Yet Binance isn't going anywhere, for now at least. The exchange already has its <a href=\"https:\/\/www.theblock.co\/post\/264174\/meet-richard-teng-a-primer-on-the-new-ceo-of-worlds-largest-crypto-exchange\" data-v-f87c67ca=\"\">new CEO Richard Teng<\/a> in place (a former regulator, to send the right message of course), and it's <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-futures-will-launch-usd%E2%93%A2-m-1000bonk-and-pyth-perpetual-contracts-with-up-to-50x-leverage-7b3f500e0eec40f380023b4ff0ccca18\" data-v-f87c67ca=\"\">still listing memecoins<\/a> with 50X leverage like nothing happened.","So the real question is how will Binance fare going forward? Will the exchange follow in BitMEX's footsteps, which lost market dominance after its founding team was charged with illegally operating a crypto derivatives platform? Or will it shrug off the blows and continue marching on?","In general, crypto observers and industry players disagreed on the direction that the exchange could head toward, with some predicting growth in its market share, some anticipating a decline and some neutral. But what they largely agreed on was the notion that it would be a gradual move whichever way it goes, rather than a sudden, major shift.","Optimistic analysts shared the view that the settlement has largely shrugged off potential issues for the exchange, enabling it to grow over the next few years.&nbsp;","\"In terms of dominance, we could see Binance maintain or even strengthen its market position. The resolution of these legal issues should reinstill confidence in the exchange, and funds that were previously pulled for safety measures may flow back,\" said Danny Chong, co-founder of DeFi protocol Tranchess, who spent 17 years in investment banking before joining crypto.","Chong added that appointing a CEO with a regulatory background implies the exchange is boosting its compliance measures, noting that this could see the exchange return to the U.S. and other countries.","Adam Cochran, general partner at Cinneamhain Ventures, shared this view. \"Monitorship is going to be hard, and it's going to take a lot of their internal resources, and make it harder for them to be at the bleeding edge. But, in the end it could mean bringing up their standards enough that they are able to re-enter a lot of markets they were dropped from,\" he said.","Cochran added it will be a tough needle for Binance to thread when it's used to moving at a rapid pace, but it has a strong foundation due to its global footprint. \"It's an opportunity that is theirs for the taking, they just have to put in the work,\" he added.","Danny Lim, a core contributor to the MarginX decentralized exchange and co-founder of Pundi X, also took the view that Binance might grow in the wake of the settlement. \"When it comes to market dominance of crypto exchanges, Binance may initially lose some of its user base to comply with regulations, which may complicate the onboarding process. Looking at the long-term, however, Binance will continue to maintain its market dominance in terms of asset value and will only grow bigger from here on,\" he said.","Lukas Schor, co-founder of crypto wallet provider Safe, acknowledged that the \"eye-watering\" fine might at first sound catastrophic, but he reckoned that it will ultimately have a positive impact for Binance. By stepping down, former CEO Changpeng Zhao has let the exchange remove itself from a lot of the distractions and chaos associated with SEC enforcement, he said.","\"While it may lose some immediate market share, it will come out stronger on the other side,\" Schor added.","More pessimistic analysts argued that the recent setbacks, while not devastating, are likely to have a negative effect on the exchange over the long run.&nbsp;","\"I think their market share will gradually decline from here, but will still be in the top 3 exchanges for the foreseeable future,\" said Arthur Cheong, founder and CEO of Defiance Capital.","\"I do think new management means the focus is less on product innovation and will be more on compliance and institutionalization of the company,\" he added. \"So expect less vibrancy.\"","A high-profile crypto trader with a large following on X, who asked to not be named for this piece, argued that the parallels with BitMEX, which saw a big decline in market share following its regulatory hurdles, are overblown. That's because it used to be much easier to switch exchanges in the past due to a lack of KYC, they said, noting it had also been exacerbated by the move from inverse coin margined perpetuals to linear margined perpetuals.","They noted that the exchange's continued operations give confidence in the exchange, while the settlement eliminates the risk of a sudden seizure of assets, \"which had been hanging like a sword over its head all this while.\" They said the exchange will likely lose some users in response to the settlement and concede some market share to rival exchanges like OKX and ByBit, but it still is likely to maintain its position as the market leader, assuming there are no further developments.","Eric Wall, a board member of StarkNet Foundation, took a slightly stronger view over the long term. \"Binance may, years down the road, lose its grip as the largest exchange if CZ is no longer at the helm,\" he said.","<em data-v-f87c67ca=\"\">Anna Baykadova contributed reporting to this article.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"StarkNet Foundation","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Danny Chong","content":"PERSON"},{"type":"Danny Lim","content":"PERSON"},{"type":"Defiance Capital","content":"ORGANIZATION"},{"type":"Adam Cochran","content":"PERSON"},{"type":"Eric Wall","content":"PERSON"},{"type":"Richard Teng","content":"PERSON"},{"type":"Arthur Cheong","content":"PERSON"},{"type":"Cinneamhain Ventures","content":"ORGANIZATION"},{"type":"Anna Baykadova","content":"PERSON"},{"type":"Schor","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Lukas Schor","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Tim Copeland","The Block"]}