{"summary":"Japan’s GPIF is seeking information on bitcoin and other low-liquidity assets as part of a potential portfolio diversification plan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283281\/japan-pension-fund-review-bitcoin","publishDate":"2024-03-19T05:29:25","id":13053,"type":null,"title":"Japan’s $1.5 trillion government fund seeks info on illiquid assets including bitcoin for portfolio diversification","category":["COMPANIES"],"content":["Japan’s Government Pension Investment Fund (GPIF) is seeking information regarding the option to potentially include bitcoin (among other illiquid assets) in its investment portfolio.","The fund <a href=\"https:\/\/www.gpif.go.jp\/en\/info\/20240319_RFI_E.pdf\" data-v-f87c67ca=\"\">announced<\/a> on Tuesday that it officially requests the public to submit information on low-liquidity assets such as bitcoin, gold, and farmland. This is part of its five-year research to innovate investment strategies in response to economic and social changes and the rapid development of technology, the fund stated.","However, it is difficult to view the latest announcement as indicative of the pension fund’s inclination towards bitcoin, as it is in the stages of collecting data prior to a proper discussion.","As of Q3 2023, GPIF <a href=\"https:\/\/www.gpif.go.jp\/en\/performance\/53748269gpif\/2023_3Q_0202_en.pdf\" data-v-f87c67ca=\"\">managed<\/a> about 224.7 trillion yen (US$1.5 trillion). It is the world’s largest known pension fund, <a href=\"https:\/\/www.bloomberg.co.jp\/news\/articles\/2024-03-19\/SAKP1VT0AFB400\" data-v-f87c67ca=\"\">according to<\/a> Bloomberg.","This comes as the price of bitcoin fell 5.43% in the past 24 hours to $64,005, retracing a portion of its record-breaking gains made last week. However it remains up more than 50% year-to-date.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"US$1.5 trillion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"5.43%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$64,005","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"224.7 trillion yen","content":"MONEY"},{"type":"Japan","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Danny Park","The Block"]}