{"summary":"The Israel Securities Authority proposed amendments to three existing financial laws to include digital assets.\nOnce authorized and published, the new crypto laws will be enacted after six months.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199076\/israels-financial-regulator-proposes-crypto-inclusion-to-securities-law","publishDate":"2023-01-04T04:28:15","id":1306,"type":null,"title":"Israel&#x27;s financial regulator proposes crypto inclusion to securities law","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Israel's financial regulator proposed draft amendments to sweep digital assets into existing financial laws and expand the definition of securities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The <a href=\"https:\/\/www.isa.gov.il\/%D7%97%D7%A7%D7%99%D7%A7%D7%94%20%D7%95%D7%90%D7%9B%D7%99%D7%A4%D7%94\/Legislation\/Proposed%20Legislation\/Suggestions\/Documents\/digital.pdf\" data-v-f87c67ca=\"\">proposals<\/a> look to protect investors from risks, which the regulator notes have been abundant in the past year. The document referred to the downfall of the crypto exchange FTX while pointing out that collapsed crypto lender Celsius — which triggered a crypto market slide last summer — is Israeli-owned. <\/span>","<span data-v-f87c67ca=\"\">The draft amendments also seek to maintain the flexibility to change laws to suit the fast-paced technological development in the crypto industry.<\/span>","<span data-v-f87c67ca=\"\">The Israel Securities Authority proposed to bring digital assets under the roof of laws governing securities, joint investments and investment consultation, marketing, and portfolio management.&nbsp;<\/span><span data-v-f87c67ca=\"\">In each case, digital assets are defined as a “digital representation of value used for the purpose of financial investment, and can be transferred and stored electronically by using distributed ledger technology or another technology.”*<\/span>","<span data-v-f87c67ca=\"\">Public commentary on the proposed amendments is open until Feb. 12. The ISA suggests six months from publication before the laws are enacted to allow entities and the regulator to prepare for supervision.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The regulator sees an opportunity in crypto for investors and the Israeli economy, allowing more diverse sources of capital and encouraging innovation and growth.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The advanced technology in these assets can lead to economic efficiency in many areas, reduce costs, save the need for intermediaries and optimize the way information is transferred between entities,” the document reads.&nbsp;<\/span><span data-v-f87c67ca=\"\">According to the ISA, more than 200,000 Israelis are investing in crypto, and around 150 crypto firms are operating in the country.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Israeli officials have shown further interest in crypto in recent months, with the national stock exchange planning to <\/span><a href=\"https:\/\/www.theblock.co\/post\/179370\/israels-stock-exchange-will-launch-a-platform-for-digital-assets\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launch<\/span><\/a><span data-v-f87c67ca=\"\"> a platform to trade digital assets.<\/span>","<em data-v-f87c67ca=\"\">*Quotes have been translated from Hebrew.<\/em>"],"hashtag":[]}