{"summary":"A New York judge granted the SEC&#x27;s request to file a motion for leave to file an interlocutory appeal in an ongoing dispute with Ripple.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/246057\/judge-in-ripple-case-grants-sec-request-to-file-interlocutory-appeal","publishDate":"2023-08-17T13:52:04","id":13062,"type":null,"title":"Judge in Ripple case grants SEC request to file interlocutory appeal","category":["COMPANIES"],"content":["A New York district court judge granted the Securities and Exchange Commission's request to file a motion for leave to file an interlocutory appeal in an ongoing dispute with Ripple Labs, according to a document filed in court on Thursday.","The SEC can file its motion by Aug. 18, said Judge Analisa Torres, and Ripple has until Sept. 1 to file their opposition papers, according to the filing. The SEC said last week that it planned to request an interlocutory appeal.","Ripple <a href=\"https:\/\/www.theblock.co\/post\/245797\/ripple-labs-says-it-opposes-sec-move-to-file-an-appeal\" data-v-f87c67ca=\"\">argued yesterday<\/a> that it opposed the SEC’s move and said that there is “no extraordinary circumstance here that would justify departing from the rule requiring all issues as to all parties to be resolved before an appeal.”","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC would still need permission from the Second Circuit, which would then look into the interlocutory appeal.&nbsp;<\/span>","Ripple has been embroiled in a legal fight with the SEC since 2020, when the agency accused Ripple of raising $1.3 billion in 2020 through the sale of XRP, which it says is an unregistered security.","Torres ruled last month that some of Ripple’s sales, called programmatic, of XRP did not violate securities laws because of a blind bid process in place for them. She also ruled that other direct sales of the token to institutional investors were securities, leaving a partial win for the SEC.","The SEC is looking to specifically appeal the part of the decision about the programmatic sales as well as “other distributions” that included offers and sales of XRP in exchange for goods and services.","<span class=\"s1\" data-v-f87c67ca=\"\">One judge <a href=\"https:\/\/www.theblock.co\/post\/242381\/judge-slams-ripple-decision-in-secs-case-against-terraform-labs\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">disagreed<\/span><\/a> with Torres in a separate case brought by the SEC against Terraform Labs. Terraform had argued that Torres’ decision in the Ripple case invalidated the case.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It may also be mentioned that the Court declines to draw a distinction between these coins based on their manner of sale, such that coins sold directly to institutional investors are considered securities and those sold through secondary market transactions to retail investors are not. In doing so, the Court rejects the approach recently adopted by another judge of this District in a similar case,\" said Judge Jed Rakoff of the U.S. District Court for the Southern District of New York.&nbsp;<\/span>","<em data-v-f87c67ca=\"\">(Updated to include details throughout.)&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thursday","content":"DATE"},{"type":"Aug. 18","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Sept. 1","content":"DATE"},{"type":"Ripple Labs","content":"ORGANIZATION"},{"type":"Second Circuit","content":"ORGANIZATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Torres","content":"PERSON"},{"type":"Analisa Torres","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"XRP","content":"ORGANIZATION"},{"type":"Jed Rakoff","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}