{"summary":"Bored Apes owners continue to be targets of phishing attacks as one collector loses $2.7 million worth of NFTs to scammers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/132567\/nft-collector-loses-2-7-million-in-bored-ape-nfts-and-derivatives","publishDate":"2022-02-01T09:16:05","id":13078,"type":null,"title":"NFT collector loses $2.7 million in Bored Ape NFTs and derivatives","category":["HACKS"],"content":["NFT collector Larry Lawliet lost seven expensive Bored Apes and a set of other NFTs to a suspected social engineering attack on Monday.","The perpetrator appeared to trick Lawliet into signing fake transactions that granted them access to the his NFTs. They then used this access to transfer the NFTs to their own wallet.","Lawliet <a href=\"https:\/\/twitter.com\/iloveponzi\/status\/1488286811462205440\" data-v-f87c67ca=\"\">took<\/a> to Twitter saying that 13 of his NFTs had been stolen by the attacker including seven Bored Apes, five Mutant Apes, and one Doodle. In total, Lawliet’s loss stands at $2.7 million based on the floor price of the NFTs stolen from his wallet.","The victim’s troubles began when an attacker (likely the same person) took <a href=\"https:\/\/twitter.com\/RobSawyerUK\/status\/1488281711809077254\" data-v-f87c67ca=\"\">control<\/a> of the Discord server of another NFT collection called Moschi Mochi to post a fake announcement about an extra mint. The scam involved inviting members of the Moschi Mochi community to participate in an extra mint of 1,000 NFTs for a chance to win a $25,000 raffle.","A look at Lawliet’s <a href=\"https:\/\/etherscan.io\/address\/0x6d0267156f1c6ce44caa4bf129b76009d3d41830\" data-v-f87c67ca=\"\">wallet<\/a> address on Etherscan shows that he interacted with the fake mint and sent 0.49 ETH in exchange for 14 of the scam NFTs. Immediately following the transfer, Lawliet’s transaction history shows numerous “set approval” transactions.","These set approval transactions all had the hacker’s “<a href=\"https:\/\/etherscan.io\/address\/0xD27045A8506369a60A227b44bEaDb2Aed2099d70\" data-v-f87c67ca=\"\">0xD27<\/a>” address set as an <a href=\"https:\/\/etherscan.io\/tx\/0x8a032cd0606415de68fe4d3a735eabecf989fdcf21afceb1178a7a8f6b6a4c92\" data-v-f87c67ca=\"\">approved<\/a> address. This meant that the victim was tricked into calling the “setApprovalForAll” call when signing these transactions with his own wallet.","<span data-v-f87c67ca=\"\">The NFTs that were stolen. Image: <a href=\"https:\/\/twitter.com\/iloveponzi\/status\/1488286811462205440\" data-v-f87c67ca=\"\">Twitter<\/a>.<\/span>","A key thing here is that when someone approves a blockchain transaction via an in-app browser like MetaMask, it’s not always clear exactly what permissions they are giving to the website. In this case, the victim assumed they were regular transactions when in fact he was giving out control over his own NFTs.","There is, however, a feature on MetaMask that allows users to examine the exact nature of their transactions before executing them. This step involves clicking the “details” tab which then displays details about the transaction including vital information like addresses being granted approval. But during the rush for an NFT mint, investors may not always check this.","This particular contract call — setApprovalForAll — allowed the hacker to initiate the “transferFrom” contract call which enabled them to transfer all of the victim’s Bored Apes to another wallet. In programming, a call allows a user to execute the code of another contract, in this case, the ability to transfer NFTs from the victim to the hacker.","Once the attacker had permission to control the victim’s NFTs, they started moving them to a different wallet. The hacker was able to use this method to take the Bored Apes and other NFTs including Mutant Apes and Doodles.","Owners of popular NFT collections like BAYC continue to be targets of <a href=\"https:\/\/www.theblockcrypto.com\/post\/111782\/white-hat-hacker-saves-117000-in-crypto-from-metamask-phishing-attack\" data-v-f87c67ca=\"\">social engineering attacks<\/a> aimed at stealing their valuable NFTs. As of the time of writing, the collection has a floor <a href=\"https:\/\/opensea.io\/collection\/boredapeyachtclub\" data-v-f87c67ca=\"\">price<\/a> of over 118 ETH ($320,000).","In response to incidents like these, security experts generally advise the use of “burner wallets,” addresses that contain only a small amount of funds to cover gas fees. Thus, if the transaction happens to be a phishing attack, the victim’s loss will be significantly limited.","Verifying transaction details before approving might also be a useful preventative measure. As Tal Be’ery <a href=\"https:\/\/twitter.com\/TalBeerySec\/status\/1488435148295135234\" data-v-f87c67ca=\"\">put it<\/a>, approvals should only go to “trustworthy contracts” with relatively long transaction histories. Web wallets like MetaMask show details of transactions and can be a useful tool in spotting phishing attacks.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Larry Lawliet","content":"PERSON"},{"type":"$320,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Doodle","content":"ORGANIZATION"},{"type":"$2.7 million","content":"MONEY"},{"type":"$25,000","content":"MONEY"},{"type":"Moschi Mochi","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}