{"summary":"Switzerland-based Dfinity Foundation reported that community members committed millions of ICP tokens to projects involving dapps in 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284854\/dfinitys-internet-computer-community-committed-over-120-million-to-dapps-last-year","publishDate":"2024-03-27T09:01:05","id":13079,"type":null,"title":"Internet Computer community committed over $120 million to dapps last year","category":["CRYPTO ECOSYSTEMS"],"content":["Dfinity Foundation, the Swiss not-for-profit organization behind the Internet Computer blockchain, announced that community members \"committed\" over 6.5 million ICP tokens to help protocols become decentralized autonomous organizations, or DAOs, in 2023.","After the blockchain's ICP token rose on Tuesday by about 12% to more than $19, the total value of committed tokens increased to more than $120 million, according to <a href=\"https:\/\/www.theblock.co\/price\/248379\/internet-computer-icp-usd\" data-v-f87c67ca=\"\">The Block Price Page<\/a>.&nbsp;","In a statement, Dfinity Foundation said <span data-v-f87c67ca=\"\">community members committed \"more than 6.5 million ICP tokens ... via the innovative <\/span><span data-v-f87c67ca=\"\">Service Nervous System<\/span><span data-v-f87c67ca=\"\"> (SNS) framework to help decentralize the ecosystem’s top protocols.\" To further explain, the organization said, \"U<\/span><span data-v-f87c67ca=\"\">nique to the ICP, the SNS model allows protocols to become fully decentralized by turning into DAOs.\"<\/span>","&nbsp;","<span data-v-f87c67ca=\"\">ICP price action. Image: The Block Price Page.<\/span>","Initiating decentralization of protocols occurs after community members commit ICP tokens to proposed projects via \"<span data-v-f87c67ca=\"\">decentralization swaps,\" Dfinity Foundation said in its statement. Dapps that have benefitted from the framework include the messenger app <a href=\"https:\/\/www.theblock.co\/post\/263579\/proving-youre-human-internet-computer-app-openchat-to-test-facial-recognition\" data-v-f87c67ca=\"\">Open Chat<\/a> and the video game called Dragginz, both of which is built using the Internet Computer blockchain.<\/span>","Dfinity Foundation's Internet Computer officially <a href=\"https:\/\/www.theblock.co\/linked\/104146\/dfinity-launches-internet-computer\" data-v-f87c67ca=\"\">launched in 2021<\/a>. At the time, it was one of the most highly anticipated blockchain projects, having raised more than $160 million in venture capital.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"\" Dfinity Foundation","content":"ORGANIZATION"},{"type":"$160 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"The Block Price Page","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$19","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Dfinity Foundation","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"SNS","content":"ORGANIZATION"},{"type":"ICP","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}