{"summary":"Vitalik Buterin expects Dogecoin and Zcash to transition to proof-of-stake consensus in the future.\nThe two projects currently rely on proof-of-work mining to process blocks.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172606\/vitalik-buterin-expects-zcash-and-dogecoin-to-migrate-to-proof-of-stake-model","publishDate":"2022-09-24T07:45:00","id":1307,"type":null,"title":"Vitalik Buterin expects Zcash and Dogecoin to migrate to proof-of-stake model","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">Ethereum co-founder Vitalik Buterin expects two other proof-of-work blockchains, Zcash and Dogecoin, to transition to proof-of-stake consensus in the future.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/linked\/2360\/zcash-makes-private-transactions-lighter-and-faster\/\" data-v-f87c67ca=\"\">Zcash<\/a> and Dogecoin will probably follow in Ethereum's footsteps and eventually transition to proof of stake after the consensus model becomes mature, Buterin said at this year's Mainnet blockchain event.<\/span>","<span data-v-f87c67ca=\"\">\"I'd say should ... as PoS matures I would expect it to increase in legitimacy over time. I hope Zcash moves over and I am hopeful Dogecoin moves to PoS soon,\" Buterin<\/span><a href=\"https:\/\/twitter.com\/MessariCrypto\/status\/1573357374299160578\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">said<\/span><\/a> <span data-v-f87c67ca=\"\">on Friday.<\/span>","<span data-v-f87c67ca=\"\">On Sept. 15, Ethereum went through <a href=\"https:\/\/www.theblock.co\/post\/169299\/ethereum-activates-the-merge-as-it-shifts-to-proof-of-stake\" data-v-f87c67ca=\"\">The Merge<\/a>, a highly anticipated upgrade that swapped its consensus mechanism from proof of work to proof of stake, after years of research and development. According to the Ethereum Foundation, the proof-of-stake transition resulted in a <\/span><a href=\"http:\/\/claims\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">99.9% decline<\/span><\/a><span data-v-f87c67ca=\"\"> in energy consumption, which is expected to dramatically reduce the blockchain’s carbon footprint.<\/span>","<span data-v-f87c67ca=\"\">In line with Buterin’s expectations, the teams behind Zcash and Dogecoin have already expressed interest in moving to proof of stake in separate announcements. <\/span>","<span data-v-f87c67ca=\"\">In mid-2021, Electric Coin Company, the development firm behind Zcash, wrote a <\/span><a href=\"https:\/\/electriccoin.co\/blog\/proof-of-stake-research-overview-1\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\"> detailing its approach and next steps toward implementing PoS. Dogecoin has floated a similar idea. <\/span><span data-v-f87c67ca=\"\">Still, a blockchain consensus switch is easier said than done and requires a nuanced discussion among community members on how the change may impact a network.<\/span>","<span data-v-f87c67ca=\"\">Both Dogecoin and Zcash rank among the top 10 cryptocurrencies by market capitalization that leverage the proof-of-work mode, according to CoinGecko data. While Dogecoin is a meme coin and Zcash a privacy-focused asset, a common feature of the two is their use of specialized mining hardware that requires big power consumption to process new blocks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On the other hand, proof-of-stake consensus makes use of validators who stake assets on the network to affirm their honest behavior in verifying blocks. This diminishes the need to spend on electricity and hardware.<\/span>"],"hashtag":["DOGECOIN","ETHEREUM","VITALIK BUTERIN"]}