{"summary":"As Tether tumbled, Paxos is revamping its platform to solve one of the biggest headaches in stablecoins - redemptions. Paxos, the issuer of stablecoin","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/23030\/stablecoin-pax-can-now-be-redeemed-instantly-on-an-integrated-platform-with-exchange-itbit","publishDate":"2019-05-13T09:05:52","id":1307,"type":null,"title":"PAX can now be redeemed instantly, stoking up competition in stablecoin market","category":["STARTUPS"],"content":["As Tether tumbled, Paxos is revamping its platform to solve one of the biggest headaches in stablecoins - redemptions.","<span data-v-f87c67ca=\"\">Paxos, the issuer of stablecoin Paxos Standard (PAX), announced on Monday that PAX can now be redeemed instantly. This means every PAX deposited on the firm's platform can be immediately sent to a bank as USD.<\/span>","Redemptions have been one of the most persistent problems for stablecoin issuers and investors, with stories constantly surfacing about difficulties for <a href=\"https:\/\/www.coindesk.com\/winklevoss-crypto-gemini-gusd-stablecoin-redemption\" data-v-f87c67ca=\"\">investors withdrawing stablecoins<\/a> and for issuers to <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/04\/gemini-gave-trading-firms-a-stablecoin-discount-and-it-caused-big-headaches-for-one-of-its-rivals\/\" data-v-f87c67ca=\"\">perform KYC compliance<\/a> for every redemption.&nbsp;","<span data-v-f87c67ca=\"\">Paxos' instant redemption was launched to do away with this nuisance. The company's new platform unifies PAX and USD as one single balance shown in USD. There are also no minimal redemption requirements or fees associated with withdrawals or deposits of PAX on this platform.&nbsp;<\/span>","\"We launched PAX with a 1 day redemption window, which was groundbreaking. Then we moved to four-hour windows. Now, we’re setting precedence again by offering immediate redemptions,\" wrote Paxos general manager David Wells in the blog post.&nbsp;","Firms like Paxos and Gemini are known for their redemption headaches. Paxos <a href=\"https:\/\/www.theblockcrypto.com\/2019\/01\/04\/gemini-gave-trading-firms-a-stablecoin-discount-and-it-caused-big-headaches-for-one-of-its-rivals\/\" data-v-f87c67ca=\"\">was criticized by some<\/a> users for its delay in processing redemptions and hassling customers who tried to redeem their PAX. Meanwhile, Gemini <a href=\"https:\/\/www.coindesk.com\/winklevoss-crypto-gemini-gusd-stablecoin-redemption\" data-v-f87c67ca=\"\">allegedly closed accounts<\/a> owned by two OTC trading desks over their attempts to redeem GUSD, Gemini's stablecoin.&nbsp;","<span data-v-f87c67ca=\"\">And then there's Tether, at one point the second-most traded cryptocurrency in the market. The firm was recently entangled in a dispute with New York Attorney General and confirmed that its stablecoin was only 74% backed by cash reserves, an allegation that made a serious dent in Tether's reputation. However, this controversy also leaves space for Paxos and other companies to get ahead. <\/span><span data-v-f87c67ca=\"\">Chang noted that since the news on Tether broke on April 25, the total supply of PAX has surged by $71 million and Paxos' market cap has increased by almost 80% to $193 million.&nbsp;<\/span>","It seems that whoever can substitute Tether to provide the user-friendly, speedy redemption process will be able to bite off the company's $2.7 billion market cap, which is still dominating the stablecoin market. While Tether still charges a fee for fiat withdrawals and has a minimal redemption requirement of $100,000, Paxos' immediate redemption with no minimum or fee and its status as a regulated stablecoin approved by the New York Department of Financial Services is certainly attractive to investors.&nbsp;","<span data-v-f87c67ca=\"\">\"I think the effect of that news (about Tether) is that the market coming to the realization that there is something else out there (other than tethers) and I want to use something that I can trust more,\" said Paxos head of marketing and communications Dorothy Chang.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Besides withdrawals and deposits of PAX, the new platform is also integrated with Paxos’ exchange itBit to support cryptocurrency trading. Previously, itBit was a separate entity running its own products and website. Now Paxos wants to combine them to create a more holistic user experience, according to Chang.&nbsp; <\/span>&nbsp;","Looking into the future, Wells said the new platform would expand to include more crypto assets and services from other companies, such as lending, under one roof.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$71 million","content":"MONEY"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Wells","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Paxos","content":"PERSON"},{"type":"New York Attorney General","content":"ORGANIZATION"},{"type":"$193 million","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"PAX","content":"ORGANIZATION"},{"type":"74%","content":"PERCENT"},{"type":"$2.7 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"OTC","content":"ORGANIZATION"},{"type":"April 25","content":"DATE"},{"type":"Dorothy Chang","content":"PERSON"},{"type":"David Wells","content":"PERSON"},{"type":"Chang","content":"PERSON"}],"hashtag":[],"authors":["Celia Wan","The Block"]}