{"summary":"The Californian blockchain indexing startup The Graph released new tools designed to decentralize the curation of its subgraphs. \nThe company is now one step closer to its goal of providing decentralized blockchain data indexing. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110864\/users-of-the-graph-can-now-earn-money-curating-blockchain-data","publishDate":"2021-07-08T14:13:48","id":1308,"type":null,"title":"Users of The Graph can now earn money curating blockchain data ","category":["Technology"],"content":["<span data-v-f87c67ca=\"\">Blockchain data curation “is now an open, competitive market.” That’s according to The Graph, which today released new features aimed at decentralizing the process of creating and organizing its blockchain indexing tools.&nbsp;&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Graph has become a popular tool among Ethereum developers, who use its Application Programming Interfaces (APIs), which the company calls “subgraphs,” to fetch and consolidate information that is scattered across many different transactions across the Ethereum blockchain and the Interplanetary File System (IPFS).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Among other things, the new tools the San Francisco-based <a href=\"https:\/\/www.theblockcrypto.com\/linked\/69843\/the-graph-5-million-saft-data\" data-v-f87c67ca=\"\">startup<\/a> is launching today will make it easier for users — and even profitable — for users to curate subgraphs. The idea is that this will in turn make it easier for developers to discover useful ones, without the need for a centralized aggregator or publisher.<\/span>","<span data-v-f87c67ca=\"\">Users of <a href=\"https:\/\/www.theblockresearch.com\/the-graph-research-web3-defi-81734\" data-v-f87c67ca=\"\">The Graph<\/a> have already been curating subgraphs, which are built to retrieve specific kinds of data required for a DApp — for instance, the decentralized video streaming service LivePeer — to run smoothly.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But curation will begin “in earnest” on Thursday with the launch of the curation market, Yaniv Tal, co-founder of Edge &amp; Node, which created The Graph protocol, said in a recent interview with The Block.<\/span>","<span data-v-f87c67ca=\"\">The initiative is part of The Graph’s ongoing <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/72790\/ethereum-devs-the-graph\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">efforts to decentralize<\/span><\/a><span data-v-f87c67ca=\"\">. The platform has been transitioning from a centrally hosted service to one that is run by a decentralized network.<\/span>","<span data-v-f87c67ca=\"\">So far, 20,000 developers have built 16,000 subgraphs hosted on The Graph’s centralized hosting service. Eight DApps — <\/span><span data-v-f87c67ca=\"\">LivePeer, Audius, UMA, mStable, Reflexer, Opyn, PoolTogether, DODO — <\/span><span data-v-f87c67ca=\"\">have migrated to The Graph’s decentralized protocol.<\/span>","<span data-v-f87c67ca=\"\">The new curation market is in line with what Tal promised last year after an outage knocked many applications offline. He said that eventually, developers would no longer have to publish their subgraphs directly to The Graph’s hosted service, and that “independent indexers” would “run nodes and process queries in an open marketplace.” He added that “curators” would “organize data and signal which subgraphs are useful and accurate.”<\/span>","<span data-v-f87c67ca=\"\">How does it work in practice? Once a curator finds a good subgraph, they signal on it using Subgraph Studios — The Graph’s new hub for subgraph creation, which also launched Thursday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">An individual signals that a subgraph contains useful information,&nbsp;said Baptiste Greve, product manager at Edge &amp; Node. If others agree on the utility of the subgraph, they too will signal on it. The more signals the subgraph has, the more likely it is to generate query fees that can then be turned into a reward.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“You're incentivized to select good subgraphs that are actually being used,” said Greve.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While The Graph’s release mentions that anyone with a smartphone can now become a curator, Greve notes that an individual will need a Metamask wallet — usually obtained as a computer web browser extension — to receive payment.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While curators on The Graph protocol may earn revenue, Tal stresses that revenue is based on a bonding curve — the relationship between a token supply and price, in which the less token supply, the lower the price and vice versa.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Curators can make or lose money through curation based on the economics of the bonding curve,” Tal said. “So it's important that curators understand the sub graphs that they're signaling on, as well as the dynamics on those bonding curves.”<\/span>"],"hashtag":[]}