{"summary":"The SEC is asking courts to consider a recent Terraform Labs ruling while deciding separate cases brought against Binance and Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270468\/sec-wants-to-leverage-partial-terraform-court-victory-in-cases-against-coinbase-binance","publishDate":"2024-01-04T14:19:25","id":13083,"type":null,"title":"SEC wants to leverage partial Terraform court victory in cases against Coinbase, Binance","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The Securities and Exchange Commission wants to leverage a <a href=\"https:\/\/www.theblock.co\/post\/269579\/new-york-judge-grants-sec-summary-judgement-over-claim-that-terraform-sold-unregistered-securities\" data-v-f87c67ca=\"\">partial win<\/a> in its ongoing court against Terraform Labs in its separate cases against the two largest crypto exchanges, Binance and Coinbase.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a Thursday <a href=\"https:\/\/www.courtlistener.com\/docket\/67478179\/securities-and-exchange-commission-v-coinbase-inc\/?order_by=desc#entry-98\" data-v-f87c67ca=\"\">filing<\/a> involving its case brought against Coinbase, the agency submitted the Terraform Labs court ruling from the Southern District of New York that <\/span><a href=\"https:\/\/www.theblock.co\/post\/269579\/new-york-judge-grants-sec-summary-judgement-over-claim-that-terraform-sold-unregistered-securities\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">granted<\/span><\/a><span data-v-f87c67ca=\"\"> a summary judgment on the claim that UST, LUNA, wLUNA and MIR tokens are securities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"In so doing, the Terraform court resolved in the SEC's favor issues relevant to the <\/span><span data-v-f87c67ca=\"\">consideration of Defendants' motion in this case,\" the SEC wrote, referring Coinbase's earlier motion for a judgment in its favor.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The filing is aimed to further support the SEC's earlier opposition to a Coinbase motion.<\/span>","<span data-v-f87c67ca=\"\">\"Each crypto asset issuer invited investors – including purchasers on Coinbase’s platform – reasonably to expect the value of their investment to increase based on the issuer’s broadly-disseminated plan to develop and maintain the asset’s value (including through a secondary market for resale),\" an SEC attorney <\/span><a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.599908\/gov.uscourts.nysd.599908.69.0.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\"> in October.<\/span>","<span data-v-f87c67ca=\"\">UST, LUNA, wLUNA and MIR tokens are not mentioned in the SEC complaint against Coinbase, which points at a different set of tokens it insists should be deemed unregistered securities, including SOL, ADA, MATIC, FIL, SAND, AXS, CHZ, FLOW, ICP, NEAR, VGX, DASH and NEXO.<\/span>","<span data-v-f87c67ca=\"\">In a parallel lawsuit against Binance, the SEC is also looking to use the Terraform Labs judgment to support its case. In a separate filing on Wednesday, the agency asked a D.C. court to take the Terraform ruling into account while considering Binance's motions to dismiss the case<\/span>","<span data-v-f87c67ca=\"\">\"The court’s analysis of the Terraform defendants' so-called 'stablecoin' UST is particularly relevant to this Court's consideration of Defendants' arguments concerning Binance's so-called 'stablecoin' BUSD, and Defendants' stalking-as-a service, BNB Vault, and Simple Earn programs,\" the Wednesday filing reads.<\/span>","<span data-v-f87c67ca=\"\">Terraform Labs previously used arguments similar to those Binance is using now, the SEC said, trying to \"artificially separate\" selling its tokens from \"developing and promoting\" the Anchor protocol, where the tokens could be staked to generate profit. The situation is similar to that of Binance offering BUSD, together with staking-as-a-service, BNB Vault, and Simple Earn program, the SEC said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That \"provides further grounds for this Court to deny Defendants' motions to dismiss,\" the agency wrote.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In November, Binance and its former CEO Chanpeng Zhao <\/span><a href=\"https:\/\/www.theblock.co\/post\/264013\/binance-us-press-conference-settlement\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">agreed<\/span><\/a><span data-v-f87c67ca=\"\"> to settle criminal charges with the Department of Justice and plead guilty to violating the Bank Secrecy Act, knowingly failing to register as a money transmitting business, and facilitating sanctions evasion. The company agreed to pay an unprecedented $4.3 billion penalty and appoint a new CEO and an external monitor.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SEC's lawsuit against Binance for allegedly operating an unregistered securities exchange is still ongoing. The agency <\/span><a href=\"https:\/\/www.theblock.co\/post\/233154\/sec-files-suit-against-binance\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sued<\/span><\/a><span data-v-f87c67ca=\"\"> the largest exchange in June, alleging that Binance and affiliated companies repeatedly lied to customers and misdirected funds to a separate investment fund owned by Zhao. Over the past seven months, Binance <\/span><a href=\"https:\/\/www.theblock.co\/post\/267334\/binance-pushes-for-clarity-on-investment-contract-claims-in-attempt-to-dismiss-sec-suit\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed multiple motions<\/span><\/a><span data-v-f87c67ca=\"\"> to dismiss the case.<\/span>","<span data-v-f87c67ca=\"\">The SEC declined to comment on the filings. Coinbase and Binance did not immediately reply to requests for comment.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FIL","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"ICP","content":"LOCATION"},{"type":"Court","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Chanpeng Zhao","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"NEXO","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"ADA","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"D.C.","content":"LOCATION"}],"hashtag":["SEC"],"authors":["Anna Baydakova","The Block"]}