{"summary":"Ethereum’s Layer 2 solutions (L2s) experienced a surge in mainnet publishing fees during May, reaching nearly 9000 ether or $16.2 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232367\/ethereum-layer-2-solutions-fees","publishDate":"2023-05-26T11:46:06","id":13085,"type":null,"title":"Ethereum Layer 2s soar to new high in L1 publishing fees, crossing $16M","category":["CRYPTO ECOSYSTEMS"],"content":["May proved to be a significant month for Ethereum’s Layer 2 networks, as the costs for publishing data and security proofs back to the main Ethereum network climbed to a new all-time high of 9000 Ether (ETH), equivalent to $16.2 million, even with a few days left in the month.","This development marks a five-fold increase from the total fees paid by L2s in January 2023, according to <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\" data-v-f87c67ca=\"\">data<\/a> from The Block.","In the Layer 2 landscape, Arbitrum emerged as the leading contributor in mainnet publishing fees, incurring costs of 4260 ETH, or approximately $7.6 million. Meanwhile, zkSync’s Era mainnet, a product of ZK-Rollup technology, followed closely with 2250 ETH, equivalent to $4 million, securing its place at the second position.","Notably, <a href=\"https:\/\/www.theblock.co\/post\/222596\/zksync-era-first-zkevm-goes-live-in-major-development-for-ethereum\" data-v-f87c67ca=\"\">zkSync Era<\/a> surpassed Optimism, another well-known Layer 2 solution, in performance for the first time. It’s noteworthy that <a href=\"https:\/\/www.theblock.co\/post\/230898\/optimism-mainnet-bedrock-upgrade\" data-v-f87c67ca=\"\">Optimism<\/a> has consistently held a position within the top two regarding fee collection since the previous year. The recently observed fee structure represents a new peak in Layer 1 publishing costs across all three of the most widely used L2 networks.","This data fees spike is attributed to the rising transaction fees on the Ethereum mainnet during the month. “The fees paid by L2s for publishing data to Ethereum have already hit a new high in May. The rise in gas costs we’ve seen has made publishing more costly,” Rebecca Stevens, research analyst at The Block, noted.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/ethereum-layer-2-l1-data-fees\/embed\" title=\"Ethereum Layer 2 L1 Data Fees\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In May, Ethereum's average transaction fees <a href=\"https:\/\/www.theblock.co\/post\/229508\/ethereum-gas-price-high-memecoin-hype\" data-v-f87c67ca=\"\">hit levels<\/a> last seen the previous year. In this context, Layer 2 solutions, which are based on rollup technologies, are particularly useful. They process transactions off the main Ethereum blockchain, thereby providing a more affordable method for transaction execution.","These rollups are required to publish security proofs and other metadata to the Ethereum mainnet, using revenue generated from users’ transaction fees. However, the publishing fees incurred would still be significantly cheaper compared to those on the mainnet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Rebecca Stevens","content":"PERSON"},{"type":"$16.2 million","content":"MONEY"},{"type":"$4 million","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$7.6 million","content":"MONEY"},{"type":"January 2023","content":"DATE"}],"hashtag":["ARBITRUM","ETHEREUM","ZKSYNC"],"authors":["Vishal Chawla","The Block"]}