{"summary":"Aleo Foundation Executive Director Alex Pruden says there are a few final bugs to solve before the network can go live.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274575\/aleo-mainnet-set-to-come-within-weeks-with-lofty-goal-of-bringing-privacy-to-crypto","publishDate":"2024-01-25T14:40:02","id":13098,"type":null,"title":"Aleo mainnet set to come within weeks with lofty goal of bringing privacy to crypto","category":["CRYPTO ECOSYSTEMS"],"content":["The Aleo mainnet is set to launch in the next few weeks, once some final bugs have been squashed, in a bid to bring privacy to crypto transactions.","\"We just finished the third phase of testnet three and have a list of bugs that we discovered through that process. We got the list of bugs from six audits that we've done and two bug bounty programs,\" said Aleo Foundation Executive Director Alex Pruden.","Pruden emphasized the struggle in getting to this point over the last four years, particularly re-engineering the network's consensus algorithm after the second testnet because it wasn't working. \"But the good news is we're at the very end of that journey and we're getting ready to launch imminently,\" he said.","Aleo's origins begin with an academic paper in 2018 written by several of the Zcash co-founders and co-authors of the paper that it's based on. The core idea was to extend Zcash's private transactions into the world of smart contracts. Pruden said that while some teams tried and failed to build out the idea, it was one of the paper's co-authors, Howard Wu, who ended up actually doing so, forming Aleo and becoming its CTO.","Pruden, a former partner at crypto VC firm a16z, was Aleo's CEO until December. At that point, the company split in two, forming a foundation that he would take charge of. That's a move that many crypto companies have done ahead of a token issuance, something that Aleo is planning to do.","Pruden said that the motivation for launching Aleo was to bring privacy to crypto, with the goal of unlocking use-cases around confidential payments (like paying salaries for instance) and identity solutions.&nbsp;","\"Despite all the use-cases that people cite — I've been on both the investment side and the operating side when people talk about digital identity and all this stuff — reality is, none of that exists today in any real volume,\" he said. \"The core belief of this team is that without some level of privacy, this technology isn't going to be practical or useful for anything other than a variant of casinos.\"","To achieve this level of privacy, Aleo uses zero-knowledge proofs at the core blockchain level to support transactions and smart contract interactions that are private by default. This means the sender and transaction information is hidden from public view. However, the chain does allow for transactions to be made that show this information.","While there have been challenges for privacy coins — with exchanges delisting them in light of regulatory pressure — Pruden maintains that it's up to projects like Aleo to advocate for this kind of technology. He noted that it has advantages, such as the ability to prove that a crypto address isn't on a blacklist before sending it money.","Pruden said his short term goal was for Aleo to support real applications that people use everyday, which can't be done in any other form — with real activity driven by these applications. His longer term dream is that this technology \"gets integrated into the broader fabric of the web.\"","As seen with technologies like Signal, focusing heavily on privacy can be a challenge when trying to ensure a good user experience.","One potential issue is that zero-knowledge proofs are difficult to generate. To get past this, any user of the Aleo network calculates their own proofs offline for their transactions before making them. This avoids submitting the whole calculations onto the chain, something that would be very expensive on blockchains like Ethereum, Pruden said.","This has the drawback of being a bit slower, even if it's cheaper. Currently a simple transaction takes under a second on a laptop to generate but can be up to 20 seconds on a device like a mobile phone. Yet Pruden argued that a few years ago, these proofs would have taken months to generate — showing the speed of development in this space, and suggesting that things will get quicker in the near future.","There is a side benefit to using zero-knowledge proofs at the blockchain layer, Pruden noted. This enables Aleo to support Layer 2s rollups that rely on zero-knowledge proofs (one of the two main types of rollups) to prove that all transactions are genuine. While he said there hasn't been much work done on this yet, he said this would be a natural extension of the technology. After all, he noted, you could argue any transaction made on Aleo is already a rollup.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last four years","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Zcash","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Aleo Foundation Executive","content":"ORGANIZATION"},{"type":"Alex Pruden","content":"PERSON"},{"type":"Pruden","content":"PERSON"},{"type":"Howard Wu","content":"PERSON"},{"type":"Aleo","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"}],"hashtag":["CRYPTO","DECENTRALIZED INFRASTRUCTURE"],"authors":["Tim Copeland","The Block"]}