{"summary":"“If you ever were to need an accelerator, it&#x27;s probably in a bear market,” said Jamie Burke, founder and CEO of Outlier Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195661\/outlier-ventures-jamie-burke-web3-accelerator","publishDate":"2022-12-22T03:00:15","id":13092,"type":null,"title":"Winter-weary crypto startups find refuge in Jamie Burke&#x27;s web3 nursery","category":["DEALS"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">Outlier Ventures is an outlier in every sense of the word.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Built out in the U.K. rather than Sand Hill Road, Jamie Burke and his team have taken 187 early-stage web3 startups under their wing since it started running an accelerator program in 2019.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“W<\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">e grew that out of the U.K., we weren't in Silicon Valley,” Burke said. “We weren't a bunch of seasoned VCs, or serial founders, we weren't the obvious place that would have built what we built and from where we built it.\"<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Burke launched Outlier in 2014 after working as a lead digital strategist at advertising agency WPP and running his own digital consultancy. Like other startup accelerators, it provides mentorship, support and limited funding to very early-stage startups in exchange for equity.&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Even amid a brutal bear market, 2022 has been Outlier’s biggest year. It has grown headcount <\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">from around 40<\/span> <span data-contrast=\"none\" data-v-f87c67ca=\"\">to 100 people. It’s also had 89 startups pass through its doors across its <a href=\"https:\/\/outlierventures.io\/base-camp\/\" data-v-f87c67ca=\"\">base camp<\/a> and <a href=\"https:\/\/outlierventures.io\/ascent\/\" data-v-f87c67ca=\"\">ascent programs<\/a>, Burke said.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“We've gone through a big growth spurt this year, deliberately obviously, and perhaps counter to the wider narrative,” Burke said.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“This was the first year where we said, irrespective of markets, we're growing,” he added. “Firstly, we want to be banking these startups. Now’s a great time to do great deals but we know that there will be another bull run, we know the cycle, we’ve been through several now. We want to build a business at scale that when that time comes, we're really ready to go to the next level.”<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Next year’s <a href=\"https:\/\/outlierventures.io\/base-camp\/\" data-v-f87c67ca=\"\">accelerator program<\/a> is equipped to have 50 teams a quarter if needed. The specific programs running in the first quarter include a Filecoin basecamp, a Polygon basecamp, a basecamp focused zero-knowledge proof technology and a protocol agnostic basecamp.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\"> Each basecamp is three months long, providing startups with in-house support from operations to legal.<\/span>","Outlier's&nbsp;<a href=\"https:\/\/outlierventures.io\/portfolio\/\" data-v-f87c67ca=\"\">existing portfolio<\/a> includes startups such as Boson Protocol, Metropolis, Rand Network and Auki Labs. It is, by its nature, a portfolio chock-full of very early-stage players — and it will be some time yet before Burke gets to see how those bets pan out.","\"It is too early to say what our biggest success stories will be as of yet, but thus far, projects like <a href=\"https:\/\/www.iota.org\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"0\" data-v-f87c67ca=\"\">Iota<\/a> and <a href=\"https:\/\/fetch.ai\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"1\" data-v-f87c67ca=\"\">Fetch<\/a>, which are some of our more mature networks, have already achieved great success,\" Burke said.","The firm generates revenue from enterprise partners such as FarFetch and Polygon, who pay to participate in the accelerator program, Burke said. The majority of revenue, however, comes from successful venture bets.","\"Whilst we always try to run a particular accelerator programme at a cash profit, we are predominantly there as investors to unlock the 6% equity and token share,\" said Burke, who noted that Outlier still holds 90% of their holdings from the last eight years.","\"Given that the majority of the startups we have invested in are relatively recent, subsequent to our significant growth over the last couple of years, most of our projects are too immature as networks for us to realize gains from,\" he added. \"However, we have been profitable every year of Outlier Ventures’ existence, and the overall performance of our capital deployed is 230x.\"","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Despite this year’s significant growth, there are some headwinds for Burke’s accelerator program heading into 2023: competition is heating up between web3 accelerators precisely because of the punishing market conditions.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“If you ever were to need an accelerator, it's probably in a bear market,” Burke said.<\/span>","<span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">One of the primary reasons startups fail is because of product-market fit, Burke said. <\/span>Accelerators help startups navigate that path, which can be critical when the funding environment gets tough. Historically, Outlier's miss rate has been relatively low, according to Burke, who claims that fewer than 5% of projects Outlier has worked with have failed.","\"If we are subject to a prolonged bear market, we can expect to witness this figure rise as projects face difficulties with raising capital,\" Burke said. \"However, if we witness this increasing to sub-10%, this is still the opposite of early stage venture, where 90% normally fail in their first couple of years.\"","<span data-contrast=\"none\" data-v-f87c67ca=\"\">On the other hand, the spectacular collapse of crypto exchange FTX has slowed the amount of institutional capital coming into the industry, Burke said. At the later-stages, there’s less money in the system and at the early-stages deployment is slower and due diligence is taking longer.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“What we're seeing at the accelerator is record inbounds in terms of absolute numbers across all programs,” he said. “We're seeing the quality of founder quite dramatically improve. Serial founders, many crossing over from solid careers and web2 to tackle particular industry verticals and we're seeing a huge amount of interest from enterprise partners.”<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">In the past Burke needed to turn away enterprise partners because they were not ready to work with Outlier at&nbsp;scale. Even in the face of FTX, many are now approaching Outlier with very clear strategies, which is the most material change, he said.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">It’s not just Burke seeing an increase in inbound requests. Andreessen Horowitz recently announced that it <a href=\"https:\/\/www.linkedin.com\/posts\/a16zcrypto_we-received-8000-applications-for-our-2023-activity-7004521867478786048-ycKE?utm_source=share&amp;utm_medium=member_desktop\" data-v-f87c67ca=\"\">received<\/a> over 8,000 applications for its rebooted crypto startup school. Burke isn’t phased by the increased competition as most of the venture firms launching web3 accelerators or incubators operate at the later stages.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Outlier is the opposite; it aims to filter and de-risk investments for later stage investors. The check sizes are modest with the average being around $100,000 but it makes up for it in support and due diligence providing guidance on areas such as tokenomics and go-to-market strategies. <\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">Each startup in a program has a support ratio of around two and half people, Burke said.<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559685&quot;:0,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I expect more and more people to try to come into our space,” he added. “It is on us to continue to deliver our service, to hit homeruns [and] to de-risk investments for our co-investors.”<\/span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"sub-10%","content":"PERCENT"},{"type":"Jamie Burke","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"U.K.","content":"LOCATION"},{"type":"last eight years","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Auki Labs","content":"ORGANIZATION"},{"type":"Rand Network","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Burke","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Sand Hill Road","content":"LOCATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"WPP","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED","STARTUP ACCELERATORS"],"authors":["Kari McMahon","The Block"]}