{"summary":"A “yes” vote was meant to: “Enact special margin requirements for large whales that represent over 20% of borrows and grant emergency power to Solend Labs to temporarily take over the whale’s account so the liquidation can be executed OTC.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/152960\/solend-users-vote-in-favor-of-proposal-to-mitigate-risk-imposed-by-whale","publishDate":"2022-06-19T10:56:36","id":13094,"type":null,"title":"Solend users vote in favor of proposal to mitigate risk imposed by ‘whale’","category":["GOVERNANCE"],"content":["Users of Solend, a decentralized protocol for lending and borrowing on Solana, today voted overwhelmingly in favor of a proposal aimed at mitigating risk imposed by a specific user with a big margin position on Solend.","The <a href=\"https:\/\/realms.today\/dao\/7sf3tcWm58vhtkJMwuw2P3T6UBX7UE5VKxPMnXJUZ1Hn\/proposal\/HuaL6cDtuNtfnJgvwMnYiZDHVCoLAuDtVFgJD8kYChJ4\" data-v-f87c67ca=\"\">proposal<\/a> to “mitigate risk from the whale” noted that the user in question had 95% of SOL deposits in the protocol’s main pool and had not been heard from in 12 days, among other points.","If SOL were to drop to $22.30, the proposal said, the whale’s account would become liquidatable for as much as 20% of borrowings, which would be difficult for the market to absorb and in the worst case, Solend could end up with bad debt. This could cause chaos and put a strain on the Solana network.","The proposal’s authors said they had been unable to get the whale to reduce the risk, so it was clear that action had to be taken, and hence the vote.","A “no” vote was to do nothing, while a “yes” vote was meant to: “Enact special margin requirements for large whales that represent over 20% of borrows and grant emergency power to Solend Labs to temporarily take over the whale’s account so the liquidation can be executed OTC.”","The proposal also noted that emergency powers granted by a “yes” vote would be revoked once “whale’s account reaches a safe level.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$22.30","content":"MONEY"},{"type":"SOL","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"95%","content":"PERCENT"}],"hashtag":["DAOS","SOLANA"],"authors":["Mike Millard","The Block"]}