{"summary":"NY federal court enjoins issuance of GRAMS promised in Telegram’s $1.7 billion SAFT offering\nCourt finds that the token issuance likely violates U.S. securities laws under established precedent\nOrder is interim but likely to be reduced to a permanent injunction","author":["Stephen Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/59831\/court-in-telegram-case-blocks-gram-token-issuance-says-token-distribution-likely-violates-securities-law","publishDate":"2020-03-24T19:08:02","id":1310,"type":null,"title":"Court in Telegram case blocks gram token issuance, says token distribution likely violates securities law","category":["Cryptocurrency"],"content":["The $1.7 billion 2018 fundraising effort by Telegram hit a major snag today when a Federal Judge in New York <a href=\"https:\/\/www.scribd.com\/document\/453109383\/TG-Order\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">issued a preliminary injunction<\/a> ruling finding that distribution of the \"GRAM\" token would violate U.S. securities laws. In particular, the Court ruled that \"considering the economic realities under the Howey test, the Court finds that, in the context of that scheme, the resale of Grams into the secondary public market would be an integral part of the sale of securities without a required registration statement.\"","Applying the well-established&nbsp;<em data-v-f87c67ca=\"\">Howey&nbsp;<\/em>test to the facts and circumstances of the fundraising effort, the Court further found that \"reasonable purchasers would not be willing to pay $1.7 billion to acquire Grams merely as a means of storing or transferring value. Instead, Telegram developed a scheme to maximize the amount initial purchasers would be willing to pay Telegram by creating a structure to allow these purchasers to maximize the value they receive upon resale in the public markets.\"","The GRAM tokens were offered in a so-called SAFT document, or \"Simple Agreement for Future Tokens.\" The concept was that while the SAFT was itself an investment contract and a security, the future tokens when offered for use on a functional network would not be. This is the first major federal court ruling to analyze this issue and if other courts follow suit it may create significant roadblocks for other SAFT issuers.","In conclusion, the Court rules that","The Court finds that the SEC has shown a substantial likelihood of success in&nbsp;proving that the Gram Purchase Agreements, Telegram’s implied undertakings, and its&nbsp;understandings with the Initial Purchasers, including the intended and expected resale of Grams&nbsp;into a public market, amount to the distribution of securities, thereby requiring compliance with&nbsp;section 5. Telegram has failed to establish an exemption to the registration requirement under&nbsp;either section 4(a)(2) or Rule 506(c). Further, the Court concludes that the SEC has shown that&nbsp;the sale and imminent delivery of Grams represent a single ongoing violation of section 5. The&nbsp;Court also finds that the delivery of Grams to the Initial Purchasers, who would resell them into&nbsp;the public market, represents a near certain risk of a future harm, namely the completion of a public&nbsp;distribution of a security without a registration statement. An injunction, prohibiting the delivery&nbsp;of Grams to the Initial Purchasers and thereby preventing the culmination of this ongoing violation,&nbsp;is appropriate and will be granted.","While a preliminary injunction is not a *final* order or end to the case it is a significant milestone and suggests that the Court is likely to ultimately enter a permanent injunction as well. Telegram will likely take an appeal of this order to the second circuit. &nbsp;This observer believes that it will be unlikely to succeed."],"hashtag":[]}