{"summary":"Crypto social media apps saw significant growth this year, in terms of technology, adoption and innovation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265688\/how-crypto-social-media-apps-developed-over-the-last-year","publishDate":"2023-12-26T11:49:02","id":13101,"type":null,"title":"How crypto social media apps developed over the last year","category":["CRYPTO ECOSYSTEMS"],"content":["This year marked a big step forward for a new wave of crypto social media apps, as some opened access while others saw considerable traction.","There are broadly two categories of such apps, with some amount of overlap. The first is what's called \"decentralized social\" and includes social media apps that operate over a decentralized network in an effort to give more control over the application to its users and avoid having an overarching centralized entity in charge.&nbsp;","The second category is known as \"social finance,\" where applications imbed crypto functionality in a very direct way, bringing monetization into the heart of the app. FriendTech led the way for these types of apps.","As decentralized social apps rely on complex infrastructure that is still being developed, these apps have typically had restrictions on new users. Yet as these platforms became more confident, they started opening their doors to a wider audience.","For instance, decentralized social media app Farcaster, where Ethereum co-founder Vitalik Buterin spends most of his time, <a href=\"https:\/\/danromero.org\/farcaster-permissionless\/\" data-v-f87c67ca=\"\">became fully permissionless<\/a> in October, meaning anyone can use the platform.","\"This year took [decentralized social] from alpha to beta phase where both Lens and Farcaster are graduating to a more open and ready-for-scale phase that will make 2024 the year for seeing what the actual user demand is as we move away from whitelists and tight quotas,\" said Joonatan Lintala, CEO of Phaver, a social media platform built on Lens.","\"What went badly in a way is that it took this long to get there but bear markets are for building, so timing should actually be good. Now it's up to Phaver and other user-layer apps to figure out how to put these graphs to good use and really add value to users, including those outside the crypto bubble,\" he added.","While Lens hasn't opened its doors fully, it made considerable progress this year. In April, it <a href=\"https:\/\/www.theblock.co\/post\/228787\/lens-protocol-renames-scaling-solution-bonsai\" data-v-f87c67ca=\"\">launched Momoka<\/a>, enabling it to move a lot of the data storage away from the Polygon blockchain that it runs on. This was a move designed to enhance its scalability. In July, it <a href=\"https:\/\/www.theblock.co\/post\/239858\/lens-protocol-version-2-open-actions-erc-6551\" data-v-f87c67ca=\"\">introduced a second version of its protocol<\/a>, providing a wider array of functions.","While decentralized social platforms kept expanding slowly, social finance platforms appeared and took off with a bang.&nbsp;","FriendTech was the original app with this specific blend of financial engineering. It provides a space where users can buy keys that give them access to influencers' closed group chats. The price of the keys are on a bonding curve, meaning the more that are bought, the more expensive they get. And the kicker? There's a 10% fee on each transaction, split between the platform's creator and the influencer.","This financial incentive model created a lot of speculation. Since it went live in August, it has seen 843,000 users spend a total of $267 million of ether among 12 million transactions, according to a <a href=\"https:\/\/dune.com\/cryptokoryo\/friendtech\" data-v-f87c67ca=\"\">Dune dashboard<\/a> created by a data analyst known as Crypto Koryo. This has resulted in $59 million of fees being generated, half of which were spread among its user base, according to <a href=\"https:\/\/defillama.com\/protocol\/friend.tech\" data-v-f87c67ca=\"\">DefiLlama<\/a>. While activity has waned over the last couple of months, the platform still has $35 million of value locked in its smart contracts.","\"The big growth we saw at its peak in September was spectacular. Again, in the absence of new retail and in the bear market, for a short period, FriendTech was able to generate more revenue than the biggest DeFi protocols such as Uniswap, Lido and even the Ethereum chain itself,\" noted Crypto Koryo.","The activity was driven by two themes. First, users were looking to make a quick buck by buying keys and selling them at higher prices. The bonding chain mechanism meant that prices could get expensive quickly, providing potentially high returns, with the risk of losing money through bad trades and high fees. One user known as Vombatus <a href=\"https:\/\/dune.com\/cryptokoryo\/friend-tech-highest-earners\" data-v-f87c67ca=\"\">made nearly $2 million<\/a> by accumulating their own keys and then eventually <a href=\"https:\/\/dune.com\/queries\/3064450\/5103064\" data-v-f87c67ca=\"\">dumping<\/a> them all in one go on those who had also bought their keys.","The second was the presumption that the platform would have an airdrop at some point based on activity. This notion was supported by the platform's points system, which awarded points to users based on their activity, something that many users speculated would be used to determine eligibility for the potential airdrop. So far, one has not taken place.","\"It was interesting to observe the behavior of different cohorts once FriendTech went 'mainstream.' After most of 'Crypto Twitter' was in, we started to see non-crypto native cohorts joining, such as OnlyFans members, musicians (including Pussy Riot), sports figures and even Web2 media companies,\" Crypto Koryo added. \"This is because monetization is an issue for content creators in Web2 as well as in Web3.\"","Following FriendTech's success, other platforms cropped up to provide similar offerings. Avalanche-based Stars Arena was one of the most popular but, after it suffered a <a href=\"https:\/\/www.theblock.co\/post\/255337\/stars-arena-drained-of-2-9-million-in-avax-tokens-funds-in-user-wallets-are-safe\" data-v-f87c67ca=\"\">$2.9 million exploit<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/260100\/socialfi-platform-stars-arena-loses-another-team-member-after-ceo-steps-down\" data-v-f87c67ca=\"\">internal team rifts<\/a>, it struggled to regain momentum. Other apps like <span data-v-7de5a6d6=\"\" data-v-f87c67ca=\"\">Bitcoin Layer 2 NOS-based New Bitcoin City<\/span> offered <a href=\"https:\/\/www.theblock.co\/post\/256392\/social-finance-platforms-experiment-with-new-features-in-bid-to-dethrone-friendtech-or-even-x\" data-v-f87c67ca=\"\">far more functionality<\/a> than FriendTech, but none managed to attract a similar user base. These apps now see far lower numbers of daily transactions, while FriendTech maintains its lead.","<span data-v-f87c67ca=\"\">StarsArena had more transactions than FriendTech per day at its peak but it didn't last. Image: Dune Analytics\/Crypto Koryo.<\/span>","While bringing decentralization and crypto into social media has been challenging —&nbsp;both technically speaking and in terms of creating sustainable financial mechanisms — there does seem to be a potential audience.&nbsp;","\"Blockchains being payment rails means Web3 social networks can reward users globally without needing platforms to tap into user data or run advertisements,\" Saurabh Deshpande, a researcher at crypto newsletter Decentralised.co,&nbsp;<a href=\"https:\/\/twitter.com\/desh_saurabh\/status\/1720043419962310984\" data-v-f87c67ca=\"\">noted<\/a>&nbsp;on X.&nbsp;","Deshpande added that the core concept of a social network that compensates users for the content they post does have value.","\"We’re not there yet, but gradually, we’ll get there by leveraging features like ownership, composability, permissionless access, and censorship resistance,\" he said.&nbsp;","<em data-v-f87c67ca=\"\">Update: Removed chart showing Lens users as data was only partially complete.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$267 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Dune Analytics\/Crypto Koryo","content":"ORGANIZATION"},{"type":"$59 million","content":"MONEY"},{"type":"FriendTech","content":"ORGANIZATION"},{"type":"Momoka","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Crypto Twitter","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Joonatan Lintala","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"New Bitcoin City","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Crypto Koryo","content":"ORGANIZATION"},{"type":"Saurabh Deshpande","content":"PERSON"},{"type":"Uniswap","content":"LOCATION"},{"type":"$2.9 million","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Stars Arena","content":"ORGANIZATION"}],"hashtag":["FARCASTER","FRIENDTECH","LENS"],"authors":["Tim Copeland","The Block"]}