{"summary":"The SEC has claimed in court documents that Binance and Binance.US redirected billions in customer assets to investment funds controlled by owner Changpeng Zhao.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233652\/sec-binance-and-us-affiliate-redirected-billions-in-customer-assets-to-zhaos-funds","publishDate":"2023-06-07T21:21:07","id":13103,"type":null,"title":"SEC: Binance, US affiliate redirected billions in customer assets to Zhao&#x27;s funds","category":["POLICY"],"content":["The Securities and Exchange Commission has accused Binance and Binance.US of redirecting over $12 billion in customer assets to entities controlled by Binance founder and owner Changpeng ‘CZ’ Zhao between 2019 and 2021.","The fresh SEC allegations come as supporting evidence in a <a href=\"https:\/\/www.scribd.com\/document\/651445641\/SEC-Motion-to-File-Brief-of-Excess-Pages-in-Support-of-TRO\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">request<\/a> by the agency to a federal judge to place a temporary freeze on assets, beyond customer redemptions, at Binance.US.","The SEC also wants a judge to freeze Binance and Zhao's assets but has only filed a temporary restraining order on Binance.US's assets.","Spokespeople for Binance and Binance.US did not immediately provide comment. In a <a href=\"https:\/\/www.binance.com\/en\/blog\/ecosystem\/sec-complaint-aims-to-unilaterally-define-crypto-market-structure-8707489117122437402\" data-v-f87c67ca=\"\">lengthy statement<\/a> in response to the SEC's initial enforcement action, Binance said, \"We <span class=\"richtext-text css-6hm6tl\" data-bn-type=\"text\" data-v-f87c67ca=\"\">intend to defend our platform vigorously.\"<\/span>","In a <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1666848861497831449?s=20\" data-v-f87c67ca=\"\">tweet<\/a> posted Thursday, Zhao only addressed the Binance.US portion of the allegation.","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"To the best of my knowledge, Binance.US <\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">had in total roughly $2 billion in user funds,\" he said, referencing part of the allegation that his trading platforms redirected customer funds to his own investment firms. \"This number in USD equivalent fluctuates a little as crypto prices change. And declining as users withdraw due to recent news.\"<\/span>","The tweeted statement did not address the evidence presented to support allegations of market manipulation, uncertain collateral for assets traded on the U.S. platform, lying to customers about custody practices, or other claims made in the SEC's court filings.","The agency accusation — buried in a document filed in federal court late on Tuesday — comes from an analysis of documents from accounts held by Binance, Binance.US, and Zhao at Silvergate and Signature Banks.","The banks produced the documents for the SEC,&nbsp; and an analysis of the accounts was submitted to the U.S. District Court of the District of Columbia <a href=\"https:\/\/www.scribd.com\/document\/651444470\/Testimony\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">as sworn testimony<\/a> by Sachin Verma, the assistant chief accountant for the SEC's Enforcement Division.","Lawyers for the SEC alleged that most of the assets were funneled to Merit Peak. The agency quotes a statement by Merit Peak describing itself as “a proprietary trading firm with [Zhao’s] self-made wealth from the digital asset business.”","\"Those funds consisted in significant part of Binance Platforms customers' assets, including those of <a class=\"c-link\" href=\"http:\/\/Binance.US\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/Binance.US\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Binance.US<\/a> Platform customers and other sources,\" the SEC alleges. In total, the agency claims over $12 billion of the $22 billion Merit Peak received between 2019 and 2021 came from Binance and Binance.US customer assets.","Per the SEC's court statement, the $11 billion from Binance customer assets was funneled through another entity called Key Vision Development Limited.","Using Merit Peak's bank documents, the SEC alleges that most of Merit Peak’s money — $21.6 billion out of approximately $22 billion — went to a foreign affiliate of the firm Paxos, the New York-based trust company that partnered with Binance on the BUSD stablecoin.","Paxos ceased issuing the stablecoin after disclosing an SEC investigation in February, though the company still redeems the token. In a statement provided to The Block, a Paxos spokesperson distanced the company from Binance and said the New York trust company will \"continue working with all government efforts to bring bad actors to justice.\"","\"<span id=\"m_-7634568265500316902gmail-docs-internal-guid-29e5b2c0-7fff-919e-a9df-526d2c43908f\" data-v-f87c67ca=\"\">In February 2023, Paxos announced its decision to end its relationship with Binance and has since been successfully winding down all business relationships with Binance. The complaint against Binance does not allege any wrongdoing by Paxos,\" the emailed statement read. <\/span>","Merit also traded on Binance.US, according to the SEC.","“However, the SEC has been unable to determine why a Zhao-controlled entity that was purportedly trading on the Binance.US &nbsp;Platform using Zhao’s personal funds would have acted as a 'pass through' account for billions of dollars of Binance Platforms customers’ funds,” the SEC told the court.","The SEC filed hundreds of pages of documents supporting its case against Binance overnight that contain more details about how Binance, Binance.US, and Zhao's proprietary trading funds allegedly operated.","The same filing that makes the accusation around using customer funds for Zhao’s personal gain also details that the SEC has been investigating Binance.US since at least 2020, pre-dating current SEC Chair Gary Gensler’s tenure at the agency's helm.","The markets regulator says it issued a subpoena to the U.S. affiliate on Dec. 17, requesting documents related to how the company controlled and stored its crypto assets. But the agency says that Binance.US stonewalled them for years, with a final response in February 2023.","“Its answers were not reassuring,” SEC lawyers say.","The SEC alleges that Binance controlled Binance.US crypto assets as the U.S. affiliates custodian, despite public assurances that separation exists between the two companies. That information comes partly from Binance.US’s own auditor, which says that Binance held custody of its U.S. affiliate’s assets until Dec. 1, 2022.","The auditor warned that the arrangement made it \"very difficult\" to ensure the company had enough assets to pay customers if they withdrew from their accounts.","“The audit report did not make clear who has custody and control of those U.S. customer assets since December 1, 2022,” the SEC says.","Those details are included in hundreds of pages of documents, including internal Binance documents and partial testimony from former Binance.US CEOs. On Tuesday, the agency filed for a temporary restraining order on the movement of assets from Binance.US, except for customer redemptions.","The amount that SEC lawyers accuse Binance and Binance.US of illegally redirecting exceeds the approximately $8 billion in customer assets one-time Zhao rival Sam Bankman-Fried is accused of redirecting from failed trading platform FTX to the now-failed exchange's sister company, Alameda Research.","Bankman-Fried has been criminally charged for redirecting billions of customer funds to backfill losses at Alameda, which he also owned.","Before his indictment and arrest, Bankman-Fried — who at one point accepted investment from Binance — told a reporter that his company wasn't the only one who used customer funds for their own purposes.","\"[M]ost exchanges did some variant on what we did--just not as big and without the run on the bank (at least recently) and more intentionally,\" he said in a <a href=\"https:\/\/www.vox.com\/future-perfect\/23462333\/sam-bankman-fried-ftx-cryptocurrency-effective-altruism-crypto-bahamas-philanthropy\" data-v-f87c67ca=\"\">November 2022 Twitter DM exchange<\/a>.","Bankman-Fried is scheduled to stand trial in October for criminal charges related to the misuse of customer funds. If found guilty on all current charges, he faces over 100 years in prison. The SEC has also sued Bankman-Fried on civil fraud charges.","<em data-v-f87c67ca=\"\">UPDATE: This story has been updated with comment from Paxos and a tweeted comment from Zhao.&nbsp; <\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 1, 2022","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"$21.6 billion","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Binance Platforms","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$22 billion","content":"MONEY"},{"type":"November 2022","content":"DATE"},{"type":"$2 billion","content":"MONEY"},{"type":"U.S. District Court of the District of Columbia","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Sachin Verma","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Enforcement Division","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"$11 billion","content":"MONEY"},{"type":"Dec. 17","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$12 billion","content":"MONEY"},{"type":"Paxos","content":"ORGANIZATION"},{"type":"December 1, 2022","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Key Vision Development Limited","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["BINANCE","FTX","LAWSUITS"],"authors":["Colin Wilhelm","The Block"]}