{"summary":"MakerDAO delegates are holding an emergency vote on a proposal by which to stabilize dai during market upheavals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219781\/makerdao-limit-dai-volatility-market-emergencies","publishDate":"2023-03-14T13:57:28","id":13107,"type":null,"title":"MakerDAO voting to limit dai volatility during market emergencies","category":["CRYPTO ECOSYSTEMS"],"content":["MakerDAO delegates are voting on a proposal to introduce a debt ceiling breaker for collateral assets used to mint dai — to prevent situations where the protocol's stablecoin is adversely impacted by market turbulence.","The emergency <a href=\"https:\/\/vote.makerdao.com\/executive\/template-executive-vote-emergency-psm-changes-march-14-2023#proposal-detail\" data-v-f87c67ca=\"\">vote<\/a>, if passed, will enable the DAO’s governance to set the debt ceiling for any collateral type to zero. Debt ceiling in this context refers to the maximum amount of dai tokens that can be minted in exchange for a collateral asset on the Maker protocol. By setting the debt ceiling to zero, MakerDAO will be able to <a href=\"https:\/\/www.theblock.pro\/news\/post\/219039\/makerdao-launches-emergency-proposal-to-limit-usdc-exposure\" data-v-f87c67ca=\"\">handle situations<\/a> where the underlying collateral asset is <a href=\"https:\/\/www.theblock.pro\/news\/post\/219638\/makerdao-looks-to-limit-volatility-after-usdc-troubles-pushed-some-users-to-dai\" data-v-f87c67ca=\"\">experiencing significant market turbulence<\/a>.","Such a situation happened last week when USDC lost parity with the U.S. dollar amid revelations that issuer Circle held deposits at collapsing Silicon Valley Bank. Since USDC is a major collateral backing for dai, its de-pegging caused dai to also lose its dollar parity temporarily.","For MakerDAO, speed is of the essence in these situations. As such, the proposal includes a stipulation that would exclude it from the protocol’s GSM delay. GSM stands for governance security module and is a protocol that prescribes a minimum length of time that must pass after an executive vote before any changes can be applied to the Maker protocol. This delay prevents governance attacks as it provides a means to trigger an emergency shutdown.","MakerDAO delegates have already begun showing support for the proposal. Seven delegates have voted in favor of the emergency protocol, casting over 35,000 votes in the process. The proposal will need an additional 37,069 votes to pass as of the time of reporting.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"collapsing Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["DAI","DAOS","GOVERNANCE VOTES","USDC"],"authors":["Osato Avan-Nomayo","The Block"]}