{"summary":"The AI Material Designer will allow creators on its platform to generate textures for objects using a text description rather than code.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176545\/metaverse-platform-mona-rolls-out-new-ai-tool-to-help-build-in-online-worlds","publishDate":"2022-10-13T12:00:51","id":1310,"type":null,"title":"Metaverse platform Mona rolls out new AI tool to help build in online worlds","category":["GAMING AND METAVERSE"],"content":["Metaverse platform Mona has rolled out a new AI tool to help builders design more realistic objects in online worlds.","Launched on Thursday, the company says that its AI Material Designer will allow creators on its platform to generate textures for objects using a text description rather than code.","While its generator is currently limited to materials, Mona co-founder and CEO Justin Melillo told The Block that the technology to generate entire 3D objects with AI is already possible today. The tools just haven't been made available to the public yet.","\"We are actively working to build and incorporate these types of tools into our creation pipeline for our community. We’re not too far away from users being able to generate assets and entire worlds using AI inside Mona,\" he said.","AI-generated art is having a moment. While the technology is hardly new, it’s only this year that generators usable by the average person have cropped up.","Generators like Stable Diffusion — whose database Mona is also using — and Midjourney work using \"prompts,\" which are text descriptions of the item users wish to create.&nbsp;","Examples of materials generated via Mona's tool. Source: Mona","The user bases for these tools are growing quickly. Midjourney launched its open beta in July this year and currently has over 3.2 million members on the Discord server where users submit their prompts.","Despite this growing audience, their use — particularly in the art world — is also controversial. Earlier this year, artist Jason M. Allen used Midjourney to create his winning entry for the Colorado State Fair’s annual art competition in the emerging digital artists category. Despite making clear he had used the software, he faced severe backlash from other artists.","The creators of Mona believe that AI could play a pivotal role in how builders, architects and other users realize their visions in the metaverse. Building worlds on metaverse platforms is, after all, currently no easy feat.","“Imagine using AI to create your digital hangout space, home, or world. This is only the beginning of AI-human creative collaboration,\" co-founder and COO Matt Hoerl told The Block in an emailed statement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mona","content":"LOCATION"},{"type":"Mona","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Justin Melillo","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Jason M. Allen","content":"PERSON"},{"type":"Mona","content":"ORGANIZATION"},{"type":"Matt Hoerl","content":"PERSON"},{"type":"Midjourney","content":"LOCATION"},{"type":"July this year","content":"DATE"},{"type":"Colorado State Fair","content":"ORGANIZATION"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}