{"summary":"An Ohm-fork on the Arbitrum chain was able to pull off a $320,000 token sale heist despite public warnings that it could be a rug pull.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207976\/investors-scammed-by-token-sale-on-arbitrum-despite-warning-of-potential-rug-pull","publishDate":"2023-02-02T07:03:03","id":13105,"type":null,"title":"Investors scammed by token sale on Arbitrum despite warning of potential rug pull","category":["CRYPTO ECOSYSTEMS"],"content":["Orion Finance pulled off a $320,000 rug pull on investors who deposited funds in the project’s presale despite warnings that such a thing was bound to happen.","Marco Paladin, crypto security auditor and founder of Paladin Security, <a href=\"https:\/\/twitter.com\/paladin_marco\/status\/1620916764422082561?t=ICeOA3ak4LbWn2kd7Lk0JQ&amp;s=19\" data-v-f87c67ca=\"\">warned<\/a> investors to avoid the Orion Finance presale. Paladin stated an hour before the presale that Orion’s smart contract was similar to one previously deployed by serial scammers.&nbsp;","“It wasn’t exactly a smoking gun, at this point, I was judging the odds of them rugging at 30%,” Paladin told The Block. The security researcher stated that the similarities in the contracts could have been a coincidence.","“But as I said previously, this is already a losing game, if your odds decrease further you should just stay out. So, I decided to write my thread and recommend people to stay out,” said Paladin.","Despite this warning, investors piled into the presale. The project achieved its $320,000 funding target in a matter of minutes. As predicted, the anonymous team behind the project removed the funds in a textbook rug pull. <a href=\"https:\/\/www.theblock.co\/linked\/143193\/state-lawmakers-want-to-make-fraudulent-rug-pulls-a-crime-in-new-york\" data-v-f87c67ca=\"\">Rug pulling<\/a> in crypto is when a project team or a hacker drains all the liquidity from the protocol leaving investors with virtually worthless coins.","The scammers funneled the funds from the presale into many wallets. These funds have since been <a href=\"https:\/\/arbiscan.io\/address\/0x71a82326d7ebb358e25fc531c12defd152dddce5#tokentxns\" data-v-f87c67ca=\"\">bridged<\/a> to the Ethereum chain via Synapse, a cross-chain bridge protocol. The team has also deleted its social media presence including the Twitter page, Discord server, and Medium blog pages.","Orion Finance did generate significant hype within the Arbitrum space. Orion Finance was supposed to be a decentralized reserve currency platform on the Arbitrum network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$320,000","content":"MONEY"},{"type":"Orion Finance presale","content":"ORGANIZATION"},{"type":"Marco Paladin","content":"PERSON"},{"type":"Orion","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Paladin Security","content":"ORGANIZATION"},{"type":"Orion Finance","content":"ORGANIZATION"},{"type":"Paladin","content":"PERSON"},{"type":"30%","content":"PERCENT"}],"hashtag":["ARBITRUM","CROSS-CHAIN SWAPS","HACKS"],"authors":["Osato Avan-Nomayo","The Block"]}