{"summary":"Coinbase has built an open source &quot;Onchain Payment Protocol&quot; to improve its Commerce product, supporting Ethereum, Polygon and Base.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263356\/coinbase-boosts-commerce-product-with-onchain-payment-protocol-on-ethereum-polygon-and-base","publishDate":"2023-11-16T12:56:16","id":13109,"type":null,"title":"Coinbase launches new protocol to improve Commerce, supports Ethereum, Polygon and Base","category":["COMPANIES"],"content":["Crypto exchange Coinbase has developed an open source \"Onchain Payment Protocol\" to improve its Commerce product. The protocol currently supports the Ethereum, Polygon and Base blockchain ecosystems.","\"Today we are announcing a large update to our Coinbase Commerce product, now built on top of our new open source Onchain Payment Protocol, which offers instant settlement, low fees, and broad asset support to improve the payment experience for merchants and their customers,\" Coinbase said Thursday.","<a href=\"https:\/\/www.theblock.co\/linked\/60173\/coinbase-says-its-commerce-platform-has-seen-200-million-in-transactions-processed-since-launch\" data-v-f87c67ca=\"\">Coinbase Commerce<\/a> was launched in 2018 to let merchants accept crypto payments. To date, thousands of merchants globally have received billions of dollars in on-chain payments via the Commerce platform, Coinbase said today. \"Yet, merchants often struggle with crypto volatility, while consumers find the payment experience daunting,\" the company said, adding that the updated Commerce product solves these challenges.","The updated Commerce product built on the Onchain Payment Protocol automatically converts customers' crypto to the USDC stablecoin and thus helps avoid crypto volatility, Coinbase said. The protocol currently supports any wallet and supported token across the Ethereum, Polygon and Base ecosystems and plans to support more networks \"soon.\"","\"This Commerce update allows users to pay in hundreds of currencies across Ethereum, <a href=\"https:\/\/www.theblock.co\/post\/258394\/coinbase-ethereum-layer-2-base-open-sources-smart-contracts-frontend\" data-v-f87c67ca=\"\">Base<\/a>, and Polygon, both native currencies and ERC-20s,\" Lauren Dowling, head of product — developer payment services at Coinbase, told The Block. \"Coinbase retail customers will be able to pay in every asset that is supported by our exchange.\"","The update is impactful for merchants, Dowling said, \"because it enables you to reach the hundreds of millions of global crypto users ready to pay onchain, makes payments much cheaper to accept compared to 3%+ credit card fees, and removes exposure to crypto volatility.\"","Coinbase continues to build amid a difficult market environment. In August, Coinbase launched Base, a Layer 2 network built on top of Ethereum, using the OP Stack software from another popular Layer 2 network, Optimism. Base is currently the third largest scaling network in terms of total value locked after Arbitrum and Optimism, according to DefiLlama <a href=\"https:\/\/defillama.com\/chains\/Rollup\" data-v-f87c67ca=\"\">data<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Commerce","content":"ORGANIZATION"},{"type":"This Commerce","content":"ORGANIZATION"},{"type":"Dowling","content":"PERSON"},{"type":"Coinbase Commerce","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Commerce platform","content":"ORGANIZATION"},{"type":"Lauren Dowling","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Onchain Payment Protocol","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["BASE","COINBASE","ETHEREUM","POLYGON"],"authors":["Yogita Khatri","The Block"]}