{"summary":"A federal judge must still sign off on the stipulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215526\/voyager-agrees-to-reserve-445m-after-suit-from-alameda-research","publishDate":"2023-02-27T18:06:22","id":13110,"type":null,"title":"Voyager agrees to reserve $445m after suit from Alameda Research","category":["LEGAL"],"content":["Defunct crypto lender Voyager Digital agreed to reserve $445 million after the firm was sued by bankrupt trading firm Alameda Research for loan repayments, according to a new court filing.","Lawyers filed a motion on Monday to allow the Voyager debtors to enter into a stipulation with the FTX debtors, along with the official unsecured creditors committees in each bankruptcy case.","The parties agreed to participate in non-binding mediation and establish a framework for the litigation of remaining disputes, potentially smoothing the way for FTX and Alameda Research to reclaim assets. The deal is the latest crypto bankruptcy development from last year's assortment of failures to underscore how intertwined some of the largest digital asset firms are.","“Given the number and scope of potential disputes between the debtors and the Voyager debtors, and the associated cost of resolving each and every one of those disputes … the debtors (and the committee) have determined that entry into the stipulation to narrow the issues and focus on those likely to yield substantial value … is in the best interests of the debtors estates,” the filing said.","Alameda Research is among the more than 100 entities that filed for bankruptcy protection with FTX in November. Voyager Digital filed for bankruptcy protection several months earlier.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","In Alameda’s initial <a href=\"https:\/\/www.theblock.co\/post\/206907\/ftx-linked-alameda-research-sues-voyager-digital-for-over-445m\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">lawsuit<\/span><\/a> seeking the loan repayments, lawyers called Voyager a “feeder fund” that did “little or no due diligence” before investing money from retail clients. Former Alameda Research CEO Caroline Ellison has pleaded guilty to criminal charges in connection with her role at the firm.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lawyers for Sam Bankman-Fried’s failed crypto empire want the federal judge presiding over the bankruptcy process to sign off on the stipulation at a March 8 hearing.","<i data-v-f87c67ca=\"\">The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"several months earlier","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$445 million","content":"MONEY"},{"type":"March 8","content":"DATE"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","BLOCKFI"],"authors":["Stephanie Murray","The Block"]}