{"summary":"Web3 fund Variant has led an $18.5 million round into developer platform Hyperlane. \nGalaxy Digital, CoinFund, Circle, Figment, Blockdaemon, Kraken Ventures and NFX also participated in the round. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172095\/variant-leads-18-5-million-fundraise-for-developer-platform-hyperlane","publishDate":"2022-09-22T10:55:10","id":1311,"type":null,"title":"Variant leads $18.5 million fundraise for developer platform Hyperlane","category":["Venture Capital"],"content":["Hyperlane, a startup that helps developers connect applications across different blockchains, has raised $18.5 million from web investment firm Variant.","Galaxy Digital, CoinFund, Circle, Figment, Blockdaemon, Kraken Ventures and NFX also participated in the round, according to a report <a href=\"https:\/\/fortune.com\/crypto\/2022\/09\/22\/hyperlane-raises-18-million-variant-led-seed-round-crypto\/\" data-v-f87c67ca=\"\">by Fortune<\/a>.&nbsp;","The company, previously named Abacus Network, provides APIs that allow easier communication between different blockchains along with a software development kit (SDK) that can be used to build interchain applications.&nbsp;","“We think, right now, there’s so much burden on the app developer to understand the nuances of the chain[s], where they can’t spend as much time on building the best app,” founder and CEO Jon Kol told Fortune. “So, we want to give them tools to give the best experience for their users.”","In the same report, Kol said the company is planning to use the funding to build the \"Sovereign Consensus.\" This allows developers to safely customise an application's interchain security model. He also said that are plans for APIs for developers to send messages between chains along with another to query information between different blockchains.&nbsp;","Venture capital firms continue to pour money into startups in the crypto infrastructure space. In August, Haun Ventures led a<a href=\"https:\/\/www.theblock.co\/post\/165447\/haun-ventures-leads-24-million-round-into-web3-developer-platform-thirdweb\" data-v-f87c67ca=\"\"> $24 million round<\/a> into web3 developer platform Thirdweb. Yesterday, Coinbase Cloud also <a href=\"https:\/\/www.theblock.co\/post\/171693\/coinbase-cloud-to-lure-developers-with-free-infrastructure-platform-called-node\" data-v-f87c67ca=\"\">launched Node<\/a>, a platform to allow developer to build and monitor blockchain applications from a single platforms.&nbsp;"],"hashtag":[]}