{"summary":"As part of a deal announced Monday, Republic will invest $5.25 million in INX at a pre-money valuation of $50 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235452\/republic-inx-join-forces-to-build-blockchain-infrastructure-expand-tokenization","publishDate":"2023-06-19T09:34:22","id":13115,"type":null,"title":"Republic, INX join forces to build blockchain, tokenization infrastructure","category":["COMPANIES"],"content":["Financial firm Republic and U.S.-regulated broker-dealer INX are joining forces to build blockchain-based infrastructure and expand asset tokenization for primary and secondary markets.","As part of a deal announced Monday, Republic will invest $5.25 million in INX at a pre-money valuation of $50 million. After the transaction, Republic will own about 9.5% of the outstanding shares of INX, the companies said in a <a href=\"https:\/\/www.investorsobserver.com\/news\/qm-pr\/8779336752116988\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;","Republic and INX have also committed to enter into a non-binding term sheet that outlines a deal in which Republic will acquire 100% of INX common equity at a valuation of up to <span class=\"xn-money\" data-v-f87c67ca=\"\">$120 million.<\/span>","\"By combining their expertise and resources in both TradFi (traditional finance) and DeFi (decentralized finance), both companies are poised to introduce a wide range of compliant solutions that cater to both primary and secondary markets while also building the underlying retail-focused infrastructure to support the needs of a booming digital economy,\" the companies said in the statement.","As part of the collaboration agreement, INX will offer tokenized asset services to Republic's portfolio of companies.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Republic","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"9.5%","content":"PERCENT"},{"type":"INX","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Republic","content":"LOCATION"},{"type":"$120 million","content":"MONEY"},{"type":"$5.25 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}