{"summary":"After a day of buzz, Andreessen Horowitz announced a Layer 2 consensus client that &quot;feeds new blocks to the execution client in order to advance the chain.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/227136\/a16z-crypto-andreessen-horowitz-optimism-magi-orange-ball","publishDate":"2023-04-19T11:59:10","id":13119,"type":null,"title":"A16z Crypto&#x27;s hyped &#x27;orange ball&#x27; launch revealed to be big meh","category":["CRYPTO ECOSYSTEMS"],"content":["After spending a day <a href=\"https:\/\/www.theblock.co\/post\/226966\/a16z-crypto-orange-ball-andreessen-horowitz\" data-v-f87c67ca=\"\">building hype with a series of cryptic tweets<\/a> including images of orange balls, A16z Crypto just revealed what all the fuss was about: a new Layer 2 rollup client called Magi.&nbsp;","The venture capital giant's client software is being <a href=\"https:\/\/a16zcrypto.com\/content\/article\/building-magi-a-new-rollup-client-for-optimism\/\" data-v-f87c67ca=\"\">built on the OP Stack<\/a>, a software stack to create a blockchain dApp ecosystem around the Optimism Layer 2 network, according to a blog post announcing the launch.","Magi is a new rollup client developed in Rust to increase client diversity and improve the OP Stack ecosystem. It is in its early stages and needs further development before being a feasible alternative to existing clients. Future plans for Magi include improving latency, sync speed and testing frameworks, according to the firm.","A client refers to a software application that allows users to interact with a blockchain network, validating transactions and maintaining a local copy of the network. Having multiple clients or client diversity is important for a blockchain network so it has no single point of failure.","\"Magi acts as the consensus client (often called a rollup client in the context of the OP Stack) in the traditional execution\/consensus split of Ethereum — it feeds new blocks to the execution client in order to advance the chain. Magi performs the same core functionality as the reference implementation (op-node) and works alongside an execution node (such as op-gETH) to sync to any OP Stack chain, including Optimism and Base,\" the firm wrote in the blog post.","Andreessen Horowitz is one of the highest-profile investors in crypto, with <a href=\"https:\/\/www.theblock.co\/post\/148685\/a16z-announces-4-5-billion-fund-for-crypto-and-blockchain-startups\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">more than $7 billion in funds<\/a> dedicated to investments in the sector. The firm has been involved in 11 fundraisings for crypto startups so far this year, according to&nbsp;<a href=\"https:\/\/www.theblock.pro\/deals\/results?company=a16z&amp;checkedDeals=&amp;checkedVerticals=&amp;checkedRound=&amp;checkedBlock=&amp;dateRange=&amp;dealRange=&amp;subcategory=&amp;yearfounded=&amp;country=\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The Block's Deals Dashboard<\/a>.","<a href=\"https:\/\/www.theblock.co\/linked\/138285\/ethereum-scaling-startup-optimism-raises-150-million-at-1-65-billion-valuation\" data-v-f87c67ca=\"\">A16z Crypto is an investor in&nbsp;Optimism<\/a>, the Ethereum scaling startup formed in early 2020. <a href=\"https:\/\/www.coingecko.com\/en\/coins\/optimism\" data-v-f87c67ca=\"\">Optimism's OP token<\/a> climbed to $2.65 from about $2.55 following today's announcement, according to CoinGecko data.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7 billion","content":"MONEY"},{"type":"$2.55","content":"MONEY"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"$2.65","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"The Block's Deals Dashboard","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"OP Stack","content":"ORGANIZATION"}],"hashtag":["ANDREESSEN HOROWITZ","OPTIMISM","SIDECHAINS","STARTUP ACCELERATORS"],"authors":["Adam Morgan McCarthy","Vishal Chawla","The Block"]}