{"summary":"Compound Finance executed a governance proposal updating its price feeds that contained a code error, freezing the cETH market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166674\/protocol-upgrade-accidentally-freezes-eth-on-compound-for-7-days","publishDate":"2022-08-30T18:08:49","id":13113,"type":null,"title":"Protocol upgrade accidentally freezes ETH on Compound for 7 days","category":["ETHEREUM"],"content":["Compound Finance executed a governance proposal updating its Chainlink price feeds that contained a code error.","The code error has frozen the cETH borrowing and lending markets.","Users can still repay debt and add collateral to avoid liquidation, and CEO of Compound Robert Leshner confirmed no funds are currently at risk.","Compound Finance, a borrowing and lending platform, executed a governance proposal updating its Chainlink price feeds that contained a code error.","This code error is causing people lending and borrowing cETH (Compound ETH) to have their transactions reverted. This means users cannot borrow or withdraw collateral. Users still will be able to repay debt and add collateral to borrowed positions with other assets to avoid potential liquidation.","The code error also caused Compound’s frontend to stop working temporarily.","“No funds seem immediately at risk,” Compound founder Robert Leshner said on Discord. “It will likely be seven days until cETH is functioning normally. There will potentially be more governance proposals to rectify the situation.”","The frontend should be back up “shortly,” Leshner said 3:47 p.m. EST.","A new governance proposal has been put forward to revert to the formerly used price feeds. This proposal will take seven days to go into effect, which is why the cETH market is temporarily frozen and users cannot borrow or withdraw collateral.","Compound is currently ranked third overall in total value locked within the decentralized lending market, according to <a href=\"https:\/\/defillama.com\/protocols\/Lending\" data-v-f87c67ca=\"\">DeFiLlama.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/cryptocurrency-lending\/top-5-lending-markets-for-usdc-borrowed\/embed\" title=\"Top 5 Lending Markets for USDC Borrowed\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compound Finance","content":"ORGANIZATION"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"3:47 p.m.","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"Leshner","content":"PERSON"},{"type":"Robert Leshner","content":"PERSON"}],"hashtag":["LENDING"],"authors":["Mike Truppa","The Block"]}