{"summary":"Housecat is a protocol designed to let anyone copy the trades of any blockchain wallet on the Polygon network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/133598\/crypto-copy-trading-protocol-housecat-emerges-from-stealth-with-3-7-million-in-funding","publishDate":"2022-02-16T07:00:21","id":13117,"type":null,"title":"Crypto copy-trading protocol Housecat emerges from stealth","category":["DEFI"],"content":["Crypto copy-trading protocol <a href=\"https:\/\/housecat.com\/\" data-v-f87c67ca=\"\">Housecat<\/a> has emerged from stealth today, having raised €3 million ($3.5 million), from BlueYard Capital, Inflection, Notation Capital, 3KVC and a number of angel investors.","The protocol lets anybody copy the position and trades made by any cryptocurrency wallet on the Polygon blockchain (although it may expand to further chains compatible with the Ethereum Virtual Machine). Housecat is designed to let someone copy the actions of a previously successful trader.","The project was started by founder and CEO Ville Vesterinen, who also ran augmented-reality gaming company Gray Area for more than four years and has been the founding chairman of the board of iPhone refurbishment company Swappie — which <a href=\"https:\/\/techcrunch.com\/2022\/02\/15\/iphone-refurbisher-swappie-raises-124m-series-c-led-by-verdane-to-scale-in-europe\/\" data-v-f87c67ca=\"\">recently closed<\/a> a $124 million ($40.6M) Series C raise — for six years.","Vesterinen said he spent a lot of time on Twitter and kept noticing very successful people in the crypto space and wishing that he could follow their trades.","“I figured it would be really great if I could press one button and put 1 ETH on this, whatever he’s investing in. Then I started thinking, wait, that’s possible because it’s open source. You don’t even need the permission of the person,” he said.","While the protocol doesn’t require such permissions, it does provide a kickback to the wallet that is being followed. If a specific wallet performs well and the person copying it makes money, a small percentage of those profits will be sent to the wallet. So a person could start receiving income if lots of people are following their wallet — without necessarily even knowing where it’s coming from.","If the owner of a specific wallet doesn’t access the Housecat protocol they will receive a default percentage of gains made by those following their wallet. But if they do sign into the protocol they can set a custom fee. And if they wanted to deter people from copying their trades, they could set a very high fee.","Housecat estimates that it could create a way for successful traders to effectively become asset managers in some sense. If they build up a large following, they might only own the assets in their wallet but they would be somewhat responsible for a much larger amount of money.","“A 16-year-old teenager could have more assets under management [AUM] than Goldman Sachs. You might have tens of thousands of people following your wallet,” he said. (Although the entirety of the crypto market is currently smaller than Goldman Sachs’ current AUM).","There are obviously risks to this approach. The person operating the wallet could act maliciously, leading all of its followers off a cliff. In anticipation of such possibilities, Housecat has taken a few mitigations.&nbsp;","Housecat will initially restrict the tokens that can be copied, preventing traders from using their following to manipulate tokens with small market caps. Plus it will also identify which traders have signed into the platform and are known to be actively managing their wallets, as opposed to wallets that are simply anonymous and may not even know they are being followed.","“People understand this is a vetted, trusted wallet,” said Vesterinen, “and these are the Wild West where you’re on your own.”","<em data-v-f87c67ca=\"\">This story has been updated to change the funding from $3.7 million to $3.5 million based on an update to the press release. Plus the mention of Swappie's Series B has been changed to its Series C raise that was announced yesterday.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vesterinen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"Housecat","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine)","content":"ORGANIZATION"},{"type":"Ville Vesterinen","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$3.7 million","content":"MONEY"},{"type":"Notation Capital","content":"ORGANIZATION"},{"type":"$124 million","content":"MONEY"},{"type":"BlueYard Capital","content":"ORGANIZATION"},{"type":"$40.6","content":"MONEY"},{"type":"Swappie","content":"ORGANIZATION"}],"hashtag":["POLYGON"],"authors":["Tim Copeland","The Block"]}