{"summary":"Civ Kit will be open to anyone from anywhere to do as they please.","author":["Christiana Loureiro","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229628\/paxful-co-founder-plots-ambitious-plan-to-reopen-p2p-crypto-trading-after-company-implosion","publishDate":"2023-05-05T10:40:28","id":1312,"type":null,"title":"Paxful&#x27;s Ray Youssef is building new peer-to-peer &#x27;free market&#x27;","category":["Companies"],"content":["Paxful co-founder Ray Youssef has big plans to reopen peer-to-peer trading after <a href=\"https:\/\/www.theblock.co\/post\/224844\/bitcoin-paxful-shut-down\" data-v-f87c67ca=\"\">his company collapsed<\/a> earlier this year. And it won’t be in the U.S.","His new initiative, called <a href=\"https:\/\/civkit.org\/\" data-v-f87c67ca=\"\">Civ Kit<\/a>, is a “blueprint for developers and entrepreneurs to build their own censorship-resistant and permissionless global marketplace.”","It’s what Youssef calls an “unstoppable marketplace” that will allow anyone, anywhere, to trade using the Lightning Network and Nostr, a protocol that enables decentralized social media.","“We want everyone to be trading with everyone. We want someone in Venezuela trading with someone in Russia,” Youssef said on a recent podcast with The Block’s Frank Chaparro. “No barriers, no permission required.","The endeavor comes on the heels of the implosion of Paxful, which he founded in 2015 with Artur Shaback, who is now suing Youssef. In the face of legal uncertainty in the U.S. — though nothing imminent — Paxful had decided in <a href=\"https:\/\/www.theblock.co\/post\/194274\/ceo-paxful-tells-customers-get-bitcoin-off-platform\" data-v-f87c67ca=\"\">November to dissolve the company<\/a> — a “nice, tidy dissolving,” Youssef said.","“We spent all the money on compliance to make sure that any frozen funds were released back to the users and then there wouldn't be any creditors,” Youssef said. Shaback, however, “decided to sue me because he wouldn't get his nine-figure payday if the company dissolved. So it was purely out of greed.”","Shaback said the two “had differences in the business direction and governance of Paxful,” and that Youssef migrated Paxful’s IP, userbase, wallet history and passwords to a new venture, Noones.com.","“He could not take me with him due to me being a U.S. resident,” Shaback said in an email to The Block, adding that he may not continue pursuing the lawsuit as it takes time and resources and may instead seek a settlement.","“”Paxful was able and is able to function and serve billions of people worldwide and that is my goal now to restore it,” Shaback said.","Instead of \"Know-Your-Customer,\" Civ Kit will use “know-your-peer (KYP) oracles.\"","“KYC is horrible,” Youssef said. “People want to know who they're trading with, especially for big transactions. And that's where we replace KYC with Swipe Your Peer … We can start attaching reputation to accounts based on the nature of people's trading activity.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nYoussef said while there are several such marketplaces in the works, “the difference is that Civ Kit is built by someone, designed by someone that's already done it out in the real world and seen every possible problem in a case.”","<em data-v-f87c67ca=\"\">(Updates with comments from Shaback starting in seventh paragraph.)&nbsp;<\/em>"],"hashtag":[]}