{"summary":"UK football club Tottenham Hotspur is getting into the fan token craze with its own SPURS token on the Chiliz platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/253400\/tottenham-hotspur-to-issue-spurs-fan-token-on-chiliz","publishDate":"2023-09-28T08:59:41","id":13120,"type":null,"title":"Tottenham Hotspur to issue SPURS fan token on Chiliz","category":["CRYPTO ECOSYSTEMS"],"content":["UK football club Tottenhan Hotspur will issue a fan token called SPURS on the Chiliz platform.","The fan token will be sold for $2 each in a fan token offering on October 4, according to a press release. Token holders will be able to participate in on-chain voting and access certain rewards and experiences.","“We’re pleased to be able to provide fans worldwide with a new range of Club-related rewards and experiences. Our Fan Token will build on the many benefits of our existing membership scheme. The partnership is another example of how the Club is working to create additional recurring sources of revenue to reinvest in our football activities,\" said Ryan Norys, commercial sales director at Tottenham Hotspur.","Spurs joins 80 other sporting teams that already have fan tokens on the Chiliz platform. The tokens run on the Chiliz Chain, the project's own blockchain.","The platform claims to have generated more than $400 million in revenue for football teams and leagues.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Club","content":"ORGANIZATION"},{"type":"Tottenhan Hotspur","content":"ORGANIZATION"},{"type":"October 4","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"Ryan Norys","content":"PERSON"},{"type":"Tottenham Hotspur","content":"ORGANIZATION"},{"type":"$2","content":"MONEY"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}