{"summary":"The Federal Reserve may undertake a higher-than-expected interest rate hike next month as inflation and the labor market stay strong.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178174\/fed-officials-eye-another-aggressive-rate-hike-next-month-nyt","publishDate":"2022-10-18T20:48:35","id":13122,"type":null,"title":"Fed officials eye aggressive rate hike next month: NYT","category":["POLICY"],"content":["Ahead of a decision slated for December, Feds are poised to raise interest rates again.","Steady inflation, rising prices, and a strong labor market contributed to the economic conditions behind recent aggressive rate hikes.","The Federal Reserve may undertake a higher-than-expected interest rate hike next month as inflation&nbsp;and the labor market stay strong.","\"Federal Reserve officials have coalesced around a plan to raise interest rates by three-quarters of a point next month,\" according to the <a href=\"https:\/\/www.nytimes.com\/2022\/10\/18\/business\/economy\/federal-reserve-inflation-november-meeting.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">New York Times<\/a>. The current economic conditions come at a time when officials at the U.S. central bank remain unclear about when they may step back on interest rate adjustments.","The Times reported that markets are betting this trend will persist until at least December, or perhaps by a meeting in November, based on economic projections, statements from the central bank, and a Fed presidential speech.","Another indicator that rates are on the rise comes from the <a href=\"https:\/\/www.bls.gov\/cpi\/news.htm\" data-v-f87c67ca=\"\">Consumer Price Index<\/a> figures that showed a climb of 6.6% over the year through September, constituting a 40-year high – data that may forestall any such decision to back off raising rates by Fed officials.","Restrictive monetary policies from the Fed will persist, according to Vice Chair Lael Brainard, who <a href=\"https:\/\/www.theblock.co\/post\/175994\/federal-reserve-vice-chair-forecasts-restrictive-monetary-policy-for-some-time\" data-v-f87c67ca=\"\">addressed<\/a> the issue of rising inflation in a speech on Oct. 10. Brainard cited negative shocks, including a global pandemic and supply chains impacted by Russia’s invasion of Ukraine.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"6.6%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lael Brainard","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Oct. 10","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}