{"summary":"After a technical disruption, Solana validators have been instructed to restart its network clusters.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/215191\/solana-blockchain-impacted-by-technical-issue","publishDate":"2023-02-25T10:23:04","id":13126,"type":null,"title":"Solana blockchain impacted by technical issue","category":["CRYPTO ECOSYSTEMS"],"content":["Users attempting to make transactions on the Solana blockchain, which is in mainnet beta phase, faced disruptions from a technical issue that began at about 1 a.m. ET on Saturday.","Although the reason for the issue was unclear, validator operators and core engineers suspected there may be a bug in the latest version of the Solana code, which was released just hours before the incident.","A problem arose from a reported Solana \"fork\" due to the said issue that led to conflicting versions of transaction history. \"The Solana network is experiencing non standard behavior (fork). Our engineers are investigating the issue and how to help best,\" noted Chorus One, a blockchain infrastructure provider for Solana.","This, in turn, resulted in increased memory usage by validators and a significant reduction in transaction throughput, ultimately causing the network to stop processing user transactions, as further <a href=\"https:\/\/twitter.com\/ChorusOne\/status\/1629416727548162048\" data-v-f87c67ca=\"\">noted<\/a> by Chorus One.","As a result, Solana's validators have been instructed to restart its network clusters from a specific snapshot period, a process that is currently ongoing. An official Discord channel <a href=\"https:\/\/docs.google.com\/document\/d\/e\/2PACX-1vQzf7XpdoXB99lCWu6na9PhLy4SOx-xcjP1LlGiVR0PB6vpyGpol1c8_PufAa8TZZp_R0NlgaqlC7a1\/pub\" data-v-f87c67ca=\"\">provided<\/a> the necessary instructions for this.","<em data-v-f87c67ca=\"\">Team members of the Solana Foundation did not immediately respond to requests for comment.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"1 a.m. ET","content":"TIME"},{"type":"Solana","content":"PERSON"},{"type":"Saturday","content":"DATE"}],"hashtag":["SOLANA"],"authors":["Vishal Chawla","The Block"]}