{"summary":"An active year for digital asset market participants is coming to an end – and new data underpins the degree of change that has occurred in that span of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51413\/crypto-trading-spreads-have-plunged-90-and-its-pushing-desks-to-rethink-their-strategies","publishDate":"2019-12-23T13:17:57","id":13127,"type":null,"title":"Crypto trading spreads have tightened by 90%, pushing desks to rethink their strategies","category":["MARKETS"],"content":["An active year for digital asset market participants is coming to an end – and new data underpins the degree of change that has occurred in that span of time.&nbsp;","Over the course of 2019, new players emerged and old ones crumbled, and readers of The Block will recall the fall of Circle Trade, Circle's once-mighty cryptocurrency trading operation.","In 2018, the desk facilitated the trading of more than $24 billion worth of digital assets. As one source put it, the firm was in an excellent position: everyone was connected, and it also had some of the best-known talent. Indeed, prior to Circle <a href=\"https:\/\/www.theblockcrypto.com\/post\/50900\/circle-otc-trading-desk-crypto-exchange-kraken\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">selling the desk<\/a> to Kraken earlier this month, the writing was on the wall for its demise.&nbsp;","<span data-v-f87c67ca=\"\">Daniel Matuszewski, the former head of the unit, <a href=\"https:\/\/www.theblockcrypto.com\/post\/34610\/circle-otc-head-departs-firm-following-layoffs-and-departures\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">resigned in August<\/a> to start his own firm with Bobby Cho, who previously led DRW's Cumberland division. Matuszewski&nbsp;<\/span>previously<span data-v-f87c67ca=\"\"> was a vol-arb trader for a Boston-area hedge fund. Beatrice O'Carroll, whose career in sales and relationship management included time at Deutsche Bank and Citigroup, left the firm over the summer. In November, the desk had shrunk to just two traders including Nick Gustafson.<\/span>","While several ex-employees say Circle Trade's decline was the result of mismanagement, it's hard not to be somewhat sympathetic given the macro backdrop.&nbsp;","Since 2017, trading desks have faced two key headwinds: declining spreads and declining volatility.","Data provided by Skew, a cryptocurrency data provider, shows that 1-year realized volatility for bitcoin decreased from 94.6% in 2017 to 71% in 2019. &nbsp;","","","One-year realized volatility measures how much an asset has moved over a year-long period. Volatility is part of the life blood for high-speed traders. When it is high, spreads widen, which means traders have a bigger opportunity to make a profit.&nbsp;","Speaking of spreads — the difference between the bid and ask price — they have tightened since 2017. Data from trading firm B2C2, a UK-based crypto electronic trading firm, shows that cryptocurrency trading spreads fell off a cliff in late 2017, and have been approaching zero ever since.","Since February 2018, they've collapsed 90%.&nbsp;","","","Of course, volatility is just one force weighing down on spreads.&nbsp;","Max Boonen, B2C2's founder, says spread compression has more to do with the willingness of crypto traders to take on more risk.&nbsp;","\"For any amount of risk, liquidity providers are now willing to show smaller spreads,\" Boonen told The Block.&nbsp;\"In other words the cost of crypto market risk is lower today.\"","\"That's because (1) the market as a whole is more liquid than in 2017 (more participants with different views and horizons) and (2) better technology and automation lower the cost of risk, even if volumes and participation stagnate,\" he added.&nbsp;","Circle hasn't been the only victim of spread compression. Galaxy Digital's trading business — which includes over-the-counter trading — accounted for more than 60% of its Q3 net loss of $68.2 million.","DRW's Cumberland, which has been quiet in recent months, saw a number of its executives leave the company in 2018, including Cho, Goldman Sachs alum James Radecki, and David Gross, who joined Galaxy as its global head of sales in July.&nbsp;","<strong data-v-f87c67ca=\"\">What's an OTC desk to do?<\/strong>","In a tough market, firms either need to significantly increase their volumes or diversify into new businesses.&nbsp;","Derivatives have emerged as a new opportunity for market participants. Galaxy Digital has been writing options for its counter-parties for several months, as The Block first reported. Indeed, an insider in the crypto derivatives market told The Block that most desks have shifted from proprietary trading to customer-facing business.&nbsp;","\"Now everyone is in the business of selling structure products to their clients,\" the person said.&nbsp;","\"I think it's a case of they have no choice,\" another source remarked. \"The space is small. Guys like Cumberland and Jump have invested amounts for market making in a trillion dollar market, but the market is stuck at $200 billion and shrinking.\"","QCP, an Asia-based firm, is a pioneer in the crypto derivatives market and one that demonstrates a potential path that firms can take. Darius Sit, managing director at QCP, said it offers a service that allows high-networth individuals and family offices to invest in a number of options strategies.&nbsp;","Its so-called covered option strategies allow investors to take advantage of the spread between the price of options and the underlying spot market.&nbsp;","\"These strategies are compelling because of structural inefficiencies that exist in the crypto options&nbsp;space,\" according to a document reviewed by The Block. \"In more mature asset classes, options are often priced close to or only slightly above&nbsp;theoretical levels.\"","The nascent market's inefficiencies offer \"a short window of opportunity to earn alpha from this inefficient through covered option strategies,\" the document noted.&nbsp;","The strategies, according to Sit, yield 3 to 8% a month.&nbsp;","\"Of course, depending on the level of aggressiveness,\" he said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Nick Gustafson","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"8%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$68.2 million","content":"MONEY"},{"type":"Boonen","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"$200 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"David Gross","content":"PERSON"},{"type":"Bobby Cho","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"DRW","content":"ORGANIZATION"},{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"Daniel Matuszewski","content":"PERSON"},{"type":"earlier this month","content":"DATE"},{"type":"Skew","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"Kraken","content":"LOCATION"},{"type":"$24 billion","content":"MONEY"},{"type":"71%","content":"PERCENT"},{"type":"February 2018","content":"DATE"},{"type":"Beatrice O'Carroll","content":"PERSON"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"QCP","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Boston","content":"LOCATION"},{"type":"Max Boonen","content":"PERSON"},{"type":"Cumberland","content":"LOCATION"},{"type":"94.6%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"James Radecki","content":"PERSON"}],"hashtag":["KRAKEN"],"authors":["Frank Chaparro","The Block"]}