{"summary":"Miami mayor Francis Suarez is considering putting some of the city’s treasury reserves into bitcoin.\n“If I would have done it last year, I would have made 200% plus [return]. So I would have looked like a genius,” said Suarez.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/91405\/miami-mayor-bitcoin-btc-investment-plan-city-treasury-reserves","publishDate":"2021-01-15T04:15:07","id":1313,"type":null,"title":"Miami mayor wants to put some of the city&#x27;s treasury reserves into bitcoin","category":["Bitcoin"],"content":["Miami mayor Francis Suarez is considering putting some of the city's treasury reserves into bitcoin (BTC).&nbsp;","\"We&nbsp;are looking at the possibility of diversifying our investment portfolio and having and holding a percentage of our investments in bitcoin,\" Suarez <a href=\"https:\/\/www.foxbusiness.com\/technology\/miami-mayor-bitcoin-invest-cryptocurrency\" data-v-f87c67ca=\"\">told<\/a> FOX Business in an interview on Thursday. \"If I would have done it last year, I would have made 200% plus [return]. So I would have looked like a genius.\"","Suarez said he wants to make Miami \"one of the most crypto forward and technological cities\" in the country. To that end, the city is looking to create a regulatory framework that makes it \"the easiest place\" in the U.S. to do crypto business.","\"We're looking at laws from Wyoming, Wisconsin, and New York, a regulatory environment, and we have a tremendous amount of interest in tech right now,\" he said. \"So we're looking at a variety of things from being able to make payments in crypto, in bitcoin, in particular, being able to pay your taxes, being able to pay fees to the city.\"","Suarez thinks <a href=\"https:\/\/www.theblockcrypto.com\/data\/crypto-markets\/prices\/btc-price\" data-v-f87c67ca=\"\">bitcoin's price<\/a> will only go in one direction, given that its supply is limited and as it becomes more mainstream. \"It's only going to go up,\" said the mayor, acknowledging that the cryptocurrency is volatile.","<iframe title=\"BTC Price\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/prices\/btc-price\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","Still, \"the fact that it is limited, the fact that other governments use currencies to do a variety of things that have nothing to do necessarily with the exchange of goods, but to implement public policy, I think has made bitcoin a very attractive investment for many people,\" said Suarez.","The mayor <a href=\"https:\/\/twitter.com\/FrancisSuarez\/status\/1343940680817766401\" data-v-f87c67ca=\"\">first indicated his interest<\/a> in putting the city's treasury reserves into bitcoin in December. Last week, he <a href=\"https:\/\/twitter.com\/FrancisSuarez\/status\/1349045029977935872\" data-v-f87c67ca=\"\">sat down<\/a> with Gemini's Cameron and Tyler Winklevoss and said his mission is to make Miami \"the most crypto competitive city on the planet.\""],"hashtag":["BITCOIN"]}