{"summary":"The price of bitcoin could face additional downward pressure in the coming weeks if GBTC investors continue to take profits, JPMorgan said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273432\/bitcoin-price-jpmorgan-gbtc-profit-taking","publishDate":"2024-01-18T13:36:46","id":13136,"type":null,"title":"Bitcoin price could face more pressure with GBTC profit-taking, says JPMorgan","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\">The price of bitcoin could face additional downward pressure in the coming weeks if investors in Grayscale <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.83%\n    <\/span><\/a> <!----><\/span><\/span> Trust continue to take profits, according to JPMorgan.<\/span>","GBTC converted into a spot bitcoin ETF last week and has already <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-flows\" data-v-f87c67ca=\"\">seen<\/a> over $1.5 billion worth of outflows. Last week, JPMorgan <a href=\"https:\/\/www.theblock.co\/post\/272099\/jpmorgan-spot-bitcoin-etfs-36-billion-inflows\" data-v-f87c67ca=\"\">estimated<\/a> up to $3 billion in GBTC outflows as speculative investors were likely to take profits.","\"If the previous $3 billion estimate proves correct and given $1.5 billion has exited already, then there could be an additional $1.5 billion still to exit the bitcoin space via profit-taking on GBTC, thus putting further pressure on bitcoin prices over the coming weeks,\" JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a note on Thursday.","GBTC investors — who over the past year had been buying the fund's shares at a significant discount to net asset value to position for the eventual ETF conversion — \"have been taking full profit post-ETF conversion by exiting the bitcoin space entirely rather than shifting to cheaper spot bitcoin ETFs,\" the analysts said.<br data-v-f87c67ca=\"\">\n<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-flows\/embed\" title=\"Spot Bitcoin ETF Flows\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","GBTC outflows are also adding pressure on the fund to lower its fees, the analysts said, reiterating their view that the current 1.5% fee is \"too high\" compared to other spot bitcoin ETFs.","GBTC is \"risking further outflows\" even if, for some institutional investors, fees are not the only reason to consider when deciding whether to shift to cheaper spot bitcoin ETFs, the analysts noted.","\"Liquidity and market depth also matter, but again there is risk for GBTC on that front also if other spot bitcoin ETFs manage to reach critical mass in terms of size and liquidity,\" they said, adding that an additional $5 billion to $10 billion could exit GBTC if it loses its liquidity advantage.","Last week, Panigirtzoglou <a href=\"https:\/\/www.theblock.co\/post\/272417\/spot-ethereum-etf-approval-chance-jpmorgan\" data-v-f87c67ca=\"\">told The Block<\/a> that JPMorgan doesn't see more than a 50% chance of spot Ethereum ETF approval by May, the Securities and Exchange Commission's first deadline to rule on pending applications for such funds.","Reiterating that view in today's report, the JPMorgan analysts said that while they are \"sympathetic\" to arguments that point toward potential approval, they are skeptical that the SEC will classify Ethereum as a commodity as soon as May.","\"If anything, with Ethereum having transitioned from proof-of-work to proof-of-stake and the negative impact this transition had on Ethereum decentralization, Ethereum looks more similar to other cryptocurrencies outside bitcoin, which are deemed securities by the SEC,\" the analysts said.","Furthermore, the ongoing lawsuits brought by the SEC against crypto exchanges offering staking services for proof-of-stake blockchains, including Ethereum, make a spot Ethereum ETF approval \"more challenging at least until these lawsuits are resolved,\" the analysts concluded.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"1.5%","content":"PERCENT"},{"type":"$5 billion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum decentralization","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"Grayscale <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Panigirtzoglou","content":"PERSON"},{"type":"+0.83%","content":"PERCENT"},{"type":"Ethereum ETF","content":"ORGANIZATION"}],"hashtag":["BITCOIN","ETHEREUM","INVESTMENT FIRMS","SPOT BITCOIN ETF","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}