{"summary":"&quot;We ask that you begin planning the withdrawal of your funds at a convenient time by this date,&quot; the company said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210841\/nexo-will-stop-its-earn-interest-product-for-us-clients-in-april","publishDate":"2023-02-11T19:54:33","id":13135,"type":null,"title":"Nexo will stop its Earn Interest Product for US clients in April","category":["COMPANIES"],"content":["Following a settlement with the U.S. Securities and Exchange Commission announced last month, crypto lending platform Nexo will stop its Earn Interest Product for all U.S. clients, which include both citizens and residents, on April 1.","\"We ask that you begin planning the withdrawal of your funds at a convenient time by this date,\" the company said in a <a href=\"https:\/\/nexo.io\/blog\/update-for-us-clients\" data-v-f87c67ca=\"\">blog post<\/a>, adding that no other Nexo services will be affected. Clients with outstanding credit will be given \"ample time and notice\" to repay loans and withdraw collateralized assets.","Non-U.S. clients who believe their accounts have been wrongfully flagged must update verification details by providing documents such as bank statements or utility bills.&nbsp;","Nexo <a href=\"https:\/\/www.theblock.co\/post\/203983\/nexo-pays-45-million-to-settle-sec-and-state-charges-for-failing-to-register-lending-product\" data-v-f87c67ca=\"\">agreed to pay $45 million<\/a> after being charged by the SEC for failing to register the offer and sale of the retail crypto asset lending product, which was first offered in the U.S. in 2020. Without admitting or denying the charges, Nexo agreed to an order to block it from violating registration provisions under the Securities Act of 1933.","The course of action \"reflects our belief that the development of clear regulatory frameworks is the best way to protect the crypto industry and usher it into the mainstream safely and compliantly,\" the company said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 1","content":"DATE"},{"type":"$45 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Nexo","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"1933","content":"DATE"}],"hashtag":["SEC"],"authors":["Nathan Crooks","The Block"]}