{"summary":"A former advisor to the SEC has shed light on a legal doctrine that could potentially challenge Gensler&#x27;s crypto crackdown. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235463\/former-sec-advisor-legal-doctrine-could-end-genslers-crypto-crackdown","publishDate":"2023-06-19T11:09:37","id":13132,"type":null,"title":"Former SEC advisor: Legal doctrine could end Gensler’s crypto crackdown","category":["REGULATION"],"content":["A former advisor to the U.S. Securities and Exchange Commission is shedding light on a legal doctrine that challenges the authority of regulatory agencies and could potentially put an end to SEC Chairman Gary Gensler's crypto crackdown.&nbsp;","J.W. Verret, associate professor of law at George Mason and former advisory committee member to Gensler and other SEC commissioners, broke down the importance of the major questions doctrine in the latest <a href=\"https:\/\/www.theblock.co\/post\/235398\/major-questions-doctrine\" data-v-f87c67ca=\"\">episode<\/a> of The Scoop podcast. The conversation centered around the recent lawsuits brought by the SEC against <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">Binance<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">Coinbase<\/a> over alleged securities law violations.","The major questions doctrine relates to “how courts look at what executive agencies do in the so-called independent agencies and consider how much deference to give the things that they do,” Verret said. These agencies, such as the SEC, receive broad mandates from Congress to regulate certain areas. However, the specifics are often left vague, which has resulted in a significant expansion of regulations through agency rulemaking over the years, he added.","Historically, the Chevron doctrine, a fairly deferential approach to agency actions in Verret's view, provided a framework for courts to grant agencies broad discretion. However, the major questions doctrine — seen as a competing doctrine — has gained traction among conservative and libertarian-minded judges, Verret suggested. It argues that if an agency seeks to regulate a matter without specific authorization from Congress, especially if it involves national, economic or political importance, it must first obtain explicit approval from Congress.","The major questions doctrine could have significant implications for the SEC's regulatory actions in the crypto space. While agencies like the SEC derive their authority from broad mandates, the major questions doctrine demands clear congressional authorization for major regulatory decisions. It could challenge the SEC's reach and authority in regulating digital assets that operate on decentralized blockchains, Verret said.","Drawing on examples where regulatory actions went “a step beyond what Congress intended,” Verret highlighted the Howey Test as a good analogy. The test determines whether a financial instrument qualifies as a security. It dates back to 1946, <a href=\"https:\/\/supreme.justia.com\/cases\/federal\/us\/328\/293\/\" data-v-f87c67ca=\"\">relating<\/a> to the Howey Company’s sale of citrus groves to buyers who would then lease back the land to Howey — long before the advent of decentralized crypto networks.&nbsp;","Similarly, the major questions doctrine challenges the SEC's jurisdiction on cryptocurrencies existing solely on decentralized blockchains, Verret said. “I think it's an argument that Coinbase and Binance are going to run with.”","The major questions doctrine is not likely to be discussed until the SEC's lawsuits against <a href=\"https:\/\/www.theblock.co\/post\/233601\/coinbase-clo-lawsuit\" data-v-f87c67ca=\"\">Coinbase<\/a> and <a href=\"http:\/\/binance.us\/\" data-v-f87c67ca=\"\">Binance.US<\/a> reach the appellate courts, which could be a long way away, Verret said, \"but it's one of the things that looms over these cases, without a doubt.\"","Verret ended the interview by saying he would continue to trade on Coinbase, despite the SEC’s action against it.","“I mostly trade on DeFi now, but Coinbase was a part of my early journey into crypto and I'm not going to stop,\" he said. In fact, I'm excited to trade more on Coinbase now as a result of this.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"J.W. Verret","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Verret","content":"LOCATION"},{"type":"Coinbase","content":"PERSON"},{"type":"George Mason","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"Verret","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Howey Company","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Chevron","content":"ORGANIZATION"}],"hashtag":["BINANCE","COINBASE","SEC"],"authors":["James Hunt","The Block"]}