{"summary":"A group of former Coinbase product and engineering experts has raised $4.1 million for their startup, Definitive.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262189\/a-startup-that-wants-to-make-defi-less-stressful-for-institutions-raises-4-1-million","publishDate":"2023-11-08T12:04:01","id":13148,"type":null,"title":"A startup that wants to make DeFi less stressful for institutions raises $4.1 million","category":["COMPANIES"],"content":["A group of three former Coinbase product and engineering veterans have successfully raised $4.1 million to build out a new platform to make DeFi's emerging capital markets more accessible for Wall Street.&nbsp;","Named Definitive, the new startup seeks to automate many aspects of the decentralized finance world, which encompasses a broad spectrum of financial services. While newcomers might find the transparency of a decentralized perpetual exchange or the attractive yields of so-called vaults enticing, co-founder Jai Prasad noted that the current manual processes for navigating these emerging products can be quite cumbersome for funds, even those operating at the bleeding edge of crypto.","For example, investors have the option to deposit funds into a SOL secured put vault on the Solana application Psyfi.io, yielding 9.15% APY, or borrow ETH through Aave at a rate of 3.19%. These terms are notably favorable when compared to traditional finance; however, there is a trade-off in terms of user-friendliness. This is the gap that Definitive aims to bridge with its execution platform for DeFi. The platform seamlessly integrates with various protocols, enabling experienced users to trade, access yield opportunities, and monitor the risk level of their holdings through what they describe as a user-friendly, automated click interface.","\"Investors are seeing they can do 15% on these different vaults,\" Prasad said. \"Today, however, they go to whatever DeFi application but it is very manual to use them.\"","\"They will want a one-click but to do that you need to understand the smart contracts, claim rewards, monitor the position in real time. And what happens if the protocols rugs,\" he added. \"You have a loan in Aave and you borrowed against it, you have to manually check the health of the loan and what if your DeFi guy is on holiday and misses that the loans gets into these risky positions.\"","Definitive is part of the latest generation of cryptocurrency entrepreneurs who have emerged in recent years. They are committed to offering investors the same services that are commonly available on centralized exchanges and within the traditional financial sector. In a similar vein, former FTX president Brett Harrison has secured funding for his startup, Architect, which is developing software trading tools for the DeFi sector. Additionally, Fordefi has raised $18 million to introduce a DeFi wallet tailored for institutional use.","As for Definitive, it counts Nascent, Coinbase Ventures, CMT Digital among the members of its cap table following the raise. BlockTower led the round. Prasad, who previously has worked at Coinbase, is building out the firm with fellow Coinbase alumni Dennis Qian and Blake Arnold.&nbsp;","\"<span data-v-f87c67ca=\"\">Few in the space rival the experience and expertise of the Definitive team when it comes to DeFi and institutional crypto markets,\" commented BlockTower's Thomas Klocanas. \"We’re extremely excited to back them in their journey to professionalize and standardize access to DeFi in a way that truly enables broader institutional participation in these markets, by solving critical elements at the protocol integration\/access, and at the risk management and execution layers.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Thomas Klocanas","content":"PERSON"},{"type":"Today","content":"DATE"},{"type":"CMT Digital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$18 million","content":"MONEY"},{"type":"9.15%","content":"PERCENT"},{"type":"Jai Prasad","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"3.19%","content":"PERCENT"},{"type":"Prasad","content":"PERSON"},{"type":"Fordefi","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Dennis Qian","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Blake Arnold","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"$4.1 million","content":"MONEY"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}