{"summary":"BarnBridge DAO, which runs a small DeFi protocol, and its founders will pay more than $1.7 million to settle charges with the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/269081\/barnbridge-dao-settles-with-sec-for-1-7-million-agrees-to-stop-selling-crypto-bond-product","publishDate":"2023-12-22T11:51:58","id":13144,"type":null,"title":"BarnBridge DAO settles with SEC for $1.7 million, agrees to stop selling crypto bond product","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">BarnBridge DAO, which runs a small DeFi protocol, and its founders will pay more than $1.7 million to settle charges brought by the Securities and Exchange Commission for failing to register the offer and sale of cryptocurrencies.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC said BarnBridge and its founders, Tyler Ward, 34, and Troy Murray, 38, did not register the \"<\/span><span class=\"s2\" data-v-f87c67ca=\"\">offer and sale of structured crypto asset securities known as SMART Yield bonds.\" The DAO compared those bonds to asset-backed securities and marketed them to the public, the SEC said in a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-258?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">statement<\/span><\/a> on Friday. BarnBridge did not admit or deny the agency's findings.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">SMART Yield pooled together cryptocurrencies deposited by investors and then used those assets to generate returns to pay investors, the SEC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Ward and Murray used social media to promote the investment potential and returns associated with SMART Yield. Ward and Murray appeared as guests on multiple YouTube interview channels related to so-called 'decentralized finance' to promote SMART Yield as an investment,\" the SEC said in its order.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In July, BarnBridge attorney Douglas Park told DAO members through Discord that the SEC was <a href=\"https:\/\/www.theblock.co\/post\/238278\/barnbridge-dao-advised-to-halt-defi-operations-amid-purported-sec-probe\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">investigating<\/span><\/a>. At the time, Park said that all work on BarnBridge-related products should be halted and that people shouldn't be compensated for work they do for the DAO until further notice.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Later in October, BarnBridge opened a <a href=\"https:\/\/www.theblock.co\/post\/256049\/barnbridge-dao-votes-over-response-to-sec-probe\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">voting<\/span><\/a> process on whether Ward and Murray <\/span><span class=\"s4\" data-v-f87c67ca=\"\">should have the \"authority to undertake all actions necessary to comply with the Order of the Securities and Exchange Commission against BarnBridge.”<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">BarnBridge asked stakeholders at the time whether it should pay disgorgement, as required by the SEC’s order, and whether it should \"sell all tokens that it is permitted to sell and allow to Ward and Murray to distribute the tokens.\"<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">The SEC has taken legal actions against DAOs before, including earlier this year when it said that American Crypto Fed <\/span><span class=\"s4\" data-v-f87c67ca=\"\">failed to provide required information about its business management and financial condition. It also had materially misleading statements and omissions, including inconsistencies on whether the tokens are securities, the SEC said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The use of blockchain technology for the unregistered offer and sale of structured finance products to retail investors runs afoul of the securities laws,\" Gurbir S. Grewal, director of the SEC’s Division of Enforcement said in a <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-258?utm_medium=email&amp;utm_source=govdelivery\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">statement<\/span><\/a> on Friday regarding BarnBridge. \"This case serves as an important reminder that those laws apply to all who wish to access our capital markets, regardless of whether they are, or purport to be, incorporated, decentralized or autonomous.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tyler Ward","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Troy Murray","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"American Crypto Fed","content":"ORGANIZATION"},{"type":"Murray","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$1.7 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"BarnBridge","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Gurbir S. Grewal","content":"PERSON"},{"type":"Ward","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Park","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"Douglas Park","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}