{"summary":"Sam Bankman-Fried was convicted on seven out of seven criminal counts of defrauding the customers, lenders, and investors of FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261240\/sam-bankman-fried-convicted-on-all-counts-report","publishDate":"2023-11-02T19:53:25","id":13150,"type":null,"title":"SBF is guilty on all counts as jury rules he defrauded investors","category":["COMPANIES"],"content":["Sam Bankman-Fried was <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">convicted<\/a> of defrauding the customers, lenders, and investors of FTX, the cryptocurrency exchange he co-founded and led until its dramatic collapse a year ago, which saw customers lose billions in what prosecutors called \"one of the biggest financial frauds in U.S. history.\"","Bankman-Fried was found guilty on two substantive crimes, wire fraud on the lenders and customers of FTX, and five conspiracy crimes, which include conspiracy to commit the wire fraud charges along with commodities fraud, securities fraud, and money laundering, Inner City Press <a href=\"https:\/\/twitter.com\/innercitypress\/status\/1720226132136468805\" data-v-f87c67ca=\"\">reported<\/a>. He faces a sentence of up to 115 years in prison.","As the verdict was read, Bankman-Fried’s father, Joseph Bankman, sat with his head in his hands, while his mother, Barbara Fried, held her head down. The pair were present for most days of the trial. As the jury departed, they hugged each other tightly.","They waited for Bankman-Fried behind the courtroom divider but he was swiftly ushered out of the room. About halfway out of the room, Bankman-Fried turned back and smiled at his parents.","\"We respect the jury’s decision,\" Bankman-Fried's lawyer Mark Cohen said in a statement. \"But we are very disappointed with the result. Mr. Bankman Fried maintains his innocence and will continue to vigorously fight the charges against him.\"","Bankman-Fried's crypto empire collapsed dramatically a year ago after the FTX exchange he led as CEO and its sister trading firm Alameda Research, which Bankman-Fried co-founded and owned, <a href=\"https:\/\/www.theblock.co\/post\/260277\/inside-the-trial-prosecution-scores-more-points-on-last-day-of-sbfs-testimony\" data-v-f87c67ca=\"\">couldn't recover<\/a> from a massive hole in their balance sheets that saw customers lose billions.","Bankman-Fried was then subsequently arrested in the Bahamas and extradited to the U.S. He’s been in jail throughout the duration of the trial after his bail was revoked in August as prosecutors accused him of witness tampering by leaking the private diary of former colleague and ex-girlfriend Caroline Ellison to the New York Times and using an encrypted message app to contact a potential witness.","The trial itself has garnered attention in the crypto industry over the past year following the exchange's collapse as investors suffered and the industry itself looked to distance itself from Bankman-Fried.","The former billionaire himself took the stand toward the end of the trial, but his testimony failed to convince the jury to acquit him. Bankman-Fried told the jury that he thought until the final days that both Alameda and FTX could be saved. He admitted to making mistakes and said that FTX had a \"lack of oversight,\" but his lead attorney, Mark Cohen, argued that poor business decisions were not a crime.","Prosecutors, in their closing arguments, emphasized that Bankman-Fried was a knowing co-conspirator in the fraud, pointing to the testimony of three former FTX executives — Ellison, who was CEO of Alameda research, former FTX CTO and co-founder Gary Wang, and former Head of Engineering Nishad Singh — as incontrovertible evidence that Bankman-Fried knew more than he admitted about his empire's finances. Those three co-conspirators have already pleaded guilty to various charges, though none has been sentenced yet.","Judge Lewis Kaplan scheduled sentencing for March 28.","Bankman-Fried's lawyers could decide to appeal on two issues — one on his limitations on his ability to offer a presence of counsel defense, and another on the judge allowing a pre-testimony hearing where the government was able to question the former FTX CEO,&nbsp;said Samson Enzer, partner at Cahill, Gordon &amp; Reindel. Enzer is a former federal prosecutor in the U.S. Attorney's Office for the Southern District of New York, where he handled multiple crypto-related cases.","The presence of counsel defense argument would mean that Bankman-Fried is asserting that lawyers were present when running his business and that presence of lawyers gave him comfort that what he was doing was okay.","\"I don't think they're prevailing, I think the government would win the appeal, but I expect he would argue them,\" Enzer said.","Bankman-Fried still faces five more charges in a trial currently scheduled for March 2024, including fraud on customers of FTX in connection with the purchase and sale of derivatives, securities fraud on investors in FTX, and three conspiracy charges: bank fraud, operating an unlicensed money transmitter business, and violating the bribery statute of the Foreign Corrupt Practices Act.","If the government still goes ahead with the additional charges, the court would want to hold off on sentencing. However, Enzer said he would not be surprised if the government dropped the later charges or tried to find a way to resolve them.","\"I think that this is a positive message in the sense that it tells the world, look, fraud is fraud, whether the fraud is on Wall Street or on the blockchain,\" Enzer said. \"It will be aggressively enforced.\"","Investors then should have the confidence that their rights against fraud will be protected and bad actors weeded out, Enzer said.","\"What we'll be left with are the good actors, the folks who I think are in the majority,\" Enzer said. \"The folks who are just trying to do things that make the world better.\"","Enzer said the trial itself has yielded its own findings that had nothing to do with the outcome.","\"The trial is like an autopsy of what a lack of good corporate compliance and controls looks like and should provoke thoughts in the industry about what do we need to do to make sure we're safeguarding customer assets, that we're protecting our customers and counterparties that we have proper controls and that we're adequately managing risks including hedging when we have investment decisions,\" Enzer said.","The trial also raised questions on the crypto industry's approach to record keepings and what modes of communication are appropriate and whether those should be preserved, Enzer said. Prosecutors had argued that Bankman-Fried's use of auto-deletion policies was evidence of his fraudulent and criminal intent.","(<em data-v-f87c67ca=\"\">Updates with details throughout.<\/em>)","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Head of Engineering Nishad Singh","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"Cahill, Gordon &amp; Reindel","content":"ORGANIZATION"},{"type":"Enzer","content":"PERSON"},{"type":"Samson Enzer","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"FTX CTO","content":"ORGANIZATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Inner City Press","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Barbara Fried","content":"PERSON"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"March 2024","content":"DATE"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","Sarah Wynn","Anna Baydakova","The Block"]}