{"summary":"Tether’s dominance of the Curve 3pool has risen to 86% amid massive swaps from USDT to stablecoins like USDC and DAI.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185295\/stablecoin-liquidity-on-curves-3pool-falls-to-lowest-level-since-luna-crash","publishDate":"2022-11-10T08:42:36","id":13159,"type":null,"title":"Stablecoin liquidity on Curve&#x27;s 3pool falls to lowest level since Luna crash","category":["CRYPTO ECOSYSTEMS"],"content":["Liquidity for stablecoin swaps on the Curve 3pool is now at its lowest level since the Luna collapse in May as traders continue to swap Tether’s USDT for other stablecoins, namely DAI and USDC. This has led to USDT losing its parity with the U.S. dollar amid the ongoing market tumult.","The Curve <a href=\"https:\/\/curve.fi\/#\/ethereum\/pools\/3pool\/deposit\" data-v-f87c67ca=\"\">3pool<\/a> is the largest liquidity pool on the Curve decentralized exchange. This pool provides deep liquidity for swaps among the three largest stablecoins: USDT, USDC, and DAI. Under normal conditions, the pool is supposed to provide a capital-efficient means of swapping between any of the two stablecoins in the mix.","However, the fallout of the <a href=\"https:\/\/www.theblock.co\/post\/185163\/ftx-ceo-bankman-frieds-top-priority-fundraise\" data-v-f87c67ca=\"\">FTX collapse<\/a> has upended the balance of the pool. The stablecoin reserve breakdown shows Tether’s share of the pool has risen to 86%, more than double the ideal percentage for USDT. This figure is also higher than it was during the Luna collapse when USDT accounted for 83% of the stablecoin pool.","Tether’s dominance of the pool indicates massive swaps from USDT to the other two stablecoins. Tether has lost its U.S. dollar peg as a result of traders swapping USDT for USDC. The stablecoin fell about 2.5% below peg to $0.9750 earlier in the day but has since recovered slightly to trade at $0.9907 — <a href=\"https:\/\/www.theblock.co\/post\/184653\/tethers-usdt-falls-1-below-dollar-peg-amid-market-uncertainty\" data-v-f87c67ca=\"\">which is still 1% below peg<\/a> — as of the time of writing.","Tether’s chief technology officer Paolo Ardoino <a href=\"https:\/\/twitter.com\/paoloardoino\/status\/1590671674378067968?s=20&amp;t=ZPGYQeHfMq2h2RBwRn5dRQ\" data-v-f87c67ca=\"\">tweeted<\/a> earlier in the day that was no cause for concern. Ardoino stated that the stablecoin issuer has processed $700 million worth of redemptions in the last 24 hours.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$0.9907","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"86%","content":"PERCENT"},{"type":"2.5%","content":"PERCENT"},{"type":"83%","content":"PERCENT"},{"type":"DAI","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$0.9750","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$700 million","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"Paolo Ardoino","content":"PERSON"}],"hashtag":["DAI","TETHER","USDC"],"authors":["Osato Avan-Nomayo","The Block"]}