{"summary":"There’s a large loan at risk of liquidation that, if liquidated, could have a potentially disasterous impact on DeFi protocol Solend.\nThe position has now been partially moved to another protocol, lessening the potential impact.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153207\/solana-whale-shuffles-25-million-to-reduce-risk-to-defi-protocol-solend","publishDate":"2022-06-21T08:46:37","id":1316,"type":null,"title":"Solana whale shuffles $25 million to reduce risk to DeFi protocol Solend","category":["DeFi"],"content":["The Solana whale who came on the verge of getting liquidated last week has started moving their funds to mitigate risk to the Solana-based DeFi protocol Solend, where all their funds were previously held. The so-called Solend whale has transferred $25 million of its debt to Mango markets, the Solend team <a href=\"https:\/\/twitter.com\/solendprotocol\/status\/1539190870557093888\" data-v-f87c67ca=\"\">noted<\/a> on Tuesday.","The team added that this was the result of Solend's efforts to persuade the anonymous whale (<a href=\"https:\/\/solscan.io\/account\/3oSE9CtGMQeAdtkm2U3ENhEpkFMfvrckJMA8QwVsuRbE#splTransfers\" data-v-f87c67ca=\"\">3oSE<\/a>) to spread their lending position across a second lending platform.","With the user transferring a part of their position to Mango Markets, Solend has relieved itself from suffering the full brunt of a possible forced liquidation. However, the crisis is still not fully averted, according to Solend, as this simply limits exposure to Solend itself; the trading position — and its potential liquidation — remains active.","\"This doesn't completely solve the problem however, since the large liquidation wall still exists,\" Solend wrote. \"We're in touch with the Mango team and 3oSE...uRbE to figure out a long term plan.\"","The issue started when the Solend user took a loan of $108 million in stablecoins. The loan was collateralized by 5.7 million solana (SOL) ($215 million), which represented 95% of the SOL deposits in Solend's main lending pool.","Yet when the market crashed, this loan became at risk of getting liquidated. It was estimated that this would happen if the price of SOL dropped to $22.30. The Solend team claimed that a liquidation of this size on-chain would be very risky. If the on-chain liquidation went through, the Solend protocol would be at risk of accruing bad debt due to a cascading drop in SOL's value.&nbsp;","Solend later became the subject of criticism when it <a href=\"https:\/\/www.theblock.co\/post\/152960\/solend-users-vote-in-favor-of-proposal-to-mitigate-risk-imposed-by-whale\" data-v-f87c67ca=\"\">proposed<\/a> to take over the user's position and manually liquidate it in an over-the-counter (OTC) deal. However, that proposal was later <a href=\"https:\/\/www.theblock.co\/post\/153011\/new-solend-vote-invalidates-governance-decision-to-take-over-whale-account\" data-v-f87c67ca=\"\">invalidated<\/a> over fears that it could undermine its level of decentralization, leading it to look for an alternative solution."],"hashtag":["SOLANA"]}