{"summary":"&quot;Let&#x27;s f---ing pump and dump,&quot; Portnoy declared on his daily stream after revealing that he&#x27;d bought Orchid tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/75079\/dave-portnoy-crypto-pump","publishDate":"2020-08-17T16:00:21","id":13160,"type":null,"title":"Barstool&#x27;s Dave Portnoy: &#x27;In crypto you can pump and dump all day long&#x27;","category":["CRYPTOCURRENCY"],"content":["\"Bitcoin is over [$12,000] boys, the Bitcoin world is getting f---ing interesting.\"","Barstool Sports president live-streaming day trader Dave Portnoy deposited a quarter million into a Gemini account <a href=\"https:\/\/www.theblockcrypto.com\/linked\/74884\/dave-portnoy-bitcoin-winklevoss-video\" data-v-f87c67ca=\"\">last week<\/a> with founders Tyler and Cameron Winklevoss by his side. Now, he appears to be telling people to pump and dump one of the coins listed on the exchange.","Portnoy stepped into the day trading world while quarantined in his Montauk home. With leagues suspended for the foreseeable future, Portnoy began buying and selling on E*Trade to pass the time, live-streaming his trading activity on Twitter with the moniker Davey Day Trade Global (DDTG). Portnoy gained notoriety for promoting stocks through the Barstool fan base, regularly making — and sometimes losing — six-figure sums in the hours surrounding his live-streams.&nbsp;","Portnoy has publicly declared he does not understand Bitcoin or the crypto space, though he did own some BTC that he remained unsure how to use or access. But his investments in crypto expanded after the Gemini co-founders appeared in his live-stream to help Portnoy spend the $250,000 he had deposited into a Gemini account, with Portnoy putting the majority of the funds in bitcoin and the rest into LINK, the token tied to the decentralized oracle network Chainlink.&nbsp;","In the following days, Portnoy has moved further into the crypto space, interacting with crypto Twitter as well as adding a BlockFi sponsorship for his DDTG stream. Bitcoin's price has surged above $12,000 while Portnoy waved his hammer — a green plastic hammer he uses to will the price of his holdings higher — and <a href=\"https:\/\/twitter.com\/stoolpresidente\/status\/1294313291179794434?s=20\" data-v-f87c67ca=\"\">tweeted<\/a> about his <a href=\"https:\/\/twitter.com\/stoolpresidente\/status\/1294121113786744832?s=20\" data-v-f87c67ca=\"\">hopes<\/a> that BTC would surpass the $12,000 mark.&nbsp;","On <a href=\"https:\/\/twitter.com\/stoolpresidente\/status\/1295349206526427142?s=20\" data-v-f87c67ca=\"\">today's stream<\/a>, presented by BlockFi, he said he's set his sights on Orchid, initially teasing that he would not disclose which coin he'd be buying until he \"cryptonized\" it. Once he'd purchased OXT on Gemini, he advised watchers to get in on the action, specifically calling on them to \"pump and dump\" the coin:","OXT, the token connected to the VPN-focused Orchid network, is now sitting at $0.57 after cresting to nearly $0.85 from around $0.45 earlier in the day. Portnoy said he purchased his OXT around $0.50. Gemini has not commented on Portnoy's remarks.&nbsp;","","","\"It was way down today too so I loved it, great buying opportunity,\" Portnoy said on the stream.","Portnoy continued to reiterate that viewers should pump the coin on stream, as well as tweeting later that he's now \"in on the shitcoin\" and tagging his video with #pump.&nbsp;","\"The thing I like about pump and dumps in crypto is it's encouraged,\" he said on the stream. \"I don't do that in the stock market because those little SEC guys, SEC little mice that run around and pump and dump and Dan David — I don't do the scumbag shit. But in crypto, you can pump and dump all day long, so I'm not going to tell you what I'm going to do until I do it.\"","Portnoy is clear that he's a one-man trading show, with his Twitter bio reminding visitors that though he is the head of the DDTG Global brand, he's not a financial advisor and users shouldn't trust any of his thoughts on stocks.","His latest <a href=\"https:\/\/twitter.com\/stoolpresidente\/status\/1295385416699383809?s=20\" data-v-f87c67ca=\"\">tweet<\/a>&nbsp;on the subject reads: \"Pump up the $oxt.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"Davey Day Trade Global","content":"ORGANIZATION"},{"type":"Dave Portnoy","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$0.50","content":"MONEY"},{"type":"$0.45","content":"MONEY"},{"type":"$0.57","content":"MONEY"},{"type":"Tyler","content":"PERSON"},{"type":"$0.85","content":"MONEY"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Portnoy","content":"PERSON"},{"type":"VPN","content":"ORGANIZATION"},{"type":"$12,000","content":"MONEY"},{"type":"$oxt","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"Dan David —","content":"PERSON"}],"hashtag":["GEMINI"],"authors":["Aislinn Keely","The Block"]}