{"summary":"CFTC Chair Rostin Behnam says he fears that the recent approval of spot bitcoin products introduces risks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274731\/cftc-chair-behnam-marks-concern-over-spot-bitcoin-etfs-and-says-its-time-for-new-legislation","publishDate":"2024-01-26T15:26:13","id":13168,"type":null,"title":"CFTC Chair Behnam marks concern over spot bitcoin ETFs and says it&#x27;s time for new legislation","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Commodity Futures Trading Commission Chair Rostin Behnam says he fears that the recent approval of spot bitcoin ETF products introduces risks and called again for legislation at the federal level to regulate crypto.&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam's remarks come two weeks after the Securities and Exchange Commission approved the first batch of spot bitcoin exchange-traded funds, which have so far seen billions of dollars of trading activity.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I fear that the regulatory approval of bitcoin ETPs introduces risk that, in spite of yellow flags, market participants, retail and institutional alike, may mistake the technical approval of a product—with actual regulatory oversight of the cash commodity digital assets,\" Behnam said on Friday in prepared <a href=\"https:\/\/www.cftc.gov\/PressRoom\/SpeechesTestimony\/opabehnam41\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">remarks<\/span><\/a> at an American Bar Association event.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">No federal regulator has been granted authority by Congress over the cash markets for digital assets, Behnam said. Behnam has repeatedly called for legislation to help regulate crypto. Lawmakers have worked to craft bills over the past few years, including one that would essentially give the CFTC new <a href=\"https:\/\/crsreports.congress.gov\/product\/pdf\/IN\/IN12223\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">authorities<\/span><\/a> over the cash market, though they have yet to garner the needed support with some saying the <a href=\"https:\/\/democrats-financialservices.house.gov\/news\/documentsingle.aspx?DocumentID=410718\" data-v-f87c67ca=\"\">bill<\/a> is the \"wish-list of big crypto.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The concerns I have publicly voiced for the better part of six years regarding the digital asset commodity spot market have only become magnified,\" Behnam said. \"The need for federal legislation over cash market digital assets has never been more critical, and I will continue my call for action.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">There is nothing firmly in place to \"address the opaque and inconsistent practices in the cash markets for digital assets\" around issues like conflicts of interest and customer protections, Behnam said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Instead, the ETPs have taken a speculative and volatile asset, wrapped it in a thin layer of indirect regulation, and packaged it as a shiny new product,\" Behnam said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Behnam also touted his agency's move in going after bad actors in crypto and said the agency became the \"premier enforcement agency in the space\" in 2023.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency brought 47 digital asset-related actions out of 96 in total in fiscal year 2023. Notable cases included those brought against former FTX CEO Sam Bankman-Fried, crypto exchange Binance and its CEO Changpeng Zhao, and Celsius and its former CEO Alex Mashinsky.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"As everyone in this room knows, we can only act on digital asset fraud or manipulation when we uncover or discover anomalies through regulated market surveillance and oversight, or through tips and complaints we can pursue,\" Behnam said. \"We are doing all this—and making the headlines—with a restrictor plate installed,\" Behnam added. \"Imagine what we could do if we were given the tools to open up the throttle?\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Commodity Futures Trading Commission Chair Rostin Behnam","content":"ORGANIZATION"},{"type":"Behnam","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"American Bar Association","content":"ORGANIZATION"},{"type":"fiscal year 2023","content":"DATE"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}