{"summary":"Psychologist and author Jordan Peterson cautioned against &quot;unbridled enthusiasm&quot; in his Bitcoin 2022 fireside chat.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141340\/jordan-peterson-cautions-against-unbridled-enthusiasm-for-bitcoin","publishDate":"2022-04-08T15:54:32","id":13164,"type":null,"title":"Jordan Peterson cautions against &#x27;unbridled enthusiasm&#x27; for Bitcoin","category":["BITCOIN"],"content":["Psychologist and author Jordan Peterson spent a significant portion of his Bitcoin 2022 fireside chat playing devil’s advocate against the Bitcoin ecosystem.","Peterson insisted he wasn’t expressing a personal opinion, frequently employing the phrase “and I’m not saying it is,” after positing uncertainty surrounding the ecosystem. Still, he cautioned the Bitcoin community against possible unintended consequences of decentralized money.","Peterson was clear that he sees centralized control as an obstacle to \"ethical\" outcomes, but he was less clear on whether bitcoin itself was the remedy.","\"The idea of a decentralized monetary system, well, that is a revolutionary idea, and the more I thought about it, it makes me wary,\" he said.","Cash, he posited, is something of a decentralized system in its own right since it's virtually untraceable. \"And thank God,\" he said, since if it were traceable, centralized institutions would likely try to manipulate consumers into making what they discern are ethical decisions, which they are unlikely to accurately discern, according to Peterson.","Cheers broke out as Peterson posited that the growth of bitcoin could over time take money out of the hands of the political system, but then Peterson continued:","\"As a social scientist, that also worries me.\"","Peterson reminded attendees that new ideas can have unintended — and unexpected — offshoots. It's hard to ensure that all of them will be positive.","\"We have no idea what would happen if money was actually decentralized,\" he said. \"If we manage that, let's say bitcoin attains primacy, is it irreversible? Is that permanent? And then you think, 'Well what if it's a bad idea?' and it's irreversible.\"","While he said he's not pessimistic about bitcoin's effect, but rather that he's cautious.","\"The probability that you invent something extremely powerful and it only does the things you think it will do and all those things are good, it's like no, that never happens.\"","An exodus of fiat would have repercussions for government control, according to Peterson, and it's not clear what that will do. Though the activity of central banks could be construed as theft, he said, and the activity of elected officials can be dubious, governments still provide structure.","\"Most of us assume that taxation is acceptable, or at least we don't strike up the revolution because it has occurred,\" he said. \"We seem to think that there is a role for government and for the determinations that the government makes outside the free market, per se. Obviously, the government has to exercise some control over currency, over money, in order to make its functions possible.\"","We don't know what will happen if we take that control away, according to Peterson. Still, he said his comments aren't meant to be a criticism of bitcoin, but rather derive from years of watching social scientists mount large-scale social experiments that ultimately don't work.","\"I'm not really suggesting that you do anything as a result of this caution, I'm just saying that unbridled enthusiasm predicated on the assumption that your new system will only do the good things you think it will do, that's not wise,\" he said.","But, he mused, perhaps the best way forward is to let the free market decide, and if bitcoin wins the battle of the currencies, so be it.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jordan Peterson","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Peterson","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Aislinn Keely","The Block"]}