{"summary":"The crypto app has issued a default notice against Three Arrows Capital for failure to repay a loan worth more than $650 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154316\/voyager-digital-issues-default-notice-against-three-arrows-capital","publishDate":"2022-06-27T08:05:52","id":13169,"type":null,"title":"Voyager Digital issues default notice against Three Arrows Capital","category":["COMPANIES"],"content":["Voyager Digital, a crypto app offering up to 12% returns, said it has issued a default notice against Three Arrows Capital for failure to repay a loan worth more than $650 million.","The crypto platform issued the notice to Three Arrows Capital, the crypto hedge fund known as 3AC, over a debt of 15,250 BTC ($325 million) and 350 million USDC,&nbsp;according to a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/voyager-digital-provides-market-update-301575492.html\" data-v-f87c67ca=\"\">statement<\/a> on Monday. Voyager said it continues to operate and fulfill customer orders and withdrawals. It has accessed $75 million of the credit line <a href=\"https:\/\/www.theblock.co\/post\/152928\/voyager-digital-obtains-loans-from-alameda-research-to-safeguard-assets\" data-v-f87c67ca=\"\">agreed with<\/a> Alameda Research this month and may make further use as needed.&nbsp;","\"We are working diligently and expeditiously to strengthen our balance sheet and pursuing options so we can continue to meet customer liquidity demands,\" CEO Stephen Ehrlich said in the statement.&nbsp;","As part of this process, voyager has engaged Moelis as a financial advisor, the statement added.&nbsp;","Singapore-based 3AC had its positions&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/152665\/ftx-deribit-bitmex-liquidated-three-arrows-capital\" data-v-f87c67ca=\"\">liquidated<\/a> this month after it failed to meet margin calls. The fund, which was founded in 2012 by former classmates Su Zhu and Kyle Davies, faces significant losses following last month's collapse of the Terra ecosystem and its native luna token. Davies told The Wall Street Journal that the firm is \"hoping to reach an agreement with creditors that would give it more time to work out a plan.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kyle Davies","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"$325 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"$75 million","content":"MONEY"},{"type":"Moelis","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Stephen Ehrlich","content":"PERSON"},{"type":"$650 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Andrew Rummer","The Block"]}