{"summary":"The founder of Flashbots and the founder of Uniswap argue that the Ethereum community must stop tearing itself apart.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178944\/ethereum-figureheads-community-needs-to-stop-eating-itself-alive","publishDate":"2022-10-21T11:02:49","id":13177,"type":null,"title":"Ethereum figureheads: Community needs to stop eating itself alive","category":["CRYPTOCURRENCY"],"content":["Two prominent Ethereum figures said the ETH community must be more positive and focus more on solving its problems, rather than complaining about them.","While Ethereum underwent its most ambitious upgrade to date last month — seamlessly transitioning from proof of work to proof of stake — its community has been focusing on other issues. Chief among them is the rising level of censorship that has resulted from sanctions placed against crypto mixer Tornado Cash, helped in part by the increasing use of a service called Flashbots.","Flashbots founder Phil Daian <a href=\"https:\/\/twitter.com\/phildaian\/status\/1582873972475310081\" data-v-f87c67ca=\"\">said<\/a> on Twitter that it’s time to be more constructive. “ETH has a small but growing maxi contingent that sits on the sidelines but sees tarring and feathering others in the community as acceptable. I've seen this movie once before and it ends poorly.”","Flashbots has become a major target for this sort of criticism. The service supports a form of front-running called maximal extractable value (MEV), which is a growing problem for the network. Flashbots' approach is not to not pretend the problem doesn’t exist, but to provide a home for it and let Ethereum developers and the community figure out how to adapt to it.&nbsp;","Flashbots also censors transactions related to Tornado Cash due to the U.S. government sanctions that were placed against the protocol. Since the Flashbots service is used to <a href=\"https:\/\/transparency.flashbots.net\/\" data-v-f87c67ca=\"\">create 49%<\/a> of Ethereum blocks, this has had a big impact on the blockchain and caused many community members concerns that this could lead to broader censorship on the network.","While MEV and censorship are two separate issues, they are tied together because Flashbots censors transactions and is the protocol used for a strong majority of MEV-related transactions.","Daian defended Flashbots, arguing that if MEV is allowed to grow unchecked, it could become a greater problem. While Flashbots does enable MEV to take place, he said it will help Ethereum to avoid censorship in the long term.","Addressing the present state of Flashbots’ dominance, he said that it’s not resulting in network censorship because blocks are still being produced that don’t censor transactions. As a result, transactions are not being blocked from the network, they are only being delayed. And he doesn’t see an outcome where Flashbots is used to create 100% of blocks (which would result in full censorship).","If MEV is not enabled and addressed within the Ethereum ecosystem, Daian said the situation would be worse. He likened it to the way high-frequency trading has marred the traditional financial system.","If MEV were to spread unchecked on Ethereum in the same way, he <a href=\"https:\/\/twitter.com\/phildaian\/status\/1583122872390012928\" data-v-f87c67ca=\"\">said,<\/a> it would be unfortunate: “If we can't avoid this dystopia long term, censorship resistance is lost.”","Uniswap founder Hayden Adams <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1582927270712586245\" data-v-f87c67ca=\"\">chimed in<\/a> with support for Daian’s viewpoint. He argued that attacks on those building in the Ethereum ecosystem should stop.&nbsp;","“The reality is the scale, ambition, and complexity of what Ethereum is trying to accomplish does not play well with constant shaming, outrage, and purity tests,” he said.","Adams added that Ethereum’s growth has been faster than most people expected and this has led to unprecedented challenges.","He said: “The Ethereum community needs to grow and adapt to these new problems, not eat itself alive.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hayden Adams","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Daian","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"49%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Phil Daian","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SANCTIONS","UNISWAP"],"authors":["Tim Copeland","The Block"]}