{"summary":"In this episode of The Scoop, Frank and Teo ask questions that cover a variety of topics spanning Emilie&#x27;s rise at Coinbase to why crypto exchanges shouldn&#x27;t be compared to their traditional counterparts and more.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/25055\/emilie-choi-coinbase","publishDate":"2019-05-29T16:44:42","id":13172,"type":null,"title":"A Conversation with Emilie Choi, VP Business and Data, Coinbase","category":["PODCASTS"],"content":["\n<style data-v-f87c67ca=\"\">\n\t.transcript {}\n\t.transcript .speaker {font-weight: bold;}\n<\/style>\n","<em data-v-f87c67ca=\"\">The following transcript is taken from episode six of The Scoop, The Block's new podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>, <a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>, <a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" data-v-f87c67ca=\"\">Google Play<\/a>, <a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback to <a href=\"\/cdn-cgi\/l\/email-protection#6f1f000b0c0e1c1b2f1b070a0d03000c040c1d161f1b00410c0002\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"05756a616664767145716d6067696a666e66777c75716a2b666a68\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length. <\/em>","<em data-v-f87c67ca=\"\">Frank Chaparro and Teo Leibowitz interview <a href=\"https:\/\/www.linkedin.com\/in\/emiliechoi\/\" rel=\"noopener noreferrer\" target=\"_blank\" data-v-f87c67ca=\"\">Emilie Choi<\/a>, VP of Business, Data &amp; International at Coinbase in this episode of The Scoop. Frank and Teo ask questions that cover a variety of topics spanning Emilie's rise at Coinbase to why crypto exchanges shouldn't be compared to their traditional counterparts. Emilie also shares her thoughts on what Coinbase's focus areas are in the near future and the implications of decentralized finance for the centralized finance business model.<\/em>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Hi guys, my name is Frank Chaparro senior correspondent at The Block. You might know me as Frankie Scoops or Fintech Frank but hopefully now you'll get to know me as the host of The Block's new podcast called The Scoop. Made especially for decision makers and thrill seekers in the crypto market. Each week I along with one of my cohorts here at The Block will talk with CEO's, innovators and builders across the crypto market. <a href=\"https:\/\/www.coinbase.com\/\" data-v-f87c67ca=\"\">Coinbase<\/a> is probably the poster child for crypto trading in the U.S. Recently, the 800 person firm has been going through a ton of changes, it's CTO and head of institutions recently announced their respective departures and the firm wound down an operation in Chicago. <a href=\"https:\/\/twitter.com\/emiliemc?lang=en\" data-v-f87c67ca=\"\">Emilie Choi<\/a> who was brought on to lead M&amp;A for the firm in 2018 has been slowly rising through the ranks during this shifted period at the San Francisco company. She now leads the firm's international business, M&amp;A, venture. She joined myself and Matteo Liebowitz on this episode of The Scoop in which we examine how Coinbase makes deals. Why she's bullish on its Earn platform and whether the firm will end up diving into the booming derivatives market. I'd like to take a minute to thank our sponsor Cash App. Cash App has been the number one finance app in the App Store for almost two years. It was also the first major peer to peer payments app to start supporting bitcoin and it's still the fastest and easiest way to onramp fiat. No more waiting five days for your ACH payments to come through. With Cash App you can buy Bitcoin instantly. It's also a favorite of The Block, analyst Steven Zhang -- he uses Cash App when he goes to Chipotle and gets money back. He saves every time he eats a burrito. That keeps Steven happy, that keeps The Block happy and that keeps the crypto world informed with the best news and research in the entire market. You can also use it at Lyft, Whole Foods, Chipotle, Chik-fil-A, Starbucks and Dunkin Donuts. Download Cash App today from the App Store or Google Play. I hope you enjoy the episode. Thank you everyone for tuning in to The Scoop, we have a very special episode today. We are offsite for Consensus 2019. Well maybe I shouldn't even plug Consensus, I should plug Atomic Swap, our conference that's tomorrow. But in any respect I'm sitting across the table from Emilie Choi from Coinbase. She is their head of mergers and acquisitions, she leads the international business. She just practically has 30 job titles at this point and we're going to dive into every single one of them today. I'm joined by Matteo Liebowitz -- our genius and Ethereum head. And we're very excited to dive into this conversation. Thanks so much for joining us. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Thanks for having me. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  No problem. I guess the best place to start probably would be your job. Again, I was joking about it in the intro but you have taken on a ton of new responsibilities with the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/05\/03\/coinbase-cto-balaji-srinivasan-is-leaving-the-cryptocurrency-exchange\/\" data-v-f87c67ca=\"\">exit of Balaji<\/a> and already leading massive important parts of the business. So tell us a little bit about what your role is and what you're responsible for. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  The core job I came in to do was to lead corp dev which is M&amp;A. I also run all the business functions related to that including business development which is partnerships. I launched our ventures portfolio which we've done about 50 investments there over the past year. I run business operations and strategy which helps the company scale and build the right business process. Data, international and institutional coverage are the other things under my mandate. So these were not necessarily things that I owned from day one but one of the things that I think is coolest about Coinbase is just that you can take on more and more responsibility as you prove yourself. And so it's been fun growing those different functions over time. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Which one do you think you have your hands on the most? Because if you're covering that many business lines I imagine you have to delineate responsibilities, you can't be involved in day to day decision making? But is there any particular business that is the one you're involved in the most. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I probably spend the most hands on time on things related to biz ops because we're growing so fast and we 3X'd last year. And when that happens so fast things break. So you have to think about like how do you implement new processes for people to set goals or how do we think about communicating better now that we've gone from 200 people to more than 700 people? And then how do we think about prioritizing different goals like when we have a bunch of different opportunities ahead of us. The hardest thing is to figure out how do you stack rank those things and focus? So that's where I spend a lot of time. And then obviously on the corp dev side we've been really active, we've done 15 plus acqui hires and acquisitions. And so that's another area that I spend a lot of time on. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Let's focus in on venture first, 50 deals you guys have been involved in and relatively a late entrance into the space. I mean you guys launched the venture arm a year ago. How do you get in on deals? How do you move and elbow your way in and what distinguishes a good project to invest in from a bad one?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I would actually argue we were early in the sense that I think we were the first crypto company to launch a ventures fund. One of the cool things about Coinbase is that we have a lot of great Coinbase alums who are going to found companies that's something <a href=\"https:\/\/twitter.com\/brian_armstrong\" data-v-f87c67ca=\"\">Brian<\/a> loves is entrepreneurial DNA within the company. We never want people to leave, those who do leave to found companies -- he gets really excited about. Oftentimes that's a great source of investments for us. And then our network is so rich because we have people in the ecosystem, friends of the family like people like <a href=\"http:\/\/fortune.com\/the-ledger-40-under-40\/olaf-carlson-wee-23\/\" data-v-f87c67ca=\"\">Olaf<\/a> and others who are seeing interesting things so we're constantly connecting with different folks in this space and finding out what's interesting. What's interesting about Coinbase ventures is we don't actually have any dedicated team. We're super scrappy so it's a group of people who are doing it as a side job. We all have day jobs and this is something that's a privilege to work on in your extra time. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  So can anyone just say that I want to be a part of this? [laughs]","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  No we targeted really crypto forward people at the company who have great connections in the space. People who love to already just reach out to the different projects in the space that they find interesting and we're already doing that, that's the profile that I'm looking for internally. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  So does the buck stop with you in terms of making investment? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We vote on every investment as a team. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  I see. What has been something that... just trying to break down your philosophy, so to speak. A lot of V.C. people when I was a business [...] would interview tons of venture capitalists about how they go about investing in companies, sometimes it's the people that are paramount. Other times its the business model etc.. When you're investing in this market what is the absolute number one thing that a company has to show or represent for you to make that investment or even to consider them? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  To have an amazing team is foundational, assume that's something that we care about most because an amazing team will figure things out in the same way that Stewart Butterfield developed a startup that was focused on gaming that didn't work out and then he spun it into Slack. If you invest in amazing founders they will figure something out even if it's not immediately. But then I think that the way we think about the types of companies we invest in. One is, are they potentially helping us achieve our mission of creating an open financial system for the world? So companies such as <a href=\"https:\/\/compound.finance\/\" data-v-f87c67ca=\"\">Compound<\/a> or <a href=\"https:\/\/www.dharma.io\/\" data-v-f87c67ca=\"\">Dharma<\/a> or <a href=\"https:\/\/celo.org\/\" data-v-f87c67ca=\"\">Celo<\/a> that are doing interesting things in <a href=\"https:\/\/defi.network\/\" data-v-f87c67ca=\"\">DeFi<\/a> are obvious fits for us. We love things that are strategic adjacencies too, things that we want to touch down the line but don't necessarily have a great handle on right now -- things like security token companies. We also have very different to traditional Silicon Valley style investing because this is such an open community and ecosystem. We actually invest in competitors so we've invested for example in several competitors of Coinbase wallet. I think we don't have a monopoly on good ideas and perhaps some of these other companies are going to figure out cool innovative... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Yea like you guys invested in <a href=\"https:\/\/staked.us\/\" data-v-f87c67ca=\"\">Staked<\/a> and then two or three weeks after that investment was announced you guys launched your own offering that completely rivals it. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We don't know how this space is gonna play out, right? So we always are upfront with these different companies about like hey we obviously are going to launch or have a competitive offering but if you're open to it we'd love to participate and hopefully we can both co-exist in a way that just brings the whole ecosystem forward without us feeling like there's some very tiny piece of pie that we can all fight over. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  How do you go about getting in on a deal that you might not have access to? What does the deal pipeline look like? And does Coinbase have a good access to it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I think we have incredible access because of the Coinbase alumni network we have. If you think about the three most important non-corporate venture funds in crypto, there's many but three of the foremost are gonna be [...] <a href=\"https:\/\/polychain.capital\/\" data-v-f87c67ca=\"\">Polychain<\/a> and <a href=\"https:\/\/a16z.com\/about\/\" data-v-f87c67ca=\"\">a16z<\/a> so those are all people that we were intimately in contact with and worked with very often and so we've got that but actually most of the time we already know these people it's just whether they're in our backyard or we're interacting or we're talking about partnering we feel like we have access to the best and the brightest in the community. Occasionally I think the only pushback I've ever really gotten is just do people really want a strategic investor because of that competitive issue? And I'm always like well if we can get comfortable with it hopefully you can and that's been the only time that we've ever gotten any resistance otherwise people are pretty open. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  So you definitely see a lot of the same crypto funds, you know the a16's, the <a href=\"https:\/\/medium.com\/paradigm-fund\" data-v-f87c67ca=\"\">Paradigm's<\/a>, <a href=\"https:\/\/www.panteracapital.com\/\" data-v-f87c67ca=\"\">Pantera's<\/a>, participating in the same deals. How do you see these funds distinguishing themselves in the in the V.C. market over the long term? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  You should actually have a segment where they talk about their different approaches. But I think that you're seeing that they have different visions of potentially where the world might be going. And so I think Paradigm's first investment was <a href=\"https:\/\/twitter.com\/starkwareltd\" data-v-f87c67ca=\"\">StarkWare<\/a> which a16z didn't participate in. I actually don't know the thesis as to why one of them did and one of them didn't and things like that but what I find interesting is that you're actually seeing some of these core firms just not participate in the same deals which I actually think is super healthy. I think it's healthy that different people have different theses because none of us know exactly how the space is going to play out. I think it be will be interesting to host them and see what they have... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  I look at some of the deals or at least the announcements when I get hit up by public relations firms about a one million dollar fundraise and there's 70 firms it seems on the deal with all these party rounds. Do you think that because all these hedge funds in 2018 pivoted to V.C. then now we're in a space where there's just too much fun, happy money floating around and it's driving up valuations or do valuations look reasonable? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Valuations are definitely healthy. So even when crypto prices were quite down we weren't seeing much fluctuation in the prices of the the private companies that were raising funds. And I actually think it's a good barometer of the fact that the venture funds that are investing in these things believe in the long term vision of this stuff. They're not going to get hung up on short term prices and they'll go ahead and bid up those most valuable assets with the best teams and technology. For example we primarily only do seed rounds, so when you see 10 different investors listed and we're on that it's probably because out of a million dollar round we've done 100 to 200K and so by it's very nature it's just going to be a number of different funds. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  The deal that really sticks out to me on that front was <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/starkware-revs-up-fundraising-with-30m-round\/\" data-v-f87c67ca=\"\">StarkWare -- they raise 30 million dollars in a series A<\/a>. Do you think that's a natural size for a series A deal?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I think for really high quality tech. That team is pretty darn good... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  You can say damn [laughs]. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Pretty damn good. I think it's it's a strong team. We want to experiment with partnering with them and playing around with their technology for scaling and I'm happy to pay that price given where that company could go. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  What does that company do? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  They have several different offerings but it's based around this Stark technology. It's very interesting that you said you're interested in partnering with them, does that mean that Coinbase is going to go the <a href=\"https:\/\/www.theblockcrypto.com\/tiny\/binance-gives-a-sneak-peek-of-its-decentralized-exchange\/\" data-v-f87c67ca=\"\">Binance route and launch a decentralized exchange of their own?<\/a> ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Don't they have a decentralized exchange?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Oh us? We acquired <a href=\"https:\/\/paradex.io\/\" data-v-f87c67ca=\"\">Paradex<\/a> for decentralized exchange. I think the decentralized exchange space, it's gonna be interesting to watch it play out. I think it has a lot of potential. Obviously we are the fiat to crypto bridge. We're the fiat to crypto bridge and we play a different role than others in the space in terms of trying to be the safe trusted center of the crypto economy. We have to make sure that if we offer a dex that we're doing it in a way that is safe and secure and compliant. I think that there's not a lot of clarity right now on how that would work. We think this space is interesting but we're not actively investing in it right at this moment  ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Let's talk about the elephant in the room, CZ and Binance and you guys have been aggressively, wouldn't say it's a pivot but you guys are definitely trying to go after some of their business in Asia and internationally and pick away at their mounting volumes. How do you do that? How do you do that, what do those customers want that Binance has that Coinbase can either replicate or improve on?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  First of all I'll say we love what Binance is doing and I mean that very genuinely. I think that there is going to be a massive pie for all of us to go after and we welcome competition like them in this space because they're innovating constantly, they're pushing the boundaries of what's possible and they're creating awareness for the the overall crypto market which we welcome. But we couldn't probably be more differentiated than them in terms of the focus on the fiat to crypto bridge and being that safe trusted center of the crypto economy. So I think they're playing one game, we're playing another. I think we'll both have great frothy lucrative businesses that we can build upon and we welcome them. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Taking it back a step Coinbase ventures has stakes in Dharma now, Compound, <a href=\"https:\/\/umaproject.org\/\" data-v-f87c67ca=\"\">UMA<\/a>. Do you think that these open finance applications can attract interest beyond the retail market? And what are the main obstacles to institutional participation in these venues? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  What we do is we watch activity happening in the decentralized financial space and actually we think of it oftentimes, the first user we think about is the active trader on Coinbase pro for a lot of these different applications. And if you see the activity that's happening and things like margin, borrow, lend, derivative constructs that are happening on other platforms there's a lot of activity and there's there's a lot of revenue being generated. We are never going to be the place where there's 100X leverage, right? We're not going to offer a casino to our our users because when we're playing with people's money we're gonna be a lot more careful with it. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  What about 5X leverage? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  That feels reasonable. That would be more the game that we would play. So I think it's like back to this whole safe trusted center that we would think about ways to offer those different types of services in a way that we feel like protects our users and creates value for them. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Is there any plan to introduce the kinds of non-custodial features that these dexes do offer? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We're thinking about it, these are questions that we still have to explore with the regulators about what's appropriate and what's not. We're trying to figure out whenever we do these; what is the lightest weight way possible to enter the market without having a bunch of onerous ways to deal with that? Clearly we think that that's a huge market and something that we would like to explore for sure. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Sorry to drag on. Let's think 10 years ahead and these open finance protocols have taken off, there's an interest beyond retail. What does that mean for Coinbase's business model? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  The way I think about our business is we have the retail brokerage. We have the exchange and we have the custodian. We think about Coinbase.com as being accessible to everyone, we think about Coinbase pro as being accessible to people who are active traders who want more advanced features and then we think about offering services to institutions right now who are very crypto forward. And then over time as more traditional institutions enter we'll be offering more products and services to them. The things that are really taking off on the institutional front for us are OTC and custody -- that's where we're doubling down right now. We were hitting some pretty great numbers on the custody front and we just launched OTC and that's doing great as well. The way that we differentiate is if you think about the fact that we can offer OTC trading out of custody as opposed to just a pure custodian, those are things that we can offer a suite of services that others can't. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  That's pretty interesting. We've talked about what venture looks like. We talked about how you approach some of the deal making you're involved in. We've talked about new products, new markets that Coinbase might dive into. Let's shift gears a little bit and think about at the micro level, what it's like to be you and your experience at Coinbase, there's been a lot of changes obviously in the headlines. You can see teams winding down different... whether it's the index fund a year ago or last year or the Chicago team or scaling back on the institutional front and then expanding into new areas internationally and with USDC people coming and going. It's this massive firm now, we were talking about before we turned on the mics, how do you manage all this change and how do you deal with it? Like, do you meditate? [laughs] What does it look like?  ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I would love to try to meditate, I think... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Sorry, I don't wanna interrupt but I feel like it might be easy for people to look at all these changes and think jeeze like, what's going on there? What the hell?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I come back to, we've gone through this period of hyper growth, we have had the benefit of having a company that got to grow really really quickly and with that comes a lot of change. There are people who are going to be better suited for the zero to one phase of Coinbase and there are people who are going to be better suited for the next phase of Coinbase. I'm one of those people, right? Because I've been at slightly bigger companies, I was at LinkedIn when it was four hundred I left when it was thirteen thousand people. So we want people who want to be here now and we celebrate the people who have contributed to getting it from zero to 1 and who want to go found their own companies. I also think when you go through hyper growth you spin up a lot of products that seem really interesting and you know better than anybody that this market is really dynamic and moves really quickly and certain things prove to be really really great and certain things just prove not to be great. And we're doing that at hyper speed so you see that at other tech companies probably in slower motion but the same exact dynamic happens with products... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Can you think of a parallel when you were back to LinkedIn? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>   Yeah I mean... I am not going to speak to this exact product but there was a product that we were excited about launching and then we realized that it had potential privacy concerns and so we had built it up to this really interesting product feature, couldn't get comfortable with the data implications and so we scrapped it. Those types of things are deflating for the product teams that are working on these different things but you also learn a lot. One of the values that I love about Coinbase is continuous learning. We make mistakes, we learn from them and we hopefully don't repeat them in the future. But I think you should always expect that with product features, we're not going to have a 100 percent hit rate on them. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  What do you think the <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/23\/coinbase-is-pulling-the-plug-on-a-massive-project-to-upgrade-its-platform-and-it-could-result-in-a-multi-million-dollar-loss\/\" data-v-f87c67ca=\"\">biggest learning experience from winding down Chicago is<\/a>? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  It's probably that we don't want to make a massive bet in a different geo with only one product. When I think about our other offices such as New York, London and Japan -- we have all sorts of functions working there, we have all sorts of verticals working there. You're not betting the farm on one thing, whenever this kind of stuff impacts a bunch of employees you feel really bad about how things ended but I think ultimately for that too, it's something that we had a thesis on, we realized that it wasn't pressure testing the way that we thought it might and I think we mutually agreed that this was the wrong thing to focus on given all of the other priorities we have right now. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  I remember one time I wrote a story about, I don't know if it was expanding into one of your offices, the most recent one... Not Chicago maybe it was Japan but I wrote \"Coinbase also...\" And Elliot never lets me forget this \"Coinbase also has offices in New York, in San Francisco and Portugal\" instead of Portland [laughs]","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We have the gorgeous Lisbon office... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Coming soon. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  I  think a great segue from Portugal to the <a href=\"https:\/\/www.theblockcrypto.com\/2018\/12\/19\/coinbase-to-relaunch-earn-com-as-coinbase-earn-the-latest-iteration-of-a-product-with-many-former-identities\/\" data-v-f87c67ca=\"\">Earn acquisition<\/a> makes alotta sense. Matteo has a question about that, what is it? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  I do have a question about that. The question being what kind of returns have you seen? And do you expect to see from the acquisition of Earn.com especially now that Balaji has left Coinbase, was he kind of essential to the continued progress?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  First of all I'll say working with Balaji has been truly one of the great pleasures of my career. I have never worked with somebody who has both the depth and breadth across so many different functions. The benefit of that is that we got essentially the equivalent of five years of amazing work from an amazing person in crypto or an amazing technologist in crypto. It was just a delight working with him and we'll be friends for life. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  With the Earn acquisition, I think we can very confidently say and I think the board and the management team would agree with us 100 percent is that the Earn acquisition more than paid for itself multifold in the course of this year. We're going to continue to see massive amounts of value from it. I don't necessarily think the ecosystem understands the value of it now. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  How? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  If you think about the fact that we're currently in what we think of as the investment phase of crypto, which is a lot of speculation and things that are speculation oriented, we all want to drive to more of a utility phase of crypto, right? Where people find crypto actually useful and understand how to use it. The genius of Earn was that you get these <a href=\"https:\/\/news.earn.com\/launch-your-token-with-an-earn-com-airdrop-97715970f8c7\" data-v-f87c67ca=\"\">Earn drops<\/a> and then you're able to take a learning and development course about these different assets and then you get the Earn drop in your account so you're getting paid for learning about these different assets which to me is so uniquely cool about crypto and what we can do to bring everything forward. We're seeing amazing engagement from the initial Earn drops and we continue to integrate that deeply with with the consumer experience first. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  You guys as part of the stellar airdrop which was something like one hundred and twenty five million dollars going, my understanding of the strategy was let's drop this on on two different customer sets. One that is super hyper engaged and one with the folks that maybe haven't engaged in the platform for a while, the sort of A-B test like how those sort of influences can change behavior. I don't know if that's exactly precise but I'd like to know what the strategy was and how it played out?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We have an amazing data team, we're gonna keep A-B testing every one of our products but you can imagine a world where with Earn drops we want to be able to continually test like: is this better for existing customers? Is this a great customer acquisition tool to get new customers? Like what are those different things... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Does it work in attracting new customers? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We're playing around with that. We certainly see engagement from existing customers. This is all in this very early phase but the initial test results have been really really promising. I personally think that this is going to be one of the big things and levers that moves us forward. I'm super bullish on Earn ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Really? So like is it just as important as trading in custody when we think about the big aspects of the business? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  It bolsters both trading and custody in the sense that if you're educated about the assets you're going to probably buy and hold them in some way and use them in some way. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Speaking of Balaji and Earn.com, Earn.com used to be 21.co which was a kind of personal mining type company. Coinbase ventures recently invested in Coinmine which is a similar concept. 21.co had to pivot to Earn.com because this idea of retail mining didn't quite take off. How has the retail mining landscape changed between at a time when Balaji was leading 21.co to now where we have Coinmine coming up, where you think it will be a successful investment? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Actually Balaji is the one who referred Coinmine for the investment, he was the biggest proponent of them probably because he knows that space so intimately. Stepping back a bit I think one of the dynamics that he and I have talked about  quite a bit is the funny thing about crypto is sometimes something takes off then it goes away and then it takes off in a bigger way. I'm not saying that personal mining is one of those things, I don't know enough about that space to be able to comment on it. I would say that I think that dynamic is really interesting and crypto it's like maybe the first instantiation doesn't work as well and then later on it comes back rip roaring because people figured out how to offer it in the right way or it was just better timing. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  I think we're actually seeing that right now with [...]. You know we had [...] in 2016 which didn't end particularly well and now we have [...] which is about to pass a million dollars in their Treasury. You were talking earlier abot how you have hands in various different pies... You have various different hats at Coinbase. Presumably there isn't this kind of strict firewall between the Coinbase ventures team and the exchange team. Do you think that's perhaps a possibility for conflict of interest to arise when it comes to the exchanges decision to list various different tokens? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  It's a really important question and it's something we take really seriously. We have I would argue probably the strictest rules in place about Chinese walls between venture decisions and listing. You'd be surprised how people who are on the digital asset listing committee will recuse themselves from the tiniest bit of connection or anything so I think we have a really good policy in place. We have an exceptional GC who comes from traditional finance and made sure that we had that in place and I feel really comfortable with the way we've implemented it. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  When you were at LinkedIn it was presumably more traditional M&amp;A activity. Many of the projects that you're investing in today I presume on the equity side of things also have this liquid token component that eventually trades on secondary markets. How have you adapted your investment process to account for this kind of hybrid public private structure? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  This goes back to the integrity of the process. We actually have not invested in tokens to date. We've only invested in traditional equity just to keep things really clean. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  There are no SAFT deals? You have no rights to the UMA tokens? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  No SAFT deals. What I would say is we reserve the right to be able to do that in the future but to date we've only invested in vanilla equity just to be super careful and we want to just make sure that we have a really good handle on how the universe is evolving before we make any decision on the token front. That's the way we have done it. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  When you were brought on, the idea and the headlines that I saw was that this rockstar M&amp;A person was going to come on and just do a deal spree. Do you think the mandate that you were brought on for, obviously your role has changed but specifically on deals, has that mandate changed at all? Have you been successful in your opinion in what that might have been? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Yes. We've been very successful. Honestly I think Brian's happiest moments are seeing founders and entrepreneurs who are building products at Coinbase and I think we offer them a really unique perch because they are able to drive and build amazing products that can serve our massive user base. They are going to get positions that give them a lot of autonomy and freedom to be able to kind of flex. I mentioned, I think we've done something like 15 plus acquisitions and acqui hires, we don't announce all of them but when I think about the people who are doing the impactful work at the company so many of them have come from these acqui hires and acquisitions. They were working on problems that were very similar to the things that we're trying to solve at larger scale and so they come in and they're just ready to kick ass and they're doing an amazing job. We're really happy about it and if anything I would say Brian wants to put our gas on and just make sure that we're continuing to accelerate the pace at which we're bringing in great crypto talent and technology. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  What do you think some of the next big deals will be? Like in what areas of the market?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Our bread and butter will continue to be what I call talent and technology tuck-ins. So that includes acqui hires but it also includes like maybe for example if somebody is doing some amazing thing and staking that we haven't yet built and they just started building it and they have a proof of concept and then we want to bring that in and help them rebuild it because they've already been thinking about that problem forever. That's perfect. Like that is perfect when they're already working on the things that we want to solve. And then at some point there are going to be things that we want to consolidate. I think there's gonna be real business opportunities that we want to consolidate, particularly on the institutional side. You can imagine a world where the things that we're doubling down on including custody are areas that we want to think about for M&amp;A. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Do you think he'd ever buy another exchange? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Possibly. I feel really good about where we're going with that business so if we feel like it really helps us in some meaningful way to get more liquidity or something I can see that happening. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  I just feel like it has to happen because your valuations are insane. When you think about what you trade and what your valuation is. All exchanges in crypto relative to the capital markets like Nasdaq I think trades equities, futures -- millions of millions a day and they're valued at 14 billion. We have a crypto market that's two hundred and ten billion dollars of a market and your valuation is 8 billion. I feel like just by virtue of that, maybe I'm talking out my ass, I don't know. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I think crypto is a growth place though; I would hate to be compared to a traditional exchange because we're so different... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  How would you compare it? I mean you're the M&amp;A person, like how would you model it? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I always look for growth businesses over traditional mature businesses and I love the idea that in crypto, for example I was mentioning before that we are a brokerage and exchange and a custodian -- that doesn't exist in the offline world. As much as you want to make analogies between us and traditional finance, I actually find the comparisons are less relevant these days. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  So Coinbase actively promotes this idea of an open financial system. It's really the Coinbase motto if anything is and recently within the crypto sphere there's been a lot of discussion around relaxing accredited investor rules. What are your thoughts around that? Do you think that opening the private market up to retail would actually lead to retail investors capturing value? Or do you think professional VC's would continue to dominate the market?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I think that this is going to be a huge area of opportunity, I just don't know what the timing might be like and what the steps to that might look like. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Do you think it's a good idea though? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Of course, to make cap tables accessible to a much broader swath of people who want to get access to them? Absolutely 100 percent and I think that day is gonna happen. In terms... I'm not sure, were you going down the line of like KYC or were you going down the line of like a certain threshold of assets that an investor, an accredited investor would have...? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  A threshold of assets. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I'm all for that, as long as the investor knows what they're getting into because again we're touching people's money and that's a big deal. I don't know what the right notifications and all that kind of stuff is. I haven't thought about the details of that but I think that's very much in line with the vision of the open financial system, making things accessible to everyone. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  How about this, would you be open to retail investors sitting on the Coinbase card table? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  That's going to be one of the bazillion dollar questions for us as a company. Do we want to go public someday on the blockchain on our own exchange because we have a broker dealer? Is that something that we would want to do. It is definitely something we need to think about and then obviously we're watching the Binance coin as well and trying to understand what's happening there. It's obviously very appealing for their users to be able to participate in that and own that and I think it frankly creates a lot of loyalty to Binance. It's definitely something worth thinking about but we have no fully baked thoughts on it and we we want to be careful about that. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Why do you want to be careful about it? Because the idea of offering equity or going public: it's a very complicated decision that has many implications and we've got a lot of other stuff to do. To me like the idea of going public is a tactic, it's not an actual strategy unto itself. It's a way, for example as an M&amp;A person I love the idea of being able to use public stock to do acquisitions and things like that but I also want to make sure having been at LinkedIn during the private to public phase it's a lot of work and it's something that frankly like do we want to spend our time courting public investors all the time? Probably not. We want to be building the business. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  When it comes to to Binance and Binance coin is that something you would ever consider listing on Coinbase? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I think we always want to have openness to listing things on our exchange no matter what. If users really want it and if it's a safe secure asset and that would include that. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  What about LEO. No I'm kidding [laughs] ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  The next obvious step is to move into the derivatives market. What is the...? I presume there's already a roadmap. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  We kind of talked about that before didn't we? You guys are eyeing potentially entering that market. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Margin lend borrow is definitely going to be a next big step for us especially on the active trader side. The clear demand for that... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Futures and options? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  We still need to figure that out because there's not a lot of regulatory clarity there right now in the US. And so that that is being discussed. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  Well we have you know there's a fairly vibrant futures market. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Yeah I mean CME had a 50 percent increase... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  But they have the right licenses that exist. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  And those licenses take months to get. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  That's CFTC? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  There's other licenses for derivatives that... ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  DMO, DCO. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Exactly. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  I know my licenses [laughs]","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  I don't even have a driver's license. [laughs]","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Well that's a great place to end. Before we wind down because I see we've only got a few minutes left. You've had a very interesting career, what when you look back on it are you most proud of? ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  The people I've got to work with. I have had the great fortune of being at places where I'm really inspired by the people I work with. So one of the things I absolutely love about corp dev and ventures is I get to be exposed to great founders. That's my happy place when I just get to be around great technologists because I'm the ultimate partner to them on the business side. I'm not nearly as creative as them so just being around them makes me happy. When you think about my whole career whether, I started at Yahoo back when Yahoo was the epicenter of all the technology activity and consumer Internet. Those people all ended up doing amazing things and you know with people whether I work with them or not. Jan Koum and Brian Acton on WhatsApp and Stewart Butterfield on Slack and Jeff Wiener whom I worked with at LinkedIn. Brad Garlinghouse who's now at Ripple. There's just a lot of great people that I've worked with through my career and I love to see what they're doing now because talent continues to to come from these places where people had to be innovative and figure out solutions to things when there were a lot of ups and downs. I've learned from them and that I've been able to hopefully take those lessons with me as I've built out my own practice. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Leibowitz:<\/span><\/strong>  And do you ever see yourself starting something of your own? Whether that's a fund or a venture. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I think that everything's open for all that kind of stuff. I would say I'm not going to be the founder who comes up with the brilliant creative idea and technology. I'm not an engineer and I'm not a product person. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  You're like our McCaffrey executing things. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Yeah exactly. I'm the perfect partner to those people, exactly. That's what I love to do and whatever company that might be, that's the stuff that makes me energized","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Well next time you have a big deal come back on and we can talk about it. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  I shall, I shall. ","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro:<\/span><\/strong>  Thank you so much and thanks everyone for listening","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Emilie Choi:<\/span><\/strong>  Yea thanks for having me. Super fun","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank:<\/span><\/strong> Love it. And what a great way to end. Oh my goodness what a fun episode. Thanks everyone for tuning in. Catch you next time. ","We'd like to take a minute to thank our sponsor <a href=\"https:\/\/cash.app\/\" data-v-f87c67ca=\"\">Cash App<\/a>. Cash App has been the number one in finance on the App Store for almost two years. It was the first major peer to peer payments app to support bitcoin and it's still the fastest and easiest way to onramp VR. No more waiting five days for your ACH transfer to come through. With Cash App you can buy Bitcoin instantly. When you're ready to take full ownership of your private keys just use Cash App to scan an external wallet's QR code. It's really that simple. Cash App also comes with standard banking features like direct deposits and others your bank would never even consider like Cash Card. A customizable debit card that lets you instantly save every time you use it, at Lyft, Whole Foods, Chipotle, Chick-fil-A, Starbucks, Dunkin, local coffee shops, and a whole lot more. Download Cash App today from the App Store or Google Play. And thanks for listening.","Subscribe to <strong data-v-f87c67ca=\"\">The Scoop<\/strong> wherever you listen:"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Compound","content":"ORGANIZATION"},{"type":"Portugal","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"M&amp;A","content":"ORGANIZATION"},{"type":"Chipotle","content":"LOCATION"},{"type":"Chik","content":"PERSON"},{"type":"Coinbase","content":"PERSON"},{"type":"DCO","content":"ORGANIZATION"},{"type":"million dollars","content":"MONEY"},{"type":"Steven Zhang","content":"PERSON"},{"type":"UMA","content":"ORGANIZATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Brad Garlinghouse","content":"PERSON"},{"type":"Lyft","content":"ORGANIZATION"},{"type":"Teo Leibowitz","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Whole Foods","content":"ORGANIZATION"},{"type":"Dunkin","content":"LOCATION"},{"type":"Brian Acton","content":"PERSON"},{"type":"Emilie","content":"PERSON"},{"type":"Pantera","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Balaji","content":"LOCATION"},{"type":"Emilie Choi","content":"PERSON"},{"type":"Fintech Frank","content":"ORGANIZATION"},{"type":"50 percent","content":"PERCENT"},{"type":"Chaparro","content":"PERSON"},{"type":"CME","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Yahoo","content":"ORGANIZATION"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Steven","content":"PERSON"},{"type":"Chick","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Portland","content":"LOCATION"},{"type":"30 million dollars","content":"MONEY"},{"type":"14 billion","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Brian","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"DMO","content":"ORGANIZATION"},{"type":"ACH","content":"ORGANIZATION"},{"type":"VP of Business, Data &amp; International","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Elliot","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"twenty five million dollars","content":"MONEY"},{"type":"Teo","content":"PERSON"},{"type":"Koum","content":"PERSON"},{"type":"London","content":"LOCATION"},{"type":"Jeff Wiener","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Lisbon","content":"LOCATION"},{"type":"this moment","content":"TIME"},{"type":"Stewart Butterfield","content":"PERSON"},{"type":"100 percent","content":"PERCENT"},{"type":"V.C.","content":"LOCATION"},{"type":"ten billion dollars","content":"MONEY"},{"type":"Matteo Liebowitz","content":"PERSON"},{"type":"Olaf","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"V.C.","content":"ORGANIZATION"},{"type":"Dunkin Donuts","content":"ORGANIZATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Dharma","content":"LOCATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Emilie Choi","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","Matteo Leibowitz","The Block"]}