{"summary":"SEC Chair Gary Gensler maintains that crypto firms remain non-compliant with existing laws, while CFPB Director Rohit Chopra says the existing money transmitter licensing regime for fintechs is inadequate. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195800\/key-financial-regulators-call-for-stronger-licensing-of-crypto-firms","publishDate":"2022-12-16T13:41:15","id":13171,"type":null,"title":"Key financial regulators call for stronger licensing of crypto firms","category":["POLICY"],"content":["Several key financial regulators in the U.S. cited issues with cryptocurrency firms and called for stricter licensing at a Friday meeting of the Financial Stability Oversight Council, a committee of U.S. financial regulators.&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n\"Bringing intermediaries as well as the issuers of crypto securities tokens into compliance is so important,” Securities and Exchange Commission chairman Gary Gensler said, adding that he believed many crypto firms were not following existing rules.&nbsp;“Nothing about the crypto markets is incompatible with the securities laws yet risk from this speculative, volatile and what I believe is largely non-compliant market – that’s non-compliant with our existing laws – put investors at risk.\"","The SEC, including current Chair Gensler and former Chair Jay Clayton, has long maintained that most digital assets are securities, and fall under securities laws.&nbsp;","Crypto exchanges operating within the U.S. currently do so primarily via various state money transmitter registrations. Fellow FSOC member Rohit Chopra, the director of the Consumer Financial Protection Bureau, argued that status quo is inadequate for crypto and other fintech firms, especially those that hold customer deposits without insurance from the Federal Deposit Insurance Corporation, citing the recent collapse of FTX.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The failure of such a firm could lead to millions of American consumers becoming unsecured creditors of the bankruptcy estate, similar to the experience with FTX,\" he said, referring to the collapsed crypto exchange. \"Our state money transmitter laws were not designed to assure the long-term stability of these types of firms.”","Treasury Secretary Janet Yellen referred to an October report from FSOC, noting that “crypto asset activities could pose risk to the U.S. financial system if their interconnections with the traditional financial system or their overall scale were to grow without adherence to or being paired with appropriate regulation.”","The regulators also want to assess whether the way some digital asset exchanges are structured \"can or should be accommodated under existing laws and regulations,\" according to a summary of the 2022 annual report they unanimously approved today.","That report also calls for increased enforcement of current financial laws with regards to digital assets, address \"regulatory arbitrage,\" and for Congress to pass a new law to give regulators more direct power over spot markets for bitcoin and other digital assets that aren't considered to be securities.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Jay Clayton","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Rohit Chopra","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"” Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"}],"hashtag":["CFPB","CFTC","SEC"],"authors":["Kollen Post","The Block"]}