{"summary":"Whatever the metaverse is, Yuga Labs has been trying to build it since shortly after launching Bored Ape Yacht Club.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153349\/how-bored-apes-became-the-foundation-for-a-metaverse","publishDate":"2022-06-22T12:17:03","id":13182,"type":null,"title":"How Bored Apes became the foundation for a metaverse","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">“Imagined communities” was a term coined by political scientist Benedict Anderson in the early 1980s to critique how we define and think of nations.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Communities are to be distinguished, not by their falsity\/genuineness, but by the style in which they are imagined,” he wrote.<\/span>","<span data-v-f87c67ca=\"\">Anderson argued that the idea of a nation is imagined because it entails a sense of communion or “horizontal comradeship” between people who often do not know each other or have not even met.<\/span>","<span data-v-f87c67ca=\"\">These words may seem abstract, or even irrelevant to a place like the internet. However, they ring familiar when trying to understand the Bored Ape Yacht Club (BAYC).<\/span>","<span data-v-f87c67ca=\"\">In crypto, it can be hard to know what is real. And the word “community” has lost much of its meaning due to liberal application. <\/span>","<span data-v-f87c67ca=\"\">But the community that has sprung up around this set of 10,000 cartoonish images of apes looking bored is undeniable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That’s in no small part due to the style in which the project’s creator, Yuga Labs, has cultivated it. Now the firm is cashing in — and the Bored Apes are going mainstream. In just a year, the franchise has inspired Hollywood films, TV shows, books, clothing lines, and even themed restaurants. It has also earned Yuga a <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138834\/bored-apes-creator-yuga-labs-raises-450-million-in-round-led-by-a16z-report\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$4 billion valuation<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm’s success with its Apes has set the standard for NFT collections and inspired countless copycat projects. But it will be difficult to replicate the style in which Yuga has imagined the Bored Apes community — or the cultural impact it has already made.<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs was created by a team of four pseudonymous people: Gargamel, Gordon Goner, Emperor Tomato Ketchup and No Sass. (Earlier this year, Buzzfeed News revealed that the real names of Gargamel and Gordon Goner are Greg Solano and Wylie Aronow. Yuga Labs later confirmed the identities, and Tomato Ketchup and No Sass revealed their first names as<\/span> <a href=\"https:\/\/twitter.com\/tomatobayc\/status\/1491151593055879168\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Kerem<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/twitter.com\/sassbayc\/status\/1491151597682180096\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Zeshan<\/span><\/a><span data-v-f87c67ca=\"\">.)&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Goner told <\/span><a href=\"https:\/\/www.rollingstone.com\/culture\/culture-news\/bayc-bored-ape-yacht-club-nft-interview-1250461\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Rolling Stone<\/span><\/a><span data-v-f87c67ca=\"\"> last year that he and his three co-founders were inspired by the communities of crypto lovers that have blossomed on platforms such as Twitter in recent years. People interested in the NFT world, he said, “craved a destination to gather.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, the Apes themselves were only the first step in what has become an elaborate exercise in digital worldbuilding.<\/span>","<span data-v-f87c67ca=\"\">The story officially began in April 2021, with a relatively quiet post on Twitter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Announcing the Bored Ape Yacht Club! 10,000 unique #NFTs where each Ape doubles as membership to a digital club with member-only benefits. For a chance of winning a Bored Ape:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At first, the Apes sold for <\/span><span data-v-f87c67ca=\"\">0.08 ETH<\/span><span data-v-f87c67ca=\"\">. This now seemingly paltry sum was quickly eclipsed on the secondary market. The collection’s floor price <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/144399\/bored-ape-nft-floor-price-hits-record-high-above-430000\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">hit an all-time high of 152 ETH<\/span><\/a><span data-v-f87c67ca=\"\"> in April 2022, before leveling to around 72 ETH by mid-June amid a broader market decline.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the early days, while Yuga was working to give community members new ways to use their Apes, holders of the coveted NFTs networked via Twitter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Many holders turned their Apes into their profile pictures, which helped them discover each other. The hashtags #ApeStrongTogether and #ApeFollowApe led to more connections.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Veratheape, a BAYC member who bought her Ape shortly after the mint, hails the BAYC bathroom — an online, members-only space — as part of what bound the crowd together. “It was a way to get together during the pandemic,” says Vera, who now regularly holds in-person meet-ups with other Bored Ape holders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the bathroom, users can add one new pixel to a virtual “wall” every 15 minutes to create group paintings. These crowd-productions have included pixelated depictions of Homer Simpson, Donkey Kong from Mario Kart, Charmander and other video game characters, as well as things you might see scrawled on a bathroom stall IRL, such as a penis or the words “fuck Trump.” The space, which was one of the first aspects of “utility” Yuga built into the NFT collection, continues to evolve today.<\/span>","The BAYC 'bathroom' as of October 8 2021. <a href=\"https:\/\/twitter.com\/dragonseller88\/status\/1446594849604444160\" data-v-f87c67ca=\"\">Credit: @dragonseller88<\/a>","<span data-v-f87c67ca=\"\">As time has gone on, some of these Ape connections have spilled into real life, too. <\/span>","<span data-v-f87c67ca=\"\">Parties for Bored Ape holders have coincided with larger crypto conferences such as Paris Blockchain Week or Bitcoin 2022 in Miami. For access, users have to log into their wallet and prove their Ape is actually their Ape upon booking.<\/span>","<span data-v-f87c67ca=\"\">Vera says that some Ape owners come to these events dressed as the Bored Ape they own. “IRL events are another layer of trust, you dox yourself through them.”<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Another thing that binds Ape holders together is a shared sense of identity — in the NFT world and even in popular culture.<\/span>","<span data-v-f87c67ca=\"\">“Bored Ape culture is NFT OG culture,” explains Leo Chen, another Ape holder. “The ‘bored’ part is important because it’s more expressive than a punk. It was the first project to bring more emotion and detail to its NFTs,” he adds.<\/span>","<span data-v-f87c67ca=\"\">The visual aspects of the Bored Ape identity blend with the less tangible.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=Ehw2iM0A5H4\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rare interview<\/span><\/a><span data-v-f87c67ca=\"\"> with The D3 Network, Yuga Labs CEO Nicole Muniz said the Bored Apes brand draws people who “want to be on the edge of culture” and “want to be part of the next innovative thing and experience.”<\/span>","<span data-v-f87c67ca=\"\">Decentralization, she said, is key to being able to define your own identity in web3. Part of this is allowing Apes to cultivate an online identity that exists separately from other structures. In practice, that means Ape holders can do what they want with the intellectual property associated with the NFT.<\/span>","<span data-v-f87c67ca=\"\">BAYC has been unique among NFT projects, in that it has allowed holders of Bored Apes to do whatever they like with the images. Other popular NFT projects, like CryptoPunks, <a href=\"https:\/\/www.theblockcrypto.com\/news+\/142696\/how-a-disillusioned-former-cryptopunk-owner-is-trying-to-change-the-nft-copyright-game\" data-v-f87c67ca=\"\">have been more restrictive<\/a>. (Incidentally, Yuga Labs <a href=\"https:\/\/www.theblock.co\/linked\/137631\/bored-apes-creator-yuga-labs-acquires-ip-for-cryptopunks-and-meebits\" data-v-f87c67ca=\"\">purchased<\/a> the intellectual property for CryptoPunks in March.)&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The world’s first metaverse NFT pop group, KingShip, may never have happened without holders owning the commercial rights to their Apes. Universal Music <\/span><a href=\"https:\/\/www.universalmusic.com\/1022pm-forms-kingship-the-first-ever-group-consisting-of-nft-characters-from-bored-ape-yacht-club\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> the band’s formation in November last year, spearheaded by the “next-gen Web3 label” 10:22PM.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Kingship consists of a Mutant Ape (more on this later) and three Bored Apes. Their manager calls her Ape Noët All.<\/span>","Kingship. Credit: 10:22PM","<span data-v-f87c67ca=\"\">Celine Joshua, who works in content and strategy at Universal Music, engineered the agreement. Now she plans to steer the group on the creation of new NFTs, music and “community-based” products. Bored Ape and Mutant Ape owners will have early access to all KingShip NFTs, experiences and narrative selection.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then there is Jenkins the Valet; a Bored Ape with NFTs to sell, a forthcoming book that is ghostwritten by a famous author, and a troop of around 4,100 other Ape owners signed up via licenses to participate in the project.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Two friends, codenamed SAFA (@seeapefollowape) and Valet Jones, cooked up the character in May 2021, following the initial BAYC mint. All it took was an idea, several thousand dollars to buy the Ape outright, and a <\/span><a href=\"https:\/\/web.archive.org\/web\/20210726174203\/https:\/\/boredapeyachtclub.medium.com\/bayc-community-grant-program-first-awardees-a396a09a5bce\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">community grant<\/span><\/a><span data-v-f87c67ca=\"\"> of $2,000 from Yuga.<\/span>","Jenkins the Valet's original headshot.","<span data-v-f87c67ca=\"\">“We had started to talk about an idea that NFT avatars could be like characters, they could be completely separate from the human being that manages the account,” says Valet Jones. “Like, they could just exist on their own.”<\/span>","<span data-v-f87c67ca=\"\">Over the last year, Jenkins has gained a Hollywood agent, a devoted fan club, and now a tranche of venture capital backers. The project picked up $12 million in VC money, from investors such as a16z, Dapper Labs and musician Lionel Richie. Other funding came through the sale of&nbsp; “writers room” NFTs, for which users paid 0.04 ETH at the initial mint.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Jenkins’ Twitter bio, he is writing the first “community generative NFT,” a “tell-all'' memoir, which will be ghostwritten by author Neil Strauss. Strauss is widely-known as the man behind the best–selling book “The Game,” which had made popular the term “pick-up-artist” and chronicles his times in the “seduction community.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Jenkins’s new book will be produced with content from his owners as well as by writers-room NFT holders. This club within a club gives access to an online portal, primarily a space where members can vote on plot decisions and license their own IP to the book. It gives holders control of “the stories that define the metaverse,” according to the project’s OpenSea page. With different levels of membership, the project will distribute members-only apparel and give different levels of autonomy depending on which NFT has been bought.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We believe, like, wholeheartedly, that the next generation of household characters will be born on the blockchain,” says Valet Jones.<\/span>","<span data-v-f87c67ca=\"\">Jenkins the Valet’s growing empire may be a glimpse at what is to come. Whatever the metaverse is, Yuga has been trying to build it since shortly after launching the Bored Apes.<\/span>","<span data-v-f87c67ca=\"\">First, it introduced new characters.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In June 2021, Yuga created the Bored Ape Kennel Club (BAKC). This was a new derivative collection, consisting of a further 10,000 NFTs airdropped to BAYC holders’ wallets. These are unique digital dogs “bred” as companions to Apes. At the time this was novel. This kind of thing has now become a common part of the NFT landscape.<\/span>","<span data-v-f87c67ca=\"\">A second project hit collectors’ wallets at the end of August, with the next iteration: Mutant Ape Yacht Club (MAYC). This was a little more complicated.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yuga Labs set out to create 20,000 of these new creatures. Ten thousand of them would reward Bored Ape owners with new NFTs based on the traits of their original Bored Ape, created by exposing an existing Ape to “Mutant Serum” of varying potency. The other 10,000 would be designed to welcome newcomers into the Bored Ape ecosystem with a lower cost of entry.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Next, the Bored Ape world got its own currency: ApeCoin, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138156\/apecoin-tied-to-bored-ape-nft-ecosystem-debuts-with-planned-community-airdrop\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">launched <\/span><\/a><span data-v-f87c67ca=\"\">in March in partnership with venture capital and blockchain gaming firm Animoca Brands, one of Yuga’s investors. Again, Yuga rewarded its community. A hundred and fifty million out of 1 billion tokens were airdropped to BAYC holders’ wallets.<\/span>","<span data-v-f87c67ca=\"\">\"ApeCoin DAO is supported by Ape Foundation, and will empower the community to build blockchain games and services, host events (in the metaverse or IRL), and create digital and physical products…along with anything else you can dream up,” Yuga said at the time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At its peak, the coin had a market cap of almost <\/span><a href=\"https:\/\/coinmarketcap.com\/currencies\/apecoin-ape\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$7.5 billion<\/span><\/a><span data-v-f87c67ca=\"\"> and trades on major exchanges — as of mid-June, it was worth $1.4 billion. <\/span><a href=\"https:\/\/twitter.com\/search?q=%24APE&amp;src=cashtag_click\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$APE<\/span><\/a><span data-v-f87c67ca=\"\"> holders can participate in governance via the ApeCoin DAO.<\/span>","<span data-v-f87c67ca=\"\">Digital real estate was the next piece. In May, Yuga held a land sale for Otherside, a blockchain-based virtual world. The project sold out all the available 55,000 “Otherdeed” land NFTs within three hours of its public sale. The rush to buy crashed the Ethereum blockchain.<\/span>","<span data-v-f87c67ca=\"\">The offering accepted only <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/138156\/apecoin-tied-to-bored-ape-nft-ecosystem-debuts-with-planned-community-airdrop\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ApeCoin<\/span><\/a><span data-v-f87c67ca=\"\">. Priced at 305 ApeCoin, worth about $5,800 at the time of mint, it brought in 16.7 million ApeCoin ($317 million), making it a record-setting NFT mint. The remaining 45,000 tokens will be airdropped to existing holders of BAYC and MAYC NFTs.<\/span>","<span data-v-f87c67ca=\"\">Where Otherside — and Yuga Labs itself — goes from here is anyone’s guess. Yuga Labs declined to be interviewed for this piece.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As ever, the devil is in the details. With the latest <a href=\"https:\/\/twitter.com\/yugalabs\/status\/1505014986556551172\" data-v-f87c67ca=\"\">Otherside metaverse land drop<\/a>, it seems the fine print is already raising questions about Yuga’s evolving business model and partnership with Animoca.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As noted by Punk 6529 <\/span><a href=\"https:\/\/twitter.com\/punk6529\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">on Twitter<\/span><\/a><span data-v-f87c67ca=\"\">, Otherdeeds, which are the key to claiming land in the Otherside, are the first object in the Yuga universe with no commercial rights awarded to holders. The new contracts offer non-commercial rights only, with Animoca as the counterparty.<\/span>","Screenshot from the Otherside promo video.","<span data-v-f87c67ca=\"\">Alongside this, Kodas, the creatures that live in the Otherside, can only be claimed by purchasing a plot of land. Owners have been given commercial rights to these, but with more restrictive language than in previous BAYC contracts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Rights are only available as part of a license and subject to the agreement, as opposed to the Bored and Mutant Ape free-for-all, which states “you own the underlying Bored Ape, the Art, completely.” The contract also restricts Koda owners from creating derivative NFTs of their creatures.<\/span>","<span data-v-f87c67ca=\"\">This suggests that Yuga’s digital reality will have intellectual property restrictions. But what other characteristics will it have? What kinds of commerce will happen there? What kinds of games will be played? Will it be accessible via augmented reality and or virtual reality? Will it be exclusive to Yuga NFT holders?<\/span>","<span data-v-f87c67ca=\"\">One thing is clear: the foundation will be Yuga’s imagined community of Bored Apes, and their devoted holders.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4 billion","content":"MONEY"},{"type":"Donkey Kong","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"Bored Ape","content":"ORGANIZATION"},{"type":"April 2021","content":"DATE"},{"type":"Miami","content":"LOCATION"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Celine Joshua","content":"PERSON"},{"type":"Animoca","content":"LOCATION"},{"type":"1980s","content":"DATE"},{"type":"several thousand dollars","content":"MONEY"},{"type":"November last year","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$2,000","content":"MONEY"},{"type":"Buzzfeed News","content":"ORGANIZATION"},{"type":"Wylie Aronow","content":"PERSON"},{"type":"Ape Foundation","content":"ORGANIZATION"},{"type":"16.7 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"Jenkins","content":"PERSON"},{"type":"Homer Simpson","content":"PERSON"},{"type":"Anderson","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Yuga","content":"PERSON"},{"type":"October 8 2021","content":"DATE"},{"type":"Neil Strauss","content":"PERSON"},{"type":"Kodas","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"ApeCoin DAO","content":"ORGANIZATION"},{"type":"Punk 6529","content":"ORGANIZATION"},{"type":"Leo Chen","content":"PERSON"},{"type":"Universal Music","content":"ORGANIZATION"},{"type":"Nicole Muniz","content":"PERSON"},{"type":"Otherdeeds","content":"LOCATION"},{"type":"Yuga NFT","content":"ORGANIZATION"},{"type":"$12 million","content":"MONEY"},{"type":"Paris","content":"LOCATION"},{"type":"1 billion","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"Animoca","content":"PERSON"},{"type":"Dapper Labs","content":"ORGANIZATION"},{"type":"$7.5 billion","content":"MONEY"},{"type":"$317 million","content":"MONEY"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Sass","content":"PERSON"},{"type":"Gordon Goner","content":"PERSON"},{"type":"Benedict Anderson","content":"PERSON"},{"type":"Bored Ape Kennel Club","content":"ORGANIZATION"},{"type":"Valet","content":"ORGANIZATION"},{"type":"Greg Solano","content":"PERSON"},{"type":"June 2021","content":"DATE"},{"type":"Yuga Labs","content":"PERSON"},{"type":"$1.4 billion","content":"MONEY"},{"type":"May 2021","content":"DATE"},{"type":"Mario Kart","content":"PERSON"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"$5,800","content":"MONEY"},{"type":"Koda","content":"PERSON"},{"type":"Valet Jones","content":"ORGANIZATION"},{"type":"Lionel Richie","content":"PERSON"}],"hashtag":["OTHERSIDE","YUGA LABS"],"authors":["Lucy Harley-McKeown","The Block"]}