{"summary":"Coinbase has front-run an upcoming investigative story by the New York Times that is said to allege the crypto exchange operator mistreated Black employees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/85827\/coinbase-front-runs-nyt-story-alleging-mistreating-black-employees","publishDate":"2020-11-26T03:30:18","id":13189,"type":null,"title":"Coinbase front-runs NYTimes&#x27; investigative story that is said to allege the exchange mistreated Black employees","category":["EXCHANGES"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Coinbase has front-run an upcoming investigative story by the New York Times that is said to allege the crypto exchange operator mistreated Black employees.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">In a&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/blog.coinbase.com\/upcoming-story-about-coinbase-2012afc25d27\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">blog post published<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;late Wednesday, Coinbase said the NYTimes plans to publish the story in print on Sunday and online sometime before that and thus wanted to give everyone a \"heads-up\" and provide some \"important context.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The story, by reporter Nathaniel Popper, is said to allege that several Black employees of Coinbase have had negative experiences at the company over the last few years.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The story will likely quote three former Coinbase employees and one former contractor by name, and include photos of some of them, the exchange said. Other sources of information for the story include Coinbase's current and former employees, leaked Slack chats, and internal documents.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The story covers our efforts related to Belonging, Inclusion and Diversity; our positioning as a mission-focused company; and the discussions we had within the company this year about Black Lives Matter,\" said Coinbase. \"However, a significant portion of the story also focuses on major changes to our Compliance and CX orgs [c-level restructuring] that took place in 2018. The story will likely imply that Black employees were discriminated against during this process; this is false.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Coinbase went on to say that the story will also likely allege that several Black employees referenced in the report filed complaints with the company, but, \"in reality, only three of these people filed complaints during their time at Coinbase.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The exchange further said that those complaints were \"thoroughly investigated\" via internal and third-party examiners and found \"no evidence of wrongdoing.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Overall, Coinbase warned that the story will recount episodes that will be \"difficult for employees to read.\"<\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Recent issues&nbsp;<\/strong><\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Coinbase has been in the limelight for its inclusion and diversity efforts since September of this year when the exchange's CEO Brian Armstrong put out an apolitical blog post. He said at the time that Coinbase is \"laser focused\" on its mission to build an open financial system while focusing \"minimally\" on \"broader societal issues\" and political causes.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Soon after the controversial blog post, Coinbase offered an exit package to employees that were uncomfortable with its stated mission. Nearly 5% of the exchange's 1,200 employees accepted a severance package at the time.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">These developments at the time also revealed that Coinbase experienced an employee walk-out over a meeting in which a question about Black Lives Matter was raised. Armstrong was said to have asked what he thought about Black Lives Matter and responded that he didn't have an answer in that moment.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Amid these events, Coinbase was recently looking to hire someone to lead its internal diversity efforts. That <\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.coinbase.com\/careers\/positions\/2398476\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">position<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;is still open at the time of writing.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"late Wednesday","content":"DATE"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Nathaniel Popper","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"Black Lives Matter","content":"ORGANIZATION"},{"type":"2018","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Yogita Khatri","The Block"]}