{"summary":"DefiLlama is not planning a LLAMA token, after an internal conflict spilled into public view over the weekend. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221345\/defillama-not-planning-token-and-apologizes-for-llama-drama","publishDate":"2023-03-20T16:54:08","id":1319,"type":null,"title":"DefiLlama not planning token after LLAMA drama at DeFi platform","category":["DEFI"],"content":["DefiLlama is not planning a LLAMA token, the decentralized finance platform said on Twitter after an internal <a href=\"https:\/\/www.theblock.co\/post\/221063\/defillama-internal-war\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">conflict<\/span><\/a> spilled into public view over the weekend.&nbsp;","“There is no LLAMA token currently planned, and any airdrop will be discussed with the community, as every important decision is,” DefiLlama said in a <a href=\"https:\/\/twitter.com\/defillama\/status\/1637910941550489605?s=46&amp;t=DASDmEBpYiudQCw3xNy0MA\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Twitter thread<\/span><\/a>.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","A pseudonymous DefiLlama employee, 0xngmi, forked a version of the blockchain data platform over the weekend after accusing the company's founders of launching a token without support.&nbsp; A day earlier, DefiLlama hinted about a token airdrop on Twitter, something that some contributors said would go against much of the team’s wishes. <span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“We would like to put what happened behind us,” DefiLlama wrote on Monday. “The DeFiLlama team would like to apologize for the events that unfolded yesterday, as a result of poor communication and a misunderstanding within the team.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"DefiLlama","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"DefiLlama","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}