{"summary":"Animoca Brands was given an extension until the end of Q1 this year for publishing audited 2020 accounts, but it is yet to do so.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232851\/animoca-accounts-delays","publishDate":"2023-06-01T06:51:28","id":13195,"type":null,"title":"Animoca chair says turbulence of last two years to blame for delayed 2020 accounts","category":["METAVERSE & NFT"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Animoca Brands is yet to produce a long-delayed set of accounts for 2020. But it is now the events of 2021 and 2022 — the first a year of wild exuberance in crypto markets, the second one marked by catastrophe — that are holding them up.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The Block revealed in late 2020 that the prolific web3 investor&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.theblock.co\/post\/198445\/animoca-brands-allowed-deadline-extension-for-filing-results\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">had been allowed an extension<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;to file its audited financial report for 2020, which was originally due to Australian regulators by the end of 2022. The once-listed firm negotiated a later filing date, pushing the deadline to the end of the first quarter of this year, with subsequent years' accounts to be filed later in 2023. A spokesperson said at the time that Animoca did not expect to miss those deadlines.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">But two months after the revised date, the accounts are yet to appear. Yat Siu, chairman of Animoca, told The Block in an interview that the company is working closely with its auditor DFK International to sign them off.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"The biggest part is essentially the subsequent events. Because the auditor is not simply going to be looking at what's happening now, what happened in 2020, and close it off. They also have to look at the events that happened in 2021 and 2022,\" Siu said. \"Let's say we made an investment in 2020, and it had an impact in 2021 or 2022, they want to reflect that impact in the 2020 accounts… And that's basically what's causing quite a bit of the delays.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The two years in question were times of extreme contrast in crypto markets. 2021 was a bull market characterized by high points in the price of bitcoin and ether, as well as rampant NFT speculation. The following year was marked by a string of high-profile collapses — including those of Terra, Celsius, Three Arrows Capital and FTX — that sent crypto plummeting into a bear market.&nbsp;<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"A lot happened in 2021 and 2022. I mean if anything that's like lifetimes of an industry in the space of a few months,\" Siu said.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">For Animoca, such wild swings present a unique problem. The company has made around 450 investments in web3 projects, according to Siu, and sits on a trove of highly volatile tokens. Placing a value on that haul is no mean feat. Its audited 2019 accounts — which DFK International signed off on — were filed in July last year after delays. In a statement within the report, Siu said the company's \"financial auditing process required breaking entire swathes of new ground,\" tackling questions about how to account for token sales and NFTs.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">In May, Animoca&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.reuters.com\/technology\/animoca-brands-token-reserves-down-36-after-crypto-plunge-2023-05-12\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">published an interim financial update<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;stating that its token reserves stood at $2.7 billion, down 36% from a year earlier. Its overall assets stood at $3.4 billion. Asked at the time when the audited accounts for 2020 would be published, a spokesperson simply said they would be ready \"very soon.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Animoca is obliged to publish accounts because it was listed on the Australian Securities Exchange (ASX) from 2015 to 2020. In December 2019, ASX issued a letter to the company detailing a list of breaches, including governance items, involvement in crypto-related activities and substantial use of simple agreements for future equity (SAFEs) issued by subsidiaries. Animoca delisted in March of the following year.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"end of the first quarter of this year","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"ASX","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Animoca","content":"PERSON"},{"type":"Animoca","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"DFK International","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Siu","content":"PERSON"},{"type":"Terra","content":"LOCATION"},{"type":"$3.4 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"July last year","content":"DATE"},{"type":"Australian Securities Exchange (ASX","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"36%","content":"PERCENT"},{"type":"2020","content":"DATE"}],"hashtag":["ANIMOCA BRANDS"],"authors":["Ryan Weeks","The Block"]}