{"summary":"Binance has confirmed a partnership with Swipe for its debit card launch in a now-deleted webpage. Binance Card would enable “real time” conversion of crypto to fiat currency to use at merchants globally.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/70274\/binance-confirms-partnership-with-swipe-for-debit-card-launch","publishDate":"2020-07-02T04:00:15","id":13199,"type":null,"title":"Binance confirms partnership with Swipe for debit card launch","category":["EXCHANGES"],"content":["Crypto exchange behemoth Binance has confirmed a partnership with Swipe for its debit card launch in a now-deleted webpage.","The <a href=\"https:\/\/webcache.googleusercontent.com\/search?q=cache:w2NinDGR504J:https:\/\/www.binance.com\/en\/support\/articles\/ed89f6797ae943ad87841e58591eb229-Binance-Card-FAQ&amp;hl=en&amp;gl=uk&amp;strip=1&amp;vwsrc=0\" data-v-f87c67ca=\"\">cached version<\/a> of the “Binance Card” FAQ section on the exchange’s website reads: “Binance has partnered with Swipe to provide a Card platform for Binance users.” This <a href=\"https:\/\/www.theblockcrypto.com\/linked\/69848\/binance-majority-stake-swipe-payment-card\" data-v-f87c67ca=\"\">confirms<\/a> The Block’s reporting from earlier this week, which said Binance is partnering with Swipe for its card launch. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Block also reported at the time that Binance has acquired a majority stake in Swipe, which the exchange declined to confirm at the time. Even today, a Binance spokesperson declined to comment when reached.&nbsp;","Binance's plans for a branded card have been in the works <a href=\"https:\/\/www.theblockcrypto.com\/linked\/60028\/a-binance-crypto-debit-card-is-in-the-works\" data-v-f87c67ca=\"\">since March<\/a>. At the time, the exchange said Binance Card \"does everything a regular payment card does, plus much more.\"","The now-deleted FAQ section shows that Binance Card would enable “real time” conversion of cryptocurrency to fiat currency to use at merchants globally. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBinance said it will aggregate the value of a card wallet based on the market prices of cryptocurrencies and this aggregated balance will allow users to spend their cryptocurrencies.","Users can transfer funds to their card wallet from their spot wallet based on daily limits, said Binance, adding: “The transfer will be instant and available for immediate use.”","The card will work globally, said Binance, as it works with “numerous networks” worldwide. Cardholders will be able to also withdraw cash at an ATM as long as they are in a region that supports cash withdrawals.","It is worth noting that Swipe already offers its own crypto Visa debit card. Binance Card will be issued as a white-label product via Swipe, as The Block reported earlier this week. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSwipe issues its card via Contis Financial Services Ltd, a Visa member that is licensed by the U.K. Financial Conduct Authority.","A Contis spokesperson told The Block that Swipe is their client, but Binance is not. They declined to comment on the Binance-Swipe partnership.","Given Binance’s global reach and influence, the partnership news has shot up the price of Swipe token (SXP) in recent days. The <a href=\"https:\/\/coinmarketcap.com\/currencies\/swipe\/\" data-v-f87c67ca=\"\">token is currently up<\/a> by about 22% to trade at around $0.64.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nIt remains to be seen whether Binance will list SXP, given that Binance would become a majority shareholder of Swipe.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"Swipe","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Contis Financial Services Ltd","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Contis","content":"ORGANIZATION"},{"type":"$0.64","content":"MONEY"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"U.K. Financial Conduct Authority","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}