{"summary":"Bloomberg Senior ETF Analyst Eric Balchunas said that Bitcoin ETFs are on track to pass gold ETFs but explained what could derail them.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282524\/bitcoin-etfs-are-going-to-surpass-golds-says-etf-expert-unless-theres-a-black-swan-event","publishDate":"2024-03-14T10:37:34","id":13197,"type":null,"title":"Bitcoin ETFs are going to surpass gold&#x27;s, says ETF expert — unless there’s a black swan event","category":["MARKETS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.85%\n    <\/span><\/a> <!----><\/span><\/span> ETFs have seen far higher flows and assets than most predicted ahead of launch, and this <\/span><a href=\"https:\/\/www.theblock.co\/post\/282044\/spot-bitcoin-etfs-have-been-an-absurd-success-and-blown-away-expectations-in-just-two-months\" data-v-f87c67ca=\"\">unparalleled success<\/a> has analysts speculating about how high they might go.","Having started with $28.9 billion of assets when they launched — as Grayscale’s flagship Bitcoin Trust was converted across along with its assets — the 11 spot bitcoin ETFs now have a combined AUM of $61 billion. On the back of heavy inflows and a rising bitcoin price, their size is heading toward that of gold ETFs, which have a combined AUM of <a href=\"https:\/\/etfdb.com\/etfs\/commodity\/gold\/\" data-v-f87c67ca=\"\">around $97 billion<\/a>.","“They're going to pass gold ETFs at some point. That'll be a big thing,” Bloomberg Senior ETF Analyst Eric Balchunas told The Block. “I think the only thing that could derail all this is some kind of black swan.”","Balchunas said the ETFs could be described as The Big Mo, referring to a situation where something catches fire and momentum propels it forward — such as with presidential campaigns.&nbsp;","“The mojo in these ETFs right now is off the chart. As long as the bitcoin price keeps complying and leaping higher — three or four out of five days a week — I don't really see anything slowing this trade down for a while because it's an upward spiral right now, and it's sort of feeding on itself,” said Balchunas. “The higher the price goes, the more people get FOMO and are interested, and the more flows that come in, the higher the price goes.”","Balchunas said it will eventually top off but noted that the numbers are still getting stronger each day. He pointed out that when VanEck’s bitcoin ETF temporarily cut its fee to zero, it saw $180 million of inflows, a sign that interest in these ETFs is still very much there.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/bitcoin-spot-etf-volumes\/embed\" title=\"Spot Bitcoin ETF Volumes\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","“So, I mean, they're white hot. That's a phrase I would use. It won’t last forever. But the question is when do we hit a plateau?” he said.","Balchunas speculated that it would take a significant market drop to bring them back to earth.","“I think a significant downturn in equity markets is probably the one thing that could derail all this mojo right now. I'm not saying that would necessarily cause a decline in bitcoin, but it certainly would move this story to the back burner and into the back burner of people's minds. They'd be more concerned about their stocks because, for most people, that makes up a big part of the portfolio,” he said.","“So I think as long as the markets, stocks and bonds stay flat or up, I don't really see anything in the way of a continued, growth pattern for these,” Balchunas added.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"$28.9 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"$97 billion","content":"MONEY"},{"type":"Balchunas","content":"PERSON"},{"type":"$180 million","content":"MONEY"},{"type":"$61 billion","content":"MONEY"},{"type":"+0.85%","content":"PERCENT"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}