{"summary":"State-owned media outlets have published recent articles encouraging people to stay away from the crypto markets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107064\/china-xinhua-bitcoin-freedom-risk","publishDate":"2021-06-03T12:06:27","id":13191,"type":null,"title":"Xinhua says people have the freedom to trade bitcoin – at their own risk","category":["CHINA"],"content":["Following a recent high-level government mention of <a href=\"https:\/\/www.theblockcrypto.com\/post\/105708\/china-bitcoin-crackdown-usdt-otc\" data-v-f87c67ca=\"\">a potential crackdown<\/a> on bitcoin trading and mining, Chinese government mouthpieces have now published a series of reports criticizing the crypto markets.","Much of the criticism from the state-owned Xinhua News Agency and the China Central Television focused on telling the audience about \"rampant\" market manipulation, citing anecdotal examples. It is an effort to dissuade the Chinese public from crypto trading.&nbsp;","In its latest report on Thursday, Xinhua even detailed the reasons why it has been \"<a href=\"http:\/\/www.xinhuanet.com\/2021-06\/02\/c_1127522215.htm\" data-v-f87c67ca=\"\">going after<\/a>\" the crypto market.","Although the government mouthpiece recommends that the public stay away from the risky and volatile crypto markets to ensure their financial safety, it admits that the state also does not necessarily consider crypto trading to be illegal.","\"If virtual currencies like bitcoin are treated as virtual commodities that can be bought and sold, then the general public has the freedom to participate in the trade at their own risks,\" Xinhua wrote in the report.","However, it said that it will continue exposing projects or platforms that draw retail investors by marketing virtual currencies as speculative investments that can make people rich overnight.","China Central Television also <a href=\"http:\/\/finance.eastmoney.com\/a\/202106021946405572.html\" data-v-f87c67ca=\"\">published<\/a> a news clip on Wednesday in an attempt to educate the public on how easy it is to create blockchain tokens \"out of thin air\" and how various types of scams have been using such methods to defraud unwitting retail investors.","The somewhat mixed messages from state-run media outlets reflect China's complicated attitude towards the crypto industry.","While there's no law that outright considers individuals buying, selling or owning crypto assets as a criminal offense, the state generally does not want the public to deal with the crypto markets. That's why it has curbed the intermediary services that can serve as crypto on-ramps.","In its landmark policy change in 2017, the People's Bank of China ordered domestic financial institutions and non-banking payment providers to stop serving crypto-related clients. The ban subsequently cut off Chinese crypto exchanges' fiat on-ramp channels.","Crypto investors have since then been relying on over-the-counter desks for fiat on- and off-ramps. That's gotten <a href=\"https:\/\/www.theblockcrypto.com\/daily\/85186\/money-laundering-crackdown-china-crypto-otc\" data-v-f87c67ca=\"\">more complicated and risky<\/a> since 2020.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"People's Bank of China","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Xinhua News Agency","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"China Central Television","content":"ORGANIZATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}