{"summary":"Under terms of the over 200-page bill, the SEC and CFTC would be required to write digital asset-specific rules for trading platforms and exchanges.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240849\/house-republicans-introduce-much-awaited-us-crypto-market-overhaul","publishDate":"2023-07-20T17:50:58","id":132,"type":null,"title":"House Republicans introduce much-awaited US crypto market overhaul","category":["Policy"],"content":["Senior House Republicans have formally <a href=\"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill\" data-v-f87c67ca=\"\">introduced a bill<\/a> that would change how crypto markets work in the U.S., including mandating that markets regulators issue rules defining “blockchain” and “digital asset” within existing financial laws and create new rules for digital asset exchanges.","Under terms of the over 200-page <a href=\"https:\/\/agriculture.house.gov\/uploadedfiles\/fit_for_the_21st_century_act_of_2023.pdf\" data-v-f87c67ca=\"\">bill<\/a>, titled \"the Financial Innovation and Technology for the 21<sup data-v-f87c67ca=\"\">st<\/sup> Century Act,\" the Securities and Exchange Commission and Commodity Futures Trading Commission would be required to write digital asset-specific rules for trading platforms and exchanges. Regulators would be prohibited from making rules around how individuals can hold digital assets themselves.","Digital asset projects would be exempted from typical registrations for securities offerings, up to a point. Issuers could offer up to $75 million worth of tokens in a 12-month period, but with restrictions on sales to unaccredited investors, a category that most buyers belong to. Token issuers would still have to file information with the SEC, including annual and semiannual reports on the project, until or unless it is certified by regulators as decentralized to the point where the token would transition to being a commodity.","Issuers would have to limit purchases to five percent or less of an individual’s annual income or net worth, whichever is greater. Regardless of income, in order for the exemption to apply, an issuer could not sell more than 10 percent of its tokens to any one purchaser, and the transaction could not involve other digital assets or traditional debt or equity.","The bill also contains language explicitly prohibiting the commingling of customer assets, an accusation levied against FTX and other large crypto firms, and other requirements for the safeguarding of customer funds and property.","Token issuers would have to be organized in the U.S., would have to have a business plan and not be subject to any enforcement order from the SEC in the five years before it offers a token under the exemption.","Digital assets securities could be traded on alternative trading systems under the supervision of the SEC. Digital commodities would be traded on digital commodity exchanges under supervision of the CFTC.","“This is a pivotal moment for America’s standing as the global leader in innovation and technology adoption. Not only can digital assets revolutionize our financial system, but their underlying blockchain technology holds promise as the building blocks for the next generation of the internet,” House Financial Services Chair Patrick McHenry, R-N.C., said in a statement heralding the bill.","“Today's introduction of the Financial Innovation and Technology for the 21st Century Act marks a significant milestone in the House Committees on Agriculture and Financial Services efforts to establish a much-needed regulatory framework that protects consumers and investors and fosters American leadership in the digital asset space,” House Agriculture Committee Chair Glenn ‘G.T.’ Thompson, R-Pa., the listed lead author of the bill, said in a release.","The bill comes amid an unusually contentious regulatory atmosphere between the industry and markets regulators. Aside from nearly 150 enforcement actions taken by the SEC relating to digital assets, Coinbase has sued the SEC over a response to a petition for rules specific to crypto, while the SEC has its own lawsuit against the trading platform over allegations of listing unregistered securities, among other parts of the U.S. crypto giant’s business.","The House Financial Services and Agriculture Committees plan to debate and vote on advancing the bills to the full House of Representatives next week. The Financial Services Committee will hold a meeting on the bill, as well as a bipartisan comprehensive framework for stablecoins in the U.S., on Wednesday while the Agriculture Committee is expected to hold its debate on its portion of the markets bill on Thursday.","It’s unclear whether the bill will garner enough Democratic support to become law, as Democrats control the Senate and White House. Rep. Maxine Waters, the top Democrat on the Financial Services Committee, demurred when asked by The Block on Tuesday if members of her party might support the legislation.","House Republicans say they <a href=\"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill\" data-v-f87c67ca=\"\">have not yet received the cooperation from the SEC<\/a> that they hoped to get, a sign that gaining enough Democrat support for the market bill to become law could be difficult."],"hashtag":["CFTC","COINBASE","CONGRESS","FTX","GARY GENSLER","HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","PATRICK MCHENRY","SAM BANKMAN-FRIED","SEC","SENATE BANKING COMMITTEE"]}