{"summary":"The Grayscale Bitcoin Trust (GBTC) discount has reduced to -17% following the company&#x27;s legal victory against the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247959\/grayscale-bitcoin-trust-discount-shrinks-after-legal-victory","publishDate":"2023-08-29T11:36:31","id":13202,"type":null,"title":"Grayscale Bitcoin Trust discount shrinks after legal victory","category":["COMPANIES"],"content":["The Grayscale Bitcoin Trust discount has declined from -25% to -17% following a Tuesday <a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">legal victory<\/a> in the company's ongoing dispute with the Securities and Exchange Commission.","The discount represents the difference between the market value of GBTC shares and the value of the underlying bitcoin in the trust. It trades at a discount as the shares can't currently be redeemed, so the only option is to sell them to other prospective buyers.","The discount was at around -50% in December 2022 but gradually reduced over the following months. In June 2023, however, it was still at -45%. This fell to -25% over the last few weeks prior to today's latest move.","<span data-v-f87c67ca=\"\">The Grayscale discount has shrunk over the last few months and reduced even further today (where 0.80 represents a 20% discount). Image: TradingView.<\/span>","Grayscale has been locked in a long battle with the SEC to convert its flagship fund into an ETF, which would allow for conversions of the shares to the underlying assets — enabling the price of the shares to likely return to parity.","The court on Tuesday specifically addressed the SEC's treatment of spot bitcoin ETFs and bitcoin futures ETFs in the opinion. Grayscale showed in its proposed bitcoin ETF that it is similar to already approved bitcoin futures ETFs, the court said.","The SEC has the next 45 days to request an en banc hearing, meaning a rehearing with all three judges. After 45 days, the court will issue a final mandate that will have details on what happens next.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"-50%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"-45%","content":"PERCENT"},{"type":"-25%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"-17%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"December 2022","content":"DATE"},{"type":"June 2023","content":"DATE"}],"hashtag":["SEC"],"authors":["Tim Copeland","The Block"]}