{"summary":"The new regime allows crypto firms that have applied for registration to continue operating until July 9, 2021. The previous deadline was January 10 of that year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88013\/uk-regulator-fca-crypto-temporary-registration-regime-new-deadline-july-9","publishDate":"2020-12-16T03:35:59","id":13201,"type":null,"title":"UK regulator announces &#x27;temporary registration regime,&#x27; extends operating deadline to July 9 for existing crypto businesses","category":["CRYPTOCURRENCY"],"content":["The U.K.'s Financial Conduct Authority (FCA) has just announced a \"temporary registration regime\" for existing crypto businesses.","The <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-establishes-temporary-registration-regime-cryptoasset-businesses\" data-v-f87c67ca=\"\">new regime<\/a> allows crypto firms that have applied for registration to continue operating until July 9, 2021. The previous deadline was January 10 of that year.","\"The Temporary Registration Regime is for existing cryptoasset businesses which have applied for registration before 16 December 2020, and whose applications are still being assessed,\" said the FCA. \"This is to enable those existing businesses to continue to trade after 9 January 2021 until 9 July 2021, pending the FCA’s determination of their application.\"","The regulator said it is extending the deadline as it could not assess and register all firms that have applied for registration \"due to the complexity and standard of the applications received, and the pandemic restricting the FCA’s ability to visit firms as planned.\"","Those crypto firms that did not apply for registration by December 15 will have to stop operating by January 10 and return funds to customers. If they do not comply, they will be \"at risk of being subject to the FCA’s criminal and civil enforcement powers,\" said the regulator.","The FCA has also advised customers of crypto firms, which should have applied to the regulator, but have not done so, to withdraw their funds before January 10, 2021.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">More than 90 firms await approval<\/span><\/strong>","The FCA became the anti-money-laundering (AML) and counter-terrorist financing (CFT) watchdog for crypto companies in January of this year. That change required all new and existing crypto businesses in the U.K. to either get registered or cease their operations.","Thus far, the FCA has approved <a href=\"https:\/\/register.fca.org.uk\/s\/search?predefined=CA\" data-v-f87c67ca=\"\">only three companies' registration applications<\/a>, while <a href=\"https:\/\/register.fca.org.uk\/servlet\/servlet.FileDownload?file=0154G0000062BtF\" data-v-f87c67ca=\"\">more than 90 other applications still await approval<\/a>. The three companies that have already made it to the FCA's register are crypto payments app Ziglu and exchange operators Gemini and Archax. Gemini has received two separate registrations.","Earlier this month, the number of firms awaiting registration was more than 150, <a href=\"https:\/\/www.theblockcrypto.com\/daily\/86276\/uk-fca-crypto-registry-backlog-aml\" data-v-f87c67ca=\"\">as The Block reported at the time<\/a>. The new figure likely means around 60 firms have either withdrawn their registration applications or the FCA rejected their applications.","The Block has learned that the FCA has received 181 applications to date. The regulator has also received additional applications from both those firms that are not yet trading and those that may not need to be registered in the U.K.","Meanwhile, some of the top firms that await their FCA registration are Fidelity Digital Assets, B2C2, Bitstamp, Kraken-owned Crypto Facilities, and Galaxy Digital, among others.","<em data-v-f87c67ca=\"\">Update: This story has been updated to include more information (the second last para).<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"January 10, 2021","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"Crypto Facilities","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"January 10","content":"DATE"},{"type":"Kraken","content":"PERSON"},{"type":"December 2020","content":"DATE"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Bitstamp","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Temporary Registration Regime","content":"ORGANIZATION"},{"type":"December 15","content":"DATE"},{"type":"July 9, 2021","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}