{"summary":"Crypto market maker Wintermute has funds stuck on embattled crypto exchange FTX, the firm said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184792\/wintermute-says-it-has-funds-on-crypto-exchange-ftx-but-its-not-significant","publishDate":"2022-11-09T10:25:09","id":13211,"type":null,"title":"Wintermute says it has funds on crypto exchange FTX, but it&#x27;s not &#x27;significant&#x27;","category":["FINANCE FIRMS"],"content":["Crypto market maker Wintermute said it has funds stuck on embattled crypto exchange FTX, but that they are within its \"risk tolerances\" and won't impact its overall finances.&nbsp;","Wintermute said in a tweet thread that while its exposure is limited thanks to its risk controls and efforts to remove funds pre-collapse, some money remains. It didn't say how much.&nbsp;","\"We do have remaining funds on FTX, and while this is not ideal, the amount is within our risk tolerances and does not have a significant impact on our overall financial position,\" the firm said.","The disclosure comes as other firms in the industry have sought to <a href=\"https:\/\/www.theblock.co\/post\/184559\/genesis-crypto-com-latest-companies-to-distance-themselves-from-ftx-crisis\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">allay fears of exposure<\/a> to FTX after the exchange announced yesterday <a href=\"https:\/\/www.theblock.co\/post\/184423\/ftxs-bankman-fried-gets-binance-bailout-in-stunning-reversal-of-fortune\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a plan to sell itself<\/a> to Binance in the wake of a liquidity crunch.&nbsp;","Wintermute said it has no exposure to FTX's exchange token, FTT, the market collapse of which appears to have hastened FTX's downfall. \"As a market neutral trading firm, we do not have any directional exposure to FTT tokens or related ecosystem assets.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wintermute","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}