{"summary":"After staying at a discount for months, the rate of USDT to RMB has flipped to a premium compared to the foreign exchange rate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/95604\/usdt-yuan-premium-bitcoin-btc-drop","publishDate":"2021-02-23T10:26:49","id":13212,"type":null,"title":"USDT flipped to a 2% premium against RMB amid bitcoin&#x27;s price drop","category":["ASIA"],"content":["After remaining at a discount for months, the exchange rate of USDT to Renminbi (RMB) has flipped to a premium compared to the foreign exchange rate for U.S. dollars.&nbsp;","Industry players say the flip is indicative of a near-term USDT shortage as bitcoin's price briefly fell below $47,000 on Tuesday and over $5 billion in crypto derivatives positions were liquidated in the past 24 hours.","Crypto over-the-counter traders on major exchanges that cater to Chinese investors, including Huobi, OKEx and Binance -- as well as second-tier venues like Gate.io -- are now quoting bids and asks for USDT at around 6.59 yuan per unit, based on real-time data seen by The Block.","Meanwhile, the onshore foreign exchange rate for 1 USD is centered around 6.45 yuan, according to data from major Chinese commercial banks. This means that USDT is trading at OTC desks in China at a more than 2% premium, having grown from 0.3% on Monday morning China time.","To put it in context, the USDT-to-yuan rate had been trading at as much as a 2% discount for months prior to the Lunar New Year in early February.","One factor that may have contributed to the flip is heightened demand from Chinese buyers, especially those who are not crypto-native. These buyers entered the market following the bull run during 2020 that was primarily driven by U.S institutional investors, said Flex Yang, co-founder and CEO of crypto lender Babel Finance.&nbsp;","\"Chinese investors have since then been racing to find channels to purchase bitcoin .... resulting in higher demand [for USDT] on the OTC market,\" he said.","Ever since the People's Bank of China banned domestic companies from operating centralized order books for yuan-to-crypto trading in 2017, OTC merchants have become the only way for China-based investors to cash in or out in order to participate in crypto-to-crypto trading.","Taking a step back, Annabelle Huang, partner at Hong Kong-based trading firm Amber, said the \"markets typically see some seasonality of USDT\/CNY trading at a discount over the Chinese New Year holiday given repatriation of yuan back over the festive season.\"","While her firm hasn't \"observed any strong buying flows or anything significant per se that drove the recent flip into premium,\" she said that \"historically the pair exhibited the correlation where USDT would trade at a premium when BTC drops, either on the back of collateral top-up or dip-buying perhaps.\"","\"[Bitcoin perpetual contracts] funding rate has stayed quite elevated and we remain cautious on BTC and ETH in the short term,\" she added. \"Pullback triggered by long-liquidation should not be surprising, which we are witnessing.\"","The BTC funding rate is a fee adjusted every several hours on exchanges to balance the supply and demand between perpetual long and short positions.","When the contracts change hands above bitcoin's spot prices, the funding rate will be positive as a fee that long holders pay to short holders. If the contracts trade below bitcoin's spot prices, the funding rates will be negative and short holders will pay the opposite. The higher the funding rate is, the more leveraged the market tends to be.&nbsp;","Indeed, just days prior to bitcoin's price surge to an all-time high above $58,000 over the weekend, the 7-day moving average of BTC funding rates in annualized terms reached as much as 117% on some exchanges, based on The Block's Dashboard.","Yang argued that the crypto market has become overbought with \"arbitrage opportunities everywhere\" and thus resulting in significant demand for USDT.","\"We anticipate a major market correction as a result of the low liquidity of both USDT and BTC and may last for 2 weeks,\" Yang said.","<iframe title=\"BTC Funding Rates (7DMA, APY)\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/btc-funding-rates\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Annabelle Huang","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"2%","content":"PERCENT"},{"type":"\" Yang","content":"ORGANIZATION"},{"type":"Babel Finance","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"6.45 yuan","content":"MONEY"},{"type":"0.3%","content":"PERCENT"},{"type":"Flex Yang","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$47,000","content":"MONEY"},{"type":"6.59 yuan","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"People's Bank of China","content":"ORGANIZATION"},{"type":"USDT\/CNY","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Renminbi (RMB","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"117%","content":"PERCENT"},{"type":"$58,000","content":"MONEY"},{"type":"OTC","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"2020","content":"DATE"},{"type":"Huobi","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}