{"summary":"There&#x27;s only one thing that matters for firms in the trading world when it comes to crypto: is there flow?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257902\/when-it-comes-to-crypto-the-trading-world-will-go-with-the-flow","publishDate":"2023-10-17T18:01:02","id":13210,"type":null,"title":"When it comes to crypto, the trading world will go with the flow","category":["POLICY"],"content":["Last week, Washington, D.C. played host to STA's <a href=\"https:\/\/securitytraders.org\/2023-conference\/\" data-v-f87c67ca=\"\">annual market structure conference<\/a>, luring prominent figures from the world's largest stock brokers, exchanges and trading firms. This event is one of the few non-crypto gatherings I make an effort to attend in order to stay informed about developments in the U.S. equity market structure. This year proved particularly intriguing for me, as it was the first time the event was held in a post-FTX world.&nbsp;","In general, professionals from the securities world continue to show a keen interest in the crypto industry, especially in the wake of all things SBF. Although they may not view it as a mature sector, their attitude toward crypto has evolved significantly compared to the dismissive stance they might have taken in 2018. That being said, there was not a big crypto showing this year, with only one panel on the topic and, with the exception of the likes of Citadel Securities-backed <a href=\"https:\/\/edxmarkets.com\/\" data-v-f87c67ca=\"\">EDX<\/a>, Brett Harrison's Architect, and Paxos, there was very little representation from the crypto world. I also get the sense that crypto efforts at a lot of the firms attending STA have been scaled back, at least for now. At the end of the day, there's only one thing that matters for firms in the trading world when it comes to crypto: is there flow? If there's flow, then they are all in. If there's not, then they are going to where the flow is.","Another noteworthy observation was the extent to which Securities and Exchange Commission Chair Gary Gensler has stirred discontent within the securities trading ecosystem. It may provide a source of solace for crypto market participants to realize that they're not the only ones feeling frustrated with the regulator. Crypto participants express their concerns about the agency's seemingly stringent approach to regulation, hindering the launch of a spot bitcoin ETF. In contrast, the U.S. equities market is deeply concerned about several proposals from the agency that have the potential to increase market costs and put it at a disadvantage compared to similar global markets.","In July, the agency proposed new broker requirements aimed at addressing \"conflicts\" by essentially eliminating features that might influence an investor's decision regarding a particular investment. Bloomberg's Larry Tabb <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-140\" data-v-f87c67ca=\"\">explained<\/a> the controversy surrounding this proposal during a conference side event. In essence, the SEC is pushing for firms to assess and mitigate the use of technology that \"results in the firm's interests being placed ahead of investors' interests.\" But the proposal's broad scope could cover commonplace features people have grown accustomed to in their brokerage apps such as trend lines and advanced charting features, Tabb noted. In a letter to the SEC, Virtu Financial argued that the scope of the proposal is \"simply unprecedented.\"","\"And like so many other recent rulemakings, the actual cost of compliance is likely to be many order of magnitude greater than the Commission's highly questionable estimate of $78,050 for 'complex covered technology firm,'\" Virtu said.","SIFMA, a trade association for broker dealers and investment banks, told the SEC in its own letter that the proposed rules would be \"unlawful, arbitrary, and capricious.\" Sounds similar to the discourse around the spot bitcoin ETF, doesn't it?&nbsp;","There's also the recent commotion surrounding the SEC's new rules on short selling disclosures for hedge funds, which were put into effect earlier this month. These regulations mandate that such firms must provide substantially more information about their short-sale transactions to the agency, with the aim of enhancing transparency in the aftermath of the GameStop saga. Under these rules, firms would need to report their short positions to the SEC, and firms lending shares for short selling would be required to report this activity to FINRA.","\"Given past market events, it's important for the [SEC] and the public to know more about short sale activity in the equity markets, especially in times of stress or volatility,\" Gensler said.&nbsp;","That has the industry up in arms, arguing that the requirements are burdensome and add unnecessary costs. Here's STA in a commented letter speaking out against the proposal:&nbsp;","\"It is our view that the Proposal is a significant rulemaking as measured by the breadth of industry participants it covers (issuers, Managers, broker-dealers with retail investors, and broker-dealers who meet the definition of market maker), the amount of technology development required for new reporting requirements (\"buy to cover\"), short sales done under BFMM and daily calculations of short position activity), and costs to implement ($200,060,000 for 'buy to cover'; $60,746,220 for Form SHO).\"","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">This first appeared in Frank Chaparro's biweekly The Scoop Newsletter.&nbsp;<a href=\"https:\/\/www.theblock.co\/newsletters\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Sign up<\/a>&nbsp;now.&nbsp;<\/em><\/strong>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$78,050","content":"MONEY"},{"type":"$60,746,220","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Virtu","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"$200,060,000","content":"MONEY"},{"type":"Tabb","content":"PERSON"},{"type":"FINRA","content":"ORGANIZATION"},{"type":"GameStop","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Commission","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"end of the day","content":"TIME"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"STA","content":"ORGANIZATION"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Brett Harrison","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"Larry Tabb","content":"PERSON"}],"hashtag":["CRYPTO","SEC"],"authors":["Frank Chaparro","The Block"]}