{"summary":"Investors in Phaver&#x27;s seed round includes Polygon Ventures, Nomad Capital, Symbolic Capital, Foresight Ventures and others.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/254946\/web3-social-platform-phaver-raises-7-million-in-seed-funding","publishDate":"2023-10-05T10:11:48","id":13222,"type":null,"title":"Web3 social platform Phaver raises $7 million in seed funding","category":["DEALS"],"content":["Web3 social media platform Phaver has raised $7 million in seed funding.&nbsp;","Investors in the round included Polygon Ventures, Nomad Capital, Symbolic Capital, dao5, Foresight Ventures, Alphanonce, f.actor, Superhero Capital and others, according to a statement.","Phaver offers a mobile app that allows users to onboard into the crypto space without needing a crypto wallet. The firm allows individuals to use their email or existing social media and then create a web3 wallet later on, where they can display digital assets such as NFTs or connect to other social blockchain networks such as Lens.","\"Phaver’s mission is to connect the entire web3 by allowing users to bring in their own building blocks for their social graph, whether that means building credibility with a decentralized ID, finding community among holders of the same collectibles or building relationships across the entire internet with on-chain social layers like Lens,\" Phaver CEO Joonatan Lintala said in the statement.","\"Users, who now own crucial pieces of the social network, also deserve their fair share of the pie and should be heard in important decisions,\" Lintala added.","Phaver first launched in 2022 on <a href=\"https:\/\/www.theblock.co\/post\/233746\/lens-protocol-raise-decentralized-social-media\" data-v-f87c67ca=\"\">Lens<\/a>, a blockchain mainnet undergirding web3 social platforms.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Superhero Capital","content":"ORGANIZATION"},{"type":"Polygon Ventures","content":"ORGANIZATION"},{"type":"Nomad Capital","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Alphanonce","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Joonatan Lintala","content":"PERSON"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["MK Manoylov","The Block"]}