{"summary":"An organized crime network across European countries allegedly used call centers to defraud victims for tens of millions of euros.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202101\/european-cross-border-crypto-fraud-network-dismantled","publishDate":"2023-01-13T08:58:02","id":1322,"type":null,"title":"European cross-border crypto fraud network dismantled","category":["Legal"],"content":["<span data-v-f87c67ca=\"\">European law enforcement agencies have dismantled a crypto fraud network across Serbia, Germany, Cyprus and Bulgaria. The cross-border operation allegedly used call centers to defraud international victims out of tens of millions of euros.<\/span>","<span data-v-f87c67ca=\"\">The European Union Agency for Criminal Justice Cooperation and Europol arrested 14 people in Serbia and one in Germany after the online scam investigation launched in 2021.<\/span>","<span data-v-f87c67ca=\"\">The asset seizures include 150 computers, three cars, two luxury apartments, $1 million in cryptocurrencies and 50,000 euros in cash, according to the <\/span><a href=\"https:\/\/www.eurojust.europa.eu\/news\/takedown-fraudulent-cryptocurrency-network-bulgaria-cyprus-and-serbia\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announcement<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Victims were reportedly based in Germany, Switzerland, Austria, Australia and Canada. While the exact number was not disclosed, the law enforcement authorities said that the number identified is “almost certainly only the tip of the iceberg.” During investigations, they found “high volumes of financial transactions.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The organized crime group “operated the call centers from Serbia and used a technological infrastructure in Bulgaria to run the scheme,” the announcement said, adding that “allegedly, Cyprus was the base for laundering the illegal proceedings.”<\/span>","<span data-v-f87c67ca=\"\">There is no connection between this case and the raid of crypto lender Nexo, according to Bulgarian news outlet <\/span><a href=\"https:\/\/www.svobodnaevropa.bg\/a\/32222014.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Free Europe<\/span><\/a>,<span data-v-f87c67ca=\"\"> which cited a spokesperson for the Sofia City Prosecutor's Office.&nbsp;<\/span><span data-v-f87c67ca=\"\">Nexo’s offices were raided by police on Thursday as Bulgarian prosecutors <\/span><a href=\"https:\/\/www.theblock.co\/post\/201454\/nexos-bulgaria-office-raided-by-police\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">began<\/span><\/a><span data-v-f87c67ca=\"\"> investigating alleged criminal financial conduct, including money laundering and tax violation. Nexo’s co-founder and managing partner, Antoni Trenchev, called the allegations “absurd.”<\/span>"],"hashtag":["CRIME"]}