{"summary":"Roblox confirmed it is planning to test out immersive advertising systems later this year as it finds new ways to monetize the platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/162717\/roblox-to-focus-on-monetization-with-immersive-advertising-as-it-misses-q2-estimates","publishDate":"2022-08-10T09:49:07","id":13227,"type":null,"title":"Roblox to focus on monetization with immersive advertising as it misses Q2 estimates","category":["GAMING AND METAVERSE"],"content":["Roblox CEO and co-founder David Baszucki confirmed the company is planning to test out immersive advertising systems later this year as it leans into finding new ways to monetize the platform.","The comments were made during a Wednesday morning Q2 earnings call with investors, following the release of its results the previous evening. The California-based company <a href=\"https:\/\/www.theblock.co\/post\/162450\/roblox-reports-q2-revenues-of-591-2-million-but-bookings-down-4\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">reported<\/a> Q2 revenues of $591.2 million — a 30% increase year-on-year — but fell short of expectations, with a loss per share of $0.30 compared to analyst projections of $0.21.","Baszucki said Roblox had been talking with brands about how to create new opportunities on the platform for a while now, giving the example of pop-ups in a town square that players would be able to click on and jump over to a brand experience. He described it as a very scalable way to \"gently\" incorporate more advertising.&nbsp;&nbsp;","\"Given that we did 4.7 billion hours of engagement in the month of July... You can see the potential relative to the advertising for hours,\" he added.","Speaking with The Block, Bernard McTernan, senior analyst for internet\/consumer tech at Needham &amp; Company said it was good to see the company talking more about monetization when it came to advertising.","\"[We] would love for the company to give some more details around timing or framing the market opportunity. We think it could eventually be a hundreds of millions in revenue, but frankly the timing is uncertain for when it would happen,\" he said.","As it grows, the company is also looking to move away from its reputation for gaming, referring to itself as a \"human experience platform,\" on the earnings call. From being used as a communication tool during the pandemic to interest in building educational experiences and concerts on the platform, Roblox said there is \"huge run for technical innovation in this space.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"David Baszucki","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Baszucki","content":"PERSON"},{"type":"$591.2 million","content":"MONEY"},{"type":"Roblox","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"$0.30","content":"MONEY"},{"type":"Bernard McTernan","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"$0.21","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Needham &amp; Company","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["EARNINGS","ROBLOX"],"authors":["Callan Quinn","The Block"]}