{"summary":"A hacker that exploited the Uranium Finance DeFi platform may have used &#x27;Magic: The Gathering&#x27; trading cards to launder the loot.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266790\/uranium-finance-hacker-may-have-cashed-out-via-magic-the-gathering-cards-zachxbt-says","publishDate":"2023-12-08T11:40:49","id":13220,"type":null,"title":"Uranium Finance hacker may have cashed out via &#x27;Magic: The Gathering&#x27; cards, ZachXBT says","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">A hacker that exploited the Uranium Finance DeFi platform in 2021 may have used \"Magic: The Gathering\" trading cards to try and launder their loot after running it through the Tornado Cash mixing service, the pseudonymous blockchain sleuth ZachXBT said on Thursday.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/twitter.com\/zachxbt\/status\/1732790450350703052\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">thread<\/span><\/a><span data-v-f87c67ca=\"\"> on X, ZachXBT outlined a series of moves that saw someone withdraw 11,200 ETH over the past year from Tornado Cash in 100 ETH increments. Then, that user swapped the ETH for wrapped ETH (WETH), transferred it to a new address, swapped it for USDC and then used some of it to buy \"Magic: The Gathering\" (MTG) trading cards.<\/span>","<span data-v-f87c67ca=\"\">Part of the funds were also deposited to centralized exchanges Kraken, Bitpay, and Coinbase, the researcher <\/span><a href=\"https:\/\/x.com\/zachxbt\/status\/1732790502624510416?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">wrote<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">ZachXBT said the steps appeared to have been taken to make it harder to track the funds back to their origin, which likely was the <\/span><a href=\"https:\/\/www.theblock.co\/post\/103076\/binance-smart-chain-defi-uranium-finance-exploited-lost-50-million\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">2021 exploit<\/span><\/a><span data-v-f87c67ca=\"\"> of the Uranium Finance decentralized exchange. The timing of the Uranium hacker depositing funds to Tornado Cash, and the MTG cards buyer withdrawing them suggests they might well be the same person.<\/span>","<span data-v-f87c67ca=\"\">\"In March 2023, the Uranium hacker deposited 52 X 100 ETH to Tornado &amp; this person received 52 X 100 ETH,\" ZachXBT said. \"March 6 &amp; 14: Uranium Hacker deposits 52 X 100 ETH to Tornado. March 7 &amp; 15: Our person withdrew huge volumes from Tornado.\"<\/span>","<span data-v-f87c67ca=\"\">Uranium Finance, a Binance Smart Chain-based fork of Uniswap, <\/span><a href=\"https:\/\/www.theblock.co\/post\/103076\/binance-smart-chain-defi-uranium-finance-exploited-lost-50-million\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">lost $50 million<\/span><\/a><span data-v-f87c67ca=\"\"> in a 2021 exploit, when an attacker used a calculation error in the code to siphon liquidity out of the protocol. During the migration to Uranium's V2 version, 80 bitcoin, 1,800 ETH, 17.9 million BUSD, 5.7 million USDT, 638,000 ADA, 26,500 DOT, 34,000 wrapped BNB, and 112,000 U92 tokens, a native token of Uranium, were drained.<\/span>","<span data-v-f87c67ca=\"\">After the exploit, the attacker sent 2,438 ETH to Tornado Cash. They also swapped the DOT and ADA tokens to ETH via Binance Smart Chain-based PancakeSwap and sent 80 bitcoin to AnySwap.<\/span>","<span data-v-f87c67ca=\"\">To buy the trading cards, ZachXBT said a person went to a U.S.-based broker who contacted sellers on their behalf. After talking to several sellers involved in the trades, ZachXBT found that the buyer \"was spending millions on starter decks, alpha sets, sealed boxes,\" for which they overpaid by 5-10%. The buyer sent crypto to the broker upfront and never revealed their identity to the sellers.<\/span>","<span data-v-f87c67ca=\"\">A MTG card collector who goes by notsofast on X told The Block that the user ZachXBT tracked likely purchased high-value vintage cards that are hard to come across. <\/span>","<span data-v-f87c67ca=\"\">Starter decks are \"old, rare, and irreproducible, they're the one kind of vintage product that has a very high price, likely easy verifiable authenticity and provenance, and trades infrequently.\" Alpha sets \"are at the upper price range, they don't trade often, and when they do, either everyone knows about it, or the trade is deliberately kept secret so nobody knows.\"<\/span>","<span data-v-f87c67ca=\"\">The fact that the hacker could have bought the cards potentially taints the majority of the remaining supply of those cards, notsofast suggested in <\/span><a href=\"https:\/\/x.com\/notsofast\/status\/1732807327089033397?s=20\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">post<\/span><\/a><span data-v-f87c67ca=\"\"> on X.<\/span>","<span data-v-f87c67ca=\"\">Tornado Cash was <\/span><a href=\"https:\/\/www.theblock.co\/post\/184320\/new-treasury-sanctions-link-tornado-cash-to-north-koreas-nuclear-weapons-program\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sanctioned<\/span><\/a><span data-v-f87c67ca=\"\"> last November by the U.S. Treasury’s Office of Foreign Assets Control, and its founders were <\/span><a href=\"https:\/\/www.theblock.co\/post\/247049\/tornado-cashs-semenov-added-to-us-government-sanctions-list\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">charged<\/span><\/a><span data-v-f87c67ca=\"\"> with \"conspiracy to commit money laundering, conspiracy to commit sanctions violations, and conspiracy to operate an unlicensed money transmitting business.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DOT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"U.S. Treasury’s Office of Foreign Assets Control","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"March 7 &amp; 15","content":"DATE"},{"type":"Bitpay","content":"PERSON"},{"type":"Uranium","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"March 6 &amp; 14","content":"DATE"},{"type":"Uranium Finance","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"MTG","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"last November","content":"DATE"},{"type":"$50 million","content":"MONEY"}],"hashtag":[],"authors":["Anna Baydakova","The Block"]}