{"summary":"Paradigm, the crypto derivatives platform, suffered a big hit to trading volumes following the collapse of FTX. Now the startup is lining up new exchange partners to try to recapture what it lost.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195628\/derivatives-platform-paradigm-lines-up-new-exchange-partnerships-post-ftx","publishDate":"2022-12-16T07:53:42","id":13223,"type":null,"title":"Derivatives platform Paradigm lines up new exchange partnerships post-FTX","category":["EXCHANGES"],"content":["Paradigm, the crypto derivatives platform, suffered a big hit to trading volumes following the collapse of FTX. Now, the startup is lining up new exchange partners to try to recapture what it lost.","Paradigm also shelved a major fundraising effort recently, underscoring how tough navigating the crypto market has become.","On Dec. 15, Paradigm <a href=\"https:\/\/www.theblock.co\/post\/195250\/paradigm-salary-cuts\" data-v-f87c67ca=\"\">announced<\/a> a 15% salary cut for all staff. The move, it said, would “reduce the need for layoffs seen across the ecosystem” and weigh less on the startup’s momentum — which had been considerable prior to the FTX debacle that began in early November.","A wide variety of crypto businesses have been caught up in the contagion stemming from FTX’s collapse. Only yesterday, The Block revealed that trading firm QCP Capital <a href=\"https:\/\/www.theblock.co\/post\/194878\/qcp-capital-ftx-exposure\" data-v-f87c67ca=\"\">has $97 million<\/a> stuck on the exchange.","While Paradigm did not have any treasury funds on FTX at the time of its shuttering, according to co-founder and CEO Anand Gomes, FTX had been an exchange partner, and its sister firm Alameda Research was a Paradigm client, as well as an equity investor in the business. Paradigm had less than $200,000 in revenue from partnerships sitting on FTX that has become frozen, he said.","The impact of these relationships with FTX and Alameda is evident in Paradigm’s trading volumes, which are <a href=\"https:\/\/www.paradigm.co\/stats\" data-v-f87c67ca=\"\">displayed<\/a> on its website.","For the week commencing Nov. 6, Paradigm recorded 200,000 BTC ($3.4 billion) in weekly volume, of which 45,000 BTC came from futures spreads. One week later, the grand total had more than halved and futures spreads volume had almost disappeared entirely. Weekly volumes in December have been lower still, at around 60,000 BTC each week so far, with futures spreads volumes virtually non-existent.","Futures spreads involves investors simultaneously buying one futures contract and selling another with the same underlying asset, taking two positions to capitalize on price discrepancies.","“Spot, perp and futures (Delta1) spreads are a big growth opportunity for us as illustrated by the strong momentum we had on FTX (the market gave us a strong signal with $5.7 billion traded within the first 90 days),” Gomes told The Block. In simple terms, Paradigm’s model is to handle off-exchange matching, leaving on-exchange execution, clearing and settlement to exchanges like FTX.","“Our non-custodial, multi-venue model shines here and we are looking forward to replicating the success we had on FTX with other partner venues currently in our pipeline. For example, we will be launching a Delta1 spreads for USDT products on Bybit (an existing partner) in Q1 23 and have additional exchange venues that should go live in 1H23.”","Paradigm’s options volumes have also taken a hit, but Gomes said the platform’s market share is in fact higher — up from 28% last month to 32% today.","“We are a market leader in options and are incredibly excited about the growth of the crypto options marketplace in 2023 and beyond,” said Gomes. “As we saw in the last cycle, the companies that emerge from these periods end up being superbrands. Runway wise we are now well positioned as it increases our financial flexibility and give us the best possible shot at doing that.”","Paradigm had explored raising a considerable sum of money earlier this year, but shelved that effort in recent weeks. &nbsp;","The company held talks with potential backers about raising around $100 million, according to two people with knowledge of the matter. One of those people said the round, if successful, would have vaulted the company to unicorn status — meaning its valuation would have topped $1 billion.","“Any previous fundraising conversations were exploratory in nature and no terms were reached at the time of the collapse of FTX,” Gomes said, adding that&nbsp;the company will look at raising again “when market conditions improve next year.”","Paradigm last raised capital in December 2021, when it secured $35 million at a $400 million valuation in a round co-led by Jump Crypto and Alameda Research, the Sam Bankman-Fried-owned trading firm at the heart of the FTX scandal.","<em data-v-f87c67ca=\"\">Correction: Story updated after Paradigm corrected its prior market share data and clarified that only its treasury funds avoided getting caught on FTX.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"Nov. 6","content":"DATE"},{"type":"$5.7 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"$3.4 billion","content":"MONEY"},{"type":"$400 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$35 million","content":"MONEY"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gomes","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Dec. 15","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"28%","content":"PERCENT"},{"type":"December 2021","content":"DATE"},{"type":"$97 million","content":"MONEY"},{"type":"Anand Gomes","content":"PERSON"}],"hashtag":["FTX"],"authors":["Ryan Weeks","The Block"]}