{"summary":"Crypto firms are under pressure to show proof of reserves after the shocking FTX collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188606\/grayscale-wont-share-proof-of-reserves-citing-security-concerns","publishDate":"2022-11-19T13:58:53","id":13236,"type":null,"title":"Grayscale won’t share proof of reserves, citing ‘security concerns’","category":["COMPANIES"],"content":["Grayscale will not show proof of reserves due to “security concerns,” after its bitcoin and ether products fell to all-time lows this week.","Crypto firms are under pressure to share information about the health of their reserves after FTX filed for bankruptcy protection.","Crypto investment firm Grayscale won't show proof of reserves after bitcoin and ether products fall to new all-time lows.","“Due to security concerns, we do not make such on-chain wallet information and confirmation information publicly available through a cryptographic Proof-of-Reserve, or other advanced cryptographic accounting procedure,” Grayscale said Friday afternoon on <a href=\"https:\/\/twitter.com\/grayscale\/status\/1593737708723118080?s=46&amp;t=0rqfFwHKv8-_hF5l7ANbCg\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Twitter<\/span><\/a>.","The firm acknowledged its decision to keep its reserve information private would be a “disappointment” to some investors. Crypto firms are being pressed to show more information about their reserves after crypto behemoth <a href=\"https:\/\/www.theblock.co\/post\/188571\/ftx-begins-reviewing-its-assets-as-part-of-bankruptcy-process\" data-v-f87c67ca=\"\">FTX filed for bankruptcy<\/a> protection earlier this month.","“But panic sparked by others is not a good enough reason to circumvent complex security arrangements that have kept our investors’ assets safe for years,” Grayscale said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Grayscale Bitcoin Trust (GBTC) hit a <a href=\"https:\/\/www.theblock.co\/post\/188274\/coinbase-silvergate-and-crypto-stocks-tick-lower-grayscale-trusts-hit-new-lows\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">record low<\/span><\/a> on Thursday, as did its ETHE product. The firm’s parent company, Digital Currency Group, has brushed off contagion fears after the shocking collapse of FTX. At the same time, however, another entity affiliated with Grayscale recently halted withdrawals. Genesis Global Capital is linked to Grayscale through Digital Currency Group.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grayscale","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"afternoon","content":"TIME"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}