{"summary":"The popular ride-hailing app said users in Singapore can top up their wallets with cryptocurrencies, including bitcoin and ether.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283263\/southeast-asia-super-app-grab-offers-crypto-payment-options-in-singapore","publishDate":"2024-03-19T04:03:28","id":13235,"type":null,"title":"Southeast Asia super-app Grab offers crypto payment options in Singapore","category":["COMPANIES"],"content":["Grab, the major ride-hailing super-app in Southeast Asia, has started allowing users to top up their wallets with cryptocurrencies in Singapore through its partnership with payments firm Triple-A.","The GrabPay Wallet now enables users to pay using cryptocurrencies such as bitcoin, ether, and stablecoins including XSGD, USDC, and USDT, <a href=\"https:\/\/www.straitstimes.com\/business\/grab-users-can-now-pay-in-crypto\" data-v-f87c67ca=\"\">according to<\/a> local newspaper The Straits Times.","<span data-v-f87c67ca=\"\">“This new feature provides users with added flexibility and convenience as it allows them to convert their digital assets, such as stablecoins, into usable funds in their GrabPay Wallets,” a Grab spokesperson said in a statement shared with The Block. “By expanding the top-up options to include Digital Payment Tokens, Grab is providing users with a seamless and efficient way to access the company’s wide range of services.”<\/span>","<span data-v-f87c67ca=\"\">While Grab has established a strong presence across Southeast Asia, the crypto payment options are currently only available in Singapore, and it “will continue to monitor user adoption and respond to demand for such services,” the spokesperson added.<\/span>","<span data-v-f87c67ca=\"\">Grab has also started to <\/span><a href=\"https:\/\/www.theblock.co\/post\/249787\/southeast-asia-super-app-grab-adds-support-for-web3-services\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">incorporate web3 services<\/span><\/a><span data-v-f87c67ca=\"\"> with non-fungible token wallets. In June last year, it signed on to be a part of a <\/span><a href=\"https:\/\/www.theblock.co\/post\/235809\/singapores-mas-proposes-digital-money-system-amazon-and-grab-initiate-pilot-trials\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">pilot study with the Monetary Authority of Singapore<\/span><\/a><span data-v-f87c67ca=\"\"> surrounding the use of three digital assets including central bank digital currencies, tokenized bank deposits and stablecoins.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Southeast Asia","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Digital Payment Tokens","content":"ORGANIZATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June last year","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"A.","content":"ORGANIZATION"},{"type":"GrabPay Wallet","content":"ORGANIZATION"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}