{"summary":"Disclaimer: These summaries are provided for educational purposes only by Stephen Palley. They are not legal advice. These are his opinions only, aren’t","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/18275\/crypto-legal-frameworks-and-no-action-letters","publishDate":"2019-04-04T09:58:21","id":13232,"type":null,"title":"On crypto legal frameworks and no-action letters","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by&nbsp;<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are his opinions only, aren’t authorized by any past, present or future client or employer. Also he might change his mind. He contains multitudes.<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]<\/strong><\/em>","The SEC issued some long-anticipated guidance yesterday about “initial coin offerings” (ICOs) and securities law. This was released in the form of something called a \"Framework for 'Investment Contract' Analysis of Digital Assets.\" I've read this a couple of times and had a chance to sleep on it and – wait for it! – the bottom line seems to be that the law is pretty much what it always was.","What is a framework, by the way? I have never seen one of these before so I searched through the U.S. Code and the Code of Federal Regulations. Nothing! But there are some hints. If you read the document you will see that the title itself has a footnote, which is extremely like something that was written by a bunch of lawyers. If I'm being honest here I will confess that I have written things that have footnoted titles myself and this reads a lot like a law firm memorandum. I also read the footnotes first.","The footnote says that the \"framework represents the views of the Strategic Hub for Innovation and Financial Technology ... of the [SEC]. It is not a rule, regulation, or statement of the Commission, and the Commission has neither approved nor disapproved its content.\" Also (paraphrasing) it doesn't replace or supersede any \"case law, legal requirement, or statements or guidance from the Commission or staff.\" It's \"additional guidance\" ... but, you can't rely on it. So this Framework is, well ... insight into what the SEC says but don't rely on it? Another way of reading is: \"The SEC wrote you a memo because you kept bugging us. Now go hire a lawyer and stop screwing around. We mean it this time!\" (In fairness, even though it’s legally speaking a nothing in terms of precedent, you can be sure that it will be cited in briefs and Courts will end up citing it in opinions, so it’s not exactly a non-event).","In what was probably not a coincidence, the SEC also dropped a no-action letter response today in connection with a digital asset offering and it serves as a nice bookend. I'll break both down below, but heads up at the outset: if someone tells you that this SEC framework represents a sea change in law ... I'd suggest inching away slowly from them and not drinking from the same cup that they were drinking from, because it was probably laced with hopium.","The framework introduction can be summarized as follows:","The rest of the memorandum runs through a Howey analysis, focusing mostly on the third prong -- whether the purchaser has a reasonable expectation of profits (or other financial returns) derived from the efforts of others.\" According to this, not an SEC opinion framework, prongs one and two are usually easily satisfied where an ICO is at issue, but prong three is where the rubber meets the road. Not to get too deep into legal weeds, but some critics have pounced on this by suggesting that the SEC wrongly gives short shrift to the common enterprise element of the Howey test. I suppose whether you think that’s true depends on whether you’re the plaintiff or the defendant.","For its gloss on prong three, and because we desperately need new jargon, the framework coins a new term, \"Active Participant\" or \"AP\", which includes a promoter, sponsor or other third party (or affiliated group or third parties). When an AP provides \"essential managerial efforts that affect the success of the enterprise, and investors reasonably expect to derive profits from those efforts, then this third prong is met.\" A bunch of examples of this are provided, none of which are shocking, including (among other things) development, improvement, enhancement or operation of the network; whether or not the network is functional at the time of the raise; creation of a market for the asset by the AP; lead role of AP in development of the network. Common sense here – if you are in charge of the thing, even if you call it decentralized, this weighs in favor of finding that your token was a security and your sale a securities offering.","The Framework also addresses the question of the circumstances under which something that was previously sold as a security should be reevaluated at the time of later offers or sales? Here, it's suggested that you'd look to see such things whether or not the AP's continued efforts are still important to the value of the investment in the asset, whether the network would still function without the AP. Stated differently, have the things that made it a security initially gone away? Here, the SEC recognizes the something can start as a security and later not be a security. The “sufficiently decentralized” concepts that William Hinman referenced in his speech last year isn’t referenced specifically, but the same concept – things can change – is recognized.","But wait, there's more! There's an \"Other Relevant Considerations\" section, and the stronger these factors are present the less likely Howey is met:","In addition to telling people something they probably already knew, this likely means that in the non-binding judgment of the people who wrote this thing just about every ICO was an unregistered securities offering, which I think Jay Clayton has probably said a half-dozen times. (Not bitcoin though).","The last line of the Framework concludes by reminding people to hire lawyers (the bar thanks you, SEC) and consult with staff.","Anyway, perhaps in the hope of causing Crypto Twitter to literally explode from excitement, the SEC also dropped a positive response to a no-action letter request today. The letter asks the SEC to confirm it will not enforcement action against a company called TurnKey Jet for offering and selling tokens for pre-paid charter air service without registering with the SEC. The SEC agrees in this case, based on a detailed letter from TKJ's lawyer that contains his opinion that they are not securities under Howey and its progeny. At the risk of over-simplifying this token, here's what it is:","Why go to the trouble of using a token at all? TKJ says the technology will allow for faster payment, clearing, and provision of services and (though this will be a private and permissioned blockchain) will offer some sort of blockchain-y transparency. Could be. I mean, these folks hired a securities lawyer (a good one, judging by his letter, by the way) to write a lengthy no-action letter request and appear to be planning to use tokens and have an ongoing token sale. Honestly, I read this letter and asked myself why anyone would use blockchain to pre-sell charter air service, but these folks clearly believe and maybe that's a bullish sign for the technology. Regardless, it's an interesting bookend to the Framework document, because it does show you exactly what a non-security use of a token and\/or token offering looks like to the SEC.","So, \"what's it all mean, Steve?\" Look, I am not saying it's a huge nothing-burger, but I am saying that the SEC just told us what it has told us many times before -- we apply the law to facts and circumstances; some things are investment contracts and some things aren't. I was asked on Bloomberg TV yesterday if this is essentially the nail in the coffin of ICO abuse or if they will come roaring back. While my crystal ball is as cloudy as March was in D.C., I think it's fair to say that the days of out-in-the-open, big-dollar ICO pump-and-dumps -- with no platform, no code, nothing but a whitepaper and a discord channel -- those are dead and gone in the United States.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>). They have given The Block permission to republish their commentary and analysis in full.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"William Hinman","content":"PERSON"},{"type":"Jay Clayton","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"AP","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Code of Federal Regulations","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"ICO","content":"ORGANIZATION"},{"type":"Strategic Hub for Innovation and Financial Technology","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"TKJ","content":"ORGANIZATION"},{"type":"Steve","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"}],"hashtag":["SEC"],"authors":["Stephen D. Palley","The Block"]}