{"summary":"Flashbots has announced an upgrade called SUAVE that aims to address censorship resistance and decentralization concerns.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177352\/flashbots-unveils-upgrade-that-could-resolve-censorship-concerns","publishDate":"2022-10-14T17:31:45","id":13247,"type":null,"title":"Flashbots unveils upgrade that could resolve censorship concerns","category":["DEFI"],"content":["Flashbots has announced an upgrade that aims to address censorship resistance and concerns over decentralization.","Robert Miller, product lead for Flashbots, discussed solving these concerns earlier this month and said it was working on a <a href=\"https:\/\/www.theblock.co\/post\/174977\/flashbots-product-lead-addresses-concerns-over-tornado-cash-censorship\" data-v-f87c67ca=\"\">decentralized solution.<\/a> The protocol, known as SUAVE, which has been in stealth development for the last year, was revealed this <a href=\"https:\/\/twitter.com\/hasufl\/status\/1580983853824765952\" data-v-f87c67ca=\"\">afternoon.<\/a>","Flashbots is a service that provides suggested blocks for validators to process while maximizing reward payouts. It is one of the most used third parties for this block production process.","Community concerns have stemmed from Flashbots censoring transactions related to <a href=\"https:\/\/www.theblock.co\/post\/174977\/flashbots-product-lead-addresses-concerns-over-tornado-cash-censorship\" data-v-f87c67ca=\"\">Tornado Cash<\/a>. More than 50% of Ethereum blocks built today are OFAC-compliant, <a href=\"https:\/\/www.mevwatch.info\/\" data-v-f87c67ca=\"\">according to MEV Watch.<\/a>","The debut of SUAVE comes shortly after Stephane Gosselin, co-founder of Flashbots, <a href=\"https:\/\/www.theblock.co\/post\/175709\/flashbots-co-founder-steps-down-after-disagreements-with-team-over-censorship\" data-v-f87c67ca=\"\">stepped down<\/a> in September after an internal disagreement around its censorship-resistance capabilities.","SUAVE aims to progressively decentralize the block-building process by open-sourcing its code and development, allowing anyone to contribute. It will feature cross-chain and multi-chain support, and work with any Ethereum-compatible blockchain or rollup.","More details about SUAVE will be released in the coming weeks, according to the development team.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last year","content":"DATE"},{"type":"MEV Watch","content":"ORGANIZATION"},{"type":"earlier this month","content":"DATE"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Robert Miller","content":"PERSON"},{"type":"Stephane Gosselin","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"OFAC","content":"ORGANIZATION"}],"hashtag":["MEV"],"authors":["Mike Truppa","The Block"]}