{"summary":"“Big Four” accounting firm EY has launched an improved tool that it says will reduce private transaction costs on Ethereum – the public blockchain. The","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51080\/ey-releases-improved-privacy-solution-for-ethereum-claiming-to-help-cut-transaction-costs-by-over-90","publishDate":"2019-12-19T06:20:33","id":13241,"type":null,"title":"EY releases improved privacy solution for Ethereum, claiming to help cut transaction costs by over 90%","category":["LAYER 1S"],"content":["“Big Four” accounting firm EY has launched an improved tool that it says will reduce private transaction costs on Ethereum – the public blockchain.","The tool implements third-generation zero-knowledge proof (ZKP) technology, a cryptographic method, which allows private transactions on public blockchains. EY <a href=\"https:\/\/www.ey.com\/en_gl\/news\/2019\/12\/ey-releases-third-generation-zero-knowledge-proof-blockchain-technology-to-the-public-domain\" data-v-f87c67ca=\"\">said<\/a> it will help make transactions more scalable by “significantly” reducing costs.","“In the prior iteration <a href=\"https:\/\/www.ey.com\/en_lu\/news\/2019\/04\/ey-releases-zero-knowledge-proof-blockchain-transaction-technology-to-the-public-domain-to-advance-blockchain-privacy-standards\" data-v-f87c67ca=\"\">released<\/a> in April 2019, public blockchains were already getting competitive with private networks. With this iteration, we cut the cost per transaction by more than 90% again, making private transactions more accessible for mainstream business application,” said Paul Brody, global blockchain leader at EY.","Technically speaking, the new tool allows batching multiple private transfers together in a single transaction, which reduces the size on-chain, and in turn, transaction costs.","It allows for “up to 20 transactions to be done at once and cuts the cost per transaction to around US$0.05,” said EY, adding that this represents a 400-fold improvement over its initial prototype <a href=\"https:\/\/www.ey.com\/en_gl\/news\/2018\/10\/ey-launches-the-world-s-first-secure-private-transactions-over-the-ethereu-public-blockchain\" data-v-f87c67ca=\"\">released<\/a> in October 2018.","“This technology is perhaps the most important EY blockchain milestone in making public blockchains scalable for the enterprise,” said Brody.","EY said the updated technology can also be deployed on private blockchains built on Ethereum. “On private blockchains, it provides a second layer of security and privacy,” it explained.","Looking ahead, EY is expected to announce more such improved functions. “I believe we will look back upon the industrialization of ZKPs as a key milestone in the wide enterprise migration from private to public blockchains,” said Brody, adding:<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“Organizations are increasingly seeing the potential for public blockchains, with 75% of enterprises likely to use these networks in the future.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Paul Brody","content":"PERSON"},{"type":"US$0.05","content":"MONEY"},{"type":"Brody","content":"PERSON"},{"type":"EY","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"October 2018","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"April 2019","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}