{"summary":"Decentralized order book exchange Helix has introduced pre-launch futures, allowing the trading of tokens before their official launch.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258086\/injective-dex-helix-unveils-token-pre-launch-futures-trading-celestia","publishDate":"2023-10-18T09:00:03","id":13248,"type":null,"title":"Injective DEX Helix unveils pre-launch futures for upcoming tokens, starting with Celestia","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Helix, the decentralized order book exchange built on the <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Injective <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248408\/injective-inj-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/Secondary_Symbol.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">INJ<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.11%\n    <\/span><\/a> <!----><\/span><\/span> blockchain, has unveiled pre-launch futures — enabling users to trade upcoming tokens before their official launch or exchange listings.&nbsp;<\/span>","The inaugural Helix pre-launch futures market will feature the Celestia (TIA) token. Helix said it will be the first exchange to offer the general public access to TIA via its perpetual market, with listings on major exchanges expected to follow.","Traditionally, access to highly anticipated crypto tokens before their public launch is reserved for early backers, venture capitalists and potentially insiders via elaborate derivatives and OTC deals. Helix’s move aims to disrupt this system and democratize trading access to pre-launch cryptocurrencies via its community-driven decentralized platform, according to a statement.","Among the tokens for which traders can access pre-launch futures is Celestia, which recently announced an airdrop.","<a href=\"https:\/\/www.theblock.co\/post\/253024\/celestia-is-airdropping-60-million-tokens-in-bid-to-build-its-network\" data-v-f87c67ca=\"\">Celestia’s token airdrop<\/a> claims process concluded earlier today with over 190,000 claimants and will be distributed in the coming days. Celestia is a modular blockchain network, with developer <a href=\"https:\/\/www.theblock.co\/post\/177841\/celestia-labs-hits-unicorn-status-in-latest-bet-on-modular-blockchains\" data-v-f87c67ca=\"\">Celestia Labs previously raising $55 million<\/a> in funding from investors, including Bain Capital Crypto and Polychain, at a valuation of $1 billion.","Besides its decentralized derivatives trading products aimed at retail users, the project unveiled <a href=\"https:\/\/helixapp.com\/institutional\/\" data-v-f87c67ca=\"\">Helix Institutional<\/a> in August. This is a dedicated on-chain platform for institutions, focused on security and compliance — only allowing KYC-verified, whitelisted addresses to engage in trades.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Celestia","content":"LOCATION"},{"type":"-2.11%","content":"PERCENT"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$55 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["DEXS"],"authors":["James Hunt","The Block"]}