{"summary":"Anichess said it has partnered with Chess.com and five-time World Chess Champion Magnus Carlsen to develop a decentralized chess game.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272791\/animoca-brands-anichess-chess-magnus-carlsen","publishDate":"2024-01-16T09:00:04","id":13253,"type":null,"title":"Animoca Brands’ Anichess launches first phase of decentralized chess game","category":["GAMING"],"content":["<span data-v-f87c67ca=\"\">Animoca Brands, a Hong Kong-based Web3 investor, announced today the first-phase launch of Anichess, its subsidiary developing a decentralized chess game in partnership with Chess.com.<\/span>","<span data-v-f87c67ca=\"\">Anichess, which also partnered with five-time World Chess Champion Magnus Charlsen, said in a statement today that the game features player-versus-environment gameplay in the first phase. The company plans to introduce the player-versus-player setting in the second phase later in the first quarter of this year.<\/span>","<span data-v-f87c67ca=\"\">The company noted that Anichess allows players to solve daily chess puzzles. By completing daily challenges, users can win Orbs of Power game assets for in-game utility and unlock new puzzles for more rewards, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">“Anichess revolutionizes the classic royal game by fusing traditional strategy and gameplay with the innovative elements of spellcasting, a fantasy storyline, and Web3 functionality,” Yat Siu, co-founder and executive chairman of Animoca Brands, said in the statement.<\/span>","<span data-v-f87c67ca=\"\">The launch comes after Anichess<\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.animocabrands.com\/anichess-completes-over-subscribed-usd1500000-seed-round-to-develop-innovative-chess-game\" data-v-f87c67ca=\"\"> raised $1.5 million<\/a> in its seed round in June 2023 from investors including GameFi Ventures, The Operating Group, Koda Capital, Bing Ventures, 708 Capital and Asymmetry Capital.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Bing Ventures","content":"PERSON"},{"type":"Koda Capital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yat Siu","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Magnus Charlsen","content":"PERSON"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Anichess","content":"ORGANIZATION"},{"type":"The Operating Group","content":"ORGANIZATION"},{"type":"Orbs of Power","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"second phase later in the first quarter","content":"DATE"},{"type":"June 2023","content":"DATE"}],"hashtag":["GAME","INVESTMENT FIRMS"],"authors":["Timmy Shen","The Block"]}