{"summary":"Magic Eden is the latest NFT marketplace to move to an optional royalty model as the debate about NFT royalties continues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177414\/solana-nft-platform-magic-eden-opts-for-optional-royalty-payments","publishDate":"2022-10-15T05:38:43","id":13254,"type":null,"title":"Solana NFT platform Magic Eden opts for optional royalty payments","category":["NFTS"],"content":["Magic Eden, the biggest NFT marketplace on Solana, <a href=\"https:\/\/twitter.com\/MagicEden\/status\/1581101016686399491\" data-v-f87c67ca=\"\">said<\/a> that users will now be able to decide how much they wish to pay as royalties to creators when purchasing items from the website.","“The decision on how much royalties to pay will be passed to the buyer,” the company said on Friday, adding: “By default, ALL collections\/listings will honor full royalties.”","According to Magic Eden, buyers will have three ways to set their preferred royalty percentages. They can edit their user profiles to select a royalty percentage payment that will apply to all NFTs on Magic Eden. Alternatively, they can select a royalty percentage for a particular collection or for a single item.","The NFT platform said it was aware that the move has significant implications for the NFT space, and expressed hope that it will be temporary.","Magic Eden added that it will also waive transaction fees on NFT purchases. The Solana NFT platform had charged 2% on sales.","The company’s announcement comes amid an ongoing debate about NFT royalties. On one side of the debate are some users who argue that there should not be compulsory royalty payments for NFTs. Creators, on the other hand, say these payments are a reward for their work.","It is important to note that royalty payments cannot be enforced on-chain. Instead, creators depend on marketplaces like Magic Eden to pay them a specified percentage of the value for which items are sold in secondary sales.","Now, this status quo is being upended by some platforms.","NFT swappers like SudoSwap <a href=\"https:\/\/www.theblock.co\/post\/172448\/royalty-free-nft-platform-sudoamm-surpasses-50-million-in-volume-months-after-launch\" data-v-f87c67ca=\"\">became popula<\/a>r for being <a href=\"https:\/\/www.theblock.co\/post\/163497\/an-nft-market-maker-set-0-royalties-sparking-concerns-about-the-future-of-artist-compensation\" data-v-f87c67ca=\"\">royalty-free platforms<\/a>.","In August, X2Y2, one of the marketplaces that launched a vampire attack on OpenSea, announced the removal of royalties for some collections.","DeGods, a popular NFT collection on Solana, caused a stir last week when it <a href=\"https:\/\/www.theblock.co\/post\/175943\/degods-removes-nft-royalties-predicts-all-marketplaces-will-move-to-0-model\" data-v-f87c67ca=\"\">removed all royalty payments<\/a>. The move was particularly significant given previous comments by the project’s founder that dropping royalties would make NFTs more expensive and create possibilities for more scam projects. Now, the DeGods’ founder has shifted to saying that 0% royalties will soon become the norm for NFT marketplace platforms.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"DeGods’","content":"ORGANIZATION"},{"type":"0%","content":"PERCENT"},{"type":"Solana","content":"LOCATION"},{"type":"Magic Eden","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["MAGIC EDEN"],"authors":["Osato Avan-Nomayo","The Block"]}