{"summary":"The share of bitcoin sent to mixers by darknet entities rose to 20% in Q1 2020 as compared to just 1% in Q1 2019.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65771\/use-of-bitcoin-mixers-by-darknet-entities-is-on-the-rise-new-report-reveals","publishDate":"2020-05-19T09:05:46","id":13265,"type":null,"title":"Use of bitcoin mixers by darknet entities is on the rise","category":["BITCOIN"],"content":["The use of bitcoin mixing services by darknet entities is growing, according to a new report by Bitfury’s crypto analytics unit Crystal Blockchain.","The report, <a href=\"https:\/\/crystalblockchain.com\/articles\/darknet-use-and-bitcoin-a-crypto-activity-report-by-crystal-blockchain\" data-v-f87c67ca=\"\">published<\/a> on Tuesday, reveals that the share of bitcoin sent to mixers by darknet entities rose to 20% in Q1 2020 as compared to just 1% in Q1 2019.","On the other hand, the share of bitcoin sent to crypto exchanges with verification requirements, decreased to 13% in Q1 2020 from 24% in Q1 2019.","“This is likely in response to increased regulation and verification processes for exchanges, leading darknet bitcoin owners toward other services to obfuscate the source of their coins,” said Crystal Blockchain. Bitcoin mixers combine payments from multiple users into a single transaction, masking their origin.","","","Overall, darknet entities sent 7,946 bitcoins to mixers in Q1 2020 as compared to 790 bitcoins in Q1 2019. While in terms of USD, the value grew sharply from $3 million in Q1 2019 to $67 million in Q1 2020.","The amount of bitcoin received by darknet entities from mixing services also increased three-fold, from 106 bitcoins in Q1 2019 to 288 bitcoins in Q1 2020. In terms of USD, the amount increased to nearly $2 million in Q1 2020 as compared to $400,000 in Q1 2019.","","","“While more exchanges implement the FATF (Financial Action Task Force) requirements, darknet users are trying to avoid the risk of unveiling of their activity by those exchanges. To veil darknet activities, they started to prefer mixing services to exchanges for withdrawal of cryptocurrency,” said Crystal Blockchain.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nOverall, the total amount of bitcoin sent and received by darknet entities decreased in Q1 2020 as compared to Q1 2019. This could be due to the growing popularity of altcoin usage, said Crystal Blockchain.","However, in terms of USD, darknet entities exchanged an increased amount of money — from $384 million in Q1 2019 to $411 million in Q1 2020. “This is partly explained by the growing capitalization of bitcoin, as well as further mass adoption of bitcoin. As it becomes increasingly easier to use cryptocurrency, the popularity of this payment method is steadily increasing,” said the firm.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crystal Blockchain","content":"ORGANIZATION"},{"type":"$411 million","content":"MONEY"},{"type":"$400,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"$2 million","content":"MONEY"},{"type":"Bitfury’s crypto analytics","content":"ORGANIZATION"},{"type":"$3 million","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$67 million","content":"MONEY"},{"type":"USD","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Q1 2019","content":"DATE"},{"type":"FATF (Financial Action Task Force","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"24%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"$384 million","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}