{"summary":"A user going by the name of &quot;ExploitDOT&quot; is allegedly selling 100,000 personal documents that were used to comply with the know-your-customer (KYC)","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8040\/a-darknet-vendor-is-allegedly-selling-images-and-data-associated-with-crypto-exchange-identity-verification-processes","publishDate":"2019-01-21T07:48:59","id":13267,"type":null,"title":"A darknet vendor is allegedly selling images and data associated with crypto exchange identity verification processes","category":["EXCHANGES"],"content":["A user going by the name of \"ExploitDOT\" is allegedly selling 100,000 personal documents that were used to comply with the know-your-customer (KYC) regulations on cryptocurrency exchanges, as first reported by <a href=\"https:\/\/www.ccn.com\/hacked-customer-data-from-world-leading-cryptocurrency-exchanges-for-sale-on-the-dark-web\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">CCN<\/a>. He posted the sale on July 17, 2018 on a sub-community (DNMAds) of Dread, which is a&nbsp;hidden Reddit-like community that&nbsp;operates on&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Darknet\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">darknets<\/a> such as Tor and \"provides a platform for open community discussion without as much censorship and limitations.\"","ExploitDOT claims that he was a vendor on&nbsp;Tor Carding Forum (TCF), which was one of the earliest and largest darknet forums focused on the trade of stolen credit card details, identity theft, and currency counterfeiting. TCF closed in 2014 following a hack.&nbsp;ExploitDOT was also allegedly a vendor on&nbsp;AlphaBay, a darknet marketplace with over 400,000 users that police shut down after a <a href=\"https:\/\/www.wired.com\/story\/hansa-dutch-police-sting-operation\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">law enforcement action<\/a> in July 2017.","The documents were supposedly 'dumped' in the first half of 2018 when an unnamed third party KYC solution provider which was providing services to crypto exchanges and ICOs suffered a breach. At the time of writing, it's not immediately clear which KYC provider got hacked or even whether the hack actually took place.&nbsp;ExploitDOT claims that the documents include sensitive information and high quality photos with EXIF including geographic information \"for every country\" about users that KYC'd on Binance, Bitfinex, Poloniex and Bittrex.","When reached out for comment, Binance said:","\"We’re aware of this allegation and have investigated the photos in question, but there is no evidence that the leak is from Binance. We have even seen photoshopped versions of the photos. Security is our highest priority and we do our utmost to ensure data breaches do not happen on our platform.\"","It's possible that the KYC documents come from a phishing attack and are not actually a result of a&nbsp;breach of third party KYC solution provider.","The data dump, which is being sold in bulk, includes selfies, scans of identity documents and proof of address of each person. Following the report by CCN,&nbsp;ExploitDOT posted again on Dread and asked whether he should \"try to start a crowdfunding to delete all the hacked documents\" because \"if you ever sent a KYC, chances are there [are] also your documents in my dump.\" He wrote that he wants to crowdfund an amount that \"helps [him to] work on [his] legit business with [his] ideas that could change the world.\"","According to ExploitDOT, asking the affected exchanges to pay for the removal would not make sense because \"the exchanges are completely denying the documents were took from them, whereas there is clearly docs with 'Binance', 'Poloniex' and such written on the paper.\"","<em data-v-f87c67ca=\"\">This post has been updated with Binance's statement.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"EXIF","content":"ORGANIZATION"},{"type":"CCN","content":"ORGANIZATION"},{"type":"KYC","content":"ORGANIZATION"},{"type":"Poloniex","content":"PERSON"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"the first half of 2018","content":"DATE"},{"type":"July 17, 2018","content":"DATE"},{"type":"July 2017","content":"DATE"},{"type":"TCF","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Larry Cermak","The Block"]}