{"summary":"Obol Technologies, founded by former ConsenSys exec Collin Myers, has raised $6.15 million to build a crypto staking protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/120960\/obol-technologies-seed-funding-crypto-staking-protocol","publishDate":"2021-10-18T10:30:27","id":13262,"type":null,"title":"Obol Technologies raises $6.15 million to build a crypto staking protocol","category":["ETHEREUM"],"content":["Collin Myers, former head of global product strategy at ConsenSys, has been working on a new project since April of this year. He is building a \"trust-minimized\" crypto staking protocol at his startup Obol Technologies.","Sharing the news exclusively with The Block, Myers, founder and CEO of Obol, said the project has raised $6.15 million in a seed funding round. The round was led by Ethereal Ventures, a venture fund set up by ConsenSys founder Joseph Lubin, with participation from Coinbase Ventures, Acrylic Capital, and many others.","With fresh capital at hand, Obol plans to expand its team of three members to around 12. The project also aims to launch a testnet for staking on Ethereum 2.0 soon and support more public blockchains in the future, said Myers.","The Obol network is utilizing secret shared validator (SSV) technology, a primitive conceptualized in collaboration with researchers at the Ethereum Foundation. SSV helps split a validator key (effectively the password for operating a validator) between multiple operators. A validator is similar to a miner on a proof-of-work network, but one that stakes funds in order to process transactions on a proof-of-stake network.","\"SSV is kind of similar to the concept of a multi-signature wallet,\" said Myers. \"But now it's being applied to a validator and something that we're calling a multi-operator validator.\"","The Obol network will essentially allow staking with multiple validator operators. \"The longer term vision here is to prevent single operator failure,\" said Myers. \"So in the future, like if one individual staking provider or two or three providers go down, the Ethereum network should still continue to finalize and it should still continue to validate.\"","Myers said he believes that projects like Lido will eventually migrate their validator infrastructure into a protocol like Obol. Lido is currently the largest liquid staking provider on Ethereum. Last month, Lido provided a $100,000 LDO grant to Obol to continue researching and building the protocol.","The testnet of the Obol network is scheduled to launch early next year. Post a successful test, the project will decide a mainnet launch schedule, said Myers.","Lubin called Obol a \"very important\" project in a statement. He said, \"soon the majority of staking in public networks will be done in a multi-provider fashion, through the SSV construct.\"","\"SSV will be a core primitive of the information infrastructure of Web3, and Obol is uniquely configured to build the sector leading SSV solution, having been deep in the space for years,\" Lubin added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Collin Myers","content":"PERSON"},{"type":"Ethereal Ventures","content":"ORGANIZATION"},{"type":"Obol","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Lubin","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"ConsenSys","content":"ORGANIZATION"},{"type":"Acrylic Capital","content":"ORGANIZATION"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"$6.15 million","content":"MONEY"},{"type":"April of this year","content":"DATE"},{"type":"Myers","content":"PERSON"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Obol Technologies","content":"ORGANIZATION"}],"hashtag":["ETHEREUM","STAKING"],"authors":["Yogita Khatri","The Block"]}