{"summary":"Doodles CEO says the brand is “ready to grow up.”\nCompany has channeled “multiple million dollars” into an upcoming popup at Art Basel Miami Beach ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183902\/doodles-ceo-says-brand-is-ready-to-grow-up-aims-for-disney-level-brand-recognition","publishDate":"2022-11-08T09:51:22","id":1326,"type":null,"title":"Doodles CEO says brand is &#x27;ready to grow up,’ aims for Disney-level brand recognition","category":["Blockchain"],"content":["Ask Doodles new CEO Julian Holguin what he envisions for his upstart NFT brand, and he boasts of his company aspiring to challenge entertainment giants such as Disney, Amazon or Netflix.","Doodles started as a scrappy NFT brand, ideated by Evan Keast (aka Tulip) and Scott Martin (aka Burnt Toast), the founders of another well-established NFT collection – CryptoKitties, alongside&nbsp;creative Jordan Castro (aka Poopie) in 2021.","Now, Holguin wants to thrust the blue-chip NFT project into global consciousness. On the starting blocks, he already had an impressive roster of celebrity power. The pastel NFTs have ridden a wave of hype into the mainstream, with pop heartthrobs Justin Bieber and Liam Payne (formerly in One Direction) have joining the ranks of Doodlers in the last year. Pharrell Williams was brought on in September as its chief brand officer.","The executive left his position as president of Billboard <a href=\"https:\/\/www.theblock.co\/linked\/145559\/nft-project-doodles-appoints-former-billboard-executive-as-new-ceo\" data-v-f87c67ca=\"\">six months ago<\/a>; he has since spearheaded a <a href=\"https:\/\/www.theblock.co\/post\/169601\/doodles-announces-54-million-raise-plots-hiring-spree\" data-v-f87c67ca=\"\">$54 million fundraise<\/a> from the likes of Reddit founder Alexis Ohanian's VC firm Seven Seven Six, at valuation of more than $700 million. The wheels powering his vision are turning. In an interview with The Block, he said that the brand is entering its next epoch and is “ready to grow up,” he said.","“[The fundraise] was kind of kicking off the next phase of the journey,\" he said in the&nbsp;interview with The Block&nbsp;at the Web Summit conference in Lisbon. \"It’s been a really interesting few months.”","The next big challenge for Holguin will be pulling off the Doodles popup at Art Basel in Miami Beach in December, into which the brand has channeled “multiple million dollars.” The event will act as a test of Holguin’s vision, where original token holders are king.","“Token holders are going to have a very different experience than people that don't have a Doodle. Think things like priority access, free things at the actual event, just a very different experience than somebody that's walking in off the street,” he said.","This will also reflect future utility. He says that those holding one of the original 10,000 tokens will eventually be rewarded with priority access to live events and new branded drops, among other things.","“That funnel is still building right now, but that is the promise of what we're building for our original community, the people that buy into that experience,\" he said. \"And we want people that own that token to actually, like, pass it down from generation to generation, the same way that they would hold on to like season tickets to Manchester United, or Dallas Cowboys, as long as it has utility for you. You hold it. And then when it doesn't, there's a market for it because somebody else is going to want to buy into that community and that experience.”","Holguin adds that as the brands scale and evolve, the original tokens will have a kind of “ultimate utility.”","“The bigger the brand gets, the more valuable that really finite collection gets,\" he said. \"We don't believe that introducing more product into the space dilutes the original collection. What we look like as a brand five years from now, it's going to look nothing like the original collection.”","As for where the colorful cartoons will live in the world of crypto, Holguin says the future of the brand is multichain, with interoperability through a central hub.","“If we do our job well, it's not really going to matter what chain the specific products are on,” Holguin said. “We're continuing to build products on Ethereum, but we'll be scaling on other chains. There will be connection with the entire ecosystem no matter what chain we're on.”","Holguin compares different chains to different content shops, like Amazon or Netflix, which are distributed by a central player, like Target.","“The distribution channels for experiences, content and products are fragmented, but you're always going to be able to come back to one place to actually experience the full breadth of everything.”","“There will be announcements on that very soon,” he added."],"hashtag":["DOODLES"]}