{"summary":"Revolut is on the hunt for a new CEO for its business in the United States, a key market for the $33 billion fintech firm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/121208\/revolut-hunts-us-ceo-ronald-oliveira-leaves","publishDate":"2021-10-19T10:45:17","id":13269,"type":null,"title":"Revolut hunts for new US CEO with Ronald Oliveira set to leave","category":["FINTECH"],"content":["Revolut is on the hunt for a new CEO for its business in the United States, a key market for the $33 billion fintech firm.","Ronald Oliveira, who has led the startup in the U.S. since November 2019, is set to leave the company in the coming months, people familiar with the matter confirmed to The Block. He informed staff of his departure last night.","Over the past two years, Oliveira has overseen Revolut’s efforts to secure licenses to roll out the same features in the U.S. market that the app offers in Europe. That includes stock trading, for which Revolut <a href=\"https:\/\/www.cnbc.com\/2021\/09\/21\/revolut-the-33-billion-fintech-player-is-rolling-out-commission-free-stock-trading-in-the-us-.html\" data-v-f87c67ca=\"\">recently received<\/a> a broker-dealer license. He has also led Revolut’s campaign to secure a U.S. banking charter, which is ongoing.","Oliveira is a former president of Heritage Oaks Bank and more recently Avidbank. He spent more than 21 years at Union Bank of California earlier in his career.&nbsp;","Revolut’s launch in the U.S. in March 2020 coincided with the outbreak of the Covid-19 crisis. That unfortunate timing hampered its early marketing plans, according to Oliveira.","“We had a very quiet opening,” said Oliveira in a recent interview with The Block. “Now it’s about where are we going from here. What we’ve discovered is that we have the deepest and widest offering of any fintech in the United States today.”","After weathering the worst of the pandemic, Revolut has today <a href=\"https:\/\/www.theblockcrypto.com\/post\/120988\/revolut-slashes-crypto-trading-fees-in-bid-to-boost-us-business\" data-v-f87c67ca=\"\">slashed fees<\/a> across several of its most popular products in the hope of boosting sign-ups. &nbsp;","The fintech firm’s U.S. customers will now be able to trade up to $200,000 in crypto each month without getting charged commission fees on trades. Other changes allow users to withdraw a certain amount of money a month, send up to 10 international remittances a month, and set up five accounts for children free of charge.","Thus far, Europe’s leading neobanks have <a href=\"https:\/\/sifted.eu\/articles\/neobanks-fintech-europe-america\/\" data-v-f87c67ca=\"\">struggled to replicate their success<\/a> across the pond. In early October, Monzo <a href=\"https:\/\/www.cnbc.com\/2021\/10\/04\/monzo-withdraws-us-banking-license-application.html\" data-v-f87c67ca=\"\">withdrew its bank charter application<\/a> following discussions with regulators at the Office of the Comptroller of the Currency.","Revolut submitted its own&nbsp;<a href=\"https:\/\/techcrunch.com\/2021\/03\/22\/revolut-applies-for-bank-charter-in-the-us\/\" data-v-f87c67ca=\"\">draft application<\/a>&nbsp;for a bank charter to the Federal Deposit Insurance Corporation and the California Department of Financial Protection and Innovation in March of this year.","Oliveira was contacted for comment but did not respond by press time.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last night","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"California Department of Financial Protection and Innovation","content":"ORGANIZATION"},{"type":"November 2019","content":"DATE"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Heritage Oaks Bank","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"$33 billion","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"March 2020","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"Union Bank of California","content":"ORGANIZATION"},{"type":"March of this year","content":"DATE"},{"type":"October","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Ronald Oliveira","content":"PERSON"},{"type":"Oliveira","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}