{"summary":"The claimiants allege, among other things, that Genesis worked with its parent company, Digital Currency Group, to hide its insolvency.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/198792\/gemini-class-action-dcg-genesis","publishDate":"2023-01-03T03:04:55","id":13279,"type":null,"title":"Gemini users file class-action request against Genesis and DCG","category":["FINANCE FIRMS"],"content":["Three users of Crypto exchange Gemini's Earn program have reportedly filed a request for class-action arbitration against Genesis Global Capital and Digital Currency Group.","The request, which is not to be confused with a class-action lawsuit, comes weeks after the Winklevoss-founded exchange <a href=\"https:\/\/www.theblock.co\/post\/187534\/gemini-earn-unable-to-meet-customer-redemptions-as-genesis-unit-pauses-withdrawals\" data-v-f87c67ca=\"\">suspended<\/a> Earn redemptions — a direct consequence of Genesis freezing withdrawals.","The three claimants <a href=\"https:\/\/www.sgtlaw.com\/cases\/genesis-class-arb\" data-v-f87c67ca=\"\">allege<\/a> that the terms of Gemini Earn's master agreement were broken when Genesis purportedly failed to disclose — and later concealed — its insolvency in the summer.&nbsp;","They also allege that Genesis worked with its parent company, Digital Currency Group, to hide its insolvency by exchanging $2.3 billion in debt owed by collapsed crypto hedge fund Three Arrows Capital for a $1.1 billion promissory note due in a decade.","Furthermore, the claimants believe Genesis' master agreement creates the unregistered sale of securities.","Meanwhile, the&nbsp;Winklevoss brothers and their Gemini Trust Co. <a href=\"https:\/\/www.theblock.co\/post\/198213\/gemini-winklevoss-twins-facing-potential-class-action-from-investors\" data-v-f87c67ca=\"\">face<\/a> a potential class-action complaint on accusations&nbsp;of fraud and violations of the Exchange Act. \"Gemini marketed GIAs with repeated false and misleading statements, including that GIAs were a secure method of collecting interest,\" the complaint states about Gemini Earn.","Bringing the issue further into the public sphere is yesterday's open-letter accusation from Cameron Winklevoss that Digital Currency Group head Barry Silbert&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/198772\/geminis-winklevoss-dcgs-silbert-spar-over-frozen-funds-on-genesis\" data-v-f87c67ca=\"\">engaged<\/a> in \"bad faith stall tactics\" and comingled funds.","<em data-v-f87c67ca=\"\">Updated to add a link to Silver Golub &amp; Teitell LLP's announcement.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crypto exchange Gemini","content":"ORGANIZATION"},{"type":"$2.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Gemini Trust Co","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Barry Silbert","content":"PERSON"},{"type":"Cameron Winklevoss","content":"PERSON"},{"type":"Genesis Global Capital and Digital Currency Group","content":"ORGANIZATION"},{"type":"Genesis","content":"PERSON"},{"type":"$1.1 billion","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"Winklevoss","content":"PERSON"},{"type":"Silver Golub &amp; Teitell LLP","content":"ORGANIZATION"}],"hashtag":["GEMINI"],"authors":["Adam James","The Block"]}