{"summary":"Wall Street&#x27;s trading desks offer a glimmer of hope for the floundering cryptocurrency market.  Buying pressure has increased at many of the so-called","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/6742\/bitcoin-bulls-are-storming-wall-streets-crypto-trading-desks","publishDate":"2019-01-08T16:20:29","id":13272,"type":null,"title":"Bitcoin bulls are storming Wall Street&#x27;s crypto trading desks","category":["MARKETS"],"content":["Wall Street's trading desks offer a glimmer of hope for the floundering cryptocurrency market.&nbsp;","Buying pressure has increased at many of the so-called over-the-counter trading desks across the crypto world. The bullish sentiment mimics recent price action across the spot exchange market for crypto and is a sharp reversal from the environment at the end of 2018, numerous trading firms said.&nbsp;","One of the largest over-the-counter trading firms in crypto, Cumberland, tweeted Tuesday that the imbalance between buyers and sellers spiked by 60% over the last week. \"Historically, our OTC trading is relatively balanced between buyers and sellers,\" the firm said. \"Over the last week, our OTC buy\/sell ratio (by notional value) has increased approximately 60% towards counterparties buying.\" Again, Cumberland isn't alone.&nbsp;","Genesis Trading's CEO Michael Moro said his firm also saw more buy orders flood in relative to the end of 2018 when a sizable number of crypto investors were selling for tax purposes. \"I’ll echo Cumberland’s sentiments,\" he said in an email to <em data-v-f87c67ca=\"\">The Block<\/em>. \"Year-end saw quite a bit of selling for numerous reasons (e.g. tax loss selling and liquidation of crypto donations).\"","\"As the year turned, the selling pressure from such activities has subsided, and we have seen more buy-side interest pick up,\" he added.&nbsp;","OTC desks oversee billions of dollars worth of institutional crypto trading on a daily basis.&nbsp;And in some respects, OTC trading paints a better picture of where the crypto market is from an institutional perspective as that's where the largest trades are executed. As Monica Summerville, director of fintech research at capital markets consultancy Tabb Group noted in <a href=\"https:\/\/www.forbes.com\/sites\/astanley\/2018\/10\/23\/uncharted-bitcoin-otc-markets-gear-up-for-institutional-inflows\/#144002887bac\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Forbes<\/em><\/a>, \"The big deals have to go OTC. A lot of the exchanges limit the order size, so you have to break up your orders, and that’s just fatal.\" Summerville estimates that the OTC market is approximately two to three times larger than the trading activity across retail exchanges, including Kraken, Coinbase, and Binance.&nbsp;","Elsewhere, Galaxy Digital also says the tide has turned. \"Galaxy’s trading desk saw robust tax-driven trading activity into year-end from asset manager and treasury accounts,\" the firm said in a statement. \"In early January, much of the flow reversed to buy back previously sold assets.&nbsp;Additionally, we have seen increased buying from Asia and EMEA traders, while some active sellers took a pause to start the year.\" It's a similar story at New York-based Paxos.&nbsp;","The firm, which operates both an OTC desk and an exchange, reports bullish trading activity in January.&nbsp;","\"The nature of most of our trading flow so far this year has been buy tickets from emerging market traders,\" said Paul Ciavardini, head of OTC trading at Paxos.&nbsp;","As for Circle's OTC desk, the firm saw elevated sell pressure in December 2018 but that has \"come back down in Jan 2019,\" a spokesperson said in an emailed statement. \"Sells by notional were slightly higher in December, but have started to reverse in early January,\" the statement added. \"Separately, we are seeing greater activity in trading alts and stablecoins in the first weeks of 2019.\"","Still, there's always one outlier. DV Chain CEO Garrett See said that his firm hasn't seen a material difference between activity this month and the end of 2018.&nbsp;","\"In January, it’s a pretty even between buyers and sellers, with marginally more buys than sells, but not materially more,\" he said.","<em data-v-f87c67ca=\"\">This post has been update to include a statement from Circle and Paxos.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"EMEA","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"December 2018","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Tabb Group","content":"ORGANIZATION"},{"type":"Monica Summerville","content":"PERSON"},{"type":"Garrett See","content":"PERSON"},{"type":"Michael Moro","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Paul Ciavardini","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"the first weeks of 2019","content":"DATE"},{"type":"Forbes","content":"LOCATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"Jan 2019","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}