{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley . They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/8979\/recovering-a-1000-btc-investment-from-may-2011-may-be-impacted-by-courts-jurisdiction","publishDate":"2019-01-27T08:00:15","id":13276,"type":null,"title":"Recovering a $1,000 BTC investment from May 2011 may be impacted by court&#x27;s jurisdiction","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter:<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter:<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","[As always, Rosario summaries are “NMR” and Palley summaries are “SDP”]","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Christopher Smoak v. Bitcoin Market, LLC, et al. (W.D. Okla. 5:18-cv-01096-G, January 14, 2019)[NMR]<\/strong><\/em>","Contrary to popular opinion you cannot just willy nilly file a lawsuit for any reason whatsoever in whatever jurisdiction you like. There are in fact pretty strict rules surrounding what you can sue for, and where you can bring a lawsuit. If you do not follow those rules then your opponent in the lawsuit, or in some cases the court where you filed your silly lawsuit, will challenge your suit on procedural grounds and your suit will be thrown out.","As we’ve talked about previously in the CCM, federal courts are of limited jurisdiction. Meaning they can only hear cases over which they have subject matter jurisdiction, and personal jurisdiction. One way for a court to have subject matter jurisdiction over a case is what’s known as diversity jurisdiction, which means that the amount in controversy is at least $75,000 and no plaintiff shares a state of citizenship with any defendant. Great, wonderful, you’re not here for a civil procedure class. What does this have to do with Smoak? A lot at this moment.","Plaintiff Christopher Smoak got the bitcoin bug early. According to the alleged facts, on May 26, 2011 Smoak sent a $1,000 check to the defendant exchange. Brief sidebar, how many people can say that they sent a check to a crypto exchange to buy bitcoin, or any other cryptocurrency? The number can’t be that high. Returning to the case, Smoak allegedly did some trading on Bitcoin Market, and ended up with 75 bitcoins that he kept on Bitcoin Market’s site. From the filing, it appears that from June 2011 to March 2013 Smoak did nothing with his coins on Bitcoin Market’s site. That’s when the troubles began.","In March of 2013, Smoak was allegedly unable to login to his account at Bitcoin Market. On April 8, 2013, Smoak sends an email to support inquiring about his account. Then on November 9, 2013, Smoak sends an email to support at Bitcoin Market, and to defendant Dustin Dollar asking about his coins. He allegedly receives no responses. Fast forward a few years, and in November 7, 2018, Smoak files a lawsuit in federal court in Oklahoma alleging breach of contract. What does any of this have to do with diversity jurisdiction? Nothing, but at this stage of the lawsuit diversity jurisdiction is the only thing the judge in the case cares about.","On January 4, 2019, the judge in the case issued a one page order. As the order points out to the attorneys in the case “[t]he court has a duty to inquire into its own jurisdiction.” That’s not something an attorney wants to read from a judge in any lawsuit. The order explains that the plaintiff brought the lawsuit and alleged diversity jurisdiction as satisfying the requirement for subject matter jurisdiction. The court disagreed, and directed the plaintiffs to “file a second amended complaint no later than January 22, 2019, which identifies all members of Defendant Bitcoin Market, LLC and the citizenship of those members. Failure to comply may result in dismissal of this action without prejudice.”","The plaintiff’s second amended complaint filed on January 14, 2019, attempts to correct the deficiency by identifying the alleged two owners of Bitcoin Market, Dustin Dollar and Tiffany Dollar, as well as their citizenship being in Oklahoma. Assuming the judge finds the plaintiffs new amended complaint sufficient the case may eventually get to the question of what actually happened to Smoak’s bitcoin, but only if his attorneys follow the rules along the way.","<em data-v-f87c67ca=\"\">The Block is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part III of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2011","content":"DATE"},{"type":"April 8, 2013","content":"DATE"},{"type":"Smoak","content":"PERSON"},{"type":"November 9, 2013","content":"DATE"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Christopher Smoak","content":"PERSON"},{"type":"March 2013","content":"DATE"},{"type":"SDP","content":"ORGANIZATION"},{"type":"January 4, 2019","content":"DATE"},{"type":"May 26, 2011","content":"DATE"},{"type":"W.D. Okla.","content":"LOCATION"},{"type":"November 7, 2018","content":"DATE"},{"type":"Tiffany Dollar","content":"ORGANIZATION"},{"type":"March of 2013","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"January 22, 2019","content":"DATE"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"$1,000","content":"MONEY"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"January 14, 2019","content":"DATE"},{"type":"Palley","content":"PERSON"},{"type":"$75,000","content":"MONEY"},{"type":"Bitcoin Market","content":"ORGANIZATION"},{"type":"Dustin Dollar","content":"PERSON"},{"type":"Oklahoma","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}