{"summary":"Sam Bankman-Fried&#x27;s dad, mom, brother and his bunkmate in jail asked a judge to lower his sentencing amid concerns of physical danger. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279630\/sam-bankman-frieds-family-and-jail-bunkmate-appeal-for-leniency-in-sentencing-citing-safety-concerns","publishDate":"2024-02-28T11:54:19","id":13280,"type":null,"title":"Sam Bankman-Fried&#x27;s family and jail bunkmate appeal for leniency in sentencing, citing safety concerns","category":["EXCHANGES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The family and jail bunkmate of former FTX CEO Sam Bankman-Fried pleaded with a judge for more lenient sentencing of the disgraced ex-exchange boss amid concerns for physical safety and speaking to his good character and desire to help others.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">As his sentencing approaches next month, Bankman-Fried's lawyers asked the court on Tuesday to consider a <a href=\"https:\/\/www.theblock.co\/post\/279487\/sbf-lawyers-prison-sentence\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">sentence<\/span><\/a> in the range of 63 to 78 months. The former executive could face over 100 years in prison.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Twenty-nine letters of support were submitted on Tuesday in support of Bankman-Fried, including from his dad Joseph Bankman, his mom Barbara Fried, his brother Gabriel Bankman-Fried and Sam's jail bunkmate, former New York Police Officer Carmine Simpson.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I genuinely fear for Sam's life in the typical prison environment,\" Fried said in her letter. \"Sam's outward presentation, his inability to read or respond appropriately to many social cues, and his touching but naive belief in the power of acts and reason to resolve disputes, puts him in extreme danger.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried was found guilty in November by a jury in New York on all seven criminal counts of defrauding the customers, lenders and investors of FTX. FTX's new <a href=\"https:\/\/www.theblock.co\/post\/251658\/ftx-sues-sbf-parents\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">management<\/span><\/a> has since sued his parents, accusing them of exploiting their influence with the exchange in order to siphon off millions of dollars at the expense of creditors.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fried, a retired Stanford law professor, said the perception of her son could \"not be further from the truth.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It is easy to be cynical about others' professed motives to do good in the world,\" Fried said in her letter. \"It is even easier in Sam's case because the only thing the world knows about is his connection to what has been described relentlessly in the media over the past year as 'the fraud of the century,' and his portrayal as a cartoonish villain driven by greed.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fried said her son has lost 30 pounds since August, subsisting on junk food due to his decade-long commitment to veganism. Bankman-Fried lived on steak and fries until he was 18 and then after seeing the treatment of farm animals, he became a vegetarian and eventually vegan, she said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"His determination to remind vegan in prison, where the absence of vegan food has forced him to live on commissary junk food, reveals a lot about his strength of character and moral commitment,\" Fried said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Fried also goes into details about what Bankman-Fried did following the collapse of FTX and said he has been \"wracked with remorse.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It is, he has told me, the first thing he thinks about when he wakes up and the last thing he thinks about when he goes to sleep, and it occupies many moments in between,\" she said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried presented balance sheets and spreadsheets to bankruptcy officials, but according to his mother, the U.S. bankruptcy team immediately cut him off. John Ray lll, who took over the company after its collapse, told the public that FTX's financial situation was the <a href=\"https:\/\/www.theblock.co\/post\/194633\/ftx-execs-had-free-rein-over-exchange-alameda-ceo-ray-says\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">worst mess<\/span><\/a> he's seen in his career.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"When John Ray lamented publicly that the internal records of FTX were so bad they could not put together a list of customers, Sam located the relevant documents immediately and wrote to the Ch 11 team offering to show them how to access the preexisting list,\" Fried said. \"They never answered his emails.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">His mother also spoke about tutoring sessions Bankman-Fried is running in jail and has helped two inmates who are facing life in prison.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Only thirty-two years old and with his whole future in front of him, Sam now faces the prospect of spending much of the rest of his life in prison. His father and I face the very real possibility that we will not live long enough to see him freed,\" she said. \"There are no words for the grief we feel.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Carmine Simpson, who said his bunk and locker are next to Bankman-Fried's, said the former executive doesn't belong there.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"When he first told me that the main reason he worked so hard at becoming a successful and wealthy person was to donate all his money away to noble causes and those in need, quite frankly, I thought he was blowing smoke up my ass,\" Simpson said. \"Though very quickly, I came to the conclusion that Sam is the most self-less person that I have ever had the privilege to meet.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Simpson also spoke to Bankman-Fried's commitment to veganism and said he is eating \"undercooked rice, a scoop of disgusting-looking beans and week-old lettuce.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Simpson voiced concern as well for Bankman-Fried's safety in prison and said he has been targeted for hazing, harassment and assault more so than the average inmate.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Sam's case has also lead to extensive media coverage which has lead to and will lead to even more negative results,\" Simpson said. \"Sam's estimated fortune is higher than any inmate can count to which lead to multiple extortion attempts.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried's father, also a Stanford law professor, likewise spoke to his son's character and said he was never looking for attention or fame.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"For anyone who knows Sam, the popular portrayal of him as a high-rolling, celebrity-seeking, CEO driven by greed is simply bizarre,\" Joseph Bankman said in his letter.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman also highlighted concerns for his son's safety.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"A draconian sentence would likely lead to a placement in a high (or at best medium) security prison,\" Bankman said. \"Such a setting would put Sam in an environment where his responses to social cues will sometimes be seen as odd, inappropriate and disrespectful; when that happens, he will be in significant physical danger. Nothing he has done can justify putting him at that risk.\"<\/span>","Gabe Bankman-Fried, Sam's younger brother and a lobbyist, penned a letter to the judge, saying that Sam's life \"would be wasted\" in prison. He also highlighted his brother's lack of interest in material possessions.","<span class=\"s1\" data-v-f87c67ca=\"\">&nbsp;\"When he visited me in D.C., he would sleep on my couch, rather than a 5-star hotel. We would eat at Chipotle. The trappings of fame and wealth were something we joked about,\" his brother said.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gabriel Bankman","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"New York Police","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Simpson","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Gabe Bankman","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Carmine Simpson","content":"PERSON"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Barbara Fried","content":"PERSON"},{"type":"John Ray lll","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Stanford","content":"ORGANIZATION"},{"type":"John Ray","content":"PERSON"},{"type":"D.C.","content":"LOCATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Sarah Wynn","The Block"]}