{"summary":"Pepe coin fans have been tweeting furiously for several hours in an attempt to get people to close their Coinbase accounts. Ironically (or perhaps not) Coinbase’s centralized exchange does not actually support trading in pepe.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230386\/coinbase-pepe-frog-hate-symbol-deletecoinbase","publishDate":"2023-05-11T10:49:41","id":13298,"type":null,"title":"Coinbase&#x27;s Pepe &#x27;hate symbol&#x27; email sends #Deletecoinbase trending","category":["EXCHANGES"],"content":["The hashtag #DELETECOINBASE trended on Twitter for a second day after <a href=\"https:\/\/www.coinbase.com\/bytes\/archive\/behind-the-memecoin-frenzy\" data-v-f87c67ca=\"\">Coinbase published a newsletter<\/a> for customers flagging that some groups believe Pepe the Frog has become a “hate symbol\" for the alt-right.","Pepe coin fans have been tweeting prodigiously for several hours in an attempt to get people to close their Coinbase accounts and move to other platforms to trade the memecoin.","The phrase was No.3 in the UK and No.2 in the U.S. on Twitter’s trending lists, at the time of writing.","Coinbase’s centralized exchange does not actually support trading in pepe. <a href=\"https:\/\/www.coinbase.com\/price\/pepe\" data-v-f87c67ca=\"\">Coinbase users searching for the token<\/a> receive this message: “Pepe isn’t supported on Coinbase. You can go to Coinbase Wallet to buy it on a decentralized exchange.”","The <a href=\"https:\/\/twitter.com\/3orovik\/status\/1656453389192921088\" data-v-f87c67ca=\"\">#DELETECOINBASE movement was given initial momentum by Borovik.eth<\/a>, a pseudonymous Twitter user with 94,000 followers. He tweeted pro-Pepe memes all night.","","","The Coinbase newsletter was titled, “<a href=\"https:\/\/www.coinbase.com\/bytes\/archive\/behind-the-memecoin-frenzy\" data-v-f87c67ca=\"\">Behind the memecoin frenzy<\/a>,” and contained a section labelled “What you should know about pepe, the memecoin of the moment.”","It read:","“Pepe, which was issued around three weeks ago with a comically huge supply of 420 trillion tokens, has been leading the memecoin activity. The token is based on the Pepe the Frog meme, which first surfaced on the internet nearly 20 years ago as a comic-strip character. Over time it has been co-opted as a hate symbol by alt-right groups, according to the Anti-Defamation League.”","A Coinbase representative told The Block that readers should pay attention to the disclaimer in the newsletter, which reads, \"The views and opinions expressed herein are those of the author and do not necessarily reflect the views of Coinbase or its employees and summarizes information and articles with respect to cryptocurrencies or related topics that the author believes may be of interest.\"","Meanwhile, the price of <a href=\"https:\/\/www.theblock.co\/post\/229726\/pepe-coin-price-slide-whale-loss\" data-v-f87c67ca=\"\">pepe has continued to sink<\/a> from its Friday peak. It stood at $0.0000016 this morning, down about 20% over the previous 24 hours, according to CoinMarketCap.","Pepe price","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Anti-Defamation League","content":"ORGANIZATION"},{"type":"$0.0000016","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Pepe","content":"PERSON"},{"type":"Coinbase Wallet","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Frog","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Jim Edwards","The Block"]}