{"summary":"Stride will initially offer liquid staking services, with Persistence and Quicksilver adding further liquid staking support for dYdX Chain. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274911\/dydx-chain-adds-support-for-liquid-staking","publishDate":"2024-01-29T14:01:53","id":13296,"type":null,"title":"dYdX Chain adds liquid staking support with latest upgrade","category":["CRYPTO ECOSYSTEMS"],"content":["Cosmos-based dYdX Chain now supports liquid staking on the network.","dYdX Chain was <a href=\"https:\/\/twitter.com\/dydx_ops_subdao\/status\/1752031880822550699?s=61&amp;t=lcXb9OlXxXzLP4L3UDANVg\" data-v-f87c67ca=\"\">upgraded<\/a> to its v3.0 version today. The upgrade introduced interchain accounts, enabling support for liquid staking protocols to join the Cosmos-based network.","This move allows users to continue to stake and secure the <a href=\"https:\/\/www.theblock.co\/post\/264937\/dydx-starts-distributing-trading-rewards\" data-v-f87c67ca=\"\">dYdX Chain<\/a>, while converting staked <a href=\"https:\/\/www.theblock.co\/price\/248448\/dydx-dydx-usd\" data-v-f87c67ca=\"\">DYDX<\/a> into a liquid asset that can be traded or utilized in DeFi applications","Liquid staking protocols are competing to onboard the dYdX stakers to liquid staking.","Cosmos-based <a href=\"https:\/\/www.theblock.co\/post\/240509\/liquid-staking-network-stride-adopts-cosmos-hubs-interchain-security\" data-v-f87c67ca=\"\">Stride<\/a> plans to open up dYdX’s liquid staking today. Two other liquid staking providers, Persistence and Quicksilver, also aim to offer the service in the near future. “We’re thrilled to be working closely with dYdX to unlock the full value of that infrastructure by bringing stDYDX to DeFi protocols everywhere,” said Stride co-founder Vishal Talashi in a statement.","“The Liquid Staking competition is driving innovation in the DYDX staking ecosystem, which is ultimately good for the entire community,” Charles d’Haussy, CEO of dYdX Foundation, said.","dYdX Chain is a Cosmos appchain that facilitates the trading of crypto token derivatives and is the largest platform by volume in the decentralized perpetuals niche.","The network is secured by validators to whom stakers can delegate their dYdX tokens. All protocol fees are redistributed to dYdX stakers and validators in USDC stablecoin.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Charles d’Haussy","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Cosmos","content":"LOCATION"},{"type":"Stride","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vishal Talashi","content":"PERSON"},{"type":"dYdX Foundation","content":"ORGANIZATION"}],"hashtag":["COSMOS","STAKING"],"authors":["MK Manoylov","The Block"]}