{"summary":"Defining new crypto market regulation in Europe is a delicate balance, according to Peter Kerstens, European Commission Advisor, presenting at the recent Shining a Light on Digital Asset Markets Conference 2021, hosted by Eventus and the Association for Digital Asset Markets (ADAM).","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112067\/behind-the-scenes-of-eu-crypto-regulation","publishDate":"2021-07-21T09:26:34","id":13290,"type":null,"title":"Behind the Scenes of EU Crypto Regulation","category":["SPONSORED"],"content":["<em data-v-f87c67ca=\"\">By Joseph Schifano, Global Head of Regulatory Affairs at Eventus<\/em>","Defining new crypto market regulation in Europe is a delicate balance, according to Peter Kerstens, European Commission Advisor, presenting at the recent <a href=\"https:\/\/www.eventussystems.com\/shining-a-light-on-digital-asset-markets-2021-highlights-from-our-virtual-conference\/\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Shining a Light on Digital Asset Markets Conference 2021<\/em><\/a>, hosted by Eventus and the Association for Digital Asset Markets (ADAM).","Speaking alongside his US peers, Kerstens discussed the European Commission’s particular challenges. EU regulation for crypto, he explained, must avoid regulatory divergence. The development of a common, high-level framework for digital assets must address the broad spectrum of attitudes that exist within the member states, with their own regulatory authorities. These range from the more conservative, prudentially led nations to the liberal, pro-innovation members. “We wanted to preserve a pan-European EU-wide market for crypto assets,” he asserts.","<strong data-v-f87c67ca=\"\">From aversion to understanding – the EU regulators’ crypto journey<\/strong>","The EU has seen a trend, elaborates Kerstens, from an aversion to crypto assets to more of an interest in them. However, there must be a balance between anticipation of their huge potential and a better understanding of the risks that exist in these new markets. Digital assets must be embraced, though, in order that investors aren’t forced to go offshore. By compelling trading to remain onshore, we foster participation in regulatory influence and development.","For crypto assets, this regulatory journey started with “a very strong request by market participants for legal clarity.” One corner of a triangle, Kersten explains, this first, legal foundation must be balanced against two other important factors. The enablement of responsible innovation is one – allowing law-abiding participants to bring new products and services to market - offset against the other, the avoidance of obvious market failures, at an issuance level and within fraudulent schemes.","Eventus, a leading trade surveillance and market risk firm, is at the forefront of meeting that third challenge. By understanding and addressing the complexities of consuming hundreds of different data feeds and interpreting the regulations around market surveillance with the flexibility to adapt by region, market model and regulatory change, the company’s Validus platform is ready for the influx of unique requirements as this new landscape emerges.","Kersten explains that because it’s early, regulation will not solve all issues up-front. Flexibility is key here, and the question “too early, too late, when to regulate?” is resolved by letting development go ahead and allowing market demand to define the pace. Maintaining a balance seems more important than speed as he explains it - avoiding one corner of the triangle while stressing the others.","Reassuringly though, the clear message from Kerstens is that the Commission is engaged, capable and broad-minded. Digital asset markets have exciting potential, but the road ahead has many challenges. The pace is fast-moving, and the nascent nature of this new market’s underlying infrastructure – its lack of standards and the transient nature of its liquidity – means the journey will be far from straightforward. So those serving this market had better be prepared for some twists and turns along the way.","To watch a replay of all the sessions from the conference, click <a href=\"https:\/\/www.eventussystems.com\/rewind\/\" data-v-f87c67ca=\"\">HERE<\/a>.<a href=\"https:\/\/www.linkedin.com\/in\/joe-schifano\/\" data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/em><\/strong><\/a>","<a href=\"https:\/\/www.linkedin.com\/in\/joe-schifano\/\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Joseph Schifano<\/em><\/a><strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">&nbsp;<\/em><\/strong><em data-v-f87c67ca=\"\">is Global Head of Regulatory Affairs at <\/em><a href=\"http:\/\/eventussystems.com\/\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Eventus<\/em><\/a><em data-v-f87c67ca=\"\">. Mr. Schifano is an attorney with more than 20 years of experience in market surveillance matters, most recently as Deputy General Counsel and Global Chief Compliance Officer (CCO) of Tower Research Capital in&nbsp;New York, along with senior regulatory roles at two global banks and the New York Stock Exchange (NYSE).<\/em>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kerstens","content":"PERSON"},{"type":"Commission","content":"ORGANIZATION"},{"type":"European Commission Advisor","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Global Head of Regulatory Affairs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"Peter Kerstens","content":"PERSON"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Kersten","content":"PERSON"},{"type":"Eventus","content":"PERSON"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Schifano","content":"PERSON"},{"type":"Eventus","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"the Association for Digital Asset Markets (ADAM","content":"ORGANIZATION"},{"type":"Tower Research Capital","content":"ORGANIZATION"},{"type":"Joseph Schifano","content":"PERSON"}],"hashtag":[],"authors":["Sponsored","The Block"]}