{"summary":"Much was made of Andre Cronje’s supposed return to Fantom at the end of last year, but he says it was all just optics.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241940\/andre-cronje-says-he-never-really-left-the-fantom-foundation","publishDate":"2023-07-28T09:53:27","id":13304,"type":null,"title":"Andre Cronje says he never really left the Fantom Foundation","category":["CRYPTO ECOSYSTEMS"],"content":["In early November, signs that controversial crypto entrepreneur Andre Cronje was returning to the Fantom project after a long hiatus pushed the token’s price up 20%.","Yet he claims that he never really left.","“My distance from Fantom was only from a public perspective,” Cronje told The Block on The Scoop <a href=\"https:\/\/www.theblock.co\/podcasts\" data-v-f87c67ca=\"\">podcast<\/a>. “I was receiving so much bad press at that time that I thought it would negatively impact Fantom.”","Cronje said that he has been working at the Fantom Foundation since 2019 as pretty much his full time occupation. “You can chat to anyone in the organization, they all know I was still there, I was still working. I was still doing my day to day.”","For all appearances, Cronje left the Fantom Foundation in March 2022 and had supposedly quit contributing to the DeFi space and crypto in general. This caused a drop in the price of FTM at the time.&nbsp;","While no reason was specifically given, Cronje has come under fire multiple times in the past due to his tendency to “test in production” — that is, to put unaudited code live while he was building it. A few times, crypto observers aped into his contracts on their own volition, before a bug or other issue caused them to lose their funds. (Following the publication of this article, Cronje said via email that the code was actually audited but that he didn't disclose this. He said, “the code I shared was audited, I just did not publicly disclose those audits as I felt doing so would give members of the community a false sense of security when testing these new contracts.\")","“I just thought it would do more reputational damage than harm,” he said about distancing himself from the project.&nbsp;","Cronje added that it was Fantom Foundation CEO Michael Kong who finally convinced him to make a public return. “And I finally caved after a few months of attrition and then just, you know, decided to admit. But that wasn't actually a leave and back. It was just a public distancing, which at the time I thought was better for the project.”","<em data-v-f87c67ca=\"\">Added follow up comment from Cronje.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"Michael Kong","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"early November","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"FTM","content":"ORGANIZATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"Cronje","content":"PERSON"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}