{"summary":"A bankruptcy judge has approved Voyager&#x27;s plan to sell its assets to FTX, setting the stage for an upcoming creditor vote.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179080\/voyager-urges-creditors-to-vote-yes-on-court-approved-ftx-sale","publishDate":"2022-10-21T15:55:25","id":13313,"type":null,"title":"Voyager urges creditors to vote yes on court-approved FTX sale","category":["COMPANIES"],"content":["A bankruptcy judge in the Southern District of New York has approved Voyager's plan to sell its assets to FTX, setting the stage for an upcoming creditor vote.","Judge Michael Wiles signed the asset purchase agreement at the close of yesterday, marking another step closer to closing the $1.4 billion sale of Voyager's assets to FTX. The embattled lender <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">entered the Chapter 11 process<\/a> in July after halting withdrawals. Customers and creditors have since been waiting to recoup their funds.","During the auction process, Voyager <a href=\"https:\/\/www.theblock.co\/post\/172946\/ftx-wins-auction-for-bankrupt-crypto-lender-voyager\" data-v-f87c67ca=\"\">accepted a bid from FTX<\/a> that would allow Voyager users to access what remains of their assets on the FTX platform with newly created FTX accounts.","At a Wednesday hearing, counsel told the court they expect creditors to recoup 72% of their assets through the deal.","The final purchase price of Voyager's crypto is still to be determined. The plan will use a 20-day historical average for the price, a window that will be set at a future point in time. How much customers receive will be dependent on this price mechanism, but they will receive their sum through a mix of in-kind crypto, USDC and fiat depending on their claim.&nbsp;","Only those who elect to transition to the FTX platform will be eligible to receive their payout in crypto. Those who do not make the move will receive cash from the Voyager estate.&nbsp;","However, FTX's platform does not support the VGX token. As of now, FTX has offered a floor price of $10 million to purchase all VGX. The firm said in a blog post that it's working to find \"a higher and better solution,\" but will accept the $10 million offer if it isn't successful.&nbsp;","The court approval of the deal is one step closer to closing. Next comes a creditor vote, and Voyager urged customers to vote in favor of the plan before the deadline of Nov. 29 in its post.","\"Because we believe the Plan, including the sale to FTX US, maximizes recoveries to Voyager’s creditors, we urge all customers and creditors to vote in favor of the Plan,\" the company said.","Creditors will receive information on how to cast their votes through a solicitation packet sent by claims agent Stretto. That packet may include an additional letter from the creditor committee informing customers about releases in the agreement protecting executives from future legal action.","The bankruptcy court could confirm the plan as early as mid-December following the vote. Then, the closing process and transition of customers to the FTX platform to receive their assets would come after.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nov. 29","content":"DATE"},{"type":"$1.4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"72%","content":"PERCENT"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"US","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Michael Wiles","content":"PERSON"}],"hashtag":["FTX"],"authors":["Aislinn Keely","The Block"]}