{"summary":"Gemini said it is working with Genesis and Digital Currency Group to find a solution for users unable to redeem from the crypto exchange&#x27;s Earn product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188982\/gemini-is-working-with-genesis-and-dcg-on-solution-for-earn-redemptions","publishDate":"2022-11-22T03:13:27","id":13311,"type":null,"title":"Gemini is working with Genesis and DCG on solution for Earn redemptions","category":["EXCHANGES"],"content":["Gemini said it is working with Genesis and Digital Currency Group in an effort to find a solution that will allow users to redeem their funds from the crypto exchange's Earn product.","Gemini <a href=\"https:\/\/twitter.com\/Gemini\/status\/1594866657159151619\" data-v-f87c67ca=\"\">provided<\/a> the update in a thread on Twitter, writing: \"This remains our highest priority and we understand Genesis and DCG remain committed to exploring every possible option to fulfill their obligations to Earn users.\"","The New York-based crypto exchange <a href=\"https:\/\/www.theblock.co\/post\/187534\/gemini-earn-unable-to-meet-customer-redemptions-as-genesis-unit-pauses-withdrawals\" data-v-f87c67ca=\"\">announced<\/a> on Nov. 16 that it would not be able to meet customer redemptions in the service-level agreement's time frame of five days — which followed news that Genesis, its lending partner, paused withdrawals.","Genesis has since indicated that it is seeking a $1 billion emergency cash loan. Binance — the leading crypto exchange by 24-hour volume — <a href=\"https:\/\/www.theblock.co\/post\/188956\/binance-will-not-invest-in-crypto-lender-genesis-wsj\" data-v-f87c67ca=\"\">turned down<\/a> the opportunity to invest in the embattled crypto lender.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"DCG","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Nov. 16","content":"DATE"}],"hashtag":["GEMINI","INVESTMENT FIRMS"],"authors":["Adam James","The Block"]}