{"summary":"Centrifuge’s new platform aims to connect on-chain and off-chain investment portfolio data for fund managers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283315\/centrifuge-on-chain-fund-management-platform","publishDate":"2024-03-19T07:00:02","id":13319,"type":null,"title":"Centrifuge launches on-chain fund management platform for efficient operation of investments","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Centrifuge announced today that it has launched its on-chain fund management platform, which will import credit funds on public blockchains to provide a more frictionless way of fund management.<\/span>","<span data-v-f87c67ca=\"\">The press release said the new platform will gather a fund’s on-chain and off-chain investment positions, transactions and operations data in a secure environment for fund managers.<\/span>","<span data-v-f87c67ca=\"\">“With Centrifuge, managers now have a unified on-chain product that connects all service providers and data into a central control panel to automate reporting, streamline fund operations, and improve transparency for investors,” the press release said.<\/span>","<span data-v-f87c67ca=\"\">Centrifuge said in the release that Web3 asset manager Anemoy has already adopted the new platform, integrated with Trident Trust to manage their BVI professional fund built on Centrifuge.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“[The new platform] increases transparency while streamlining typically burdensome reporting and reconciliation processes,” said David Mungall, Trident Trust’s head of fund administration.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"BVI","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"David Mungall","content":"PERSON"},{"type":"Trident Trust","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Anemoy","content":"PERSON"}],"hashtag":["ASSET MANAGERS","WEALTH MANAGERS"],"authors":["Danny Park","The Block"]}