{"summary":"John Reed Stark claims that crypto trading platforms are facing a regulatory seige, which has only just begun.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234081\/john-reed-stark-get-out-crypto-now","publishDate":"2023-06-11T07:35:00","id":13327,"type":null,"title":"&#x27;Get out of crypto platforms now,&#x27; former SEC chief warns","category":["COMPANIES"],"content":["John Reed Stark, a nineteen-year veteran former attorney in the United States Security and Exchange Commission's Enforcement Division and former SEC Office of Internet Enforcement chief, has warned to \"get out of crypto platforms now.\"","The SEC <a href=\"https:\/\/www.theblock.co\/post\/233146\/us-sec-sues-binance-ceo-zhao-for-breaking-securities-rules\" data-v-f87c67ca=\"\">sued<\/a> Binance Holdings Ltd. and CEO Changpeng Zhao on June 5. The following day, the regulator <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">sued<\/a> crypto exchange Coinbase for allegedly violating securities laws. On this basis, Stark issued his warning.","\"My take is that the SEC is spot-on with their crypto-related enforcement efforts,\" Stark <a href=\"https:\/\/twitter.com\/johnreedstark\/status\/1666780985189433347?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" data-v-f87c67ca=\"\">tweeted<\/a>, claiming: \"No matter what the carnival barkers promise, it is axiomatic that crypto trading platforms are high-risk, perilous and inherently unsafe.\"","\"Crypto trading platforms are under a U.S. regulatory\/law enforcement siege which has only just begun,\" he added.","Stark explained that his belief stems from a lack of registration with the SEC, which directly correlates to a lack of operational supervision and a severe lack in customer protection.","\"There is not just a gap in customer protections, but a chasm,\" he claimed, citing that crypto exchanges have a lack of record-keeping as well as requirements for pricing or order flow. Plus, he claimed they have no inherent reason to obey U.S. statues and rules against market manipulation, insider trading, trading against customers and other negative behaviors.","Stark also argued that there are no mandated cybersecurity or privacy protection requirements, no internal compliance obligations, no mandated requirements for dealing with customer complaints and no minimum financial standards for operation.","Even before the SEC sued Binance and Coinbase, crypto trading volumes had declined sharply on centralized exchanges — indicating decreasing interest in trading on centralized entities.","According to The Block Research's Legitimate Volume Index, May saw centralized exchanges <a href=\"https:\/\/www.theblock.co\/post\/232989\/crypto-exchanges-post-307-billion-in-volume-for-may\" data-v-f87c67ca=\"\">post<\/a> $307.4 billion in volume — a decline of 23.2% from April and the lowest monthly volume since November 2020.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/cryptocurrency-exchange-volume-monthly\/embed\" title=\"Cryptocurrency Monthly Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Decentralized exchange volume, meanwhile, saw a modest increase from $60.52 billion in April to $67.51 billion last month.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"$60.52 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$67.51 billion","content":"MONEY"},{"type":"Enforcement Division","content":"ORGANIZATION"},{"type":"John Reed Stark","content":"PERSON"},{"type":"United States Security and Exchange Commission","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"June 5","content":"DATE"},{"type":"$307.4 billion","content":"MONEY"},{"type":"SEC Office of Internet Enforcement","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"23.2%","content":"PERCENT"},{"type":"Binance Holdings Ltd.","content":"ORGANIZATION"},{"type":"November 2020","content":"DATE"}],"hashtag":["BINANCE","COINBASE","SEC"],"authors":["Adam James","The Block"]}