{"summary":"Gate Group plans to launch a Visa crypto debit card through its Lithuana-based company, Gate Global UAB — with a waitlist open for EEA users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218345\/gate-io-launching-visa-crypto-debit-card","publishDate":"2023-03-09T05:09:29","id":13329,"type":null,"title":"Gate.io launching Visa crypto debit card in Europe","category":["COMPANIES"],"content":["Gate Group, the parent company behind crypto exchange Gate.io, plans to launch a Gate Visa crypto debit card through its Lithuana-based company, Gate Global UAB.","A waitlist and registration process is open for users in the European Economic Area, according to a statement from Gate.&nbsp;","Visa's head of crypto, Cuy Sheffield, <a href=\"https:\/\/www.prnewswire.com\/news-releases\/gate-group-announces-plans-to-launch-new-visa-debit-card-in-europe-301767769.html\" data-v-f87c67ca=\"\">noted<\/a> that the payments giant \"wants to serve as the bridge between the crypto ecosystem and our global network of merchants and financial institutions.\"","\"With programs like the Gate Visa debit card, Gate Group debit cardholders are enabled with a seamless way to convert and use their digital assets to pay for goods and services, anywhere Visa is accepted,\" he added.","Gate is by no means the first crypto company to offer a crypto debit card. Crypto.com has had a similar offering for years and Ledger recently joined forces with Baanx to offer their own CL card.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gate Group","content":"ORGANIZATION"},{"type":"European Economic Area","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Lithuana","content":"LOCATION"},{"type":"Gate Global UAB","content":"ORGANIZATION"},{"type":"Cuy Sheffield","content":"LOCATION"}],"hashtag":["PAYMENTS"],"authors":["Adam James","The Block"]}