{"summary":"The WLD token&#x27;s market cap surpassed $1 billion amid OpenAI&#x27;s launch of Sora, new signups and upcoming announcements.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278605\/worldcoin-surges-40-in-24-hours-leadership-hints-major-announcements-coming","publishDate":"2024-02-22T11:44:35","id":13326,"type":null,"title":"Worldcoin surges 40% in 24 hours, leadership hints &quot;major announcements&quot; coming","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Worldcoin's wild ride continued unabated on Thursday, with the project's <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248504\/worldcoin-wld-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/worldcoin.jpeg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">WLD<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.020%\n    <\/span><\/a> <!----><\/span> token surging approximately 40%, marking a price increase of over 300% in the past month.<\/span>","Trading at its highest price ever, WLD changed hands at $8.86 as of 11:13 a.m. ET on Thursday. That has helped the token achieve another milestone; a total market cap of $1 billion based on circulating supply.&nbsp;","WLD's sharp increase in price began just days ago, with many attributing the surge to the Feb. 16 debut of Sora, an AI model capable of transforming text into video. Despite no direct link to Worldcoin's mission of verifying human identity through eyeball-scanning orbs, Sora is backed by Tools of Humanity, a company co-founded by Sam Altman. Altman, who is also the CEO of OpenAI—the creator of Sora and the renowned AI chatbot ChatGPT—plays a pivotal role in both projects. Therefore, at least some traders are treating WLD as a stand-in for OpenAI, which is not available on the public market.","While WLD's price rises, it's hard to know if the increase is being driven by euphoria or fundamentals. In a recent interview, Tools for Humanity's head of product, engineering &amp; design, Tiago Sada, was tightlipped on what the project has brewing, but he did suggest some significant news is coming down the pike.","\"We're super excited about a couple of other major announcements that we have coming up,\" Sada told The Block several days ago when asked about the future iteration of the orb they have mentioned. \"But, I'll leave you in suspense for now.\"","Aside from potential forthcoming announcements, Worldcoin recently succeeded in growing its total signup numbers to more than 3.5 million. At the <a href=\"https:\/\/www.theblock.co\/post\/265939\/looking-back-at-eyeball-scanner-worldcoins-tumultuous-year\" data-v-f87c67ca=\"\">beginning of this year<\/a> the project has about 2.5 million signups.","Worldcoin allocates tokens to people willing to have their irises scanned by the project's orbs in order to prove their \"personhood\" (or more simply put, that they are actually human). Worldcoin created more than 600,000 new accounts during the past seven days alone, according to its website.","\"The growing interest in Wold App and World ID are incredible,\" the project <a href=\"https:\/\/twitter.com\/tfh_technology\/status\/1760632818743320645\" data-v-f87c67ca=\"\">posted to X<\/a> on Thursday. \"Use World App to locate and book an appointment to verify your World ID in Spain and Portugal. New locations coming soon.\"","<span data-v-f87c67ca=\"\">WLD's price. Image: The Block Price Page.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"+0.020%","content":"PERCENT"},{"type":"$8.86","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"Portugal","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Feb. 16","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"300%","content":"PERCENT"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"Tiago Sada","content":"PERSON"},{"type":"40%","content":"PERCENT"},{"type":"Wold App","content":"LOCATION"},{"type":"11:13 a.m.","content":"TIME"},{"type":"Altman","content":"PERSON"},{"type":"Sora","content":"PERSON"},{"type":"Sada","content":"PERSON"},{"type":"Spain","content":"LOCATION"},{"type":"Tools of Humanity","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}