{"summary":"U.S. regulators will be weighing whether to adopt new rules that could encompass cryptocurrency in the new year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268830\/regulatory-outlook-what-will-the-sec-and-cftc-be-focused-on-in-2024","publishDate":"2023-12-26T16:01:16","id":13321,"type":null,"title":"Regulatory outlook: What will the SEC and CFTC be focused on in 2024?","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">U.S. regulators will be weighing whether to adopt new rules that could encompass cryptocurrency as experts say more enforcement actions are on the horizon.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">It's been a busy year for both the Commodity Futures Trading Commission and the Securities and Exchange Commission from charges against some of the biggest crypto exchanges including Binance, Kraken and Coinbase to contemplating rules that could rein in the industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC hasn't proposed crypto-centric rules, but it is weighing two rules that could see adoption in the new year. Meanwhile, the CFTC just <a href=\"https:\/\/www.theblock.co\/post\/267532\/cftc-votes-to-propose-rule-that-would-bolster-customer-protections-in-wake-of-ftx-collapse\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">voted<\/span><\/a> in December to propose a rule that would bolster customer protections in the wake of the collapse of crypto exchange FTX.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Block spoke with experts to break down what rules these agencies will likely hone in on in 2024.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SEC Chair Gary Gensler has been consistent in his messaging that most cryptocurrencies are securities, while also calling on crypto exchanges to come in and register with the agency, despite industry pushback.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"On crypto broadly, a lot of general crypto does seem to follow in the gambit of the securities laws from the SEC's perspective, so I don't think there are a lot of new regulations coming from the SEC on that front,\" said Tyler Gellasch, CEO of the investor-focused Healthy Markets Association. \"I just think they'll keep doing what they do, which is probably bring a lot of enforcement cases.\"&nbsp;&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC could adopt two rules that it recently proposed — one that puts requirements on custodians and another that broadens the definition of an exchange to loop in decentralized exchanges.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Both of those, I expect, in some form will be finalized. We will see how much they affect crypto as they're finalized,\" Gellasch said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Upcoming elections as well make it particularly important for SEC Chair Gensler to finalize those rules, said Linda J<\/span><span class=\"s3\" data-v-f87c67ca=\"\">eng, a Web3 advisor for the Crypto Council for Innovation. Jeng also worked previously at the Federal Reserve Board of Governors, the SEC and the Treasury Department.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC voted in February to <a href=\"https:\/\/www.theblock.co\/post\/211786\/sec-to-vote-on-rule-that-would-tighten-crypto-custody-requirements\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">propose<\/span><\/a> a rule that would require registered investment advisers to keep cryptocurrencies with a qualified custodian — and those custodians would have to abide by certain requirements.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Registered investment advisers are subject to a custody rule, which requires them to maintain those assets with a qualified custodian, such as a bank or broker-dealer. The rule, which had not been updated since 2009, could now encompass crypto. SEC Chair Gensler had also warned that depending on how crypto platforms operate, investment advisers cannot rely on them as qualified custodians.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">There are not that many custodians who know how to custody digital assets, Jeng said.&nbsp;<\/span><span class=\"s3\" data-v-f87c67ca=\"\">\"So then you're forcing… the industry to use custodians that probably don't have the requisite expertise,\" Jeng said. \"And that's a problem.\"&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The rule could also lead to concentration to only a few registered custodians, which could lead to systemic financial stability risks, Jeng said.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The SEC also proposed a rule in January 2022, which was reopened for comments in April, that broadens the definition of an exchange to capture decentralized exchanges. The rule could ultimately require decentralized projects to register with the agency as alternative trading systems.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Under ATS, DeFi projects would have to make regular filings with the SEC, be subject to mandatory disclosures and have strict limits on how they operate, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">said Healthy Markets' Gellasch.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The industry built and grew without regard to the securities laws, so if the SEC were to adopt rules that would make them have to comply, their ability to operate would likely go very low very quickly,\" Gellasch said.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The rule would probably \"destroy\" decentralized exchanges, in part because the only way to comply would be to become centralized, said the Crypto Councils' Jeng.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A little more than a year after the collapse of the FTX crypto exchange, the CFTC voted to propose a rule in December that would bolster customer protections for those making trades through a derivatives clearing organization.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The rule, called the \"Protection of clearing member funds held by derivatives clearing organizations,\" would require DCOs, which are registered with the agency and clear trades, to segregate out customer funds, including money from retail investors, from their own house funds.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency may want to focus on the spot markets in the new year, Gellasch said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"From the CFTC, there is quite a bit they might want to do, most notably focusing on how much they can get access to the spot markets,\" Gellasch said.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Linda","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Healthy Markets Association","content":"ORGANIZATION"},{"type":"Crypto Councils","content":"ORGANIZATION"},{"type":"January 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Crypto Council for Innovation","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Jeng","content":"PERSON"},{"type":"Tyler Gellasch","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"February","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Gellasch","content":"PERSON"},{"type":"2009","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Healthy Markets","content":"ORGANIZATION"},{"type":"Federal Reserve Board of Governors","content":"ORGANIZATION"}],"hashtag":["CFTC","SEC"],"authors":["Sarah Wynn","The Block"]}