{"summary":"Social network Reddit is expanding its Community Points beta so any subreddit can now ask to create their own token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/126842\/reddit-is-bringing-its-tokenized-community-points-to-more-subreddits","publishDate":"2021-12-08T13:39:13","id":13320,"type":null,"title":"Reddit is bringing its tokenized Community Points to more subreddits","category":["CRYPTOCURRENCY"],"content":["Social network Reddit is expanding its Community Points beta, allowing any subreddit to request the ability to create its own token.","On Wednesday, Reddit released a <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSfTtDFWYv9LrL818G9nVL2A-sUM-tXEvdCO1m6-LYwdUzGI0Q\/viewform\" data-v-f87c67ca=\"\">waitlist<\/a> for subreddits that wish to do so and has provided more information about Community Points on its <a href=\"https:\/\/www.reddit.com\/community-points\/#token\" data-v-f87c67ca=\"\">website<\/a>.","Community Points can be handed out as rewards for users who are active in the community. They can be given out based on the number of upvotes a community member receives within that subreddit, whether that’s for a post they made or comment on somebody else’s post.","Each subreddit can have its own Community Points, with a custom name, token and symbol. They can have value too and can be sold for other cryptocurrencies (and then fiat money if so wished).","According to Reddit, Community Points are about building a reputation. “But it's not limited to Reddit either. Because your Points are on the blockchain, you can take your reputation anywhere you want on the Internet,” the company says on its page.","Currently, Community Points run on a testnet version of Ethereum. But Reddit is <a href=\"https:\/\/www.theblockcrypto.com\/post\/112250\/reddit-is-scaling-its-two-ethereum-based-tokens-using-layer-2-solution-arbitrum\" data-v-f87c67ca=\"\">working with<\/a> Ethereum layer two scaling solution Arbitrum to see if it can run on a version of that instead.","Reddit offers Community Points in the r\/Cryptocurrency subreddit, called Moons, and in the r\/Fortnite subreddit, called Bricks. There are also tokens in the r\/Ethtrader subreddit, called Donuts, that were created as a test of the Community Points system. Donuts live as Ethereum tokens on mainnet.","The goal of introducing tokens to Reddit is that they can be used to incentivize good behavior or content creation within a specific community. They could also potentially be used in the future to run the community itself — via a decentralized autonomous organization (DAO) — although Reddit currently uses polls for such decision-making.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"}],"hashtag":["TOKENS"],"authors":["Tim Copeland","The Block"]}