{"summary":"Pepe&#x27;s price dropped 18% after over $15 million in the meme token moved to crypto exchanges on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247297\/pepe-memecoin-drops-18-amid-large-on-chain-transfers-multisig-changes","publishDate":"2023-08-25T08:11:31","id":13330,"type":null,"title":"Pepe memecoin drops 18% amid large on-chain transfers, team&#x27;s multisig changes","category":["CRYPTO ECOSYSTEMS"],"content":["The price of Pepe memecoin dropped after large amounts of tokens were deposited into crypto exchanges on Thursday by its developers, a move that may have spooked investors.","Pepe is changing hands for around $0.00000088 as of 8 a.m. ET, down 18% in the past 24 hours, according to CoinGecko.","On-chain analysts at Lookonchain <a href=\"https:\/\/twitter.com\/Crypto_Noddy\/status\/1694813331968729497\" data-v-f87c67ca=\"\">noted<\/a> that Pepe team's multi-signature (multisig) wallet moved over $15 million to centralized exchanges, potentially sparking a sell-off. The developers were said to have held 6% of the token's supply.","Reportedly, the signature threshold for the Pepe team's multisig wallet, used for transaction approval controls, was reduced at the same time. Multisigs are often used to enhance security by requiring multiple signatures from a specific team to approve a transaction.","Pepe developers had previous used a multisig configuration that required the majority of five out of eight trusted parties (5 out of 8) to sign off on a transaction. But there was a sudden change in Pepe team’s wallet to a requirement of only 2 out of 8 signatures.","The fact that large numbers of tokens were moved to exchanges around the same time as this change was observed may have triggered concerns among traders, possibly causing the observed price drop.","The meme token had held steady at a market capitalization of around $500 million since mid-June. The market cap fell to $375 million today.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"$375 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$0.00000088","content":"MONEY"},{"type":"Pepe memecoin","content":"PERSON"},{"type":"18%","content":"PERCENT"},{"type":"$500 million","content":"MONEY"},{"type":"Pepe","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"Pepe","content":"PERSON"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"8 a.m. ET","content":"TIME"},{"type":"Lookonchain","content":"LOCATION"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}