{"summary":"Despite advancing, the bill&#x27;s prospects of becoming law are now in doubt after negotiations broke down, and a tense, marathon legislative session on Thursday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241852\/stablecoins-bill-advances-in-us-house-after-tense-day-of-debate","publishDate":"2023-07-27T22:15:02","id":13349,"type":null,"title":"Stablecoins bill advances in US House after tense day of debate","category":["POLICY"],"content":["The House Financial Services Committee passed a comprehensive regulatory framework for stablecoins in the U.S., but along party lines after longterm bipartisan negotiations around the bill broke down.","House Financial Services Committee Chair Patrick McHenry, R-N.C., <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\">blamed the White House<\/a> for the impasse, while committee Democrats argued Republicans were rushing the process.","The bill was approved by the committee by a vote of 34-16, with a handful of Democrats bucking their senior members on the panel, in addition to unanimous Republican support for the legislation. The vote was similar to a vote yesterday in the panel to advance the crypto market regulatory overhaul.","Democrats protested the vote on the bill earlier in the day through a series of procedural maneuvers to slow down proceedings, while saying that Republicans could wait to vote on the bill until September or later. A bipartisan compromise on the bill looked likely as recently as earlier this week. It remains to be seen whether talks could be revived to give the bill a substantial chance of becoming law.","A separate crypto-related measure around self-custody also advanced past the panel on a party-line vote, indicating it is unlikely to advance into law due to the split control of Congress.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"16","content":"DATE"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"}],"hashtag":["CONGRESS","HOUSE FINANCIAL SERVICES COMMITTEE"],"authors":["Colin Wilhelm","The Block"]}