{"summary":"The Canada-based company grew its hash rate by 9.5% to 2.78 exahash per second (EH\/s) by the end of the second quarter. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163002\/bitcoin-miner-hut-8-reports-69-million-second-quarter-net-loss","publishDate":"2022-08-11T10:11:32","id":13348,"type":null,"title":"Bitcoin miner Hut 8 reports $69 million second-quarter net loss","category":["MINING"],"content":["Bitcoin miner Hut 8 reported a net loss of C$88.1 million (about $69 million) and a 17.8% decline in revenue to C$43.9 ($34.3 million) in the second quarter of 2022.","The company's financial results were affected by the lower average bitcoin price and increased average power costs, it said in a report published Thursday.","“We have been anticipating market volatility for nearly a year and took proactive measures to successfully navigate the current downturn through the balance of the cycle,” said CEO Jaime Leverton.","The company has managed to hold its bitcoin reserves through the recent market downturn. It mined 946 Bitcoin in the second quarter and increased its bitcoin holdings by 14.6% to 7,406 BTC.","\"For us, it doesn’t make sense to sell bitcoin at low prices,\" Leverton said in the earnings call.","Instead of selling bitcoin, Hut 8 has pursued additional funds to expand mining operations \"without being reliant on capital markets,\" including yields from its bitcoin reserves and revenue from its high-performance computing business, which last quarter totaled C$4.7 million ($3.7 million).","\"We were very intentional in recalling the 2,000 bitcoin that we had in our yield program into our possession in late May before the contagion spread across the industry,\" Leverton also said.","Hut 8 grew its hash rate by 9.5% to 2.78 exahash per second (EH\/s) as of the end of the second quarter. It has also ramped up capacity at three of its sites in Canada (North Bay, Drumheller and Medicine Hat).","<em data-v-f87c67ca=\"\">This story has been updated with company comments after the second-quarter earnings call.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"C$43.9 ($34.3 million","content":"MONEY"},{"type":"14.6%","content":"PERCENT"},{"type":"9.5%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Canada (North Bay","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"17.8%","content":"PERCENT"},{"type":"second quarter of 2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"C$4.7 million","content":"MONEY"},{"type":"quarter","content":"DATE"},{"type":"$69 million","content":"MONEY"},{"type":"$3.7 million","content":"MONEY"},{"type":"end of the second quarter","content":"DATE"},{"type":"C$88.1 million","content":"MONEY"},{"type":"Jaime Leverton","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"Drumheller","content":"LOCATION"},{"type":"Leverton","content":"PERSON"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}