{"summary":"FTX’s Bahamian entity commingled customer funds, according to joint provisional liquidators in the Bahamas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212591\/ftx-digital-markets-commingled-client-funds","publishDate":"2023-02-16T11:23:41","id":1335,"type":null,"title":"FTX Digital Markets commingled client funds, Bahamian liquidators say","category":["LEGAL"],"content":["FTX Digital Markets, the crypto exchange’s Bahamian entity, commingled customer and corporate funds, according to a report filed in court earlier this month.","The joint provisional liquidators unwinding FTX’s bankruptcy in the Bahamas filed a lengthy <a href=\"https:\/\/www.pwc.com\/bs\/en\/services\/business-restructuring-ftx-digital-markets\/assets\/seventh-affidavit-of-kevin-cambridge-filed-8th-february-2023.pdf\" data-v-f87c67ca=\"\">report<\/a> on Feb. 8 that said the company had “limited” accounting records and made “little distinction between what represents, potentially, client monies and corporate funds.\"<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","New FTX CEO John Ray has made similar claims about the lack of financial records across the firm’s more than 100 entities. Meanwhile, former FTX CEO Sam Bankman-Fried has pleaded not guilty to criminal charges related to the mishandling of customer funds, among other allegations. Two former executives have pleaded guilty to criminal charges.","FTX Digital Markets has approximately $219.5 million in multiple bank accounts, the liquidators said, but it’s not clear which funds were held for the benefit of FTX Digital Markets customers.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“It appears that client monies have been commingled such that it may not be possible to clearly identify sums that constitute client monies as opposed to general corporate funds,” the report said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The report was filed in court by Kevin Cambridge, a partner at PricewaterhouseCoopers Advisory’s Bahamas firm who was appointed as a joint provisional liquidator in the bankruptcy case. It said FTX Digital Markets may have more than 2.4 million customers in more than 230 jurisdictions around the globe, including 10,500 institutional customers.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The liquidators also identified intercompany debts worth $276.2 million, the report said. That includes $256.3 million owed by FTX Property, which “appears to represent funds transferred by FTX Digital to fund commercial and residential property acquisitions” in the Bahamas.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$256.3 million","content":"MONEY"},{"type":"FTX Digital","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kevin Cambridge","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"PricewaterhouseCoopers Advisory’s Bahamas","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$219.5 million","content":"MONEY"},{"type":"Feb. 8","content":"DATE"},{"type":"John Ray","content":"PERSON"},{"type":"FTX Digital Markets","content":"ORGANIZATION"},{"type":"$276.2 million","content":"MONEY"}],"hashtag":["BANKRUPTCY FILINGS","FTX"],"authors":["Stephanie Murray","The Block"]}