{"summary":"A flurry of bitcoin futures liquidations triggered a broader market response, trading execs say. On Monday, the price of bitcoin fell below $31,000.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90758\/bitcoin-liquidations-market-headwinds","publishDate":"2021-01-11T11:04:24","id":13357,"type":null,"title":"$2.9 billion: Bitcoin liquidations kick up broader market headwinds","category":["BITCOIN"],"content":["Bitcoin's historic rise came to a halt over the weekend — but the industry's largest trading desks aren't too concerned.&nbsp;","After soaring to all-time highs near $42,000, the price of bitcoin briefly dropped below $31,000 on Monday in a move that market-making executives say was driven by a flurry of liquidations. Coinbase saw a low of $30,251 before recovering, and at press time, bitcoin is trading at roughly $31,100.","Data collected by The Block Research shows that liquidations of bitcoin futures long positions topped $1.47 billion on Sunday. Additional data from ByBt shows that liquidations over the last 24-hours stand at nearly $2.9 billion.","The recent price action — as well as the liquidations — are laid out on the charts below:","","","<iframe title=\"BTC Liquidations\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/btc-liquidations\/embed\" width=\"100%\" height=\"420\" frameborder=\"0\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\">Buying of the dip<\/strong>","The mix of liquidations and low liquidity during a weekend trading session contributed to the downward price action, according to FTX chief executive Sam Bankman-Fried.&nbsp;","\"The good news is that there's unlikely to be a lot of pain in the industry,\" Bankman-Fried said in a message to The Block Sunday evening. \"Prices are still up a lot.\"","Indeed, Robert Catalanello of trading firm B2C2 said that the firm saw a lot of buying over the $40,000 level \"when there was limited follow through people decided to lock in profits.\" He added that recent selling does not look like \"panic selling by any measure.\" Fresh capital continues to sit on the sides and has quickly bought up some of the major dips over the last 24 hours.&nbsp;","\"There is a lot of money waiting for a dip,\" said Rich Rosenblum of GSR, another trading shop.&nbsp;\"While the market is trading like its game over the last 24 hours, we are basically unchanged over 7 days.\"","In Rosenblum's view, such price swings to the downside are to be expected given the historical circumstances.","\"Heavy volatility is to be expected in a market that has rallied 400% in a few months, and is partly driven by retail trading with 125X leverage,\" he told The Block.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last 24 hours","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"$30,251","content":"MONEY"},{"type":"$1.47 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"last 24","content":"DATE"},{"type":"$42,000","content":"MONEY"},{"type":"Rich Rosenblum","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sunday","content":"DATE"},{"type":"Robert Catalanello","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"Rosenblum","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$2.9 billion","content":"MONEY"},{"type":"evening","content":"TIME"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"400%","content":"PERCENT"},{"type":"$31,000","content":"MONEY"},{"type":"Bankman","content":"PERSON"},{"type":"$31,100","content":"MONEY"},{"type":"$40,000","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Frank Chaparro","The Block"]}