{"summary":"On this episode of The Scoop, Peter Johnson discusses JUmpCapital&#x27;s origin story in Crypto, we also dove into the firm&#x27;s Crypto incubator at the University of Illinois Champaign and we talked about the trends he&#x27;s expecting to play out in 2019.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42514\/peter-johnson-jump-capital","publishDate":"2019-10-08T16:00:12","id":13356,"type":null,"title":"A Conversation with Peter Johnson, Principal at Jump Capital","category":["CAPITAL MARKETS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from episode twenty three of The Scoop, The Block’s flagship podcast. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#55253a313634262115213d3037393a363e36272c25213a7b363a38\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"7b0b141f181a080f3b0f131e19171418101809020b0f1455181416\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length.<\/em>","<i data-v-f87c67ca=\"\"> While big players like Coinbase&nbsp;and Bakkt make most of the headlines in crypto and on Crypto Twitter, there are major institutional players that have been quietly operating in the background for years in the Bitcoin market. One such player is Jump Trading and its affiliate venture capital firm, Jump Capital.<\/i>","<em data-v-f87c67ca=\"\"> Jump Trading is one of the most active traders in the digital asset world and also one of the most discrete. Leading investments on the crypto side at sister firm Jump Capital is <a href=\"https:\/\/jumpcap.com\/jump_capital_team\/peter-johnson\/\" data-v-f87c67ca=\"\">Peter Johnson <\/a> -- a Principal at the firm who joined The Scoop to discuss the firm's origin story in crypto. We also dove into the firm's crypto incubator at the University of Illinois Champaign, and we talked about the trends Johnson is expecting to play out in 2019 and beyond. We hope you enjoy the episode!<\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK9343971334\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Ladies and gentlemen, boys and girls, friends, Romans, countrymen thanks so much for tuning in to what is an incredibly special episode of The Scoop. Not only do we have my very dear friend Pete Johnson coming in all the way from Chicago from Jump Capital, Jump Trading but we are also recording for the first time in our new New York City offices on Lafayette Street in Lower Manhattan. Pete is one of the foremost venture capitalists in the Chicago crypto scene. We're excited to have him here to chat about what's going on maybe in Chicago, Jump's origin stories in the space and of course some of the investment opportunities he's looking at as a principal at the firm. Peter thank you so much for joining us. Happy to have you.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Great to be here. Thank you.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So let's get started with exactly that origin story if you will. For context, Jump Trading is probably one of the most prominent Bitcoin cryptocurrency trading operations in the market. Bloomberg has reported that they are maybe one of the major benefactors of Robinhoods order flows that are being sent through them to systematically internalize... When I was at Business Insider I reported on the graphical user interface that you guys were developing for crypto OTC trading and it's not quite known exactly how much you trade but it's definitely known to be a lot. On the venture side you've made at least 15 investments that are public. There may be some that aren't, many of which were incubated through your relationships with University of Illinois. Talk to us a little bit about how it all got started.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yeah absolutely. So I joined Jump Capital in 2013 to do fintech investing and it was that year that I first became aware of Bitcoin and I became aware of it through the situation in Cyprus for their seizing bank deposits and Bitcoin spiked in the news. I started reading about that and thought that it was it was crazy that potentially there was this magical internet money that people were interested in holding instead of their nation's currency. I started reading about it and learning more about it and I became convinced that this was a once in a generation technological innovation that was going to change the way money was stored and transferred, it was going to be a new asset class for investors. I became that guy who wouldn't stop talking about bitcoin in the office. Luckily for me at Jump and within Jump Trading I wasn't the only one and there was a lot of folks on the trading side that were also interested in bitcoin at that time. A group of us continue to learn about the space and then in 2014 and into 2015 has been Jump Trading started to get active in the space and that was first at our research lab, Jump Labs down at the University of Illinois Urbana-Champaign. And that's where the work initially started -- to learn about the market, to start gathering data and to start trading. Over the next couple of years as the market developed our trading also developed and we became one of the largest traders and market makers in the crypto space. That then developed in around 2017, we saw that there was large counterparties that were interested in working directly with Jump Trading so that's when the OTC trading started where we would partner directly with large financial institutions, payment processors, foundations, trading firms to provide liquidity directly to them. Now we have 3 ways that we're active participants in the market: we do on exchange trading, we have a large OTC business and we make venture capital investments.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Let's start with the venture capital business, obviously because that's where you're sitting and that's where you're spending most of your time although as we talked over the phone last night sometimes you're working with the traders to figure out how you can help them and vice versa. But on the venture side let's walk through some of your investments BitGo is probably the most notable. How do you... I guess being out there in Chicago, you might feel a little isolated from the San Francisco\/New York centric crypto communities. How do you break in and what do you look for in an investment?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I feel very much in the center of things being connected with Jump Trading. I think that we see the majority of what's happening in this space. In something like BitGo that's a company that I was familiar with for years and it became clear to me that 1) custody and privacy key security is obviously one of the biggest problems in the space and that BitGo had established themselves as one of the most trusted names in crypto where there's not a whole lot of trusted names. Our view was that as this space developed, as more exchanges came in as more traders and more participants came in -- BitGo as a battle tested solution was the default choice that those players were going to look to to secure their keys and have a qualified custodian. We also believe that as more large financial institutions will come into this phase they're also going to look for a battle tested solution to store their private keys and to manage that part of the business and BitGo will be well positioned for that as well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Rather than developing their own internal custodial solutions? Because we have seen I think it was last year that was the story about Nomura developing their own in-house custody solution and potentially offering that to the market. Is that a trend that you've seen at all or you imagine that custody will continue to be outsourced to these more crypto native firms?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Just interject really quickly. But he's a great person to ask that question because they've also invested in Curv which is another type of, they're not necessarily custodian in the same sense that BitGo is but they're trying to offer these solutions to secure assets as they move around. Let's focus on custody.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> What we expect to happen in this states is that you will have some technology savvy leading companies in the space that will develop their own solutions. For example Fidelity comes into this space, they develop their own solution for example, you're going to have a lot of other companies that come into the space that don't want nor is it a good decision I think for them to be developing private key custody solutions. They should outsource that to somebody that has the best solution in the space or one of the best solutions in this space. So the two investments that we've made in the private key security or custody space is one is BitGo which is battle tested, trusted, one of the premier names in crypto that I think everyone is going to have them at the top of their list if you're looking for a custody solution and is a regulated custodian, qualified custodian. On the other end of the spectrum is Curv which is just focused on private key security with a unique technology -- a multiparty computing technology that is purely focused on the technology side of it and not going into the full qualified custodian financial services realm that somebody like that BitGo is doing.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> It's interesting with the BitGo investments. So we've just seen Xapo another of the big custody players acquired by Coinbase at an astonishingly low valuation. And I think I'm right in saying that Xapo was actually charging 0% to their customers as well. So custody was a loss leading operation. What does that mean for your investment in BitGo?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I think on the surface they might seem similar but they do have very different business models. I do think that it is relevant that custody fees, we fully expect to come down over time. Ask Mike Bell at BitGo, he'll say he expects them to significantly come down over time and we think that is right and that should happen and that there are various other ways that custodians end up monetizing which are not in direct custody fees.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What do you think those are?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Things like lending. I think is the most obvious.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> BitGo is looking to get into prime broker related services as well so there are other avenues by which they can make money. But the BitGo\/Xapo conversation lends itself to something that you've written about and something that Teo and I have checked out a bit on in terms of where we see service providers going in this space. Do continue to see that Coinbases of the world gobble up more verticals in terms of offering custody trading, prime broker services, staking and everything versus... Okay, I'm going to be like Curv as an example and focus on this very specific aspect of the institutional market. From your seat what's your thesis?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> You're going to continue to see both. I think that the large players like the Coinbases, they want to offer more services to their clients which is smart from a market structure perspective. I think separating custody from exchange is a better market structure. I think that for two reasons, one is that I think it's more secure. Say if you're trading across 10 exchanges you can either have coins at those 10 exchanges and you have to trust those 10 exchanges or you can have your coins at one custodian for those 10 exchanges and then you just need to trust that one custodian, so it's safer. It's also more capital efficient because if you can have all your coins at one custodian and trade across 10 exchanges instead of having to pre-fund those 10 exchanges it's much more capital efficient and right now crypto is a capital intensive business.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> So the second argument definitely resonates with me and I think we had a similar conversation with Nelson Minier from from Kraken, this idea that having to pre-fund accounts across various exchanges is obviously capital inefficient. This idea of trusting one custodian vs. 10 seems almost counterintuitive to me though in the sense that one custodian is a single point of failure whereas ten custodians... one might drop off but at least you have this backup set of 9 custodians.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> It's kind of like the like the qualified custodian rules came into effect for a reason and some of those came on the back of Madoff. And the reason was like let's define what the entities are that you can trust. And then let's keep entities with those parties that you can trust. And I think that that is a good way to go about things is having here are the entities that you can trust instead of, I think we've seen across the exchanges. You can't always trust various exchanges.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> I'm making the assumption that these various custodians are all qualified custodians.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yes. if they're all trusted qualified custodians then it moves I think more to the second point on capital efficiency across the exchanges.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Obviously there are several pain points for traders in this market. And we've talked about this on on several episodes of The Scoop. The lack of a trusted venue on which to change without the worry hanging over of a hack or something similar makes it difficult for firms like yours or at least a few years ago to get in. Looking on a more macro level about what the pain points are and I'm sure you get a sense in talking with the traders at Jump and then looking at where you can invest. What are those pain points and where are those investment opportunities?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> On a macro level across trading I think that the greatest opportunities are increasing the capital efficiency in this market. So what does that mean? It means credit and it means having buying power across various exchanges without having to pre-fund at all those exchanges. It means settlement solutions that are more efficient and safe ways to settle. I think that those are the main things. It's how do you improve capital efficiency in a market that is very capital inefficient compared to traditional markets?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So what investments do you make? What companies out there are doing some of these things?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> So I think BitGo certainly is working on some of these types of solutions. Companies like Omniex which are allowing trading across various exchanges and then kind of the next logical step beyond that is how do you not need to prefund all those exchanges when you're trading and cross them. I mean the lending companies we're not investors and some of the lending providers but I think that that is a great space that making more liquid markets for borrowing and lending helps the capital markets evolve and continue to develop.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> A lot of these are centralized solutions by centralized companies what do you guys think about a lot of the stuff that's going on in DeFi with centralized lending, decentralized trading and the like is that something you're interested in at this point or maybe more down the line?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yeah so I love what's going on in the DeFi space because it's showing us what's possible. And it's fascinating to see all the different things that are possible. I think some of the things that are getting worked on in DeFi will become highly useful over time but I think the question right now is what solves the problem better, a central solution or a decentralized solution? And for most situations in most cases the central solution solves the problem better than the decentralized one, that's why you're seeing more volumes on centralized solutions than decentralized ones.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> I think Pete has a fascinating perspective to answer this question which is, what needs to happen in the DeFi landing space for groups like Jump Trading to actually start using them?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I think it needs to be a clearly better solution than the centralized version. In most technologies, something needs to be 10x better for somebody to switch. So how does decentralized lending become 10 times better than centralized lending?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> That's interesting because I tend to think about it more as there are various obstacles, the main one being compliance obstacles -- lack of AML, KYC rather than the simple fact that hey this isn't quite 10x better?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Part of it being 10x better is, yeah it needs to be regulatory compliant and needs to be easy to use. You need to be 100 percent sure it's secure. All these things, the rates you're getting need to be better than you're getting on a centralized solution.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Which they are right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Have you guys tested with any of these different platforms just for your own experimentation? Because the benefit of Jump and Jump Capital as well is that you're playing with your own money. I mean you guys are investing. Employees of Jump Trading and the founders of Jump Training's money -- you guys can't break laws obviously but there is a level of regulatory leeway, I would say or you kind of get to operate in your own little sandbox to an extent that doesn't come with being a large asset manager or a white shoe investment bank. So that gives you the opportunity whether it's in the lab or somewhere else to experiment.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> And just to follow up on that, the size of these open finance markets just aren't big enough to deploy a significant amount of capital -- a Jump Trading level of capital right now but from an opportunity perspective the spreads on these decentralized exchanges and the yields being offered to lenders right now are unheard of. And if you look at the spreads on centralized exchanges they are some of if not the tightest spreads you will find in any market. So you go on Gemini right now, Coinbase and the spreads in the bitcoin market are often single cent spreads","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So the question there being you have this regulatory freedom in extent since you're playing with your money for one and two, there's this profusion of opportunity in decentralized finance including these crazy spreads and these crazy yields. With that, what do you do?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I'd make a couple comments on that, one is that we do have a lot of flexibility being a proprietary trading firm and having proprietary capital that we're investing on the venture side. We do operate as if we are much more regulated than we are and we do that purposely on the trading side because that is just the way that Jump has and always will operate. Certainly there is like interesting opportunities in the DeFi space and Jump Trading is doing things there. Frankly I can't comment but it certainly seems like there are interesting opportunities.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> I was reading through your 85 theses the changing of the seasons in crypto land published on LinkedIn. You have this this comment on Open Finance, this was written in May of this year. And you made this prediction that Open Finance needs to hunker down for a longer winter. So this was in May, it's now September. Do you still believe this is the case? If not what has changed? What else needs to change?Are we still in winter?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I think for DeFi it is still pretty cold. I think DeFi's coming along and I'm excited about DeFi solutions. But is there mainstream use cases for DeFi yet? I think it still has some, we have a ways to go for that. I think it's crypto spring in trading and investing as Bitcoin being digital gold as crypto being a new money transfer rail for moving money across the world and moving between currencies. I think it's spring in a lot of places but I think DeFi still needs to develop some.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So let's focus on the spring part for a second in terms of upcoming deals. What do you anticipate the pipeline to look like over the next I guess now four months till the end of the year, five months until the end of the year versus maybe towards the end of last year? It was kind of a deep winter, what does that look like now?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> From an investment perspective. We try to not pay a whole lot of attention to the cycles that we're going through. That's just part of innovation is you have these big cycles that you go through and you don't want to get too high when the price goes high and too low when the price goes down. I mean if you zoom out and just look at, even if you thought five years ago that we could be where we are today it's incredible. I think if you look at that long term trajectory we're certainly going in the right direction in crypto so we try to be relatively even handed on investing regardless of where we are in any specific cycle.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Well what do the cycles mean for deal flow? Did you see deal flow slowed down in December and now starting to pick up with this resurgence in the market? Or has it been fairly consistent?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yeah I mean there was a huge influx obviously in 2017 and 2018 with the price move.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Nash Nash. The name was the best part","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> It was one of the best pitches I heard. It was a very good pitch.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> In any case, you try not to pay attention to the price actions or where we are in the cycle. Focus on making good deals, obviously. In terms of valuations, where are we now that things have kind of picked up? Are we seeing a level of frothiness or not?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> There's still some frothiness. Yeah but things are certainly in a better place than they were. Looking back during the ICO boom certainly, there's been some rationalization from there. So I think we're in a relatively good place from a valuation perspective right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> What's interesting as well is that several of the investments in your portfolio have been incubated through Jump. Is that correct?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yes, so we incubate some very early stage companies down at our research lab down at the University of Illinois Urbana Champaign. We've had a lab down there for years and we look there if there are interesting students, PhD's, postdocs professors that are working on things in crypto we want to support those efforts. And that's one of the things we do there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> So does that sheltered environment perhaps protect you from the frothy valuations that we see in the wider market?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I mean it's one part of what we do. But we're involved in investing in a lot of companies across the space. A lot of those are in New York and San Francisco. So we're certainly not shielded from the valuation cycles.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Another question I have. We're starting to see a lot of crypto venture funds. Allocate capital to liquid assets primarily bitcoin and ether as as much as a mandate will allow them. I think there's usually this 20 percent cap of a U.N. that's allowed to go into a liquid portfolio. Is Jump weather across Trump capital. Trump trading direction Lee long. Any of these crypto currencies right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I think it's tough for me to say exactly what Jumped trainings positioning is.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Well I would assume as a as a market yeah that that strategy is a market neutral strategy but perhaps something correct. But. But yeah is that some kind of side pocket where they just have this natural long. Position","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> As a market maker. You're so much just naturally along for holding inventory of coins. That I want to part can I Jump Jump trading strategies.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Sure. Yeah. So the reason I ask a question is as a segway into. A discussion about your bitcoin investment thesis. That's not to say that. Trump has any backbone but how you think about bitcoin and an investment thesis around Bitcoin. And again this goes back to your crypto thesis post. So I think you you mentioned that bitcoin has perhaps its best use case in emerging markets but interestingly you're also very very bullish on stable coins. So how do you reconcile the two. And where do you think demand for bitcoin comes from in these emerging perhaps hyperinflationary developing economies.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yes I think that there's two different use cases here. For digital gold or a store of value I think Bitcoin is the best asset in the world. I think it's better than gold. It's scarce it's durable it's portable it's fungible transferable it has all the elements that you would want of a store value it's except gold everyone believe there's this collective belief that I've already hasn't gold and I think that's building for it for bitcoin and then people will criticize Bitcoin as a store of value because it's not stable. I think when I think of a store of value I think of something that is a not correlated with other assets and B does well in high inflation environments. I think that that's really why people invest in gold. And I think that bitcoin suits that need very well and will continue to gain as as digital gold.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Why why does it suit that those properties better than any other cryptocurrency.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Collectively. Because frankly the most important like why is gold worth anything. It's because it has those other properties. I mean you mentioned but the most important thing is just we all believe it's worth something.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> And do you think that collective belief that momentum can be usurped at this point. Ten roughly 10 years after the. Release of Bitcoin. Or do you think that the first mover advantage is a given. At this point.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I think for the digital gold thesis Bitcoin is very tough to catch this one. Not to say it can happen but it certainly has a very large lead there. So that that's kind of the digital gold kind of use for for Bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> And who are the buyers.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> People I want. Anyone that wants to diversify their portfolio. I think that if you look at anyone looking for an asset that's not correlated with other assets or has a low correlation and does well at high inflation rate environments or they believe it will do on high inflation rate environments which I believe those two things about blockchain. Then that leads you to believe that it's a rational thing to include that a portfolio in some percentage. Which I believe all those things. So I think that portfolio managers know any investor. Really I think it is a potential buyer for that use yes.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Do you have any concerns related to bitcoin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I mean bitcoin. Do you ever concern the Bitcoin as all of crypto. It's still it's still an experiment. At this. Phase I mean the. The success of Bitcoin and crypto in general I think is. Extremely likely. But it's not certain. It's still an experiment. So you have concerns here. It's still an experiment. Of course you have concerns on the use cases in emerging markets and crypto is used as a as a as a global payment real stable coins are very well suited for that. Because at the end of the day it reduces the volatility yet in bitcoin something that's stable coins will play a huge role in that. I think several coins will be an increasingly important part of global money flows and we'll also have a very meaningful impact on the ethics market because once you have highly liquid stable coins and various currencies that the logical conclusion is and what does that mean for a fact that means you have a global 24\/7 ethics market that's accessible to anyone.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well that's a that's a really interesting point. And. I think given your you'll see a Jump it's something you probably have talked to some of your your counter parties over on the training side about how stable points can impact the business that they do. In terms of just moving in between whether it's crypto or moving in between different different effects currencies in a more efficient manner have you have those types of conversations. What what do they think about silver coins are they bullish or are they not bullish.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I mean I can't speak for Jump trading generally but I would say I am very excited about the potential of stable coins.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> what's the Chicago trading scene do they. What do they think about stable coins.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> That there's a ton of potential there. a huge amount of potential. Yes just as far as the way the money flows across the world and between different currencies are using stable coins to do that I think is fundamentally better than using corresponding banks to move money across the world in between currencies just a more efficient way to do things. You just need the market to develop in such a way that these things are have large enough market caps or liquid enough aid and everyone on both sides is accepting of them that we can get to this.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is there is there one stable coin that to rule them all. So to speak. This episode will be live after the finance stable coins announced tomorrow morning. Every exchange could have their own stable coin.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> And I just want a. Jump in for a second here. I feel like this podcast is just me reading you back your theses but there's this very interesting line in your post quote large global consumer technology and crypto companies may be the best position to provide new global money transfer rails with records either kept on centralized databases or distributed consensus ledger. This was in May. I think Libra was announced in. June June feels like a lifetime ago. Is this Facebook game to lose now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> If it's Facebook scheme to lose. But I think Facebook is in a great position. I'm really excited about what levers what they're doing with Libra for two reasons one it just it. Gets a lot of people interested in crypto and they're learning more about it. And to as I mentioned in the post. Somebody needs to onboard the world to crypto. And Facebook is in a great position to help onboard the world of crypto.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> But it's not necessarily the same use case that a tether or a pax or a Gemini dollar rest in peace might have on the market first. in terms of what the trading folks you're talking to want that's a whole different. That's a whole different use case I think.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yeah. It's different. They both are looking towards how can you move money across the world and between different people in a more seamless manner. Which I think is is a good goal. And I think that's what we're going towards. And it could be it could be stable coins it could be Libra. My guess is that always there will be roles to play for. For each of them.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Yeah. A hundred percent. You grew up on a farm. You didn't do any farming.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I did not do any farming now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How does that influence the. Investment decisions you make today. Is there any. do you ever hearken back to the corn and soybean fields of Minnesota.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Oh man I wish I had a good tail I could weave to tie the farm to the investing decisions.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> a lot of times. farming has to do with animals but investing has do with people. It's a people business and we're almost in very similar businesses. We look at companies and we decide to write on them based off whether they're. Reputable have a good business model etc. It's very similar to what we invest on what we invest our words you invest your dollars or. What do you look for in a company. Does it start with the people or does it start with something else.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> number one, It is people would saying crypto there's maybe three main things we look for it starts with the people. Unquestionably. Two is the the business model. Are they solving a problem that someone's going to actually pay them for. And that's somewhat obvious. Maybe in other markets but in crypto you obviously you almost have have to have that as a criteria like is someone paying you for the services you're providing. And then three the dad does what they're doing a line with how we think the space is going to evolve over the next five plus years.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> So. You've mentioned that you do not buy the fact to protocol theses and Can I quote again more value will accrue at the application land and the protocol land. So everybody and their mother seems to have their own definition of fat protocol thesis. So I would love to hear your definition and your. Justification of. Your repudiation of the political thesis.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Yes I think that during. ICOs good times. There was all these new protocols that came out and there was the hope that they would launch these tokens. There'd be some utility for the tokens that they would increase in value.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Sorry. Just quickly are we discussing. Application tokens or base layer protocol. Theory and affinity. That group","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> The biggest fallacy maybe on value creation was was on the utility token sign. And I think that that is where it's most clear that the value that a lot of these tokenized think it's become clear now that like there was no value accrual or capture or method mechanism for them. And that that's why a lot of them didn't didn't capture value. I do think that we are seeing increasingly tokens that do have value capture mechanisms. Whether that's staking or revenue buyback kind of programs on the always. But there is a real way for value capture to happen at the token level. So I think that is very promising but but more generally I think that companies that have relationships with customers and can charge make money make revenue kind of based on that relationship. That's where the majority of the value will continue to accrue.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Very interesting. So. So this. Those companies would fall under the picks and shovels. Category. Or would you also include crypto native. Quote unquote. Companies that too.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> which category you're talking about.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> You said. The companies that will perform the best with those that actually have paying customers and value will accrue to . Crypto companies that are modeled around more traditional services. So my question was are these companies that exist on a blockchain or off blockchain.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> It can be both.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> And just quickly having having reviewed Trump's portfolio it seems to me as if most of your investments to date have been made within this picks and shovels. Category","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> So so we are very interested in companies that are providing like the infrastructure like like trading infrastructure for example like things like order management execution management system things things like that that are iconic trading infrastructure which is different then like the protocol infrastructure. So we're investing in. We like fixing shovels companies. We like companies that have real revenue. And they're sort of solving real problems. So that's kind of the main things that were that were excited about.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well do you ever see yourself investing in a protocol or or a token project. It would be so much outside of that. Yeah.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Not not not not right now. It's outside outside what we're focusing on right now.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Yeah but you do expect to see new coins come onto the market that are valuable quote unquote crypto. This is from May 20 19. Um. And and and you you followed on by saying these will these will be new currencies and they will challenge existing currencies like Bitcoin and other and perhaps Monaro. So what does that path look like for new currencies to come to market and actually accrue some kind of monetary premium. Well it's interesting Ali as you mentioned Bitcoin had this collective belief system and that that would be difficult to use up. Do you do you see the currency market as a as a power law market or do you think that there can be several concurrent winners as it were.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> It's something like what is going to be digital gold. The store of value. I think that there is a power law there and then bitcoin has a strong lead for other types of tokens that have value accrual mechanism that. That's stating buybacks different different ways that the token is accruing value. I think that there is room for many of those types of tokens in the market. So I think that there will be many winners across the space before the specific digital gold. I think that there is probably one winner there.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Sure. So how do you think about something like ether.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I think it's the leading smart contract platform right now. It's most stable coins are built on it. And I'm long stable coins I know that.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> I personally tend to think that ether is contending directly with bitcoin for a monetary premium. And the same properties that enable bitcoin to be a good replacement for gold a digital gold as it were applied similarly to ether and perhaps apply even better to either. Is that something you would agree with?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> I put them in different categories. WHich is better? It depends on what you're looking for and what environment you're in","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> As we wrap up the conversation looking into towards the end of the year what exactly you're excited about and will dominate conversations in both trading and venture capital. You were in a meeting before you got here with another V.C.. Well I won't mention but what is consuming these types of conversations.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Different people are excited about different things. What I'm excited about I'm excited about crypto really emerging as a global payment rails largely powered by stable coins. It's actually used to move significant amounts of money around the world in between different currencies in a seamless way that's accessible to everyone. I think that when that starts that impacts on other asset classes specifically effects. I think that that will be extremely interesting. And then I think Bitcoin's continued emergence as a store of value that has a place in a lot of portfolios and how that happens. I think it's really exciting and I like things like the like the lending and borrowing market like that that is in emerging market in the crypto space and I think that there's a ton of potential there that I'm excited about.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> How do you as an investor build exposure to this stable coin boom.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> We're still working on figuring that out yeah.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you how do you tap into that value. If you see it being so valuable.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> And so just to give our listeners some context for something like Libra which is Facebook it's stable coin solution one way to build direct exposure is to be part of the Libra association. And that gives you some interest that occurs to the float. Another way an indirect way might just be to buy Facebook stock and Coinbase. Yeah I think that that's a good summary of some of the ways to participate participate. Certainly you can participate directly in like the tokenized like Libra stable coins are largely a float game business model. So there's certainly a business model there that you can look for his fate and you can look to participate in the the on and off ramps and the exchanges of those assets because at the end of the day at least in the near term you're still going to need to go to to fiat at the end of these transactions are the majority of them and you can look to participate in who's building the user interfaces to make this easy to do. I think that for. This to get mass adoption where you're really seeing crypto being used to move very large amounts of money around the world. Ideally it's just a seamless interface for folks that is integrated into what they're already using and in many times they won't even know that they're using crypto on the back end. And that's something I mean we're already seeing that with the remittance companies that are looking at crypto as back and rails for what they're doing where it's not something that the end user knows or cares about for say. But it's sometimes just a better rail for sending money around the world. So I think you're gonna continue to see more of that so. So what does that user interface that makes it really seamless to the user will be important.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Matteo Liebowitz<\/span><\/strong> Absolutely and the the on off ramp. Solutions that you you mentioned there. I feel like that is a particularly large opportunity for Jump specifically Jump trading as really there is a market making operations.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> yes I think so.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Peter thank you so much for coming on. We appreciate it. We appreciate your time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Peter Johnson<\/span><\/strong> Thank you guys. It's a lot of fun."," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Coinbase","content":"PERSON"},{"type":"June June","content":"DATE"},{"type":"May 20 19","content":"DATE"},{"type":"Lafayette","content":"LOCATION"},{"type":"Cyprus","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Jump Capital","content":"ORGANIZATION"},{"type":"Spotify","content":"LOCATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"spring","content":"DATE"},{"type":"20 percent","content":"PERCENT"},{"type":"0%","content":"PERCENT"},{"type":"Chaparro","content":"PERSON"},{"type":"Nelson Minier","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Nomura","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Open Finance","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"University of Illinois Urbana Champaign","content":"ORGANIZATION"},{"type":"Kraken","content":"LOCATION"},{"type":"Matteo Liebowitz<\/span><\/strong> Nash Nash","content":"PERSON"},{"type":"Johnson","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Trump","content":"PERSON"},{"type":"the University of Illinois Champaign","content":"ORGANIZATION"},{"type":"Trump","content":"LOCATION"},{"type":"Mike Bell","content":"PERSON"},{"type":"University of Illinois Urbana","content":"ORGANIZATION"},{"type":"Peter Johnson<\/span><\/strong> Thank","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"San Francisco","content":"LOCATION"},{"type":"2015","content":"DATE"},{"type":"University of Illinois","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"May of this year","content":"DATE"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Minnesota","content":"LOCATION"},{"type":"Matteo Liebowitz<\/span><\/strong> You","content":"ORGANIZATION"},{"type":"Madoff","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Chaparro<\/span><\/strong> Peter","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"Pete Johnson","content":"PERSON"},{"type":"Pete","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Matteo Liebowitz<\/span><\/strong> Sorry","content":"ORGANIZATION"},{"type":"Libra","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Peter Johnson","content":"PERSON"},{"type":"Lower Manhattan","content":"LOCATION"},{"type":"100 percent","content":"PERCENT"},{"type":"Chaparro<\/span><\/strong> BitGo","content":"PERSON"},{"type":"Matteo Liebowitz","content":"PERSON"},{"type":"Champaign","content":"LOCATION"},{"type":"V.C.","content":"ORGANIZATION"},{"type":"winter","content":"DATE"},{"type":"Liebowitz","content":"PERSON"},{"type":"OTC","content":"ORGANIZATION"},{"type":"Jump Trading","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"U.N.","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Chaparro<\/span><\/strong> Well","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","Matteo Leibowitz","The Block"]}