{"summary":"Co-CEO RJ Phillips described the new platform as &#x27;family friendly.&#x27;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148888\/former-onlyfans-execs-set-to-launch-influencer-nft-trading-card-app","publishDate":"2022-05-26T09:00:49","id":13359,"type":null,"title":"Former OnlyFans execs set to launch influencer NFT trading card app","category":["WEB3"],"content":["The former CEO of OnlyFans has a new web3 venture; a platform for trading digital playing cards of celebrities and influencers.&nbsp;","Known as Zoop, it will launch on Polygon in a move aimed at capitalizing on the booming creator economy.&nbsp;","Launching this summer, it will allow fans to collect non-fungible token (NFT) trading cards depicting their favorite influencers and celebrities. The company says this will foster a \"closer connection between fan and influencer.\"","It's unclear how closely involved the individuals on the cards will be in this project.&nbsp;","Fans can buy, sell and trade cards, as well as compete in competitions and challenges to gain points, unlocking special rewards including access to communities with similar interests.","\"In real life\" rewards will also be given as fans collect sets of cards – these may include free concert tickets from record labels or custom items from fashion brands.&nbsp;","The Zoop team will be led by co-CEOs Tim Stokely, a tech entrepreneur and founder of creator platform OnlyFans, and RJ Phillips, who was involved in the <span data-v-f87c67ca=\"\">growth of OnlyFans<\/span>. Stokely is known for building OnlyFans into a user-generated porn empire.&nbsp;","Phillips told The Block in an interview that the pair wanted to build Zoop on the blockchain because they want transactions to be \"<span data-v-f87c67ca=\"\">completely open and visible.\"<\/span>","\"You should be able to see <span data-v-f87c67ca=\"\">who bought what, and when cards were traded,\" he said.&nbsp;<\/span>","Phillips described the platform as \"family friendly,\" adding that the business model will differ from that of OnlyFans.&nbsp;","Initial drops on the platform will consist of 500 cards per influencer, which will be sold via Dutch auction. Once auctioned, subsequent drops will be dictated by demand. There is also a plan to launch a token, Phillips said.&nbsp;","As a precursor to its initial launch, the business is offering a limited number of pre-launch \"priority passes,\" which reward earlier adopters and give access to exclusive airdrops only for holders. Zoop plans to announce the first batch of celebrities to grace the platform next month.&nbsp;","<span data-v-f87c67ca=\"\">Users in the US, UK and Europe will be able to pay for cards in fiat, while the rest of the world will have access to the platform via stablecoins.&nbsp;&nbsp;<\/span>","Zoop follows a number of NFT trading card games into the sector. Sorare has already carved out a niche in the world of fantasy football and Gods Unchained dominates the fantasy trading card world.","Sorare currently has a market cap of <a href=\"https:\/\/nftgo.io\/collection\/sorare\/overview\" data-v-f87c67ca=\"\">$62.8 million<\/a>, according to data provider NFTgo, while Gods Unchained's trading volume has topped $54.6 million since its launch in March last year, <a href=\"https:\/\/immutascan.io\/address\/0xacb3c6a43d15b907e8433077b6d38ae40936fe2c?tab=1&amp;forSale=true\" data-v-f87c67ca=\"\">according to Immutascan<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"Zoop","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$62.8 million","content":"MONEY"},{"type":"Tim Stokely","content":"PERSON"},{"type":"March last year","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"RJ Phillips","content":"PERSON"},{"type":"$54.6 million","content":"MONEY"},{"type":"Phillips","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"summer","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}