{"summary":"The Information Commissioner&#x27;s Office said it will be making inquiries into OpenAI CEO Sam Altman&#x27;s project, Worldcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241282\/uk-data-protection-regulator-sam-altman-worldcoin","publishDate":"2023-07-25T07:24:02","id":13362,"type":null,"title":"UK data protection regulator looking into Sam Altman’s Worldcoin","category":["REGULATION"],"content":["UK data regulator The Information Commissioner’s Office is inquiring into the eyeball-scanning orb project Worldcoin — co-founded by OpenAI CEO Sam Altman — which launched its WLD token yesterday.","“We note the launch of Worldcoin in the UK and will be making inquiries,” a spokesperson for the ICO told The Block.","Worldcoin's launch raises questions about user data protection. Organizations must perform a Data Protection Impact Assessment if they are involved in processing high-risk biometric data, according to the ICO. Should the risks identified be too high to mitigate, consultation with the ICO becomes mandatory.&nbsp;","“Organizations must conduct a Data Protection Impact Assessment before starting any processing that is likely to result in high risk, such as processing special category biometric data. Where they identify high risks that they cannot mitigate, they must consult the ICO,” the regulator added.","Additionally, a clear lawful basis for personal data processing is required in the UK — with freely given consent being vital.","“Organizations also need to have a clear lawful basis to process personal data. Where they are relying on consent, this needs to be freely given and capable of being withdrawn without detriment,” the ICO said.","Worldcoin said it complies with local laws, including Europe’s General Data Protection Regulation incorporated into UK law following Brexit.&nbsp;","“The Worldcoin Foundation, and its contributor Tools for Humanity, adhere to the strictest privacy guidelines and requirements in the markets where Worldcoin is available and in select communities we are continuing to assess local laws and regulations to ensure compliance,” Worldcoin told The Block.&nbsp;&nbsp;","“With regard to GDPR, Worldcoin is fully compliant with all laws and regulations governing biometric data collection and data transfer, including Europe’s General Data Protection Regulation. In the European Union, Tools for Humanity is under the supervision of the Bavarian State Office for Data Protection Supervision,” it added.","According to Worldcoin’s website FAQs, “Worldcoin never collects any biometric data from any user without that user’s explicit consent.”&nbsp;The page also states that no personal data needs to be shared for a user to download its World App, and any personal data shared with Worldcoin is encrypted in transit and at rest.","“Individuals who want to receive a World ID are not required to share their name, phone number, email address or home address,” the page states.","“Images collected by the orb are used to generate a unique iris code. By default, these images are immediately deleted once the iris code is created, unless the user opts into data custody,” the project says. “Opting into data custody will decrease the probability and frequency of the user’s need to reverify their World ID as the iris code algorithms change. The World ID sign-up process is only intended to verify an individual’s uniqueness,” it added.","“Worldcoin users may choose to share additional data, but this is never required. Importantly, the Worldcoin Foundation and its initial contributor Tools for Humanity do not, and never will, sell anyone’s personal data, including biometric data,” the page adds.","Worldcoin <a href=\"https:\/\/www.theblock.co\/post\/241074\/sam-altman-worldcoin-launches-token\" data-v-f87c67ca=\"\">launched<\/a> its WLD token yesterday, which will be distributed to over two million people globally who have verified their identities via the iris-scanning orbs. The project aims to enable people to prove their identities online with credentials verified in person but has faced criticism over its “<a href=\"https:\/\/twitter.com\/evilcos\/status\/1683484789674844167?s=20\" data-v-f87c67ca=\"\">evil creation<\/a>” and “<a href=\"https:\/\/twitter.com\/zachxbt\/status\/1683512389105229825?s=20\" data-v-f87c67ca=\"\">exploitation<\/a>.”","Ethereum co-founder Vitalik Buterin also <a href=\"https:\/\/www.theblock.co\/post\/241088\/vitalik-buterin-four-major-risks-worldcoin\" data-v-f87c67ca=\"\">outlined<\/a> “four major risks” with Worldcoin following the token launch: privacy, accessibility, centralization and security.","Worldcoin’s main developer, Tools For Humanity, plans to deploy orbs in over 35 cities across 20 countries to accelerate user sign-ups and increase the number of orbs from 200 to around 1,500 by the end of the year.","Those verified by an orb will initially receive 25 WLD tokens and periodic grants going forward. Additionally, tokens can be reserved on the World App until users can visit an orb. However, Worldcoin has been careful to stress that the tokens will not be available in the U.S.","The token launch follows Worldcoin's migration to the OP Mainnet, an Ethereum Layer 2 scaling solution, last week. It will distribute a total supply of 10 billion WLD tokens, with 80% reserved for users, operators and the ecosystem. The remaining 20% is set aside for the Worldcoin team and its backers, according to an <a href=\"https:\/\/www.theblock.co\/post\/241074\/sam-altman-worldcoin-launches-token\" data-v-f87c67ca=\"\">investor deck<\/a>.","The WLD token initially surged <a href=\"https:\/\/www.theblock.co\/post\/241081\/worldcoins-wld-token-surges-88-after-listing-on-multiple-exchanges\" data-v-f87c67ca=\"\">88%<\/a> on launch, following exchange listings from Binance, Huobi, Bybit and OKX. It reached $3.14 before falling back. WLD currently trades at <a href=\"https:\/\/www.coingecko.com\/en\/coins\/worldcoin\" data-v-f87c67ca=\"\">$2.13<\/a>, according to CoinGecko data.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bavarian State Office for Data Protection Supervision","content":"ORGANIZATION"},{"type":"Binance","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"General Data Protection Regulation","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"The Information Commissioner’s Office","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"88%","content":"PERCENT"},{"type":"European Union, Tools for Humanity","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"ICO","content":"ORGANIZATION"},{"type":"GDPR","content":"ORGANIZATION"},{"type":"$3.14","content":"MONEY"},{"type":"$2.13","content":"MONEY"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"The Worldcoin Foundation","content":"ORGANIZATION"},{"type":"Huobi","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":[],"authors":["James Hunt","The Block"]}