{"summary":"Polygon zkEVM&#x27;s Jordi Baylina forecasts a significant increase in data capacity for Ethereum rollups post-EIP-4844.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279461\/polygon-zkevm-prepares-for-ethereums-dencun-upgrade-eyes-major-fee-reductions-with-eip-4844","publishDate":"2024-02-28T01:07:05","id":13376,"type":null,"title":"Polygon zkEVM prepares for Ethereum’s Dencun upgrade, eyes major fee reductions with EIP-4844","category":["CRYPTO ECOSYSTEMS"],"content":["The upcoming <a href=\"https:\/\/www.theblock.co\/post\/276747\/dencun-upgrade-expected-on-march-13-to-bring-blobs-to-ethereum-mainnet\" data-v-f87c67ca=\"\">Dencun upgrade<\/a> on Ethereum, expected to occur in mid-March, is poised to bring about a big improvement in the form of “proto-danksharding” through <a href=\"https:\/\/www.theblock.co\/post\/189829\/ethereum-core-developers-signal-support-for-proto-danksharding\" data-v-f87c67ca=\"\">EIP-4844<\/a>.","Dencun aims to facilitate the inclusion of off-chain ‘data blobs’ in Ethereum transactions, a move that is designed to allow for the incorporation of additional data without compromising block processing times. This upgrade is viewed as a pivotal development for boosting the scalability of Layer 2 solutions on the network by providing them with <a href=\"https:\/\/www.theblock.co\/post\/275767\/zksync-eyes-lower-fees-bigger-batches-after-ethereums-dencun-upgrade?utm_source=linkedin&amp;utm_medium=social\" data-v-f87c67ca=\"\">expanded data capacity<\/a>.","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Polygon <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248360\/polygon-matic-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/matic-token-icon.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">MATIC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.35%\n    <\/span><\/a> <!----><\/span><\/span> developers are keenly anticipating the impact of EIP-4844 on gas fees within the <\/span><a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">Polygon zkEVM<\/a> ecosystem, suggesting that the upgrade could lead to improved data availability for Layer 2 solutions in a cost-efficient manner.","Polygon is a suite of scaling solutions allowing developers to create decentralized applications with low transaction fees. To enhance scalability of Ethereum-based apps, Polygon employs two scaling techniques: a sidechain named Polygon PoS and a zero-knowledge (ZK) rollup network known as Polygon zkEVM.&nbsp;","zkEVM is the one that would particularly benefit from Dencun. Its&nbsp;co-founder and technical lead Jordi Baylina shared insights on the current challenges faced by ZK rollups (such as zkEVM), primarily centered on the cost of data availability. “The main challenge for ZK rollups right now is the cost of data availability,” Baylina stated, underscoring the significance of EIP-4844 in potentially reshaping the capacity and gas fees landscape on Polygon zkEVM.","He further predicted a “threefold increase in Ethereum’s total data availability capacity” following the implementation of EIP-4844 within the Dencun upgrade that would tremendously help ZK rollups, including Polygon zkEVM and others like Linea, Scroll, and zkSync. Baylina also provided projections on cost reductions, estimating “a potential cost reduction ranging from 10x to 50x when combining EIP-4844 with data compression,” while also noting that “the actual savings will depend on various factors.”","Addressing the technical preparations for the upgrade, Baylina highlighted that while the transition to Dencun might be more straightforward for optimistic rollups (such as Optimism and Arbitrum), the integration of EIP-4844 into Polygon zkEVM, which utilizes ZK rollup technology, requires specific technical modifications. “ZK rollups are at a slight disadvantage compared to optimistic rollups because they must incorporate BLS pairings within their proofs,” he explained. This necessitates a precompiled smart contract for these cryptographic pairings, which was introduced in the Etrog hard fork of Polygon zkEVM in February.","Looking ahead to the full integration of EIP-4844, Baylina noted the necessity of a new proof system on zkEVM that supports data compression in order to optimize the benefits of EIP-4844 for Polygon zkEVM. “A new proof system is necessary, one that will facilitate data compression,” he said, indicating that work is ongoing to develop such a system.","Baylina added that efforts are being diligently pursued to ensure that all necessary components are aligned with the activation of the Dencun hard fork on the mainnet.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BLS","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"+1.35%","content":"PERCENT"},{"type":"Linea","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Polygon zkEVM","content":"ORGANIZATION"},{"type":"Baylina","content":"PERSON"},{"type":"Baylina","content":"LOCATION"},{"type":"Dencun","content":"LOCATION"},{"type":"Jordi Baylina","content":"PERSON"},{"type":"Scroll","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["POLYGON","ROLLUPS","ZKEVM"],"authors":["Vishal Chawla","The Block"]}