{"summary":"Listen to the audio heard in court of Caroline Ellison telling her employees that SBF decided to use FTX customer funds to repay loans.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/256244\/inside-sbfs-trial-listen-to-audio-from-alamedas-all-hands-meeting-amid-collapse","publishDate":"2023-10-13T13:32:40","id":13374,"type":null,"title":"NEW from SBF&#x27;s trial: Listen to audio from Alameda&#x27;s all-hands meeting amid collapse","category":["COMPANIES"],"content":["On Nov. 8, 2022, as the FTX <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">crisis unfolded<\/a>, sister trading firm Alameda Research CEO Caroline Ellison gathered around fifteen employees for an all-hands meeting in the Hong Kong office. It was around 11 p.m. local time, about 24 hours after an announcement by Sam Bankman-Fried, FTX's CEO at the time, that he would be selling the company to Binance and its CEO Changpeng \"CZ\" Zhao, his longtime rival. Around ten to fifteen more employees joined the meeting via teleconference in the Bahamas, where it was 10 a.m.&nbsp;","In the meeting, seemingly unburdened by the prospect of CZ's bailout, Ellison told her employees exactly what, in her view, went wrong: Alameda had borrowed large amounts of capital via open-term loans from third-party lenders in order to buy out Binance's original equity stake in FTX and make a series of illiquid venture investments. When those loans were called following the crypto market downturn in May 2022, they borrowed from FTX customers in order to repay their lenders, causing the shortfall in deposits. When asked who decided that borrowed customer funds be used to repay the loans, Ellison responded, \"Sam, I guess.\"&nbsp;","Unknown to Ellison, the meeting was being recorded. Though the existence of the recording has been known since <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.204.0.pdf\" data-v-f87c67ca=\"\">a court filing<\/a> in August, clips from the recording of the meeting were played in court yesterday for the first time. They were made available to The Block by the United States Attorney's Office for the Southern District of New York.","<audio class=\"wp-audio-shortcode\" id=\"audio-21483-13\" preload=\"none\" controls=\"controls\" data-v-f87c67ca=\"\"><source type=\"audio\/mpeg\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipA.mp3?_=13\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipA.mp3\" data-v-f87c67ca=\"\">https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipA.mp3<\/a><\/audio>","Transcript:&nbsp;","CAROLINE ELLISON: Okay, let's get started, I guess. We have a bunch of people. Yeah, I guess I'll just start by saying some stuff. And then you guys can feel free to ask questions. Um...Yeah. So I guess you guys have probably seen a lot of what's happening on, I don't know, Slack and Twitter. But I can just, like, start by giving a general overview of the situation. I mean, the basic story here is that starting last year, Alameda was kind of borrowing a bunch of money via open-term loans and use that to make various illiquid investments.","So, like, a bunch of FIX and FTX US equity. A bunch of like other ventures, investments, et cetera. Then with crypto being down, the crash, the -- like, credit crunch this year, most of Alameda's loans got called. And in order to, like, meet those loan recalls, we ended up like borrowing a bunch of funds on FTX which led to FTX having a shortfall in user funds. And so, with the -- once there started being, like FUD about this and users started withdrawing funds, they kind of eventually were realizing that they were unable to -- not going to be able to meet, like, the continued withdrawal pressure.","<audio class=\"wp-audio-shortcode\" id=\"audio-21483-14\" preload=\"none\" controls=\"controls\" data-v-f87c67ca=\"\"><source type=\"audio\/mpeg\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipB.mp3?_=14\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipB.mp3\" data-v-f87c67ca=\"\">https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipB.mp3<\/a><\/audio>","CHRISTIAN DRAPPI: Was there, like, a plan to eventually, pay, the -- suppose this didn't happen. Right. Like -- was there in the road map of, like, oh, when are we gonna actually, like, try to, like, pay this back and, like, make FIX, like, users not fucked if this didn't happen.","CAROLINE ELLISON: Um-hum.","DRAPPI: Or like -- was this, like, a --","ELLISON: Yeah.","DRAPPI: Whatever kind of thing.","ELLISON: I think -- yeah, basically, FIX was trying to raise in order to do this. But yeah, after the crash, no one wanted to invest and I don't know. I guess there's, like, a question of, like, should you try raising, like, a big -- like, a -- you know, steeply, like, discounted valuation or would that, just, you know, make people freak out more or something. I don't know. Obviously, with respect to the plan of wait around for several months and, like -- for the market environment to get better and then raise did not work out.","<audio class=\"wp-audio-shortcode\" id=\"audio-21483-15\" preload=\"none\" controls=\"controls\" data-v-f87c67ca=\"\"><source type=\"audio\/mpeg\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipC.mp3?_=15\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipC.mp3\" data-v-f87c67ca=\"\">https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipC.mp3<\/a><\/audio>","CHRISTIAN DRAPPI: So the biggest factor is effectively the loan we have in FIX.","CAROLINE ELLISON: Yeah.","DRAPPI: And was that collateralized by -- was that, like, basically officially done through the spot margin book or was there some, like, extra thing that kinda powered that?","ELLISON: Uh --","DRAPPI: Because I feel like - -","ELLISON:","It was -- yeah, it was not through the normal spot margin.","DRAPPI: Oh. That seems pretty bad.","<audio class=\"wp-audio-shortcode\" id=\"audio-21483-16\" preload=\"none\" controls=\"controls\" data-v-f87c67ca=\"\"><source type=\"audio\/mpeg\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipD.mp3?_=16\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipD.mp3\" data-v-f87c67ca=\"\">https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipD.mp3<\/a><\/audio>","ADITYA BARADWAJ: What's the reason that we were not able to return the loan to FTX? Like had we -- is that, like, except for trading and we lost money on it or --","CAROLINE ELLISON: Basically, the loan from FTX is used to, like, repay our other loans. And those were like used mostly to buy sort of illiquid assets.","DAVID NYESTE: What were, like, the biggest items that (unintelligible), the biggest illiquid investments?","ELLISON: What did you say?","NYESTE: What were the biggest illiquid investments that we made? I know that if you answer this question it's going to give us an idea for what the hole is.","ELLISON: Yeah, I mean, I think, like, FTX equity there was like the FTX equity that we bought back from Binance and then also","Unidentified Male: That was 2.1 bil, right?","ELLISON: Yeah, and then also some other FTX equity, that was, like, another billion or something maybe. And then -- yeah, GDA, which is this mining company; Anthropic, which is an AI lab; K-5, which is like people who talk to celebrities.","TONY OIAN: How much were--how much does all this cost?","ELLISON: GDA is a billion, Anthropic is 500, K-5 is 300. I think--","DRAPPI: Voyager, BlockFi, as well?","ELLISON: BlockFi was, like, almost nothing.","DRAPPI: Voyager?","ELLISON: Oh yeah, Voyager was, like, probably 100 or 200.","<audio class=\"wp-audio-shortcode\" id=\"audio-21483-17\" preload=\"none\" controls=\"controls\" data-v-f87c67ca=\"\"><source type=\"audio\/mpeg\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipE.mp3?_=17\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipE.mp3\" data-v-f87c67ca=\"\">https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipE.mp3<\/a><\/audio>","CHRISTIAN DRAPPI: Who else was, like, aware of this? I mean, I'm guessing you and Sam certainly were. Like, I'm guessing probably very few people.","CAROLINE ELLISON: Yeah, I don't -- yeah, I'm not even sure if I know exactly who was aware. I mean, I sort of say, like, to some extent you can, like, you could piece it together if you, like, looked at like, pointer or looked at like some spreadsheets for a bit or something. So it's sort of possible for a lot of people to be aware of it, but I guess that most people weren't.","DRAPPI: I mean, like, more like explicitly aware. As in told, like, this is what we're doing in terms of, like, meetings that were had. I'm sure, like, this wasn't just like a YOLO thing, right? Like, you know --","ELLISON: Yeah, I mean, I guess I talked about it with, like, Sam, Nishad, and Gary, I think.","<audio class=\"wp-audio-shortcode\" id=\"audio-21483-18\" preload=\"none\" controls=\"controls\" data-v-f87c67ca=\"\"><source type=\"audio\/mpeg\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipF.mp3?_=18\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipF.mp3\" data-v-f87c67ca=\"\">https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ClipF.mp3<\/a><\/audio>","DIANA MA: Who made the decision on using user deposits?","CAROLINE ELLISON: Um...Sam, I guess.","MA: And when was it, like first touched?","ELLISON: I think, like, FTX, like, basically always allowed Alameda to, like, borrow user funds, as far as I know.","MA: Just Alameda?","ELLISON: Yeah.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Nov. 8, 2022","content":"DATE"},{"type":"\" Zhao","content":"PERSON"},{"type":"FUD","content":"ORGANIZATION"},{"type":"5","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"11 p.m. local time","content":"TIME"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"the Bahamas","content":"LOCATION"},{"type":"GDA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10 a.m.","content":"TIME"},{"type":"bil","content":"ORGANIZATION"},{"type":"United States Attorney","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nishad","content":"ORGANIZATION"},{"type":"Gary","content":"PERSON"},{"type":"ELLISON","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"CAROLINE ELLISON","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","The Block"]}