{"summary":"The blockchain and cryptocurrency ecosystem is the first time that I’ve ever participated fully in a “frontier tech” market — and my goodness is it","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1265\/frontier-tech-and-blockchain-crypto","publishDate":"2018-10-06T06:11:17","id":13384,"type":null,"title":"Blockchain is a &#x27;frontier tech,&#x27; and that&#x27;s why success in crypto requires a radically different mindset","category":["CRYPTOCURRENCY"],"content":["The blockchain and cryptocurrency ecosystem is the first time that I’ve ever participated fully in a “frontier tech” market — and my goodness is it eye-opening. Due to the opportunity and risk of frontier tech, the people, strategies, norms and structures are completely different than a traditional tech market. Matt Turck of FirstMark Capital had a great description of&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"http:\/\/mattturck.com\/frontiertech\/\" target=\"_blank\" rel=\"noopener nofollow noreferrer\" data-href=\"http:\/\/mattturck.com\/frontiertech\/\" data-v-f87c67ca=\"\">“frontier tech” in 2016<\/a>:","<span class=\"markup--quote markup--blockquote-quote is-other\" data-creator-ids=\"b0f9b289d536\" data-v-f87c67ca=\"\"><em class=\"markup--em markup--blockquote-em\" data-v-f87c67ca=\"\">I love the term “frontier” because it beautifully captures the opportunities and perils involved. It sounds like a wide-open opportunity, adventurous, perhaps even romantic. But it’s also a place where you have a non-trivial chance of ending flat on your face with a bunch of arrows in your back.<\/em><\/span>","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"dc5f49b3b353\" data-v-f87c67ca=\"\">Through this lens,&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-me is-other\" data-creator-ids=\"dc5f49b3b353 56f89f949263 a9a6bfbbb0a4\" data-v-f87c67ca=\"\">Facebook, Google, Amazon and Apple are the new Stanford, Harvard, Yale and Princeton. Cut your teeth at a sure thing, engage in business with a genteel crowd, exchange ideas in a safe and protected space with norms galore, do your two years or four years, then enter the real world with your post-grad credential. It’s a wonderful existence, one that I myself enjoyed, but it doesn’t bring the fear, excitement, glory or failure that frontier tech brings.<\/span>","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"b0f9b289d536\" data-v-f87c67ca=\"\">In today’s world, established tech markets are the colonies under the auspice of Big Tech: communications, information, e-commerce, consumer services and the like.<\/span>&nbsp;Growth is assured in many markets — and it is a matter of how the spoils it will be divided. In other markets, saturation is complete and it is simply a matter of which empires will evolve and which will be forgotten in 20 years.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"4e09a5028372\" data-v-f87c67ca=\"\">The frontier is where nearly everything is yet to be discovered, where one market may reveal a territory rich with spoils and one may reveal a market of ghost towns and tumbleweed. As a result, everything is different in frontier tech.<\/span>","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"b0f9b289d536 b42e2d1a4c23 53af68821aec da98760ebfa9 68e39de05af a9a6bfbbb0a4 anon\" data-v-f87c67ca=\"\">The people in frontier tech are different. They behave as if they’re in the Wild West — in competition with everyone, including other true believers.<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"b42e2d1a4c23 53af68821aec da98760ebfa9 68e39de05af a9a6bfbbb0a4 anon\" data-v-f87c67ca=\"\">&nbsp;Few true believers share the same vision, the same “religion”, the same belief system. All can see something better — but it is impossible to translate fully what is in one’s mind to another’s mind. What is certain to one is uncertain to another. The path looks different to each. And while there is a glorious outcome in the future, it has infinite forms.<\/span>&nbsp;There is the Bitcoin maximalist tribe, the Ethereum disciples, the security token believers and the enterprise blockchain evangelists.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"26c75f0fc3fd 2a3570f40e1c\" data-v-f87c67ca=\"\">Each believes in their own purity of purpose of intentions, while many show skepticism at the purity and purpose of others who don’t think the same way. This is because they all “believe”: it is an ecosystem where the missionaries far outweigh the mercenaries.<\/span>&nbsp;The fraudsters and scammers are quickly exposed — and they are mercilessly hounded, attacked and shamed by those who believe they have clarity of purpose. It is not an arena for the faint of heart, the half-committed or the non-believer. It is not an arena for the unprepared.","The strategies in frontier tech are different.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"e7c36ee7f624\" data-v-f87c67ca=\"\">The most valuable creations to date in blockchain and crypto are open source even if the initial teams horde large quantities of the expected return in the form of founder tokens.<\/span>&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"9d4d50f8260a\" data-v-f87c67ca=\"\">Whereas cloning is frowned upon in established tech, it is openly embraced in the blockchain ecosystem.&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"9d4d50f8260a c85c6404c0f9 4e09a5028372\" data-v-f87c67ca=\"\">Whereas evolution is rewarded in established tech, revolution is rewarded in the blockchain ecosystem; incremental thinking and building is exceedingly rare — and tends to result in failure<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"9d4d50f8260a\" data-v-f87c67ca=\"\">.&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"9d4d50f8260a dc5f49b3b353\" data-v-f87c67ca=\"\">Whereas walled gardens and centralization is rewarded in established tech, decentralization and trust by design is rewarded in the blockchain ecosystem.<\/span>","The norms of behavior in frontier tech are different. A blockchain \/ crypto Telegram group chat can turn into a gladiatorial battle of mind, evidence, wit, and will.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"b0f9b289d536\" data-v-f87c67ca=\"\">The arguments are more personal, more intense, more passionate. One can feel the passion, fury, energy, and exuberance of their intellectual friend or foe. The conversations continue for hours.&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"b0f9b289d536 2a3570f40e1c\" data-v-f87c67ca=\"\">The participants are exceedingly well studied — and bring varied backgrounds.<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"2a3570f40e1c\" data-v-f87c67ca=\"\">&nbsp;At times, an economic or money theory background gives one the upper hand, at other times a network security background gives one the upper hand. But in all cases, a well informed and studied argument gives one the upper hand.<\/span>&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"da98760ebfa9\" data-v-f87c67ca=\"\">The arguments happen in front of hundreds of others — for the benefit of all.<\/span>&nbsp;The participants are unafraid to express their deepest skepticism, to speak in absolutes, to condemn and to applaud to the extreme. It is unusual for one to change their mind in the heat of debate but not unusual for one to change their mind in the face of changed conditions: the introduction of new technology or the movement of 24\/7 markets. And in the end, that which feels personal in the moment is quickly forgotten as the next idea or concept comes to the forefront of the individual or collective mind.","Business formation is different in frontier tech. Blockchain \/ crypto investments look more like “bets”, premised on teams, ideas and reputations than on early results. The sums of money involved are staggering and the nature of the money (tokens with generally fewer governance rights and claims on assets) is looser.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"65629d68a395\" data-v-f87c67ca=\"\">The returns can come fast and furious, just as the losses can.&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"65629d68a395 c85c6404c0f9\" data-v-f87c67ca=\"\">It is a boom &amp; bust world — and that is before the technology has even come close to changing most people’s lives in any meaningful way<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"65629d68a395\" data-v-f87c67ca=\"\">. It is unclear if the peak in front is the highest or if there are 10 larger ones to come.&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"65629d68a395 c85c6404c0f9\" data-v-f87c67ca=\"\">As for the work itself, people would generally prefer to refer to their work as projects rather than companies.<\/span>","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"4e09a5028372 b0f9b289d536 c85c6404c0f9\" data-v-f87c67ca=\"\">As a result, frontier tech is for the individual.&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"4e09a5028372 b0f9b289d536 c85c6404c0f9 dc5f49b3b353\" data-v-f87c67ca=\"\">One’s gender, age, race, degree and resume mean far less than one’s ideas, output, actions, and moral compass<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"b0f9b289d536 c85c6404c0f9 dc5f49b3b353\" data-v-f87c67ca=\"\">.<\/span><span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"c85c6404c0f9 dc5f49b3b353\" data-v-f87c67ca=\"\">&nbsp;<\/span><span class=\"markup--quote markup--p-quote is-me is-other\" data-creator-ids=\"c85c6404c0f9 dc5f49b3b353 da98760ebfa9 53af68821aec 56f89f949263\" data-v-f87c67ca=\"\">The hierarchy and political structures of traditional technology companies and markets don’t exist in the blockchain and cryptocurrency ecosystem.<\/span><span class=\"markup--quote markup--p-quote is-me is-other\" data-creator-ids=\"c85c6404c0f9 53af68821aec 56f89f949263\" data-v-f87c67ca=\"\">&nbsp;Individuals are far more fluid, moving from project to project, staking their reputation on one thing today and another tomorrow — all with absolute conviction<\/span><span class=\"markup--quote markup--p-quote is-me is-other\" data-creator-ids=\"53af68821aec 56f89f949263\" data-v-f87c67ca=\"\">.<\/span>&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"65629d68a395\" data-v-f87c67ca=\"\">It takes only months to go from the bottom to the top. It takes only months to go from the top to jail. And from jail back to the top.<\/span>There are massive risks and there are massive rewards.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"c85c6404c0f9\" data-v-f87c67ca=\"\">Everything is certain, yet everything is uncertain<\/span>. It is, after all, the frontier.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FirstMark Capital","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Matt Turck","content":"PERSON"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Facebook","content":"LOCATION"},{"type":"Princeton","content":"LOCATION"},{"type":"\/ crypto Telegram","content":"ORGANIZATION"},{"type":"Harvard, Yale","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Dudas","The Block"]}