{"summary":"Ethereum Developers are in the midst of running tests on the next network update that will introduce staking withdrawals.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212636\/latest-round-of-ethereum-shapella-testnet-development-reveals-a-few-bugs","publishDate":"2023-02-16T14:44:38","id":13389,"type":null,"title":"Latest round of Ethereum Shapella testnet development reveals a few bugs","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Testing on Ethereum's Zhejiang testnet ahead of the Shanghai-Capella update revealed some bugs, but nothing that will affect the timeline for the introduction of staking to the network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Developer Marius VanDerWijden <\/span><a href=\"https:\/\/twitter.com\/vdWijden\/status\/1626170347815944192\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">documented<\/span><\/a><span data-v-f87c67ca=\"\"> a syncing bug encountered by other clients that developers are confident can be patched, according to a thread from the Ethereum Foundation's Tim Beiko. The bug won’t affect any established timelines for the proposed upgrade set for the Sepolia testnet scheduled for Feb. 28, he noted.<\/span>","<span data-v-f87c67ca=\"\">The latest withdrawal devnet update detailed a stress test consisting of 600,000 validators, 360,000 of which performed withdrawal credential updates at the time of the fork. Client spikes in RAM and CPU occurred and developers will gauge the number of lost versus recorded credential update messages over the coming days, said Beiko.<\/span>","<span data-v-f87c67ca=\"\">The stress test also revealed a bug between a proof-of-stake client, Prysm, and the Besu client which is designed for permissioned use cases. To sync properly, Prysm client expects a certain number of responses; however, Besu imposes response limitations that bring it below the necessary syncing threshold, Beiko said. The Besu team is looking into the matter.<\/span>","<span data-v-f87c67ca=\"\">After a discussion on how to best optimize initial client orientation, developers ultimately <\/span><a href=\"https:\/\/twitter.com\/TimBeiko\/status\/1626264630581694464?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">decided<\/span><\/a><span data-v-f87c67ca=\"\"> to completely ban blobless 4844 transactions, which would change client assumptions around the transactions and could complicate setup.<\/span>","<span data-v-f87c67ca=\"\">Developers also discussed how to move ahead with the deprecation of the SELFDESTRUCT keyword, which terminates a contract, removes the contract’s bytecode from the blockchain, and reroutes funds on the contact to a specified address.<\/span>","<span data-v-f87c67ca=\"\">While the path forward remains unclear, there are three current proposals on the subject in discussion as developers seek to find “deactivating options that don't break things,” Beiko said.<\/span>","<span data-v-f87c67ca=\"\">“The challenge here is it opens up a nasty attack vector: deploy a contract, fill storage in a certain way, and when you redeploy the contract, the old storage is still there, and could be accessed in malicious ways,” Beiko said.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"CPU","content":"ORGANIZATION"},{"type":"4844","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Marius VanDerWijden","content":"PERSON"},{"type":"Besu","content":"LOCATION"},{"type":"Feb. 28","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"RAM","content":"ORGANIZATION"},{"type":"Beiko","content":"PERSON"},{"type":"Shanghai","content":"LOCATION"},{"type":"Zhejiang","content":"LOCATION"}],"hashtag":["ETHEREUM"],"authors":["Jeremy Nation","The Block"]}