{"summary":"Here&#x27;s what we learned about FTX and Alameda from the SEC&#x27;s charges against former CEO Sam Bankman-Fried.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194526\/for-sbf-and-ftx-the-fraud-started-from-day-one-that-and-other-revelations-from-the-sec","publishDate":"2022-12-13T09:52:55","id":13383,"type":null,"title":"For SBF and FTX, the fraud started from day one. That and other revelations from the SEC","category":["COMPANIES"],"content":["Sam Bankman-Fried was charged with fraud by the U.S. Securities and Exchange Commission over the collapse of FTX, the crypto exchange he founded.&nbsp;","The former CEO was accused of \"orchestrating a scheme to defraud equity investors in FTX Trading Ltd.,\" according to an SEC <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2022-219\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">statement<\/a>. Bankman-Fried was arrested in the Bahamas yesterday, just one day before he was scheduled to testify virtually before the U.S. House Financial Services Committee for its first hearing on the collapse of the company.","“We allege that Sam Bankman-Fried built a house of cards on a foundation of deception while telling investors that it was one of the safest buildings in crypto,\" wrote SEC Chair Gary Gensler. \"The alleged fraud committed by Mr. Bankman-Fried is a clarion call to crypto platforms that they need to come into compliance with our laws.”","The SEC is charging Bankman-Fried with violating the anti-fraud provisions of the Securities Act of 1933 and the Securities Exchange Act of 1934.&nbsp;","Here are eight things we learnt about the way FTX conducted business from the SEC complaint filed today.","One of the biggest claims was that this was a fraud from the start. The SEC allege that Bankman-Fried had always improperly diverted FTX customer assets to his majority controlled hedge fund Alameda Research, and hid that information from FTX equity investors.","The SEC allege that Bankman-Fried told investors that its sister company Alameda Research was \"just another platform with no special privileges.\"","\"In truth, Bankman-Fried had exempted Alameda from the risk mitigation measures and had provided Alameda with significant special treatment on the FTX platform, including a virtually unlimited 'line of credit' funded by the platform’s customers,\" the complaint said.","Some of the bank accounts that received customer funds were not in Alameda's name but were still, in fact, Alameda's subsidiaries, the SEC allege.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAn example provided is North Dimension, which did not disclose any connection to Alameda.","\"Bankman-Fried directed FTX to have customers send funds to North Dimension in an effort to hide the fact that the funds were being sent to an account controlled by Alameda,\" the complaint said.","Alameda's multi-billion dollar liability with the exchange was stored in an internal account in the FTX database as <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"0c6a656d784c6a7874226f6361\">[email&nbsp;protected]<\/a>.","\"Characterizing the amount of customer funds sent to Alameda as an internal FTX account had the effect of concealing Alameda’s liability in FTX’s internal systems,\" the complaint said.","Alameda was not required to pay interest on the liability, according to the complaint.","In 2022, FTX started trying to separate out Alameda's portion of the liability in the \"<a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"15737c74615573616d3b767a78\">[email&nbsp;protected]<\/a>\" which meant separating out the Alameda-controlled bank accounts from deposits sent to FTX controlled bank accounts, the SEC allege.","The SEC cites numerous pieces of evidence that show Bankman-Fried touting FTX's superior risk management engine, including to&nbsp; the U.S. House of Representatives Committee on Financial Services and to the the Commodity Futures Trading Commission.","\"These statements were materially false and misleading because of a critical omission: Bankman-Fried did not reveal that the automatic risk engine did not apply to the accounts of its most important customer—Alameda,\" the SEC complaint said.","Bankman-Fried and top executives Gary Wang and Nishad Singh borrowed close to $2.2 billion from commingled funds at Alameda. Some of the money was used to purchase Bahamian real estate and make political donations in the U.S. Some of those loans were in mid-2022 when FTX was already in a precarious financial position, the SEC allege.","The loans were often poorly documented and at times not documented at all, the SEC allege.","\"Neither the fact of the loans and purchases, nor the poor documentation of significant company liabilities and expenditures, was disclosed to investors,\" the complaint said.","The SEC allege that Alameda was able to maintain a negative balance in its customer account at FTX.","\"Bankman-Fried directed software code to be written in or around August 2019, and updated in or around May 2020, that ultimately allowed Alameda to maintain a negative balance in its account, untethered from any collateral requirements,\" the complaint said. \"No other customer account at FTX was permitted to maintain a negative balance.\"","FTX told investors that its investments did not involve the assets of FTX or its customers, the complaint said.","\"Contrary to that representation, two $100 million investments made by FTX’s affiliated investment vehicle, FTX Ventures Ltd., were funded with FTX customer funds that had been diverted to Alameda.\"","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.2 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"FTX Trading Ltd.","content":"ORGANIZATION"},{"type":"U.S. House Financial Services Committee","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Nishad Singh","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"May 2020","content":"DATE"},{"type":"U.S. House of Representatives Committee on Financial Services","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1934","content":"DATE"},{"type":"North Dimension","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"1933","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"Securities Exchange","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"FTX Ventures Ltd.","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"August 2019","content":"DATE"}],"hashtag":["FTX","HOUSE FINANCIAL SERVICES COMMITTEE"],"authors":["Kari McMahon","Benjamin Robertson","The Block"]}