{"summary":"Fantom has deployed an automated smart contract monitoring system called Watchdog to strengthen security on its blockchain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180362\/fantom-implements-watchdog-to-automatically-detect-smart-contract-bugs","publishDate":"2022-10-27T09:00:46","id":13395,"type":null,"title":"Fantom to automatically detect smart contract bugs with Watchdog","category":["BLOCKCHAIN"],"content":["<span data-v-f87c67ca=\"\">Fantom has deployed an automated smart contract monitoring system called Watchdog, to strengthen the security of decentralized apps on its blockchain.<\/span>","<span data-v-f87c67ca=\"\">Developed in partnership with blockchain security firm Debaub, Watchdog will automatically look for buggy code in smart contracts that could become the root cause of security attacks, Fantom Foundation said in an announcement. It will be particularly focused on attacks plaguing decentralized finance (DeFi) apps.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“We’re incredibly excited to bring a new level of safety and security to the ecosystem with Watchdog,” said Michael Kong, chief executive officer at Fantom Foundation. “Developers require access to cost-effective, efficient, and trustworthy smart contract auditing tools. Watchdog delivers just that, and will set a new standard for security.”<\/span>","<span data-v-f87c67ca=\"\">Fantom Foundation said Watchdog will automatically scan for issues across smart contracts in the Fantom ecosystem. Should a vulnerability be detected, security firm Dedaub will notify the project, and assist them in analyzing the risks and support the project team in fixing the vulnerability in time.<\/span>","<span data-v-f87c67ca=\"\">The automatic analysis of smart contract logic may not necessarily guarantee protection against attacks as some complex bugs may go undetected. For this reason, Watchdog is aimed at supplementing expensive third-party audits, rather than fully replacing them.&nbsp;<\/span>","Even though the DeFi industry has experienced strong growth since 2020, it has seen a corresponding jump in security attacks. The first quarter of 2022 saw <a href=\"https:\/\/www.ic3.gov\/Media\/Y2022\/PSA220829\" data-v-f87c67ca=\"\">$1.3 billion<\/a> worth of cryptocurrency stolen, 97% of which was stolen from DeFi apps, according to data from the Federal Bureau of Investigation (FBI).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"Watchdog","content":"ORGANIZATION"},{"type":"Michael Kong","content":"PERSON"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Dedaub","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Debaub, Watchdog","content":"ORGANIZATION"},{"type":"Fantom Foundation","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"first quarter of 2022","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}