{"summary":"$75 billion hedge fund Renaissance Technologies has opened the door to investing in bitcoin futures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/62322\/75-billion-hedge-fund-renaissance-technologies-is-eyeing-the-bitcoin-futures-market","publishDate":"2020-04-18T07:10:45","id":13392,"type":null,"title":"$75 billion hedge fund Renaissance Technologies is eyeing the bitcoin futures market","category":["THE BLOCK"],"content":["Renaissance Technologies, one of the largest hedge funds in the world, has been eyeing the bitcoin futures market, according to a&nbsp;<a href=\"https:\/\/files.adviserinfo.sec.gov\/IAPD\/Content\/Common\/crd_iapd_Brochure.aspx?BRCHR_VRSN_ID=636807\" data-v-f87c67ca=\"\">regulatory form filed last month<\/a>.&nbsp;","The $75 billion hedge fund, which is best known for pioneering quantitative-based investing, said in a March 30 dated <a href=\"https:\/\/www.sec.gov\/fast-answers\/answersformadvhtm.html\" data-v-f87c67ca=\"\">Form ADV<\/a> that its Medallion Funds are now \"permitted to enter into bitcoin futures transactions.\" The firm said it would limit its trading activities to contracts traded on the CME. It's not clear if the firm has purchased any bitcoin futures at this point.","Launched in 2017, CME's bitcoin futures are cash-settled which allow investors to speculate on the burgeoning asset without having to take delivery of bitcoin itself. As The Block first reported earlier this week, CME Group saw an <a href=\"https:\/\/www.theblockcrypto.com\/linked\/61935\/cme-bitcoin-futures-accounts-trading-q1\" data-v-f87c67ca=\"\">uptick in new accounts<\/a> trading its bitcoin futures contracts during the first quarter of 2020. Still, the number of large traders and hedge funds using the product hit a low for 2020 in March, according to The Block's research.","","","Renaissance's ADV form, which offers investors information about its business practices, notes the risk of trading bitcoin and bitcoin-linked derivatives:","\"The underlying commodity for these futures transactions, bitcoin, is a relatively new and highly speculative asset. Bitcoin and futures based on bitcoin are extremely volatile, and investment results may vary substantially over time. These instruments involve substantially more risk and potential for loss relative to more conventional financial instruments. Investments of this type should be considered substantially more speculative and significantly more likely to result in a total loss of capital than many other investments.\"","On Friday, Renaissance's chief Medallion fund made headlines for its performance. <a href=\"https:\/\/www.wsj.com\/articles\/renaissance-s-10-billion-medallion-fund-gains-24-year-to-datein-tumultuous-market-11587152401\" data-v-f87c67ca=\"\">The Wall Street Journal<\/a> reported that the $10 billion fund gained 24% year-to-date as volatility gripped global markets. The Long Island-based firm rose 9.9% in March.","As noted by The Journal, the firm can hold thousands of stocks at any given time. At the same time, it also bets against thousands of shares of equities, currencies, and commodities.&nbsp;","Founded in <a href=\"https:\/\/www.rentec.com\/Home.action?index=true\" data-v-f87c67ca=\"\">1982<\/a>, the firm is led by award-winning mathematician James Simons. As noted by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2020-04-17\/renaissance-says-quant-models-misfired-during-march-mayhem\" data-v-f87c67ca=\"\">Bloomberg<\/a>, the hedge fund's Medallion funds for are known for their high returns, returning to investors an average annual return of 40% from 1988 to 2018.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"1982","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"James Simons","content":"PERSON"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"the first quarter of 2020","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"1988","content":"DATE"},{"type":"March","content":"DATE"},{"type":"March 30","content":"DATE"},{"type":"Renaissance Technologies","content":"ORGANIZATION"},{"type":"24%","content":"PERCENT"},{"type":"Renaissance","content":"ORGANIZATION"},{"type":"9.9%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"$75 billion","content":"MONEY"},{"type":"CME","content":"ORGANIZATION"},{"type":"Long Island","content":"LOCATION"}],"hashtag":["HEDGE FUNDS"],"authors":["Frank Chaparro","The Block"]}