{"summary":"Ledger CEO Pascal Gauthier said that the ability for governments to subpoena user funds if they use the Recover service is the only concern.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231794\/ledger-ceo-concedes-subpoena-to-access-user-funds-is-the-only-concern","publishDate":"2023-05-23T05:30:22","id":1339,"type":null,"title":"Ledger CEO: Government subpoena to access user funds is the &#x27;only concern&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Three days ago, Ledger shareholder and former CEO Éric Larchevêque <a href=\"https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/13ldgcl\/comment\/jkpnvnl\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">acknowledged<\/a> that governments could subpoena access to user funds held on a Ledger device that has subscribed to its new Recover service.","The comments sparked consternation among Ledger users, but Ledger CEO Pascal Gauthier has now shrugged off concerns, arguing that such a scenario is unlikely to happen.","\"The only concern really is if we get subpoenaed by a government to say now this user specifically, we would like you to retrieve the three shards etc.,\" he said, <a href=\"https:\/\/www.youtube.com\/watch?v=M3VjQUcyZSY\" data-v-f87c67ca=\"\">speaking<\/a> on the What Bitcoin Did podcast.","He added that this isn't a concern because governments only issue subpoenas like this in the case of a serious act like terrorism or one involving drugs. \"It's not true that the average person gets subpoenaed every day.\"","The Ledger Recovery service is an opt-in service that lets users elect to have their seed phrase encrypted and split into three shards. These shards are then stored with three third-party companies. The seed phrase can only be restored if the three shards are combined on a Ledger device — and for the user to do so, they need to pass an identity verification test. The service costs $9.99 a month and if a user stops paying, they won't be able to access the backup after a certain point.","The optional service has proven <a href=\"https:\/\/www.theblock.co\/post\/230992\/ledger-defends-crypto-wallet-recovery-tool\" data-v-f87c67ca=\"\">controversial<\/a>, with many Ledger owners skeptical about the service and worried that it was a feature they weren't aware the device was capable of performing. Larchevêque noted that he had even seen users posting pictures of their Ledger devices being burned in protest of the new feature.","<span data-v-9360dbf6=\"\" data-v-f87c67ca=\"\">Nicolas Bacca, co-founder and VP of Innovation Lab at Ledger<\/span>, claimed that the new service \"doesn't change the security assumptions compared to a firmware update.\" In an emailed response to The Block, Ledger reiterated that its an optional service — \"<span data-v-9360dbf6=\"\" data-v-f87c67ca=\"\">so if you're a Ledger user who wants to use your Ledger as you always have, you can still do that without concern. Nothing changes for you.\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nicolas Bacca","content":"PERSON"},{"type":"$9.99","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"Éric Larchevêque","content":"PERSON"}],"hashtag":["WALLETS"],"authors":["Tim Copeland","The Block"]}