{"summary":"The Fantom (FTM) community has voted to use a third of the burn fees on transactions to fund ecosystem projects instead.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159803\/fantom-community-decides-to-use-burn-fee-to-fund-ecosystem-projects","publishDate":"2022-07-27T07:53:02","id":13397,"type":null,"title":"Fantom community decides to use burn fee to fund ecosystem projects","category":["GOVERNANCE"],"content":["The Fantom community has voted in support of a governance <a href=\"https:\/\/forum.fantom.network\/t\/ecosystem-support-vault\/69\" data-v-f87c67ca=\"\">proposal<\/a> to create an Ecosystem Support Vault to fund projects from a percentage of transaction fees currently being burned.","The vote, <a href=\"https:\/\/www.theblock.co\/post\/156122\/fantom-community-voting-on-whether-to-use-burn-fee-to-fund-projects\" data-v-f87c67ca=\"\">which began on July 5<\/a>, passed with almost unanimous approval from participants. Details from the voting <a href=\"https:\/\/pwawallet.fantom.network\/#\/gov\/0x6ad5a089F62359ea1Ce2c75332eBf917DdBFF310\/proposal-detail\/0x16\/0x7c3b85a71e4fce1209a81d67f1af46b5a068770e\" data-v-f87c67ca=\"\">page<\/a> showed that 99.75% of all votes cast were in support of the plan. The vote was to end on October 3 but there was a provision for early closure of the polls if the vote crossed the 55% quorum requirement.","Fantom will fund the vault with 10% of its transaction fees. This 10% is a third of the network's 30% burn fee. Fee burning in crypto is where transaction fees are destroyed rather than being used to reward validators. This process can contribute to reducing a token's total supply since a portion of its supply is constantly being burned.&nbsp;","By funding the ecosystem vault, Fantom's burn rate will reduce to 20%. This lower fee burn reduces the amount of FTM that's destroyed each year.","Fantom’s Special Fee Contract, which distributes rewards to Fantom stakers and delegators, will be responsible for providing custody of the vault’s funds.","With the vote passed, projects looking to secure grants can now apply for funding. These applications will proceed via proposals submitted on the Fantom governance portal after which the community will vote on whether or not to fund the project.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fantom","content":"PERSON"},{"type":"99.75%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"July 5","content":"DATE"},{"type":"October 3","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"FTM","content":"ORGANIZATION"},{"type":"55%","content":"PERCENT"},{"type":"Fantom governance","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}