{"summary":"The C-Suite at ErisX is fully staffed.  The institutional-grade exchange announced three new hires Thursday as it prepares for the launch of its spot","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/10626\/erisx-brings-on-new-partner-from-barclays-as-it-eyes-the-launch-of-its-institutional-crypto-exchange","publishDate":"2019-02-07T08:04:32","id":13391,"type":null,"title":"ErisX fills C-Suite spot with former Barclays exec as it eyes the launch of its institutional crypto exchange","category":["EXCHANGES"],"content":["The C-Suite at ErisX is fully staffed.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/2018\/10\/03\/a-slew-of-wall-street-giants-are-getting-behind-an-upstart-exchange-looking-to-offer-bitcoin-cash-litecoin-and-ether-futures\/\" data-v-f87c67ca=\"\">The institutional-grade exchange<\/a> announced three new hires Thursday as it prepares for the launch of its spot marketplace for crypto in Q2.&nbsp;","Led by former Citigroup executive Thomas Chippas, ErisX also aims to offer trading in a number of physically delivered futures including ones tied to bitcoin, ether, bitcoin cash, and litecoin. ErisX is looking to attract traditional investors and traders to its market, which it says will be regulated by the CFTC. As for Thursday's announcement, the firm said it has brought on Robert Thrash as chief operating officer.&nbsp;The new hires mean the firm has finished staffing up its executive team, Chippas said in an interview.&nbsp;","Thrash joins ErisX from Barclays where he was a managing director on teams in clearing and futures execution, <a href=\"https:\/\/www.linkedin.com\/in\/robert-thrash-9667833\/\" data-v-f87c67ca=\"\">according to his LinkedIn profile<\/a>. He spent 12 years at the investment bank, previously working in prime services and as a rates trader.&nbsp;","\"Bringing on Robert means we have rounded out the executive team,\" Chippas told The Block. \"This is someone who ran a global derivatives business and we couldn't ask for someone better.\"&nbsp;","“ErisX has assembled an impressive team of experts to build the most robust, secure and regulated digital asset platform,” Thrash said in a press release. “Leveraging intermediary relationships and their diverse group of investors, ErisX will help both institutional and individual participants access these markets.”","ErisX also announced the hire of John Denza, previously head of U.S. sales at Pico Quantitative Trading, as its business development executive. Denza also worked at BATS, the <a href=\"https:\/\/www.chicagotribune.com\/business\/columnists\/ct-cboe-bats-merger-robert-reed-0302-biz-20170301-column.html\" data-v-f87c67ca=\"\">exchange acquired in 2017 by Cboe Global Markets<\/a>, where he was a director.&nbsp;&nbsp;","A former YouTuber (sort of) has also joined the team. Arnold Connell, who was one of the leading executives behind the launch of YouTubeTV, has joined the firm as head of infrastructure.&nbsp;","Chippas said the Q2 deadline for the launch of its spot market is still on track, adding that the application to operate a futures exchange is still pending with the Commodities Futures Trading Commission. The firm is still aiming to launch that business by the second half of 2019. \"I am very pleased at the speed we are moving at,\" Chippas said.&nbsp;","He noted regulators are doing their due diligence and that approval for new financial products require on-site visits and a lot of back and forth. Notably, the government shutdown in the U.S. impacted the roll-out of a number of financial-products tied to bitcoin, <a href=\"https:\/\/www.coindesk.com\/us-government-shutdown-derailed-bitcoin-etf-talks-says-vaneck-ceo\" data-v-f87c67ca=\"\">including an ETF<\/a>, some market observers say.&nbsp;","Rival Bakkt, which was aiming to launch its bitcoin futures product at the end of 2018, has pushed back its launch date on a number of occasions, citing regulatory hurdles. SeedCX, ErisX's cross-town Chicago rival, launched its institutional crypto spot marketplace in 2018.&nbsp;","<em data-v-f87c67ca=\"\">A previous version of this post incorrectly reported that Thrash was joining as a partner.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Arnold Connell","content":"PERSON"},{"type":"second half of 2019","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"Cboe Global Markets","content":"ORGANIZATION"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Chippas","content":"PERSON"},{"type":"Pico Quantitative Trading","content":"ORGANIZATION"},{"type":"Thomas Chippas","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"John Denza","content":"PERSON"},{"type":"BATS","content":"ORGANIZATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Barclays","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}