{"summary":"It&#x27;s possible to buy Gucci items, movie tickets or pay the mortgage with a host of cryptocurrencies with BitPay&#x27;s new initiative.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270189\/bitpay-allows-customers-to-pay-for-goods-and-bills-with-bnb-chainlink-and-others","publishDate":"2024-01-09T09:00:02","id":13399,"type":null,"title":"BitPay allows customers to pay for goods and bills with BNB, Chainlink and others","category":["COMPANIES"],"content":["BitPay, originally a bitcoin payments startup, has added support for \"<span data-v-f87c67ca=\"\">dozens\" of cryptocurrencies including Uniswap, Chainlink and BNB, among others.<\/span>","The company \"is <span data-v-f87c67ca=\"\">committed to making crypto payments easy and accessible for all,” BitPay CEO Stephen Pair said in a statement. \"These updates and all of the newly supported assets mark an invitation to crypto customers: pay for what you need and splurge on what you want.\"<\/span>","BitPay customers are currently able to use their crypto to purchase goods from merchants like <span data-v-f87c67ca=\"\">Gucci, Ralph Lauren and AMC Theatres or make car and mortgage payments, the company said in the statement. The company also said it is adding payment support for Cronos and Basic Attention Token, in addition to \"dozens more.\"<\/span>","<span data-v-f87c67ca=\"\">Although BitPay has been around for several years, the company's move to add support for dozens more cryptocurrencies fits into a broader trend of web3 companies trying to make it easier to access and use tokens other than bitcoin. As an example, last year, the b<\/span>itcoin payments app Strike added support for Tether’s USDT stablecoin.","<span data-v-f87c67ca=\"\">BitPay has slowly been adding to the number of cryptocurrencies the platform supports. At one point in 2020, 90% of the <a href=\"https:\/\/www.theblock.co\/linked\/68529\/bitcoin-makes-up-over-90-of-payments-processed-by-bitpay\" data-v-f87c67ca=\"\">payments processed<\/a> by BitPay's platform were bitcoin-based.<\/span><span data-v-f87c67ca=\"\"> Since its founding in 2011, the Atlanta-based company has raised more than $70 million in funding from firms like Founders Fund, Index Ventures, Virgin Group and Aquiline Technology Growth.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"AMC Theatres","content":"ORGANIZATION"},{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"Tether’s USDT","content":"ORGANIZATION"},{"type":"Ralph Lauren","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Virgin Group","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$70 million","content":"MONEY"},{"type":"Stephen Pair","content":"PERSON"},{"type":"Aquiline Technology Growth","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Basic Attention Token","content":"ORGANIZATION"},{"type":"Index Ventures","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Atlanta","content":"LOCATION"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":["DEXS"],"authors":["RT Watson","The Block"]}