{"summary":"Metaverse platforms will come under the scope of the UK’s upcoming Online Safety Bill.\nThe bill is currently making its way through the House of Commons.\nPlatforms which fail to follow the rules will face fines up to 10% of their revenue and could be blocked.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180445\/metaverse-platforms-to-fall-under-scope-of-controversial-uk-online-safety-bill","publishDate":"2022-10-28T06:23:20","id":1340,"type":null,"title":"Metaverse platforms to fall under scope of controversial UK Online Safety Bill","category":["Gaming and Metaverse"],"content":["UK media regulator Ofcom CEO Melanie Dawes warned this week that metaverse platforms like Meta will be subject to the upcoming Online Safety Bill.","Self-regulation won’t be acceptable under UK law, and platforms will have to toe the line if they want to operate in the country.","“I’m not sure I really see that ‘self-regulatory phase,’ to be honest, existing from a UK perspective. If you’ve got young people in an environment where there’s user-generated content according to the scope of the bill then that will already be caught by the Online Safety Bill,” she said at a Global Counsel event in London on Tuesday, as reported by <a href=\"https:\/\/www.cnbc.com\/2022\/10\/26\/meta-and-microsoft-cant-self-regulate-their-metaverses-ofcom-warns.html\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">CNBC<\/a>.","The <a href=\"https:\/\/bills.parliament.uk\/bills\/3137\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Online Safety Bill<\/a>, which is currently making its way through the House of Commons, was introduced by the department for digital, culture, media and sport (DCMS) — not Ofcom itself, though it will receive new regulatory powers through it.","The bill ostensibly creates new rules for firms which host user-generated content and require them to remove illegal online material and, in the case of platforms likely to be accessed by children, “legal but harmful material” such as self-harming and eating disorder content.","As for the scope of it, the UK government website lists those affected by the bill as the biggest social media platforms, search engines, sites including forums and messaging apps, some online games, cloud storage and the most popular pornography sites. Metaverses are not specifically mentioned in the text.","\"This landmark bill captures all services where users can interact online - from websites and apps to the metaverse and beyond. Services likely to be accessed by children will need to protect them from harm or face huge fines,\" a DCMS spokesperson clarified in an emailed statement.","Platforms which fail to follow the rules will face fines up to 10% of their revenue and could be blocked.","The bill has proved a controversial proposal. <a href=\"https:\/\/www.article19.org\/resources\/uk-online-safety-bill-serious-threat-to-human-rights-online\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Privacy groups<\/a> claim it is “an extremely complex and incoherent piece of legislation that will undermine freedom of expression and information, privacy and the rule of law.”","A piece of secondary legislation which will define what is considered harmful has not yet been released.","Whether it's social media, comments under news articles or gaming platforms, companies have long struggled to toe the fine line between safeguarding users and censorship. Where one group finds efforts&nbsp;made by the likes of Meta to police content too lax, another finds it too strict.","When it comes to children certain metaverse platforms have been singled out for exposing them to inappropriate content. Roblox has attracted substantial criticism following reports of children being harassed, scammed and abused while playing its games.","Some of the games themselves, which anyone can create and share, have also caused upset. Last month Roblox <a href=\"https:\/\/www.bbc.co.uk\/news\/technology-63078950\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">took down two games<\/a> based on the war in Ukraine, including one in which players could play as Russian or Ukrainian soldiers and fight in a fictional city based on Kharkiv. In the other, players could watch the bombing of cities such as Mariupol.&nbsp;"],"hashtag":["ROBLOX"]}