{"summary":"Bank of England and UK Treasury determine that it is still too early to decide whether a digital pound is necessary.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274430\/bank-of-england-and-uk-treasury-remain-undecided-on-a-digital-pound","publishDate":"2024-01-25T08:55:00","id":1341,"type":null,"title":"Bank of England and UK Treasury remain undecided on a &#x27;digital pound&#x27;","category":["THE BLOCK"],"content":["The Bank of England and UK Treasury have published their response to last February’s consultation paper on a “digital pound.”","In the response published on Thursday, <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2024\/responses-to-the-digital-pound-consultation-paper\" data-v-f87c67ca=\"\">the BoE<\/a> and the UK Treasury determined that it is still too early to conclusively decide whether a digital pound is necessary. However, it stated that it intends to persist in its research and design efforts for a central bank digital currency (CBDC).","“The Bank and HM Treasury judge that further preparatory work is justified to enable us to respond to developments in the payments landscape and to reduce materially the lead time if there is a future decision to introduce a digital pound,” the <a href=\"https:\/\/www.bankofengland.co.uk\/-\/media\/boe\/files\/paper\/2024\/responses-to-the-digital-pound-consultation-paper.pdf\" data-v-f87c67ca=\"\">consultation<\/a> response said.","The response from the Bank of England and the Treasury stated that the design phase for the digital pound would persist in exploring the feasibility of the UK having both a retail and a wholesale CBDC. It also stated that the potential launch of a digital pound would occur no earlier than 2025.","The two consultation respondents addressed privacy and trust concerns related to a digital pound, stating that these would be tackled through new legislation. \"To address these concerns, the publication confirmed that primary legislation would be introduced before the launch of any digital pound,\" the BoE and the Treasury said.","The response also confirmed that neither the BoE nor the UK Treasury would have access to users’ personal data if a retail CBDC was launched.","\"Trust in all forms of money is an absolute necessity. We know the decision on whether or not to introduce a digital pound in the UK will be a major one for the future of money. It is essential that we build that trust and have the support of the public and businesses who would be using it if introduced,\" Bank of England Deputy Governor for Financial Stability Sarah Breeden said.","The majority of the responses to the consultation commented on the broader societal implications of introducing a retail CBDC, such as the future of cash, and the privacy and rights of users of a digital pound.&nbsp;","According to the consultation response, a digital pound would help to ensure that \"central bank money remains available and useful in an ever more digital economy, continuing to support UK monetary and financial stability.\" The BoE and <a href=\"https:\/\/www.theblock.co\/post\/260020\/uk-treasury-releases-final-proposals-for-crypto-asset-regulation\" data-v-f87c67ca=\"\">Treasury<\/a> added that a digital pound would also provide a public platform for private-sector innovation, promoting further competition, efficiency and choice in payments","However, the response to the consultation paper stressed that a digital pound would not replace cash. \"Banknotes and coins are important for many people so we will continue to provide them for those who want to use them. You would simply have even more choice when you make payments,\" the BoE and Treasury statement added.","The consultation paper gathered over 50,000 responses over the past year that focused upon the potential for the UK to develop a central bank digital currency (CBDC) for use by households and businesses for their everyday payment needs.","Thursday's response outlined how the BoE and UK Treasury plan to act upon the findings of the original consultation paper published in February 2023, called \"The Digital Pound: A new form of money for households and businesses.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Bank","content":"ORGANIZATION"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"\" Bank of England Deputy Governor for Financial Stability Sarah Breeden","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"February 2023","content":"DATE"},{"type":"HM Treasury","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"UK Treasury","content":"ORGANIZATION"}],"hashtag":["BOE","CBDCS","UK PARLIAMENT"],"authors":["Brian McGleenon","The Block"]}