{"summary":"Gemini partners with financial advisory firm to bring crypto to its 730,000 customers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173040\/gemini-to-partner-with-financial-advisor-betterment-act-as-custodian-for-crypto-clients","publishDate":"2022-09-27T09:00:25","id":13411,"type":null,"title":"Gemini to partner with financial advisor Betterment, act as custodian for crypto clients","category":["COMPANIES"],"content":["Gemini, the cryptocurrency platform founded by the Winklevoss twins, is partnering with financial advisory firm Betterment.","Through the partnership Gemini will act as the crypto custodian for Betterment, enabling the financial advisory firm to open up crypto access to its customer base, which is a little over 730,000 users. Betterment customers will have access to crypto portfolios from October.&nbsp;","Marshall Beard, Gemini's chief strategy officer, said that the firm is continuing to expand its institutional partnerships, to provide \"responsible access to crypto.\" Beard noted that the firm is providing crypto infrastructure to a growing number of asset managers and financial institutions, around the globe.","Gemini also <a href=\"https:\/\/www.theblock.co\/post\/157559\/binance-us-gemini-to-join-network-of-data-company-plaid\" data-v-f87c67ca=\"\">partnered<\/a> with Plaid, the data connectivity company, in July. Through this partnership customers are able to share their crypto account information, including asset types, balances and transactions, with other services they use to help with financial planning, tax advisory services and net worth calculations.","Crypto exchanges continue to announce partnerships and expand services despite the current bear market. One explanation for the continued expansion of firms in the space could be the dwindling volumes on crypto exchanges over the past twelve months.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/crypto-only-exchange-volume\/embed\" title=\"Crypto-only Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>&nbsp;","On top of partnerships a whole host of crypto exchanges announced staking services in the lead up to The Merge this month, with Gemini <a href=\"https:\/\/www.theblock.co\/post\/164358\/crypto-exchange-gemini-announces-new-staking-rewards-service\" data-v-f87c67ca=\"\">launching<\/a> new feature called Gemini Staking.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gemini","content":"ORGANIZATION"},{"type":"Marshall Beard","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Gemini Staking","content":"ORGANIZATION"},{"type":"Winklevoss twins","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":["GEMINI"],"authors":["Adam Morgan McCarthy","The Block"]}