{"summary":"DBS has partnered with The Sandbox to create a metaverse experience. The bank will also buy a 3x3 land plot in The Sandbox.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169047\/singapores-biggest-bank-dbs-to-acquire-land-in-the-sandbox-metaverse","publishDate":"2022-09-10T09:59:37","id":13418,"type":null,"title":"Singapore&#x27;s biggest bank DBS to acquire land in The Sandbox metaverse","category":["GAMING AND METAVERSE"],"content":["Singapore's biggest bank DBS <a href=\"https:\/\/www.dbs.com\/newsroom\/DBS_partners_with_The_Sandbox_to_launch_DBS_BetterWorld_to_demonstrate_how_the_metaverse_can_be_used_as_a_force_for_good\" data-v-f87c67ca=\"\">announced<\/a> a partnership with The Sandbox, a decentralized gaming virtual world and a subsidiary of Animoca Brands, on Friday. As part of the partnership, DBS will create a metaverse experience and buy land in The Sandbox.","DBS will buy a 3x3 plot of LAND — a unit of virtual real estate in The Sandbox metaverse — to develop \"BetterWorld,\" an interactive metaverse experience showcasing the importance of building a better, more sustainable world.","\"Our partnership with The Sandbox and Animoca Brands marks the start of an exciting collaboration as we push the boundaries of what is possible in the metaverse,\" said DBS CEO Piyush Gupta. \"We also look forward to harnessing it as an additional innovative platform to spread the word on important ESG [environmental, social and governance] issues and to shine a spotlight on communities and partners doing good work to address them.\"","DBS said it is the first Singapore company to partner with The Sandbox and the first local bank to make a foray into the metaverse. The bank said it will also purchase carbon offsets to make its metaverse move carbon neutral.","DBS's metaverse move marks its latest in the web3 space. Last year, the bank's brokerage arm, DBS Vickers, <a href=\"https:\/\/www.theblock.co\/linked\/134113\/dbsbank-trading-desk\" data-v-f87c67ca=\"\">received<\/a> a crypto license from the Monetary Authority of Singapore, allowing its institutional clients access to its DBS Digital Exchange by invitation. DBS also offers a crypto custody solution.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DBS Digital Exchange","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"DBS","content":"ORGANIZATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Piyush Gupta","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"DBS Vickers","content":"ORGANIZATION"}],"hashtag":["THE SANDBOX"],"authors":["Yogita Khatri","The Block"]}