{"summary":"Binance’s layer one BNB Chain has announced the launch of its zero-knowledge proof scaling technology zkBNB.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168514\/bnb-chain-announces-zero-knowledge-proof-scaling-technology","publishDate":"2022-09-08T03:23:31","id":13410,"type":null,"title":"BNB Chain announces zero-knowledge proof scaling technology","category":["LAYER 2S AND SCALING"],"content":["Binance’s Layer 1 BNB chain has announced its own zero-knowledge (ZK) proof scaling technology, which it coined zkBNB.","Zero-knowledge proofs are one of the viable long-term solutions for decentralized blockchain scalability, as Ethereum co-founder Vitalik Buterin highlighted in his <a href=\"https:\/\/vitalik.ca\/general\/2021\/12\/06\/endgame.html\" data-v-f87c67ca=\"\">‘Endgame’ article.<\/a> It is an emerging scaling and privacy technology that utilizes mathematical proofs to enable the verification of specific information without the need to reveal the details.","BNB Chain is one of the most widely adopted Layer 1 blockchains, hosting more than $5.4 billion in total value locked (TVL) and, as of this writing, sits at the number 3 spot across all chains, <a href=\"https:\/\/defillama.com\/chains\" data-v-f87c67ca=\"\">according to DeFiLlama.<\/a>","The goal of zkBNB is to maintain security from its base layer, while utilizing what is known as ZK SNARKs for faster transactions per second (TPS), finality, lower transaction costs, and “scalability the likes of which has not been seen before in the industry,” BNB Chain said in its release <a href=\"https:\/\/www.bnbchain.org\/en\/blog\/bnb-chain-makes-significant-scaling-breakthrough-introducing-zkbnb\/\" data-v-f87c67ca=\"\">article.<\/a>","Zero-knowledge proofs are not a novel technology. In fact, zero-knowledge proofs have been around for more than 30 years, dating back to <a href=\"https:\/\/people.csail.mit.edu\/silvio\/Selected%20Scientific%20Papers\/Proof%20Systems\/The_Knowledge_Complexity_Of_Interactive_Proof_Systems.pdf\" data-v-f87c67ca=\"\">1985.<\/a>","The implementation of ZK proofs in cryptocurrencies, however, is relatively new. ZK SNARKs were first implemented by Zcash, a fork of bitcoin, and have gained traction lately due to its usage of elliptic curves for proofs that have high-security guarantees and and viability for long-term scalability.","One of the problems BNB pointed out is long delays for transactions to process and finalize. It claims that zkBNB will significantly reduce transaction queues, which is conducive to better functioning applications and a better user experience.","The testnet for zkBNB went live on Sept. 2, and the target for its mainnet launch is before the end of 2022.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.4 billion","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Sept. 2","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Zcash","content":"PERSON"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"1985","content":"DATE"}],"hashtag":["BINANCE","BNB","BNB CHAIN"],"authors":["Mike Truppa","The Block"]}