{"summary":"AltLayer is a platform for deploying no-code rollups that are designed for specific apps and can be disposed of after use.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/210003\/altlayer-opens-up-testing-of-disposable-rollup-solution-to-100-developers","publishDate":"2023-02-09T04:46:19","id":13428,"type":null,"title":"AltLayer opens up testing of disposable rollup solution to 100 developers","category":["CRYPTO ECOSYSTEMS"],"content":["AltLayer is moving closer to a full launch, with a new round of testing set to get underway. The project is letting 100 developers try out the no-code rollup solution to help prepare the project for launch, according to a statement.","AltLayer lets developers spin up a Layer 2 rollup network for a decentralized application, boosting its scalability with lower fees and higher performance. The project claims the rollups are a no-code solution and that they can be spun up in under 10 minutes. Beyond that, they’re disposable so can be used for temporary projects such as NFT mints.","Currently the platform supports building rollups on Ethereum and chains compatible with the Ethereum Virtual Machine (EVM). It has plans to support other EVM chains down the line.","Applications for the testing period will be open from Feb. 10 to 28. Developers that get access will be able to take part in the testing campaign between March 2 to 10. Ten of the participants will receive NFTs from the project’s Oh Ottie! Collection.","The project's dashboard, letting users create rollups, is set to go live shortly after the campaign finishes.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Feb. 10","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"March 2","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}