{"summary":"Offchain Labs has released a dedicated software tool that allows developers to launch their own Layer 3 blockchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235980\/offchain-labs-unveils-tool-to-build-layer-3-orbit-chains-on-arbitrum","publishDate":"2023-06-22T09:08:41","id":13421,"type":null,"title":"Offchain Labs unveils tool to build Layer 3 &#x27;Orbit&#x27; chains on Arbitrum","category":["CRYPTO ECOSYSTEMS"],"content":["Offchain Labs, the team behind the Arbitrum Layer 2 project, <a href=\"https:\/\/twitter.com\/OffchainLabs\/status\/1671567601292705792\" data-v-f87c67ca=\"\">released<\/a> a dedicated 'tooling' for developers to launch their own Layer 3 blockchains using the Orbit software stack.","Orbit allows developers to create their own dedicated chain that settles on one of Arbitrum’s Layer 2 (L2) chains: Arbitrum One and Arbitrum Nova.","\"Today, we're releasing tooling that will make building your own Arbitrum Orbit chain easier than ever,\" Offchain Labs <a href=\"https:\/\/twitter.com\/OffchainLabs\/status\/1671567601292705792\" data-v-f87c67ca=\"\">announced<\/a> on Wednesday.","The team said that, with Orbit chains, developers can define their own governance protocols, privacy, permissions and fee tokenomics.","In addition to the new tooling, Offchain Labs has also rolled a sandbox environment called Orbit Devnet, which lets developers safely test and debug their smart contracts and applications before deploying them as Orbit chains.","Offchain operates two Layer 2 blockchains on top of Ethereum. The first is Arbitrum One, which implements Optimistic Rollups to scale Ethereum apps. The Layer 2 network leverags Ethereum's security by aggregating transactions on the secondary layer and publishing security proofs back on the mainnet while maintaining a full record of the mainnet's state.","The second is Arbitrum Nova, which utilizes a protocol known as AnyTrust. Nova uses an off-chain data availability layer to store raw transaction data and scale apps. It provides developers with the ability to optimize for lower fees with cheaper storage, but has a slightly more flexible security model than One.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Arbitrum Nova","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Offchain Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}