{"summary":"Thom Thompson, an editor at John Lothian News,  is a derivatives specialist who has worked in product design, business development and regulatory roles","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/51259\/u-s-bitcoin-futures-the-year-that-wasnt","publishDate":"2019-12-24T16:05:20","id":13429,"type":null,"title":"U.S. bitcoin futures: The year that wasn’t","category":["OP-ED"],"content":["<em data-v-f87c67ca=\"\">Thom Thompson, an editor at <a href=\"https:\/\/johnlothiannews.com\/author\/tt\/\" data-v-f87c67ca=\"\">John Lothian News<\/a>, &nbsp;is a derivatives specialist who has worked in product design, business development and regulatory roles for the&nbsp;<a class=\"mw-redirect\" title=\"CFTC\" href=\"http:\/\/www.marketswiki.com\/wiki\/CFTC\" data-v-f87c67ca=\"\">CFTC<\/a>, the&nbsp;<a title=\"Chicago Board of Trade\" href=\"http:\/\/www.marketswiki.com\/wiki\/Chicago_Board_of_Trade\" data-v-f87c67ca=\"\">Chicago Board of Trade<\/a>,&nbsp;<a title=\"The Clearing Corporation\" href=\"http:\/\/www.marketswiki.com\/wiki\/The_Clearing_Corporation\" data-v-f87c67ca=\"\">The Clearing Corporation<\/a>,&nbsp;<a class=\"mw-redirect\" title=\"Swiss Exchange\" href=\"http:\/\/www.marketswiki.com\/wiki\/Swiss_Exchange\" data-v-f87c67ca=\"\">Swiss Exchange<\/a>,&nbsp;<a title=\"Eurex\" href=\"http:\/\/www.marketswiki.com\/wiki\/Eurex\" data-v-f87c67ca=\"\">Eurex<\/a>&nbsp;and&nbsp;<a title=\"Eurex Clearing\" href=\"http:\/\/www.marketswiki.com\/wiki\/Eurex_Clearing\" data-v-f87c67ca=\"\">Eurex Clearing<\/a>.<\/em>","2019 began with optimism for bitcoin derivatives markets.","Cboe Global markets, which launched the first U.S. futures contract right at the peak of the 2017 bitcoin price peak, shut its market down in 2019. It did okay.&nbsp;It wasn’t doing as well as the CME’s five-times larger futures contract which was trading about 4,000 five-bitcoin contracts per day as the year wound down.","Still, the Chicago ventures offered cash-settled futures. And 2019 was going to be the year of <em data-v-f87c67ca=\"\">deliverable<\/em> bitcoin futures trading.&nbsp;","In the second half of 2018, plans for new futures exchanges appeared like mushrooms after a warm rain – despite there being no indication of a reversal in the price of bitcoin which was bearish all year.","Nevertheless, the foundings of <a href=\"https:\/\/fortune.com\/longform\/nyse-owner-bitcoin-exchange-startup\/\" data-v-f87c67ca=\"\">Bakkt by ICE<\/a> (the Intercontinental Exchange) and <a href=\"https:\/\/www.theblockcrypto.com\/daily\/1150\/a-slew-of-wall-street-giants-are-getting-behind-an-upstart-exchange-looking-to-offer-bitcoin-cash-litecoin-and-ether-futures\" data-v-f87c67ca=\"\">ErisX<\/a> were announced with excitement and enthusiastically welcomed by the crypto community. In fall 2018, even LedgerX revealed that it wanted to offer deliverable bitcoin futures exchange when it applied to the CFTC for a futures license.","The pending initiatives were impelled by the idea that that two old fuddy-duddy, risk-averse futures exchanges were leaving a lot of bitcoin on the table waiting for just the right, sexy new platforms to come along and disrupt them. Trading on U.S. regulated futures exchanges would explode – Explode! – if the contracts just were deliverable. Deliverable contracts that settled daily, pundits said, would offer traders a more efficient tool with which to speculate and provide market participants a superior way to hedge their outstanding bitcoin positions.&nbsp;","","","As the bitcoin price climbed out of its price trough, Cboe suddenly and without much explanation announced in late March that it was abandoning bitcoin futures. Cboe cryptically indicated that it was not finished with bitcoin although it was not listing any new trading months past June (maybe it was referring to a possible ETF?).","At the time of the announcement, it was trading more than 1000 futures contracts per day as it was losing market share to the CME. It is unusual, if not unheard of, for an exchange to shutter a contract that is trading 1,000 lots per day. By June 2019, as Cboe left the stage, CME was trading close to 8,000 contracts per day.","","","ICE’s contract delivery process precludes clearing members from delivering on behalf of their customers. To take part in the delivery process – the key differentiating product attribute – a customer has to have its own account at Bakkt in addition to trading and clearing accounts through its futures broker at ICE. Bakkt also carries its own insurance against bitcoin hacking, signalling that that is one aspect of crypto trading ICE will not touch.","ICE launched its one-bitcoin futures contracts in September 2019. The monthly contract’s low trading volumes indicated wide-scale indifference. The daily settling contracts traded on the first day and, it seems, never since.","In October, after a month of trading, ICE notified the CFTC that it was going to incentivize trading in the monthly contracts through payments for market making, liquidity provision and facilitating deliveries. What these programs pay and to whom ICE pays are not public information. A sustained leap in trading volumes at ICE by a factor of 10 coincided with the notice filings with the CFTC. A spokesperson for the exchange around the time of the pop in volumes said the liquidity program had not been implemented yet.&nbsp;","Having received a clearing license from the CFTC during the summer ErisX came to market with its one-tenth deliverable bitcoin futures contract on December 17 in a launch that was so “soft” it was whispered.","One lot traded on the first day. One.","ErisX, having had the benefit of being able to observe the market development arcs at the other exchanges, so far offers a smaller contract size, one-tenth of a bitcoin as its only innovation. The contract designs as well as the ability of FCMs to carry customer trades at ErisX are still under development as 2019 runs down.","","","The bitcoin swap execution facilities (SEFs) had a disappointing year as well.","LedgerX, which launched in 2017, ahead of Cboe and CME, has failed to thrive for two years. LedgerX offers cleared, deliverable next-day forwards and longer-dated options that the marketplace mostly ignored. LedgerX’s experience ran counter to ICE’s and ErisX’s supporters’ claims that there is huge demand for deliverable derivatives in the U.S. and its frustration – like its trading platform was largely ignored.","","","In a very strange episode, LedgerX, having decided its fortunes lie with trading futures, engaged in a very public snafu after it announced the launch of a physically delivered futures. A day after the announcement its regulator, the CFTC, said the firm actually wasn't granted permission. A resolution remains elusive, although in the meantime, it has cut its SEF contract size to one one-hundredth of a bitcoin.&nbsp;","In some cases, bitcoin can be lethal for SEFs. TeraExchange started with a bitcoin price index swap in 2014 and failed quickly. In September, Seed SEF was declared “dormant” three years after getting its license and having raised more than $25 million over its 4 years of existence. Tassat, built out of trueDigital’s platform, is still supposed to launch trading this year.","","","This year ends with the world’s largest futures exchange, the CME, enjoying a solid grip on U.S. bitcoin futures market dominance.","The CME took a very workmanlike approach to the contract (do an index; settle it in cash) and has nothing to regret at this point. CME showed it understands that futures trading is all about giving traders the chance to act on price movements tied to the underlying market so they can speculate or hedge.","Consequently, with average trading volume of 6,000 contracts or so, 2019 was CME’s year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"John Lothian News","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"Intercontinental Exchange","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Thom Thompson","content":"PERSON"},{"type":"second half of 2018","content":"DATE"},{"type":"fall 2018","content":"DATE"},{"type":"Seed SEF","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Bakkt","content":"LOCATION"},{"type":"September 2019","content":"DATE"},{"type":"Swiss Exchange","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"June 2019","content":"DATE"},{"type":"Eurex","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"Chicago","content":"LOCATION"},{"type":"December 17","content":"DATE"},{"type":"CME","content":"ORGANIZATION"},{"type":"Chicago Board of Trade","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March","content":"DATE"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"SEF","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":[],"authors":["Thom Thompson","Frank Chaparro","The Block"]}