{"summary":"Blockchain technology may offer people the ability to exercise more control over their personal data and be compensated for online behavior, experts said at the annual CES conference.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199616\/metaverse-leaders-at-ces-see-possible-side-hustle-in-selling-personal-data","publishDate":"2023-01-05T16:16:37","id":13436,"type":null,"title":"Metaverse leaders at CES see possible side hustle in selling personal data","category":["METAVERSE & NFT"],"content":["<span data-contrast=\"none\" data-v-f87c67ca=\"\">Could a future version of the internet allow people to turn what turns them on into cash and rewards? That's what some web3 leaders believe, turning personal data into a sort of side hustle.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">In this case, whether you want to call the future of the internet web3 or the metaverse, blockchain technology may offer online users the ability to exercise more control over their personal data and consumer behavior.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">“People getting rewarded [for]&nbsp;data, I love that,” said Napster CEO Jon Vlassopulos, prognosticating about what opportunities the next era of the internet might unlock for both consumers and companies. “It’s moving in the direction of providing data in exchange for value.”<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">Vlassopulos joined other technology executives at a panel <\/span>in Las Vegas<span data-contrast=\"none\" data-v-f87c67ca=\"\"> this week, where he and peers traded ideas about what the metaverse and web3 might look like from a brand perspective. The panel was a CES-sponsored event — one of the year’s biggest tech conferences — and part of an all-day series called Digital Hollywood.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">“If I say I want to go to Iceland and somehow an airline gets that data and I allow them to have it, and they offer me a companion ticket to Iceland, that’s money in my pocket. That’s like magic,” said<\/span> <span data-contrast=\"none\" data-v-f87c67ca=\"\">Vlassopulos, noting that some internet companies like Brave’s is already experimenting with ways to compensate people for online behavior.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">Vlassopulos’ comments come in an era where both consumers and regulators have never been more aware of — and in some cases perturbed to the point of taking countermeasures — by how internet companies have made billions from users’ personal data. In recent years, social media empires like Meta-owned Facebook and Instagram, or the world’s largest search engine Google, have come under intense scrutiny for engaging in what has been called by some “surveillance capitalism.” <\/span>&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Many have <a href=\"https:\/\/medium.com\/mit-initiative-on-the-digital-economy\/safeguarding-identity-and-personal-data-in-a-web3-world-5a67cc8b7d39\" data-v-f87c67ca=\"\">recently theorized<\/a> how wider adoption of encrypted, blockchain technology would give people more options when it comes to managing and safeguarding both their digital identity and personal data.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">A new set of standards underpinned by blockchain technology could create a “paradigm shift,” according to Mary Hamilton, a technological innovation executive for global consulting giant Accenture. Hamilton is optimistic about a new model where people not only own their data, but also choose if and how to monetize that data.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">“It’s almost better for brands too. You’re allowing them to have the correct data, not a guess at who you are or an approximation, but who you really are,” Hamilton said. “And you allow it for the brands you trust, and you want to engage with.”<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">Users already have been taking more ownership of how certain technology, like smartphone applications, monitor their behavior. Most famously, Apple recently implemented a system where iPhone users can choose if they want an app to track their behavior or not. The move could not only prove to be a watershed moment in online privacy policy; it's also <a href=\"https:\/\/www.cnbc.com\/2022\/02\/02\/facebook-says-apple-ios-privacy-change-will-cost-10-billion-this-year.html\" data-v-f87c67ca=\"\">causing Meta to lose billions<\/a> of dollars in revenue as many users opt out of being tracked.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-contrast=\"none\" data-v-f87c67ca=\"\">While some might argue actively selling one’s personal data to different companies in pursuit of compensation conjures thoughts of a technological dystopia, metaverse enthusiast Brian Weiner believes his company Sizzle Network can improve the lives of consumers in a meaningful way.<\/span>&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">“Consumers are incentivized to sell <\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">… <\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">data to the <\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">brands,<\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\"> and it puts them in the power seat,” <\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">the Sizzle Network CEO<\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">&nbsp;<\/span><span class=\"NormalTextRun SCXW159723200 BCX0\" data-v-f87c67ca=\"\">said during the panel discussion. “A lot of them are excited about having that income opportunity.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Las Vegas","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Brian Weiner","content":"PERSON"},{"type":"Vlassopulos","content":"PERSON"},{"type":"Jon Vlassopulos","content":"PERSON"},{"type":"Hamilton","content":"PERSON"},{"type":"Digital Hollywood","content":"ORGANIZATION"},{"type":"this week","content":"DATE"},{"type":"Iceland","content":"LOCATION"},{"type":"Mary Hamilton","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Sizzle Network CEO","content":"ORGANIZATION"},{"type":"billions<\/a> of dollars","content":"MONEY"},{"type":"Napster","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}