{"summary":"Crypto exchange FTX in Europe is partnering with music festival Tomorrowland to help the festival make the leap into Web3 and NFTs. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/137106\/ftx-europe-inks-web3-focused-deal-with-music-festival-tomorrowland","publishDate":"2022-03-10T09:00:31","id":13431,"type":null,"title":"FTX Europe inks web3-focused deal with music festival Tomorrowland","category":["STARTUPS"],"content":["FTX Europe, the European affiliate of crypto exchange FTX, is partnering with an electro-music festival called Tomorrowland to integrate web3 features into the festival. <u data-v-f87c67ca=\"\"><\/u>&nbsp;<u data-v-f87c67ca=\"\"><\/u>","The collaboration will allow Tomorrowland Winter festival attendees to collect the first 1,500 of a total of 6,500 NFTs as part of a broader festival experience. Specifically, possession of the NFTs will unlock one of five locations hidden throughout the mountains in Alpe d'Huez France, where the festival is held at the end of March, with exclusive concerts that festival-goers will have to find and scan their bracelet for entry. The initiative has been dubbed <i data-v-f87c67ca=\"\">The Quest by FTX.<\/i>","\"The evolution to web3 opens a lot of possibilities for our endless imagination and also the opportunity to tighten the bonds of our community in the coming years,\" said Michiel Beers, the founder of Tomorrowland, in a statement.&nbsp;","The partnership will explore things like the application of Web3 and blockchain technology including NFTs for music, ticketing and art, events in the metaverse, and cryptocurrency payments. \"Tomorrowland’s evolution to web3 is an opportunity to establish a deeper connection to the community and engage festival goers with streamlined ticketing options, artists with new creative outlets, and fans of Tomorrowland with the ability to earn, collect or buy digital Tomorrowland assets,\" said a company statement.&nbsp;","The announcement signals the next culture-focused initiative pursued by FTX. In recent months, FTX has made significant moves into <a href=\"https:\/\/www.theblockcrypto.com\/linked\/113272\/ftx-is-creating-an-nft-focused-sports-and-entertainment-marketplace\" data-v-f87c67ca=\"\">sports<\/a>&nbsp;and <a href=\"https:\/\/www.theblockcrypto.com\/post\/135224\/ftx-moves-into-300-billion-luxury-fashion-industry-with-new-hire\" data-v-f87c67ca=\"\">fashion and luxury<\/a>.","“We’re proud to partner with Tomorrowland to bring their truly unique and magical events to the digital space by supporting their Web3, NFT, and crypto related initiatives,\" said Sam Bankman-Fried, FTX's founder and CEO. \"We’re also aligned in our shared belief that community, accessibility, transparency and sustainability are the leading factors for a better Tomorrow. The Quest by FTX will give attendees of this Tomorrowland Winter a fun and interactive way to gain access to exclusive events.\"&nbsp;<u data-v-f87c67ca=\"\"><\/u>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Michiel Beers","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Alpe d'Huez France","content":"LOCATION"},{"type":"Tomorrowland","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tomorrowland","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Alameda","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Tomorrowland Winter","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Anushree Dave","The Block"]}