{"summary":"The Celsius creditor committee said today it intends to oppose a motion from equity holders to form a separate committee.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173592\/celsius-creditor-committee-plans-to-oppose-equity-holder-motion","publishDate":"2022-09-28T19:37:49","id":13432,"type":null,"title":"Celsius creditor committee plans to oppose equity holder motion","category":["LEGAL"],"content":["The committee representing customers and creditors in the Celsius bankruptcy case plans to oppose a request from equity holders to form their own committee.","Growth equity firm WestCap and Quebec's pension fund Caisse de dépôt et placement du Québec (CDPQ) <a href=\"https:\/\/www.theblock.co\/post\/172351\/celsius-investors-file-for-fiduciary-to-advocate-for-them-in-bankruptcy-case\" data-v-f87c67ca=\"\">filed a motion<\/a> last week requesting the court appoint their own fiduciary to protect the bankruptcy process from being \"inappropriately and inequitably skewed in favor of the customers to the detriment of the Equity Holders.” The result would effectively create another committee representing equity holders seeking to recoup money from the bankruptcy.&nbsp;","In a town hall today, counsel for the Unsecured Creditor Committee (UCC) said they plan to oppose that motion. A lawyer for the group said they expect Celsius and other creditor groups to take a similar view, and they're currently working to find common ground with those parties.","The UCC still intends to work with other constituencies like equity holders, according to UCC counsel Gregory Pesce, but another committee could incur further costs for the estate, which the UCC has sought to avoid in order to deliver more value to creditors.&nbsp;","\"We just don't think that there's a need to have an official committee of preferred equity holders that's paid for out of the pockets of the account holders in this case,\" said Pesce.","A hearing on the motion is scheduled for Oct. 6 at 10 a.m. EDT.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Unsecured Creditor Committee (UCC","content":"ORGANIZATION"},{"type":"Oct. 6","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Equity Holders","content":"ORGANIZATION"},{"type":"WestCap","content":"ORGANIZATION"},{"type":"UCC","content":"ORGANIZATION"},{"type":"10 a.m. EDT","content":"TIME"},{"type":"Quebec","content":"LOCATION"},{"type":"Gregory Pesce","content":"PERSON"},{"type":"Pesce","content":"PERSON"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}