{"summary":"Innovative technologies have impacted and advanced many industries, yet their integration into financial services products, processes, and infrastructure is often hindered by legacy technology and strict regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141594\/blockchain-transferred-funds-btfs-the-new-frontier-for-investment-funds","publishDate":"2022-04-12T08:37:36","id":13456,"type":null,"title":"Blockchain Transferred Funds (BTFs): The New Frontier for Investment Funds","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">Innovative technologies have impacted and advanced many industries, yet their integration into financial services products, processes, and infrastructure is often hindered by legacy technology and strict regulation. Securities markets, in particular, are vast and complex ecosystems of interconnected participants, regulators, and service providers. Because the parties depend on each other to maintain balance, the evolution of investment structures is often sluggish. However, blockchain technology introduces a compelling value proposition that gives the financial industry the tools and impetus to improve antiquated investment models and methods.<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In 2018, Arca Labs—Arca’s innovation division—analyzed the financial landscape and considered the products and processes that blockchain technology could improve. Widely recognized and well-understood, the Investment Company Act of 1940 (‘40 Act) provided an opportunity to innovate and improve operational efficiencies while reducing risk.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Accordingly, Arca developed a solution that incorporates blockchain technology into the traditional pooled investment fund structure, regulated under the '40 Act. The blockchain transferred fund (BTF) is the first registered '40 Act fund to issue shares as digital asset securities. These shares represent ownership in the Fund’s portfolio and can be issued, transferred, and redeemed entirely via a blockchain. The BTF represents the next generation of investment vehicles that we believe will revolutionize the global financial system with optimal performance, issuance, and investment processes.<\/span>","<span data-v-f87c67ca=\"\">Traditional financial securities such as exchange traded funds (ETFs) are bogged down by constraints like the 4pm market close and limited by dependence on the exchange. While ETFs have become a financial product of choice, we believe the next iteration of our financial system should combine the benefits of ETFs and the best of traditional finance with the unique features of blockchain technology. This convergence could solve some of the industry's most salient challenges: transferability and time.<\/span>","<span data-v-f87c67ca=\"\">ETFs and BTFs are links of the same evolutionary chain—the BTF integrates blockchain technology into the structure that underpins ETFs and enhances the preceding framework to offer, in our opinion, a more operationally efficient product with increased time and cost savings. The combination of public blockchains, permissioned blockchains, and distributed ledger technology (DLT) creates a new technological framework that we believe <\/span><span data-v-f87c67ca=\"\">serves as a blueprint and <\/span><span data-v-f87c67ca=\"\">demonstrates a pathway for registered investment vehicles to be tokenized and issued on a blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Technology has consistently been a catalyst for the transformation and growth of financial products, often resulting in redefining moments. <\/span><span data-v-f87c67ca=\"\">Truly innovative technologies profoundly challenge our concept of utility and stimulate previously unimagined possibilities. <\/span><span data-v-f87c67ca=\"\">Presently, blockchain technology is the stimulus for pooled investment vehicles, <\/span><span data-v-f87c67ca=\"\">addressing shortcomings of archaic architecture and processes. The novel BTF structure introduces an opportunity for the industry to shepherd in a revolutionary new era and<\/span> <span data-v-f87c67ca=\"\">blazes a trail for other registered investment vehicles to be launched and tokenized on-chain. <\/span><span data-v-f87c67ca=\"\">We believe blockchain technology <\/span><span data-v-f87c67ca=\"\">will revolutionize the global financial system and ultimately underpin all industries in the future.<\/span>","<a href=\"https:\/\/fs.hubspotusercontent00.net\/hubfs\/4536350\/BTF%20Paper.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Read Arca’s white paper<\/span><\/a><span data-v-f87c67ca=\"\"> and find additional <\/span><a href=\"https:\/\/www.ar.ca\/btf#read\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">BTF resources <\/span><\/a><span data-v-f87c67ca=\"\">here to discover more about the next iteration of pooled investment vehicles for professional investors.<\/span>","<span data-v-f87c67ca=\"\">About Arca<\/span>","<span data-v-f87c67ca=\"\">Arca is an asset management firm investing and innovating in digital assets. Our mission is to offer asset management products that meet the operational, compliance, legal, and regulatory standards needed for sophisticated investors to gain exposure to digital assets. Arca’s product set includes actively-managed hedge funds, passive vehicles, and a first-to-market blockchain transferred fund (“BTFs”) developed by our innovation division, Arca Labs. Arca was the first to launch a registered fund to issue shares via the blockchain, integrating blockchain’s peer-to-peer technology and instant settlement features with traditional investment vehicles. Arca’s founders and senior team members have worked in traditional finance and FinTech across many asset classes. Now, we are working to bring the best of traditional finance practices to digital assets to deliver the right product to the right investor at the right time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Additional information may be found at<\/span><a href=\"https:\/\/www.ar.ca\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/www.ar.ca\/<\/span><\/a><span data-v-f87c67ca=\"\">| Twitter:<\/span><a href=\"https:\/\/twitter.com\/arca\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">@arca<\/span><\/a><span data-v-f87c67ca=\"\"> | YouTube:<\/span><a href=\"https:\/\/www.youtube.com\/c\/Arcafinance\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">Arcafinance<\/span><\/a><span data-v-f87c67ca=\"\"> | Blog:<\/span><a href=\"https:\/\/www.ar.ca\/blog\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">https:\/\/www.ar.ca\/blog<\/span><\/a><span data-v-f87c67ca=\"\"> | LinkedIn:<\/span><a href=\"http:\/\/www.linkedin.com\/company\/arcafinance\/\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">arca finance<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"FinTech","content":"ORGANIZATION"},{"type":"1940","content":"DATE"},{"type":"BTF","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Arca Labs","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"DLT","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}