{"summary":"The Senate Agriculture Committee is continuing to flesh out a bill on crypto markets regulation, but with the end of this Congress coming up, the clock is ticking. \nItems under discussion include an SEC sign off before the CFTC defines tokens as digital commodities outside the securities regulator’s jurisdiction.  ","author":["Kollen Post","Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178088\/senate-committee-negotiating-sec-sign-off-on-digital-commodity-definition","publishDate":"2022-10-18T18:10:10","id":1345,"type":null,"title":"Senate committee negotiating SEC sign off on digital commodity definition","category":["Policy"],"content":["The Senate Agriculture Committee is negotiating changes to a bill that would grant the Commodity Futures Trading Commission more power over bitcoin and other digital assets, in preparation for a potential committee vote before the end of this Congress.","Among the items under negotiation is a provision that would require the CFTC to consult with the Securities and Exchange Commission as to whether a digital asset is a security, a possible blow to the hopes of those lobbying for the CFTC to become crypto’s regulator of choice.","Capitol Hill and lobbying sources familiar with the talks stressed that they remain ongoing, and portions of the bill could still change before a possible vote — if one even occurs before the end of the year. Other changes to the bill under discussion include adding a required report on decentralized cryptocurrency protocols that would guide future regulation.&nbsp;","Senate Agriculture Committee Chair Debbie Stabenow, D-Mich., co-author of the bill, told The Block last month that she hoped to hold a committee vote on the bipartisan bill before the end of this Congress, though little time remains to advance the bill after midterm elections. The Agriculture Commitee holds jurisdiction over the CFTC because a majority of commodities are agricultural products, like corn, soy, and other crops.&nbsp;","“We have no updates at this time and continue working with our Republican counterparts to find a time to advance our bipartisan crypto legislation,” a Democratic committee spokesperson wrote in response to an inquiry. Patrick Creamer, a spokesperson for Sen. John Boozman, R-Ark., Stabenow’s Republican counterpart on the committee and bill co-author, stressed that talks around the bill remain “fluid.”","In a public interview on Friday, SEC Chair Gary Gensler indicated support for <a href=\"https:\/\/www.theblock.co\/post\/177224\/gensler-supports-granting-cftc-more-power-over-spot-markets\" data-v-f87c67ca=\"\">greater CFTC crypto market authority<\/a>, and CFTC Chair Rostin Behnam, a former Stabenow staffer, testified in <a href=\"https:\/\/www.theblock.co\/post\/170439\/cftc-chair-asks-senators-for-more-authority-in-crypto-markets\" data-v-f87c67ca=\"\">favor<\/a> of the bill last month. Both sit on the super committee of regulators, the Financial Stability Oversight Council, that <a href=\"https:\/\/www.theblock.co\/post\/174527\/senior-u-s-regulators-propose-new-legislation-increased-rules-around-digital-assets\" data-v-f87c67ca=\"\">voted<\/a> to ask Congress to grant regulators more direct authority over digital commodities earlier this month. The SEC regulates securities, a rubric most digital assets fall under, but bitcoin and ether, the two largest cryptocurrencies by market capitalization, are currently seen as commodities. The CFTC can enforce against fraud and market manipulation, as well as regulate derivatives and futures of those digital assets, but this bill would grant them the ability to regulate the actual bitcoin and ether markets.&nbsp;","Despite a narrow window to the bill becoming law before the end of this Congress, it has high profile support. Sam Bankman-Fried, the founder and CEO of crypto exchange FTX, has praised the legislation. The crypto mogul <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1554843983809073157?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1554843983809073157%7Ctwgr%5Ed28b824adfcae5c2bf61bcd24ffc1235e0a604c4%7Ctwcon%5Es1_&amp;ref_url=https:\/\/www.coindesk.com\/policy\/2022\/08\/03\/us-senate-bill-will-give-cftc-crypto-market-oversight-but-doesnt-say-how-much\/\" target=\"_blank\" rel=\"noopener\" data-stringify-link=\"https:\/\/twitter.com\/SBF_FTX\/status\/1554843983809073157?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1554843983809073157%7Ctwgr%5Ed28b824adfcae5c2bf61bcd24ffc1235e0a604c4%7Ctwcon%5Es1_&amp;ref_url=https:\/\/www.coindesk.com\/policy\/2022\/08\/03\/us-senate-bill-will-give-cftc-crypto-market-oversight-but-doesnt-say-how-much\/\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">said<\/a> he was “really excited” to see the senators “introduce a strong bill to bring customer protection and federal oversight to crypto” when the legislation was filed in August.","Not everyone is as enthusiastic though. The Blockchain Association, a digital asset industry trade association, publicly requested changes to the bill last month.","“We look forward to working with these offices and the broader committee to sharpen and expand existing language within the DCCPA,” the group’s head of policy, Jake Chervinksky, said in a Sept. 15 statement.","&nbsp;","<em data-v-f87c67ca=\"\">Frank Chaparro contributed reporting to this story.&nbsp;<\/em>"],"hashtag":["CFTC","GARY GENSLER","SAM BANKMAN-FRIED","SEC","SENATE AGRICULTURE COMMITTEE"]}