{"summary":"A potential hacker has drained funds from ZB.com’s hot wallet, according to security firm PeckShield.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161275\/crypto-exchange-zb-com-loses-4-8-million-after-halting-client-withdrawals","publishDate":"2022-08-03T12:35:23","id":13464,"type":null,"title":"Crypto exchange ZB.com loses $4.8 million after halting client withdrawals","category":["HACKS"],"content":["ZB.com, a crypto exchange that halted withdrawals yesterday, has seen about $4.8 million removed from its hot wallet in a possible hack, according to a <a href=\"https:\/\/twitter.com\/peckshield\/status\/1554849892153131011\" data-v-f87c67ca=\"\">report<\/a> by security firm PeckShield.","On-chain data shows significant amounts of over 20 crypto tokens moving from ZB.com’s hot wallet to <a href=\"https:\/\/etherscan.io\/address\/0x67c67b5a3c4009cf849f86be37e79db3923f1055\" data-v-f87c67ca=\"\">another<\/a> address on Tuesday. This address has subsequently liquidated all but five of these tokens as of the time of publishing.","These tokens were sold on several decentralized exchanges on Tuesday, in exchange for 2,224 ETH ($3.6 million). The potential hacker moved the funds to <a href=\"https:\/\/etherscan.io\/address\/0x26446c1658b036a6fa3efb805f8fc538451d3fc2\" data-v-f87c67ca=\"\">this<\/a> wallet address where the ether tokens still sit as of the time of publishing. Meanwhile, another wallet controlled by the suspected hacker — where funds from ZB.com’s wallet were first moved — still holds about $1 million worth of those remaining five tokens.","The suspected hacking incident comes as ZB.com halted client withdrawals on Tuesday for \"temporary maintenance.\"","“Due to the sudden failure of some core applications, it still takes time to troubleshoot the problem. Deposit and withdrawal services are now suspended. Please do not deposit any digital currency before recovery,” the exchange said in a <a href=\"https:\/\/www.zb.com\/help\/notices\/proclamation\/1972\" data-v-f87c67ca=\"\">statement<\/a>.","ZB.com, formerly CHBTC.com, is one of the <a href=\"https:\/\/www.theblock.co\/post\/6608\/altcoins-unusual-move-on-zb-com-shows-potential-manipulation\" data-v-f87c67ca=\"\">oldest crypto exchanges<\/a> in the market. The platform was formerly based in China and was among the exchanges that had to relocate from China after the country banned crypto trading in 2017.","ZB.com did not immediately respond to The Block’s request for comment.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"PeckShield","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$1 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$3.6 million","content":"MONEY"},{"type":"$4.8 million","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}