{"summary":"Coinbase is requiring its UK users to specify what type of investor they are and complete a risk-acknowledgement form.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/270356\/coinbase-uk-risk-acknowledgement-form-fca","publishDate":"2024-01-04T07:07:00","id":13469,"type":null,"title":"Coinbase requires UK users fill out risk-acknowledgement form","category":["REGULATION"],"content":["Coinbase requires its UK users to tell the exchange what type of investor they are and complete a form confirming they understand the high-risk nature of crypto investments in light of guidelines from the UK's financial regulator.","The exchange said that users in the United Kingdom will need to complete both tasks to continue using their Coinbase accounts, according to an email seen by The Block.","\"You also need to complete a short assessment designed to confirm that you understand the risks associated with investing in crypto assets, which are considered high-risk investments by the FCA. The Appropriateness Assessment is essential for helping us ensure that you're equipped to make informed investment decisions,\" the email said, referring to the risk assessment form.","The measures come ahead of the Financial Conduct Authority's financial-promotions rules that come into force on Jan. 8. The rules have also resulted in exchanges providing more risk warnings on their platforms. Exchanges, including Coinbase and OKX, have been <a href=\"https:\/\/www.theblock.co\/post\/255431\/coinbase-okx-and-binance-partner-with-uk-firms-as-regulations-come-into-force\" data-v-f87c67ca=\"\">working with crypto exchange Archax<\/a> <span data-v-03de5780=\"\" data-v-f87c67ca=\"\">to get their financial promotions approved<\/span>. Other exchanges, such as Binance and Kraken, have enacted similar measures recently.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"United Kingdom","content":"LOCATION"},{"type":"Jan. 8","content":"DATE"}],"hashtag":["COINBASE","FCA"],"authors":["Tim Copeland","The Block"]}