{"summary":"Leo Zhang sits down with Frank Chaparro and Matteo Liebowitz to discuss the unseen impact that miners have on the overall Bitcoin market","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/49789\/leo-zhang-principal-at-iterative-capital-management-discusses-the-unseen-impact-bitcoin-miners-have-on-the-overall-market","publishDate":"2019-12-10T15:10:42","id":13465,"type":null,"title":"Leo Zhang, Principal at Iterative Capital Management discusses the unseen impact Bitcoin miners have on the overall market","category":["BITCOIN"],"content":["<em data-v-f87c67ca=\"\">Episode 32 of The Scoop was recorded with Frank Chaparro, Matteo Leibowitz, and Leo Zhang, Principal at Iterative Capital. Listen below, and subscribe to The Scoop on <\/em><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Apple<\/em><\/a><em data-v-f87c67ca=\"\">,&nbsp;<\/em><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Spotify<\/em><\/a><em data-v-f87c67ca=\"\">,&nbsp;<\/em><a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Google Play<\/em><\/a><em data-v-f87c67ca=\"\">,&nbsp;<\/em><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Stitcher<\/em><\/a><em data-v-f87c67ca=\"\">, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<\/em><a href=\"\/cdn-cgi\/l\/email-protection#473728232426343307332f22252b28242c24353e3733286924282a\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"14647b707775676054607c7176787b777f77666d64607b3a777b79\">[email&nbsp;protected]<\/span><\/em><\/a><em data-v-f87c67ca=\"\">.<\/em>","<iframe frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK3257598660\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Leo Zhang is Principal at Iterative Capital Management, an investment manager, cryptocurrency miner, and wholesale dealer. In this episode Leo joins Frank Chaparro and Matteo Leibowitz to discuss:","<em data-v-f87c67ca=\"\">The following transcript is taken from episode thirty one of The Scoop, The Block’s flagship podcast. Listen below, and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#a8d8c7cccbc9dbdce8dcc0cdcac4c7cbc3cbdad1d8dcc786cbc7c5\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"9cecf3f8fffdefe8dce8f4f9fef0f3fff7ffeee5ece8f3b2fff3f1\">[email&nbsp;protected]<\/span><\/a>.<\/em>","<em data-v-f87c67ca=\"\">The transcript is provided for your convenience, please excuse any errors or typos resulting from the transcription process:<\/em>","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Ladies and gentlemen, thank you so much for joining me today on what is a very special episode of The Scoop. I am joined for the first time in what feels like a century with Teo Leibowitz. He's co-hosting this show as we interview our very special guest, Leo Zhang. He's the research lab at Iterative Capital. Iterative touches many different corners of the cryptocurrency market. Mining, OTC, they're an investor, but they kind of fly a little bit under the radar. Leo, a prolific researcher, writer, is here to explore the interesting, often overlooked mining landscape. There are tons of developments going on in the market as it pertains to mining, as Leo will explore with us in a moment. The halvening is on the horizon. You have new firms coming to market, new firms coming to the U.S. market specifically. Leo, are you enjoying your cup of coffee? We got him whiskey, but he's a little jet-lagged, so he opted for the coffee. I'm enjoying the whiskey. Leo, thanks for joining us.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, it's my pleasure. It's actually a pretty interesting day to talk about mining since the first-ever mining company is now--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Canaan has IPO'd. We could start there, or we could start a little more high-level about your background and what you're doing at Iterative and what the firm's all about.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So do you want to hear about Canaan first or Iterative? Because one huge, one is very small. Iterative is huge. Okay, okay, so the small one. So Canaan IPO definitely has been in the works for many years, as many of you know. And the size of the IPO has obviously changed a lot in the past I think year, a little more than a year since they first started playing with this concept. So obviously, I think this is a pretty big deal in terms of bringing this to--in front of traditional investors, to the general public--because not many people understand mining, and I still don't understand mining. So these guys have been preparing for this move since 2015 and they've been consciously shaping their company, or the way they do business, for this specific goal. Just for some reason, IPO is incredibly important for the founder, Angie Jong. So, I mean, Canaan is is perhaps the most O.G. mining company in the space. And so they definitely deserve to be the first company to get listed.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, let's talk a little bit about Iterative. When did the company come online for folks who may not be familiar with what you guys do, obviously touching OTC mining, investing? What's the sort of underpinning story of the firm?&nbsp;","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So it Iterative started in 2016. So the first fund was a venture fund. And so the first fund generated about 13x return from 2016 to 2017. And, obviously, there was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/10765\/number-of-icos-in-q4-2018-increased-but-more-failed-to-raise-funds-according-to-icobench-quarterly-report\" data-v-f87c67ca=\"\">ICO<\/a>s wave. And so in mid-2017 we quickly realized that there's something wrong with this much money going on in this space. And so we made the conclusion at that time that this token mania is likely not going to continue. So we closed the fund, returned the capital to investors, everyone's happy, and we started a second fund that's dedicated to mining, which is the fund we're operating now. So Iterative Capital, the investment center--the reason people, you know, our peers, other investors in the cryptocurrency space, don't hear much from us or about us is because we only focus on mining. We do our own operations. You know, we go flip the switched ourselves, myself. And that's it. We don't do venture investing anymore. We don't really invest in tokens. We definitely don't participate in<a href=\"https:\/\/www.theblockcrypto.com\/linked\/2020\/sec-sets-up-new-office-to-talk-to-icos-projects\" data-v-f87c67ca=\"\"> ICO<\/a>s or IEOs anymore.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Do you think there's any appetite to return to venture down the line? And I say that because within even just the last six months or three months, we've seen a lot of venture funds raise large amounts of capital and looking to deploy that in kind of equity bets.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So some of which were mining bets, which would give you an edge.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. I definitely see more and more mining operations or so-called mining-related companies popping up, especially here in the U.S.. But I think, you know, here we're relatively late compared to, you know, many things that people in China have done in the past couple of years or experimented and tried and failed. And regarding your question on venture, I don't think that's something--it may or may not be the thing for us. But right now, I think this is this game is still very much a music chair. And for us, we want to focus on our product, Essure, which I think is something that we will work on for many, many years to come, if not, it's the product for us to focus on for the rest of our career.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>How do you see the investing landscape changing over the next twelve months? And could there be a catalyst that maybe puts you into venture again?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So I actually haven't really thought about that.&nbsp; So I myself am very much focused on mining, and there's already a lot of things going on in the mining space on a day to day basis. So I don't really, I'm not really fully subscribed to the DeFi and all that stuff. So I'm certainly not very psyched about what's going on in some of the altcoins. So, you know, just given my general preference and my own appetite, I don't think there's much that really excites me that fits into the venture-style investing.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Sure. Well, let's focus then on mining for a minute, and the halvening that is six months away at this point. You've written about the relationship between the rainy season in China and mining operations. Walk us through a little bit about what you're talking about.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So this is actually a very peculiar phenomenon. So, as you know, mining is very much--it depends on where the cheap electricity is. And miners in China have started this operation, and specifically, miners in Szechuan, have started playing with large-scale mining since 2013. I think the first-ever full-scale mining facility happened in Szechuan using hydropower. So there's a long history of large-scale miners situating there for a variety of reasons. One, the electricity is insanely cheap, and secondly, it's relatively remote. And people, you know, get away with a lot of things. And, you know, the government is generally pretty friendly to--the local governments, generally, are pretty friendly to stuff that as long as you claim it's some kind of innovation and the politicians, they don't, definitely don't understand, right? So, especially now--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And if you bring jobs, probably.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Oh, yeah, absolutely. You pay tax. And there's tons of extra electricity generated, especially between April to October, which is the rainy season in Szechuan. So a lot of, you know, additional electricity just could go to waste. So, you know, using that capacity is definitely a beneficial thing for the local power plants, as well as for miners who are trying to make a profit. So that's why so much hash rate is concentrated in Szechuan. I think a conservative estimate done by a variety of researchers shows that it's probably around 50 to 60 percent of hash rate are in China. And the majority of that 50 to 60 percent are in Szechuan, and another province that also hosts a lot of hash rate is Yunan which is to the south of Szechuan.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Interesting. Well, from my perspective, I find it so interesting and I wish we covered mining more from a business perspective because there are so many different things that can either impede as a headwind or act as a tailwind. Weather. Geography. Government relations. All these things can impact the business in a way that's unique compared to other firms that operate in this market.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, for sure. And also--","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Walk us through some of those as a mining operator. How do you navigate some of these things that could serve as an impediment?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, and just to finish on that thought, I think miners actually have a much bigger impact on what's going on in the market than people realize. And just because they're the only natural sellers and they need to sell, right? There's some miners who even sell on a daily basis just to capture that USD, sorry, fiat spread. And there are people who would only sell enough to cover their electricity and just hoard the rest. So miners definitely have a lot of coins. And once you have a lot of coins in a commodity game, you can play a lot of games. And, you know, it just naturally becomes more and more sophisticated when the coins disperse to other arenas. So just going back a little bit, back to why the mining industry is the way that it looks like today, at least in terms of geography. So I think, you know, obviously, there's this history there and also mining manufacturers are largely based in China as well. So shipping these machines to these locations is much, much easier compared to shipping these machines when you have to pay insurance, and potentially tariffs, and maintenance becomes harder, you don't have the right people who are trained on working with these machines once these machines leave China. So most of the large-scale miners who are still operating today, they only host the new latest gen machines in China because they're easy to fix and they ship some of their older S9s or just half-broken machines to places like the Middle East or Russia, where they, you know, they don't really care if the machines break as long as they get the cheapest electricity. So because so&nbsp; much hash power is concentrated in these regions, mining cycles behave--are influenced by the climates of these regions as well. So April to October, as I mentioned, is the rainy season and from November to March, pretty much, is the dry season. So this difference actually has a significant impact on the cost basis of and the general capacity of miners. And so when miners actually plan around these times in the year or to think about, you know, deployment schedule and when they buy new machines or sell some of their machines and facility owners, they plan around these schedules as to when do they do marketing conferences to attract all the suckers, yeah. And even manufacturers, right? They plan around these times before, you know, right before rainy season to sell their latest gen machines. So there's always big conferences in Chengdu, which is the, you know, the capital of Szechuan get more Shenzhen, which is the capital of hardware, around March, April. It's always very, very festive.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So another cycle that we've seen in the mining space is that these issuance cycles and namely the hardening of block rewards on a 4-year basis. Iterative put out some very interesting research projecting costs of production under various different assumptions. I'm just gonna run through some of the numbers. Under the assumption that you're using the watts miner M20S at three cents per kilowatt-hour, you'll see cost of production somewhere around seven thousand dollars. I think that's under the assumption that difficulty doubles after the halvening, and then, perhaps, under a slightly more conservative seven cents per kilowatt-hour, you're looking at cost production closer to seventeen thousand. So Bitcoin is currently trading just below eight thousand. Considering these projections, is now an especially good time to get into the mining industry, and how are you guys preparing for the next six months?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, so I'd say those calculations are definitely done as a snapshot. And obviously, the mining industry is heavily influenced by the price, despite, you know--a lot of people don't realize that because it seems like hash rate is moving independently from price. But there's definitely a connection and hash rate definitely follows price, but there's a huge delay just because hardware, they take time to manufacture, and they take time to sell, and they definitely take time to get up and running. So I think there are a lot of uncertainty around halvening, even for miners. And so people who deployed early this year, they're definitely--especially people who have bought a lot of cheap S9s for April--the price jumped. Those people have earned back their principal many times over already. So I think there are a good amount of people who are expecting to retire some of the S9s or just, you know, older generation machines around halvening because your cost production literally doubles after crossing that threshold. So I think the general narrative is that people who buy these, you know, 7 nanonmeter to 10 nanometer machines, these are machines that prepare you through the next cycle, which is next April to October. And people who are operating S9s or some of the less power-efficient machines, they will likely retire or transfer some of the machines to people who have more resources. So it's hard to say whether halvening is going to have a very noticeable, drastic effect on hash rates. It really depends on where the price is.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>So as someone operating in the mining industry, that you can't really say whether or not this will be bearish or bullish for your business or other miners in the space, it all depends on where the price goes?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So mining is actually a very--it depends a lot on timing, when you deploy. The best time to deploy is actually after right after a market crash, a big market crash, actually. Because one thing people who are outside the mining business don't realize is that mining machines are incredibly--the price of money machines are incredibly volatile. And this is because mining machines are inherently a bivariate option. It's an option whose variables are price and hash rate. So the pricing of these options is extremely sensitive and almost impossible to price. So most of the market right now uses some very simplistic metrics, such as static days to ROI, just number of days that you earn back your principal, which is clearly a very flawed, a very naive way of looking at the investment. But overall, money machines, their price fluctuates a lot. Especially after a big market crash, the expectation is that, you know, it takes much longer for you to earn back your principal and therefore a lot of machines, their price would drop as well. So those are the best times to approach mining manufacturers or vendors of secondary machines to acquire the machines that people don't want.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Sure. Yeah, so it seems it seems like a lot of these answers essentially come down to \"It depends,\" in a lot of ways, but the trend itself is fairly clear, which is that, you know, assuming things stay relatively constant, miner revenue is going to fall over time--perhaps not over this next four year cycle, but, you know, give it perhaps eight years or twelve years or sixteen years. The solution there, ostensibly, is the emergence of a healthy transaction fee market. Is this something that you're thinking about? And I guess a follow to that is if we don't see the emergence of this transaction fee market, what are your preferred solutions as far as maintaining some kind of constant revenue stream for miners? Is it, \"Lets transition to proof-of-stake?\" Is it reintroduce steady inflation, re-appropriate some unmoved coins? How are you guys approaching this?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So I think as money rewards diminishes, there will be more and more consolidation happening in the industry. So I think it will definitely be, especially now that the iteration on the chips has become slower and slower--after 10 nanometer, it's gonna take long, long time before the latest tech known becomes available to--and longer period before the latest tech known, such as 5 nanometer, becomes available to integrated circuit designers. So I think mining as a business is going to become more and more expensive to run and requires more and more financialization. What I mean by that is people will have to manage their rewards in a much more careful way and manage their expenses in a much more careful way, and manage ways to hedge a much more thoughtful manner as opposed to, you know, between 2013 to 2016, people were just doing whatever because they were making so much money.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>What are some new possible ways that a mining firm can hedge in that type of environment? I want to talk about hash rate derivatives.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, anyway, we'll get to that. So there is no real efficient way to actually hedge. And the best you can do is keep your expenses as low as possible.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Best you can do is cross your fingers and hope for the best.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. And for most people who have been in the business for a while, their cost basis is so much lower than where the market is, so they're fine, you know. So really, it comes down to your discipline around selling the rewards to make sure that you have enough electricity so that you don't scramble when the price is too low and you oversell your number of coins. So the important thing is make sure you purchase the hardware at as low as possible price and you're managing your electricity, your ongoing expenses, at the lowest possible costs. And when you rotate some of the coins into Fiat to pay for electricity, you're doing it in a relatively frictionless way. And obviously, you can hedge with Bitcoin futures, but the problem is that obviously volume is an issue. The volume has been growing a lot in the past year, but some of these exchanges that have the largest volume of these Bitcoin futures are not really trustworthy. So it's hard to scale. So for really large-scale miners, the most important thing still is managing your expenses.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Interesting. I feel like the trend, at least, you know, Layer 1 announced a massive, somewhat massive, I think, 50 million dollar fundraise at a 200 million dollar valuation with some pretty significant backers. They're making a bet on Texas. There was a merger announced yesterday between two firms that, frankly, I have never heard of, Whitestone US and Northern Bitcoin A.G.. They're merging to set up, in quotes, the largest Bitcoin mining facility worldwide. We'll see if that actually pans out to be true. If it's the largest, it's covering 100 acres of land, which is the equivalent to about fifty-seven soccer fields, and that'll also be based in Texas. There is this trend that, you know, we're moving to Texas now. This is the new--is this the new land of milk and honey for miners, is this the promised land, or are these firms misguided?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yes. Well, first of all, everyone's building the largest ever facility on the planet, everyone is doing that.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>We're building the largest news and research site--here at The Block--in the world! So is there something to Texas is the question.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Oh, definitely. There's a lot of cheap electricity in--the United States has a lot of power, right? And frankly, these people are just beginning to realize that, \"Oh, OK, we can actually use this otherwise wasted electricity for Bitcoin mining.\" However, a lot of these facilities being advertised, they are not fully built. So we talked to a lot of these guys actually since early last year, people would tell you, \"OK, we have a place, you know, in this very remote location in West Texas or upstate New York, and we have sub 3 saying electricity, 40 megawatts readily available, and we can scale to 700 megawatts in a year and a half,\" something like that. But you start talking to them, and it's like, \"Oh, actually, we don't even have a roof. You know, you need to put in 10 million first so that we can build the roof.\" This happens so much, and this is really because mining for North America is still relatively new, especially mining at scale. Most people who are building these facilities, they are not miners themselves. So they, you know, as opposed to in China, where people who own facilities were miners first and then they realized, \"OK, to fully capture these economics, I have to own my facility as well.\" Because once you own a facility, you can use that facility, or equity of that facility, as collateral to start borrowing Fiat to buy, you know, machines and just play that game again and again and again and scale from there. Whereas here, the facility owners, they just see, you know, a lot of Bitcoin miners as suckers who will pay them a margin for them to get rid of their electricity. So I think there's still a lot of work, a lot of infrastructure needs to build out before we see mining in the US, in North America, truly flourish. I think that we have seen some big facilities popping up, but I think these are rare, or relatively fewer, and they get to charge a much higher price because there are few. But we definitely see this trend. Although how sustainable is it? That's a completely different question, especially, you know, manufacturers are all based in China and getting the machines here, which is obviously a lot of hassle, maintaining them is a lot of hassle. So you have to make sure that your electricity is absolutely, absolutely dirt cheap.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And not to interrupt, but I feel that's the trajectory we're going in; more-so about, \"How can we bring the electricity costs as low as possible?\" versus, \"How can we get our machines to work as effectively and efficiently as possible?\" But at the same time, I wonder how things like maybe the trade war with China might impact some of these businesses, right? You have, you know, Layer 1 that is working with a certain type of chips, you know, silicon, which could become a casualty of this Trump trade war. Is that something you think about?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. I mean, I am a Chinese national who lives in the U.S.. My parents are very concerned about my safety.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Are they, really?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, of course. Because they, like, people in the U.S. Who read about these draconian headlines about what's going on in China, my parents also read about these draconian stories about, you know, people's lives suffering U.S. and racial war and all that stuff. But anyway, so it's just what we have to deal with, or, you know, people like ex-pats have to deal with. But just quickly before taking this too far, I think the tariff on the semiconductor industry is definitely going to have an impact on importing miners. But mining manufacturers are have been working around this for quite some time. So, for instance, you know, silicon is building a assembly line in Canada, I believe. I think Bitmain definitely has the ambition with miners coming to U.S. as well. The thing is, it doesn't matter where the integrated circuit is being designed. I mean, sorry. Layer 1's ICs are--they use a Beijing-based design firm and frankly, they should because at this point starting a new design shop for shot to 50 60, it's just stupid unless you're Intel. And anyways, so there are certain advantages to where certain things get manufactured. And this is just, you know, basic econ. So the way to get around this tariff is just simply having the assembly built here and the design still happen in Beijing or Shenzhen because the actual taping of the chips they're, you know, they're done by TSMC or Samsung, and these are Taiwanese or Korean companies.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Do you think some of Layer 1's claims around 2.3--I think they're quoting 2.3 cents per kilowatt-hour for their El Paso-based operations. Do you think those estimates are realistic?","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>We had one source who described it as an utterly ridiculous estimate and that their assumption relies on a price floor for unused renewable energy, equating that to a pipe dream. Where might you stand?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, so Alex is actually a good friend of mine, so I'm gonna be careful.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah, and we're nice to Alex, too, we wrote a great story about Layer 1!","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, so I think that price, that raw price, is definitely available. The question is how much hidden cost, or cost that needs to add up to building out the infrastructure or labor? These things are expensive, man.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But will that price always be available, at all times? And what happens if the people--I think that one's based in El Paso, yes--are unwilling to bear the costs that mining operation might place on the power grid.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So that's definitely something that we saw in New York State last year. You know, the locals, they pushed back on these monstrous operations. So I think there is a lot of negotiation that needs to be done on the local level, which is another thing that is much easier to do in China than here, because you don't have to deal with other people's opinions. But anyways, I think I think 2.3 cents is not the most ridiculous thing I've heard. And, just to your point, the sustainability of that, and also the hidden costs associated with that, is going to have a very big impact on his business.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Let's switch over to Canaan, which we did address very briefly at the beginning of the podcast today. So they were listed in the U.S. today on the Nasdaq. I think it is currently trading slightly below its listing price of nine dollars. So Canaan is one of these O.G. basic manufacturers. In their IPO filing the firm said it controlled 23.3 percent of the global Bitcoin mining machine market share in Half1 2019. So they raised 90 million, but they were initially looking to raise 400 million. In Q2 of 2019, they actually lost 37 million dollars, and I think they have roughly 39 million dollars in cash left in the bank right now. Some estimates suggest that they actually need to raise on the order of two- to four-hundred million to actually maintain their operations. Do you think this latest raise was borne out of desperation or was it more of an opportunistic listing?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>I think it's both. So, like I said earlier, this company has been preparing for IPO since 2015, and they deliberately structure their business in a way to make sure that they're clean for IPO, whereas, you know, Bitmain gets all these troubles because they, you know--some messy stuff there, right? So even in 2015, Angie Jung, the founder of the company, deliberately chose to only accept Fiat as payments, whereas Bitmain accepts Bitcoin, Bitcoin cash, Litecoin, everything. So this is to make sure that their revenue is easy to account and also much cleaner when the regulation becomes tighter. So I'd say IPO is a big thing for them and a big milestone for the industry overall, but it's more symbolic than there is anything substantial there. I really don't think so.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Why Is it symbolic?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. Because I don't really think this requires them much validation from equity investors. It's--at this point, I think U.S. tech stock market is just as inflated as a cryptocurrency market. In terms of sentiment, not in terms of quantity.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>And when you say it's symbolic as well, perhaps also alluding to the size of the raise as well, 90 million dollars isn't a huge amount of money in the grand scheme of things.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, I think--so for Canaan, their tech is definitely falling behind compared to Bitmain and Whatsminer. So if they continue to focus on--and obviously their business is a little different, and the reason that most people outside of the mining world have not heard of them is because they only sell--for the longest time, they only sell chips, right? They sell chips directly to other OEMs, then they package them until a very strong competitor showed up in November 2013 that almost crushed them, and they decided to go back to selling shoeboxes again. But anyways, now they're pivoting to miner as well as just AI application chips. So I think their business is going to be very much focused on just being IC designer rather than a fully-integrated cryptocurrency company. So in the sense that it's not a full participant of the cryptocurrency industry, despite that it has a huge seat, and over time I think its influence cryptocurrency mining space is going to wade compared to Bitmain and some of the rising competitors.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So why do you think they're so keen to list in the U.S?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>That I'm not sure. Well, actually, when they first started, I think they experimented with listing Hong Kong or Chinese mainland, but I think those attempts all failed. I don't know what's the specific consideration for listing U.S.. Maybe it gives them a certain kind of legitimacy so that they can brag to their parents.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So you think Canaan's problems aren't part of this natural mining cycle that we discussed earlier, it's more kind of fundamental issues with the way they're operating in that business?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So, I just don't think Canaan is going to be a 100 percent cryptocurrency company going forward. And I think if they find more money in selling AI chips, they're going to do that.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Let's touch on Bitmain briefly. There's been a lot going on behind the scenes, Jihan Wu and his co-founder Micree Zhan were both ousted and now Jihan is back, Micree is still out. Do you have any insight as to what's going on behind the scenes?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>I mean, I think I know just as much as you do. This is obviously a very crazy story, and their primary split is that Micree wanted to build an IC company, just like, you know, Angie Jung from Canaan. He also just wants to sell minors and he wants to sell A.I. chips. And he doesn't he wants to scale down on the influence on cryptocurrency community. He didn't like the Bitcoin Cash idea at all. Well, it's not because he thinks that it's a terrible project, it's more because he thinks it's a distraction from their primary business. And he thought the entire thing was a mistake. And whereas Jihan wants to be a player in cryptocurrency space, he wants to be a very powerful hand that drives the direction of the community, of development and also how people think about cryptocurrency and its adoption. So that's where their fundamental split is, and over time, that problem became more and more exaggerated, especially when the bear market comes. So Jihan blamed Micree. These are just the stories I read, right? And Jihan blamed Micree for not keeping up with the latest development and also just getting rid of the founder of Whatsminer minor because Dr. Young used to almost work at Whatsminer, sorry, Bitmain. And at that time, he was asking for two percent equity, but Micree only wanted to offer a zero point five percent, and Dr. Young was a little upset because Micree's female secretary gets more equity than he does. So he left and started Whatsminer and became a very powerful competitor to Bitmain. And so, Jihan blamed all these errors and just not producing the best machines anymore on Micree. And Micrees blames Jihan for getting too involved in the cryptocurrency space, which in his mind is unnecessary.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So, and I can certainly sympathize with Micrees objections. If you look at Jihan's Bitcoin cash moves, they didn't necessarily pan out the way that he wanted them to.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, that was a disaster.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>I'm sorry, I thought that was funny.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So while, you know, Jihan isn't at Bitmain he's also working on this new company, MatrixPort.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Like an OTC play, right?","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>OTC, custody. I think the way I've been pitched MatrixPort is as a kind of fully-integrated bank for miners. Maybe Leo has a different angle.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Yeah, what do you think of Matrix?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>It's a it's a service provider that--and it's not new.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>But we only have gotten so much information from what they're doing.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, same.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>But you're not a client of theirs?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>No. No, we actually. Yeah, we don't see them anywhere. Anyways, so I think lending is a very important part for miners, especially during market downturns. You don't want to oversell your coins to cover your obligations, right? So it'll be nice to have a way to collateralize your Bitcoin and just get Fiat so that you can get through that month. So this is a very necessary product and or slash services, and they're definitely not the first people to provide that. MatrixPort wants to provide it at scale because they know so many miners in that space and they're friends with a lot of big guys. So they have advantage there. But why haven't they achieved the same level of scale as some of the largest OTC desks? That, I think, only shows that Jihan's primary focus is not there. And now that he's been pulled back to Bitmain--or he pulled himself back to Bitmain--and he's going to have nasty, nasty battles for the next years to come, I think MatrixPort is gonna be less and less interesting as a player in the OTC custody space unless they find someone incredible to continue run their business.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>It's interesting that you say the focus is really on lending, because what that actually means is that all these miners are leveraging up on operations. Is there potential for us to see these deleveraging spirals if the price of Bitcoin, the price of this collateral continues to fall?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So, when price is down, you actually want to borrow, right? You want to use your Bitcoin as collateral and just borrow Fiat so that you don't sell too much of your coins. Because for mining, the most important thing is to have a massive amount of coin count, and having that is more important than anything else, really. Once you have amassed that, you can play a lot of different games. You can invest, or you can, you know, do all sorts of things. So lending is a long overdue thing in the mining space. And like I said earlier, as mining becomes more and more difficult, as it requires more and more capital financialization and be more careful with how you manage your rewards, it is going to be the make or break for players in this industry.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So, yeah, I see the appeal of borrowing when price is down. The problem is that price can continue to go down.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah, I mean, it's something that's very hard to quantify because you require so many variables to have a full calculation on where the threshold is. I can't answer on top of my head that, \"Oh, if if price dips below two thousand dollars, then this thing fails.\" I am not a human calculator despite being Asian. So, yeah, I think this business will continue to grow, and some of the lenders who are less sophisticated when it comes to risk management will suffer, as well as their clients.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So we already have fairly sophisticated market structure on the lending side and on the custody side here in the United States. Do you think MatrixPort and their eventual competitors' opportunity is the fact that there is this distrust between these Chinese-based operations and some of these U.S.-located institutions?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So I think the biggest demand for these kinds of services come from China, right? And the kind of fiat they would require is RNB instead of USD. So services like MatrixPort and their competitors in China, they benefit from having, you know, accessibility to a lot of miners. But here I don't really know what their natural, who their natural clients are, other than some of the quaint shops, who want to trade very sophisticated strategies and need to borrow Bitcoin for a short amount of time. So we definitely saw a lot of lending or just general finance companies in cryptocurrency space popping up, especially at the beginning of this year. Blockfi, Celsius, all these guys, there's just too many of these guys. And I don't know how they make their money.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Well, you raise a really good question. There was a good article in Bloomberg that sort of touched on whether or not there is a mounting crypto credit bubble and whether or not there are too many players in the space. You have five billion dollars worth of originations. They estimate up from essentially zero two years ago with players like Genesis, you mentioned Blockfi, you mentioned Celsius. There's Drawbridge out in Chicago. Blockchain.com in London, we've learned has done hundreds of millions of dollars worth of lending and their book is growing and growing. And so there is a concern, right? And with many of those folks on the other side being miners, is there this potentiality for a bubble pop? And what would that mean for the space?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So I think when a bubble pops is when either of these guys--they can't continue with the narrative and venture capital back holders can't--they realize, \"Oh, there's not much going on here.\" And this is a direct result of not being able to find clients. So if the problem with these lenders who showed up here in such short amount time in the past year is that they develop this business before finding a continuous source of natural clients. And I don't know how much appetite do these quant shops who need to borrow Bitcoins actually is because here in Chicago, that's the only, you know, natural clients of this kind of business. So just to come back to your question, I think this comes down to, you know, whether miners can really build up a practice or presence here before these lenders run out of venture capital money to raise from.","<strong data-v-f87c67ca=\"\">Matteo Liebowitz <\/strong>Let's Switch over briefly to Lightning. So Iterative just recently launched the Escher app, which from my understanding is a Fiat on ramp for Lightning Network. Maybe you can tell us a bit more about what you guys are doing there.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So we've been thinking about Escher for a long time, and we have gone through several iterations before finally releasing the product at the Lightning conference in Berlin in October. So one thing that's been very interesting to us in the Bitcoin space is so we see Bitcoin as a superior settlement network compared to some of the traditional settlement networks. And the reason is because a lot of the applications that have been built on something like Fetwire, they all extract rent on every single layer. So even though the volume that is being done on Fetwire is so huge, it's not necessarily cheap or certainly not necessarily fast. So Bitcoin has this very nice feature where just by being a miner, you can, being a participant in the economies of this settlement network--and it's come back to a question that you had earlier, which is how does the fee market develop on Bitcoin--because the fee market, in order for you to truly develope, has to capture all the economy that's done on top of the settlement network and settlment system. And obviously, there's nobody that has a crystal ball on how this free market is going to develop, but certainly requires people to build real services and real demand that can, you know, flow through to the miners. So that's how it becomes sustainable, but whether it can be done on time, that's a completely different question. Anyway, it's just to come back to this. So Escher is an instant BTC to USD settlement and it's a set up SDK where wallet developers can just grab and integrate into their wallet or Bitcoin payment service providers can just grab and use it as on-ramp and off-ramp. So wallet, especially free and open source wallets, they really don't have a revenue stream, right? And some of these wallets are very, very nice. But the way that people use these wallets are either they buy from Coinbase or some large OTC desk, they go through all that painful processes, or just miners, and then move their coins to their favorite wallet. So this process can be compressed significantly. And so we want to offer, you know, wallet users a way to access that on-ramp, and off-ramp within their application. So one thing that I think we've done particularly well is actually on the USD settlement side and we can make it actually instant. And obviously with BTC settlement side we will have to rely on Lightning.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So who's actually providing the Fiat within this transaction? You make that market yourselves?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yes, our OTC desk.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>OK, great. And what kind of fees are you charging?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So we're not charging fees. Just the spread. So we've been thinking about something like this for a long time, and we have been consciously, unconsciously planning our business run towards this direction. And we realized, you know, to actually make the Stripe for cryptocurrency payments, you have to bootstrap from somewhere else. You can't just keep raising venture capital money. You have to have a piece that solves your forex, right? And in this case it's have the OTC desk that you plugged in and you trust, you manage and we decided to build that ourselves.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So, it's interesting. You've said earlier that the best time to deploy a mining operation is at the bottom. If you look at the Lightning Network network capacity, I think back in July network capacity was around twelve million dollars, today it's someone close to seven million dollars. Do you think the best time to deploy a Lightning Network-type application is also at the bottom of that?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So I think when it comes to deploying Lightning Network applications, it's less sensitive to where the price is--and obviously everything in this space is indirectly and directly influenced by price--but I think it really has more to do with the fundamental advances in Lightning as technology. I think in the past year we've seen a lot of very good progress in this space because at the end of the day, Lightning is still a very new thing, and there are a lot of risks associated with it, and people who either invest or build business on it have to be very careful and have to start with smaller scale. So I'm really not concerned about Lightning channel capacity, just going from twelve million to 7 million. I think the general trend is still increasing. We'll definitely see more and more developers come into this space and building on top of Lightning. So I think everything is moving towards the right direction.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Why do you think there's an appetite to transact in a volatile medium of exchange versus something like a stable coin? And we're starting to see some Lightning-type equivalents emerge on Ethereum, I'm thinking specifically projects like Connect that offer similar payment channel solutions but use DAI stable coin as the primary medium of exchange.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So I think stable coin doesn't quite solve a fundamental issue where--and this is obviously a very old discussion--and I think, you know, Bitcoin as a very superior settlement network has all the characteristics that regular stable coins don't have. Or just, you know, stable coin that's been set up by a centralized entity. So all these arguments that why Bitcoin is Bitcoin is pretty well understood. But come back to why people would transact on this volatile network, right? This is definitely a friction, and the way that we want to, at least our approach to solving or helping with this friction, is by making sure that the transfiguration from USD to BTC and BTC back to USD is as fast and frictionless as possible so that commerces who may want to use BTC as a payment rail can go in and out of the USD to BTC very quickly. So to them, hopefully--obviously this is a this is going to take several years before this becomes a comfortable infrastructure for this type of commerce--hopefully the experience is so flawless that they don't even realize they're transacting on top of BTC, but at the same time they get all the benefits of using BTC as a settlement network.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>If they're eventually just transitioning back into Fiat, what exactly are these advantages that Bitcoin as a settlement network provides?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So, yeah. So some business--and obviously this is, I think we're just touching the tip of the iceberg here, and my own imagination is not expensive enough to even cover the wide variety of possibilities of a type of business that can be built on a Lightning network. We have started to see some of the prototypes of several directions, right? You can--digital paywall is definitely one thing. E-commerce is another thing. And, just, you know, there's a shitcoin called basic attention token that was all the hype several years ago. So I think what they're trying to do is right. But this can be done much better on Lightning. So stuff like that and also more in the meatspace commerces that have trouble getting banking on a federal level, namely marijuana businesses. They're you know, they're perfectly OK on state-level, but they can't--they're still using cash as primary means of transaction. So for these people having their transactions being denominated in USD, they think about their accounting and everything still in USD terms, but at the same time, they can, you know, accept transactions in BTC is a good way to solve their solution to having to have bodyguards guard their boxes of cash.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Are you guys at all exposed to some of that regulatory risk, as the ones kind of settling these transactions?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So for that, it's just an example..","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>But that is the available addressable market right now, right?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. It's just one of the addressable markets.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>And you were telling me earlier that Iterative is actually allocating a lot of resources internally to the Escher project. Can you tell us a bit more about that?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So I think for us, this is the thing to build. I think in order to for Bitcoin to truly become usable by commerce, the on-ramp and off-ramp needs to be solved. And by solved, I mean the experience has to be as frictionless as possible. And right now, you know, all the on-ramp\/off-ramp options are more or less restrictive. They have large spread or they have fees or they takes forever for you to withdraw. And sometimes you don't you can't withdraw at all. So. Right now, I think up to this point, Bitcoin is very much dominated by the supply side, and by supply side, I mean the miners, right? These people, they amass a large amount of coins, and they do whatever they want with the rest of the market. So in order for the demand side to really match, the user experience has to be very easy and very easy for traditional commerces or new-type commerces to use this as a settlement network. So solving the on-ramp, off-ramp piece, we at least we think is a priority, and that's something that we want to address. And I think developing supply side first is very common for a commodity business. If you look at, you know, oil industry, especially in the early eighteen-hundreds, that's exactly how it was developed as well. People were expecting this to be a replacement--sorry, oil as a replacement to whale fat, right? They would discard diesel and gasoline just to keep that kerosene. So--and obviously that changed very drastically over time as more applications of oil, such as automobile, show up--so I think for a commodity like Bitcoin, we'll probably see a very similar pattern as well. We'll see some more very novel applications of new type of digital commerces, or even just some of the traditional business that will benefit from having BTC as a settlement network, show up and be the automobile of Bitcoin.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Fascinating. I think it'd be worthwhile to just talk a little bit about you for a second. You have a very interesting history and traditional financial markets. Sequoia Capital China. You were an equity derivatives analyst at Morgan Stanley. Walk us through a little bit about your background and how you found your way not only to Iterative Capital but cryptocurrency as well? What's your rabbit hole story?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Like I mentioned earlier, I was born and raised in China. I spent most of my time in, you know, early days in China went through a very traditional Chinese education system. And I came to U.S. for college. I studied mathematics in school. So I think the first time I start looking at Bitcoin seriously, it was 2014. I had this really annoying V.C. friend who just kept talking about it. Was I OK, I'll take a look. And I was absolutely fascinated.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>It was Dan Moorhead.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>This kid now moved on to build some VR applications. But anyways, that's beside the point. And, at the time, even people like Myron Scholes of black-Scholes started talking about digital currencies. So I realized that was this is definitely not just an elegant theoretical design, there's definitely something more substantial there. So I was sort of, you know, tricked into joining Morgan Stanley full-time because I had an amazing summer internship in my junior year, and my boss on that team told me, \"This is the best job in the world,\" and so I just returned for full-time. And during my time at Morgan Stanley, I just continued to pay attention to Bitcoin and my interest grew. I started going to meet-ups and started talking to people in the space. And I think around 2016, I realized, \"Oh, I have to do this full time.\" So I started looking for opportunities in space. There are not many jobs that fit my interests or would sponsor Visa. In 2017, someone should use me to Chris Denton at Iterative. So I had a breakfast and the conversation was very pleasant. I realized a lot of the things with how we think about the space were more or less on the same frequency--wavelength, sorry. And I'm not a native English speaker.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>You sound Beautiful.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>I think it's my deep voice. And so we started discussing the possibility of working, I mean, working full time. So I joined the firm as the first employee. There were three of us at that time and we gradually grew from there.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Is there any way you can help us understand the size or scale of Iterative. I know you want to be--and you know, we can put this out of the podcast if it makes you uncomfortable--but again, is there any way you can help us understand the size and scale of Iterative for people who haven't heard of it, because you because you guys do fly a little bit under the radar and keep a more low key presence, is there a reason for that just to sort of have the allure and the sex appeal of being a little more..?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>I think we're just not very conscious about marketing. And frankly, I think because of the direction that we took, we chose to focus on mining space instead of, you know, VC, I think we didn't think we have that much to show to the public until Escher was ready for the rest of the world. So we definitely want to, we're definitely going to become more public in order to make sure that Escher gets in front of everyone's attention. But I think with mining there's really not much to show.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Is Escher something that you would like to raise external capital for, or will that be fully self-funded?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>So we funded it ourselves in the beginning. But gradually as this thing scales, we definitely would love to have some strategic capital or just partners who can offer us resources to help us grow, to come in to our cap table.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>And for the mining operations, as well as, is that structured as a fund with LPs, or did you just completely do away with the fund structure and it's more of a standard equity type?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So we actually have experimented with both structures, a hedge fund structure with quarterly subscription as well as, you know, the typical LLC that people invest in equity. So we're still weighing the pros and cons of each structure and there are definitely some nice things with the fund structure and there's definitely more convenient things with the LLC structure where people just, you know, are investing equity. So in the future. I think it really depends on the timing and also the environment at a time when we raise for the next fund.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>One final question I wanted to ask you. We're starting to see more and more players emerge in the validations, staking as a service space. Even funds like Polychain have this vehicle, Polychain Labs where they serve as validators and delegates in some of these networks. I understand that the operations are fairly different, and the way in which you build an edge is actually different as well, but is that something that you guys are looking into at all, or there's absolutely no interest to participate on that side.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Yeah. So at the current point, there's absolutely no interest. Personally, I just speak for myself, I don't have a, you know, patricular problem with proof of stake other than it's just not proven by--I am aware that there are a lot of things with pure proof of stake that's just not proven, especially at scale--so for me, it's just really just the timing is not right. And I know there are a lot of variations proof of stake that's showing up to the market. Which I don't think carries the appeal of a true cryptocurrency as a settlement system.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>So there is money to be made there, clearly.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>Oh, for sure. Absolutely. Just, you have to be an insider.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Sure. So it's more a function of you guys not having the inside knowledge to operate in that space rather than ideological leanings.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>I think a lot of people like to think they're insiders, but there's always, you know, another insider who's more inside.","<strong data-v-f87c67ca=\"\">Matteo Leibowitz <\/strong>Who are the insiders?","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>I mean, depends on the project, right? In EOS, I mean, obviously we know insiders are. Ethereum I think to a lesser extent, but they're definitely there. Bitcoin even to a lesser and lesser extent, but they're definitely, definitely there. So I think it really they're really, you know, a commodity business. There are two ways of making money. One is in a commodity game that's very fair, open, something that Bitcoin is approaching. Obviously, Bitcoin is still not perfect yet in terms of the number of whales that's point sloshing the market around, but it's relatively the most fair commodity game compared to the other ones. So in this game you can start building, you know, you can build the application servers, being a service provider that helps people getting onto the onboarding and using this kind of system and in turn, you get compensated. Alternatively, you can be the sole dominant player on the network and just corner the market. And this is this type of game is pretty well understood by commodity traders for decades. So if you can't really make sure that you're the dominant player on that cryptocurrency network, you might as well just don't play.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>Interesting. Well, Leo Zhang, we appreciate you so much for coming onto the show. Leo Zhang, ladies and gentlemen, Research Lead at Iterative Capital. The Man, The Myth, The Miner and the Legend. I finished my whiskey. We finished the podcast.","<strong data-v-f87c67ca=\"\">Leo Zhang <\/strong>And I almost finished my coffee.","<strong data-v-f87c67ca=\"\">Frank Chaparro <\/strong>And we'll see you guys next time. Thanks so much.","&nbsp;"," 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"West Texas","content":"LOCATION"},{"type":"November 2013","content":"DATE"},{"type":"twelve million dollars","content":"MONEY"},{"type":"Shenzhen","content":"LOCATION"},{"type":"Bitmain","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Chengdu","content":"LOCATION"},{"type":"New York State","content":"LOCATION"},{"type":"Matteo Leibowitz","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"37 million dollars","content":"MONEY"},{"type":"Teo Leibowitz","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Q2 of 2019","content":"DATE"},{"type":"U.S","content":"LOCATION"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"Beijing","content":"LOCATION"},{"type":"Leibowitz","content":"PERSON"},{"type":"Leo Zhang <\/strong>So","content":"PERSON"},{"type":"Sequoia Capital China","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Frank Chaparro <\/strong>Interesting","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Alex","content":"PERSON"},{"type":"Escher","content":"PERSON"},{"type":"60 percent","content":"PERCENT"},{"type":"last year","content":"DATE"},{"type":"Leo Zhang","content":"PERSON"},{"type":"seven cents","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"ups","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"Bitmain","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"March, April","content":"DATE"},{"type":"Whitestone US","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"Iterative Capital Management","content":"ORGANIZATION"},{"type":"Angie Jung","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"three cents","content":"MONEY"},{"type":"London","content":"LOCATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Chris Denton","content":"PERSON"},{"type":"90 million dollars","content":"MONEY"},{"type":"Leo","content":"PERSON"},{"type":"Northern Bitcoin A.G.","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"MatrixPort","content":"ORGANIZATION"},{"type":"several years ago","content":"DATE"},{"type":"100 percent","content":"PERCENT"},{"type":"El Paso","content":"LOCATION"},{"type":"Young","content":"PERSON"},{"type":"Jihan Wu","content":"PERSON"},{"type":"seven thousand dollars","content":"MONEY"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"TSMC","content":"ORGANIZATION"},{"type":"Jihan","content":"PERSON"},{"type":"Chaparro <\/strong>Well","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Essure","content":"LOCATION"},{"type":"Micree","content":"ORGANIZATION"},{"type":"Scholes","content":"PERSON"},{"type":"O.G.","content":"LOCATION"},{"type":"Spotify","content":"LOCATION"},{"type":"Chicago","content":"LOCATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Jihan","content":"ORGANIZATION"},{"type":"seven million dollars","content":"MONEY"},{"type":"Micree","content":"PERSON"},{"type":"A.I.","content":"LOCATION"},{"type":"North America","content":"LOCATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"39 million dollars","content":"MONEY"},{"type":"Iterative Capital","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"USD","content":"LOCATION"},{"type":"Polychain Labs","content":"ORGANIZATION"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"Blockfi","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"7 million","content":"MONEY"},{"type":"Chaparro <\/strong>Canaan","content":"PERSON"},{"type":"Litecoin","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Leo Zhang <\/strong>Yeah","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"23.3 percent","content":"PERCENT"},{"type":"400 million","content":"MONEY"},{"type":"Myron Scholes","content":"PERSON"},{"type":"2.3 cents","content":"MONEY"},{"type":"Canaan","content":"LOCATION"},{"type":"MatrixPort","content":"PERSON"},{"type":"Chaparro <\/strong>Yeah","content":"PERSON"},{"type":"Angie Jong","content":"PERSON"},{"type":"200 million dollar","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Dan Moorhead","content":"PERSON"},{"type":"Middle East","content":"LOCATION"},{"type":"IPO","content":"ORGANIZATION"},{"type":"Micree Zhan","content":"PERSON"},{"type":"Intel","content":"ORGANIZATION"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Matteo Liebowitz","content":"PERSON"},{"type":"Whatsminer","content":"PERSON"},{"type":"Whatsminer","content":"LOCATION"},{"type":"V.C.","content":"ORGANIZATION"},{"type":"five billion dollars","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Szechuan","content":"LOCATION"},{"type":"October","content":"DATE"},{"type":"Polychain","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","Matteo Leibowitz","The Block"]}