{"summary":"A new class action takes aim at crypto wallet operator Ledger and e-commerce giant Shopify over a customer data breach. \nHundreds of thousands of Ledger customers saw their personal data exposed at the hands of a “rogue Shopify employee.”\nThe degree to which Ledger and Shopify communicated with customers about the ongoing breach and their respective responsibility for phishing victims that resulted are likely to be critical points of the case. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/100860\/ledger-shopify-class-action-lawsuit-filed","publishDate":"2021-04-08T11:31:04","id":1346,"type":null,"title":"Class action lawsuit filed against crypto wallet firm Ledger, Shopify over 2020 customer data breach","category":["Legal"],"content":["Ledger and Shopify, which handles the online sales of Ledger's wallets, have been hit with a class action over last year's data breach.","Ledger produces some of the most popular cold wallets on the market.","The summer of 2020 saw news spread of phishing attacks against Ledger users, with the firm ultimately disclosing that it <a href=\"https:\/\/www.theblockcrypto.com\/post\/73238\/ledger-data-breach-customer-emails\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">suffered a data breach that June<\/a> during which customer contact and order information was compromised. In December, a database containing the personal information for more than <a href=\"https:\/\/www.theblockresearch.com\/a-detailed-look-at-the-ledger-data-leak-and-other-recent-incidents-88706\" data-v-f87c67ca=\"\">a quarter-million<\/a> Ledger customers was posted online.&nbsp;","Ledger and Shopify eventually identified a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/91054\/ledger-bitcoin-bounty-information\" data-v-f87c67ca=\"\">rogue Shopify employee<\/a> as responsible for the leak, but not before some users reported threats of home invasion and other scareware tactics. At the time, Ledger CEO Pascal Gauthier <a href=\"https:\/\/twitter.com\/_pgauthier\/status\/1341084662752489472\" data-v-f87c67ca=\"\">took to Twitter<\/a> to reassure users that their hardware wallets had not been compromised and that their funds were safe. Nonetheless, <a href=\"https:\/\/www.financemagnates.com\/cryptocurrency\/news\/sued-into-oblivion-ledger-users-threaten-legal-action-after-data-dump\/\" data-v-f87c67ca=\"\">talk<\/a> of starting a <a href=\"https:\/\/ledger-claim.com\/\" data-v-f87c67ca=\"\">class-action<\/a> case began soon after.","The lawsuit, the first to be filed in response to the information leak, comes from law firm Roche Freedman, which filed the complaint in a San Francisco court on April 6. The firm is known for its class actions against crypto firms such as <a href=\"https:\/\/www.theblockcrypto.com\/post\/60930\/top-crypto-exchanges-token-issuers-named-in-friday-barrage-of-u-s-class-action-lawsuits\" data-v-f87c67ca=\"\">Binance, Tron<\/a> and <a href=\"https:\/\/www.theblockcrypto.com\/post\/42528\/fear-and-loathing-on-the-blockchain-liebowitz-et-al-v-ifinex-et-al\" data-v-f87c67ca=\"\">iFinex<\/a>, the parent company of Tether and Bitfinex. Last week, Roche Freedman filed a lawsuit on behalf of a customer of Nexo, as reported by <a href=\"https:\/\/www.law360.com\/california\/articles\/1371847\/nexo-users-say-crypto-lender-wrongly-suspended-xrp-use\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Law360<\/a>.&nbsp;","Regarding the Ledger breach, law firm partner Kyle Roche told The Block, \"We've been investigating this since the day it became public. This investigation included speaking with experts in the data security and cryptocurrency fields.\"","In a statement, Ledger general counsel Antoine Thibault said: \"Ledger does not comment on ongoing legal issues. Ledger would however like to take this moment to remind our customers, yet again, never to divulge their 24 words and validate the identity of the recipient of your transactions. You are in sole and total control of access to your funds.\"","The case will hinge on the question of who is responsible for what. Ledger's wallets themselves were not compromised, but the complaint includes the security of Shopify's service as part of Ledger's duty to clients. As noted in the complaint: \"[b]y operating in the crypto-asset security space, Ledger places itself between user’s funds and would-be hackers. The anonymity of its customer list is a key and obvious element of the security that Ledger offers.\"&nbsp;","Central to delegating responsibility will be the question of what Ledger and Shopify knew and how quickly they communicated that information to users. As Roche told The Block: \"The case is noteworthy because two very large and sophisticated companies handling sensitive information will need to explain why it took them so long to warn their customers about such an awful and highly damaging incident.\"","The current complaint does not specify the amount of relief that it seeks for the class, but it does identify the \"[m]atter in controversy\" as worth over $5 million. Currently, the complaint references only two Ledger users directly, who together lost 4.2 BTC, 11 ETH and 150,000 XLM to phishing attacks. At today's prices, those holdings add up to $340,000, but were worth significantly less as of the time of the attacks.&nbsp;","<em data-v-f87c67ca=\"\">A copy of the complaint can be found below:<\/em>","<a title=\"View Ledger Shopify Complaint on Scribd\" href=\"https:\/\/www.scribd.com\/document\/502073705\/Ledger-Shopify-Complaint#from_embed\" data-v-f87c67ca=\"\">Ledger Shopify Complaint<\/a> by <a title=\"View MichaelPatrickMcSweeney's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/265494999\/MichaelPatrickMcSweeney#from_embed\" data-v-f87c67ca=\"\">MichaelPatrickMcSweeney<\/a> on Scribd","<iframe frameborder=\"0\" height=\"600\" src=\"https:\/\/www.scribd.com\/embeds\/502073705\/content?start_page=1&amp;view_mode=scroll&amp;access_key=key-xeVq790HKMRCz80vR8UU\" title=\"Ledger Shopify Complaint\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>"],"hashtag":[]}