{"summary":"The incoming leader of the House Financial Services Committee has re-introduced legislation to make financial regulators more fintech friendly.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196382\/incoming-house-chairman-wants-regulators-to-form-offices-of-innovation","publishDate":"2022-12-19T15:06:48","id":13473,"type":null,"title":"Incoming House chairman wants regulators to form offices of innovation","category":["POLICY"],"content":["The incoming chair of the House Financial Services Committee wants regulators to \"to modernize and streamline how innovators interact with regulators,\" and grant offices of innovation the power to create \"regulatory sandboxes.\"&nbsp;","Patrick McHenry of North Carolina, the lead Republican and <a href=\"https:\/\/www.theblock.co\/post\/193123\/pro-fintech-republican-mchenry-officially-named-next-house-financial-services-chair\" data-v-f87c67ca=\"\">soon-to-be chair<\/a> of the House Financial Services Committee, has <a href=\"https:\/\/republicans-financialservices.house.gov\/news\/documentsingle.aspx?DocumentID=408497\" data-v-f87c67ca=\"\">re-introduced<\/a> his Financial Services Innovation Act for the third time. The re-introduction signals that he plans to advance the bill further when he becomes committee chairman in the next Congress.&nbsp;","The bill mandates that the federal financial regulators create \"Financial Services Innovation Offices\" that would \"establish procedures to reduce the time and cost of offering a financial innovation to the public and enable greater access to financial innovations.\"","That includes allowing companies to apply for alternative compliance plans, and to waive or modify regulations in order to enable the company to provide services that might otherwise run afoul of those rules. The Consumer Financial Protection Bureau provided <a href=\"https:\/\/www.consumerfinance.gov\/about-us\/newsroom\/cfpb-issues-order-to-terminate-upstart-no-action-letter\/\" data-v-f87c67ca=\"\">two no-action letters<\/a> to fintech lender Upstart in order to experiment with its algorithmic underwriting model, before the company terminated the agreement earlier this year.&nbsp;","Some regulators already have specialized innovation offices, like the Securities and Exchange Commission's FinHub, the Office of Technology Innovation at the Commodity Futures Trading Commission and the Office of Competition and Innovation at the Consumer Financial Protection Bureau.&nbsp;","The federal financial regulators would also have to publish lists of existing regulations that they would consider waiving for financial services firms using new tech.&nbsp;","<em data-v-f87c67ca=\"\">Correction, 12\/20\/22: The original version of this article referred to LabCFTC, which reconfigured into the CFTC's Office of Technology Innovation earlier this year.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"North Carolina","content":"LOCATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Office of Competition and Innovation","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"Office of Technology Innovation","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"\"Financial Services Innovation Offices","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kollen Post","The Block"]}