{"summary":"The FTX debtors entered into confidentiality agreements with 59 parties interested in buying businesses including LedgerX and Embed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200224\/ftx-businesses-including-ledgerx-draw-interest-from-over-100-potential-buyers","publishDate":"2023-01-09T13:26:31","id":13476,"type":null,"title":"FTX businesses including LedgerX draw interest from over 100 potential buyers","category":["COMPANIES"],"content":["Around 117 parties are interested in buying four FTX businesses: LedgerX, Embed, FTX Japan and FTX Europe, according to court documents.","The FTX debtors have entered into confidentiality agreements with 59 of the parties, according to a filing in the crypto exchange’s bankruptcy case.","Roughly 117 parties are interested in buying entities of the FTX, according to a new legal filing in the troubled crypto exchange’s bankruptcy case.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The crypto giant filed for bankruptcy protection in November after a run on its native utility token. FTX’s bankruptcy filing included more than 100 entities, and the firm could owe $3.1 billion to its top 50 creditors.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Lawyers representing the FTX debtors in the bankruptcy process have prioritized selling four businesses that include Embed, LedgerX, FTX Japan and FTX Europe.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The four entities are relatively independent from FTX, attorney Kevin Cofsky said in a legal filing on Sunday, and their value may decrease during the bankruptcy case if they are not sold. Cofsky is a partner at Perella Weinberg Partner, the investment bank representing FTX US and affiliated companies that have filed for bankruptcy protection.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The debtors have entered into confidentiality agreements with 59 of the 117 parties who are interested in buying the FTX entities. Approximately 50 parties are interested in Embed, 56 are interested in LedgerX, 41 are interested in FTX Japan and 40 are interested in FTX Europe, according to the filing.","An initial hearing on <a href=\"https:\/\/www.theblock.co\/post\/195579\/ftx-asks-court-permission-to-sell-off-four-businesses-including-ledgerx\" data-v-f87c67ca=\"\">the sales<\/a> had been set last month for Jan. 11, though the number of interested parties and other moving parts of the massive bankruptcy proceeding could affect that timing.&nbsp;&nbsp;","<em data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"Kevin Cofsky","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$3.1 billion","content":"MONEY"},{"type":"FTX Japan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Jan. 11","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Perella Weinberg Partner","content":"ORGANIZATION"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"FTX Europe","content":"LOCATION"},{"type":"Embed","content":"LOCATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}