{"summary":"Grayscale CEO Michael Sonnenshein is worried the SEC might impose new rules on the crypto industry that would make it more expensive and inefficient to custody assets for clients.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/230148\/grayscale-worried-sec-ban-coinbase","publishDate":"2023-05-10T06:25:33","id":13479,"type":null,"title":"Grayscale is worried the SEC may drive up costs for crypto custodians","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Grayscale Investments is worried that the SEC may impose new regulations “that would impose significant new costs, risks, and burdens without added benefit” on crypto custodians, according to CEO Michael Sonnenshein, in <\/span><a href=\"https:\/\/www.sec.gov\/comments\/s7-04-23\/s70423-186239-340202.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a letter to the SEC dated May 8<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/www.theblock.co\/post\/229944\/a16z-sec-crypto-regulation-investment-advisers-coinbase\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">SEC wants to make investment advisers responsible for safeguarding the custody of assets<\/span><\/a><span data-v-f87c67ca=\"\"> they control for clients. Such a rule could be a problem for centralized exchanges or any platform that manages clients’ assets. Exchanges typically hold customer funds in commingled accounts and credit customers for their value, rather than providing an individual wallet for each customer. The SEC's proposal would make that illegal. The proposal might also ban investors from using an unqualified third party to store their clients' funds.<\/span>","<span data-v-f87c67ca=\"\">Grayscale controls the Grayscale Bitcoin Trust and the Grayscale Ethereum Trust, which it claims are the largest crypto funds of their kind. GBTC holds $17.4 billion and ETH holds about $5.6 billion, the company told The Block.<\/span>","<span data-v-f87c67ca=\"\">Currently, the entirety of those funds is held by Coinbase via the Coinbase Custody Trust Company, Sonnenshein told the SEC. Coinbase is a “qualified custodian” under the law. <\/span><a href=\"https:\/\/www.coinbase.com\/blog\/welcoming-grayscale-the-worlds-largest-crypto-fund-to-coinbase\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The funds have been there since 2019<\/span><\/a><span data-v-f87c67ca=\"\">. Coinbase Custody holds Grayscale's assets in offline cold storage, via unique onchain addresses, and are never commingled with other clients' funds, according to <\/span><a href=\"https:\/\/grayscale.com\/wp-content\/uploads\/2022\/11\/Coinbase-Safety-and-Security-Letter.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the agreement between Grayscale and Coinbase<\/span><\/a><span data-v-f87c67ca=\"\">. Coinbase custody is a qualified custodian and will likely remain so under the new rule.<\/span>","<span data-v-f87c67ca=\"\">Previously, Grayscale stored cold wallets via a company called Xapo Inc. “Xapo’s custody model relied on geographically dispersed physical vault locations around the world, which changed regularly,” he wrote.<\/span>","<span data-v-f87c67ca=\"\">“As an institutional-grade asset manager, we do not ourselves custody client assets. Instead, we engage expert third-party custodians to provide this service, as is the norm for traditional asset managers. In our ten years of operation, our custodians have never experienced a loss of client assets,” Sonnenshein told the SEC.<\/span>","<span data-v-f87c67ca=\"\">In traditional finance, custody of assets has often been held by a separate banking bodies from the brokers and clearing houses who place deals and trades. But many crypto businesses have grown up without divisions, and custody, brokering and clearing are done by the same platforms. That has made the more efficient, Grayscale chief legal officer Craig Salm told The Block.<\/span>","<span data-v-f87c67ca=\"\">Imposing tradfi rules on crypto might add in unnecessary time-lags and inefficiencies, Salm said. “As the largest digital currency asset manager with the longest-running track record , we would caution the SEC against taking any action that would impose additional burdens without adding any benefits,” Salm said.<\/span>","<span data-v-f87c67ca=\"\">“Coinbase Custody also uses specific, industry leading practices in its policies, procedures, and controls for safekeeping and maintaining exclusive possession or control over digital assets that it custodies to protect against the theft, loss, and unauthorized and accidental use of the private keys necessary to access and transfer the digital assets it holds in custody,” Sonnenshein’s letter to the SEC says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“In short, the methods that we and others rely on to safeguard client assets work, and we caution the Commission against taking action that would impose significant new costs, risks, and burdens without added benefit.”<\/span>","<a href=\"https:\/\/www.theblock.co\/post\/229944\/a16z-sec-crypto-regulation-investment-advisers-coinbase\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Coinbase has also complained about the proposed rule<\/span><\/a><span data-v-f87c67ca=\"\">. “The proposal would ban [registered investment advisers] from trading on non-QC [qualified custodian] crypto exchanges,\" Chief Legal Officer Paul Grewal said in a tweet yesterday. \"This wouldn’t benefit RIAs or their clients and would in fact harm them. Thus the SEC should allow limited non-QC exposure so RIAs can trade crypto for their clients.”<\/span>","<span data-v-f87c67ca=\"\">The SEC’s comment period closes this month.<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Correction: The original version of this story incorrectly described the effect of the SEC’s proposed rule change on qualified custodians. The proposals are unlikely to affect Grayscale or Coinbase because Coinbase would remain a qualified custodian under the rule change. The story also understated the size of the assets under management at Grayscale.<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grayscale Ethereum Trust","content":"ORGANIZATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Coinbase Custody Trust Company","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$5.6 billion","content":"MONEY"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Sonnenshein","content":"PERSON"},{"type":"Xapo Inc.","content":"ORGANIZATION"},{"type":"Craig Salm","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$17.4 billion","content":"MONEY"},{"type":"May 8","content":"DATE"},{"type":"Salm","content":"PERSON"},{"type":"Michael Sonnenshein","content":"PERSON"},{"type":"Paul Grewal","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Jim Edwards","The Block"]}