{"summary":"A Utah man solicited investors in a $2 million bitcoin commodity pool scheme and made empty promises to investors through fake spreadsheets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/249987\/utah-man-settles-with-cftc-will-pay-2-5-million-over-bitcoin-commodity-pool-scheme","publishDate":"2023-09-08T12:59:53","id":13487,"type":null,"title":"Utah man settles with CFTC, will pay $2.5M over bitcoin pool scheme","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A Utah man solicited investors in a $2 million bitcoin commodity pool scheme, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">made empty promises to investors through fake spreadsheets, and lied about why he couldn't pay out when he lost almost all the funds, according to the Commodity Futures Trading Commission.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Jacob Orvidas, 28, settled with the agency on Friday and will pay $2 million back to investors, as well as a $500,000 monetary penalty. He'll face a 10-year registration and trading ban, the CFTC said in a <a href=\"https:\/\/www.cftc.gov\/PressRoom\/PressReleases\/8775-23?utm_source=govdelivery\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Beginning in 2017, Orvidas allegedly solicited four people to trade leveraged bitcoin in a commodity pool, telling them he'd deliver \"<\/span><span class=\"s2\" data-v-f87c67ca=\"\">equal proportionate profits based on each’s contribution level,\" the agency said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Orvidas told one investor that another client \"contributed $100,000 worth of bitcoin and cashed out at $2.7 million.\" That wasn’t true, according to the CFTC.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Separately, Orvidas told the same pool participant that 'Crypto trading is a joke. It’s like printing money . . . . It’s nice when you have coins to margin trade on because you can open a high leverage short, dump your bags, and make a massive profit on the short,'\" the CFTC said.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Orvidas admitted to the factual findings and legal conclusions, except for the finding about the amount of total restitution owed to the pool participants. The Securities and Exchange Commission and the CFTC worked together on the case.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Orvidas settled as well with the SEC on Friday over securities law violations.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"Protecting ordinary people has always been at the heart of the CFTC's digital-asset enforcement program,\" CFTC Director of Enforcement Ian McGinley said. \"While digital-asset cases are often complex, this bitcoin case is a straight-up fraud: simple and old as time. We will continue to deploy every weapon in our arsenal to fight fraud in all our markets.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">CFTC Commissioner Christy Goldsmith Romero warned investors about fraud in the crypto space, offering tips such as checking registration status and looking out for \"too good to be true\" profits.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Jacob Orvidas case is a cautionary tale,\" she said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"$2.7 million","content":"MONEY"},{"type":"Orvidas","content":"PERSON"},{"type":"Ian McGinley","content":"PERSON"},{"type":"$500,000","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Utah","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Jacob Orvidas","content":"PERSON"},{"type":"Friday","content":"DATE"}],"hashtag":["CFTC"],"authors":["Sarah Wynn","The Block"]}