{"summary":"Uniswap founder Hayden Adams hailed the court’s comments as “based” after a class action lawsuit alleging liability for scam token sales was thrown out.\nJudge Katherine Polk Failla dismissed the case, ruling that software cannot be held accountable for user losses or third-party damages.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248274\/uniswap-hayden-adams-based-scam-tokens-ruling","publishDate":"2023-08-31T07:30:14","id":1348,"type":null,"title":"Uniswap founder Hayden Adams hails &#x27;based&#x27; scam tokens ruling","category":["Legal"],"content":["Uniswap founder Hayden Adams hailed <a href=\"https:\/\/twitter.com\/haydenzadams\/status\/1696991910370411003\" data-v-f87c67ca=\"\">comments<\/a> from U.S. Southern District of New York Judge Katherine Polk Failla as \"based\" after a class action lawsuit alleging liability for scam token sales on the decentralized exchange was thrown out.","Judge Failla, who is also <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">presiding<\/a> over the Securities and Exchange Commission's case against Coinbase, dismissed a class action lawsuit in full against Adams, Uniswap Labs, the Uniswap Foundation and investors Paradigm, Andreessen Horowitz and Union Square Ventures. Judge Failla ruled that software cannot be held accountable for user losses or third-party damages, according to a <a href=\"https:\/\/www.docdroid.net\/APrJolt\/risley-v-uniswap-pdf\" data-v-f87c67ca=\"\">filing<\/a> on Tuesday.","\"Due to the protocol's decentralized nature, the identities of the scam token issuers are basically unknown and unknowable, leaving Plaintiffs with an identifiable injury but no identifiable defendant,\" Judge Failla stated.","Highlighting several comments from the court, Adams said on Wednesday it was \"highly motivating to see U.S. courts hold up arguments I’ve felt deeply for years.\" Among these was the court’s statement that \"it defies logic that a drafter of computer code underlying a particular software platform could be liable for a third-party's misuse of that platform [as] smart contracts are self-executing, self-enforcing code,\" and that \"the current state of cryptocurrency regulation leaves them without recourse.\"","Adams also pointed out the court's comment that the Plaintiffs' concerns were better addressed to Congress, that cases in this area typically concern lawyer and underwriter roles that decentralized exchanges were designed to eliminate and \"the Court sees merit in Defendants' counterpoint that this case is more like an effort to hold a developer of self-driving cars liable for a third party’s use of the car to commit a traffic violation or to rob a bank.\"","\"Overall I'm extremely happy to see how thoughtful some courts have been recently with regards to DeFi and crypto. DeFi is here to stay,\" Adams concluded.","The <a href=\"https:\/\/www.courtlistener.com\/docket\/63213270\/1\/risley-v-universal-navigation-inc\/\" data-v-f87c67ca=\"\">initial complaint<\/a>, filed in April 2022, accused the defendants of facilitating \"rampant fraud\" on the decentralized exchange and \"offered and sold unregistered securities.\" The plaintiffs had also demanded that Uniswap register with the Financial Industry Regulatory Authority.","The court drew a distinction between a protocol and its interface. Uniswap is a decentralized exchange protocol that anyone can access in a permissionless way. Developer Uniswap Labs operates a front-end website interface, which serves as a user-friendly gateway to the underlying protocol.","As Adams highlighted, the court also declined to \"stretch\" federal securities laws, suggesting that such expansions are the domain of Congress. The ruling also set a precedent by asserting that code developers shouldn't be held responsible for its misuse by others, adding that liquidity providers don't necessarily forfeit legal title when contributing to a decentralized exchange pool.","&nbsp;"],"hashtag":["COURT HEARINGS","DEXS","UNISWAP"]}