{"summary":"Growing up, Cathie Wood didn&#x27;t think she would end up founding a multi-billion dollar asset manager. She fancied herself doing one of two things: curing","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/12660\/cathie-wood-on-the-block-the-crypto-revolution-is-coming-jump-on-or-get-out-of-the-way","publishDate":"2019-02-21T18:30:16","id":13485,"type":null,"title":"Cathie Wood on The Block: The crypto revolution is coming - jump on or get out of the way","category":["PEOPLE"],"content":["Growing up, Cathie Wood didn't think she would end up founding a multi-billion dollar asset manager. She fancied herself doing one of two things: curing cancer or, if&nbsp;that failed, becoming a ballerina. Certainly, she did not see herself joining the financial world–or \"the dark side\"–as many of her young recruits referred to it.","But, while today she may not be a world-leading scientist, she believes being CEO of ARK Invest at least allows her to support those doing the groundbreaking work - be it in DNA laboratories, Tesla's factories, or blockchain startups.","\"We are funding 'disruptive innovation.' Tech-enabled innovation that is going to transform the way the world works...It's going to make a whole load of companies and stocks 'value traps'. They will either disappear or be consolidated away.\"","For Cathie, blockchain perfectly fits this disruption model (alongside autonomous vehicles and robots). Costs will go down, and demand will boom; just give it 10 years.","\"It is going to cause profound changes,\" Wood says. “I think it will be mainstream, ubiquitous\" for payment systems across industries, calling the tech a \"glorified distributed database.\"","She predicts–or wants–blockchain (it's unclear where the two separate) to most impact the \"inefficient and opaque\" financial services industry; a world she knows well as a Wall Street veteran. \"It's going to bring transparency and good behaviour back,\" Wood says, \"It'll be better cheaper, faster, and more productive...Most people won’t know they're on a new set of financial rails.\"","If you want evidence, look to the developing world she says.","\"Businesses are crucified when they try and do cross-border trading...They're just using bitcoin as a free transition of money,\" pointing to the likes of Kenya and Nigeria.","Clearly, ARK Invest is no ordinary asset manager - not least because it is one of a&nbsp;<a href=\"https:\/\/www.pionline.com\/article\/20180430\/PRINT\/180439998\/its-time-for-real-diversity-in-asset-management\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">handful of successful US asset managers with a female CEO<\/a>. But it's also unique for its overwhelming reliance on one particular research and networking tool, Crypto Twitter, which Wood says other portfolio managers dismiss for compliance reasons.","\"It's very easy [to cut through the noise]. If people are wasting our time...we just unfollow them,\" she says. \"Over time, we refine our networks and we're engaging with the communities we're researching in a highly effective way. It gives us a competitive advantage.\"","It was Twitter, for instance, that led ARK in 2015 to Coinbase. The exchange DM'ed ARK about sharing some exclusive data with them, which would later underpin one its most seminal papers; \"Bitcoin: Ringing the bell for a new asset class.\"&nbsp;","Through this, ARK has built an eclectic community of expert contributors - from professors to entrepreneurs - who each sign \"an exchange of knowledge\" agreement. ARK gets the expertise it needs for free, and the experts gain access to ARK's \"open source\"&nbsp;model.","And, it seems to be working; ARK’s exchange-traded funds nearly tripled their assets last year, <a href=\"https:\/\/www.bloomberg.com\/features\/2018-bloomberg-50\/?srnd=premium\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">according to Bloomberg.<\/a>","<strong data-v-f87c67ca=\"\">Leaving the status quo behind<\/strong>","There were two key motivations behind Wood's decision t<span data-v-f87c67ca=\"\">o found ARK in 2014, after over a decade at AllianceBernstein. Firstly, regulation - or rather what she says is a serious excess of it.<\/span>","<span data-v-f87c67ca=\"\">\"I came from traditional asset management. And compliance got in the way.\"<\/span>","Beyond that however, it's pure ideology, shaped from her early years in stock research and her faith in innovation to advance human welfare.","“I saw how most analysts underestimate how big a technically-enabled transformation will be,\" she says, recalling her colleague's \"crazy\" dismissal of concepts like wireless phones. And for most, little has changed.","\"What I'm seeing now in the public equity market is the most&nbsp;massive misallocation of capital in the history of the world.\"","<strong data-v-f87c67ca=\"\">Crypto investment<\/strong>","Wood may be bullish on crypto going mainstream, but she's selective.","<strong data-v-f87c67ca=\"\">\"<\/strong>From a currency point of view, there will be very few global digital currencies. I doubt it will be the totally private ones. I think regulators will blow those, like Zcash...I feel confident in&nbsp;bitcoin, and I love what the Decred<span data-v-f87c67ca=\"\">&nbsp;<\/span>people are doing.\"","She also believes the ecosystem still needs banks and long-term VCs that won't liquidate and destabilise their investments \"at a very early stage\".&nbsp;And, she warns, not all crypto firms will make it.&nbsp;&nbsp;","\"A lot of people didn’t do any homework. They just jumped on the bandwagon,\" she says. \"The best thing that happened to crypto was the bear market.&nbsp;A lot of hedge funds will go under, should go under.\"&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"AllianceBernstein","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"Kenya","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Cathie","content":"PERSON"},{"type":"Nigeria","content":"LOCATION"},{"type":"Cathie Wood","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}