{"summary":"Coinbase has been served a subpoena by a U.S. regulator in connection with ByBit, according to emails sent out by the exchange. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265009\/coinbase-tells-some-customers-it-received-subpoena-related-to-bybit","publishDate":"2023-11-28T12:06:48","id":13492,"type":null,"title":"Coinbase tells some customers it received subpoena related to Bybit","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase has alerted some users about a subpoena it received from a U.S. regulator involving crypto exchange Bybit, according to emails sent out by the exchange that were posted on social media.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">A person familiar with the matter confirmed the authenticity of the emails in a message sent to The Block.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"No action is required from you, but Coinbase may respond to the Subpoena unless served before November 30, 2023 with a motion to quash or other objection to the subpoena that has been filed with the Court - including by sending information concerning your Coinbase account to the Commodity Futures Trading Commission,\" the email read.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFTC did not respond to a request for comment, and Bybit declined to comment. Bybit, with CEO Ben Zhou at the helm, is headquartered in Dubai.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The CFTC has certain powers to conduct investigations, including through voluntary statements and subpoenas, according to its enforcement manual.&nbsp;<\/span><span class=\"s1\" data-v-f87c67ca=\"\">Laws also require Coinbase to collect information, including matters involving <a href=\"https:\/\/www.coinbase.com\/legal\/privacy\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">subpoenas<\/span><\/a>, the exchange said in a post in May.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"We may access, read, preserve, and disclose information when we believe it is reasonably necessary to comply with law, legal obligations, regulations, law enforcement, governmental, and other legal requests, court orders, or for disclosure to tax authorities,\" Coinbase said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Other federal agencies have sought subpoenas on crypto-related issues. Payments giant PayPal said earlier this month that it received a <a href=\"https:\/\/www.theblock.co\/post\/260641\/paypal-sec-subpoena-pyusd-stablecoin\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">subpoena<\/span><\/a> from the Securities and Exchange Commission relating to the PayPay USD stablecoin.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Coinbase itself has faced regulatory scrutiny from the Securities and Exchange Commission after it was <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">sued<\/span><\/a> in June for allegedly operating illegally as an exchange, broker and clearing agency. Shortly before, the SEC sued <a href=\"https:\/\/www.theblock.co\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">Binance<\/span><\/a> on similar charges, but also included allegations that the exchange lied to customers and misdirected capital to separate investment funds owned by former CEO Changpeng Zhao.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"earlier this month","content":"DATE"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"November 30, 2023","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Ben Zhou","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Sarah Wynn","Ryan Weeks","The Block"]}