{"summary":"Fidelity Institutional President Michael Durbin said there&#x27;s a growing place for digital assets in consumer portfolios.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179409\/fidelity-institutional-president-sees-room-for-more-crypto-in-consumer-portfolios","publishDate":"2022-10-24T11:24:32","id":13505,"type":null,"title":"Fidelity Institutional president sees room for more crypto in consumer portfolios","category":["INVESTMENTS"],"content":["There’s room for more digital assets in consumer portfolios, Fidelity Institutional President Michael Durbin said at a financial conference.","Fidelity Institutional is urging advisers to allocate a “meaningful amount” of risk budget when investing in bitcoin to guard against unpredictable market swings.","There is a growing opportunity to get more digital assets into consumer portfolios, according to Fidelity Institutional President Michael Durbin.","“As digital assets extend beyond cryptocurrencies and other sorts of wrapped tokens, or whatever the regulatory environment facilitates for us, we think there will be an increased funding for that portfolio construction,” Durbin said. “A basis to get more digital assets into the end consumer portfolios.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Durbin spoke at a Securities Industry and Financial Markets Association's annual meeting in New York City. The talk was moderated by SIFMA Chief Operating Officer Joseph Seidel.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","As consumer interest in digital assets grows, however, Durbin is urging investors to be conservative when assessing risk in the volatile crypto market. Fidelity Institutional will tell advisers to be careful in allocating risk budgets when investing in digital assets, Durbin noted.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“What we'll be putting out to advisors is just be careful in your risk budget if you're going to allocate any money to bitcoin for alpha creation,” Durbin said. “You better set aside a pretty meaningful amount of your risk budget, which can be defendable, but that's sort of the evolution we need to get into.”<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Fidelity has been quicker to embrace digital assets than most other large investment companies, including offering a bitcoin exchange-traded fund in Canada, multiple crypto and metaverse-related ETFs in the U.S. and allowing investment in bitcoin through the 401(k) retirement accounts it provides to employers. Durbin added that the company will continue to lean into digital assets, and that he sees Fidelity experimenting more with blockchain-related technology.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Michael Durbin","content":"PERSON"},{"type":"Durbin","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Securities Industry and Financial Markets Association","content":"ORGANIZATION"},{"type":"Joseph Seidel","content":"PERSON"},{"type":"Fidelity Institutional","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}