{"summary":"Bitcoin and ether perpetual futures funding rates are still elevated despite the spot prices of each asset falling in the past 24 hours.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283436\/bitcoin-and-ether-perpetual-futures-funding-rates-still-elevated-despite-downturn-in-spot-prices","publishDate":"2024-03-19T12:39:19","id":13509,"type":null,"title":"Bitcoin and ether perpetual futures funding rates still elevated despite downturn in spot prices","category":["MARKETS"],"content":["According to cryptocurrency derivatives trader Gordon Grant, the elevated funding rates indicate the persistence of speculator length, the extent to which speculators are willing to hold their positions in the market. He added that current elevated funding rates signaled the presence of \"diamond handed speculators, but speculators nonetheless.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Gordon Grant","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"}],"hashtag":["CRYPTO MOVERS"],"authors":["Brian McGleenon","The Block"]}