{"summary":"Reporting requirements for third-party business transactions over $600, enacted by the American Recovery Act of 2021, have been delayed until 2023.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/197778\/irs-to-delay-600-payment-platform-reporting-threshold-calls-2022-transition-period","publishDate":"2022-12-23T14:46:58","id":13502,"type":null,"title":"IRS to delay $600 payment platform reporting threshold, calls 2022 &quot;transition period&quot;","category":["TAX"],"content":["<span data-v-f87c67ca=\"\">The Internal Revenue Service is delaying new requirements that require third-party settlement organizations like PayPal and Venmo to report transactions that exceed a minimum threshold of $600 in aggregate payments until next year.&nbsp;<\/span>","\"The additional time will help reduce confusion during the upcoming 2023 tax filing season and provide more time for taxpayers to prepare and understand the new reporting requirements,\" <span data-v-f87c67ca=\"\">acting IRS Commissioner Doug O'Donnell said in a <a href=\"https:\/\/www.irs.gov\/newsroom\/irs-announces-delay-for-implementation-of-600-reporting-threshold-for-third-party-payment-platforms-forms-1099-k\" data-v-f87c67ca=\"\">statement<\/a> that described the current year as a \"transition period.\"<\/span>","Introduced as part of the American Rescue Plan of 2021, the regulation significantly lowered the tax reporting threshold for business transactions to $600 per year from a previous level of \"more than 200 transactions per year, exceeding an aggregate amount of $20,000.\"","\"The law is not intended to track personal transactions such as sharing the cost of a car ride or meal, birthday or holiday gifts, or paying a family member or another for a household bill,\" the IRS said, adding that the new reporting requirements would go into effect on Jan. 1, 2023. \"The change under the law is hugely important because tax compliance is higher when amounts are subject to information reporting.\"","<span data-v-f87c67ca=\"\">The IRS said that care must be taken “to help ensure that 1099-Ks are only issued to taxpayers who should receive them.”<\/span>","In a separate <a href=\"https:\/\/www.irs.gov\/newsroom\/treasury-irs-provide-transitional-guidance-for-broker-reporting-on-digital-assets\" data-v-f87c67ca=\"\">statement<\/a> on transition guidance for broker reporting on digital assets, the IRS said that brokers will not be required to report additional information with respect to dispositions of digital assets until final regulations are issued.","Brokers are still required to comply with existing laws and regulations, the agency added, clarifying that taxpayers are still required to report income received from transactions involving digital assets.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jan. 1, 2023","content":"DATE"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"1099","content":"DATE"},{"type":"$600","content":"MONEY"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"Doug O'Donnell","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"}],"hashtag":["IRS"],"authors":["Jeremy Nation","The Block"]}