{"summary":"Leading US crypto exchange Coinbase today rolled out a suite of new features, including a crypto basket that can be purchased in increments as small as","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/861\/coinbase-launches-new-basket-product-allowing-investors-to-buy-5-cryptos-with-one-click","publishDate":"2018-09-27T12:00:39","id":13507,"type":null,"title":"Coinbase launches new basket product, allowing investors to buy 5 cryptos with one click","category":["EXCHANGES"],"content":["Leading US crypto exchange <a href=\"https:\/\/blog.coinbase.com\/helping-people-understand-explore-and-buy-cryptocurrency-60ce415a0265\" data-v-f87c67ca=\"\">Coinbase today rolled<\/a> out a suite of new features, including a crypto basket that can be purchased in increments as small as $25. \"Buying a single cryptocurrency can be easy if you know what you want,\" the company said. \"But knowing which cryptocurrency to buy -- and feeling confident in the amount you purchase -- is where a lot people lose confidence. The Coinbase Bundle takes the opposite approach.\"","The bundle is a market-weighted basket of the five cryptocurrencies available on the exchange: bitcoin, bitcoin cash, ethereum, ethereum classic, and litecoin. At the time a customer purchases the bundle, Coinbase will calculate the appropriate market weights based on the prices of the underlying crypto assets. Those assets can later be sold individually by investors. The purpose of the bundle is to make buying more convenient and less \"overwhelming,\" Coinbase said.","\"The vision of an open financial system depends on people's ability to understand, explore, and choose cryptocurrencies,\" Coinbase noted. \"We expect that millions of people will make their first cryptocurrency purchase in the coming years. But all too often, getting started can be overwhelming for people learning about crypto for the first time.\"","Consumers purchase the bundle as a single transaction, but Coinbase in fact then stores each token as an individual investment in its corresponding wallet. This means that while you might buy a certain amount of bitcoin cash in your bundle, if you later decided to sell&nbsp;<em data-v-f87c67ca=\"\">just that token<\/em> while holding the others, it is simple to do so. Transaction costs for the bundle versus buying the individual currencies will be worth examining. Bundles roll out today and customers with verified identities in the US and Europe should see the feature in their accounts within a few weeks.","This isn't the first crypto basket product available, though. The team at Circle has created <a href=\"https:\/\/www.circle.com\/en\/invest\" data-v-f87c67ca=\"\">Circle Invest<\/a>, which allows one to buy 11 different tokens in a single investment -- with an even lower minimum of $10. Circle Invest has <a href=\"https:\/\/itunes.apple.com\/us\/app\/circle-invest\/id1334770744?_branch_match_id=496584614591863915\" data-v-f87c67ca=\"\">solid reviews on Apple's App Store<\/a>, though it isn't especially popular, ranking #734 in finance app, according to App Annie.","Still Coinbase's well-earned reputation in the US as one of&nbsp;<em data-v-f87c67ca=\"\">the<\/em> places to buy crypto might give it a chance to surpass Circle's success to date. In addition to rolling out bundles, Coinbase also is expanding its educational content on the site in two directions: a basic set of explainers on the nature of cryptocurrencies and blockchain along with summary pages on 50 different tokens.","The asset pages will describer the top 50 cryptos as measured by market cap and include price charts, historical data, links to white papers, et al. Coinbase notes that only 3% of investors can name more than four cryptocurrencies and it is expanding content around others in hopes of raising awareness of the diversity of tokens. Notably, however, the site is not saying this content will lead to more cryptos being traded there. We did report here at&nbsp;<em data-v-f87c67ca=\"\">The Block<\/em>, however, <a href=\"https:\/\/www.theblockcrypto.com\/2018\/09\/25\/coinbase-has-revamped-its-listing-policy-and-it-may-mean-new-coins-are-coming-to-certain-regions\/\" data-v-f87c67ca=\"\">Coinbase appears to be setting the stage for more tokens to trade on its exchange<\/a> -- at least in certain regions.","The explainers will be at&nbsp;<a href=\"https:\/\/coinbase.com\/learn\" target=\"_blank\" rel=\"noopener noreferrer\" data-saferedirecturl=\"https:\/\/www.google.com\/url?q=http:\/\/coinbase.com\/learn&amp;source=gmail&amp;ust=1538146763086000&amp;usg=AFQjCNEIcgnjmbEvP2bjwcmv9aCfik1q8A\" data-v-f87c67ca=\"\">coinbase.com\/learn<\/a>&nbsp;and are fairly elementary, including questions like \"What is bitcoin?\" and \"Is cryptocurrency legal?\" Most of the answers are designed to be digested in a paragraph or so. This kind of thing is always helpful to newcomers, though it is less clear that someone unfamiliar with crypto should be buying and selling tokens after simply skimming these questions and answers.","\"The questions and answers in this portal are inspired by customer research and vetted with people totally new to cryptocurrency with the goal of helping anyone decide with confidence whether buying cryptocurrency is right for them.\" Coinbase said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Circle Invest","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"$25","content":"MONEY"},{"type":"App Annie","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"}],"hashtag":["COINBASE"],"authors":["Mark Rogowsky","The Block"]}