{"summary":"GoldenChain and a wallet linked to Cumberland tipped the Sushi DAO vote to direct all protocol fees to the project’s treasury.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196213\/sushi-dao-votes-to-send-all-fees-to-treasury-but-it-was-a-fight-between-whales","publishDate":"2022-12-19T13:13:05","id":13501,"type":null,"title":"Sushi DAO votes to send all fees to treasury but it was a fight between whales","category":["CRYPTO ECOSYSTEMS"],"content":["Two large entities effectively decided the Sushi DAO vote to direct all fees generated by the SushiSwap decentralized exchange to the protocol’s treasury.","The move will mean that sushi token holders will <a href=\"https:\/\/www.theblock.co\/post\/192429\/sushiswap-proposes-to-direct-100-of-xsushi-revenue-to-treasury-wallet\" data-v-f87c67ca=\"\">no longer<\/a> receive rewards from trading fees on the exchange for a year or so, with the fees going to the project's treasury. The reasoning is that the entity behind SushiSwap needs more funding in the short term while it improves its long-term plan for sustainability.","<a href=\"https:\/\/forum.sushi.com\/t\/hello-from-goldentree\/11221\" data-v-f87c67ca=\"\">GoldenChain<\/a>, the digital investment arm of venture capital outfit Golden Tree, and a wallet closely tied to crypto trading firm Cumberland were the two entities. Together, they contributed 10 million sushipowah tokens — the Sushi DAO governance token — to push through the vote, according to <a href=\"https:\/\/snapshot.org\/#\/sushigov.eth\/proposal\/0xd817c716ff271f5141cfe112e1fd7b652f961b4c965852eb44d8ed1ec3a5d3b5\" data-v-f87c67ca=\"\">data<\/a> from the Snapshot voting page. Their combined voting power accounted for 91% of the 11 million tokens that were cast in support of the plan.","Those not in support cast 7.5 million sushipowah tokens, amounting to 41% of all votes in the pool. It should also be noted that 85% of these votes came from three wallets. They contributed 2.9 million, 2.4 million, and 1.1 million sushipowah tokens, respectively.","In total, these five large entities — voting both for and against — controlled 88.5% of all votes. This leaves little more than 10% of the vote to the remaining 774 wallets that also participated, albeit with little influence.","Previous Sushi DAO votes had seen fewer than 400 wallets participating in the process. This uptick in voting figures is likely due to the contested nature of the proposal.","Numerous DAO participants have shown their disagreement with the plan on the Sushi Dao forum. This is because the proposal takes away the reward given to users who stake their sushi tokens. They have also raised concerns over the fact that whales like GoldenChain have been able to dictate the outcome of the vote.","GoldenChain justified its decision to vote in favor of the proposal. Posting on the DAO forum, GoldenChain <a href=\"https:\/\/forum.sushi.com\/t\/reinstated-increase-kanpai-treasury-allocation-to-100\/11475\/137\" data-v-f87c67ca=\"\">stated<\/a> that the move was necessary to ensure SushiSwap’s long-term stability. GoldenChain did, however, call for more clarification on the way the move will be implemented.","<a href=\"https:\/\/www.theblock.co\/post\/179690\/sushiswaps-new-head-chef-describes-himself-as-a-wartime-ceo\" data-v-f87c67ca=\"\">Sushi Head Chef Jared Grey<\/a> introduced the <a href=\"https:\/\/forum.sushi.com\/t\/reinstated-increase-kanpai-treasury-allocation-to-100\/11475\/137\" data-v-f87c67ca=\"\">proposal<\/a> earlier in December. At the time, he stated that the move would last for one year or until the protocol adopts a new tokenomics model. Sushi is considering a pivot to the vote escrow tokenomics system. In this model, token holders are incentivized to lock up their assets for a long time to receive rewards.","The Sushi DAO’s treasury is currently worth <a href=\"https:\/\/etherscan.io\/address\/0xe94b5eec1fa96ceecbd33ef5baa8d00e4493f4f3\" data-v-f87c67ca=\"\">$12 million<\/a>. Most of the protocol’s holdings are in its native token, sushi. The DAO also holds $208,000 in the USDC stablecoin.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"91%","content":"PERCENT"},{"type":"88.5%","content":"PERCENT"},{"type":"$12 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"$208,000","content":"MONEY"},{"type":"41%","content":"PERCENT"},{"type":"85%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Jared Grey","content":"PERSON"},{"type":"Cumberland","content":"LOCATION"}],"hashtag":["DAOS","DEXS","GOVERNANCE VOTES"],"authors":["Osato Avan-Nomayo","The Block"]}