{"summary":"The Hong Kong Monetary Authority has published a technical whitepaper exploring possible design options for a potential retail CBDC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119389\/hong-kong-hkma-technical-whitepaper-retail-cbdc","publishDate":"2021-10-04T08:35:55","id":1351,"type":null,"title":"Hong Kong explores technical aspects of a retail CBDC ","category":["CENTRAL BANKS"],"content":["The Hong Kong Monetary Authority <a href=\"https:\/\/www.theblockcrypto.com\/linked\/107534\/hong-kong-hkd-cbdc-study\" data-v-f87c67ca=\"\">started<\/a> looking at a potential retail central bank digital currency (CBDC) in June of this year. It has now published a technical whitepaper exploring possible architectures and design options that could be applied to the CBDC if it issued one.&nbsp;","The HKMA has not yet decided whether to issue the retail CBDC but has started researching it under the project named e-HKD. The <a href=\"https:\/\/www.hkma.gov.hk\/media\/eng\/doc\/key-functions\/financial-infrastructure\/e-HKD_A_technical_perspective.pdf\" data-v-f87c67ca=\"\">technical whitepaper<\/a> is part of that research, and the HKMA wants to begin a dialogue through it on the appropriate design of e-HKD as well as evaluate its benefits and risks.","According to the HKMA, a two-tier distribution model for a retail CBDC makes a good design: the wholesale layer and the retail layer. \"Only intermediaries (banks and PSPs [payment service providers]) — which are relatively more trustworthy — can participate in the wholesale layer, whereas, the retail layer is an open system accessible to the general public,\" said the HKMA. In other words, the HKMA would issue and redeem a retail CBDC, and commercial banks would distribute and circulate the CBDC.&nbsp;","\"The Whitepaper marks the first step of our technical exploration for the e-HKD,\" <a href=\"https:\/\/www.hkma.gov.hk\/eng\/news-and-media\/press-releases\/2021\/10\/20211004-3\" data-v-f87c67ca=\"\">said<\/a> Eddie Yue, CEO of the HKMA. \"The knowledge gained from this research, together with the experience we acquired from other CBDC projects, would help inform further consideration and deliberation on the technical design of the e-HKD.\"","Based on its proposed technical design, the HKMA has identified several areas for further discussion, which it has summarized as seven problem statements. These are ensuring privacy, interoperability, performance and scalability, cybersecurity, compliance, operational robustness and resilience, and technology-enabled functional capabilities.","The HKMA is seeking feedback and suggestions on its proposed design from academia and industry by December 31.&nbsp;","Besides its retail CBDC project e-HKD, the HKMA has also been working on a wholesale CBDC research project named LionRock since 2017.","In 2019, the HKMA and the Bank of Thailand jointly initiated Project InthanonLionRock to study the potential of wholesale CBDC for cross-border payments. The project entered the second phase in 2020 and was subsequently renamed to Multiple CBDC Bridge (mBridge) in February 2021, when it was joined by the Central Bank of the United Arab Emirates and the Digital Currency Institute of the People's Bank of China (PBoC).","Project mBridge is now a collaboration of four central banks and is also supported by the Bank for International Settlements (BIS) Innovation Hub Centre in Hong Kong. The project aims to improve cross-border payments.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"Digital Currency Institute of the People's Bank of China (PBoC","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"December 31","content":"DATE"},{"type":"Bank of Thailand","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Eddie Yue","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"June","content":"DATE"},{"type":"February 2021","content":"DATE"},{"type":"Central Bank of the United Arab Emirates","content":"ORGANIZATION"},{"type":"Bank for International Settlements (BIS) Innovation Hub Centre","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["CBDCS"],"authors":["Yogita Khatri","The Block"]}