{"summary":"Binance&#x27;s CEO Changpeng Zhao claims that even if people withdraw funds from the exchange, the business will keep running as usual.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186716\/cz-says-no-evidence-something-isnt-fine","publishDate":"2022-11-14T12:10:50","id":13516,"type":null,"title":"CZ says Binance is &#x27;fine,&#x27; with withdrawals within normal range","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Binance CEO Changpeng \"CZ\" Zhao assured over 40,000 Twitter Spaces listeners that the platform’s finances are safe following a week of turmoil at rival exchange FTX. Nonetheless, he noted that “nothing is risk free” and that “crypto exchanges are inherently risky businesses.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWhile there was a noticeable increase in withdrawals on the platform in the leadup to and aftermath of FTX's filing for bankruptcy protection, Zhao said it was within a normal range that usually follow price drops. He<\/span><span data-v-f87c67ca=\"\"> said that even if everyone withdraws funds from exchanges, “we have many other profitable businesses. It’s fine.”<\/span>","<span data-v-f87c67ca=\"\">“If people want to withdraw their funds, they should,\" Zhao said. \"We don’t block the funds. It doesn’t cause us any problems.”&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Binance has joined a wave of major exchanges <a href=\"https:\/\/www.theblock.co\/post\/185230\/binance-publishes-wallet-addresses-details-of-current-holdings\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">sharing<\/a> wallet addresses holding reserve funds to encourage transparency after FTX's chaotic week that resulted in filing for bankruptcy on Friday. <\/span><span data-v-f87c67ca=\"\">Former FTX CEO Sam Bankman-Fried had insisted the U.S. arm of his company was “FINE!” just one day before it filed for bankruptcy protection.<\/span>","<span data-v-f87c67ca=\"\">Zhao said that external auditor reports would be published in the coming weeks with further details in addition to the reserve data already posted.&nbsp;<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">“We run a very simple business,” he said, adding that Binance was operating without any loans, venture capital investments or debt. Zhao also said that the exchange doesn't lend out client assets externally. While the exchange's margin program does lend out funds from user savings products to margin traders, the risk management system in place assures that funds never leave the platform.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BINANCE","FTX"],"authors":["Inbar Preiss","The Block"]}