{"summary":"Privacy project Nym intends to introduce a decentralized VPN that disperses user web traffic among multiple nodes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260674\/nym-ventures-into-decentralized-vpn-realm-broadening-privacy-mixnet-protocol","publishDate":"2023-11-02T10:00:04","id":13519,"type":null,"title":"Nym ventures into decentralized VPN realm, broadening privacy mixnet protocol","category":["CRYPTO ECOSYSTEMS"],"content":["Privacy project Nym intends to introduce a decentralized VPN that disperses user web traffic among multiple nodes.","The VPN will employ a \"two-hop\" structure, directing traffic through several decentralized nodes, according to a litepaper shared with The Block. In this two-hop system, user traffic is encrypted and routed to one server (the first hop), relayed to a second server (the second hop) and then forwarded to its intended destination on the internet.","This two-hop model purports to offer an additional privacy layer in contrast to many conventional VPNs that use a single-node method. By incorporating two separate nodes, it becomes increasingly difficult for potential eavesdroppers or malicious entities to ascertain both the user’s initial source and the traffic’s ultimate destination, as stated by its development entity, Nym Technologies.","Another technical aspect of NymVPN is its integration of the Wireguard protocol, contributing an encryption layer to its foundation. With the VPN scheduled for a December launch, it will join other decentralized VPN initiatives in the crypto domain such as Sentinel, Mysterium and <a href=\"https:\/\/www.theblock.co\/linked\/50329\/coinbase-explored-orchid-now-its-going-to-list-it\" data-v-f87c67ca=\"\">Orchid<\/a>.","Traditional centralized VPNs usually direct user information through one main server, which might have access to user browsing data. NymVPN’s decentralized framework aims to diminish this centralized supervision, potentially offering a distinct degree of online privacy.","The upcoming VPN will operate in conjunction with Nym’s existing <a href=\"https:\/\/www.theblock.co\/post\/260369\/nym-privacy-protections-near-ecosystem\" data-v-f87c67ca=\"\">mixnet<\/a>, capable of encrypting and arbitrarily directing traffic within any network, thus complicating the task of tracing on-chain communication.","Expanding on the variances between them, Nym Technologies mentioned that while the VPN employs its two-hop system for regular online tasks, the mixnet channels traffic via a five-node pathway, incorporating dummy packets to counter potential security threats. The key difference between them is the mixnet’s focus on heightened security, whereas the VPN is tailored for standard online browsing.","An example of this is a <a href=\"https:\/\/www.theblock.co\/post\/232340\/nym-ethereum-validators-privacy\" data-v-f87c67ca=\"\">solution<\/a> that lets Ethereum validators achieve privacy and avert metadata exposure by enabling validators to guide their traffic through the mixnet.","Nym Technologies raised $13 million in a 2021 funding round spearheaded by Andreessen Horowitz (a16z), resulting in a $270 million valuation.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nym Technologies","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$270 million","content":"MONEY"},{"type":"$13 million","content":"MONEY"},{"type":"VPN","content":"ORGANIZATION"},{"type":"December","content":"DATE"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}