{"summary":"Blockchain startup Aptos Labs is working with Google Cloud to allow companies and developers to build more easily on its network. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142883\/aptos-labs-strikes-first-cloud-partnership-deal-with-google","publishDate":"2022-04-21T12:00:59","id":13515,"type":null,"title":"Aptos Labs strikes cloud partnership deal with Google","category":["LAYER 1S"],"content":["Blockchain startup Aptos Labs has partnered with Google Cloud in a move that will allow companies and developers to build more easily on its network.&nbsp;","Through this deal Aptos hopes to provide scalable, secure, and sustainable infrastructure for builders, it said on Thursday in a news release shared exclusively with The Block.&nbsp;","The Layer 1 has a big tech pedigree, having been founded by former Meta employees. It launched with the goal of building a blockchain able to reach a wider audience of <a href=\"https:\/\/medium.com\/aptoslabs\/the-genesis-of-aptos-ff98d86e9445\" data-v-f87c67ca=\"\">“billions” of people<\/a>. The technology is based on the Diem network, which the company’s founders worked on while at Meta (former Facebook).&nbsp;The company&nbsp;<a href=\"https:\/\/medium.com\/aptoslabs\/expanding-the-aptos-community-38c5b18a84b7\" data-v-f87c67ca=\"\">also announced<\/a>&nbsp;in March the launch of its \"public Devnet.\"","Through the Google Cloud collaboration, anyone can power a node on the Aptos network in less than 15 minutes, it said, adding that it is a step toward enabling developers to build without hardware requirements.&nbsp;","Aptos co-founder and CEO Mo Shaikh said the team had been impressed with Google Cloud's \"commitment to decentralization.\"","Aptos said that it takes about 15 minutes to set up the node if you already have an account. For new users, Google Cloud's free trial gives users $300 in free credits.&nbsp;","<a href=\"https:\/\/aptos.dev\/tutorials\/run-a-fullnode-on-gcp\/\" data-v-f87c67ca=\"\">In a blog post<\/a> it said that running a node on the Cloud usually provides better stability and availability compared with running it on your laptop. Validator support will be added in the future, it said.&nbsp;","The move comes hot on the heels of the start up's <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137948\/former-meta-employees-raise-200-million-for-blockchain-startup-aptos\" data-v-f87c67ca=\"\">$200 million seed round<\/a>, which it announced in March. The round was led by a16z, with other investors ranging from Multicoin Capital to Coinbase Ventures. At the time, Aptos founders told TechCrunch they were \"well off into the unicorn territory\" in terms of valuation.&nbsp;&nbsp;","<em data-v-f87c67ca=\"\">Update: This article has been corrected to show that it is not the first time Google Cloud has partnered with a Layer 1 blockchain.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"Mo Shaikh","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"$300","content":"MONEY"},{"type":"Aptos Labs","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Multicoin Capital to Coinbase Ventures","content":"ORGANIZATION"}],"hashtag":["APTOS"],"authors":["Lucy Harley-McKeown","The Block"]}