{"summary":"U.S. exchange operator Nasdaq could gatecrash the crypto market with a new platform, according to people familiar with the situation.  The firm, which is","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/1637\/nasdaq-is-looking-at-gatecrashing-a-red-hot-industry-with-a-platform-to-issue-tokenized-securities","publishDate":"2018-10-12T12:45:56","id":13529,"type":null,"title":"Nasdaq is looking at gatecrashing a red-hot industry with a platform to issue tokenized securities","category":["MARKETS"],"content":["U.S. exchange operator Nasdaq could gatecrash the crypto market with a new platform, according to people familiar with the situation.&nbsp;","The firm, which is best-known for bringing technology companies such as Facebook and Tesla to market, is exploring a security token platform, the people said. Such platforms provide a way for firms to issue a token, which trades on a blockchain, as a way to raise funds. Security token offerings (STOs), unlike some initial coin offerings (ICOs), aim to fit into the parameters of existing U.S. securities law.","Since last year, the ICO market exploded in popularity with billions of dollars raised across hundreds of projects. <a id=\"jump\" data-v-f87c67ca=\"\"><\/a> The market, which is known for its fair share of fraud and big dreams, has helped some startups raise millions in seconds, drawing scrutiny from regulators such as the SEC.","Nasdaq is speaking with a number of firms as part of its efforts, including blockchain startup Symbiont.&nbsp;The people said the platform would issue tokenized securities as well as trade them. If such a platform were to successfully come to market it would join a number of firms offering such services including Polymath, tZero, and TrustToken.&nbsp;","Nasdaq's interest in issuing tokenized securities dates back to 2015, one person with knowledge of the platform said. Then, before the bitcoin bonanza of 2017, <a href=\"http:\/\/ir.nasdaq.com\/news-releases\/news-release-details\/nasdaq-linq-enables-first-ever-private-securities-issuance\" data-v-f87c67ca=\"\">the firm partnered with Chain to complete and record its first securities transaction on blockchain technology<\/a>.&nbsp;","As noted by recent research by&nbsp;<em data-v-f87c67ca=\"\">The Block,&nbsp;<\/em>security tokens can help remedy a number of issues facing U.S. stocks.&nbsp;Instead of a single institution controlling shares and settling transactions, security tokens are built on blockchains operated by&nbsp;<em class=\"markup--em markup--li-em\" data-v-f87c67ca=\"\">distributed<\/em>&nbsp;miners and nodes (servers). If a miner or node cease operating, the blockchain will continue to run as usual. The lack of centralization makes the settlement and transfer of securities more reliable. Thus, removing certain risks.[related id=1]","Still, not everyone is convinced that blockchain will make a big difference in trading. Chris Concannon, the president of Cboe Global Markets, said recently at an industry conference he didn't see blockchain \"impacting the most liquid assets that we trade.\"","<strong data-v-f87c67ca=\"\">Nasdaq CEO's nuanced view on crypto<\/strong>","In October 2017, Nasdaq CEO Adena Friedman said the firm was not interested in ICOs, describing them as \"bleeding edge.\"","\"I have real concerns around the lack of process, the lack of oversight, the lack of transparency, the lack of accountability that these companies, or individuals, have as they're going out and trying to raise capital through an ICO,\" she said speaking at an industry conference in June 2018.","Later in the interview, Friedman hinted at possibly conducting STOs, saying: \"If you decide you want to do an ICO in a regulated manner then we'd be happy to figure out whether there is an opportunity to work with people to do that.\"","As for cryptocurrencies, like bitcoin, Friedman isn't necessarily a hardcore believer or pure skeptic.","\"The concept of having a digital currency that does allow for transfer of money across borders, that really transcends the banking system, and allows for a seamless transfer, is really really fascinating and one that we have to assume will become a part of the ecosystem of the internet,\" she said of digital currencies like bitcoin.","As for Nasdaq, Friedman's nuanced look at the market is reflected in the firm's strategy. The firm powers a number of crypto markets with its surveillance technology, but has no plans to trade bitcoin or other cryptocurrencies on its marketplace anytime soon. Most notable, Gemini uses Nasdaq's so-called SMARTs technology to monitor its venue for nefarious trading activity.&nbsp;","In some respects, the firm has taken a more cautious approach to the crypto market relative to its competitors. ICE, the parent company of rival New York Stock Exchange, announced in August a crypto platform dubbed Bakkt. And derivatives exchanges Cboe and CME Group both have bitcoin futures markets. Nasdaq has yet to get a futures market off the ground.&nbsp;","Nasdaq spokesman Joseph Christinat declined to comment.&nbsp;","<em data-v-f87c67ca=\"\">With contributions from The Block's Steven Zheng.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"Cboe Global Markets","content":"ORGANIZATION"},{"type":"October 2017","content":"DATE"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"Steven Zheng","content":"PERSON"},{"type":"TrustToken","content":"ORGANIZATION"},{"type":"Adena Friedman","content":"PERSON"},{"type":"ICO","content":"ORGANIZATION"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"Friedman","content":"PERSON"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"Chris Concannon","content":"PERSON"},{"type":"Joseph Christinat","content":"PERSON"},{"type":"June 2018","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}