{"summary":"Friedman was Chief of Staff to both Kraken and a16z, and previously served as Bastion&#x27;s Head of Operations before moving into this new role.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265341\/web3-startup-bastion-hires-former-a16z-and-kraken-chief-of-staff-caroline-friedman-as-coo","publishDate":"2023-11-30T09:01:07","id":13521,"type":null,"title":"Web3 startup Bastion names former a16z and Kraken Chief of Staff Caroline Friedman as COO","category":["COMPANIES"],"content":["Web3 onboarding startup Bastion named former a16z and Kraken Chief of Staff Caroline Friedman as the firm's Chief Operating Officer.&nbsp;","Friedman moves into the new role after serving as the firm's Head of Operations since February. As Chief Operating Officer, Friedman will manage Bastion's compliance, regulatory matters, people, public policy and finance functions, the firm wrote in a statement.","\"My main focus will be to continue building a strong operational base to support the growth of the business. &nbsp;A key part of this will involve attention to Bastion's regulatory and compliance framework. &nbsp;Compliance is not just a requirement, it is a critical part of our vision,\" Friedman told The Block. \"We are committed to working closely with regulators and customers to ensure that businesses can engage with web3 technologies safely and effectively, leveraging new and impactful use cases that these technologies offer.\"","\"I will also help drive initiatives for Bastion's business growth and team building. Our goal is to expand our customer base by delivering exceptional value and service, while also continuing to cultivate a team that is skilled, diverse, and aligned with Bastion’s vision to empower innovators to unlock the full potential of digital interactions. We plan to continue to hire exceptional talent, while nurturing the inclusive and innovative company culture we are creating at Bastion,\" she added.","Prior to her time at <a href=\"https:\/\/www.theblock.co\/post\/260015\/andreessen-horowitz-planning-to-target-3-4-billion-for-next-early-stage-funds-report\" data-v-f87c67ca=\"\">a16z<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/263913\/kraken-says-products-remain-unaffected-amid-secs-new-disastrous-lawsuit\" data-v-f87c67ca=\"\">Kraken<\/a>, Friedman served as an <span class=\"s1\" data-v-f87c67ca=\"\">Assistant United States Attorney in Major Crimes and a Special Assistant United States Attorney for the National Security and International Crimes Unit at the United States Attorneys’ Offices. Friedman is a founding member of Bastion, according to her LinkedIn profile.&nbsp;<\/span>","\"Caroline has been an invaluable asset to Bastion, having been with us since the inception of the company,\" Bastion co-founder Nassim Eddequiouaq said in a statement. \"Her leadership and professionalism have been critical in our success and we are honored for her to take on this new role. We are confident that Caroline will continue to advance the Bastion mission and take the business to new heights.\"","On Sept. 18, Bastion raised <a href=\"https:\/\/www.theblock.co\/post\/251441\/web3-startup-co-founded-by-former-a16z-crypto-execs-raises-25-million-in-seed-funding\" data-v-f87c67ca=\"\">$25 million<\/a> in seed funding led by a16z, with further participation from Laser Digital Ventures, Robot Ventures, Packy McCormick, Not Boring Capital and others, The Block previously reported.&nbsp;","Bastion was founded by Nassim Eddequiouaq and Riyaz Faizullabhoy, a16z's former Chief Information Security Officer of Crypto and Chief Technology Officer of Crypto, respectively.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Laser Digital Ventures","content":"ORGANIZATION"},{"type":"Riyaz Faizullabhoy","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Caroline","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Sept. 18","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Caroline Friedman","content":"PERSON"},{"type":"Head of Operations","content":"ORGANIZATION"},{"type":"Friedman","content":"PERSON"},{"type":"National Security and International Crimes Unit","content":"ORGANIZATION"},{"type":"Packy McCormick","content":"PERSON"},{"type":"$25 million","content":"MONEY"},{"type":"Bastion","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Nassim Eddequiouaq","content":"ORGANIZATION"},{"type":"Robot Ventures","content":"ORGANIZATION"},{"type":"Chief Information Security Officer of Crypto and Chief Technology Officer of Crypto","content":"ORGANIZATION"}],"hashtag":["HIRING"],"authors":["MK Manoylov","The Block"]}