{"summary":"Since 2015, chemical shops suspected of having connections to illegal narcotics networks have received $250 million in cryptocurrencies, according to a report by Chainalysis.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/281149\/chemical-shops-with-suspected-narcotics-ties-received-250m-in-crypto-since-2015-says-chainalysis","publishDate":"2024-03-07T10:07:04","id":13520,"type":null,"title":"Chemical shops with suspected narcotics ties received $250M in crypto since 2015, says Chainalysis","category":["LEGAL"],"content":["Since 2015, chemical shops suspected of having connections to illegal narcotics networks have received $250 million in cryptocurrencies, according to a report by <span data-v-f87c67ca=\"\">Chainalysis.<\/span>","<span data-v-f87c67ca=\"\">Published Thursday, the study done by the blockchain analytics firm shows that a quarter of a billion dollars worth of cryptocurrencies flowed into digital wallets with ties to suspected chemical shops between July 2015 and February 2024. Of those funds, roughly $100 million went to drug plants in China, Chainalysis claims.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The transfers' recipients are believed to be chemical precursor shops, or drug production sites that produce key ingredients for the production of illegal narcotics such as fentanyl and heroin, according to Chainalysis.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The new report includes thousands of previously unidentified wallets with chemical shop ties, the research firm said in a press release. Its dataset includes both exchange deposit addresses and several unique on-chain services and wallets.<\/span>","<span data-v-f87c67ca=\"\">Chainanalysis' latest report identifies a larger dollar amount for suspected narcotics-linked transactions than those reported in its year-prior findings. In a 2023 report, Chainalysis estimated nearly $38 million worth of digital tokens flowed into wallets belonging to chemical precursor shops between January 2018 and April 2023, but that was using a smaller set of data.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">It remains unclear if Chainalysis' latest findings reflect an increase in narcotics-tied crypto transactions or if the apparent increase in inflows to drug-tied wallets is a result of the firm's decision this year to analyze a greater number of wallets over a longer period. <\/span>","<span data-v-f87c67ca=\"\">Tracking digital funds tied to illicit narcotics production is difficult because of the covert nature of the illegal drug trade.&nbsp;<\/span><span data-v-f87c67ca=\"\">China was the largest producer of fentanyl precursors globally in 2019, according to a Drug Enforcement Administration (DEA). <\/span><span data-v-f87c67ca=\"\">Since then, the DEA has put pressure on China to shut down precursor chemical networks that it says fuel the illegal drug trade. Last October, federal officials <\/span><a href=\"https:\/\/www.justice.gov\/opa\/pr\/justice-department-announces-eight-indictments-against-china-based-chemical-manufacturing\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">indicted<\/span><\/a><span data-v-f87c67ca=\"\"> eight China-based drug companies and their employees for narcotics-related crimes.&nbsp; <\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"2015","content":"DATE"},{"type":"April 2023","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"January 2018","content":"DATE"},{"type":"$38 million","content":"MONEY"},{"type":"Drug Enforcement Administration (DEA","content":"ORGANIZATION"},{"type":"July 2015","content":"DATE"},{"type":"DEA","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["CRIME"],"authors":["Elizabeth Napolitano","The Block"]}