{"summary":"A blockchain security company will have to pay about $3.4 million to settle Securities and Exchange Commission charges for conducting an unregistered initial coin offering. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241493\/sec-charges-quantstamp-over-28-million-ico","publishDate":"2023-07-26T10:54:35","id":13525,"type":null,"title":"SEC charges Quantstamp over $28 million ICO","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A blockchain security company will have to pay about $3.4 million to settle Securities and Exchange Commission charges for conducting an unregistered initial coin offering.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Quantstamp raised close to $28.35 million in ether and stablecoin USD through the sale of its QSP token to more than 5,000 investors back in 2019, the SEC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The firm released a white paper in 2017 describing its plans to create a protocol on the Ethereum blockchain to “provide automated security audits of smart contracts,” the agency said on July 21 in a <a href=\"https:\/\/www.sec.gov\/enforce\/33-11215-s\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“In public statements, Quantstamp emphasized the large market potential for the smart contract security auditing product it planned to develop, and led QSP purchasers to expect that the value of their tokens would increase with the success of Quantstamp’s enterprise,” the SEC said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC referenced the Howey Test, which it often cites when determining whether a cryptocurrency is a security and subject to securities laws. The test stems from a 1946 US Supreme Court case involving orange groves and decided what qualifies as an investment contract.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The test has four prongs, including whether there is an expectation of profits that is derived from the efforts of others, a common enterprise or an investment of money.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Quantstamp settled without admitting or denying the SEC’s charges. The SEC also established a fair fund to return money paid by Quantstamp back to investors.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 21","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"QSP","content":"ORGANIZATION"},{"type":"US Supreme Court","content":"ORGANIZATION"},{"type":"$3.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"1946","content":"DATE"},{"type":"$28.35 million","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}