{"summary":"The NotLarvaLabs founder is jumping on a trend where crypto users send tokens to addresses hoping for an airdrop.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232666\/crypto-folks-send-1-1-million-to-notlarvalabs-founder-for-nothing-in-return","publishDate":"2023-05-31T06:53:11","id":13526,"type":null,"title":"Crypto folks send $1.1 million to NotLarvaLabs founder for &#x27;nothing in return&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto users have sent $1.1 million of ether to NotLarvaLabs founder <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Jeremy Cahen<\/span> in exchange for, well, nothing.","“There is nothing for sale. I cannot reiterate this enough. People simply choose to send tokens to: YouGetNothing.eth. Or they choose not to,” <a href=\"https:\/\/twitter.com\/Pauly0x\/status\/1663802092702642176\" data-v-f87c67ca=\"\">said<\/a> the founder, who goes by Pauly on Twitter.","It’s hard to explain exactly why this happened but here goes.&nbsp;","In the past, crypto projects would raise money through initial coin offerings and other setups, often with a pre-sale where some of the tokens are sold to insiders at lower prices. While such raises have largely died out for now, crypto degens have recently been playing a similar game, albeit with more risk.","Over the last few weeks, a pseudonymous crypto individual who goes by ben.eth — with a little help from crypto YouTuber Ben Armstrong, or BitBoy Crypto — raised funds for three memecoins by asking his Twitter following to send money to a single wallet. So far, they’ve generated $20 million through this strategy, launching token after token, with Armstrong <a href=\"https:\/\/twitter.com\/Bitboy_Crypto\/status\/1663378081212518402\" data-v-f87c67ca=\"\">claiming<\/a> that the tokens will have utility in the memecoin space.","This strategy has been controversial. Many crypto individuals have warned against sending tokens to a single wallet in the hope of receiving an airdrop of tokens in return (as nothing is guaranteed and there are security risks with having all the funds in a single wallet). Crypto sleuth ZachXBT <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1662896611679166464\" data-v-f87c67ca=\"\">pointed out<\/a> that many participants sent money from centralized exchanges and so would not receive any tokens, and <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1661902544648503296\" data-v-f87c67ca=\"\">criticized<\/a> Ben.eth for retweeting a phishing scam mentioning the ben token. Others <a href=\"https:\/\/twitter.com\/Tradermayne\/status\/1662567031483568129\" data-v-f87c67ca=\"\">have said<\/a> that this kind of activity means the entire crypto space should go to zero.","So in comes <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Cahen<\/span>. They have replicated the same model of putting out an Ethereum address and raising money by doing so — but without promising future tokens or airdrops. It appears that the whole idea is a form of performance art designed to poke fun at this arguably reckless form of fundraising.","“I’m not sure if you have realized this or not. But the entire crypto industry is an absolute joke. It’s a mockery,” <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Cahen<\/span> <a href=\"https:\/\/twitter.com\/Pauly0x\/status\/1663759134586445826\" data-v-f87c67ca=\"\">tweeted<\/a>.&nbsp;","While this language could be a bluff, it’s entirely possible <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Cahen<\/span> is dead serious and just boosted his bank balance by a hefty chunk.&nbsp;","Either way, the chance that a token might come out of it has proven enough of a lure for crypto degens to pile in. Over the last 24 hours, speculators have sent 585 ether ($1.1 million) to the address, along with a variety of tokens, including the memecoin pepe.&nbsp;","Some are definitely hopeful. “Pauly0x stunt is so amazing I would be SO disappointed to get something out of nothing,” <a href=\"https:\/\/twitter.com\/adsimple_\/status\/1663791281804279808\" data-v-f87c67ca=\"\">said<\/a> one contributor.","It’s not just a small group of speculators either. More than 1,000 transfers have been made to the wallet, <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1663834332837085184\" data-v-f87c67ca=\"\">according<\/a> to crypto analytics firm Arkham Intelligence. The largest transfer was for 10.05 ether ($19,150), per Arkham.","But despite their hopes, <span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Cahen<\/span> <a href=\"https:\/\/twitter.com\/Pauly0x\/status\/1663805645387190272\" data-v-f87c67ca=\"\">reminded<\/a> his following, “How long will it take before people realize that after they send tokens… They get nothing.”","<em data-v-f87c67ca=\"\">Update: Added Pauly's real name.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NotLarvaLabs","content":"ORGANIZATION"},{"type":"Ben Armstrong","content":"PERSON"},{"type":"Cahen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BitBoy Crypto","content":"ORGANIZATION"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"$1.1 million","content":"MONEY"},{"type":"Pauly","content":"ORGANIZATION"},{"type":"$19,150","content":"MONEY"},{"type":"Jeremy Cahen","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"Armstrong","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}