{"summary":"The Securities and Exchange Commission&#x27;s charge sheet against Terraform Labs and founder Do Kwon contains several new revelations about how the firm and its assorted tokens collapsed last May.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212835\/u-s-investigation-into-do-kwon-and-his-infamous-stablecoin-unveils-several-new-revelations","publishDate":"2023-02-17T13:38:45","id":13533,"type":null,"title":"U.S. investigation into Do Kwon and his infamous stablecoin unveils several new revelations","category":["THE BLOCK"],"content":["The collapse of supposed stablecoin TerraUSD last May wiped out more than $40 billion of market value held by investors who bought into the story that creator Do Hyeong Kwon and his firm Terraform Labs had found a novel way to create a perpetual money machine.","Yesterday's charge sheet <a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2023\/comp-pr2023-32.pdf\" data-v-f87c67ca=\"\">filed<\/a> in court by the U.S. Securities and Exchange Commission was the first detailed look at what went wrong. The allegations presented a very different picture from the one 31-year-old Kwon and his partners painted to investors and the world's media.","Here is a breakdown of some of the key findings:","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Unstable stablecoin<\/span><\/strong>","Terraform and Kwon misled investors about the stability of TerraUSD (also known as UST). The token was pitched as an algorithmic stablecoin that used complicated math to ensure a 1:1 peg against the U.S. dollar.&nbsp;","The token slipped off its peg in May 2021, prompting panic among users. Had the peg not been quickly restored, it ''would spell doom for the entire Terraform ecosystem,'' the SEC wrote.&nbsp;","Kwon ''secretly'' turned to a third party, unidentified in the charge sheet but <a href=\"https:\/\/www.theblock.pro\/news\/post\/212772\/jump-terraform-prop-up-terrausd\" data-v-f87c67ca=\"\">reported<\/a> by The Block to be Jump Trading, for help. Jump purchased ''massive amounts'' of UST to restore the peg. That effort was touted publicly as a triumph of UST's decentralization and automatic self-healing capabilities, and investors poured billions of dollars more into the product. Jump ultimately profited by about $1.3 billion from its relationship with Terraform, the SEC filing indicated.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Fake business relationships<\/span><\/strong>","To drum up excitement in the power of the Terraform blockchain, Kwon and his team claimed a Korean payments company called Chai was using it to settle millions of transactions. That was a complete fabrication, the SEC alleged.&nbsp;","Chai Corporation was founded by Daniel Shin Hyun-seung, who was also a founder of Terraform. Kwon sat on Chai's board, and the two firms shared office space and personnel. Chai and Shin are being investigated by Korean authorities, Forkast News <a href=\"https:\/\/forkast.news\/terra-daniel-shin-chai-raided-by-korean-authorities\/\" data-v-f87c67ca=\"\">reported<\/a> in November, quoting a Chai spokesperson saying that “Daniel will fully cooperate with the ongoing investigation to clarify the misunderstandings and to resolve such speculations.”","Terraform and Kwon made ''false and misleading statements'' about Chai's involvement as part of efforts to solicit investments, and also in Kwon's public interviews, the SEC said. This included a slide deck presentation to a U.S. institutional investor touting the speed and efficiency of Chai in using the Terraform blockchain.&nbsp;","To trick people watching the Terraform blockchain for evidence of the Chai transactions, Kwon's team programmed a server to receive and process data about Chai real world transactions with Korean merchants, and then issue instructions to the Terraform blockchain to replicate those transactions as if they had originally been done on that blockchain, the SEC wrote.","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Unregistered securities<\/strong><\/span>","Another line of attack is that UST and other tokens associated to Terraform were unregistered securities, the watchdog alleges. These included so-called wrapped tokens created when moving between blockchains, and also mirror tokens designed to replicate price movements of listed equities.","Terraform breached U.S. securities rules by not registering these various products, the SEC said.","Specifically, the agency said five assets were “crypto asset securities” — LUNA tokens, a version of LUNA called “wrapped” LUNA, UST, MIR tokens, and security-based swaps or mAssets. The SEC went through the assets in the complaint, relating it to different prongs of the Howey Test, a 1946 U.S. Supreme Court case involving citrus groves in Florida. That test has been used repeatedly by the agency to determine whether cryptocurrencies are securities.","This complaint may become the most closely watched part of any trial, as the crypto industry is highly sensitive to any claim by the SEC that tokens are securities. In other crypto cases brought by the SEC, such as the insider trading suit against former Coinbase manager Ishan Wahi, industry associations <a href=\"https:\/\/theblockchainassociation.org\/blockchain-association-files-amicus-brief-in-sec-lawsuit-against-ishan-wahi\/\" data-v-f87c67ca=\"\">have<\/a> interjected to argue that the SEC does not have authority as tokens are not securities.","<strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Secret stash<\/span><\/strong>","Kwon has a secret stash of&nbsp; more than 10,000 bitcoin, investigators alleged.&nbsp; The bitcoin was transferred by Kwon from Terraform and related entities to a self custody wallet. Since May 2022 when UST tanked, bitcoin from the wallet was transferred to an unnamed Swiss bank and converted into fiat. Since June last year more than $100 million in fiat currency was withdrawn from the bank.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel Shin Hyun","content":"PERSON"},{"type":"Chai","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"last May","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"1946","content":"DATE"},{"type":"Howey Test","content":"ORGANIZATION"},{"type":"Ishan Wahi","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Forkast News","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Hyeong Kwon","content":"PERSON"},{"type":"May 2021","content":"DATE"},{"type":"Daniel","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"May 2022","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"Chai","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Shin","content":"ORGANIZATION"},{"type":"June last year","content":"DATE"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":[],"authors":["Benjamin Robertson","Sarah Wynn","The Block"]}