{"summary":"Fewer people than ever are falling prey to crypto scams, while hacks and stolen funds are trending upwards, new data show.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164226\/chainalysis-midyear-report-shows-scams-are-down-but-hacks-are-up","publishDate":"2022-08-17T20:07:44","id":13535,"type":null,"title":"Chainalysis midyear report shows scams are down, but hacks are up","category":["DATA"],"content":["Fewer people than ever are falling prey to crypto scams, while hacks and stolen funds are trending upwards, new data show.","Crypto analytics firm Chainalysis released its <a href=\"https:\/\/blog.chainalysis.com\/reports\/crypto-crime-midyear-update-2022\/\" data-v-f87c67ca=\"\">midyear report<\/a> yesterday, showing an overall decline in illicit activity despite some outliers. Price downturns appear to have had an effect, with both illicit and legitimate volumes trending lower compared with this time last year. Still, Chainalysis noted that illicit activity appears to be more resilient, since volumes are down only 15% from last year compared to 36% for legitimate activity.","Scam revenue for this year is 65% lower compared with July of 2021, clocking in at $1.6 billion. Chainalysis proposes that this is linked to price declines, since scam revenue has fallen relatively in line with the price of bitcoin since the start of this year. The number of transfers to scams at this point in the year is also the lowest seen in four years. Still, the report noted that scam revenue is also driven by high-profile schemes, which 2022 has yet to see.","\"Those numbers suggest that fewer people than ever are falling for cryptocurrency scams,\" the firm said in its report. \"One reason for this could be that with asset prices falling, cryptocurrency scams — which typically present themselves as passive crypto investing opportunities with enormous promised returns — are less enticing to potential victims.\"","Additionally, a price downturn means less hype, which tends to be a factor in drawing in inexperienced users, according to Chainalysis.&nbsp;","Darknet market revenue charted a different path. The activity was tracking higher than the previous year in April, but saw a drop off past that point. Chainalysis pointed to the shut down and sanction of the Hydra marketplace, which drew substantial dark market activity. However, activity returned, which Chainalysis hypothesizes is due to Hydra users migrating to new markets in the wake of the crackdown.","\"Nevertheless, the decline in darknet market revenue — and indeed, cryptocurrency value received by all criminal categories — following Hydra’s shutdown shows the tangible impact of law enforcement’s growing ability to fight cryptocurrency-based crime,\" Chainalysis said.","Meanwhile, hacks and the amount of stolen funds are up compared to last year. According to Chainalysis, $1.9 billion worth of crypto has been stolen as of July, compared with $1.2 billion in July of 2021. Indeed, <a href=\"https:\/\/www.theblock.co\/post\/162959\/slope-no-conclusive-evidence-tying-4-million-solana-hack-to-its-own-security-flaw\" data-v-f87c67ca=\"\">this year<\/a> has <a href=\"https:\/\/www.theblock.co\/post\/159308\/hacker-pockets-1-1-million-after-stealing-from-music-streaming-protocol-audius\" data-v-f87c67ca=\"\">already<\/a> <a href=\"https:\/\/www.theblock.co\/search?query=hack&amp;start=10#:~:text=Nomad%20hack%3A%20Ethical%20hackers%20return%20%249%20million%20to%20exploited%20crypto%20bridge%20platform\" data-v-f87c67ca=\"\">seen<\/a> a <a href=\"https:\/\/www.theblock.co\/post\/158147\/a-hacker-stole-375000-from-users-of-premint-nft-platform\" data-v-f87c67ca=\"\">number<\/a> of <a href=\"https:\/\/www.theblock.co\/post\/163167\/binance-seizes-450000-stolen-in-curves-front-end-hack\" data-v-f87c67ca=\"\">high-profile<\/a> <a href=\"https:\/\/www.theblock.co\/post\/114045\/at-least-611-million-stolen-in-massive-cross-chain-hack\" data-v-f87c67ca=\"\">hacks<\/a>.","\"Additionally, we shouldn’t expect theft to drop based on cryptocurrency market movements the way scamming does — as long as crypto assets held in DeFi protocol pools and other services have value and are vulnerable, bad actors will try to steal them,\" Chainalysis said. \"The only way to stop them is for the industry to shore up security and educate consumers on how to find safe projects to invest in.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July of 2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"$1.6 billion","content":"MONEY"},{"type":"Chainalysis","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"Chainalysis","content":"PERSON"},{"type":"36%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"$1.9 billion","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["HACKS"],"authors":["Aislinn Keely","The Block"]}