{"summary":"Tron will launch its own algorithmic stablecoin called USDD for its blockchain on May 5 and it will be managed by a DAO.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142867\/justin-sun-to-launch-algorithmic-stablecoin-usdd-on-tron-will-use-10-billion-of-crypto-as-collateral","publishDate":"2022-04-21T09:58:43","id":13537,"type":null,"title":"Justin Sun to launch stablecoin called USDD on the Tron blockchain","category":["STABLECOINS"],"content":["Tron will have its own native stablecoin called USDD from May 5, Tron founder Justin Sun <a href=\"https:\/\/www.hejustinsun.com\/post\/an-open-letter-on-the-issuance-of-usdd-a-decentralized-algorithmic-stablecoin-on-tron\" data-v-f87c67ca=\"\">announced<\/a> on Thursday.","The stablecoin won't operate like traditional ones do, such as Tether (USDT) and Circle’s USD Coin (USDC), which keep dollars (and other assets) in bank accounts as backing. Instead USDD will be an algorithmic stablecoin like TerraUSD (UST) and Frax Finance (FRAX).","The stablecoin will have a similar system to these algorithmic stablecoins in order to keep its peg to the US dollar. As Sun explained, “When USDD's price is lower than 1 USD, users and arbitrageurs can send 1 USDD to the system and receive 1 USD worth of TRX. When USDD's price is higher than 1 USD, users and arbitrageurs can send 1 USD worth of TRX to the decentralized system and receive 1 USDD.”","The Tron founder claimed that USDD’s algorithm will ensure the stablecoin maintains its US dollar peg regardless of market conditions.","A decentralized autonomous organization (DAO) called Tron DAO will <a href=\"https:\/\/twitter.com\/trondao\/status\/1517121851511566336?s=21&amp;t=F6VFEGETkUvyLpK82KOTxQ\" data-v-f87c67ca=\"\">manage<\/a> the blockchain’s stablecoin. According to Sun, Tron DAO will administer a reserve with a 30% interest rate.","Tron DAO will also provide custody reserves of up to $10 billion in highly liquid assets to serve as collateral backing for USDD. This is similar to Terraform Labs founder and CEO Do Kwon's plan to acquire $10 billion of bitcoin to serve as reserves for UST.","Sun did not state which assets would serve as collateral but said they would be \"highly liquid assets raised from initiators of the blockchain industry.\" The assets would be used as a reserve to help keep the stablecoin pegged to the US dollar.","Kwon responded favorably to Tron's stablecoin announcement. He <a href=\"https:\/\/twitter.com\/stablekwon\/status\/1517130755071442947\" data-v-f87c67ca=\"\">said<\/a>, \"decentralized economies deserve decentralized money.\" He further claimed that every blockchain will soon run on these decentralized stable currencies.","According to Sun’s announcement, USDD will be available on Ethereum and BNB Chain when launched via the BitTorrent network’s cross-chain protocol.","Justifying the need for a native stable currency on Tron, Sun explained that the expansion of USDT transaction volume on the network signaled the need for USDD. The former stablecoin gained popularity on the network from traders looking to exploit arbitrage opportunities without paying too much in transaction fees.","Today’s announcement follows on the heels of reports that Near Protocol, another blockchain network, is set to <a href=\"https:\/\/www.theblockcrypto.com\/amp\/post\/141274\/near-protocol-is-set-to-launch-a-stablecoin-called-usn-source\" data-v-f87c67ca=\"\">launch its own stablecoin<\/a> — that may be in a similar guise to UST.","<em data-v-f87c67ca=\"\">This story has been updated with Terraform Labs CEO Do Kwon responding favorably to the Tron stablecoin announcement.<br data-v-f87c67ca=\"\">\n<\/em>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BitTorrent","content":"ORGANIZATION"},{"type":"May 5","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"Justin Sun","content":"PERSON"},{"type":"Kwon","content":"PERSON"},{"type":"USD","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"USDD","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Tron DAO","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["JUSTIN SUN"],"authors":["Osato Avan-Nomayo","The Block"]}