{"summary":"EthereumPoW has made no development commits on GitHub to its fork of the Go Ethereum client — commonly called Geth — since launching.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228761\/ethereum-pow-zero-commits","publishDate":"2023-04-28T05:44:36","id":13531,"type":null,"title":"EthereumPoW has made no GitHub updates to Geth fork since launch","category":["LAYER 1S"],"content":["EthereumPoW, a fork of Ethereum that preserved the original energy-intensive proof-of-work consensus mechanism, appears to have made no updates to its <a href=\"https:\/\/www.theblock.co\/post\/163229\/ethpow-team-says-its-miner-led-ethereum-fork-is-inevitable\" data-v-f87c67ca=\"\">fork of the Go Ethereum client<\/a> — commonly called Geth — since launching in September alongside The Merge.","EthereumPoW calls itself \"the original PoW-based Ethereum network\" that decided to remain proof-of-work when the Ethereum Foundation shifted the primary blockchain to a more environmentally friendly proof-of-stake consensus mechanism. However, <a href=\"https:\/\/github.com\/ethereumpow\" data-v-f87c67ca=\"\">EthereumPoW's Geth code on GitHub shows no commits<\/a> — a software development term for how a code update is confirmed and implemented — in over seven months.","That apparent lack of action drew criticism yesterday from Bob Summerwill, the executive director at ETC Cooperative, who <a href=\"https:\/\/twitter.com\/BobSummerwill\/status\/1651693294781607938\" data-v-f87c67ca=\"\">tweeted<\/a>: \"That such a low-effort affinity project has over $300 million market tells us how little 'signal' there is in price.\"","ETC Cooperative is the primary contributing team behind the original Ethereum fork that resulted in the creation of Ethereum Classic in 2016 and serves as a competitor to EthereumPoW.&nbsp;","One EthereumPoW coin is currently trading under $3. Ethereum's native coin is trading above $1,900 per coin.","<span data-v-f87c67ca=\"\">The price of EthereumPoW is down 80% from its all-time high. Source: TradingView<\/span>","Although a lack of commits posted on GitHub doesn't inherently imply a problem, it could suggest that the EthereumPoW team may be facing challenges — or not making any attempts to enhance the Geth code.","In September 2022, the team <a href=\"https:\/\/twitter.com\/LefterisJP\/status\/1567077681786769409\" data-v-f87c67ca=\"\">experienced issues while trying to create a new chain ID<\/a> for their forked chain. Due to the unavailability of a new chain ID, <a href=\"https:\/\/twitter.com\/FrankieIsLost\/status\/1568035394285088768\" data-v-f87c67ca=\"\">the Coinbase protocol team stepped in<\/a> and started submitting pull requests to the EthereumPoW repository to address the problem.","The EthereumPoW team did not immediately respond to a request for comment.","The development comes at a time when the core Geth client team is <a href=\"https:\/\/github.com\/ethereum\/go-ethereum\/pull\/27178\" data-v-f87c67ca=\"\">removing support<\/a> for all proof-of-work chains — a move that will further make it harder for forked chains like EthereumPoW to implement open source updates to their client.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ETC Cooperative","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"$1,900","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"GitHub","content":"ORGANIZATION"},{"type":"$3","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"September 2022","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"Bob Summerwill","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Adam James","Vishal Chawla","The Block"]}