{"summary":"The digital asset industry mobilized after the European Parliament added an article into the EU&#x27;s anti-money laundering regulation draft introducing restrictions on commercial crypto payments. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221328\/payment-restriction-in-eu-anti-money-laundering-bill-irks-crypto-industry","publishDate":"2023-03-22T05:39:01","id":13549,"type":null,"title":"Payment restriction in EU anti-money laundering bill irks crypto industry","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">A single article introduced by the European Parliament to the anti-money laundering rule for commercial crypto payments has stirred Europe's digital asset industry.<\/span>","<span data-v-f87c67ca=\"\">Policymakers hope that they can close a loophole for untraceable transactions by prohibiting payments over a €1,000 ($1,070) threshold from unregulated crypto payment services providers operating in the European Union.<\/span>","<span data-v-f87c67ca=\"\">The industry, however, worries this addition may stray from the regulatory path already outlined in finalized bills — like the soon-to-be-enforced Markets in Crypto-Assets and the Transfer of Funds Regulation — or hinder innovation in the decentralized finance sector.<\/span>","<span data-v-f87c67ca=\"\">With just one week left before the Parliament cements its version of the anti-money laundering regulation bill in a joint committee vote on March 28, policymakers are working to tweak the language while the crypto industry has mobilized to take a stance.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A group of MEPs leading the negotiations on the Parliament's draft are meeting this week to discuss the responses to the text. O<\/span><span data-v-f87c67ca=\"\">ne of the latest changes proposed is a mandate for the European Commission to review the article in the coming years and propose legislative changes if needed, multiple sources confirmed.<\/span>","<span data-v-f87c67ca=\"\">A leaked draft of the Parliament's version of the bill reviewed by The Block, dated March 15, suggested that only transfers made from an EU-licensed crypto service provider, under the MiCA framework, would be allowed to exceed an amount equivalent to €1,000 ($1,070). This replaced the original transaction cap to and from<\/span> <a href=\"https:\/\/www.theblock.co\/post\/213380\/self-hosted-wallet-ban-avoided-in-new-draft-of-eus-anti-money-laundering-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">self-hosted addresses<\/span><\/a><span data-v-f87c67ca=\"\">, which were instead named a high risk area under the anti-money laundering bill.<\/span>","<span data-v-f87c67ca=\"\">The text remains unfinished, and the bill is still subject to changes in the coming year as it will still need to make its way through so-called trilogues, a&nbsp;parliamentary staffer who spoke on condition of anonymity told The Block. During that process the European Parliament, the European Council and the European Commission will defend their positions.<\/span>","<span data-v-f87c67ca=\"\">Policymakers do not intend to ban the private use of self-hosted wallets, the parliamentary staffer said. Provisions outlined are designed to apply to commercial transactions for goods and services to avoid the circumvention of the cash payment caps outlined in the bill, they said.<\/span>","<span data-v-f87c67ca=\"\">Merchants shouldn’t accept payments over the proposed limits on crypto, according to the draft. Neither should they accept more than €5,000 ($5,400) in cash. The threshold on permitted crypto payments is much lower, at €1,000, which may be a topic of further discussion as negotiations continue.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Such an approach is not technologically neutral, it favors centralized service providers — [crypto asset services providers, as they are dubbed in MiCA] — and disincentives self-hosted wallets to research and develop solutions,” the regulatory team at the open source blockchain nonprofit, Iota, wrote in a statement to policymakers shared with The Block.<\/span>","<span data-v-f87c67ca=\"\">The Parliament's intention is not to target decentralized finance protocols, an insider source said. Self-hosted wallets were not included in the European Commission's original proposal. The Commission is expected to come forward with a more DeFi-focused policy proposal after the 2024 European elections, with preliminary<\/span> <a href=\"https:\/\/www.theblock.co\/post\/178922\/tradfi-policies-inadequate-for-treating-defi-claims-eu-commission-study\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">research<\/span><\/a><span data-v-f87c67ca=\"\"> initiatives already underway. Preempting DeFi regulation before that, as self-hosted wallet regulation would imply, could cause legal uncertainty and undermine the existing crypto regulatory frameworks, the source said.<\/span>","<span data-v-f87c67ca=\"\">The European Parliament also added a revision line into the recent draft. Two years after the regulation is applied, the European Commission may need to assess the need to prohibit anonymous crypto accounts. Another report would need to address whether digital service providers should become obliged entities, potentially setting the table for more legislation.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Brussels-based lobby group Blockchain For Europe wants alignment with existing regulations to ensure “legal certainty for the crypto assets industry and its consumers,” Secretary General Robert Kopitsch said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Transfer of Funds regulation already enforces know-your-customer rules on transactions to and from self-hosted wallets worth over €1,000. Meanwhile, the MiCA framework has left decentralized protocols, like the ones often supporting self-hosted wallets, out of its regulatory scope. Both bills are scheduled for a final plenary vote on April 19.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The reality is that unless the EU wants to make all merchants to be [crypto-asset service providers] under MiCA, the payment for goods and services via a self-hosted wallet has been already addressed in the TFR for good,” Kopitsch added.<\/span>","<span data-v-f87c67ca=\"\">The restrictions on the commercial use of self-hosted addresses in Europe \"will lead other jurisdictions to win from the European Union’s loss,” Mariana de la Roche Wills, regulatory affairs expert at Iota, told The Block.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Parliament","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"Robert Kopitsch","content":"PERSON"},{"type":"Mariana de la Roche Wills","content":"ORGANIZATION"},{"type":"March 15","content":"DATE"},{"type":"$5,400","content":"MONEY"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"April 19","content":"DATE"},{"type":"Brussels","content":"LOCATION"},{"type":"$1,070","content":"MONEY"},{"type":"TFR","content":"ORGANIZATION"},{"type":"European Council","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}