{"summary":"A decentralized organization has spent $250,000 on an NFT of a very large tungsten cube.\nHere’s why crypto traders are buying cubes and NFTs of them.","author":["Tim Copeland","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123015\/crypto-anons-buy-2000-lb-tungsten-cube-nft-for-250000","publishDate":"2021-11-02T14:59:17","id":1354,"type":null,"title":"Crypto anons buy 2,000 lb tungsten cube NFT for $250,000","category":["NFTs"],"content":["A decentralized organization (or DAO) has purchased an NFT that represents — and can be redeemed for — a very large tungsten cube.&nbsp;","The organization, which includes notable pseudonymous NFT collector Vincent Van Dough, bought the NFT for 56.9 ETH ($250,000). According to the <a href=\"https:\/\/opensea.io\/assets\/0x495f947276749ce646f68ac8c248420045cb7b5e\/36033305814565393839012117540795495898903988734891995320738861183142759235585\/\" data-v-f87c67ca=\"\">auction details<\/a>, 10% of the proceeds will go to a charitable cause.","For those who don’t spend all day on Twitter, here’s some context.&nbsp;","Last month, Coin Center’s director of comms Neeraj Agrawal made a <a href=\"https:\/\/twitter.com\/NeerajKA\/status\/1447985408567021574\" data-v-f87c67ca=\"\">fake Bloomberg headline<\/a> that crypto traders were buying up tungsten cubes, causing prices to skyrocket. This led to crypto traders actually doing so, and, in turn, led to journalist Joe Weisenthal turning it into a <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-10-15\/crypto-traders-to-blame-for-surging-sales-of-small-tungsten-cubes\" data-v-f87c67ca=\"\">real Bloomberg headline<\/a>. So, it’s a meme but people have been buying these cubes — because they’re <a href=\"https:\/\/www.livescience.com\/38997-facts-about-tungsten.html\" data-v-f87c67ca=\"\">particularly dense<\/a>.","Midwest Tungsten, one of the few providers of such cubes, has enjoyed the surging sales and attention from the crypto crowd. Since this began, the company has started accepting bitcoin payments for cubes. Then it turned to NFTs.","On October 25, Midwest Tungsten created an auction for its first tungsten cube NFT. The NFT represents a physical 2,000 lb cube held at its headquarters in Illinois. The buyer is able to visit the cube once a year, where it is stored in a room only accessible by the cube owner. If the buyer decides to burn the NFT (destroy it permanently) then Midwest Tungsten will ship the cube to them.&nbsp;","As for who bought the NFT, it was Tungsten DAO, which Van Dough created on October 23, describing it as an “experimental meme incubation studio.”","Van Dough is an NFT collector who has spent <a href=\"https:\/\/www.theblockcrypto.com\/news+\/117334\/nft-collector-vincent-van-dough-interview\" data-v-f87c67ca=\"\">more than $20 million<\/a> on NFTs. They also recently revealed the formation of a new NFT fund, in partnership with Three Arrows Capital co-founders Su Zhu and Kyle Davies.","They <a href=\"https:\/\/twitter.com\/Vince_Van_Dough\/status\/1451958171577241609\" data-v-f87c67ca=\"\">explained<\/a> that anyone can submit a meme that has garnered significant traction and if approved, it will get minted as an NFT. Most of the sales of the meme will go to the <a href=\"https:\/\/opensea.io\/TungstenDAO\" data-v-f87c67ca=\"\">DAO’s treasury<\/a> with 10% to the meme creator.","As for what they will do with the tungsten cube NFT, Van Dough tweeted: “The cube will remain at <a href=\"https:\/\/twitter.com\/MTS_Store\" data-v-f87c67ca=\"\">@MTS_Store<\/a>’s factory until the NFT representation of it is burnt, which will trigger delivery of the cube via freight.”","This NFT auction is not to be confused with the collection of 500 tungsten cube NFTs that was recently sold for around $200,000. All the proceeds of the sale and ongoing royalties for this collection are being sent to crypto advocacy groups, including Coin Center.&nbsp;","FTX CEO Sam Bankman-Fried is auctioning off cube #69 from this collection on FTX.US’s <a href=\"https:\/\/www.theblockcrypto.com\/post\/120044\/ftx-us-launches-marketplace-for-trading-solana-based-nfts\" data-v-f87c67ca=\"\">newly launched marketplace<\/a>. He said the winning cube will be signed\/engraved by him and that all proceeds will be donated. In addition to the NFT, Midwest Tungsten will provide the buyer with a physical 4” tungsten cube.&nbsp;","So far, the highest bid is 200 SOL, worth some $40,000.","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Disclaimer:<\/strong> The author of this article owns a tungsten cube.<\/em>"],"hashtag":["FTX"]}