{"summary":"An official Game of Thrones NFT collection sold out in just seven hours despite being ridiculed for the avatars&#x27; claw-like hands.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201081\/game-of-thrones-nft-collection-sells-out-in-7-hours-despite-weird-avatar-hands","publishDate":"2023-01-11T12:34:24","id":13540,"type":null,"title":"Game of Thrones NFT collection sells out in 7 hours despite weird avatar hands","category":["NFT COLLECTIONS"],"content":["An official Game of Thrones NFT collection sold out in just seven hours on NFT marketplace Nifty’s.","That’s despite the collection getting ridiculed on Twitter for its art quality, mainly due to several of the avatars having claw-like hands. The collection has been compared to the unpopular final season of the Game of Thrones TV show.","","","With a current floor price of 0.07ETH ($93), each NFT \"box\" contains an avatar, resource cards and story cards. The price has dropped from an original minting price of $150.","<span data-v-f87c67ca=\"\">Game of Thrones: Build Your Realm NFT collection floor price. Source: <a href=\"https:\/\/opensea.io\/collection\/game-of-thrones-the-north-series-i-hero-box\/analytics\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">OpenSea<\/a><\/span>","But those looking to buy a GoT NFT on the secondary market need to watch out: Opened and unopened boxes look the same on marketplaces other than Nifty's. Potential buyers can check the NFT’s metadata to see if it is still unopened.","Buyers also have reported difficulties with getting their NFTs, including being double charged and not receiving the NFTs. Nifty’s said any processed payments that did not result in NFTs appearing in a wallet will be reversed or refunded.","Creators Daz 3D said the NFTs and Build Your Realm project will “give fans the opportunity to build their realm through themed community activities, upgradeable avatars and digital collectibles including iconic moments, locations, characters, and more from the groundbreaking TV series.”","A second series of Game of Thrones NFTs also will launch on OpenSea.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Daz 3D","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nifty's","content":"ORGANIZATION"},{"type":"Nifty’s","content":"ORGANIZATION"},{"type":"$93","content":"MONEY"},{"type":"Game of Thrones NFT","content":"ORGANIZATION"},{"type":"$150","content":"MONEY"},{"type":"Build Your Realm NFT","content":"ORGANIZATION"}],"hashtag":["OPENSEA"],"authors":["Callan Quinn","The Block"]}