{"summary":"Mrs. Soto had endured three hours in the supermarket line when she got the second text message that left her scratching her head. Her back ached, but she","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/5458\/the-dark-milestone-in-the-evolution-of-money","publishDate":"2018-12-18T13:11:35","id":13547,"type":null,"title":"The dark milestone in the evolution of money","category":["CRYPTOCURRENCY"],"content":["<span data-v-f87c67ca=\"\">Mrs. Soto had endured three hours in the supermarket line when she got the second text message that left her scratching her head.<\/span>","<span data-v-f87c67ca=\"\">Her back ached, but she had no choice but to keep standing: she needed to buy corn flour from a government store to prepare meals for next week. Her social security pension after decades of service, about ten dollars a month, wasn’t enough to consider shopping in the more efficient parallel market.<\/span>","<span data-v-f87c67ca=\"\">The texts came from the Fatherland System. The first one informed her that her pension had just been deposited. She sighed. For five months now, the Venezuelan state has been paying out pensions in this new, <\/span><a href=\"http:\/\/patria.org.ve\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">government-made system<\/span><\/a><span data-v-f87c67ca=\"\"> instead of the more familiar and convenient banking system. Seniors with mostly low technology proficiency were compelled to figure out a clunky digital interface just to cash out their money.<\/span>","<span data-v-f87c67ca=\"\">But then she got the second message, which informed her of something far more insidious. The state had decided, with no prior warning, to withdraw the money she’d gotten a few hours earlier and place it under a new account, stealthily created on her behalf. The message cheerfully said she was now participating in the “petro savings” program.<\/span>","<span data-v-f87c67ca=\"\">Remember the petro? Supposedly the world’s first state-backed cryptocurrency, it was announced with much fanfare last year and, after <\/span><a href=\"https:\/\/steemit.com\/venezuela\/@alemacgo\/the-truth-about-the-petro-launch\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">some false starts<\/span><\/a><span data-v-f87c67ca=\"\">, offered to speculators. To this date, however, petro buyers haven’t received tradeable tokens. The petro cryptocurrency remains an obscure proof of concept, now a Dash clone whose miners are in secret government locations. With no working wallets to speak of, nobody knows how to make transactions. There are no working exchanges to the hyperinflating local currency, the bolívar, or to any other currency, fiat or crypto. Nothing.<\/span>","","","<span data-v-f87c67ca=\"\">The text, however, made a reference about actual money, money that people were counting on, being sent en masse to new petro accounts. But there was something odd: the level of activity in the petro’s <\/span><a href=\"https:\/\/explorador.petro.gob.ve\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">block explorer<\/span><\/a><span data-v-f87c67ca=\"\">, about three transactions per minute (with occasional hours-long hiccups between the blocks), is hard to reconcile with the number of forced participants – <\/span><a href=\"https:\/\/www.facebook.com\/notes\/prensa-presidencial\/alternativas-para-nuestros-pensionados-y-pensionadas-con-el-bono-del-petro\/2198637640159958\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">over 4.3 million<\/span><\/a><span data-v-f87c67ca=\"\"> by official count.<\/span>","<span data-v-f87c67ca=\"\">Where were these petros then, if the heavily advertised blockchain wasn’t being used? As far as we can tell, they exist only in a central government database, the very same one that powers the Fatherland System. There is a name for such an architecture. Rather than cryptocurrency, these petros exist as “central bank digital currency,” or CBDC.<\/span>","<span data-v-f87c67ca=\"\">A recent report by the International Monetary Fund <\/span><a href=\"https:\/\/www.imf.org\/~\/media\/Files\/Publications\/SDN\/2018\/SDN1808.ashx\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">defines CBDC<\/span><\/a><span data-v-f87c67ca=\"\"> as “a digital form of existing fiat money, issued by the central bank and intended as legal tender.” Both the bolívares and the petros that live in the Fatherland System are clearly digital, fit the definition of fiat (no, the petro <\/span><a href=\"https:\/\/www.caracaschronicles.com\/2018\/02\/27\/petro-truly-backed-oil-reserves\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">isn’t really<\/span><\/a><span data-v-f87c67ca=\"\"> backed by a physical commodity), their emission is centrally-decided, opaque and arbitrary, and they have been <\/span><a href=\"https:\/\/www.portafolio.co\/internacional\/venezuela-hace-un-llamado-para-que-las-entidades-del-gobierno-usen-el-petro-516117\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">decreed legal tender<\/span><\/a><span data-v-f87c67ca=\"\">. IMF staff says CBDC “could be the next milestone in the evolution of money” – and these twin ledgers are the first working implementation. These are the world’s first CBDCs.<\/span>","<span data-v-f87c67ca=\"\">Governments have in the past <\/span><a href=\"https:\/\/en.wikipedia.org\/wiki\/Corralito\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">forced conversions of dollars into local currency<\/span><\/a><span data-v-f87c67ca=\"\"> and established <\/span><a href=\"https:\/\/www.caracaschronicles.com\/2014\/08\/21\/when-did-freedom-die\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">bans on buying foreign currency<\/span><\/a><span data-v-f87c67ca=\"\">. But the ability to move money from millions of individual accounts nominally owned by citizens, to ostensibly any other account? That’s unprecedented. It’s the economic fantasy of any dictator. And it’s made possible thanks to this especially sinister design: the money is managed by a central authority that has full access to the money. Even withdrawal.<\/span>","<span data-v-f87c67ca=\"\">Alas, Mrs. Soto doesn’t have time to be outraged. She just needs to cash her money out in bolívares, a currency that halves in value every two weeks, but that her grocery store still takes – there’s no way to transact in petros from the Fatherland System. To undo the forced conversion, she had to interface with the system and endure a process so convoluted the government had to pause its celebration of petro “mass adoption” to publish a 13-step guide to quiet down thousands of complaints on Twitter. <\/span>","<span data-v-f87c67ca=\"\">Five days after the text messages, <\/span><a href=\"http:\/\/www.laverdad.com\/zulia\/149158-solo-el-3-de-jubilados-cambio-la-pension-de-petros-a-bolivares.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">only an estimated 3%<\/span><\/a><span data-v-f87c67ca=\"\"> had converted petros back to bolívares. After conversion, it can take eight days to cash out the CBDC-bolívares into conventional fiat manageable by the commercial banking system – eight days where the bolívar lost 23% of its dollar value.<\/span>","President of Venezuela Nicolas Maduro aka Papa Petro","<span data-v-f87c67ca=\"\">The Fatherland System <\/span><a href=\"https:\/\/www.reuters.com\/investigates\/special-report\/venezuela-zte\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">has been a tight cooperation with the Chinese company ZTE<\/span><\/a><span data-v-f87c67ca=\"\">, that also worked on China’s Social Credit System. Among other things, ZTE helped develop the centralized database and an (unlaunched) platform to process payments. It has been 10 years in the making, and now the system occupies the <\/span><a href=\"https:\/\/www.alexa.com\/topsites\/countries\/VE\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">fourth place<\/span><\/a><span data-v-f87c67ca=\"\"> in Venezuela’s Alexa rankings.<\/span>","<span data-v-f87c67ca=\"\">When cryptocurrency enthusiasts talk about the ills of centralization, we typically make references to inflation and unpopular bank bailouts, but these phenomenons are relatively innocent. The real danger lies in systems like Venezuela’s, where cruel experiments in profiling and total government control over money are taking place. Like concentration camps, these are systems that states should never build – and they should be opposed if they do – lest they trigger a race towards totalitarianism.<\/span>","<span data-v-f87c67ca=\"\">It will take an effort to prevent these evil systems from governing us. The IMF should start considering these political risks for its next report on CBDCs. More analysts should consider the <\/span><a href=\"http:\/\/blog.dgwbirch.com\/?p=418\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">role of privacy<\/span><\/a><span data-v-f87c67ca=\"\">. Democratic governments should be willing <\/span><a href=\"https:\/\/financialservices.house.gov\/calendar\/eventsingle.aspx?EventID=403178\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">to listen<\/span><\/a><span data-v-f87c67ca=\"\">. And we should all pay more attention.<\/span>","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/alegw?lang=en\" data-v-f87c67ca=\"\">Alejandro<\/a> is a computer scientist and product designer. He's researching cryptocurrency adoption in Venezuela at the Open Money Initiative.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Venezuela","content":"LOCATION"},{"type":"Soto","content":"PERSON"},{"type":"Fatherland System","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"IMF","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"Alexa","content":"PERSON"},{"type":"International Monetary Fund","content":"ORGANIZATION"},{"type":"Papa Petro","content":"LOCATION"},{"type":"Nicolas Maduro","content":"PERSON"},{"type":"Open Money Initiative","content":"ORGANIZATION"},{"type":"ten dollars","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Contributor Network","The Block"]}