{"summary":"Will Ruben, senior director of product management at Coinbase, will be joining Uniswap as vice president of product, after more than a decade of experience at big tech and crypto companies. ","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158800\/former-coinbase-and-instagram-director-will-ruben-joins-uniswap-as-vp-of-product","publishDate":"2022-07-21T13:00:08","id":1355,"type":null,"title":"Former Coinbase and Instagram director Will Ruben joins Uniswap as VP of product","category":["Hiring"],"content":["Will Ruben is joining Uniswap, a decentralized cryptocurrency exchange, as vice president of product, the company said on Thursday.&nbsp;&nbsp;","Most recently, Ruben was at Coinbase as vice president of product where he oversaw the teams responsible for web3 and social discovery experiences across Coinbase and Coinbase wallet apps.","\"My time at Coinbase strengthened my belief in the transformative potential of crypto, and, despite the current market, I remain extremely excited about the future of web3,\" said Ruben in a <a href=\"https:\/\/www.linkedin.com\/posts\/wruben_my-last-day-at-coinbase-was-last-week-i-activity-6950801293066088448-ynkH\/\" data-v-f87c67ca=\"\">post<\/a> on his LinkedIn last week.","\"I joined both Facebook and Coinbase the year they went public and enjoyed focusing on building new product experiences for millions (and billions) of people at both places through all the highs and lows. After a decade in Product Manager and PM leadership roles at public tech companies, I’m drawn to the challenge and opportunity of leading Product somewhere smaller with tremendous potential.\"","Ruben was also previously director of product management at Instagram from September 2018 to 2021, leading the feed and relevance pillar in New York City. Back in 2013, Ruben started the growth team at Instagram after the company was bought by Meta (then Facebook). Ruben had left Instagram in 2014, to spend a few years as product lead at Meta leading the company's local discovery team in New York.","\"We’re just at the beginning of the tokenization of everything. I believe Uniswap is perfectly positioned to make everything digital tradable and to build consumer products that bring the promise of fair, accessible markets to everyone on the internet. I’m thrilled to be joining this team as the VP of Product,\" Ruben told The Block.&nbsp;","Uniswap was launched in 2018 by founder Hayden Adams. The company has previously received investments from VC firms, including Andreessen Horowitz, Union Square Ventures, and Paradigm Venture Capital. As of June 2022, the company has 85 employees.&nbsp;","<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">\"We can’t unlock universal<\/span> <span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">ownership or make the global financial&nbsp;<\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">system more inclusive if we don’t have simple, high-craft user experiences built on top of web3&nbsp;<\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">protocols,\" said Ruben. \"Uniswap Labs is at the center of this effort, and I’m excited to bring my experience&nbsp;<\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">building consumer products at scale – especially on mobile – to this exceptional team.\"<\/span>"],"hashtag":["COINBASE","UNISWAP"]}