{"summary":"The potential to buy a slice of pizza with stablecoins may be the gateway for mass adoption of cryptocurrencies, and some stablecoin issuers, including","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34071\/payments-is-replacing-trading-as-stablecoins-major-use-case-and-companies-like-coinbase-want-to-ride-the-trend","publishDate":"2019-08-02T17:36:47","id":13552,"type":null,"title":"Payments is replacing trading as stablecoins&#x27; major use case, and companies like Coinbase want to ride the trend","category":["ASIA"],"content":["<span data-v-f87c67ca=\"\">The potential to buy a slice of pizza with stablecoins may be the gateway for mass adoption of cryptocurrencies, and some stablecoin issuers, including Coinbase, Paxos, and Terra, are pivoting in that direction and have seen some early success.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Coinbase’s payment arm Coinbase Commerce is encouraging shoppers to pay with USDC, a stable coin run by a consortium of which Coinbase is a member, while Paxos allows debit card holders to spend PAX on daily purchases. Across the Pacific Ocean, Korean startup Terra just attracted <\/span><a href=\"https:\/\/pr.blonde20.com\/terra-chai\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">over 240,000 online shoppers<\/span><\/a><span data-v-f87c67ca=\"\"> within 40 days to use its tokens to pay for things like coffee, clothes, and baby wipes.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Indeed, this push represents a shift happening within the cryptocurrency market. Stablecoins, which grew up in the trading world as a way to more quickly move in and out of trading positions, are creeping into the world of e-commerce and merchants, executives say.<\/span>","<span data-v-f87c67ca=\"\">“If you believe that trading is one of the few early use cases, it sort of makes sense that using it as a payment medium would be one of the subsequent use cases,” said head of Coinbase Commerce Justin O’Brien.&nbsp;&nbsp;<\/span>","<b data-v-f87c67ca=\"\">One USDC Pizza? Not so fast&nbsp;<\/b>","<span data-v-f87c67ca=\"\">Coinbase Commerce and Paxos are still in the early stage of implementing stablecoins as a payment medium. Previously only accepting BTC, ETH, BCH, and Litecoin, Coinbase Commerce just added USDC as the first stablecoin on its platform over a month ago. This means that merchants can now accept the stablecoins from their customers with Coinbase Commerce. <\/span><span data-v-f87c67ca=\"\">Meanwhile, Paxos recently formed partnerships with debit card issuers spend.com and crypto.com, which allow people who already hold PAX in their cryptocurrency wallets to spend it for daily purchases.&nbsp;<\/span>","However, in an upcoming episode of The Scoop, <a href=\"https:\/\/www.theblockcrypto.com\/the-scoop-podcast\/\" data-v-f87c67ca=\"\">The Block's podcast<\/a>, Paxos CEO Charles Cascarilla explains why using stablecoins would eradicate the settlement risk that merchants are dealing with under the current payment system.&nbsp;","In the traditional model, merchants would not receive payments at the point of purchase when consumers pay with credit cards. They usually have to wait a few days before the money hits their bank accounts. However, \"when you pay with PAX, they immediately get the dollars. It's sitting in the merchant's hands and he can go buy something with it immediately. It's not some IOU he is going to get in a day or two,” said Cascarilla.&nbsp;","In many respects, Terra is ahead of the pack as payment medium used by shoppers.","<span data-v-f87c67ca=\"\">Unlike some other stablecoin issuers, Terra is not aiming at attracting crypto-believers, according to the company CEO Daniel Shin. Instead, the company mainly uses stablecoins to process payments, which can, in turn, bring down merchant costs consistently and offer constant discounts to customers, Shin told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I would think that us building on a blockchain is actually net negative from a sales perspective because it's a new technology and everyone is scared of new technology,” said Shin. “It's because we save money and we give attractive discounts to customers that they are willing to onboard.”<\/span>","<span data-v-f87c67ca=\"\">The company is proposing as much as 90% reduction in transaction fees to merchants. For example, the Korea e-commerce site TMON on average pays a 2.1% fee per transaction if customers choose to use credit cards as their payment method. With Terra, that number was halved, and the company is looking to push that figure down even further, said Shin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The startup reported that within 40 days of deploying its stablecoin-enabled payment app on two Korean e-commerce sites, it has processed over 380,000 transactions.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Path to mass adoption<\/b>","<span data-v-f87c67ca=\"\">Still, these cryptocurrencies face hurdles. After all, the process to exchange fiat for stablecoins then spend them on goods is confusing to many, if not cumbersome. Consequently, f<\/span><span data-v-f87c67ca=\"\">or now, Paxos is focusing on enabling current cryptocurrency holders to spend their holdings outside of the trading world. <\/span>","<span data-v-f87c67ca=\"\">“If the first use case of cryptocurrencies has been trading... then stablecoins and what we see with PAX, are to give those same users real-world functionality to spend that money if they choose,” said Paxos' Simpson.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In comparison, Coinbase Commerce is hoping to attract more people to hold USDC first before it can expand on its payment ambition. “currently the adoption of stablecoins is limited to people that want to trade… There are critical features that need to be implemented to incentivize people outside of the trading community to hold USDC or other stablecoins.”&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"BCH","content":"ORGANIZATION"},{"type":"Coinbase Commerce","content":"ORGANIZATION"},{"type":"Coinbase Commerce Justin O’Brien","content":"ORGANIZATION"},{"type":"Shin","content":"PERSON"},{"type":"Paxos","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"Paxos","content":"PERSON"},{"type":"Simpson","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Pacific Ocean","content":"LOCATION"},{"type":"2.1%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Cascarilla","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Daniel Shin","content":"PERSON"},{"type":"Charles Cascarilla","content":"PERSON"}],"hashtag":["COINBASE","PAYMENTS","USDC"],"authors":["Celia Wan","The Block"]}