{"summary":"Superform Labs, a crypto startup founded by two former BlockTower investors and a former Microsoft product manager, has raised $6.5 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276631\/crypto-yield-marketplace-superform-raises-funding","publishDate":"2024-02-08T08:00:04","id":13556,"type":null,"title":"Former BlockTower investors raise $6.5 million for crypto yield marketplace Superform","category":["DEALS"],"content":["Superform Labs, a crypto startup founded by two former BlockTower Capital investors and a former Microsoft product manager, has raised $6.5 million in seed and angel funding rounds.","Polychain Capital led the seed round, with <a href=\"https:\/\/www.theblock.co\/post\/176654\/blocktower-launches-150-million-fund-backed-by-bpi-france-and-mass-mutual\" data-v-f87c67ca=\"\">BlockTower Capital<\/a>, Maven 11, Circle Ventures, and other firms participating, Superform said Wednesday. Angel investors in the round included Arthur Hayes, Marc Bhargava, Avi Felman, <a href=\"https:\/\/www.theblock.co\/post\/213203\/blocktower-capital-quietly-parts-ways-with-top-execs\" data-v-f87c67ca=\"\">Michael Bucella<\/a>, and Bryan Pellegrino.","The seed round closed in November 2022, but Superform waited to announce it alongside the launch of its marketplace in early access mode, Blake Richardson, co-founder of Superform, told The Block. The round was structured as equity with token warrants, he said, declining to comment on the valuation.","Richardson founded Superform with his former BlockTower colleague, Vikram Arun, and Alex Cort, a former product manager at Microsoft. At BlockTower, Richardson said he and Arun ran a nine-figure DeFi fund and faced challenges managing yield positions across blockchains daily; therefore, they decided to build Superform.","\"Dealing with positions on 15+ chains at once was laborious and complicated,\" Richardson said. \"We left this great role at BlockTower because we needed to build a solution accessible to everyone. BlockTower Capital supported us in our transition, becoming our second largest backer in our seed round,\" he added.","Superform is a permissionless, cross-chain yield marketplace that lets DeFi protocols list their vaults or asset pools. Crypto users, on the other hand, can deposit funds into those vaults and earn yield.","\"Superform is the first place to permissionlessly list yield,\" Richardson said. \"We are the simplest place to discover, deposit into, and manage yield because we've abstracted away swapping and bridging and made all actions available from a single interface.\"","After a user deposits funds, Superform mints a tokenized representation of the deposit called a SuperPosition. This SuperPosition allows for \"infinitely composable combinations\" of yield, Richardson said. \"Imagine a tokenized representation of liquid restaked ETH on Arbitrum deposited into a lending vault on Optimism. Any combination of interactions across Ethereum Virtual Machines (EVMs) is now possible,\" he added.","Superform is launching today in early access mode across seven EVM-compatible networks — Ethereum, Arbitrum, Optimism, Base, Polygon, Avalanche C-Chain and BNB Chain — with plans to expand to other blockchains in the future.","Superform is utilizing the blockchain infrastructure of LayerZero, Hyperlane, Wormhole, Li.Fi, and Socket for its marketplace, Richardson said. The public launch of Superform is scheduled for the first quarter, he added.","To reward its users, Superform is launching a program called SuperFrens. Season 0 of the program is going live for early-access users, and the first season will go live next month with the platform's open-access release, Richardson said.","SuperFrens is a \"gamified, on-chain\" rewards system, Richardson noted, adding that it will let users engage in competitions with each other to achieve the highest rank on its monthly leaderboard.","SuperFrens are NFTs with a fixed supply, and collecting multiple NFTs of a tier will qualify users for future rewards and exclusive benefits, Richardson said. He declined to comment if those benefits will include its native token airdrops but said SuperPositions will be convertible to ERC-20 tokens and Superform will continue to decentralize.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alex Cort","content":"PERSON"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"BlockTower Capital","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Wormhole","content":"LOCATION"},{"type":"Hyperlane","content":"LOCATION"},{"type":"Superform","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"November 2022","content":"DATE"},{"type":"Avi Felman","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Ethereum Virtual Machines","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Blake Richardson","content":"PERSON"},{"type":"Michael Bucella","content":"PERSON"},{"type":"Richardson","content":"PERSON"},{"type":"Circle Ventures","content":"ORGANIZATION"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"BlockTower","content":"ORGANIZATION"},{"type":"$6.5 million","content":"MONEY"},{"type":"Marc Bhargava","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Bryan Pellegrino","content":"PERSON"},{"type":"Vikram Arun","content":"PERSON"}],"hashtag":["ASSETS","CRYPTO","DECENTRALIZED INFRASTRUCTURE","PROTOCOLS","SEED &AMP; PRE-SEED","TOKENIZATION"],"authors":["Yogita Khatri","The Block"]}