{"summary":"Stablecoin issuer is using privately-held Britannia Bank &amp; Trust to process dollar transfers, Bloomberg News reported.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248048\/tether-taps-private-bank-to-process-dollar-transfers-bloomberg","publishDate":"2023-08-29T17:46:53","id":13557,"type":null,"title":"Tether taps private bank to process dollar transfers: Bloomberg","category":["STABLECOINS"],"content":["Stablecoin issuer&nbsp;Tether is using privately-held Britannia Bank &amp; Trust to process dollar transfers, according to Bloomberg, which cites anonymous sources.","Tether, issuer of the world's largest stablecoin, has started using the privately held bank Britannia Bank &amp; Trust, Bloomberg News <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-08-29\/tether-usdt-adds-bahamas-based-britannia-bank-trust-as-banking-partner?sref=QkiN9npb\" data-v-f87c67ca=\"\">reported<\/a>, citing anonymous sources.","Bloomberg didn't say when the banking relationship began but, citing sources, said Tether has in recent months told clients to transfer money to Britannia’s bank account. Clients wishing to pay for Tether stablecoins have for quite some time faced dwindling options.","Crypto firms of any size have encountered mounting difficulty securing U.S. banking partners since a wave a scandal and bankruptcies spurred heightened regulatory scrutiny.","Historically, Tether, which is also privately-held, has been secretive about its banking relationships, according to Bloomberg.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nWith Circle's USDC stablecoin losing market share, Tether's USDT token has become the clear leader among digital currencies pegged to the dollar.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/stablecoins\/usd-pegged\/total-stablecoin-supply\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Britannia","content":"ORGANIZATION"},{"type":"Britannia Bank &amp; Trust","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["TETHER"],"authors":["RT Watson","The Block"]}