{"summary":"The SEC says Binance.US is not cooperating with its investigation and has only produced just 220 documents.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/251323\/sec-says-its-not-getting-what-it-needs-from-binance-us","publishDate":"2023-09-15T17:42:13","id":13553,"type":null,"title":"SEC says it&#x27;s not getting what it needs from Binance.US","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission says Binance.US is not cooperating with an agreement about the process for its investigation into the crypto exchange, having so far produced just 220 documents — a far cry from what the regulator says is needed.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency has also asked for certain information regarding customer assets, but said BAM,&nbsp; the company behind Binance.US, has so far not obliged.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">BAM agreed to provide discovery related to the custody, security and availability of U.S. customer assets in June after the agency <a href=\"https:\/\/www.theblock.co\/post\/244886\/binance-asks-for-protective-order-over-claims-sec-is-conducting-fishing-expedition\" data-v-f87c67ca=\"\">sued the exchange<\/a> for violating multiple federal securities laws, the SEC said in a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.dcd.256060\/gov.uscourts.dcd.256060.110.9.pdf\" data-v-f87c67ca=\"\">court filing<\/a> released on Thursday.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"As of the date of this filing, BAM has only produced a little over 220 documents,\" the SEC said. \"Many are unintelligible screenshots of bank account information, documents without dates or signatures, and letters from counsel and tables that appear to be prepared for purposes of this litigation, without any supporting evidence or verification by an individual with knowledge confirming the accuracy of the information.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC sued Binance and its founder Chanpeng 'CZ' Zhao in June and said they misrepresented the oversight of the Binance.US platform, among other charges.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">BAM, specifically initially refused to give over information about Ceffu, which the SEC says is a \"newly rebranded Binance Entity\" that appears to control customer assets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"BAM initially sought to defer Ceffu-related discovery as 'non-priority,' asserting it was 'unrelated to the current custody and control of Customer Assets,'\" the SEC said. \"However, given that BAM's policy identified Ceffu as providing 'wallet custody software and support services,' during a July 7 meet and confer, the SEC emphasized the need for this discovery, and BAM agreed to prioritize it.\"&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The court should have BAM to comply with the consent order, specifically regarding Ceffu, certain communications on customer assets and its financial information, the SEC argued.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"BAM has either declined or so far has yet to produce general ledgers as of end of second quarter 2023, bank account opening documents, and documents sufficient to show authorized signatories on the accounts, but they are crucial to testing BAM's assertions that Customer Assets and BAM’s assets are safe, secure, appropriately segregated, and ready for immediate customer withdrawal,\" the agency said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Binance filed a <a href=\"https:\/\/www.theblock.co\/post\/244886\/binance-asks-for-protective-order-over-claims-sec-is-conducting-fishing-expedition\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">motion<\/span><\/a> last month asking for protective order against the SEC, and said it had provided sufficient information to the agency.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"The SEC has declined BAM’s proposals or to meaningfully limit its requests. The SEC’s position is unreasonable and part of a broader pattern of the SEC abusing the discovery provision of the Consent Order,\" BAM wrote in that court filing.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Ceffu","content":"PERSON"},{"type":"July 7","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Chanpeng","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BAM","content":"ORGANIZATION"},{"type":"second quarter 2023","content":"DATE"},{"type":"Binance Entity","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["BINANCE","SEC"],"authors":["Sarah Wynn","The Block"]}