{"summary":"Metaverse giant The Sandbox, the Gemini Frontier Fund, HodlCo and hedge fund Kingsway Capital are now on LandVault&#x27;s cap table.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223192\/landvault-extends-fundraise-metaverse-construction-firm","publishDate":"2023-03-28T08:09:43","id":13567,"type":null,"title":"Metaverse construction firm LandVault extends Series B by $3 million","category":["COMPANIES"],"content":["LandVault, a company that bills itself as a metaverse construction firm, extended its Series B funding round, raising $3 million from the likes of The Sandbox, the Gemini Frontier Fund, HodlCo and hedge fund Kingsway Capital.","The round tops up the $37 million the company has raised so far to build out metaverse infrastructure and gaming tech, according to a company release. It first announced its $25 million Series B fundraise in November 2021.","The fundraise marks a strategic pivot away from what CEO and co-founder Sam Huber called the \"red sea\" of advertising, which it had originally built its business on.","The company will use the capital to continue building out its protocol <a href=\"https:\/\/www.theblock.co\/post\/194568\/landvaults-new-protocol-mints-metaverse-builds-and-experiences-as-nfts\" data-v-f87c67ca=\"\">Matera<\/a>, which puts metaverse builds — such as virtual shops or stadiums — on-chain. It will also be used to grow commercial operations across its hubs in Dubai, Europe, the U.S. and Asia and will further invest in technology, notably AI-powered tools to accelerate the creation and monetization of metaverse content.&nbsp;","“Our vision has always been to accelerate the economy of the metaverse and the latest progress in AI technology is helping us fast track our roadmap,\" Huber said in an interview. \"The metaverse needs a ‘Wordpress moment’ for anyone to build in the metaverse as easily as building a website, and we are investing heavily in R&amp;D to build these tools.”","As for whether Huber is worried that metaverse hype is fading, with the news that mega corps such as Meta and <a href=\"https:\/\/www.theblock.co\/post\/223175\/disney-has-nixed-its-metaverse-team-wsj?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Disney<\/a> are scaling back their visions: “We are past the peak of inflated expectations,\" he said. \"Every time I have a doubt I just look at the Generation Alpha, who were basically born playing games instead of being on social media. They use games as a way to communicate. They are citizens of the metaverse. That’s who we’re building for.\"","The company decided to start raising in January following the Christmas break, Huber told The Block. The fresh funds, raised through funders and companies the organization already knew, have so far topped the Series B round up to $28 million. Huber noted that LandVault is one of the biggest builders currently working in The Sandbox.","There is also a potential further $2 million closing in the next few weeks, which would bring the funding total to $30 million. With the top up, LandVault's valuation remains the same – somewhere in the \"low nine-figures,\" Huber said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Huber","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Huber","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"$2 million","content":"MONEY"},{"type":"$37 million","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"Matera","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"$28 million","content":"MONEY"},{"type":"Kingsway Capital","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Europe","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"$25 million","content":"MONEY"},{"type":"November 2021","content":"DATE"}],"hashtag":["SERIES B","STRATEGIC INVESTMENTS","THE SANDBOX","VR"],"authors":["Lucy Harley-McKeown","The Block"]}