{"summary":"The Celsius examiner has filed a preliminary plan that estimates the total cost of her investigation could be as high as $5 million. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176436\/celsius-examiner-files-preliminary-work-plan-for-upcoming-investigation","publishDate":"2022-10-11T19:40:52","id":13576,"type":null,"title":"Celsius examiner files preliminary work plan for upcoming investigation","category":["LEGAL"],"content":["The examiner in the Celsius bankruptcy has filed a preliminary plan that estimates the total cost of her investigation could be as high as $5 million, and at the same time asked Celsius to pick up the pace of its disclosures.&nbsp;&nbsp;","Shoba Pillay said the first priority of her investigation is to get a firmer grasp on the volume and extent of documents and data that her team will need to review and analyze. While the Jenner &amp; Block lawyer recognized that Celsius is fielding multiple demands for information, she noted her requests must be prioritized to meet court deadlines.","\"If the Examiner is going to meet the Court’s deadlines, the pace of access to documents will need to be accelerated,\" she said in <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174910112280000000162.pdf\" data-v-f87c67ca=\"\">the plan filed today<\/a>.","Her team has shared these concerns with Celsius and \"is optimistic\" that the bankrupt lender will respond promptly to her requests in the future.&nbsp;","While Pillay said \"any attempt to budget at this time is at best an educated guess,\" since she hasn't received the necessary documents to assess the work ahead, she can roughly estimate that the fees for her and her team will be between $3 to $5 million.&nbsp;","As of now, she anticipates interviewing 15-25 witnesses, as well as talking with Celsius executives and employees in \"non-interview settings\" to facilitate the flow of information. She also plans to retain forensic and financial advisor Huron and intends to submit that request in the near future.","Her team will also monitor any government investigations into Celsius. State regulators have repeatedly <a href=\"https:\/\/www.theblock.co\/post\/168369\/celsius-ran-a-ponzi-like-scheme-states-allege\" data-v-f87c67ca=\"\">expressed their concerns<\/a> during the Chapter 11 process, and pointed out that Celsius is the target of a multi-state investigation into possible securities violations.","The work plan will be presented for approval to Chief Bankruptcy Judge Martin Glenn on Oct. 21. Parties in the case may file objections or comments up until Oct. 18.","The court appointed Pillay as an unbiased examiner after the government's representative in the case, the U.S. Trustee, made repeated <a href=\"https:\/\/www.theblock.co\/post\/164417\/us-trustee-moves-to-appoint-examiner-in-celsius-bankruptcy-case\" data-v-f87c67ca=\"\">calls for greater clarity<\/a> into Celsius' business dealings. Pillay is tasked with completing an outside investigation into the lender's business dealings, including its storage of crypto holdings, account management for customers, the status of its mining business and tax issues. <a href=\"https:\/\/www.theblock.co\/post\/168733\/creditor-representatives-support-plan-to-appoint-examiner-in-celsius-bankruptcy\" data-v-f87c67ca=\"\">That scope was narrowed<\/a> through the court process due to concerns over incurring further costs for the already bankrupt estate.","Pillay's work proposal says a number of interested parties have suggested expanding that scope. Still, she said she does not have enough information presently to weigh in on the issue. Any expansion of scope would be circulated to other parties in the process, including the creditor committee, which originally objected to spending large swaths on an examiner, and Celsius counsel. This work plan may also be modified down the line with court approval.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Martin Glenn","content":"PERSON"},{"type":"$3","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Examiner","content":"ORGANIZATION"},{"type":"Pillay","content":"PERSON"},{"type":"Celsius","content":"PERSON"},{"type":"Oct. 21","content":"DATE"},{"type":"Jenner &amp; Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Shoba Pillay","content":"PERSON"},{"type":"Oct. 18","content":"DATE"},{"type":"$5 million","content":"MONEY"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}