{"summary":"Solana wallet Phantom added support for the Ethereum and Polygon blockchains in its first step to go multichain.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228320\/solana-wallet-phantom-multichain-ethereum-polygon","publishDate":"2023-04-26T10:00:45","id":13572,"type":null,"title":"Solana wallet Phantom goes multichain, expands to Ethereum and Polygon","category":["WEB3"],"content":["Solana wallet Phantom is adding support for the Ethereum and Polygon blockchains on May 1 in its first step to go multichain.","Phantom is an app and in-browser wallet extension that has always been focused on providing a clean user experience by showing NFTs within the wallet. It lets users swap and stake tokens within the wallet extension.","Now that it's multichain, each user will see an Ethereum and Polygon address for each wallet address. They can see all their funds on the three networks in one place for each wallet. They will be able to make transactions from the wallet to either of the three blockchains depending on which asset they are moving — instead of having to change the network, which is how MetaMask works.","The wallet will also contain features for NFT holders. It will show specific data related to NFT collections, like the floor price — the lowest value of all NFTs on sale — and the amount the NFT was purchased for. Users can also list their NFTs on marketplaces directly from Phantom.","“We believe that the future of digital asset management lies in cross-chain interoperability, and we're committed to providing our users with the tools and resources they need to easily navigate and transact across various blockchain networks,\" said Brandon Millman, co-founder and CEO of Phantom. “By bridging the gap between different protocols, we're enabling a new era of decentralized innovation for all digital asset users.”","Phantom has also introduced a few security measures. These include transaction simulation so that users get a better picture of what transactions they are signing and NFT spam filtering — hiding suspicious NFTs from wallets to prevent attacks. The wallet will also block access to malicious websites.","(<em data-v-f87c67ca=\"\">Updates story in first paragraph to add May 1 date.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"May 1","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Brandon Millman","content":"PERSON"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}