{"summary":"Stablecoin operator Tether intends to reduce secured loans in its reserves to zero in 2023. ","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/194620\/tether-vows-to-remove-secured-loans-amid-rush-to-show-solvency","publishDate":"2022-12-13T11:42:33","id":1357,"type":null,"title":"Tether vows to remove secured loans from its backing","category":["Stablecoins"],"content":["Tether intends to remove all secured loans from its backing in 2023 after The Wall Street Journal said that the stablecoin operator's increasing roster of loans might make it unable to pay back redemptions in the event of a crisis.","The company told the WSJ that its loans reached $6.1 billion, or 9% of Tether's total assets, as of Sept. 30. The group's consolidated total assets <a href=\"https:\/\/tether.to\/en\/tether-proves-resilience-of-reserves-in-latest-attestation\/\" data-v-f87c67ca=\"\">reached<\/a> more than $68 billion in the third quarter. Tether claimed to make sure borrowers offer \"extremely liquid\" collateral for these loans, but now the operator plans to scrap them altogether.&nbsp;","<span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">\"Tether is professionally and <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">conservatively managed, and this will be demonstrated once again by successfully winding down <\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">the lending busines<\/span><span dir=\"ltr\" role=\"presentation\" data-v-f87c67ca=\"\">s without losses — since all loans are over-collateralized by liquid assets,\" the company said in a statement.&nbsp;<\/span>","The news comes after the collapse of crypto exchange FTX, and as exchanges and other entities attempt to reassure markets that they are solvent.&nbsp;\"Tether's reserves are extremely liquid with the majority of its investments, making up 82% of the total assets, being held in Cash &amp; Cash equivalent and other short-term deposits,\" the company said on Nov. 10.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/share-of-total-stablecoin-supply\/embed\" title=\"Share of Total Ethereum Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","USDT is one of the most popular stablecoins pegged to the U.S. dollar, making up 31.6% of the total Ethereum-based stablecoin supply, according to The Block's Data Dashboard.&nbsp;"],"hashtag":["TETHER"]}