{"summary":"A behind-the-scenes battle broken out among deep-pocketed crypto investors as Uniswap moves to select a cross-chain bridging protocol partner.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207297\/uniswap-temperature-check-spurs-feverish-backroom-maneuvering-among-crypto-vc-heavyweights","publishDate":"2023-01-31T20:46:15","id":13573,"type":null,"title":"Uniswap temperature check spurs feverish backroom maneuvering among crypto VC heavyweights","category":["COMPANIES"],"content":["A community \"temperature check\" vote to see which cross-chain bridge would be utilized for decentralized exchange Uniswap's third iteration <a href=\"https:\/\/snapshot.org\/#\/uniswap\/proposal\/0x6b8df360fdf73085b21fdf5eef9f85916fbde95621a3d454cb20fbe545ffc852\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">swung decidedly in favor<\/a> of Wormhole. But there's a catch.","<a href=\"https:\/\/www.theblock.co\/post\/207013\/uniswap-on-bnb-chain-wormhole-wins-bridge-selection-vote\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Today's outcome<\/a> isn't technically final. An official vote to approve Wormhole as a bridge between Ethereum and the BNB chain is yet to come.","But a behind-the-scenes fight among deep-pocketed crypto investors could potentially swing the outcome in a different direction, three sources tell The Block — with hundreds of millions of dollars at stake.","The fight involves venture capital firms a16z and Jump, which back LayerZero and Wormhole, respectively. A source with knowledge of the process told The Block that a16z, which has 15 million voting tokens, could not participate in the temperature check due to the custodial set-up of its tokens.","Eddy Lazzarin, an investing partner at a16z, appeared to confirm the issues in <a href=\"https:\/\/gov.uniswap.org\/t\/rfc-update-deploy-uniswap-v3-1-0-3-0-05-0-01-on-bnb-chain-binance\/19734\/78\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a forum post<\/a>, saying that the firm was unable to participate in the temperature check.","\"To be totally unambiguous, we at a16z would have voted 15m tokens toward LayerZero if we were technically able to. And we will be able in future Snapshot votes,\" Lazzarin wrote. \"So, for the purposes of a 'temperature check,' please count us this way.\"","The Uniswap Foundation, another source said, hasn't said whether it will honor that written commitment to LayerZero. According to today's official tally, Wormhole won the vote by approximately 11 million token votes.&nbsp;","Wormhole proponents are hopeful that a16z will vote in line with the temperature vote, with one person close to the project telling The Block, \"if a16z goes against community vote and tries to tank it, I'd be shocked. That would be truly abhorrent, and I don't think they would go that far.\"","An a16z spokesperson confirmed that the firm plans to participate in any on-chain vote. Jump did not provide comment for this story at the time of publication.&nbsp;","The debate between the two bridges is partly about the security differences between Wormhole, LayerZero or other contenders. Cross-chain bridges have been the target of numerous attacks, including last February's $325 million attack on Wormhole.","Late Monday, supporters of both LayerZero and Wormhole sought to pressure Uniswap token delegates to vote in their favor, according to a delegate who spoke to The Block.","One delegate told The Block it's a matter of LayerZero investors&nbsp; thinking \"their bags are the best &amp; investors in Wormhole think their bags are the best.\"","Beyond security, there's a financial aspect to the back-and-forth — specifically, the prospect of the winning bridge potentially securing a significant amount of staked assets once the integration goes live. Investors associated with the chosen protocol may stand to reap a significant windfall as a result.","When reached for comment, LayerZero highlighted Lazzarin's forum post, saying,\"We think the goal of the temperature check is to take poll of the will of the governance and I think this is very clear.\"","\"We think given those facts LayerZero is the preferred bridge in the temperature check but believe the Uniswap Foundation should add both options to the final on-chain vote as that is how governance issues should be decided and have always been decided with Uniswap,\" the startup said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$325 million","content":"MONEY"},{"type":"Uniswap","content":"PERSON"},{"type":"Uniswap Foundation","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"BNB","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Eddy Lazzarin","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","Michael McSweeney","The Block"]}