{"summary":"Maker could earn roughly 15 million USDC in annual revenue by moving assets to Coinbase to earn institutional rewards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179074\/makerdao-on-course-to-custody-1-1-billion-usdc-with-coinbase-for-rewards","publishDate":"2022-10-21T15:48:04","id":13581,"type":null,"title":"MakerDAO on course to custody 1.1 billion USDC with Coinbase for rewards","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">An in-progress governance vote on MarkerDAO was solidified by a16z, which voted in favor of Maker Improvement Proposal 81 to move roughly 1.1 billion USDC into Coinbase Custody to earn institutional rewards.<\/span>","<span data-v-f87c67ca=\"\">The platform stands to earn roughly 15 million USDC in annual revenue by moving assets to Coinbase, according to MakerDAO.<\/span>","<span data-v-f87c67ca=\"\">MakerDAO, the issuer of the stablecoin DAI, appears set to move forward with a proposal to onboard an account to Coinbase prime and transfer roughly 33% of its USDC ($1.1 billion) into custody.<\/span>","<span data-v-f87c67ca=\"\">a16z deal partner, Porter Smith, <\/span><a href=\"https:\/\/twitter.com\/_portersmith\/status\/1583518754834550784?s=20&amp;t=DKUnDp2Aklk0LindxYMO0g\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">announced<\/span><\/a><span data-v-f87c67ca=\"\"> the venture capital firm’s support for Coinbase Institutional’s Maker Improvement Proposal (MIP) 81 that would provide institutional rewards for USDC with MakerDAO. Founded by Marc Andreessen and Ben Horowitz, a16z cast the majority vote that solidified approval of MIP81.<\/span>","<a href=\"https:\/\/vote.makerdao.com\/polling\/QmbMaQ9A#vote-breakdown\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">The ongoing vote<\/a> ends Oct. 24, and as of press time, 88.19% of voting MKR tokens are in favor of approval.&nbsp;","<span data-v-f87c67ca=\"\">Under the proposal, MakerDAO will use the 1.6 billion USDC to participate in Coinbase’s USDC Institutional Rewards program, after which Maker Governance will have access to near-instantaneous (&lt;6 minutes) mint, burn, settlement, and withdrawal functions on Coinbase Prime. Coinbase will calculate rewards on a monthly basis from the weighted average of assets on the platform. Rewards are to be paid out the fifth business day, a month after the calculation and Maker will pay Coinbase zero custody fees.<\/span>","<span data-v-f87c67ca=\"\">“According to the rewards schedule proposed by MIP81, the implementation of this proposal would represent ~15 million USDC in annual revenues for MakerDAO,” MakerDAO <\/span><span data-v-f87c67ca=\"\">tweeted<\/span><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Smith <\/span><a href=\"https:\/\/forum.makerdao.com\/t\/mip81-coinbase-usdc-institutional-rewards\/17703\/220\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">expressed<\/span><\/a><span data-v-f87c67ca=\"\"> hope the implementation with Coinbase will drive a path towards long-term decentralization and resiliency for DAI in a thread on MIP81 on the MakerDAO governance forums. However, in the final proposal, he said that automating liquidity flows between the peg stability module smart (PSM) contract, which manages Governance fees the protocol earns from swaps, and the Coinbase Prime account “could be important from a technical perspective.”<\/span>","<span data-v-f87c67ca=\"\">If the funds were instead “deposited into a Coinbase smart contract that didn’t have custodial access to the funds” it “could automatically deposit funds back into the PSM based on programmatic thresholds,” said Smith, who added that such a method would prevent Coinbase’s “custody” from becoming an obstacle to a surge of user redemptions.<\/span>","<span data-v-f87c67ca=\"\">However, before all that happens the Maker will undergo an onboarding process that includes a legal review with contractual arrangements to ensure Maker Governance has control over liquidity, that no third parties may block the capacity of Maker Governance to execute decisions or modify structures, and that no weak links or edge cases allow for the misappropriation or freezing of funds, the proposal noted.<\/span>","<span data-v-f87c67ca=\"\">Governance activities for Maker spiked lately as eight of nine recent polls on the platform are marked as High Impact for the protocol, among them MIP81, MakerDAO <\/span><a href=\"https:\/\/twitter.com\/MakerDAO\/status\/1583504154516856832?s=20&amp;t=DKUnDp2Aklk0LindxYMO0g\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\">. Another Coinbase transaction-focused proposal seeks to collateralize a 500 million USDC loan to Coinbase with ETH and BTC via the PSM with an interest rate between 4.5% to 6% to be paid monthly.<\/span>","<span data-v-f87c67ca=\"\">Other proposals focused on a complex restructuring of MakerDAO to support decentralization, dubbed the “<\/span><a href=\"https:\/\/t.co\/zQn4GCgXis\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Endgame Plan<\/span><\/a><span data-v-f87c67ca=\"\">,” and <\/span><a href=\"https:\/\/twitter.com\/MakerDAO\/status\/1583504183181082625?s=20&amp;t=DKUnDp2Aklk0LindxYMO0g\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">offboarding core<\/span><\/a><span data-v-f87c67ca=\"\"> units of MakerDAO.<\/span>","<span data-v-f87c67ca=\"\">In an effort to strengthen the project's balance sheet, Maker also recently <\/span><a href=\"https:\/\/www.theblock.co\/post\/175311\/makerdao-initiates-500-million-investment-in-us-treasuries-corporate-bonds\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">took steps<\/span><\/a><span data-v-f87c67ca=\"\"> to issue $500 million of its stablecoin reserves into short-term US treasury bonds and investment-grade corporate bonds.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase Institutional’s Maker Improvement Proposal","content":"ORGANIZATION"},{"type":"PSM","content":"ORGANIZATION"},{"type":"Porter Smith","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"4.5%","content":"PERCENT"},{"type":"Marc Andreessen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coinbase","content":"LOCATION"},{"type":"Coinbase Custody","content":"ORGANIZATION"},{"type":"33%","content":"PERCENT"},{"type":"88.19%","content":"PERCENT"},{"type":"Smith","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Maker Governance","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Oct. 24","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Coinbase Prime","content":"ORGANIZATION"},{"type":"Ben Horowitz","content":"PERSON"}],"hashtag":["COINBASE","DAI","USDC"],"authors":["Jeremy Nation","The Block"]}