{"summary":"Optimism&#x27;s Bedrock update went live during a scheduled migration on Tuesday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233364\/optimism-completes-upgrade-of-its-layer-2-network","publishDate":"2023-06-06T18:05:16","id":13582,"type":null,"title":"Optimism completes upgrade of its Layer 2 network","category":["LAYER 2S AND SCALING"],"content":["Optimism, a Layer 2 network built on top of the Ethereum network, completed a scheduled upgrade on Tuesday.","According to an <a href=\"https:\/\/community.optimism.io\/docs\/developers\/bedrock\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">explainer post<\/a>, the Bedrock upgrade advances a series of improvements, including reduced transaction costs.&nbsp;","The upgrade process began shortly after 12 p.m. ET, according to the network's <a href=\"https:\/\/status.optimism.io\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">status<\/a> page, and was declared complete around 3 p.m. ET. According to a status page run by OP Labs, most of the core functions have already returned to the network.","Just before 6 p.m. ET, the upgrade status page said that the network's public endpoint was back online.","Some of the update process has taken longer than expected, according to the Optimism team.","\"Due to the size of the archival data disk, it is taking longer than anticipated for the legacy-geth archival datadir to be available,\" the Optimism Foundation said in a tweet.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"12 p.m. ET","content":"TIME"},{"type":"Optimism Foundation","content":"ORGANIZATION"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"3 p.m. ET","content":"TIME"},{"type":"6 p.m. ET","content":"TIME"}],"hashtag":["OPTIMISM"],"authors":["Michael McSweeney","The Block"]}