{"summary":"IN RE TEZOS SECURITIES LITIGATION\nCourt initially appointed Arman Anvari as lead plaintiff in the consolidated class action, \nThe Court refused to substitute Anvari’s chosen plaintiff replacement and instead granted Trigon’s motion because “Trigon is the sequential plaintiff who contributed the second-most to Tezos and has claims representative of the putative class”\nThe Court said that it did not think it was necessary to restart a statutory 60 day notice period for lead plaintiff selection","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/19509\/tezos-securities-litigation-continues-with-a-new-lead-plaintiff","publishDate":"2019-04-13T16:00:48","id":1358,"type":null,"title":"Tezos securities litigation continues with a new lead plaintiff","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]IN RE TEZOS SECURITIES LITIGATION, Case №17-cv-06779-RS (N.D. Cal, 4\/8\/19, Document #213) (“Order on Plaintiffs’ Motion to Substitute Lead Plaintiff”) [SDP]<\/strong><\/em>","Loyal CCM readers will recall that when we last checked in on the Tezos class action litigation at issue was who was going to be the lead plaintiff and whether or not the defendants would be able to delay the case by requiring a statutory clock to be restarted. The Court on March 8 issued a ruling that addressed both of these issues, allowing the case to trudge forward under slightly different management and without restarting the clock. Also, if this judge reads conspiracy theory blog posts on medium about this case you wouldn’t know, because the opinion unsurprisingly doesn’t mention them.","The court initially appointed Arman Anvari as the lead plaintiff in this consolidated class action. Motions to Dismiss were filed. Tim Draper and Bitcoin Suisse were dismissed but the Breitmans, their company Distributed Ledger Solutions, and the Tezos Foundation remained as Defendant. Anvari then moved to withdraw as the lead plaintiff and substitute Artiom Franze. Another plaintiff, Trigon, also asked to be appointed and asked for its lawyers to be substituted as class counsel. (I’m not saying that money matters to anyone involved here but, yeah, class counsel will end up making more money).","The Defendants didn’t take a position about who should be lead plaintiffs, although they filed briefs saying that Anvari was a really bad guy, and at least one blog post appeared on Medium to this effect. The Court didn’t expressly weigh in on anyone’s character, but said that Anvari didn’t have to be a plaintiff if he didn’t want to be (there’s caselaw to this effect, not surprisingly). They also asked that the court restart a statutory notice period for lead process selection, which would of course have the effect of slowing the case down, not that this was anyone’s intent.","[related id=2]The Court said that it did not think it was necessary to restart a statutory 60 day notice period for lead plaintiff selection. The statute “does not contemplate any sort of lead-plaintiff proceedings beyond the very start of the litigation.” This doesn’t mean, however, that a withdrawing plaintiff gets to pick their own replacement. In fact, the Court refused to substitute Anvari’s chosen plaintiff for Anvari. Instead, it granted Trigon’s motion, in part because “Trigon is the sequential plaintiff who contributed the second-most to Tezos and has claims representative of the putative class. Indeed, Anvari’s counsel conceded at oral argument that Trigon is the next party with the most at stake besides Frunze.”","But what about Anvari’s lawyers? Even though they lost their client, the Court said that they could remain in the case as co-lead counsel with Trigon’s counsel. The Court said that “in light of Anvari’s counsels’ extensive work and knowledge of the case, the class would benefit from their continued prosecution of this case.”","Because there’s a new lead plaintiff, the pending class certification motion was denied without prejudice. With Trigon at the helm, a class certification will be filed in its name. Discovery related to that motion and then briefing and a ruling on that motion will be the next major milestone in this case.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}