{"summary":"Decentralized exchange protocol KyberSwap offered a 10% bounty to the hacker who executed an exploit leading to the $47 million loss.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264579\/kyberswap-offers-10-bounty-to-hacker-following-47-million-exploit","publishDate":"2023-11-24T05:27:22","id":13594,"type":null,"title":"KyberSwap offers 10% bounty to hacker following $47 million exploit","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized exchange protocol KyberSwap offered a 10% bounty to the hacker who executed an exploit leading to the loss of <a href=\"https:\/\/www.theblock.co\/post\/264432\/dex-protocol-kyberswap-appears-to-lose-47-million-in-possible-exploit\" data-v-f87c67ca=\"\">$47 million<\/a>.","The attack, which occurred earlier this week, targeted KyberSwap’s Elastic pools, compromising funds across multiple blockchains including Arbitrum, Optimism, Ethereum, Polygon, and Base.","The perpetrator had previously left a message on the blockchain suggesting an interest in negotiating with the team. The message stated: “Dear Kyberswap Developers, Employees, DAO members, and LPs, negotiations will start in a few hours when I am fully rested. Thank you.”","Today, KyberSwap proposed a deal. In an <a href=\"https:\/\/etherscan.io\/idm?addresses=0x8180a5ca4e3b94045e05a9313777955f7518d757,0x50275e0b7261559ce1644014d4b78d4aa63be836&amp;type=1\" data-v-f87c67ca=\"\">on-chain message<\/a>, the team offered an implied white hat bounty reward equal to 10% of the stolen funds (roughly $4.7 million) on the basis that the hacker returns the remaining 90% to a specified address by 6 am UTC on November 25.","In the message, KyberSwap co-founder Victor Tran said the hacker can return the funds or \"stay on the run.\"","The bounty offer is part of KyberSwap’s efforts to mitigate the consequences of the incident and make liquidity providers whole. Security firm Beosin <a href=\"https:\/\/medium.com\/@Beosin_com\/heco-bridge-hacked-over-83-m-and-kyber-exploited-over-48m-1876d2dbd3fd\" data-v-f87c67ca=\"\">explained<\/a> that the vulnerability that resulted in the attack was due to an issue with the tick interval boundaries on Kyber's liquidity pools. This enabled the hacker to artificially double the liquidity, which they were then able to drain.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"Polygon","content":"LOCATION"},{"type":"Victor Tran","content":"PERSON"},{"type":"Beosin","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"November 25","content":"DATE"},{"type":"$4.7 million","content":"MONEY"},{"type":"DAO","content":"ORGANIZATION"},{"type":"KyberSwap","content":"ORGANIZATION"},{"type":"$47 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["EXPLOITS","HACKS"],"authors":["Vishal Chawla","The Block"]}