{"summary":"A generative artist has made 1,623 ether (around $5.38 million) through a sale on Art Blocks, the non-fungible token (NFT) platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117605\/art-blocks-hit-generative-artist-5-38-million","publishDate":"2021-09-14T07:29:01","id":13591,"type":null,"title":"Generative artist nets $5.38 million in latest Art Blocks hit","category":["THE BLOCK"],"content":["A generative artist whose work depicts flowers within a “potentially infinite field of foliage” has made 1,623 ether (around $5.38 million) through a sale on Art Blocks, the non-fungible token (NFT) platform.","Monica Rizzolli’s <a href=\"https:\/\/artblocks.io\/project\/159\" data-v-f87c67ca=\"\">‘Fragments of an Infinite Field’<\/a> collection, comprised of 1,024 pieces, was sold through a Dutch auction on Art Blocks Curated on September 13 – with prices starting at 10 ether. The entire set sold out in under an hour.","Transaction data <a href=\"https:\/\/etherscan.io\/address\/0xDCF4DE0cD2baD3579eDe845fD5c3442b6C8f9dDC\" data-v-f87c67ca=\"\">on Etherscan<\/a> shows Rizzolli netting 1,623 in ether across three transactions in the hours after the sale.&nbsp;","Since the initial mint, individual pieces from the collection have changed hands on the NFT marketplace OpenSea <a href=\"https:\/\/opensea.io\/assets\/0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270\/159000760\" data-v-f87c67ca=\"\">for as much as 69 ether<\/a> (around $229,000). The so-called ‘floor price’ – determined by the lowest priced pieces in the set – currently stands at roughly 13.4 ether (around $44,500).","Certain well-followed NFT collectors such as the pseudonymous <a href=\"https:\/\/twitter.com\/CozomoMedici\/status\/1437501710373584896\" data-v-f87c67ca=\"\">Cozomo de’ Medici<\/a> and <a href=\"https:\/\/twitter.com\/Fauji100\/status\/1437709624493314051\" data-v-f87c67ca=\"\">JDH<\/a> stumped up hundreds of thousands of dollars to snap up individual pieces in the set.","One Twitter user <a href=\"https:\/\/twitter.com\/banterlytics\/status\/1437691276468625419\" data-v-f87c67ca=\"\">pointed out<\/a>, citing Dune Analytics data, that Art Blocks notched its best single day for secondary market sales in September yesterday, the bulk of which was down to trading in Rizzolli’s work.","Generative artists write code that creates art in a certain style and within certain parameters, but at random such that the artists themselves cannot predict exactly what their work will look like.","The genre <a href=\"https:\/\/www.theblockcrypto.com\/news+\/116957\/nft-generative-art-future\" data-v-f87c67ca=\"\">has boomed<\/a> in popularity over the summer – primarily due to surging investment in the NFT space. Art Blocks has <a href=\"https:\/\/www.theblockcrypto.com\/news+\/115199\/squiggles-art-blocks-nft-frenzy\" data-v-f87c67ca=\"\">capitalized on these market conditions<\/a> so effectively that it recently had to introduce Dutch auctions – in which bidding starts high and gradually falls until everything is sold – to slow the pace at which new work is hoovered up off the platform.","In a blurb describing the project, Rizzolli said “the main environmental parameter of the composition is the determination of a season of the year.”","“The season determines the landscape’s colors and defines specific phenomena for each of them, such as rain in summer, snow in winter, petals falling in autumn, and pollen in spring. The flower has several possible variables, which can be macro aspects, affecting the entire population of the species, or micro, affecting each individual of the species differently,” she added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"$5.38 million","content":"MONEY"},{"type":"Monica Rizzolli","content":"PERSON"},{"type":"hundreds of thousands of dollars","content":"MONEY"},{"type":"September yesterday","content":"DATE"},{"type":"winter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"September 13","content":"DATE"},{"type":"$229,000","content":"MONEY"},{"type":"Rizzolli","content":"LOCATION"},{"type":"Rizzolli","content":"PERSON"},{"type":"spring","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"$44,500","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}