{"summary":"Crypto exchange Binance.US has eliminated fees on spot ether trading for all customers six months after it first cut such fees for bitcoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192851\/binance-zero-trading-fees-ether-fee-model","publishDate":"2022-12-07T09:00:10","id":13609,"type":null,"title":"Binance.US expands zero trading fees to ether, updates fee model","category":["EXCHANGES"],"content":["Crypto exchange Binance.US has eliminated fees on spot ether trading for all customers. The move comes six months after it first cut such fees for bitcoin.","Effective immediately, all new and existing users of Binance.US will pay no fees for trading ether in four pairs — ETH\/USD, ETH\/USDT, ETH\/USDC and ETH\/BUSD — the exchange announced today.","\"By eliminating fees first on BTC and now ETH, we are further cementing our position as the low fee leader in crypto, raising awareness for the high fees consumers are paying on other platforms, and helping to restore trust in the greater ecosystem,\" Brian Shroder, CEO and president of Binance.US, said in a statement. \"Now, more than ever, it is critical that platforms operate with users’ interests first.”","Binance.US is also simplifying its fee schedule from the current three tiers to two tiers, starting in January 2023. \"We are simplifying our fee schedule to offer two tiers: one that is free and one at our current Tier II rates,\" a Binance spokesperson told The Block.","Binance.US, launched in September 2019, is one of the larger crypto exchanges by fiat trading volume. Eliminating bitcoin trading fees <a href=\"https:\/\/www.theblock.co\/post\/153495\/binance-us-bitcoin-trading-fees-zero-select-pairs\" data-v-f87c67ca=\"\">helped<\/a> further increase trading volumes, said the spokesperson. The exchange had a fiat trading volume of over $10 billion in November, according to <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/fiat-exchange-volume\" data-v-f87c67ca=\"\">The Block's Data Dashboard.<\/a>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/fiat-exchange-volume\/embed\" title=\"Fiat Exchange Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","When asked if the zero-fee structure will also be extended to other cryptocurrencies, the Binance.US spokesperson said \"we are always studying and exploring opportunities to deliver more value to users as part of our commitment to building the most customer-centric organization in crypto.\"","Binance.US currently operates in 46 states, as well as Puerto Rico, and the exchange <a href=\"https:\/\/blog.binance.us\/binance-us-new-territories\/\" data-v-f87c67ca=\"\">said<\/a> earlier this week that it is working closely with the remaining state regulatory agencies to secure approvals to offer services across all 50 states and territories.","In July, Binance <a href=\"https:\/\/www.theblock.co\/post\/156121\/binance-set-to-drop-bitcoin-trading-fees-to-zero-on-select-pairs-globally\" data-v-f87c67ca=\"\">followed<\/a> Binance.US and eliminated trading fees on several bitcoin spot trading pairs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"September 2019","content":"DATE"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Brian Shroder","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}