{"summary":"A new Solana scaling protocol named Layer N that could quicken DeFi derivatives and on-chain social networks has come out of a stealth development phase ahead of a mainnet launch expected next year. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183819\/solana-scaling-protocol-layer-n-comes-out-of-stealth-mode","publishDate":"2022-11-07T13:43:16","id":1360,"type":null,"title":"Solana scaling protocol Layer N comes out of stealth mode","category":["BLOCKCHAIN"],"content":["A new Solana scaling protocol named Layer N that could quicken DeFi derivatives and on-chain social networks has come out of a stealth development phase ahead of a mainnet launch expected next year.&nbsp;","Similar to Ethereum’s multichain scaling architecture, Layer N builds on top of Solana with the goal of increasing scalability and <span class=\"NormalTextRun SCXW85531665 BCX0\" data-v-f87c67ca=\"\">will be working with Ledger Prime and Pattern Research as liquidity partners.<\/span>","Layer N says it's the first blockchain that will be able to match the throughput, or speed, of a centralized exchange. <span data-v-f87c67ca=\"\">The protocol said it employs a \"novel execution environment, dubbed the guardian network, as well as a few sets of unique technical innovations and optimizations to scale up execution.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"<\/span><span data-v-f87c67ca=\"\">Layer N will push the boundaries of throughput and latency that users are accustomed to on the Solana blockchain,'' Layer N Co-founder Dima Romanov said in a statement provided to The Block.&nbsp; \"Through our technology, on-chain computation will approach centralized server performance for the first time.\"<br data-v-f87c67ca=\"\">\n<\/span>","<a href=\"https:\/\/www.theblockresearch.com\/a-comparison-of-blockchain-execution-environments-evm-sealevel-movevm-wasm-cairovm-179516\" data-v-f87c67ca=\"\">Execution environments<\/a>&nbsp;are a critical infrastructure component that shape the way assets and smart contracts behave on blockchains and impact the end-user and developer experience. While yet to be proven, Layer N said it could open up use cases that previously were not possible in the current blockchain environment.","“For DeFi derivatives, a sub 100ms sequencer that settles to Solana could rival the user experience of a centralized exchange, opening the door for new and innovative DeFi products,” Solana Co-founder Anatoly Yakovenko said in the statement.&nbsp;","Layer N plans to deploy a \"sandbox\" testing environment by the end of this year that will allow anyone to view a testing program it plans to deploy on its devnet.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dima Romanov","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Ledger Prime and Pattern Research","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}