{"summary":"The gains in pepe, a crypto token styled on the Pepe the Frog cartoon meme, have pushed it into the ranks of the top 50 most valuable tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/229676\/pepe-memecoin-tops-1-billion-market-cap-even-as-binance-flags-lack-of-utility","publishDate":"2023-05-05T09:01:46","id":13614,"type":null,"title":"Pepe coin tops $1 billion market cap even as Binance flags lack of utility","category":["CRYPTO ECOSYSTEMS"],"content":["Pepe, a crypto token styled on the Pepe the Frog cartoon meme, climbed past $1 billion in market cap for the first time as traders pushed it into the top 50 most valuable coins.&nbsp;","<a href=\"https:\/\/www.coingecko.com\/en\/coins\/pepe\" data-v-f87c67ca=\"\">One pepe is currently worth<\/a> $0.00000279, according to data provider CoinGecko. The token has risen 67% over the past 24 hours and surged more than 10-fold over the past week, making pepe the 45th largest by market value.&nbsp;&nbsp;","Memecoins — which take a recognisable internet meme and add an element of financial speculation — have a long history in crypto, even if they have zero utility.&nbsp;Naive investors can be drawn into their parabolic gains, which have a habit of crashing suddenly and leaving those who bought near the top nursing huge losses.&nbsp;","Two dog-themed tokens — dogecoin and shiba inu — have become fixtures in the ranks of the most valuable crypto projects since the pandemic-fueled market action of 2020 and 2021. Tesla CEO Elon Musk has regularly <a href=\"https:\/\/twitter.com\/elonmusk\/status\/1284291528328790016\" data-v-f87c67ca=\"\">tweeted his appreciation for dogecoin<\/a>, often with his tongue at least partly in his cheek, and research&nbsp;firms such as Chainalysis have <a href=\"https:\/\/blog.chainalysis.com\/reports\/chainalysis-dogecoin-announcement\/\" data-v-f87c67ca=\"\">bowed to pressure<\/a> to cover it.&nbsp;","\"This is the purest representation of crypto’s speculative prowess,\" said Steven Zheng, research director at The Block Research.&nbsp;","The gains in pepe came as Binance, the world's biggest crypto exchange, announced it would <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-list-floki-floki-and-pepe-pepe-in-the-innovation-zone-f68a3bc6eb014ed9bacf1d6c71dc1134\" data-v-f87c67ca=\"\">list the token<\/a> for the first time. Binance clients will be able to trade pepe from Saturday.&nbsp;&nbsp;","\"Please note that the token has no utility and it is created by an anonymous team,\" Binance warned in its announcement.&nbsp;","Binance CEO Changpeng Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1654470945808023554\" data-v-f87c67ca=\"\">added<\/a> on Twitter, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Meme coins (and all crypto) are high risk! Remember, no one is forcing you to buy them. [Do your own research] and be responsible for your own actions.<\/span>\"","For now, at least, pepe appears to have taken the crown as crypto's favorite memecoin.&nbsp;Earlier this week, <a href=\"https:\/\/www.coindesk.com\/markets\/2023\/05\/03\/pepecoin-overtakes-dogecoin-shiba-inu-trading-volumes-as-early-buyers-take-profits\/\" data-v-f87c67ca=\"\">trading volume for pepe<\/a> exceeded that for both dogecoin and shiba inu.&nbsp;","In fact, those trading the token on Uniswap have <a href=\"https:\/\/twitter.com\/thiccythot_\/status\/1654343137396142080\" data-v-f87c67ca=\"\">burned<\/a> more than $10 million in Ethereum transaction fees — where a portion of the fee is destroyed instead of going to miners — over the last three weeks. This has <a href=\"https:\/\/twitter.com\/ArkhamIntel\/status\/1654439499928141825\" data-v-f87c67ca=\"\">boosted<\/a> the amount of ether getting burned on the network, which is now up to around $60 million per week.","Despite the huge paper gains, those looking to cash in by selling might struggle with a lack of liquidity. A Nansen report this week highlighted <a href=\"https:\/\/www.theblock.co\/post\/229317\/whales-take-profits-on-pepes-surge-market-cap-drops-nearly-200-million-nansen\" data-v-f87c67ca=\"\">one pepe early adopter selling<\/a> $2.2 million of the token but only receiving $650,000 in ether “due to massive slippage.”&nbsp;","Despite the skepticism, Markus Thielen, head of research at Matrixport, highlighted that renewed interest in memecoins could have wider importance for crypto markets.","\"Under the surface, we are starting to see increased activity that the more speculative parts of the crypto industry are awakening after almost a year in hibernation,\" Thielen wrote in a report.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"Matrixport","content":"LOCATION"},{"type":"$0.00000279","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Thielen","content":"PERSON"},{"type":"$2.2 million","content":"MONEY"},{"type":"Steven Zheng","content":"PERSON"},{"type":"67%","content":"PERCENT"},{"type":"Markus Thielen","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"\" Binance","content":"ORGANIZATION"},{"type":"$650,000","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"Elon Musk","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Saturday","content":"DATE"}],"hashtag":["CRYPTO MOVERS"],"authors":["Andrew Rummer","The Block"]}