{"summary":"Coinbase is looking to draw in big traders in the foreign exchange world through an expansion of its stablecoin services. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/106804\/coinbase-stablecoins-fx-traders","publishDate":"2021-06-07T17:59:26","id":13628,"type":null,"title":"Coinbase shakes up stablecoin offering to entice large FX traders","category":["EXCHANGES"],"content":["Coinbase is looking to draw in big traders in the foreign exchange world through an expansion of its stablecoin services.&nbsp;","In an announcement that went relatively unnoticed, Coinbase said it updated pricing for nine stablecoin pairs. The update allows users of its Coinbase Pro platform to trade pairs — such as DAI-USD and USDT-GBP — at no cost if they are adding liquidity and at one basis point if they are taking liquidity.","The exchange expects to add more pairs in the future. Previously traders were charged 50 basis points to make and take liquidity in stable pairs.&nbsp;","Still, the move reflects a broader strategy shift by Coinbase to capitalize on the explosion of the stablecoin market. It could also help Coinbase break into the FX market, which saw more than $6.6 trillion in <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-09-16\/global-currency-trading-surges-to-6-6-trillion-a-day-market\" data-v-f87c67ca=\"\">daily volumes<\/a> in 2019.&nbsp;","It makes sense given the state of the market. The share of traded volume denominated by stablecoin USDT, the largest in the market, hit nearly 67%, up from 6.8% in June 2017.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/share-of-trade-volume-by-pair-denomination\/embed\" title=\"Share of Trade Volume by Pair Denomination\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","In terms of stablecoins outstanding, the supply of fiat-pegged coins has surged in recent months, as per The Block's collected data. The total stablecoin supply surpassed $100 billion last month.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"This will be the biggest market,\" said Coinbase's head of exchange Vishal Gupta.&nbsp;Gupta, who cut his teeth in options market making, added that Coinbase wants to position itself as the go-to venue for stablecoin pairs, adding that ultimately, it aims to lure FX market makers to the venue.&nbsp;","\"This is a natural evolution,\" he said.&nbsp;","The ability to trade currency pairs via stablecoins speeds up the settlement for such trades. The pitch is that traders can move between stablecoins nearly instantly while it can take days for an FX trader on a traditional venue to have a currency trade settle.&nbsp;","What's more, unlocking the FX markets gives Coinbase, which sees about $200 billion in crypto trade a day, potential access to significantly more volume.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vishal Gupta","content":"PERSON"},{"type":"Gupta","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"6.8%","content":"PERCENT"},{"type":"fiat","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"$6.6 trillion","content":"MONEY"},{"type":"67%","content":"PERCENT"},{"type":"$200 billion","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"$100 billion","content":"MONEY"},{"type":"June 2017","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Frank Chaparro","The Block"]}