{"summary":"Gauntlet is introducing a platform for automated governance. The Block spoke with Tarun Chitra about the platform and what Gauntlet hopes to bring to the DeFi table.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78863\/gauntlets-tarun-chitra-wants-to-de-risk-defi-with-an-automated-governance-suite","publishDate":"2020-09-25T14:37:23","id":13624,"type":null,"title":"Gauntlet&#x27;s Tarun Chitra wants to de-risk DeFi with an automated governance platform","category":["THE BLOCK"],"content":["\"A lot of it has just been putting a finger to the wind.\"","Tarun Chitra, a former programmer at D.E. Shaw, is talking about the nature of decentralized finance (DeFi) governance. For much of the young market's history, vital protocol decisions — ranging from changes to stability rates to interest rates — have been made through Zoom calls with the loudest voices often seeing their recommended changes see the light of day. In many ways, it reflects the scrappy nature of the burgeoning market, but it is also un-scientific, says Chitra. That's the problem his company Gauntlet Network is trying to solve.&nbsp;","The firm, which launched in 2018 as a ratings agency-like company for the crypto market, has pivoted to offer a platform that makes it easier for market participants to make governance decisions in an automated fashion. The shake-up comes as decentralized entities in crypto are picking up steam.&nbsp;Non-custodial exchanges are now seeing hundred of millions of dollars in trading volumes, whilst trading of DeFi coins are making up an increasing percentage of trading volumes on centralized exchanges.","\"Shareholder advocacy is going to exist more seriously in crypto but currently it is difficult for investors to think about these projects and the things they would need to vote on, such as interest rates,\" Chitra said.&nbsp;","At a high-level, Gauntlet monitors various DeFi protocols, running various simulations of certain governance decisions such as the parameters around what would trigger a pay-out for a decentralized credit default swap to the addition of new collateral types for Maker DAI. After examining these various simulation, Gauntlet submits what conditions would translate into the best performance for a given asset to the platform — which users can then automatically submit to the protocol.&nbsp;","","","\"Compound might want to increase collateral in the event of a March 12-like event,\" Chitra said, explaining:","\"So Gauntlet would be listening to the on-chain activity and then automatically say, \"hey look BTC is very scary right now, so we are submitting code to the blockchain to make the collateral limit a lot lower and we generate a dashboard that shows the reasons why you can vote for this. They are still choosing but we are monitoring and generating proposals.\"","\"We are trying to automate as much as possible, taking these best in class financial models and measuring risk in all these protocols and acting as an alert system for investors,\" he added.","&nbsp;In a sense, it is also helping introduce less risk to the system. Indeed, Chitra says the platform takes a leaf from the page of hedge fund risk systems.&nbsp;\"On Wall Street, you have a risk desk at a hedge fund they are running similar simulations and if certain conditions are met the systems will shut down a trading strategy,\" Chitra said.","\"Automated Governance acts as an immune system for a DeFi contract, providing the community with an off-chain risk monitoring system,\" a blog post by Gauntlet reads. \"Investors can rest assured, knowing that their assets are monitored for safety even in the rockiest conditions, much like a hedge fund’s risk management system or <a href=\"https:\/\/www.appdynamics.com\/blog\/product\/application-performance-monitoring\/\" data-v-f87c67ca=\"\">application performance monitoring<\/a>.\"","Underpinning Gauntlet's monitoring system are new models purposely built for DeFi. In a way, Chitra said the firm had to go to the drawing board, devising new types of financial models that look different from Wall Street's due to the unique nature of these markets.","\"In crypto, it is a lot more crazy because there are unique dynamics between participants. It is possible for a third party to see you trade and pull liquidity,\" he said, adding:","\"It feels like the 1980s when the unique dynamics in options and derivatives gave birth to models like Black-Scholes.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Chitra","content":"PERSON"},{"type":"Scholes","content":"PERSON"},{"type":"Maker DAI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"D.E. Shaw","content":"ORGANIZATION"},{"type":"Gauntlet Network","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"1980s","content":"DATE"},{"type":"Tarun Chitra","content":"PERSON"},{"type":"March 12","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}