{"summary":"The crypto sector saw a fair share of staff reductions in recent months; however, staking firms are showing signs of growth.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192765\/6-crypto-staking-firms-detail-how-theyre-faring-in-the-current-market","publishDate":"2022-12-13T09:02:05","id":13626,"type":null,"title":"Six crypto staking firms detail how they&#x27;re faring in the current market","category":["CRYPTO INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Layoffs at crypto firms have grabbed the headlines in the aftermath of FTX’s collapse, but it’s not all grim news in the sector. None of the staking firms the The Block spoke to reported dismissals, and a few are actively hiring.<\/span>","<span data-v-f87c67ca=\"\">The Ethereum network has yet to introduce a means for the withdrawal of staked ETH, so those who do stake are in relatively long positions. Staking providers still see hundreds of millions of dollars in assets locked or under management. With an operational runway otherwise secured by funding for most organizations, most staking providers appear to be focused on growth and increasing revenue streams&nbsp; — without staff cuts.<\/span>","Here's a look at six staking firms and how they're faring in the current market.","<span data-v-f87c67ca=\"\">Everstake, a decentralized staking provider, is no stranger to crypto winters, having been founded in the last downturn. The self-funded — and profitable — business said it took “top-notch” risk management “to overcome the hurdles associated with recession,” head of growth Vlad Likhuta told The Block.<\/span>","<span data-v-f87c67ca=\"\">“The company never ceased to be profitable, even now, even after the fall of Terra, and other major shocks that stressed the market this year,” he said, adding that Everstake validates more than 70 blockchains.<\/span>","<span data-v-f87c67ca=\"\">“The obvious upside to that is the fact that the large number of blockchain networks we support allows us to wait when some of them face a hard time,” Likhuta said. “So, we keep evolving no matter what.”<\/span>","<span data-v-f87c67ca=\"\">Everstake neither owns nor manages its delegator’s assets; however, Likhuta said “more than 625,000 users delegated over $1 billion worth of different tokens to us.”<\/span>","<span data-v-f87c67ca=\"\">To grow revenue, in addition to keeping developers focused on uptime, Everstake is exploring new wallet partnerships, joining new protocols and cultivating communities across the blockchains it supports, he said.<\/span>","<span data-v-f87c67ca=\"\">Non-custodial staking provider Luganodes is still in a growth phase and is hiring despite industry-wide restructuring, CEO Anuj Shankar told The Block via email. The company has more than a year of runway and $500 million in staked assets under its management, and it is building out channels to grow.<\/span>","<span data-v-f87c67ca=\"\">Otherwise, Luganodes is seeking to increase revenue by gauging which liquid staking protocols it should engage with — if any — and building its staking platform to offer institutional and retail customers portfolio transparency, he said.<\/span>","<span data-v-f87c67ca=\"\">With enough demonstrated customer demand, Luganodes will also explore building a Staking API Platform.<\/span>","<span data-v-f87c67ca=\"\">Staking service provider InfStones is operating above break-even and doesn’t need external capital, the platform’s head of global marketing Al Leong told The Block.<\/span>","<span data-v-f87c67ca=\"\">The team is expanding with a continued focus on developers and sales, Leon said, but it is also “consistently trying to minimize expenses.”<\/span>","<span data-v-f87c67ca=\"\">To increase profit margins, the company is “continuously integrating more blockchain protocols on our platform so that we can serve more customers in different ecosystems,” Leon said.<\/span>","<span data-v-f87c67ca=\"\">Staking company Figment raised $110 million in a Series C round, led by Thoma Bravo in late 2021, said its director of protocol strategy Clayton Menzel, adding that the company continues to be well funded.<\/span>","<span data-v-f87c67ca=\"\">However, in an effort to “deliver the best-in-class staking product to institutions,” Figment “made the decision to pause serving application developers with full nodes and staking and developer APIs,” he said. The service remains available to staking customers.<\/span>","<span data-v-f87c67ca=\"\">Figment is looking to liquid staking and rewards optimization through MEV solutions to boost revenue, Menzel added.<\/span>","<span data-v-f87c67ca=\"\">If it charged money on Ethereum, StakeWise would be profitable, said co-founder Kirill Kutakov, who estimates that company currently has more than two years of runway.<\/span>","<span data-v-f87c67ca=\"\">Although there are no staff cuts, the company is extending “more oversight over expenditure,” Kukatov said.<\/span>","<span data-v-f87c67ca=\"\">The total value locked on StakeWise stands at 82,000 ETH ($104 million) with another 64,000 ETH ($81 million) locked on the company’s StakeWise Labs arm, he said.<\/span>","<span data-v-f87c67ca=\"\">Chorus One is operating below break even, said CCO Felix Lutsch in an interview with The Block. With nearly $800 million assets under management, the company is “down bad,” according to Lutsch — referencing a common crypto saying. He added “the interest in staking has gone down a little bit.”<\/span>","Despite that, Chorus One is looking to hire a remote&nbsp;full stack urbit engineer and platforms engineer, the company site shows.&nbsp;<span data-v-f87c67ca=\"\">The company still has runway thanks to what Lutsch said are “decent revenues” and investing efforts.<\/span>&nbsp;&nbsp;","<span data-v-f87c67ca=\"\">Chorus One's focus remains directed at maximal extracted value (MEV), a method of ordering or excluding transactions from blocks to ensure the highest validation rewards. MEV is both a differentiator for validators and a core issue for networks that protocol developers must adjust for to avoid exploitation, an effort Lutsch said Chorus One supports.<\/span>","<span data-v-f87c67ca=\"\">In a growing market where risk profiles vary, and participants may hedge against downturns, “we're also trying to figure out how we can help our clients in that world,” said Lutsch.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Kukatov","content":"PERSON"},{"type":"Likhuta","content":"PERSON"},{"type":"Al Leong","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Everstake","content":"ORGANIZATION"},{"type":"Vlad Likhuta","content":"PERSON"},{"type":"StakeWise Labs","content":"ORGANIZATION"},{"type":"$110 million","content":"MONEY"},{"type":"Clayton Menzel","content":"PERSON"},{"type":"Luganodes","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Anuj Shankar","content":"PERSON"},{"type":"Lutsch","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$104 million","content":"MONEY"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Thoma Bravo","content":"PERSON"},{"type":"Menzel","content":"PERSON"},{"type":"Kirill Kutakov","content":"PERSON"},{"type":"Leon","content":"PERSON"},{"type":"$800 million","content":"MONEY"},{"type":"$81 million","content":"MONEY"},{"type":"Felix Lutsch","content":"PERSON"}],"hashtag":["STAKING FIRMS"],"authors":["Jeremy Nation","The Block"]}