{"summary":"Sources say that Meyer had taken over the post from Cooper months before it appeared on his LinkedIn. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145443\/revoluts-new-crypto-head-departs-as-it-gears-up-for-digital-assets-push","publishDate":"2022-05-06T08:14:12","id":13629,"type":null,"title":"Revolut&#x27;s new crypto head departs as it gears up for digital assets push %","category":["HIRING"],"content":["Revolut's head of crypto has left the company for an as-yet unannounced destination.&nbsp;","Jean Meyer joined the neobank last September as part of Revolut's first acquisition of start-up Wanted, a recruitment marketplace. He progressed from head of product to head of crypto in January, according to his LinkedIn page. Meyer replaced the incumbent head of crypto, Ed Cooper.&nbsp;","Sources familiar with the matter said Meyer had taken over the post from Cooper months before it appeared on LinkedIn.&nbsp;","While Meyer did not respond to The Block's request for comment, his headline on LinkedIn now reads \"working on something new…\" The Block had not heard back from Meyer by the time of publication.","Cooper is still at Revolut but understood to be in a different role. The Block also sought comment from Cooper.&nbsp;","&nbsp;A well-placed source said the head-of-crypto role is being covered internally and will be filled more permanently in due course.&nbsp;","The setback comes amid ambitious plans by Revolut to command various aspects of consumer crypto markets.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/news+\/103895\/revolut-crypto-withdrawals-stablecoins-interest\" data-v-f87c67ca=\"\">This time last year,<\/a> Revolut became one of the first \"non-crypto\" firms to give its users greater freedom to move cryptocurrency around, adding a function that meant its users could withdraw bitcoin to personal wallets.&nbsp;","It is also rumored to be launching its own token, called \"Revcoin.\"","The bank's crypto arm has encountered some <a href=\"https:\/\/www.theblockcrypto.com\/post\/137484\/crypto-firms-uk-close-fca-register\" data-v-f87c67ca=\"\">regulatory hurdles<\/a> in the UK in recent months as it struggled to obtain an anti-money laundering license from the Financial Conduct Authority (FCA).&nbsp;&nbsp;","It is still on the regulator's so-called temporary register, alongside crypto custodian Copper and three other firms. The register is a stopgap measure the FCA created after missing an earlier deadline to green-light companies' operations. Their fate remains uncertain, but without full registration they could in theory be forced to stop crypto-related activities in the UK.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Meyer","content":"PERSON"},{"type":"UK","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Cooper","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Ed Cooper","content":"PERSON"},{"type":"Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"Jean Meyer","content":"PERSON"},{"type":"last September","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}