{"summary":"FTX bankruptcy proceedings in the U.S. and the liquidation of its subsidiary in the Bahamas will be synchronized.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/268375\/ftx-debtors-settle-with-bahamian-subsidiary-agree-to-synchronize-bankruptcy-proceedings-across-jurisdictions","publishDate":"2023-12-19T10:01:27","id":13620,"type":null,"title":"FTX debtors settle with Bahamian subsidiary, agree to synchronize bankruptcy proceedings across jurisdictions","category":["COMPANIES"],"content":["Affiliated debtors of FTX, the crypto exchange that filed for bankruptcy protection in the U.S. last November,<a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-debtors-and-ftx-digital-markets-bahamas-announce-global-settlement-302019045.html#:~:text=FTX.com)%20and%20its%20affiliated,of%20FTX%20Digital%20Markets%20Ltd\" data-v-f87c67ca=\"\"> said Tuesday<\/a> that they reached a global settlement with the Bahamian subsidiary FTX Digital Markets that was subject to a separate liquidation process.&nbsp;","The agreement is a \"a novel and mutually-beneficial solution to the complex cross-border legal issues raised by the circumstances of the collapse of the FTX group,\" the debtors said in a <a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-debtors-and-ftx-digital-markets-bahamas-announce-global-settlement-302019045.html#:~:text=FTX.com)%20and%20its%20affiliated,of%20FTX%20Digital%20Markets%20Ltd\" data-v-f87c67ca=\"\">statement.<\/a> It's subject to the approval of the U.S. Bankruptcy Court for the District of Delaware and the Supreme Court of the Bahamas Court.&nbsp;","FTX debtors and FTX Digital Markets will \"pool assets and coordinate the establishment of reserves and the timing and amount of distributions\" for the purposes of making distributions to FTX.com customers, who will have to pick which entity they file their claim against.&nbsp;","The Bahamian subsidiary will also adopt the same know-your-customer procedures to \"ensure compliance with applicable law in&nbsp;<span class=\"xn-location\" data-v-f87c67ca=\"\">the United States<\/span>, The&nbsp;<span class=\"xn-location\" data-v-f87c67ca=\"\">Bahamas<\/span> and all other applicable jurisdictions.\"","FTX Digital Markets will take a lead in liquidating FTX's real estate in the country.","\"The Global Settlement Agreement is another critical milestone for the FTX Debtors,\" said John. J. Ray III, CEO and chief restructuring officer of FTX. \"The unique challenges raised by the conflicting filings of the FTX Debtors and FTX Digital Markets have been some of the toughest the team has faced.\"","FTT interests against the FTX debtors and FTX Digital Markets will be treated as equity and not receive any recovery, according to the statement.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"The&nbsp;<span class=\"xn-location\" data-v-f87c67ca=\"\">Bahamas","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"J. Ray III","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"John","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"the Supreme Court of the Bahamas Court","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"FTX Debtors","content":"ORGANIZATION"},{"type":"last November","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"the District of Delaware","content":"ORGANIZATION"},{"type":"FTX Digital Markets","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Anna Baydakova","The Block"]}