{"summary":"The company accused Core Scientific of breaching their agreement by failing to deploy mining machines on time and unjustly trying to pass on power charges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174044\/celsius-mining-claims-hosting-provider-core-scientific-violated-bankruptcy-terms","publishDate":"2022-09-30T14:15:51","id":13637,"type":null,"title":"Celsius Mining claims hosting provider Core Scientific violated bankruptcy terms","category":["MINING"],"content":["Celsius Mining, the mining arm of the bankrupt crypto lender, filed a motion Wednesday against its hosting provider Core Scientific, accusing the company of breaching their agreement and violating bankruptcy rules.","Celsius owes Core Scientific approximately $5.4 million, the company claimed in <a href=\"https:\/\/cases.stretto.com\/public\/x191\/11749\/PLEADINGS\/1174909292280000000013.pdf\" data-v-f87c67ca=\"\">documents<\/a> filed with the U.S. Bankruptcy Court for the Southern District of New York. The company asks that Core Scientific be held in civil contempt for having violated the automatic stay in relation to Celsius' bankruptcy filing. Celsius <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">filed<\/a> for Chapter 11 bankruptcy protection in July.&nbsp;","Celsius claimed that Core Scientific has failed to deploy mining machines on time and has illegitimately tried to pass on power charges that their agreement prevented against, as well as banned Celsius from sending them any more machines.","\"Thus, rigs that Celsius has been planning to deploy (...) are now sitting in limbo with no place to go, instead of earning revenue for the estate,\" it stated in the document.&nbsp;","Core Scientific threatened to terminate the hosting agreement between the two companies until Celsius paid its pre-petition obligations, the filing said.","Core Scientific has deployed only 6,564 of the 10,885 rigs that Celsius delivered, providing the company with 21.5 megawatts of power when their agreement stated Celsius was entitled to 79.4 megawatts by September, Celsius claimed.","Additionally, Core Scientific billed Celsius for over $3.65 million in \"power cost pass-through\" charges due to \"tariffs\" following the bankruptcy filing in July, the document said.","The agreement between the company has a fixed price and only allows Core Scientific to pass through costs as a result of \"new taxes, levies, tariffs or governmental fees and charges with respect to the provision of services,\" the document states.","When Celsius asked for evidence of the \"tariff increases,\" Core Scientific sent \"information showing increased power rates in the various jurisdictions where Celsius rigs are located,\" the company said.","\"Core Scientific’s improper attempt to 'pass through' to Celsius increased power costs violates the automatic stay,\" the company said.","The motion asks that Core Scientific be directed to perform under the agreement and \"immediately return any improperly invoiced amounts.\"","Core Scientific did not immediately responded to The Block's request for comment.","Rising power costs have thinned margins for bitcoin miners and been a source of tension between other companies — for instance, <a href=\"https:\/\/www.theblock.co\/post\/154356\/bitcoin-mining-firms-compass-and-dynamics-spar-over-payments-and-hostage-hardware\" data-v-f87c67ca=\"\">Compass and one of its hosting providers Dynamics Mining<\/a>.","Prior to the bankruptcy, Celsius had announced in May <a href=\"https:\/\/www.theblock.co\/post\/147079\/celsius-announces-plans-for-an-ipo-of-its-bitcoin-mining-subsidiary\" data-v-f87c67ca=\"\">plans to take Celsius Mining public<\/a>. The lender got involved with bitcoin mining starting in 2020, having <a href=\"https:\/\/www.theblock.co\/post\/124968\/celsius-500-million-bitcoin-mining\" data-v-f87c67ca=\"\">extended loans to miners<\/a> such as Argo Blockchain and Core Scientific itself. It also invested in Core Scientific's equity, as well as miner Rhodium Enterprises and mining pool Luxor Technologies.","Celsius Mining <a href=\"https:\/\/www.theblock.co\/post\/157647\/celsius-bankruptcy-documents-claim-1-2-billion-balance-sheet-gap\" data-v-f87c67ca=\"\">owned $720 million in “mining assets”<\/a> at the time of the bankruptcy filing, documents show. The company took out up to $750 million in inter-company credit from Celsius and had an outstanding balance of $576 million in July.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"miner Rhodium Enterprises","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$5.4 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"$576 million","content":"MONEY"},{"type":"Luxor Technologies","content":"ORGANIZATION"},{"type":"$750 million","content":"MONEY"},{"type":"$720 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Compass","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$3.65 million","content":"MONEY"},{"type":"Argo Blockchain","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Dynamics Mining","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}