{"summary":"The government of the Mendonza province, in Argentina, started accepting crypto as a means of payment for taxes and fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166324\/argentinas-wine-making-haven-now-accepts-crypto-as-tax-payment","publishDate":"2022-08-29T15:55:53","id":13635,"type":null,"title":"Argentina&#x27;s wine-making haven now accepts crypto as tax payment","category":["PAYMENTS AND BANKING"],"content":["Residents of Argentina's wine-making mecca Mendoza can now pay taxes and fees using cryptocurrency.","The government of the province of Mendoza — which includes the desert city of the same name and is located in the west of the country along the Andes mountain range — rolled out the new feature last week.","Taxpayers can get a QR code and send the funds from their wallets. According to this nifty <a href=\"https:\/\/www.mendoza.gov.ar\/wp-content\/uploads\/sites\/5\/2022\/08\/Tutorial-ATM-Criptomonedas.pdf\" data-v-f87c67ca=\"\">step-by-step guide<\/a>, any crypto wallet is supported.","It's not the first government to accept taxes in crypto. In March of this year, Florida Governor Ron DeSantis announced he is <a href=\"https:\/\/www.theblock.co\/linked\/138874\/florida-governor-says-the-state-will-accept-bitcoin-for-tax-payments\" data-v-f87c67ca=\"\">taking steps to enable firms to pay taxes in cryptocurrencies. <\/a>The canton of Zug, one of the Swiss Confederation member states, <a href=\"https:\/\/www.theblock.co\/linked\/95270\/swiss-canton-zug-now-accepts-bitcoin-ether-tax-payments\" data-v-f87c67ca=\"\">started accepting bitcoin and ether<\/a> last year.","\"This new service is part of the modernization and innovation strategic goal carried out by Mendoza's tax authority so that taxpayers have different means to comply with their tax obligations,\" the tax authority said.","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ron DeSantis","content":"PERSON"},{"type":"Argentina","content":"LOCATION"},{"type":"Andes","content":"LOCATION"},{"type":"Florida","content":"LOCATION"},{"type":"Mendoza","content":"PERSON"},{"type":"Zug","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"March of this year","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}