{"summary":"J. Christopher Giancarlo pitched his Digital Dollar project again today at CoinDesk’s Consensus conference\nIn important ways, the token-based proposal is distinct from the “digital dollar” that House Democrats floated in March\nThe group is still trying to figure out the best privacy-related technical design choices ","author":["Mike Orcutt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/64735\/former-cftc-chair-tokenized-dollar-relief","publishDate":"2020-05-11T12:06:41","id":1363,"type":null,"title":"Former CFTC chair says a tokenized dollar could be a better way to hand out relief money","category":["The Block"],"content":["<span data-v-f87c67ca=\"\">A tokenized U.S. dollar would make it easier for the government to put money into the hands of people who need it during crises like the COVID-19 pandemic, according to a high-profile lobbying group that's trying to make a digitized USD a reality.<\/span>","<span data-v-f87c67ca=\"\">The <\/span><a href=\"https:\/\/www.digitaldollarproject.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Digital Dollar Project<\/span><\/a><span data-v-f87c67ca=\"\"> is headed by J. Christopher Giancarlo – former chair of the U.S. Commodity Futures Trading Commission (CFTC), Daniel Gorfine – who served with Giancarlo as the CFTC's first Chief Innovation Officer – and David Treat, global blockchain lead for Accenture. Giancarlo<\/span> <a href=\"https:\/\/www.theblockcrypto.com\/post\/53714\/former-cftc-chair-releases-first-formal-remarks-about-his-digital-dollar-project-at-davos\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">first revealed details<\/span><\/a><span data-v-f87c67ca=\"\"> about the project this January during the World Economic Forum in Davos. On Monday, the trio pitched the project once more via live stream during the CoinDesk's Consensus conference.<\/span>","<span data-v-f87c67ca=\"\">Giancarlo said that his time as CFTC chair convinced him that much of America's financial market infrastructure is outdated. That has global implications, particularly in light of <a href=\"https:\/\/www.theblockcrypto.com\/daily\/63120\/preview\" data-v-f87c67ca=\"\">China's plans to issue a central bank digital currency<\/a> (CBDC). It also raises issues domestically, as the COVID-19 pandemic has exposed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Money is a public good,\" he said, adding that, with a digital dollar at its disposal, the government could distribute stimulus money more accurately, a reference to <\/span><a href=\"https:\/\/www.usatoday.com\/story\/money\/2020\/04\/15\/stimulus-checks-going-wrong-bank-account-many-yes\/5140966002\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reports that many relief checks went to the wrong recipients<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Giancarlo isn't alone in his view that a digital dollar would be helpful to have during a crisis. In March, before the stimulus bill passed, Democrats in the House of Representatives floated their own digital dollar system for distributing money to millions of cash-strapped Americans.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But that proposal, which <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/59692\/digital-dollar-proposal-stripped-from-latest-house-democrat-coronavirus-stimulus-bill\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">did not make it into the final bill<\/span><\/a>,<span data-v-f87c67ca=\"\">&nbsp;described a much different kind of digital dollar than Giancarlo, Gorfine, and Treat are after.<\/span>","<span data-v-f87c67ca=\"\">What the draft House bill had proposed was an \"account-based\" digital dollar through which the Federal Reserve would start letting retail customers open accounts, in addition to the commercial banks it already serves. The Digital Dollar Project, on the other hand, is advocating for a \"token-based\" system. That is, they would be more like physical cash than the digits in your bank account. \"First and foremost this is taking advantage of the notion of tokenization,\" said Treat.<\/span>","<span data-v-f87c67ca=\"\">The debate over whether CBDCs should be account-based or token-based will be one to watch as a discussion of whether to digitize the U.S. currency heats up in the coming months and years. Advocates of preserving the privacy of cash are likely to favor the token-based model.<\/span>","<span data-v-f87c67ca=\"\">As for the practical design considerations related to privacy, those are yet to be ironed out, said Gorfine: <\/span>"],"hashtag":[]}