{"summary":"The FTX founder&#x27;s lawyers submitted a letter to a U.S. court on Tuesday, calling DOJ&#x27;s proposed sentencing unjust.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283548\/sam-bankman-frieds-50-year-imprisonment-not-justice","publishDate":"2024-03-19T22:58:51","id":13638,"type":null,"title":"Sam Bankman-Fried’s lawyers say 50-year imprisonment proposal is ‘not justice’","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">FTX founder Sam Bankman-Fried’s lawyers submitted a letter to District Judge Lewis Kaplan on Tuesday, challenging the sentencing proposal from the Department of Justice last week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“With marked hostility, the memorandum distorts reality to support its precious ‘loss’ narrative and casts Sam as a depraved super-villain; it attributes to him dark and megalomaniacal motives that fly in the face of the record; it makes apocalyptic prophecies of recidivism; and it adopts a medieval view of punishment to reach what amounts to a death-in-prison sentencing recommendation,” the <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/66631291\/413\/united-states-v-bankman-fried\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a><span data-v-f87c67ca=\"\"> said.&nbsp;&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a memorandum filed last Friday, U.S. prosecutors <\/span><a href=\"https:\/\/www.theblock.co\/post\/282916\/prosecutors-lock-up-sbf-for-up-to-50-years\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">asked the court<\/span><\/a><span data-v-f87c67ca=\"\"> to give the former FTX CEO a prison sentence of 40 to 50 years. “That is not justice,” Bankman-Fried’s defense team said in the latest filing.<\/span>","<span data-v-f87c67ca=\"\">The filing argued that Bankman-Fried shows no sign of recidivism, noting that the college-educated former crypto mogul has no criminal past. It also claimed FTX’s bankruptcy proceedings would restore any assets lost in the collapse of the crypto exchange, which, it said, is something that the government downplays to vilify Bankman-Fried.<\/span>","<span data-v-f87c67ca=\"\">The court’s sentencing on Sam Bankman-Fried’s charges is expected to take place on March 28. Bankman-Fried’s legal counsel <\/span><a href=\"https:\/\/www.theblock.co\/post\/279487\/sbf-lawyers-prison-sentence\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">had previously asked<\/span><\/a><span data-v-f87c67ca=\"\"> the court for a “just sentence” of 63 to 78 months.<\/span>","<span data-v-f87c67ca=\"\">“We have yet to identify a federal defendant convicted of a non-violent offense who served a 40-50 year sentence and was released — perhaps because inmates suffer a two-year decline in life expectancy for each year of imprisonment,” the Tuesday filing said. “Crushing Sam in this way is unnecessary.”<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried was found guilty last year of defrauding investors of FTX and Alameda Research in what prosecutors called \"one of the biggest financial frauds in U.S. history.\"<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crushing Sam","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"March 28","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"last Friday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"50 year","content":"DATE"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Danny Park","The Block"]}