{"summary":"Coinbase is taking action to retrieve funds from Georgian crypto traders who took advantage of an &#x27;excellent arbitrage opportunity.&#x27;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167367\/coinbase-works-to-retrieve-funds-from-georgian-traders-who-profited-from-decimal-point-error","publishDate":"2022-09-02T09:14:57","id":13632,"type":null,"title":"Coinbase works to retrieve funds from Georgian traders who profited from decimal point error","category":["EXCHANGES"],"content":["Coinbase is taking action to retrieve funds from Georgian crypto traders who took advantage of a decimal point error in the foreign exchange rate for crypto pairs using Georgian Lari (GEL) to withdraw more funds than they held.","The mistake was discovered on Aug. 31 and has been attributed to an unnamed third-party provider. For a short time, it meant that accounts using GEL showed up on Coinbase as holding a hundred times their value.","Coinbase told The Block the issue was fixed upon detection.","But not soon enough for an estimated 900 users to make off with funds, which one Georgia-based crypto trader described to The Block as an “excellent arbitrage opportunity.”","Traders have since reported via groups on Telegram and Facebook that their bank accounts — mostly from the country’s two main banks, Bank of Georgia and TBC Bank — have been frozen and blocks put on their cards.","Crypto trading is common in Georgia, and indeed in many of the neighboring countries in the Caucasus. Crypto ATMs are a common sight in shopping malls in the capital of Tbilisi, which is also home to a growing community of foreign crypto traders attracted by the country’s favorable visa policies for digital nomads.","In a country of less than 4 million people, the World Bank also <a href=\"https:\/\/www.worldbank.org\/en\/news\/press-release\/2018\/05\/08\/in-georgia-blockchain-technologies-provide-significant-opportunity-to-innovate-improve-services-for-citizens\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">estimated<\/a> that in 2018 around 5% of the population were involved in cryptocurrency mining or investments. Earlier this year former miners in one region were made to swear a holy oath to St George that they would stop mining because of the strain it was putting on the national grid.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Caucasus","content":"LOCATION"},{"type":"Tbilisi","content":"LOCATION"},{"type":"the World Bank","content":"ORGANIZATION"},{"type":"Georgia","content":"LOCATION"},{"type":"Bank of Georgia","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"TBC Bank","content":"ORGANIZATION"},{"type":"St George","content":"ORGANIZATION"},{"type":"Aug. 31","content":"DATE"}],"hashtag":["COINBASE"],"authors":["Callan Quinn","The Block"]}