{"summary":"Find Satoshi Lab has been working for months to promote its latest project, a web3 video game called Gas Hero.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274294\/gas-hero-has-generated-about-90-million-in-nft-trading-this-month","publishDate":"2024-01-24T12:01:36","id":13642,"type":null,"title":"Gas Hero has generated about $90 million in NFT trading this month","category":["GAMING"],"content":["Web3 developer Find Satoshi Lab's latest project launch, a video game called Gas Hero, has generated about $90 million in NFT trading since it launched earlier this month, the company said in a statement.","\"T<span data-v-f87c67ca=\"\">here are currently six different Gas Hero NFT collections available, all of which are now claiming top spots on trading volume charts,\" the company said. \"Users of the game are actively trading various characters, weapons, and other Gas Hero items as NFTs on Polygon PoS.\"<\/span>","Gas Hero's top performing NFT collection, Gas Hero Common Heroes, ranks as the fifth most-traded collection during the past 24 hours, according to <a href=\"https:\/\/www.cryptoslam.io\/\" data-v-f87c67ca=\"\">CryptoSlam! data<\/a>.","Find Satoshi Lab is perhaps best known for creating the blockchain-enabled fitness app Stepn that <span data-v-03de5780=\"\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblock.co\/post\/172123\/users-logged-over-67-million-miles-on-the-move-to-earn-app-stepn-since-launch\" data-v-f87c67ca=\"\">has been downloaded<\/a><\/span><span data-v-03de5780=\"\" data-v-f87c67ca=\"\">&nbsp;millions of times. Stepn is a move-to-earn app which <\/span><span data-v-03de5780=\"\" data-v-f87c67ca=\"\">offers consumers the opportunity to purchase digital sneaker NFTs they can then use to earn token rewards by “walking, jogging or running.”&nbsp;<\/span>","In an effort to generate interest in its latest project, Find Satoshi Lab <a href=\"https:\/\/www.theblock.co\/post\/238663\/stepn-creator-giving-away-over-400000-in-crypto-to-drive-interest-in-new-video-game\" data-v-f87c67ca=\"\">announced<\/a> last July that would award more than 2 million GMT tokens (at the time about $400,000) in an attempt to promote Gas Hero. The company said on Wednesday that there is currently another <span data-v-f87c67ca=\"\">14 million GMT \"up for grabs\" which will be awarded to players who participate in \"<\/span><span data-v-f87c67ca=\"\">Gas Hero’s Gas Wars PvP battles.\"<\/span>","Polygon Labs appears pleased with the results so far. \"The popularity of Gas Hero is indicative of the present appetite for web3 gaming,\" Polygon Labs co-founder Sandeep Nailwal said in a statement. \"The game’s wide appeal, as illustrated by such early success, is a positive sign of the trajectory our ecosystem is heading in, as we witness a new type of gamer enter into the Web3 sphere.\"","Find Satoshi Labs said Gas Hero currently has over 10,000 active users. Prospective players don't need to download the game and can play on both mobile devices and computers, the company also said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"earlier this month","content":"DATE"},{"type":"$400,000","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Sandeep Nailwal","content":"PERSON"},{"type":"Satoshi Lab","content":"PERSON"},{"type":"$90 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Gas Wars PvP","content":"ORGANIZATION"},{"type":"Satoshi Labs","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"}],"hashtag":["MOVE2EARN"],"authors":["RT Watson","The Block"]}