{"summary":"dForce – the decentralized finance (DeFi) startup that recently lost nearly $25 million in an attack – said Monday that it is moving to return stolen assets to all users after the funds were returned.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/63141\/defi-dforce-attack-24-million-funds-return","publishDate":"2020-04-27T14:30:30","id":13643,"type":null,"title":"Decentralized finance startup dForce to return funds to users after $24.9M attack","category":["STARTUPS"],"content":["<span data-v-f87c67ca=\"\">dForce – the decentralized finance (DeFi) startup that recently lost nearly $25 million in an attack – said Monday that it is moving to compensate all users for their stolen assets after the funds were returned, according to a company announcement.<\/span>","<span data-v-f87c67ca=\"\">On April 19, an outside party&nbsp;<\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/62346\/multicoin-capital-backed-defi-protocol-dforce-loses-25m-total-locked-value-in-an-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">attacked<\/span><\/a><span data-v-f87c67ca=\"\">&nbsp;lendf.me, dForce's lending protocol, siphoning away all $24.9 million of the contract's total locked value. Four days later, in a surprising twist, the attacker <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/62530\/dforce-attacker-returns-all-25m-stolen-funds-back-to-the-defi-project\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">returned<\/span><\/a> <span data-v-f87c67ca=\"\">all assets back to the project.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On Monday, the company said in a <\/span><a href=\"https:\/\/twitter.com\/dForcenet\/status\/1254738662039752704?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweet<\/span><\/a> <span data-v-f87c67ca=\"\">that&nbsp;\"[o]ver 90% of assets have been distributed to users in less than 24 hours. 100% users have been made whole in the recovery. We will disclose more future actions shortly.\"<\/span>","<span data-v-f87c67ca=\"\">\"Given that hacker was only able to exchange a few assets before returning the funds, we have elected to rebalance most of the portfolio back to the last state prior to the contract being attacked and the pausing of the contract,\" explained a <a href=\"https:\/\/medium.com\/dforcenet\/lendf-me-hack-resolution-part-i-asset-redistribution-plan-9cefee49f209\" data-v-f87c67ca=\"\">company blog post<\/a>. \"<\/span><span data-v-f87c67ca=\"\">The funds are secure, and we're eager to return them.\"<\/span>","<span data-v-f87c67ca=\"\">The blog post also outlined procedures for asset withdrawal and loan repayment. <\/span>","<span data-v-f87c67ca=\"\">Users with outstanding balances on their accounts can request fund withdrawals, which will be processed on a case-to-case basis. For those who do not make a request, their assets will be returned automatically within a week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If users have taken out loans from the protocol, they need to repay them in a week in order to get their collateral back. If they fail to do so, dForce will sell their collateral to cover the outstanding loans while the remaining assets will be returned to users' addresses in the form of stablecoins.<\/span>","<span data-v-f87c67ca=\"\">Notably, there have been several phishing attempts targeting dForce users, the blog post claimed. The company reminded users to only make transactions through the company's official website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"While we are very much eager to inform the community of the action items we will be taking to ensure asset security and system robustness going forward, we do believe that returning the stolen funds to the users is the absolute priority at this moment,\" said the blog post.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 19","content":"DATE"},{"type":"90%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"$24.9 million","content":"MONEY"}],"hashtag":[],"authors":["Yilun Cheng","The Block"]}