{"summary":"Dawn Fitzpatrick is optimistic that crypto isn&#x27;t going anywhere but thinks the native platforms could cede ground to traditional financial institutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233561\/soros-fund-management-ceo-crypto","publishDate":"2023-06-07T12:49:56","id":13641,"type":null,"title":"Soros Fund Management CEO says crypto is ripe for TradFi takeover","category":["PEOPLE"],"content":["<span data-v-f87c67ca=\"\">Soros Fund Management CEO Dawn Fitzpatrick is bullish on crypto, even with the recent headwinds including the U.S. Securities and Exchange Commission suing trading platforms Binance and Coinbase amid a prolonged downturn.<\/span>","<span data-v-f87c67ca=\"\">“Crypto is here to stay,” she said during a <a href=\"https:\/\/www.youtube.com\/watch?v=WqCDuyshK4o\" data-v-f87c67ca=\"\">Bloomberg investment summit<\/a>. “What’s happened is clearly a setback. But right now I actually think it’s a huge opportunity for the incumbent financial firms to actually take the lead.”<\/span>","<span data-v-f87c67ca=\"\">Fitzpatrick said she expects established financial firms take over as investor confidence in some platforms wanes. She also alluded to the fact that average consumers and traders would likely benefit from such a shift as traditional institutions “segregate client assets” properly.<\/span>","<span data-v-f87c67ca=\"\">The CEO admitted there is some irony to the idea of traditional financial firms taking the lead in a market meant to be defined by disruption, decentralization and the emergence of new institutions. But Fitzpatrick said that crypto development, to this point, has been partly mismanaged.<\/span>","<span data-v-f87c67ca=\"\">“Especially the headlines of the last couple days, it’s clear these crypto native platforms would have benefitted from having an adult in the room,” Fitzpatrick said. “There are just long-held and simple norms about how you treat customer assets.”<\/span>","<span data-v-f87c67ca=\"\">The <a href=\"https:\/\/www.theblock.co\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\">SEC alleges<\/a> that Binance lied to customers and misdirected capital to separate investment funds owned by its CEO, while the agency is suing Coinbase on accusations of violating securities laws.<\/span>","<span data-v-f87c67ca=\"\">Fitzpatrick's Soros Fund Management is an investment firm that handles a “pool of capital” that is largely owned by billionaire George Soros and valued at nearly $30 billion, the CEO said on Wednesday.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dawn Fitzpatrick","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Soros Fund Management","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Fitzpatrick","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"George Soros","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":[],"authors":["RT Watson","The Block"]}