{"summary":"Texas&#x27; deregulated energy market emerged as an attractive Bitcoin mining hub following China’s crackdown on the industry in 2021.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273159\/bitcoin-mining-hashrate-falls-texas-curtailment","publishDate":"2024-01-17T11:30:00","id":13648,"type":null,"title":"Bitcoin mining hashrate falls by an estimated 25% amid Texas curtailment","category":["COMPANIES"],"content":["Bitcoin's network hashrate declined by approximately 25% over the past few days amid curtailment requests from the Texas grid regulator following a recent cold snap, with the U.S. state now established as a global hub for the industry.","Data from <a href=\"https:\/\/miningpoolstats.stream\/bitcoin\" data-v-f87c67ca=\"\">MiningPoolStats<\/a> and <a href=\"https:\/\/ycharts.com\/indicators\/bitcoin_network_hash_rate\" data-v-f87c67ca=\"\">Blockchain.com<\/a> show global hashrate estimates fell from around 600 EH\/s on Friday to 450 EH\/s by Tuesday, coinciding with a weather <a href=\"https:\/\/x.com\/ERCOT_ISO\/status\/1745881226248913297?s=20\" data-v-f87c67ca=\"\">warning<\/a> for Jan. 14 to 17 issued by ERCOT due to extreme cold weather across the region. ERCOT, the Electric Reliability Council of Texas, operates as the grid regulator for most of the state.","ERCOT’s warning was followed by official conservation appeals on Sunday, Monday and Tuesday. \"Operating reserves are expected to be low tomorrow morning due to continued freezing temperatures, record-breaking demand and unseasonably low wind. We request Texas businesses and residents conserve electricity use, if safe to do so,\" ERCOT <a href=\"https:\/\/x.com\/ERCOT_ISO\/status\/1746664677692629296?s=20\" data-v-f87c67ca=\"\">said<\/a>. Yesterday’s most recent curtailment request ended at 9 a.m. CT.","The hashrate reduction implies more than four gigawatts of power capacity was curtailed during the period, TheMinerMag previously <a href=\"https:\/\/theminermag.com\/news\/2024-01-16\/bitcoin-hashrate-drop-texas-miner-curtail-grid\/\" data-v-f87c67ca=\"\">reported<\/a>.","Miners pointing toward Foundry USA Pool — one of the largest mining pool operators by hashrate — appeared to be responsible for around half of the decline, dropping from an estimated 155 EH\/s on Friday to 77 EH\/s yesterday, before recovering, according to MiningPoolStats.","Luxor Mining Pool’s users were also impacted by the cold snap, as was the Bitcoin mining firm Marathon Digital. \"Luxor mining partners have significantly curtailed their operations, shutting down machines to give back power allocation to the grid over the last few days,\" Luxor Technology Chief Operating Officer Ethan Vera told The Block.","\"Many Bitcoin miners in Texas, Marathon included, have curtailed operations over the past few days to support the Texas grid and the state's citizens during the current cold outbreak, and that's exactly how this should be working,\" Marathon VP of Corporate Communications Charlie Schumacher added. \"Bitcoin miners are, among other things, a technology solution for the energy sector. In Texas, they serve as baseload that can be curtailed in minutes to free up energy for others in a time of crisis. That's exactly what we've seen play out over the past few days.\"","<span data-v-f87c67ca=\"\">Hashrate history. Image: <a href=\"https:\/\/miningpoolstats.stream\/bitcoin\" data-v-f87c67ca=\"\">MiningPoolStats<\/a>.<\/span>","China-based Bitcoin miners previously led the world in terms of total hashrate. That dominance plummeted in 2021 following <a href=\"https:\/\/www.theblock.co\/post\/121893\/china-not-unban-bitcoin-mining\" data-v-f87c67ca=\"\">shutdown<\/a> orders from regulators as the country launched a crackdown against the industry.","Texas emerged as an alternative hub, with miners <a href=\"https:\/\/www.theblock.co\/article\/111737\/bitcoin-mining-could-be-great-for-texass-grid-according-to-bitcoin-miners\" data-v-f87c67ca=\"\">arguing<\/a> at the time that mining is just as good for Texas as Texas is for miners since the flexibility of the industry's electricity use can strengthen the state’s power grid, curtailing demand during peaks and injecting it during troughs.","Firms including Marathon Digital, Riot Platforms and Iris Energy are among those who have added to the concentration of Bitcoin mining facilities in Texas over recent years, attracted by cheap electricity, grid incentives and the state's deregulated energy market. A <a href=\"https:\/\/medium.com\/foundry-digital\/foundry-usa-pool-hashrate-by-state-f9dc92e7bc3b\" data-v-f87c67ca=\"\">report<\/a> by Foundry in September said U.S.-based Bitcoin miners using its pool in Texas accounted for 28.5% of its hashrate in the country, the largest share among states by some margin and up more than two times from 8.4% in 2021.","Texas Bitcoin miners are no strangers to curtailment requests in the state either. In August, Riot Platforms received a new monthly record <a href=\"https:\/\/www.theblock.co\/post\/249674\/texas-riot-30-million-bitcoin-miners\" data-v-f87c67ca=\"\">$31.7 million<\/a> worth of power and demand response credits, administered by ERCOT, after cutting its power usage by over 95% during the summer heatwave. Iris Energy also received <a href=\"https:\/\/www.theblock.co\/post\/249904\/iris-energy-bitcoin-mining\" data-v-f87c67ca=\"\">$2.3 million<\/a> in energy credits in the same month, primarily driven by voluntary curtailment at its Childress site in Texas.","<em data-v-f87c67ca=\"\">Updated with additional comment from Marathon Digital.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ERCOT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ethan Vera","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Jan. 14","content":"DATE"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"25%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$2.3 million","content":"MONEY"},{"type":"Electric Reliability Council of Texas","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Riot Platforms","content":"ORGANIZATION"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"9 a.m.","content":"TIME"},{"type":"August","content":"DATE"},{"type":"Sunday","content":"DATE"},{"type":"CT","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"$31.7 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"8.4%","content":"PERCENT"},{"type":"Foundry USA","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"28.5%","content":"PERCENT"},{"type":"Charlie Schumacher","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN","MINING COMPANIES"],"authors":["James Hunt","The Block"]}