{"summary":"The firm has faced a legal dogpile from various state and federal regulators within the U.S. as scrutiny on lenders ramped up over the past year. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/192204\/crypto-lender-nexo-says-its-leaving-the-u-s-cites-regulatory-dead-end","publishDate":"2022-12-05T13:21:59","id":13644,"type":null,"title":"Crypto lender Nexo says it&#x27;s leaving the U.S., cites regulatory &#x27;dead end&#x27;","category":["REGULATION"],"content":["Facing a phalanx of regulators, cryptocurrency lending platform Nexo says it is \"phasing out\" the U.S. side of its operations.&nbsp;","In a statement announcing a \"gradual\" departure, Nexo <a href=\"https:\/\/nexo.io\/blog\/nexo-announces-gradual-departure-from-the-united-states\" data-v-f87c67ca=\"\">cited<\/a> a \"dead end\" in talks with U.S. regulators.&nbsp;","In particular, the firm noted a recent scramble from state regulators and the federal Consumer Financial Protection Bureau to investigate Nexo's \"Earn\" offering.&nbsp;","\"This was made crystal clear by the Consumer Financial Protection Bureau’s (CFPB) decision this past Thursday insisting it has jurisdiction to investigate our Earn Interest Product, which the SEC and state regulators have simultaneously insisted is a security subject to their jurisdictions,\" the firm's announcement read. On Thursday, the CFPB <a href=\"https:\/\/files.consumerfinance.gov\/f\/documents\/cfpb_nexo-financial-llc_decision-and-order-on-petition_2022-11.pdf\" data-v-f87c67ca=\"\">rejected a petition<\/a> from Nexo to cease an investigation into the product after the company argued that only securities regulators hold jurisdiction over it.&nbsp;","Still, Nexo said it wasn't happy with them either.&nbsp;","\"In addition, a number of the very state securities regulators we had been cooperating with for several months blindsided us by filing actions against us without advance notice,\" the departure statement said.&nbsp;","The Earn product, like many crypto lending platforms, in theory replicates a bank account with higher rates of return. But the SEC has taken issue with similar products, including a $100 million fine against BlockFi that Nexo cited in its petition for the CFPB to drop an investigation. State regulators, who sometimes coordinate with federal authorities, also sent the company <a href=\"https:\/\/www.theblock.co\/post\/172900\/california-issues-cease-and-desist-against-crypto-lender-nexo\" data-v-f87c67ca=\"\">cease and desist letters<\/a> in September.&nbsp;","Nexo, which has a large portion of its operations in Bulgaria, had announced that it would no <a href=\"https:\/\/www.theblock.co\/linked\/134786\/crypto-lender-nexo-to-stop-paying-interest-on-new-deposits-from-us-customers\" data-v-f87c67ca=\"\">longer pay interest<\/a> on new Earn deposits from the U.S. earlier this year.","The firm is the last major crypto lending platform functioning, as competitors like <a href=\"https:\/\/www.theblock.co\/post\/188915\/crypto-firm-blockfi-files-for-bankruptcy\" data-v-f87c67ca=\"\">BlockFi<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/188667\/court-sets-jan-3-deadline-for-celsius-customers-to-file-claims-in-bankruptcy-case\" data-v-f87c67ca=\"\">Celsius<\/a> and Voyager have filed for bankruptcy protection.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"federal Consumer Financial Protection Bureau","content":"ORGANIZATION"},{"type":"Bulgaria","content":"LOCATION"},{"type":"CFPB","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"earlier this year","content":"DATE"},{"type":"Nexo","content":"PERSON"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Kollen Post","The Block"]}