{"summary":"While Chopra took a shot at &quot;Washington&#x27;s obsession with crypto,&quot; he noted that his eye was on stablecoins. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172114\/washington-is-too-obsessed-with-cryptocurrencies-cfpb-director-says","publishDate":"2022-09-22T13:24:59","id":13645,"type":null,"title":"Washington is too obsessed with cryptocurrencies, CFPB director says","category":["POLICY"],"content":["Consumer Financial Protection Bureau Director Rohit Chopra sees stablecoins as a rapid growth area that regulators will need to monitor for risks to the rest of the financial system.","\"A stablecoin, riding the rails of a dominant payments system or a mobile OS, I think that could create ubiquity very quickly,” Chopra said, adding that issues around stablecoins, “are very much being thought through, but certainly not just by the CFPB.”","The Financial Stability Oversight Council, a collection of financial regulatory agency leaders that Chopra sits on in his capacity as CFPB director, meets tomorrow to discuss <a href=\"https:\/\/www.google.com\/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjulfa88Kj6AhWaHzQIHb4OAtkQFnoECAsQAQ&amp;url=https%3A%2F%2Fwww.theblock.co%2Fpost%2F170629%2Ffsoc&amp;usg=AOvVaw2-9HvqzaJ5Y5qdGZIcKMm4\" data-v-f87c67ca=\"\">a report on regulatory gaps in digital assets<\/a>. Last year the group identified stablecoins as an area in need of increased monitoring.&nbsp;&nbsp;","Chopra, speaking at the annual Washington conference of the Electronic Transactions Association, a trade group for payments service providers, listed a roster of concerns around stablecoins that has launched them onto the <a href=\"https:\/\/www.theblock.co\/post\/171565\/draft-stablecoin-bill-in-congress-to-require-fed-state-regulator-approval\" data-v-f87c67ca=\"\">Washington’s radar<\/a>. That included their resemblance to money market funds and their impact on global financial stability if widely and rapidly adopted for payments. The CFPB director added that high-profile stablecoin experiment Libra, which Facebook backed, brought the payments coins to the forefront for regulators.&nbsp;","But overall Chopra, whose agency has recently scrutinized Buy Now, Pay Later lending and is expected to release a rule soon related to consumer control over financial data, thought government has become too obsessed with cryptocurrencies.","“We’re in a moment right now where — I say this gently — Washington’s obsession with crypto has come at the expense of really thinking about the entire payments ecosystem,” the CFPB director said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Electronic Transactions Association","content":"ORGANIZATION"},{"type":"Chopra","content":"PERSON"},{"type":"Rohit Chopra","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"Consumer Financial Protection Bureau","content":"ORGANIZATION"}],"hashtag":["CFPB"],"authors":["Kollen Post","The Block"]}