{"summary":"ENF claimed that the settlement amount proposed by Block.one significantly undervalues what is rightfully owed to the EOS community.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243852\/eos-network-foundation-calls-on-community-to-reject-block-ones-22-million-settlement","publishDate":"2023-08-09T06:44:27","id":13654,"type":null,"title":"EOS Network Foundation calls on community to reject Block.one’s $22 million settlement","category":["LEGAL"],"content":["The EOS Network Foundation (ENF), an organization representing the EOS community, has issued an advisory and opt-out form urging its community members to reject the $22 million settlement presented by Block.one. This settlement is in connection with an ongoing class-action <a href=\"https:\/\/www.blockone-settlement.com\/\" data-v-f87c67ca=\"\">lawsuit<\/a> between former EOS investors and plaintiffs, Chase Williams and William Zhang, and Block.one.","ENF claimed that the settlement amount proposed by Block.one significantly undervalues what is rightfully owed to the EOS community.","Block.one first garnered significant attention when it raised a staggering $4 billion to develop the EOS blockchain during its initial coin offering (ICO) spanning 2017 to 2018. It had pledged to reinvest $1 billion into the EOS network ecosystem, the ENF claimed. This commitment, the foundation alleges, remains largely unfulfilled.","“The proposed settlement amount of $22 million represents a tiny fraction of the $4 billion that Block.one raised from the community in its ICO sale and the $1 billion that Block.one promised to invest in the EOS Network and community, but failed to do,” ENF wrote.","ENF emphasized the potential repercussions of accepting the $22 million settlement. Per the settlement terms, community members who participate will forfeit any future claims against Block.one and its founders in exchange for a $22 million payment, it said.","The foundation also warned that endorsing these terms might restrict community members from launching further legal actions or seeking a more fitting resolution in the future.","“The ENF urges community members to opt out of the settlement which will send a strong message to Block.one and to the court that the settlement is entirely inadequate and does not adequately compensate community members for the losses they suffered at the hands of Block.one,” it stated.","<em data-v-f87c67ca=\"\">Block.one did not immediately respond to a request for comment.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"EOS","content":"ORGANIZATION"},{"type":"$22 million","content":"MONEY"},{"type":"Chase Williams","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$4 billion","content":"MONEY"},{"type":"EOS Network Foundation","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"William Zhang","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"ENF","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}