{"summary":"A U.S. House hearing on dueling stablecoin bills highlighted a major difference between Republican and Democratic approaches, but also that the gap between both sides may be manageable. A U.S. House hearing on dueling stablecoin bills highlighted a key area of disagreement: state regulation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231413\/us-stablecoin-bill-debate-hones-in-on-preventing-race-to-the-bottom","publishDate":"2023-05-18T14:09:42","id":13659,"type":null,"title":"US stablecoin bill debate hones in on preventing &#x27;race to the bottom&#x27;","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">Debate over whether or not states should be able to regulate stablecoins, and tension over whether that would create a “race to the bottom,” took up much of the latest Congressional hearing on creating a comprehensive framework for digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The hearing at the Digital Assets, Financial Technology and Inclusion Subcommittee on Thursday featured dueling stablecoin bills from the top Republican and Democrat on the House Financial Services Committee, bringing formerly closed door negotiations out into the public.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Debate on stablecoin legislation drew unusual lines of agreement as House Republicans, who typically favor lowering regulation, argued that their bill went far enough in creating new guardrails for the still-nascent technology.&nbsp;<\/span>","Both sides see the need for stablecoin legislation after supposedly-stable tokens crashed much of the crypto market last year, culminating with the collapse of FTX and its affiliated firms and financial contagion throughout much of the crypto and digital asset industry.&nbsp;","<span data-v-f87c67ca=\"\">Some Democrats on the panel took issue with allowing state regulators to set standards for stablecoin issuance, arguing that the baseline could be lowered too far, driving firms to states with the loosest regulation.<\/span>","<span data-v-f87c67ca=\"\">“A race to the bottom is a practice, is the custom of this industry, you know, to go offshore and seek areas of least regulation,” argued Rep. Stephen Lynch, the top Democrat on the subcommittee. “My feeling is that if we directed this to 50 states, and territories perhaps, that that practice would continue and that cryptocurrencies would seek out those areas, those jurisdictions, that offer the best opportunity for them to maximize their profit and avoid cumbersome and costly regulation and disclosure.”<\/span>","<span data-v-f87c67ca=\"\">That would hamstring regulations like the New York Department of Financial Services, Lynch said. New York’s approach to stablecoins was put forward as a model by all sides, though Republicans say they want states, which currently regulate payments providers, to have the freedom to set their own standards as long as they meet certain criteria. <\/span>","<span data-v-f87c67ca=\"\">The Federal Reserve, given prominence over the area by Democrats in their <\/span><a href=\"https:\/\/docs.house.gov\/meetings\/BA\/BA21\/20230518\/115973\/BILLS-118pih-Toprovidefortheregulationofpaymentstablecoinsandforotherpurposes.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">own draft<\/span><\/a><span data-v-f87c67ca=\"\">, would still potentially play a role under the Republican bill. Republicans also want the Office of the Comptroller of the Currency to continue to oversee stablecoin issuers who register as national trust companies, a bank-like category that focuses on providing a service that does not involve lending.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Republicans could try to pass their <\/span><a href=\"https:\/\/docs.house.gov\/meetings\/BA\/BA21\/20230518\/115973\/BILLS-118pih-Thediscussiondraftdefinesp.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">own legislation<\/span><\/a><span data-v-f87c67ca=\"\"> out of committee along party lines, and the House of Representatives, with zero support from Democrats since a simple majority is all that’s needed in that chamber of Congress. But Democratic control of the Senate and White House means the more support they can gain from across the aisle, the more likely a bill will become law.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Republicans on the committee did not see the gap between the two sides over state-level regulation as insurmountable.<\/span>","<span data-v-f87c67ca=\"\">“It’s important as we work through the drafts that we strike the right balance there,” said Rep. French Hill, the Republican subcommittee chair. “It’s a key, effectively, a difference between these two drafts and one that we’re going to try to figure out between both sides of the aisle as we work through this.”<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Digital Assets","content":"ORGANIZATION"},{"type":"Inclusion Subcommittee","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Lynch","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Stephen Lynch","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Financial Technology","content":"ORGANIZATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["BUSD","CBDCS","CONGRESS","FEDERAL RESERVE","FTX","HOUSE FINANCIAL SERVICES COMMITTEE","OCC","SEC","TETHER","USDC","USDP"],"authors":["Colin Wilhelm","The Block"]}