{"summary":"Decentralized exchange Pancakeswap has passed a governance proposal for deploying it on the newly launched blockchain, Aptos.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179764\/pancakeswap-approves-dex-launch-on-aptos-via-governance-vote","publishDate":"2022-10-25T16:49:05","id":13664,"type":null,"title":"Pancakeswap approves DEX launch on Aptos via governance vote","category":["LAYER 1S"],"content":["Decentralized exchange Pancakeswap has passed a governance proposal for deploying it on the newly launched blockchain, Aptos.","The pending launch will be Pancakeswap’s second on another blockchain, following its <a href=\"https:\/\/www.theblock.co\/post\/178602\/pancakeswap-eyes-aptos-following-ethereum-integration\" data-v-f87c67ca=\"\">deployment on Ethereum<\/a>. As part of the proposal, Pancakeswap’s token CAKE will be natively integrated into Aptos, along with four of its DEX primary features.","Pancakeswap is joining a trend of projects that expand to multiple blockchains using their native tokens, as new bridging platforms enable this kind of growth. Being able to use native tokens on other chains versus synthetic or “wrapped” versions lets DeFi apps operate on multiple chains.","The team will roll out swaps, farms, pools, and initial farm offerings by the end of November.","The Aptos and Pancakeswap teams will work on establishing Aptos projects and assisting with their growth on its platform, a representative from Aptos told The Block. Pancakeswap will also set up liquidity pools for Aptos’s native token, APT.","Aptos went live on Oct. 12 and currently has over $15 million deposited across all the applications in its ecosystem, <a href=\"https:\/\/defillama.com\/chain\/Aptos\" data-v-f87c67ca=\"\">according to DeFiLlama.<\/a>","Pancakeswap originated on BNB Chain and is the second-largest decentralized exchange by trading volume, according to The Block’s Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/dex-non-custodial\/share-of-dex-volume-monthly\/embed\" title=\"Share of DEX Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"DeFiLlama","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$15 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Oct. 12","content":"DATE"},{"type":"The Block’s Data Dashboard","content":"ORGANIZATION"},{"type":"Pancakeswap","content":"PERSON"},{"type":"November","content":"DATE"}],"hashtag":["APTOS"],"authors":["Mike Truppa","The Block"]}