{"summary":"Brazilian mobile payment app PicPay will start supporting cryptocurrencies, launch an exchange and introduce a stablecoin pegged to the real.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157013\/brazils-picpay-to-launch-crypto-payments-and-real-pegged-stablecoin","publishDate":"2022-07-12T05:42:15","id":13669,"type":null,"title":"Brazil&#x27;s PicPay to launch crypto payments and real-pegged stablecoin","category":["PAYMENTS AND BANKING"],"content":["Popular Brazilian mobile payment app PicPay announced Monday that it plans to start supporting cryptocurrency payments, as well as launch its own cryptocurrency exchange and a stablecoin pegged to the Brazilian real.","In a company <a href=\"https:\/\/blog.picpay.com\/pagar-com-criptomoedas-no-picpay\/\" data-v-f87c67ca=\"\">blog post<\/a>, PicPay said it plans to offer an exchange through the app so that people can buy and store cryptocurrencies. It will initially support bitcoin, ether and Paxos's Pax Dollar (USDP) stablecoin.&nbsp;","According to Brazilian news website <a href=\"https:\/\/neofeed.com.br\/blog\/home\/exclusivo-picpay-cria-uma-exchange-de-criptomoedas-e-vai-lancar-uma-stablecoin\/\" data-v-f87c67ca=\"\">NeoFeed<\/a>, which first reported the story, PicPay could start offering this exchange component within its app as early as next month. Furthermore, PicPay hopes to support 100 different cryptocurrencies through the app by the end of the year, the report said.&nbsp;","The firm also plans to launch its own stablecoin pegged to the Brazilian real, which will be called the Brazilian Real Coin (BRC).&nbsp;","“PicPay will enter the crypto market to lead its popularization not only as an investment, but also as a way to decentralize payments and other financial services,\" vice president of technology and products Anderson Chamon said in the blog post.&nbsp;","PicPay started in 2012 and became known for offering mobile peer-to-peer and QR code payments (its name is short for \"Picture Pay\"). Today it counts 30 million active users, Chamon noted in the company's July 11 blog post. PicPay <a href=\"https:\/\/blog.picpay.com\/picpay-crescimento\/\" data-v-f87c67ca=\"\">surpassed<\/a> 65 million user registrations through its app this year.&nbsp;","\"The scenario of the world economy, such as high interest rates, has weighed on investments in cryptocurrencies, as well as in other risky assets, including the stock exchange,\" Chamon said in the blog post. \"Despite this, the technological proposal of this market is still the same. We believe cryptocurrencies will grow again as new ways of using them appear, and become commonplace.\"","PicPay is not the only fintech in Brazil embracing cryptocurrencies. Nubank, the Warren Buffett-backed neobank that <a href=\"https:\/\/www.theblock.co\/linked\/127223\/brazilian-fintech-nubank-is-now-publicly-listed-in-the-us-and-brazil\" data-v-f87c67ca=\"\">went public<\/a> in December, <a href=\"https:\/\/www.theblock.co\/linked\/146409\/brazilian-fintech-unicorn-nubank-to-start-offering-crypto-services\" data-v-f87c67ca=\"\">announced a deal<\/a> with Paxos in May to start offering bitcoin and ether trading in its app.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"July 11","content":"DATE"},{"type":"Anderson Chamon","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Chamon","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Paxos","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Warren Buffett","content":"PERSON"},{"type":"PicPay","content":"PERSON"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}