{"summary":"SBF&#x27;s lawyers still aren&#x27;t sure what kind of case they&#x27;re going to mount in his defense — or if they&#x27;ll even make a case at all.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258279\/inside-sbfs-trial-the-defense-contemplates-its-next-move-after-struggling","publishDate":"2023-10-18T21:16:20","id":13679,"type":null,"title":"Inside SBF&#x27;s Trial: The defense contemplates its next move after struggling","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">After the jury had left the courtroom following court proceedings in the <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">trial<\/a> of Sam Bankman-Fried yesterday, Judge Lewis Kaplan went over procedural matters with lawyers from both sides. When he asked Mark Cohen, Sam Bankman-Fried's lead defense attorney, about how long his defense will take, Cohen had a rather mysterious response: \"We are still working through whether we are going to put a case on and, if so, of what nature.”<\/span>","<span data-v-f87c67ca=\"\">But the admission that Bankman-Fried's defense isn't sure how it will defend him is somewhat unsurprising, given the difficulty Cohen and his team, including Christian Everdell and David Lisner, has had in scoring points during their cross-examination of the prosecution's witnesses, chiefly the three members of Bankman-Fried's <a href=\"https:\/\/www.theblock.co\/post\/257840\/inside-sbfs-trial-nishad-singh-said-no-but-not-often-enough\" data-v-f87c67ca=\"\">inner circle<\/a> who have taken cooperation agreements with the government.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The defense, in sidebar conversations with the judge, have argued that the numerous objections from Kaplan and the government prosecutors, led by Assistant U.S. Attorney Danielle Sassoon, have curbed their ability to argue an alternate narrative of the case.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The term \"put on a case\" means whether or not the defense will call its own witnesses to rebut prosecutors' case or put Bankman-Fried on the stand, said Anthony Sabino, <\/span><span data-v-f87c67ca=\"\">a law professor at St. John's University.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, not putting on a case would mean that Bankman-Fried's lawyers plan to call no one and rely on its cross-examination of the prosecution's witnesses, Sabino added.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What may look like last minute planning by Bankman-Fried's lawyers could just mean they are still weighing out potential options, Sabino said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"They are playing their cards close to the vest,\" Sabino said. \"It’s just smart lawyering, maneuvering behind the scenes, if you will, and not giving away anything to the government until it is necessary.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried's lawyers will likely put up a witness or submit evidence, said Michael Popok, executive managing partner at law firm Zumpano Patricios &amp; Popok.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I've never seen a defendant just go, sorry judge we're not putting on any case in defense so I find that to be unusual. But what he is signaling is that they don't think they're going to put on much of a case in defense,\" Popok said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In fact, while the government's case is expected to last two more days, for a total of twelve trial days over three four-day weeks, <\/span><span data-v-f87c67ca=\"\">Cohen, who once represented Jeffrey Epstein associate Ghislaine Maxwell, told Judge Kaplan, \"I continue to believe that if we do put on a case, it won't be more than a week, week and a half at the max.\"<\/span>","<span data-v-f87c67ca=\"\">The most highly publicized failure of Bankman-Fried and his defense was their inability to keep Bankman-Fried from being <\/span><a href=\"https:\/\/www.theblock.co\/post\/244540\/ftx-judge-says-hes-revoking-bail-for-bankman-fried-inner-city-press\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">sent back to jail<\/span><\/a><span data-v-f87c67ca=\"\"> before the trial. But the defense also faced a litany of other rejections from Judge Kaplan.<\/span>","<span data-v-f87c67ca=\"\">All of the seven expert witnesses Bankman-Fried proposed to call, for example, were <\/span><a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590940\/gov.uscourts.nysd.590940.287.0.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">denied<\/span><\/a><span data-v-f87c67ca=\"\"> by Judge Kaplan, though Kaplan left open the door for him to call on four as rebuttals to government witnesses — provided they file an updated disclosure and give the prosecution three days' notice.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried's lawyers only objected to one of the government's proposed expert witnesses, accounting expert Peter Easton. Bankman-Fried's motion was denied and Easton <a href=\"https:\/\/www.theblock.co\/post\/258277\/inside-sbfs-trial-alameda-paid-for-loans-vc-deals-and-bahamas-properties-with-ftx-user-funds-expert-tells-court\" data-v-f87c67ca=\"\">testified<\/a> today regarding the use of customer funds by Alameda Research for a variety of investments, political and charitable donations, and property purchases.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Many of Bankman-Fried's motions <\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in limine<\/span><\/i><span data-v-f87c67ca=\"\">, which concerned which arguments and which evidence could be offered at trial, have also been denied by Judge Kaplan. Kaplan ruled that Bankman-Fried couldn't argue about the current value of <\/span><a href=\"https:\/\/www.theblock.co\/post\/254667\/anthropics-new-raise-could-mean-full-payout-for-ftx-creditors-lawyer\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">FTX's Anthropic investment<\/span><\/a><span data-v-f87c67ca=\"\">, or whether he intended to pay the customers back, or whether his philanthropic efforts showed he wasn't the type of person to commit a financial fraud of this scale.&nbsp;<\/span>","\"<span data-v-f87c67ca=\"\">Does this refresh your recollection?\" The awkwardly phrased question became a common refrain for Bankman-Fried's lawyers when cross-examining the three members of Bankman-Fried's inner circle: former Alameda Research CEO Caroline Ellison, former Alameda and FTX co-founder and CTO Gary Wang, and former FTX Head of Engineering Nishad Singh, all three of whom have plead guilty to crimes and are cooperating with the government. Bankman-Fried's lawyers, at several points, showed the witnesses documents or notes that they hoped would turn an \"I don’t know\" answer into something more concrete.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet, at nearly every turn, whatever notes they were showing the witness (they weren’t shared with the jury or observers) failed to refresh their recollection.&nbsp;On one occasion, when Wang testified that looking at notes from a conversation with prosecutors failed to refresh his recollection as to a specific claim he made, Bankman-Fried's attorney Everdell drew the ire of Judge Kaplan by asking, \"Is it true that that's what's said there?\"<\/span>","<span data-v-f87c67ca=\"\">After the prosecution objected, Kaplan replied sternly, \"Sustained. And don't do that again, Mr. Everdell.\" Wang, Ellison, and Singh would each go on to deny several times that whatever they were being shown by Bankman-Fried's team was helping them remember something that would change their testimony.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Even when their questions were more focused, Bankman-Fried's attorneys struggled to impugn the character of the three witnesses. At one point, Cohen appeared to score a major point against Nishad Singh, detailing how the witness the prosecutors argued was the <\/span><a href=\"https:\/\/www.theblock.co\/amp\/post\/257840\/inside-sbfs-trial-nishad-singh-said-no-but-not-often-enough\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">moral center of FTX<\/span><\/a><span data-v-f87c67ca=\"\"> closed on a $3.7 million vacation home on Orcas Island, Washington, on Nov. 1, 2022 —&nbsp;just days before FTX collapsed and well after Singh testified he knew the extent of the fraud. Furthermore, Singh admitted that he borrowed the money from the FTX exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet under redirect, when the prosecution again has the opportunity to question a witness after cross-examination, the prosecution's attorney Nicolas Roos asked Singh what happened to the property. Cohen objected, arguing that the event was beyond the scope of the case, but Kaplan agreed with Roos's rebuttal (\"He opened the door!\") and overruled the objection.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"I forfeited it,\" said Singh. \"I bought it at a time when I understood that I was putting myself ahead of customers by doing so. I was embarrassed and ashamed,\" he testified, adding that forfeiting the house felt like a small righting of a huge wrong.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">One final note of annoyance: while the witnesses and lawyers from the prosecution all agree that former FTX executive Ryan Salame's name is pronounced like \"SAY-lem,\" Cohen has continued to pronounce it \"sah-LAM\" for the duration of the trial.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During one particularly heated sidebar discussion in the middle of Caroline Ellison's cross-examination by the defense, Cohen forcefully expressed his displeasure with Kaplan's judgments, according to the trial transcript.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"Your Honor, we are not limited to the government's theory of the case. We are allowed to put on a defense. We are allowed to cover topics that have been covered before and to put our view of what happened across,\" said Cohen, who added, \"I have to say, I can't think of a trial I've done where we are being told we have to limit our cross to only what was on the direct.\"<\/span>","<span data-v-f87c67ca=\"\">\"I can’t think of that actually occurring in this case,\" Kaplan fired back. \"Then I withdraw that remark,\" said Cohen. \"And properly so,\" said Kaplan, before granting Cohen's original request of a question that had been objected to by the government.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried's lawyers can make the decision to put the former FTX CEO on the stand up until the jury gets the case in deliberation, Popok said. Furthermore, even if Bankman-Fried's lawyers advise him against testifying, he can still make the decision to do so at any time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"My gut is they're not going to, but they also don't have to commit one way or the other. They don't have to signal what their defense is right now,\" Popok said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If Bankman-Fried does take the stand, it would take a few days, he added. If his lawyers see, for example, that the jury smiled when his former colleague Caroline Ellison took the stand, they may think they're losing the case, Popok said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"If your corner thinks you're down on points you've got to go for the knockout and the knockout would be he testifies,\" Popok said.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sabino","content":"PERSON"},{"type":"Ellison","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Michael Popok","content":"PERSON"},{"type":"Peter Easton","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"FTX Head of Engineering Nishad Singh","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"Orcas Island","content":"LOCATION"},{"type":"Roos","content":"PERSON"},{"type":"Danielle Sassoon","content":"PERSON"},{"type":"Anthony Sabino","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$3.7 million","content":"MONEY"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Nov. 1, 2022","content":"DATE"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"Ryan Salame","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"St. John's University","content":"ORGANIZATION"},{"type":"Nicolas Roos","content":"PERSON"},{"type":"Zumpano Patricios &amp; Popok","content":"ORGANIZATION"},{"type":"Wang","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Cohen","content":"PERSON"},{"type":"Easton","content":"PERSON"},{"type":"Wang","content":"ORGANIZATION"},{"type":"Popok","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Everdell","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Christian Everdell","content":"PERSON"},{"type":"David Lisner","content":"PERSON"},{"type":"Ghislaine Maxwell","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Singh","content":"PERSON"},{"type":"Mark Cohen","content":"PERSON"},{"type":"Jeffrey Epstein","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","Sarah Wynn","The Block"]}