{"summary":"Ark Invest founder and CEO Cathie Wood said equity markets plagued by a &quot;wall of worry&quot; have &quot;largely ignored&quot; game-changing innovation last year that included blockchain technology and digital wallets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/201841\/cathie-wood-sees-wall-of-worry-ignoring-blockchain-tech-digital-wallets-and-chatgpt","publishDate":"2023-01-12T18:23:49","id":13675,"type":null,"title":"Cathie Wood sees &#x27;wall of worry&#x27; ignoring blockchain tech, digital wallets and ChatGPT","category":["COMPANIES"],"content":["Ark Invest founder and CEO Cathie Wood said equity markets plagued by a \"wall of worry\" have \"largely ignored\" game-changing innovation last year that included blockchain technology and digital wallets, in addition to the ChatGPT bot developed by OpenAI that has taken the world by storm.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"I have never seen markets this dislocated,\" she wrote in a <a href=\"https:\/\/ark-invest.com\/articles\/market-commentary\/what-the-market-overlooked-in-2022\/\" data-v-f87c67ca=\"\">letter published Thursday<\/a>, highlighting declining money supply and commodity prices that could point to lower inflation and even deflation. \"Fear of the future is palpable, but crisis can create opportunities.\"","Wood, whose funds have now bought Coinbase shares for two days in a row, said that Bitcoin and Ethereum have not \"skipped a beat\" in processing transactions, despite the recent collapse of the FTX crypto exchange.","She also noted growth in the use of digital wallets and said they've overtaken cash as the top transaction method for offline commerce.","\"Disruption can surface in surprising forms and at unexpected times,\" she wrote. \"Innovation solves problems and has historically gained share during turbulent times.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cathie Wood","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}