{"summary":"B2C2 said that crypto traders will likely be paying more attention to the price of Solana and FTT than economic data in the short term.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183895\/b2c2-crypto-market-sentiment-could-hinge-on-solana-and-ftxs-native-tokens","publishDate":"2022-11-07T17:04:24","id":13671,"type":null,"title":"B2C2: Crypto market sentiment could hinge on Solana and FTX&#x27;s native tokens","category":["THE BLOCK"],"content":["The price of Solana and FTT might end up being the most important data points for the trajectory of the crypto market this week, according to B2C2.&nbsp;","In a note published Monday, the market maker joined a chorus of firms raising questions in the wake of the clash between Binance's Changpeng \"CZ\" Zhao and FTX's Sam Bankman-Fried.&nbsp;","\"The market is now asking the question of whether the value of the FTT collateral is really high enough for the loans it is backing, and if not, what would become of Alameda and FTX,\" B2C2 noted, referring to CoinDesk's <a href=\"https:\/\/www.coindesk.com\/business\/2022\/11\/02\/divisions-in-sam-bankman-frieds-crypto-empire-blur-on-his-trading-titan-alamedas-balance-sheet\/\" data-v-f87c67ca=\"\">reporting<\/a> that the balance sheet of Alameda comprised of \"a $2.16 billion pile of FTT collateral.\" Other assets on the balance sheet include <span data-v-628af130=\"\" data-v-f87c67ca=\"\">$1.2 billion of locked and unlocked<\/span> SOL, according to CoinDesk.&nbsp;","In B2C2's view, the price of FTT and Solana might have a more meaningful impact on the direction of the crypto market to the down side than a bearish Consumer Price Index (CPI) print. A higher CPI print than expected could trigger a broader sell off in asset prices.&nbsp;","Here's B2C2 (emphasis is our own):","\"And despite the wider markets obvious focus on CPI as the week’s most important data point, given the public spat between the founders of the world’s two biggest crypto exchanges, it might just turn out that the most important numbers for crypto this week are the prices of two mid cap coins: FTT and SOL. <strong data-v-f87c67ca=\"\">Weakness below current levels, around $22 and $31 respectively, could signal a risk that crypto is facing another washout to the downside.<\/strong>\"","Alameda's exposure to FTT — juxtaposed with CZ's announcement that he would offload Binance's position in the crypto — spooked traders on Sunday, with many telling The Block they moved funds off FTX as a way to de-risk in the event of a further drawdown on FTT.&nbsp;","Bankman-Fried insisted his crypto exchange was “fine” after rival Binance's announcement.&nbsp;","\"A competitor is trying to go after us with false rumors,\" Bankman-Fried&nbsp;<a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1589598284322328579\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">tweeted<\/a>. \"FTX is fine. Assets are fine. FTX has enough to cover all client holdings. We don't invest client assets (even in treasuries). We have been processing all withdrawals, and will continue to be.\"","<em data-v-f87c67ca=\"\">Update: Corrected the amount of SOL on Alameda's balance sheet.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$31","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"FTT","content":"ORGANIZATION"},{"type":"SOL","content":"ORGANIZATION"},{"type":"$22","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"$2.16 billion","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}