{"summary":"MEP Ondrej Kovarik chats about the Markets in Crypto-Assets legislation he helped author, and how EU policymakers will react to the FTX collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189568\/mica-would-have-limited-impact-on-ftx-breakdown-says-mep-ondrej-kovarik","publishDate":"2022-11-24T03:01:25","id":13670,"type":null,"title":"MiCA would have limited impact on FTX breakdown, says MEP Ondrej Kovarik","category":["POLICY"],"content":["The dramatic collapse of FTX crypto exchange has turned regulators’ heads around the world. In the European Union, many policy experts came forward <a href=\"https:\/\/www.theblock.co\/post\/184719\/eu-crypto-legislation-will-mitigate-events-like-ftx-collapse-policy-experts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">claiming<\/a> that the bloc’s highly anticipated Markets in Crypto-Assets legislation could have cushioned the blow or prevented the events that led up to the crash.","The MiCA framework lays down a comprehensive set of rules to regulate crypto assets and service providers like crypto exchanges, with a final vote on the legislation expected in February. Once approved, MiCA gives regulators 12-18 months to flesh out how provisions will need to be implemented.","Member of the European Parliament Ondrej Kovarik helped draft MiCA on behalf of the Parliament’s liberal-centrist Renew Group. In an interview, Kovarik weighed in on the role of MiCA in the current crypto policy climate and what the FTX debacle means for regulators.","<em data-v-f87c67ca=\"\">This interview has been lightly edited for clarity and length.&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">What impact does FTX have on regulators in Europe and around the world?<\/strong>","The latest FTX events definitely will attract more attention from regulators to the crypto sector. But I think it is already something that is in progress. We are finalizing the adoption of the MiCA rules in Europe, but you have also the G20 ministers discussing a possible regulatory framework. You have a very lively debate in the U.S., for instance, among various institutions, on how to actually approach the crypto sector. We have recommendations coming from a Financial Stability Board, so I think that you can see many initiatives that are happening, either reacting to the general trends in digital financial services, but also I think to some specific events happening in the crypto sector.&nbsp;","I think that there was sort of a common understanding, also on the European level, that MiCA can be an interesting source of inspiration for these talks so that we moved forward in Europe as pioneers, if you want to, in terms of setting a comprehensive regulatory framework for digital assets. And I think now it can become sort of a reference point also for other jurisdictions when we speak about possible convergence approaches of the rules on a global level.&nbsp;","<strong data-v-f87c67ca=\"\">Could MiCA have mitigated the impact of the FTX meltdown here in the EU?<\/strong>","First of all, it's important to see where the companies that are involved in the recent events are located and whether any possible EU regulation can have an impact on them. [<em data-v-f87c67ca=\"\">Ed: Much of FTX’s operations were based outside the EU.<\/em>] To be honest, just with a very concrete example of FTX, I don't see exactly how MiCA would be able to fully stop or prevent this. I can imagine that some aspects of it would be mitigated or alleviated. But, in my view, the real causes of the crash lie also somewhere else than what a crypto asset regulation can actually cover.&nbsp;","In terms of what would MiCA help to solve: definitely MiCA would enhance transparency and it would enhance the level of protection of investors. It may even enhance the level of understanding of how various assets [<em data-v-f87c67ca=\"\">Ed: <\/em><em data-v-f87c67ca=\"\">like FTT<\/em>] work. But the key is to say that if we have entities that are located and operating outside of EU rules, the direct impact of MiCA can be quite low or questionable.&nbsp;","MiCA would give us a better position to make sure that there is international cooperation so that the global jurisdictions can actually start discussing what kind of regulatory environment they can agree to on a global level.&nbsp;","<strong data-v-f87c67ca=\"\">So in what ways would MiCA <em data-v-f87c67ca=\"\">not <\/em>be helpful?&nbsp;<\/strong>","I saw people saying that FTX could be considered a complete scam, that the way it worked it was just not possible for it actually to operate. And I think these issues would be quite hard to solve simply with the new European rules on crypto assets. I think much broader initiatives would be needed for us to do some of that.&nbsp;","I think we should first analyze what exactly happened in this case and whether this is something that can be fully resolved by only adjusting the regulatory framework on crypto assets. If you look at all of the complexity of the events around FTX, you soon realize that it's not only a pure crypto or crypto sector issue, it was much broader than that and definitely some kind of broader action or provision was missing.&nbsp;","We're not talking only about the FTX exchange, right? We’re talking about quite a high number of companies that were operating together. And that's quite a broad financial services ecosystem. It would be too simple to just to say that only a crypto asset regulation would solve this.&nbsp;","I think it would be different if, let's say, all the companies were fully established and located in the European Union and as such submitted to the European regulatory and supervisory framework.&nbsp;","That could be a set of limits of MiCA regulations, because that's primary European regulation. It will completely cover entities and companies that will actively operate on the European market.&nbsp;","But at the same time, you can still have investors or users, consumers from the European Union investing or using services of such companies. So I think that's one of the challenges that are ahead of us in terms of how we actually deal with digital services when they have no boundaries in terms of geographical boundaries.&nbsp;","<strong data-v-f87c67ca=\"\">Do you think that these recent events will affect the discussions and rules regulators will come up with for how to implement MiCA?<\/strong>","I think the key would be first to finalize, adopt and make sure that there is a full application of the level one legislation. And then we will see if that can have an impact on the follow up regulatory work.","Now, the real period of work on the new regulatory framework for crypto assets starts. And I think the key now is the implementation and also the way the supervisors will handle it. For me, that’s the critical part of MiCA. We may have very good provisions on paper — we can agree, or we can argue about those provisions, but they are set there. They will be adopted, but then the key will be in the implementation. And I think this is something where all of us — the regulators, supervisors, public authorities, but also the industry — we should now join forces and make sure that the implementation is as smooth as possible.&nbsp;","MiCA will stay with us for some time. I think a good implementation would be proportionate and reasonable ... so that the rules would not be interpreted in a way that is too burdensome or even harmful. We should be able to implement them in a way that the benefits are put forward.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"European Union","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"G20","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"European Union","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"18 months","content":"DATE"},{"type":"MiCA","content":"ORGANIZATION"},{"type":"Kovarik","content":"PERSON"},{"type":"Ondrej Kovarik","content":"PERSON"},{"type":"centrist Renew Group","content":"ORGANIZATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Financial Stability Board","content":"ORGANIZATION"}],"hashtag":["EUROPEAN PARLIAMENT"],"authors":["Inbar Preiss","The Block"]}