{"summary":"India&#x27;s law enforcement agency ED has issued a show cause notice to WazirX for allegedly violating FEMA rules.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/108178\/india-law-enforcement-agency-ed-crypto-exchange-wazirx-fema","publishDate":"2021-06-11T08:05:04","id":13676,"type":null,"title":"India&#x27;s ED alleges crypto exchange WazirX violated FEMA rules","category":["LEGAL"],"content":["India's Directorate of Enforcement — a law enforcement agency responsible for fighting financial crime in the country — has alleged that local crypto exchange WazirX violated the Foreign Exchange Management Act (FEMA) rules.","The Directorate of Enforcement, known as ED in India, <a href=\"https:\/\/twitter.com\/dir_ed\/status\/1403256929435017217?s=20\" data-v-f87c67ca=\"\">announced<\/a> Tuesday that it has issued a show cause notice to WazirX \"for alleged contravention of Sec 3(a) of Foreign Exchange Management Act, 1999, (FEMA) for transactions involving crypto-currencies worth an amount of INR 2790,74,17,699.\" In US dollar terms, that's around $382 million.","The agency issues show cause notices when it thinks that a company has been party to misconduct. The company is then required to submit its reply to a disciplinary authority as to why action should not be initiated against it.","ED says it has issued a <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/06\/ED_WazirX_notice.pdf\" data-v-f87c67ca=\"\">show cause notice<\/a> to Zanmai Labs Pvt Ltd (a registered entity of WazirX), as well as WazirX co-founder and CEO Nischal Shetty and its co-founder Sameer Hanuman Mhatre.","Shetty told The Block that \"WazirX is yet to receive any show cause notice from the Enforcement Directorate.\"","For the past several months, ED has been investigating a case of <a href=\"https:\/\/timesofindia.indiatimes.com\/business\/india-business\/ed-seizes-rs-47-cr-in-bank-a\/cs-after-raids-on-15-premises-of-firms-linked-to-chinese-betting-apps\/articleshow\/77829156.cms\" data-v-f87c67ca=\"\">Chinese betting apps<\/a> in India, where some Chinese nationals have been accused of carrying out illegal online betting and collecting over Rs 1,300 crore (nearly $178 million).","During this investigation, the agency found that WazirX was used to exchange around Rs 57 Crore ($8 million) of proceeds from the criminal activity. The money was swapped from INR to tether (USDT) before being sent on to crypto exchange Binance (which also owns WazirX).","\"Hence, a FEMA investigation was initiated and summons were issued under FEMA 1999 to Wazirx Directors and the top traders on this platform,\" said ED.","ED says that there are \"glaring problems\" as to how WazirX is operating. The exchange does not have adequate anti-money laundering (AML) and combating of financing of terrorism (CFT) processes, according to the agency.","\"This leaves WazirX in clear violation of the basic mandatory AML\/CFT precaution norms and FEMA guidelines which are also applicable to Virtual Currency exchanges,\" said ED. It added that cryptocurrencies have value and are being used to make payments, so they count as \"money\" for the purposes of FEMA.","Shetty told The Block that WazirX \"is in compliance with all applicable laws\" and is \"able to trace all users on our platform with official identity information.\"","\"Should we receive a formal communication or notice from the ED, we'll fully cooperate in the investigation,\" said Shetty.","The show cause notice \"is just the beginning of proceedings,\" a lawyer on the condition of anonymity told The Block. \"It is not that wrongdoing has been found. It is not a finding of guilt or a finding of penalty,\" they said.","As a next step, ED says it would then conduct adjudication proceedings. Adjudication is a legal process by which a judge reviews evidence and argumentation, including legal reasoning by opposing parties to come to a decision. These proceedings would take time and could go on for \"at least a year,\" the lawyer told The Block.","In the meantime, it is not clear whether WazirX would be able to run its business as usual. The lawyer told The Block that an adjudicating officer \"could pass any interim order or seek any attachments\" that could affect WazirX.","The news comes at a time when India is reportedly <a href=\"https:\/\/www.theblockcrypto.com\/post\/94740\/india-to-ban-crypto-investment-completely-report\" data-v-f87c67ca=\"\">looking to ban<\/a> the usage of cryptocurrencies. The Reserve Bank of India (RBI), the country’s central bank, continues to have <a href=\"https:\/\/www.theblockcrypto.com\/post\/107188\/indias-central-bank-still-has-major-concerns-on-crypto-says-the-governor\" data-v-f87c67ca=\"\">\"major concerns\"<\/a> about crypto even after clarifying to banks that they can't caution their customers against dealing in crypto, citing an old 2018 RBI circular, which was overturned by the Supreme Court of India last year.","But at the same time, the RBI has told banks that they will have to carry out customer due diligence processes in line with regulations, including KYC, AML, CFT, and FEMA.","<a href=\"https:\/\/www.theblockcrypto.com\/daily\/97559\/indias-crypto-exchanges-optimistic-reports-crypto-ban\" data-v-f87c67ca=\"\">As The Block has reported previously<\/a>, India's crypto fate depends on the country's government. The government is likely to discuss a crypto bill in the near future, but its contents remain unknown. Meanwhile, crypto is neither legal nor illegal in India.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Sec","content":"ORGANIZATION"},{"type":"CFT","content":"ORGANIZATION"},{"type":"Directorate of Enforcement","content":"ORGANIZATION"},{"type":"Enforcement Directorate","content":"ORGANIZATION"},{"type":"$382 million","content":"MONEY"},{"type":"$8 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Nischal Shetty","content":"PERSON"},{"type":"Zanmai Labs Pvt Ltd","content":"ORGANIZATION"},{"type":"1999","content":"DATE"},{"type":"Sameer Hanuman Mhatre","content":"PERSON"},{"type":"the Supreme Court of India","content":"ORGANIZATION"},{"type":"Shetty","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"FEMA","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"Wazirx Directors","content":"ORGANIZATION"},{"type":"$178 million","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"Reserve Bank of India","content":"ORGANIZATION"},{"type":"RBI","content":"ORGANIZATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}