{"summary":"Paxos filed for the national banking charter more than two years ago, and the stablecoin issuer may yet try again.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225442\/paxos-national-charter-application-expired","publishDate":"2023-04-07T14:41:24","id":13672,"type":null,"title":"Paxos&#x27;s application for a national banking charter expired","category":["COMPANIES"],"content":["Paxos’s dreams of a national banking charter died last week of extreme old age.","The stablecoin issuer's application for a new bank charter, originally filed in December 2020, expired on March 31, <a href=\"https:\/\/apps.occ.gov\/CAAS_CATS\/CAAS_Details.aspx?FilingTypeID=2&amp;FilingID=318305&amp;FilingSubtypeID=1093\" data-v-f87c67ca=\"\">records<\/a> from the Office of the Comptroller of the Currency show.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The development comes nearly two years after the OCC <a href=\"https:\/\/www.occ.gov\/news-issuances\/news-releases\/2021\/nr-occ-2021-49.html\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">granted<\/span><\/a> “preliminary conditional approval” of the company’s application to charter Paxos National Trust, New York. The approval allowed Paxos to split its operations between two entities, one being regulated on the national level and the other maintaining its existing regulatory structure.","The OCC gave Paxos 18 months to execute the business plan. The nod meant freedom to custody dollars and crypto alike, offer its stablecoin services across the country and run an exchange on the national level.","The now-expired application does not impact Paxos’s existing business, which is registered in New York, and the blockchain tech company could file another OCC application, a spokesperson told The Block.","\"Paxos will determine its next steps in the near term, which could include reapplying for OCC oversight,” a spokesperson said in an email.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The OCC, the bureau within the U.S. Treasury Department that charters, regulates and supervises national banks, did not respond to a request for comment.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The status of Paxos’s banking ambitions has been under scrutiny in recent months. Paxos battled <a href=\"https:\/\/www.theblock.co\/post\/210001\/paxos-attempts-to-quash-speculation-of-trouble-with-the-occ\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">rumors<\/span><\/a> in February that it had been asked to withdraw its application for a national trust bank charter by the OCC.","The company is also facing actions from state and federal regulators. The Securities and Exchange Commission sent Paxos a letter in February informing the company that the commission was investigating its joint stablecoin project with Binance, BUSD. The New York Department of Financial Services also <a href=\"https:\/\/www.theblock.co\/post\/210932\/paxos-will-no-longer-issue-binance-usd-stablecoin\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">ordered<\/span><\/a> Paxos to stop issuing BUSD. Paxos says it has stopped minting the token.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2020","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"March 31","content":"DATE"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Paxos National Trust","content":"ORGANIZATION"},{"type":"OCC","content":"ORGANIZATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"}],"hashtag":["OCC"],"authors":["Stephanie Murray","The Block"]}