{"summary":"Gemini has bought crypto custody specialist Shard X for an undisclosed sum.\nThis is Gemini’s third acquisition, after NFT marketplace Nifty Gateway and crypto credit card firm Blockrize.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107733\/gemini-acquires-crypto-custody-startup-shard-x","publishDate":"2021-06-09T07:00:14","id":1368,"type":null,"title":"Gemini acquires crypto custody startup Shard X for undisclosed sum","category":["Custody"],"content":["Crypto exchange and custodian Gemini has acquired crypto custody startup Shard X for an undisclosed sum.","Announcing the news on Wednesday, Gemini said Shard X's multi-party computation (MPC) technology would help increase the speed at which it can transfer customer assets and increase usage of assets on its platform.","\"Integrating Shard X's MPC technology into Gemini's custody enables us to meet the current demand for fast withdrawals, interacting with DeFi staking, or the transferring of digital assets with greater efficiency,\" Gemini COO Noah Perlman told The Block.","MPC is a cryptographic technology, which is said to be fast and more secure. In MPC, private keys are never constructed in full, removing a single point of failure. MPC breaks up private keys into shards or parts and distributes them between various parties to execute a transaction.","Shard X's technology, in particular, uses MPC technology on Entrust nShield hardware security modules (HSMs), and the firm <a href=\"https:\/\/shardx.io\/#\" data-v-f87c67ca=\"\">claims to provide<\/a> benefits of both these technologies, i.e., accessibility of \"hot\" or online wallets and security of \"cold\" of offline storage.","Shard X was founded in 2018 by Yaniv Neu-Ner, Nikita Lesnikov, and Navaho De Wet in London. With Gemini's acquisition, all three members, i.e., Shard X's entire headcount, will be joining Gemini's UK affiliate, Perlman told The Block.","Perlman declined to disclose the deal's financial terms, including whether this was equity, cash, or a mix of both. But he said the deal was advised by an internal strategy team that focuses on mergers and acquisitions.","This is Gemini's third acquisition, after buying NFT marketplace <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47589\/winklevoss-brothers-acquire-crypto-collectible-startup\" data-v-f87c67ca=\"\">Nifty Gateway<\/a> in 2019 and crypto credit card firm <a href=\"https:\/\/www.theblockcrypto.com\/post\/91236\/gemini-acquires-blockrize-launching-credit-card-bitcoin-btc-rewards-crypto\" data-v-f87c67ca=\"\">Blockrize<\/a> earlier this year.","Crypto deals, especially in the crypto custody space, are growing at a fast clip. Last month, Galaxy Digital agreed to buy crypto custodian <a href=\"https:\/\/www.theblockcrypto.com\/linked\/103842\/galaxy-digital-acquire-crypto-custodian-bitgo-1-2-billion\" data-v-f87c67ca=\"\">BitGo<\/a> for $1.2 billion in cash and stock, the first $1 billion deal in the crypto industry. In March, PayPal acquired crypto custody specialist <a href=\"https:\/\/www.theblockcrypto.com\/linked\/94601\/paypal-curv-acquisition-crypto\" data-v-f87c67ca=\"\">Curv.<\/a>","As for Gemini, it is looking to invest in more companies, Perlman told The Block, without disclosing areas of interest. Gemini recently launched an investment fund, which aims to back early-stage crypto projects and startups."],"hashtag":["GEMINI"]}