{"summary":"The Tatum Blockchain Accelerator will look to fill the gap between traditional accelerators and web3-native programs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213515\/blockchain-developer-web3-accelerator","publishDate":"2023-02-21T10:31:38","id":13682,"type":null,"title":"Web3 developer platform Tatum hopes its new accelerator can change the market narrative","category":["STARTUPS"],"content":["Tatum, a company that offers a framework for developers to build blockchain applications, debuted an accelerator program in partnership with deep tech incubator StartupYard.&nbsp;","The Tatum Blockchain Accelerator will look to fill the gap between traditional accelerators lacking crypto knowledge and web3 accelerators focusing too heavily on tokenization.","\"In most cases, [web3 accelerators are] focused on tokenization or if they have the proper whitepapers,\" said Tatum CEO and co-founder Jiri Kobelka, \"But what we feel is not really considered is the actual business and the value for customers.\"","Kolbelka believes that while those graduating from crypto-native accelerators often come out with great ideas on how to distribute a token, there's a lack of knowledge about the benefits and use cases of tokens for the end user.&nbsp;Tatum also hopes its accelerator can also facilitate a change in the narrative in the market, with more focus on product and customer fit.","\"You can see with a lot of founders in the web3 space, it's guys with little experience,\" Kobelka said. \" They don't know how to run a business. They have little understanding of what it means to have some financial plans.\"&nbsp;","Despite record levels of capital <a href=\"https:\/\/www.galaxy.com\/research\/insights\/2022-crypto-vc-comes-down-to-earth\/\" data-v-f87c67ca=\"\">allocated<\/a> to web3 VCs last year, crypto projects only <a href=\"https:\/\/www.theblock.pro\/research\/january-blockchain-funding-recap-209442\" data-v-f87c67ca=\"\">received<\/a> $631 million in funding last month compared to $4.3 billion in February of last year, per The Block Research.&nbsp;","Web3 accelerators such as Tatum's have begun to gather steam as venture capitalists assess the market and take more time to deploy.&nbsp;","In December, Polgon co-founder Sandeep Naiwal <a href=\"https:\/\/www.theblock.co\/post\/196492\/polygon-co-founder-launches-web3-startup-accelerator-beacon\" data-v-f87c67ca=\"\">launched<\/a> Beacon, a web3 accelerator attached to his venture capital firm Symbolic Capital.&nbsp;That followed web3 accelerator initiatives by a <a href=\"https:\/\/www.theblock.co\/post\/197641\/hong-kong-accelerator-looking-to-help-1000-web3-startups-in-next-3-years\" data-v-f87c67ca=\"\">member of the Hong Kong Legislative Council,<\/a> and even conglomerates like <a href=\"https:\/\/www.theblock.co\/post\/179577\/meta-loreal-web3-startup-accelerator\" data-v-f87c67ca=\"\">Meta<\/a> and L'Oréal. A16z is also set to<a href=\"https:\/\/twitter.com\/a16zcrypto\/status\/1625887871470284803?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\" data-v-f87c67ca=\"\"> kick off<\/a> the second iteration of its Crypto Startup School next month.&nbsp;","Backed by VCs such as Rockaway Capital and Credo Ventures, Tatum's accelerator offers a mere €40,000 convertible note for participation in the startup accelerator, with equity stakes varying depending on the stage of the startup. That's a small ticket compared to other web3 accelerators, with Outlier Ventures offering $100,000 and a16z's crypto startup school's half a million.","Kobelka was quick to note, however, that founders also receive a free Tatum license for 12 months, worth $40,000, free of charge. While the program will be less structured than a typical accelerator, there's also access to mentoring, and personalized intros to time-short investors. Also, contacts at blockchain networks and Participants can leverage Tatum's position in the market.&nbsp;","Kobelka claims that, through its product offering and the companies its serves, the firm can easily discern the latest trends and goings-on in the crypto sector — even letting participants know which chains are being used, and how, ahead of the competition.&nbsp;","The startup CEO said projects could be early stage with a working demo across any web3 subsector — \"anything which is not illegal is fine.\" Currently, there are around five projects accepted into the program with the aim of bumping that to 4o participants.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jiri Kobelka","content":"PERSON"},{"type":"Tatum","content":"LOCATION"},{"type":"Tatum","content":"PERSON"},{"type":"February of last year","content":"DATE"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"Rockaway Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Symbolic Capital","content":"ORGANIZATION"},{"type":"$631 million","content":"MONEY"},{"type":"Kobelka","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Polgon","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Tatum Blockchain Accelerator","content":"ORGANIZATION"},{"type":"Sandeep Naiwal","content":"PERSON"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Hong Kong Legislative Council","content":"ORGANIZATION"},{"type":"Crypto Startup School","content":"ORGANIZATION"},{"type":"Outlier Ventures","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"}],"hashtag":["STARTUP ACCELERATORS"],"authors":["Tom Matsuda","The Block"]}