{"summary":"Cetera has approved the use of BlackRock’s IBIT, Fidelity’s FBTC, Franklin Templeton’s EZBC and Invesco’s BTCO spot bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282792\/cetera-spot-bitcoin-etfs","publishDate":"2024-03-15T09:37:38","id":13693,"type":null,"title":"Financial advisory network Cetera approves the use of 4 spot bitcoin ETFs","category":["FUNDS"],"content":["Wealth management and financial advisory firm Cetera approved the usage of four U.S. spot bitcoin exchange-traded funds for its network of 9,000 affiliated professionals.","BlackRock’s IBIT, Fidelity’s FBTC, Franklin Templeton’s EZBC and Invesco’s BTCO were chosen due to the providers’ track record in successfully launching new product strategies, with the required resources, tools and knowledge, according to a statement from the company on Thursday.","The new policy regarding the use of the spot bitcoin ETFs in brokerage accounts includes educational resources, designed to help financial professionals to advise clients on adding the funds to their investment portfolios, with training due to begin on March 25.","“Financial advisory firms are now issuing press releases regarding use of bitcoin ETFs,” The ETF Store President Nate Geraci <a href=\"https:\/\/x.com\/NateGeraci\/status\/1768319473499435461?s=20\" data-v-f87c67ca=\"\">wrote<\/a> on X in response to the news. “In other words, attempting to use bitcoin ETFs as a point of differentiation\/competitive advantage. Things are getting wild.”","Cetera claims to be among the first wealth management firms to develop a formal bitcoin policy. It adds that “exponentially” more investors are exploring the products and looking for exposure to the cryptocurrency. Cetera estimates that approximately 50 million people own bitcoin as of February 2024.","\"As expected, we are prudently embracing bitcoin ETFs and we prioritized developing this important guidance to help our financial professionals implement these products in client portfolios,\" Cetera Head of Investment Products and Partner Solutions Matt Fries said in the statement.","“We will continue to proactively evaluate the implications of bitcoin ETFs and related products and modify our policies accordingly, and we look forward to partnering with our financial professionals to adopt bitcoin ETFs when appropriate with their clients,” Fries added.","Momentum in the adoption of the U.S. spot bitcoin ETFs is expected to see two additional “<a href=\"https:\/\/www.theblock.co\/post\/282348\/bitcoin-etfs-likely-to-see-two-massive-catalysts-by-the-end-of-the-year-says-etf-expert\" data-v-f87c67ca=\"\">massive catalysts<\/a>” by the end of the year, Bloomberg Senior ETF Analyst Eric Balchunas told The Block earlier this week.","Firstly, Balchunas suggested the bitcoin ETFs are likely to become available on large national wirehouse platforms over the next few months — which he identified as looking after between $7 trillion and $10 trillion in assets.","Balchunas said the second catalyst would be launching options trading based on the bitcoin ETFs, which he estimated would be available by September.&nbsp;","Meanwhile, spot ETF inflows <a href=\"https:\/\/www.theblock.co\/post\/282767\/spot-etf-inflows-slow-bitcoin-retreats-all-time-high\" data-v-f87c67ca=\"\">slowed<\/a> on Thursday as bitcoin retreated by more than 10% from its latest all-time high of $73,836 — leading to the <a href=\"https:\/\/www.theblock.co\/post\/282750\/bitcoin-price-falls-below-68000-volatility-causes-spike-in-long-liquidations\" data-v-f87c67ca=\"\">liquidation<\/a> of some $278 million in bitcoin positions over the past 24 hours.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-flows\/embed\" title=\"Spot Bitcoin ETF Flows\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Bloomberg Senior ETF","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"February 2024","content":"DATE"},{"type":"$7 trillion","content":"MONEY"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 25","content":"DATE"},{"type":"$10 trillion","content":"MONEY"},{"type":"Matt Fries","content":"PERSON"},{"type":"Nate Geraci","content":"PERSON"},{"type":"$73,836","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Cetera Head of Investment Products","content":"ORGANIZATION"},{"type":"Balchunas","content":"PERSON"},{"type":"$278 million","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","SPOT BITCOIN ETF"],"authors":["James Hunt","The Block"]}