{"summary":"Alongside building their own platform, Binance is also keen to drive adoption and investment in the NFT space by investing in parallel platforms. That’s why they’ve recently led the funding round for NFTb, a community owned NFT platform that is itself built on the Binance platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103645\/binance-invests-in-nftb-to-drive-nft-growth-on-bsc","publishDate":"2021-05-04T08:47:43","id":13708,"type":null,"title":"NFTb secures investment under the $100M fund set up to boost projects building on BSC","category":["SPONSORED"],"content":["Despite the hype surrounding NFTs in the last few months, many analysts believe that the NFT ecosystem is still in its infancy. NFT-related projects have seen a rapid influx of creators, artists, and investors, and platforms such as DapperLabs have attracted huge amounts of capital – $7.6 billion at the last estimate.","This is only the beginning, though. With celebrities like Mark Cuban, Lindsey Lohan and Tyga joining the NFT craze, NFTs are now appearing in the popular media. And while it would be easy to see this as just another crypto hype cycle being co-opted by celebrities, in reality it’s a sign that NFTs are about to go mainstream.","As they do so, the way in which they are bought, traded, and used is going to change. While the majority of NFT trades are currently related to sales of services, articles, and works of art, they have the potential to be used for much more. The explosive user growth in the use of NFTs is proof that the tokens can be used at scale, and that future iterations of NFT platforms could be used for digital rights management, including music or real world ownership.","The growth in the Ethereum NFT space hasn’t been unnoticed for BSC bulls. Over the last several months multiple NFT marketplaces have popped up to take advantage of this growing trend.&nbsp; As BSC users scale up many of them look for avenues to trade and collect NFTs.&nbsp;&nbsp;","The support for NFTb – both financial and from the wider community – is based on the promise that it can overcome some of the current issues that limit liquidity and inward investment into the NFT space.&nbsp;","Primarily, this issue is one of cost. As the number of crypto “users” continues to grow, these protocols and Dapps find more ways to integrate and increase in complexity. This has meant that Ethereum has become slow and expensive to the point where it prices out a large percentage of would-be network participants.","The problem with the current NFT marketplace is two fold — high fees and lack of liquidity. NFTs launched on the Ethereum blockchain are subject to high fees, long wait times and unpredictable network fluctuations. This problem will grow exponentially as artists and creators around the world begin to learn the value of NFTs, and attempt to create them on Ethereum.","The team behind NFTb believes that Binance Smart Chain provides the necessary infrastructure to build a large scale NFT platform that can overcome these issues. And that is the idea behind NFTb.","The idea is simple enough – the 100% community focused platform will allow creators to reap more rewards, both in the form of NFT appreciation as well as access to the rapidly growing BSC user base. Then, as the platform expands, it will offer the opportunity for cross chain swaps for NFTs as well as oracle and price discovery instruments.&nbsp; NFTb looks to connect cross chain NFT liquidity using BSC as the focal point.&nbsp;","In short, NFTb offers more liquidity, more capital for NFT holders, a faster ecosystem, lower fees, and lends support to the BSC ecosystem. By providing a premier NFT marketplace, it will allow users to realize high yields on NFTs and access index funds, all via a mobile app with multi language support and a world-class UI.","The goal of NFTb is to become the leading NFT marketplace in the BSC ecosystem. The team behind the platform believe that by bringing together the NFT BSC community, creators and token holders can start to build a healthy and vibrant marketplace for NFTs, and one that will be able to challenge the traditional dominance of art marketplaces.","NFTb Official Community :  <a href=\"https:\/\/t.me\/nftbcommunity\" data-v-f87c67ca=\"\">https:\/\/t.me\/nftbcommunity<\/a>","Telegram Announcements : <a href=\"https:\/\/t.me\/nftbmarket\" data-v-f87c67ca=\"\">https:\/\/t.me\/nftbmarket<\/a>","Twitter : <a href=\"https:\/\/twitter.com\/nftbmarket\" data-v-f87c67ca=\"\">https:\/\/twitter.com\/nftbmarket<\/a>"],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"$7.6 billion","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Mark Cuban","content":"PERSON"},{"type":"Lindsey Lohan","content":"PERSON"},{"type":"Dapps","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"oracle","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}