{"summary":"Derivatives exchange CME Group has seen a significant pickup of its bitcoin options contract volume over the past week, although five trades accounted for around 81% of these contracts. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/65932\/block-trades-cme-bitcoin-options-volume","publishDate":"2020-05-20T16:19:35","id":13706,"type":null,"title":"Five block trades made up 81% of CME&#x27;s recent bitcoin options contract volume","category":["THE BLOCK"],"content":["Derivatives exchange CME Group has seen a significant pickup of its bitcoin options contract volume over the past week, although five trades accounted for around 81% of these contracts.&nbsp;","From May 12 to May 19, a total of 3,059 bitcoin options contracts traded hands, marking May the most active month in CME's history of bitcoin options trading. Among them, 2,490 contracts can be attributed to five block trades, which are transactions conducted off the public exchange order book due to their large quantities.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: CME Group<\/span><\/em>","Four of the five block trades had a size of 310 contracts, while the one executed on May 19 had a size of 5 contracts. Since traders&nbsp; for all five transactions both purchased and sold the same amount of futures contracts to execute the so-called bull call spreads strategies, contract size in each trade needs to be doubled.&nbsp;","A bull call spread is a trading strategy on derivatives products that consist of both purchasing and selling call options with the same expiration date but different strike prices. In a bull market, traders can place a long call with a lower strike price and a short call with a higher strike price to profit from the spread – hence the trading strategy's name.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Source: CME Group <\/span><\/em>","It's worth noting that CME's block trade feature is only available to Eligible Contract Participants, which, as <a href=\"https:\/\/www.law.cornell.edu\/uscode\/text\/7\/1a\" data-v-f87c67ca=\"\">defined<\/a> by the Commodity Exchange Act, include financial institutions and investors with more than $10 million assets under management.&nbsp;","CME's bitcoin options product — launched at the beginning of 2020 — was constructed as options on the exchange's bitcoin futures. Although initially showing tepid performance, its trading volumes <a href=\"https:\/\/www.theblockcrypto.com\/post\/65400\/bitcoins-halving-breathes-life-into-cmes-options-product-with-new-accounts-rapidly-growing\" data-v-f87c67ca=\"\">surged drastically<\/a> in May, especially after the bitcoin halving last Monday. Open interest on the exchange jumped from $35 million on the day of halving to $174 million today, representing a staggering 397% growth, according to <a href=\"https:\/\/analytics.skew.com\/dashboard\/bitcoin-options\" data-v-f87c67ca=\"\">data compiled by Skew<\/a>.&nbsp;","<span data-v-f87c67ca=\"\">Source: Skew<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"81%","content":"PERCENT"},{"type":"$35 million","content":"MONEY"},{"type":"May 19","content":"DATE"},{"type":"Eligible Contract Participants","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$174 million","content":"MONEY"},{"type":"CME Group","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"397%","content":"PERCENT"},{"type":"2020","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"CME","content":"ORGANIZATION"},{"type":"May 12","content":"DATE"}],"hashtag":[],"authors":["Celia Wan","The Block"]}