{"summary":"Robinhood — the brokerage app company that&#x27;s been making headlines for last week&#x27;s retail stock mania – raked in nearly $700 million in payments from high-speed trading firms during 2020, according to data compiled by The Block. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93321\/robinhood-payment-for-order-flow-2020","publishDate":"2021-02-01T17:15:24","id":13705,"type":null,"title":"Robinhood made more than $600 million from payment for order flow revenue in 2020","category":["CAPITAL MARKETS"],"content":["Robinhood — the brokerage app company that's been making headlines for last week's retail stock mania – raked in nearly $700 million in payments from high-speed trading firms during 2020, according to data compiled by The Block.&nbsp;","The firm, which offers zero-commission stock trading to more than 10 million users, reported last month that it received $221.4 million in payments for its order flow during the fourth quarter, bringing the total amount of such payments made last year $675.1 million.&nbsp;","Robinhood — which makes money by offloading its customer flows to trading firms like Citadel Securities and Virtu Financial – temporarily suspended trading in certain stocks, such as GameStop, that saw their values soar on the back of social media-based boosting. On Monday, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/robinhood-raises-another-2-4-billion-from-shareholders-11612197680\" data-v-f87c67ca=\"\">reported<\/a> that the firm had raised $3.4 billion from its existing investors to shore up its platform after experiencing issues with its clearinghouse that it says forced it to halt certain buys. Additional reporting from Reuters indicates that Robinhood may take on another $1 billion in debt.","Still, these issues have been underscored by an increase in downloads for the app and an increase in PFOF payments. ","","","","PFOF payments increased by 21% between the third quarter of the year to the fourth. Payment order flow for options increased every quarter, with Q4 comprising the largest payments at $142.43 million.","","","<em data-v-f87c67ca=\"\">This report has been corrected to adjust for an error in calculation.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$675.1 million","content":"MONEY"},{"type":"Virtu Financial","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"21%","content":"PERCENT"},{"type":"$142.43 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"$3.4 billion","content":"MONEY"},{"type":"$700 million","content":"MONEY"},{"type":"fourth quarter","content":"DATE"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"$221.4 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"GameStop","content":"ORGANIZATION"}],"hashtag":["ROBINHOOD"],"authors":["Frank Chaparro","The Block"]}