{"summary":"Last year, the crypto industry lost $3.7 billion due to hacks alone. Cybersecurity startup Ironblocks raised a $7 million to solve for this problem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211917\/ironblocks-raises-7-million-to-build-blockchain-cybersecurity-platform","publishDate":"2023-02-15T08:00:54","id":13711,"type":null,"title":"Ironblocks raises $7 million to build blockchain cybersecurity platform","category":["DEALS"],"content":["Tel Aviv-based cybersecurity startup Ironblocks has raised a $7 million seed round to build a blockchain-native cybersecurity platform.","The round is co-led by Collider Ventures and Disruptive AI. Other investors include ParaFi, Samsung Next and Quantstamp, as well as angel investors such as the former chief technology officer of Coinbase Balaji Srinivasan and Simplex co-founder Nimrod Lehavi, said a company release.","The co-founders of Ironblocks, Or Dadosh and Assaf Eli, have both been involved in the decentralized finance (DeFi) space for several years including being part of the team responsible for <a href=\"https:\/\/home.bancor.network\/\" data-v-f87c67ca=\"\">creating<\/a> Bancor, which is a DeFi staking and trading protocol. While working in the space, they noticed an increase in hacks and as a result started working on Ironblocks in 2022.","Last year, the crypto industry lost $3.7 billion due to hacks alone, according to <a href=\"https:\/\/www.theblock.co\/post\/199872\/crypto-losses-in-2022-total-3-9-billion-immunefi-report-says\" data-v-f87c67ca=\"\">research<\/a> from bug bounty platform Immunefi. Ironblocks says it aims to help crypto companies and protocols mitigate these hacks and&nbsp; identify suspicious activity with an automated monitoring and detection system, Dadosh said. The detection system is already live and the company will be introducing a prevention system in the coming months, he added.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/exploits\/funds-stolen-by-defi-attackers\/embed\" title=\"Funds Stolen by DeFi Attackers\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","One of the keys to noticing is suspicious patterns within protocols is examining activity across multiple protocols or applications instead of just examining them on a case-by-case basis, Dadosh said.","\"When there is a hack, usually it combines several dapps together, it's not for a specific dapp,\" Dadosh said. \"If you look only on a specific dapp, most of the times will not be enough, you need to look [at an] overview for all the behaviour of the transaction and what the user actually tried to do.\"","The sophistication of hacks in the blockchain space are evolving, they used to be manual and now they are often happening in one specific automated transaction, which means teams need to react at a much quicker pace, Dadosh said. One of the challenges is that the security landscape is always changing, which requires teams such as Ironblocks to think outside the box and look at the bigger picture, he added.","&nbsp;“Ironblocks is harnessing artificial intelligence and years of deep native blockchain experience to disrupt the way on-chain products are done,\" said Yorai Fainmesser, general partner at Disruptive AI, in the release.","Ironblocks started fundraising at the start of 2022 and closed toward the end of the year, Dadosh said. The company to use the funds for hiring and building out the product roadmap. The team is currently around 15 people, which he hopes to double this year.","\"Our goal is actually to help as many projects and protocols that we can and to provide the best security that the market can find,\" Dadosh said. \"We saw the all-time record for money stolen by cyber theft and by attackers. The industry need to solve this problem as fast as possible.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Coinbase Balaji Srinivasan and Simplex","content":"ORGANIZATION"},{"type":"Dadosh","content":"PERSON"},{"type":"Bancor","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Assaf Eli","content":"ORGANIZATION"},{"type":"Nimrod Lehavi","content":"PERSON"},{"type":"Collider Ventures","content":"ORGANIZATION"},{"type":"Yorai Fainmesser","content":"PERSON"},{"type":"Tel Aviv","content":"LOCATION"},{"type":"$3.7 billion","content":"MONEY"},{"type":"Samsung Next","content":"ORGANIZATION"}],"hashtag":["HACKS","SECURITY FIRMS","SEED &AMP; PRE-SEED"],"authors":["Kari McMahon","The Block"]}