{"summary":"Kerrisdale Capital is short on MicroStrategy&#x27;s stock and long on spot bitcoin ETFs offered by BlackRock and Fidelity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285353\/microstrategy-trades-at-unjustifiable-premium-to-bitcoin-says-firm-shorting-companys-stock","publishDate":"2024-03-28T10:30:50","id":13718,"type":null,"title":"MicroStrategy trades at &#x27;unjustifiable premium&#x27; to bitcoin, says firm shorting company&#x27;s stock","category":["EQUITIES"],"content":["Investment firm Kerrisdale Capital has argued in a new research report that MicroStrategy's shares have become overvalued.","\"We are long bitcoin and short shares of MicroStrategy, a proxy for bitcoin which trades at an unjustifiable premium to the digital asset that drives its value,\" Kerrisdale Capital said <a href=\"https:\/\/www.kerrisdalecap.com\/wp-content\/uploads\/2024\/03\/MicroStrategy-MSTR.pdf\" data-v-f87c67ca=\"\">in the report<\/a>. \"Shares of MicroStrategy have soared amid a recent rise in the price of bitcoin but, as is often the case with crypto, things have gotten carried away.\"","In a disclaimer, Kerrisdale Capital said it holds short positions in MicroStrategy stock and will \"realize gains\" if the company's shares drop in price. Earlier this week, MicroStrategy's shares achieved <a href=\"https:\/\/www.theblock.co\/post\/284835\/microstrategy-stock-breaks-past-1860-to-reach-all-time-high\" data-v-f87c67ca=\"\">a new all-time high<\/a> Tuesday after surpassing $1,900, according to Yahoo Finance.&nbsp;","MicroStrategy didn't immediately respond to a request for comment.","<span data-v-f87c67ca=\"\">Bitcoin price action. Image: The Block Price Page.<\/span>","Part of Kerrisdale Capital's argument regarding MicroStrategy's shares centered on investors' increased access to financial instruments, which act as proxy investments for bitcoin. \"The days when MicroStrategy shares represented a rare, unique way to gain access to bitcoin are long over,\" the firm said in its report. \"Bitcoin is now easily obtainable through brokerages, crypto exchanges, and more recently low fee ETPs and ETFs.\"","In January, several spot bitcoin ETFs began trading, quickly attracting billions of dollars in fresh capital. Many are offered by top traditional financial institutions such as BlackRock and Fidelity. Since launching, the ETFs have registered well over $150 billion in cumulative trading volume.","Meanwhile, MicroStrategy has continued to pursue its strategy of stockpiling bitcoin. The company <a href=\"https:\/\/www.theblock.co\/post\/283375\/microstrategy-buys-more-bitcoin\" data-v-f87c67ca=\"\">recently announced<\/a> it held approximately 214,250 bitcoin, about 1% of cryptocurrency’s total supply.","Just before MicroStrategy began buying bitcoin, its market capitalization as a business intelligence company was a little more than $1 billion. As of Thursday, its market cap was nearly $32 billion, even though its bitcoin holdings are worth just $15 billion.&nbsp;","Kerrisdale Capital, which said it is not only short on MicroStrategy, but also long on bitcoin, disclosed that it holds long positions in both BlackRock and Fidelity's spot bitcoin ETFs, the two most popular of the new instruments in terms of inflows.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/bitcoin-etf\/spot-bitcoin-etf-flows\/embed\" title=\"Spot Bitcoin ETF Flows\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"$1,900","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"$150 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$15 billion","content":"MONEY"},{"type":"Kerrisdale Capital","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"MicroStrategy","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}