{"summary":"Ethereum research group Matter Labs has deployed its zkRollup-based Layer 2 scaling tool, called zkSync, on the Ethereum mainnet\nUsers can now deposit, transfer and withdraw tokens on zkSync ","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/68584\/matter-labs-deploys-scaling-solution-zkrollup-on-ethereum-mainnet","publishDate":"2020-06-18T10:34:10","id":1372,"type":null,"title":"Matter Labs deploys zkRollup-based scaling tool on Ethereum&#x27;s mainnet","category":["Ethereum"],"content":["<span data-v-f87c67ca=\"\">Research group Matter Labs has deployed its Layer 2 scaling tool on the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84173\/ethereum-data-startuo-funding-blocknative\" data-v-f87c67ca=\"\">Ethereum<\/a> mainnet. Based on a technology called zkRollup, the new tool, called zkSync, aims to pave the way for larger transaction volumes and less network pressure on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/87608\/ethereum-monthly-options-volume-november\" data-v-f87c67ca=\"\">Ethereum<\/a>.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">zkSync promises to achieve a maximum throughput of 2,000 transactions per second and an average transaction fee of approximately $0.001. <\/span><span data-v-f87c67ca=\"\">By comparison, the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84695\/ethereum-foundation-eth2-staking-grants\" data-v-f87c67ca=\"\">Ethereum<\/a> blockchain can currently handle an average of 15 transactions per second. And since the beginning of the year, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/84545\/tornado-cash-ethereum-privacy-pool-usd-high\" data-v-f87c67ca=\"\">Ethereum’s<\/a> average gas prices have surged from an average of 10 Gwei in January to around <a href=\"https:\/\/etherscan.io\/chart\/gasprice\" data-v-f87c67ca=\"\">40 Gwei<\/a> at press time, meaning that users need to spend, on average, around $0.2 per transaction at current ETH price.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This release [of zkSync] solves an acute problem in the Ethereum ecosystem: crypto payments have become expensive and unreliable due to soaring gas fees,\" the startup stated in a <a href=\"https:\/\/medium.com\/@herrmit\/9c634b3e6823\" data-v-f87c67ca=\"\">blog post<\/a>.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">zkSync was built on zkRollup technology, a Layer 2 scaling architecture that stores transactions in a sidechain instead of directly recording them on the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85761\/google-search-traffic-ethereum\" data-v-f87c67ca=\"\">Ethereum<\/a> base layer, which frees up network space. It then packages the state of a series of transactions into blocks to be posted on the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86538\/ethereum-miner-revenue-november\" data-v-f87c67ca=\"\">Ethereum<\/a> base chain. “Zk” refers to zero-knowledge proofs, which the scheme uses to prove the validity of the state before posting it to the base chain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"> \"zkSync can massively reduce these costs while gradually enabling VISA-scale throughput of up to 2,000 TPS,” the blog post said.<\/span>","zkSync's initial deployment on <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85216\/sec-no-action-letter-social-media-ethereum\" data-v-f87c67ca=\"\">Ethereum<\/a> was not without turbulence, however. On Wednesday, soon after the service went live, the team detected a problem with the server that award special souvenir tokens to users for trying out the platform. The team has said the bug is now fixed.","For now, the main functionality available via zkSync is token transfer. Users can connect their existing <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85267\/eth-crosses-500-ethereum-hashrate-all-time-high\" data-v-f87c67ca=\"\">Ethereum<\/a> wallets with zkSync, deposit tokens into the zkSync wallets, and send or receive tokens. It currently does not support smart contract deployment.&nbsp;","<span data-v-f87c67ca=\"\">\"We will have a toolkit for prototyping [this functionality] very soon by the end of this quarter,\" <\/span><span data-v-f87c67ca=\"\">Matter Labs CEO Alex Gluchowski told The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, another rollup inspired Layer 2 scaling approach, optimistic rollup, has also shown promise in recent <a href=\"https:\/\/www.theblockcrypto.com\/post\/63751\/defi-synthetix-optimistic-rollout-smart-contracts-demo\" data-v-f87c67ca=\"\">demos<\/a>. As the name indicates, optimistic rollup does not check the validity of every state when publishing it to the base chain. Rather, it optimistically assumes it to be correct until someone challenges this assumption.&nbsp;<\/span>","As <span data-v-f87c67ca=\"\">Gluchowski explained in a <a href=\"https:\/\/medium.com\/matter-labs\/evaluating-ethereum-l2-scaling-solutions-a-comparison-framework-b6b2f410f955\" data-v-f87c67ca=\"\">recent blog post<\/a>, d<\/span>ifferent scaling solutions have varying advantages, making it difficult to choose one over another. For example, while optimistic rollup allows developers to write and deploy smart contracts in the same way as on the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85480\/bitcoin-ethereum-open-interest-ath\" data-v-f87c67ca=\"\">Ethereum<\/a> base chain, it takes longer for users to withdraw funds from the side chain to base chain.","<span data-v-f87c67ca=\"\">“We will see very few solutions crystallizing as the winners for specific use cases,” Gluchowski said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Matter Labs is also not the only startup working on zkRollup. Recently, another scaling solution research group, Loopring, has also seen substantial growth of its zkRollup-based decentralized exchange in recent months. According to <\/span><a href=\"https:\/\/defipulse.com\/loopring\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">DeFi Pulse data,<\/span><\/a> <span data-v-f87c67ca=\"\"> its total value locked hit above $9 million last week.&nbsp;<\/span>","Faced with competition, Matter Labs hopes to gain an edge with a smooth user experience.&nbsp;","\"Everything is done in such a way as to make user experience nicer,\" Gluchowski said. \"We spent a lot effort and attention to this detail to make small things really nice for users.\""],"hashtag":["ETHEREUM"]}