{"summary":"Nasdaq historically has opted to provide technology to crypto market participants versus operating a market itself.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171095\/nasdaq-is-preparing-to-launch-an-institutional-crypto-custody-service","publishDate":"2022-09-20T07:31:14","id":13722,"type":null,"title":"Nasdaq is preparing to launch an institutional crypto custody service","category":["CAPITAL MARKETS"],"content":["Equity exchange operator Nasdaq has been plotting a move into institutional crypto custody service, according to several people briefed by the company.&nbsp;","The firm, which operates markets in U.S. and global equities, is no stranger to the cryptocurrency market, having served as a provider of market surveillance technology to cryptocurrency exchange venues since at least 2018. In February 2021, the exchange announced the debut of the Hashdex Nasdaq Crypto Index ETF, which is based on its own index.","Historically, the firm has opted to provide technology to crypto market participants versus operating a market itself to compete with the likes of Coinbase and FTX.&nbsp;","The new offering is pending regulatory approval, according to a source. Nasdaq is also establishing a new crypto-focused division in tandem with its exploration into crypto custody, Nasdaq Digital Assets.","In an announcement released after publication, Nasdaq said the unit's launch \"underpins Nasdaq’s ambition to advance and help facilitate broader institutional participation in digital assets by providing trusted and institutional-grade solutions, focused on enhanced custody, liquidity and integrity.\"&nbsp;&nbsp;","The new unit is being led Ira Auerbach, a senior vice president at the firm who joined Nasdaq from Gemini.&nbsp;","“Nasdaq Digital Assets builds upon the successful solutions we have introduced in recent years to serve the digital assets ecosystem, including marketplace technology for digital asset exchanges, crypto-native anti-financial crime offerings, and crypto-related index solutions for tradable products,” Nasdaq CEO Adena Friedman said in a press release.&nbsp;","Custody is a lucrative, yet crowded, market in the crypto space, with institutional custody providers fetching multi-billion dollar valuations. Crypto wallet and custody firm Ledger clinched a $1.5 billion valuation in June 2021, while Anchorage closed a $350 million funding round at a $3 billion valuation in December 2021.&nbsp;","<em data-v-f87c67ca=\"\">This post has been updated to include further information from Nasdaq released after publication.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"$350 million","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Anchorage","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Hashdex Nasdaq Crypto Index ETF","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Adena Friedman","content":"PERSON"},{"type":"Ira Auerbach","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"Nasdaq Digital Assets","content":"ORGANIZATION"},{"type":"February 2021","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}