{"summary":"The company has no plans for further acquisitions in the space but sees the potential for &quot;new monetization strategies&quot; for bitcoin miners.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/214027\/luxor-buys-ordinalhub-as-it-looks-for-new-monetization-strategies","publishDate":"2023-02-22T13:06:46","id":13721,"type":null,"title":"Luxor buys OrdinalHub as it looks for &#x27;new monetization strategies&#x27;","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin mining firm Luxor acquired OrdinalHub, a platform for trading the <a href=\"https:\/\/www.theblock.co\/post\/207086\/what-are-bitcoin-nfts-ordinals-and-how-do-they-work\" data-v-f87c67ca=\"\">Bitcoin-based NFTs<\/a> that have recently surged in popularity.","The company said it is looking to be a \"central player\" in the \"burgeoning movement,” also pointing out that the nascent market still lacks \"robust, enterprise-grade solutions for indexing collections, escrowing trades, and facilitating price discovery.\"","\"Minting and trading for all of these collections take place OTC on disparate Discord servers, making it difficult for collectors and creators to keep track of all of the projects in this fast moving sector,\" the company said in a statement. \"OrdinalHub will tackle these issues by providing a central hub for the Ordinal community.\"","Luxor has no plans to make additional acquisitions in the ordinals space beyond OrdinalHub, COO Ethan Vera told The Block. The two will continue operating as separate brands.","Critics of ordinals have said it's not the best used for the blockchain, and some have been skeptical of how long the hype will last. <a href=\"https:\/\/dune.com\/queries\/1989295\/3289314\" data-v-f87c67ca=\"\">Data from Dune Analytics<\/a> show ordinals hitting a peak in fees spent on Feb. 15 (at $170,579) and then falling back down since.&nbsp;","\"It’s hard to predict what will happen with inscriptions moving forward,\" Vera said. \"So far inscriptions have mainly been focused on art, but that use case might expand.\"","Luxor recently <a href=\"https:\/\/www.theblock.co\/post\/207986\/luxor-mines-largest-bitcoin-block-ever-contains-taproot-wizard-nft\" data-v-f87c67ca=\"\">mined the largest ever Bitcoin block<\/a> at 3.96 MB which contained an NFT based on the original \"magic internet money\" that cost $209 in transaction fees.","\"Ordinals have opened the door for exciting new monetization strategies for Bitcoin miners. There are natural synergies between Luxor’s mining pool and OrdinalHub, synergies that will uniquely position Luxor to build critical infrastructure for the industry to foster growth,\" said Luxor CEO Nick Hansen.","The firm has been gradually expanding its product offering in bitcoin mining, launching an <a href=\"https:\/\/www.theblock.co\/post\/206741\/luxor-launches-auction-style-platform-for-mining-machines\" data-v-f87c67ca=\"\">auction-style platform<\/a> for mining machines earlier this month and a <a href=\"https:\/\/www.theblock.co\/post\/175588\/luxor-launches-derivatives-product-based-on-bitcoin-mining-revenue\" data-v-f87c67ca=\"\">derivatives product<\/a> based on bitcoin mining revenue back in October.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$170,579","content":"MONEY"},{"type":"Ethan Vera","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Feb. 15","content":"DATE"},{"type":"$209","content":"MONEY"},{"type":"Vera","content":"PERSON"},{"type":"OrdinalHub","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Nick Hansen","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}