{"summary":"The supply of USDC shrank by 5% while the supply of DAI shot up, increasing to 6.3 billion from 5.1 billion since March 10.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219638\/makerdao-looks-to-limit-volatility-after-usdc-troubles-pushed-some-users-to-dai","publishDate":"2023-03-14T11:17:02","id":13733,"type":null,"title":"MakerDAO looks to limit volatility after USDC troubles pushed some users to DAI","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">MakerDAO, which manages the \"decentralized\" dai stablecoin, <a href=\"https:\/\/twitter.com\/MakerDAO\/status\/1635329593384083477\" data-v-f87c67ca=\"\">launched<\/a> an emergency proposal to reduce the amount of DAI that can be minted with other centralized stablecoins after concerns over Circle's exposure to the shuttered Silicon Valley Bank pushed users away from USDC and into competing assets.<\/span>","<span data-v-f87c67ca=\"\">On Friday, Circle disclosed that $3.3 billion of its $40 billion in reserves remained stuck at Silicon Valley Bank, which was shut down last week by regulators. Its USDC stablecoin plunged from its intend<\/span>ed dollar peg to $0.87, causing a massive outflow that pushed up demand for DAI.","<span data-v-f87c67ca=\"\">The supply of USDC shrank by 5%, <\/span><a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/usdc-supply-by-blockchain\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">decreasing<\/span><\/a><span data-v-f87c67ca=\"\"> to 38.6 billion on March 13 from 41 billion on March 10 when SVB was shut. The supply of DAI <\/span><a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-crypto-backed-and-algorithmic-stablecoin-supply\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">shot up<\/span><\/a><span data-v-f87c67ca=\"\"> to 6.3 billion on March 13 from 5.1 billion over the same period, according to on-chain data aggregated by The Block.<\/span>","<span data-v-f87c67ca=\"\">The surge in DAI supply was largely attributed to USDC holders minting more DAI, as USDC is one of the most popular assets that MakerDAO users can lock as collateral to mint DAI in a 1:1 ratio using what is called a Peg Stability Module (PSM). In fact, USDC currently comprises more than 50% of DAI's collateral reserves, along with other crypto and real-world assets, according to <a href=\"https:\/\/defillama.com\/protocol\/makerdao\" data-v-f87c67ca=\"\">data<\/a> from DeFi Llama.<\/span>","<span data-v-f87c67ca=\"\">The use of the Peg Stability Module (PSM) intensified when USDC temporarily lost its peg, prompting investors to flock to mint DAI, likely in an effort to diversify their stablecoin holdings. Analysts suggest that USDC holders would have wanted to jump ship during the market panic that ensued over the weekend, with DAI's diversified basket of assets backing its stablecoin seen as a safer alternative to USDC.<\/span>","<span data-v-f87c67ca=\"\">\"It is likely that USDC holders wanted out of their positions given the initial lack of clarity over how much money was stuck on SVB and then the subsequent depegging,\" noted Rebecca Stevens, a research analyst at The Block. \"Minting DAI with USDC gave users a way to convert into another stablecoin.\"<\/span>","<span data-v-f87c67ca=\"\">Despite the instability in the stablecoin market, both USDC and DAI currently trade at a dollar peg, with investor fears allayed when the U.S. government stepped in to assure all SVB depositors would be made whole.<\/span>","<span data-v-f87c67ca=\"\">MakerDAO's proposed solution is an emergency switch that would reduce the amount of DAI minted using Peg Stability Module (PSM) swaps and would prevent DAI from being severely impacted by USDC price fluctuations.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-crypto-backed-and-algorithmic-stablecoin-supply\/embed\" title=\"Total Crypto-backed and Algorithmic Stablecoin Supply on Ethereum\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Rebecca Stevens","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"$3.3 billion","content":"MONEY"},{"type":"DAI","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"March 10","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"$0.87","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"},{"type":"41 billion","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}