{"summary":"Fireblocks has made its first acquisition, buying out First Digital Assets Group (First DAG), a crypto payments processor.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/134423\/fireblocks-acquires-first-dag-crypto-stablecoins-payments","publishDate":"2022-02-16T07:00:23","id":13730,"type":null,"title":"Fireblocks acquires First DAG in cash-and-stock deal","category":["MERGERS & ACQUISITIONS"],"content":["Crypto custodian Fireblocks has made its first acquisition. It has bought out First Digital Assets Group (First DAG), an Israel-based crypto payments processor.","The terms of the deal weren't disclosed, but Fireblocks co-founder and CEO Michael Shaulov told The Block that the company used both cash and equity to fund the acquisition. First DAG was founded in 2017 and has <a href=\"https:\/\/www.linkedin.com\/company\/firstdag\/about\/\" data-v-f87c67ca=\"\">raised<\/a> $21 million in total funding to date. It was valued between $88 million and $132 million in 2018, according to Dealroom <a href=\"https:\/\/app.dealroom.co\/companies\/firstdag\" data-v-f87c67ca=\"\">estimates<\/a>.","First DAG is building a crypto payments platform to help merchants accept stablecoins. The platform, to be launched this spring, will now help Fireblocks enable stablecoin payouts and B2B payments with stablecoins for its institutional clients, said Shaulov.","Fireblocks is already familiar with First DAG. The two companies <a href=\"https:\/\/www.theblockcrypto.com\/post\/95008\/diem-merchants-solution-stablecoin-first-fireblocks\" data-v-f87c67ca=\"\">first partnered<\/a> last year to launch the Diem stablecoin payment gateway for financial institutions, allowing merchants to easily connect with the Diem blockchain network. But the Diem Association shut down earlier this month due to regulatory pressure and sold its assets to Silvergate Bank for $200 million. It is likely that First DAG will support Diem whenever it launches as the stablecoin is still listed on its website.","As part of the deal, First DAG's platform will be merged and fully integrated into Fireblocks, said Shaulov. He added that First DAG will be a new business unit of Fireblocks focused on payments. All 16 employees of First DAG will also join Fireblocks, taking the latter's total headcount to 343, said Shaulov.","Consulting firms KPMG and EY and Israel's largest law firm Meitar served as banking and legal advisors for the deal, said Shaulov.","The acquisition comes two weeks after Fireblocks <a href=\"https:\/\/www.theblockcrypto.com\/post\/131952\/fireblocks-raises-550-million-in-series-e-funding-now-valued-at-8-billion\" data-v-f87c67ca=\"\">raised<\/a> $550 million in a Series E funding round at an $8 billion valuation. Shaulov said the company plans to acquire more crypto startups but declined to share in which areas of the sector.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"First Digital Assets Group (First DAG","content":"ORGANIZATION"},{"type":"$88 million","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Michael Shaulov","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$550 million","content":"MONEY"},{"type":"$21 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Shaulov","content":"PERSON"},{"type":"Fireblocks","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"First DAG","content":"ORGANIZATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"$132 million","content":"MONEY"},{"type":"Diem Association","content":"ORGANIZATION"},{"type":"Crypto custodian Fireblocks","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"$8 billion","content":"MONEY"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}