{"summary":"Ethereum-based decentralized exchanges witnessed a significant surge in trading activity last week as memecoins gained traction among crypto enthusiasts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228099\/ethereum-dex-nft-traders-memecoins","publishDate":"2023-04-25T11:09:14","id":13731,"type":null,"title":"Ethereum DEXs attract most traders since 2021 as memecoins go wild","category":["DEFI"],"content":["Ethereum-based decentralized exchanges witnessed a significant surge in trading activity last week as memecoins gained traction among crypto enthusiasts.","On April 19, the number unique traders on Ethereum DEXs hit 72,000 — a level not seen since the end of 2021 — according to data from The Block Pro Dashboard.&nbsp;","<span data-v-f87c67ca=\"\">Unique traders on Ethereum-based DEXs spiked to highs not seen since 2021. Source: The Block Pro<\/span>","Memecoins have been enjoying a mini boom recently. The <a href=\"https:\/\/www.theblock.co\/post\/226817\/pepe-memecoin-rally\" data-v-f87c67ca=\"\">\"Pepe the Frog\"-themed token pepe<\/a>, for example, saw an extraordinary surge short-term, <a href=\"https:\/\/www.theblock.co\/post\/226817\/pepe-memecoin-rally\" data-v-f87c67ca=\"\">skyrocketing<\/a> by over 266 times in just four days. The team behind the coin seemed to have enticed users to forsake popular dog-themed tokens like dogecoin and shiba inu in favor of the popular internet frog meme.","\"A spectacular price increase made people rush into memecoins like pepe, wojak and <a href=\"https:\/\/www.coingecko.com\/en\/coins\/chad-coin\" data-v-f87c67ca=\"\">chad<\/a> — all having a daily volume of $10 million to $100 million,\" said Simon Cousaert, director of data at The Block.","The prices of said memecoins have severely decreased since then, creating a feast for MEV bots. Short for Maximal Extractable Value, MEV is a technique that involves manipulating transaction sequencing to capitalize on profitable on-chain trades — such as arbitrage and re-ordering of transactions. \"The activity of inexperienced traders caused hugely profitable opportunities for MEV bots,\" Cousaert said.","As The Block reported last week, an <a href=\"https:\/\/www.theblock.co\/post\/227110\/mev-trading-bot-memecoins-subway\" data-v-f87c67ca=\"\">MEV trading bot operator who goes by \"jaredfromsubway\" spent<\/a> over $1.1 million on Ethereum network fees and earned about $700,000 in profits front-running tokens and memecoins.","The increased DEX trading activity also led to a surge in Ethereum gas fees to around 73 gwei on April 19, now down to about 43 gwei. (A gwei is one-billionth of one ETH.)","<span data-v-f87c67ca=\"\">The median gas price on Ethereum also surged last week. Source: theblock.pro<\/span>","While traders on Ethereum DEXs surged last week, the number of NFT traders has declined to lows not experienced since July 2021.","\"Generally, the NFT market has slowed down. Floor prices are dropping. <a href=\"https:\/\/www.theblock.co\/post\/227573\/starbucks-nft-first-store-collection-fails\" data-v-f87c67ca=\"\">Starbucks didn’t sell out its latest collection<\/a>. The hype around Blur seems to be dying down a little. And, also, gas prices were high, which may deter people from trading,\" Rebecca Stevens, a data research analyst at The Block explained.","<span data-v-f87c67ca=\"\">The total number of Ethereum NFT traders has been in steady decline. Source: The Block Pro<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"Rebecca Stevens","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 19","content":"DATE"},{"type":"Simon Cousaert","content":"PERSON"},{"type":"DEX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"The Block Pro Dashboard","content":"ORGANIZATION"},{"type":"$1.1 million","content":"MONEY"},{"type":"Cousaert","content":"PERSON"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"July 2021","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Maximal Extractable Value","content":"ORGANIZATION"},{"type":"$700,000","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["CRYPTO MOVERS","DEXS","ETHEREUM"],"authors":["Yogita Khatri","Adam James","The Block"]}