{"summary":"Tether says a loan taken by struggling crypto firm Celsius has been liquidated and no losses were suffered.\nTether described its investment in Celsius as being a “minimal part of its shareholder equity.”","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156572\/tether-says-it-liquidated-celsius-loan-without-incurring-any-loss","publishDate":"2022-07-08T10:44:00","id":1373,"type":null,"title":"Tether says it liquidated Celsius loan without incurring any loss","category":["Lending"],"content":["Tether, the company behind the biggest crypto stablecoin, <a href=\"https:\/\/tether.to\/en\/tether-discloses-celsius-loan-liquidation-process\/\" data-v-f87c67ca=\"\">announced<\/a> on Friday that it had liquidated a loan to <a href=\"https:\/\/www.theblock.co\/post\/155647\/crypto-lender-celsius-dismisses-a-quarter-of-its-employees-calcalist\" data-v-f87c67ca=\"\">embattled crypto lender Celsius<\/a> without incurring any losses.","Today’s announcement followed last month's <a href=\"https:\/\/tether.to\/en\/tether-condemns-false-rumours-about-its-commercial-paper-holdings\/\" data-v-f87c67ca=\"\">declaration<\/a> that it did not have any exposure to Celsius, \"apart from a small investment made out of Tether equity in the company.\"&nbsp;Tether said it issued a bitcoin-denominated loan to Celsius that was overcollateralized to the tune of about 130%.","The issuer of the tether stablecoin (USDT) said the Celsius loan has since been liquidated, based on the terms of the agreement with the crypto platform. According to Tether, this liquidation was done in such a way as to have minimal impact on the market.","“Tether returned the remaining part to Celsius as per its agreement. Celsius position has been liquidated with no losses to Tether,” the announcement stated.","Celsius has been fighting for survival since freezing all withdrawals on June 12, citing \"extreme market conditions.\" Clients' funds have remained stuck ever since. Celsius claimed 1.7 million customers and around $12 billion in assets under management in May.","Tether also said its investment in Celsius represented a “minimal part of its shareholder’s equity” and had no impact on its reserves or stability. The company has been <a href=\"https:\/\/www.theblock.co\/post\/152131\/tether-hits-out-at-reserves-rumors-and-distances-itself-from-celsius\" data-v-f87c67ca=\"\">dealing with fears<\/a> about the state of its reserves stemming from exposure to bad corporate debt in the form of Chinese commercial paper and loans to embattled crypto lenders like Celsius.","The firm’s most recent transparency report showed a 17% decrease in commercial paper holdings while also upping the proportion of US Treasury bills in its reserve. This reserve is used to back the company’s stablecoin assets, of which USDT is the most popular.","<em data-v-f87c67ca=\"\">Correction: updates description of tether's investment in Celsius in the sixth paragraph.&nbsp;<\/em>"],"hashtag":["TETHER"]}