{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/10844\/coinbases-terms-of-service-compels-arbitration","publishDate":"2019-02-09T13:00:04","id":1373,"type":null,"title":"Coinbase&#x27;s terms of service compels arbitration","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Sultan v. Coinbase, E.D.N.Y., 18–934, 1\/24\/19. [SDP]<\/strong><\/em>","You know those “accept” or “agree” buttons you click on websites and agree to terms of service that you’ve never actually read? Are they actually enforceable? Ask a lawyer and you will probably get “it depends.” (Facts and circumstances, the terms at issue, jurisdiction, etc etc yada yada lawyer hedging). We’ve talked about these so-called clickwrap agreements in prior CCM’s, and this case particular case involves the enforceability of an arbitration clause in Coinbase’s click wrap terms of service.","The plaintiff sued Coinbase, alleging that it “negligently failed to prevent a scam that allowed a third party to steal more than $200,000 from his account. Coinbase moved to compel arbitration pursuant to a mandatory arbitration clause in its user agreement.”","When Plaintiff signed up on the website he checked a box that included next to it the statement “I certify that I am 18 years of age or older, and I agree to the User Agreement and Privacy Policy.” User Agreement and Privacy Policy were underlined and links that connected to the referenced docs. The User Agreement had an arbitration clause with bold-font words in it.","The Court said that the “explicit acceptance here” was a clear signal that use of the site would be subject to the referenced terms and “an even stronger prompt to a reasonably prudent user to click on the link to see what those terms and conditions were before agreeing.” Thus, the plaintiff was on “inquiry notice” of the terms. Although he didn’t remember clicking the “I certify etc” box, the website layout was clear enough to give him notice that his use was conditioned on acceptance of the User Agreement, with its arbitration clause.","From a design standpoint, the case is instructive because it describes layout that in the Court’s view makes acceptance of the terms as a condition of creating an account easier to understand: \"The account creation screen contains only five fields and two checkboxes.\" As in Meyer [a similar case], the \"entire screen is visible at once,\" id., with a minimalist layout and no distractions. The request to accept the user agreement and privacy policy appears to be in a slightly smaller font than other text on the screen, but it is immediately above the “Create Account” button and “provided simultaneously to enrollment.” Furthermore, account creation required explicit acceptance of the terms by clicking the checkbox.","In short, the case was stayed, and arbitration compelled. (As a closing aside: whether arbitration is better or worse is a matter of opinion. In some cases, plaintiffs who have weaker arguments can actually do better in private arbitration. So this is not necessarily a loss for the plaintiff in the long run. It … depends : )","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Meyer","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Sultan v. Coinbase","content":"PERSON"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":["COINBASE"],"authors":["Stephen D. Palley","The Block"]}