{"summary":"Cross River Bank did not admit or deny that it has engaged in what the FDIC called &quot;unsafe or unsound&quot; practices.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228835\/cross-river-bank-fdic","publishDate":"2023-04-28T15:17:18","id":13735,"type":null,"title":"Crypto-friendly Cross River Bank faces FDIC scrutiny over &#x27;unsafe&#x27; practices ","category":["POLICY"],"content":["The Federal Deposit Insurance Corporation issued a consent order to crypto-friendly Cross River Bank regarding “unsafe or unsound banking practices.”","Cross River Bank is a <a href=\"https:\/\/www.theblock.co\/linked\/139912\/cross-river-bank-announces-620-million-funding-round-led-by-eldridge-and-a16z\" data-v-f87c67ca=\"\">venture-backed<\/a> New Jersey regional bank that does business with major crypto firms like Coinbase and <a href=\"https:\/\/twitter.com\/i\/web\/status\/1635114973830725633\" data-v-f87c67ca=\"\">Circle<\/a>.","“The FDIC considered the matter and determined, and the bank neither admits or denies, that it engaged in the unsafe or unsound banking practices related to its compliance with applicable fair lending laws and regulations by failing to establish and maintain internal controls, information systems, and prudent credit underwriting practices,” the 34-page consent order said.","The FDIC supplies insurance for depositors in American commercial banks and savings banks. A spokesperson did not comment but directed The Block to the consent order which was issued on March 8 and made public Friday.&nbsp;","A Cross River Bank spokesperson said the order is \"the result of a standard review\" pertaining to aspects of the bank's lending processes two years ago.&nbsp;","\"We had identified areas for improvement prior to the examination and the examination identified others. Since that time, we proactively made significant enhancements to our fair lending and other programs including investing in technology and personnel. At this time many of the enhancements have been completed or will be completed in the coming months,\" the spokesperson said in a statement to The Block.","The bank is \"dedicated to partnering with the fintech community\" and called itself \"a model for transparent, compliant, fair and responsible lending.\"","\"Importantly, the order does not identify discriminatory practices or anything that would require Cross River to compensate consumers for harm. Further, it places no limitations on our extensive existing Fintech Partnerships or the credit products we presently offer in partnership with them. We don’t expect that the order will have any meaningful impact our growth trajectory,\" the spokesperson said.&nbsp;","The order calls on the bank’s board to increase its supervision and direction of management and take “corrective action” to remedy any unsafe practices and prevent future violations. The bank is also asked to review its information systems, identify new credit products and submit a list of third parties offering them, among other tasks.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Cross River Bank is required to compile written progress reports on actions taken to “secure compliance” with the order.&nbsp;","Gilles Gade, the founder, chair and CEO of Cross River Bank, acknowledged this week that his institution is facing regulatory scrutiny after the collapse of Silicon Valley Bank.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> He made the comments in a <a href=\"https:\/\/www.crossriver.com\/newsroom\/q1-message-from-gilles\" data-v-f87c67ca=\"\">\"Q1 Message\" blog post<\/a> which did not mention the FDIC consent order.<\/span>","<i data-v-f87c67ca=\"\">“<\/i>Regulatory scrutiny on banks in general is increasing and the events with SVB will only expand those efforts with a specific focus on banks that support fintech. Cross River is the largest of these banking institutions and as such, we have regulatory examiners reviewing some elements of our business on a continuous basis,” Gade wrote in the <span class=\"s2\" data-v-f87c67ca=\"\">blog post<\/span> published on Thursday.","“We view our compliance capability as a strategic advantage and are proud to lead our industry in maintaining the highest levels of compliance, transparency, and responsibility,\" he continued.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cross River","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"Gilles Gade","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Cross River Bank spokesperson","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Fintech Partnerships","content":"ORGANIZATION"},{"type":"SVB","content":"ORGANIZATION"},{"type":"Cross River Bank","content":"LOCATION"},{"type":"March 8","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Gade","content":"PERSON"},{"type":"Cross River Bank","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}