{"summary":"The DOJ is attempting to block withdrawals for Celsius customers until the independent examiner completes her investigation.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174119\/justice-department-seeks-to-block-withdrawal-motion-in-celsius-case","publishDate":"2022-09-30T14:48:42","id":13737,"type":null,"title":"Justice Department seeks to block withdrawal motion in Celsius case","category":["LEGAL"],"content":["The representative for the Department of Justice in the Celsius bankruptcy case is looking to block the firm's attempt to reopen withdrawals for certain customers until after an independent investigation is completed.","Celsius <a href=\"https:\/\/www.theblock.co\/amp\/post\/167214\/celsius-seeks-to-reopen-withdrawals-for-certain-customers\" data-v-f87c67ca=\"\">filed a motion<\/a> to return funds to customers in the custody and withhold accounts program at the start of this month. The U.S. Trustee objected to that motion today, saying \"the motions are premature and should be denied until after the Examiner Report is filed.\"","\"The facts necessary to evaluate these Motions are the exact facts identified by the Examiner Motion as lacking transparency and that the Examiner is required to investigate and analyze in the Examiner’s Report,\" the objection argues. \"Any distribution or sale at this juncture could inadvertently impact or limit distributions to other creditors in this case.\"","According to the U.S. Trustee, Celsius is \"impulsively\" attempting to reopen withdrawals for one group of creditors while the court has yet to gain comprehensive insight into the company's crypto holdings and the relationship between their crypto balance sheet and crypto deposited by creditors.&nbsp;","\"Parties cannot evaluate if the Debtors should be making distributions or sales until it is clear how many creditors the Debtors have, what the Debtors owe, to whom, what the Debtors assets are, and how its crypto assets are held,\" the objection says.","Prior to any distribution the U.S. Trustee wants more information on the storage and possible commingling of accounts related to Celsius' crypto holdings, and why there was a change in account offerings for some customers in April of this year.","The court <a href=\"https:\/\/www.theblock.co\/post\/173850\/court-appoints-examiner-in-celsius-bankruptcy-case\" data-v-f87c67ca=\"\">appointed<\/a> Shoba Pillay as independent examiner yesterday, a rare measure in bankruptcy cases. Pillay is tasked with producing an independent report giving insight into Celsius' finances in the lead-up to its collapse – insight the U.S. Trustee and state regulators have said Celsius failed to provide.&nbsp;","Celsius' next hearing is slated for Thursday, Oct. 6.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Oct. 6","content":"DATE"},{"type":"Examiner","content":"ORGANIZATION"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Examiner Motion","content":"ORGANIZATION"},{"type":"Shoba Pillay","content":"PERSON"},{"type":"U.S. Trustee","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}