{"summary":"Crypto analytics firm Chainalysis acquired blockchain data and infrastructure company Transpose for an undisclosed sum.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232535\/chainalysis-acquires-real-time-crypto-data-company-transpose","publishDate":"2023-05-30T09:33:58","id":13736,"type":null,"title":"Chainalysis acquires real-time crypto data company Transpose","category":["COMPANIES"],"content":["Crypto analytics firm Chainalysis <a href=\"https:\/\/blog.chainalysis.com\/reports\/chainalysis-transpose-announcement\/\" data-v-f87c67ca=\"\">acquired<\/a> Transpose, a blockchain data and infrastructure company, for an undisclosed sum.","Transpose provides access to real-time blockchain data, including swaps on decentralized exchanges and NFT sales, using APIs. It supports seven blockchain networks, including Ethereum as well as newer Layer 2 networks like Scroll and Arbitrum.","The New York-based company claims to work with crypto firms like blockchain infrastructure provider Chainstack. Its team comprises individuals who have previously worked at companies like Morgan Stanley, Tesla and Jump Crypto.","Chainalysis said that Transpose will help it meet the demand for companies that want to build complicated data systems that lean on fast and dependable APIs for current and historical blockchain data.","Chainalysis is known for blockchain analysis tools used by crypto exchanges looking to stay compliant and regulators trying to keep an eye on the crypto industry.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Tesla","content":"LOCATION"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Transpose","content":"ORGANIZATION"}],"hashtag":[],"authors":["Tim Copeland","The Block"]}