{"summary":"Credit Kudos becomes the latest European open banking startup to be snapped up by a US acquirer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/138898\/apple-acquires-uk-open-banking-startup-credit-kudos","publishDate":"2022-03-23T05:43:37","id":13745,"type":null,"title":"Apple acquires UK open banking startup Credit Kudos","category":["FINTECH"],"content":["Credit Kudos, a UK open banking startup that helps lenders make better decisions, has been acquired by US tech giant Apple.","The deal closed earlier this week, according to three people close to the deal. One source said it valued the startup at about $150 million, a significant uplift in valuation.&nbsp;A link labeled 'Website Terms of Use' on the Credit Kudos website currently leads to <a href=\"https:\/\/www.apple.com\/legal\/internet-services\/terms\/site.html\" data-v-f87c67ca=\"\">a page<\/a> outlining Apple’s terms of use. Both Credit Kudos and Apple were contacted for comment but did not respond by press time.","Credit Kudos last raised money at the height of the Covid-19 pandemic in April 2020, <a href=\"https:\/\/techcrunch.com\/2020\/04\/15\/credit-kudos\/\" data-v-f87c67ca=\"\">bagging £5 million<\/a> (roughly $6.5 million) in a round led by AlbionVC. Triple Point, Plug and Play Ventures, Ascension Ventures’ Fair by Design fund, Entrepreneur First and a number of angel backers also invested.","The startup offers insights and scores on loan applicants drawn from bank data — specifically transaction and loan outcome data — sourced via the UK’s open banking framework. Its API can offer lenders faster decision-making, less risk, and increased acceptance rates, according to its website.","Launched in 2015 by founders Freddy Kelly and Matt Schofield, Credit Kudos becomes the latest in a string of big European open banking acquisitions in the past year — albeit the first to be snapped up by a tech giant.","Up to now, card network operators Mastercard and Visa have been driving consolidation in the sector. In June 2021, Visa <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109441\/visa-acquire-european-open-banking-tink\" data-v-f87c67ca=\"\">paid €1.8 billion<\/a> (roughly $2.15 billion at the time) for Swedish open banking firm Tink — an acquisition that was finalized earlier this month. In September, Mastercard announced <a href=\"https:\/\/www.mastercard.com\/news\/press\/2021\/september\/mastercard-expands-open-banking-reach-with-acquisition-of-aiia\/\" data-v-f87c67ca=\"\">the acquisition of<\/a> Aiia, a Danish open banking startup.","It is not yet clear what Apple has planned for Credit Kudos. The Silicon Valley-based company currently offers financial products primarily through its mobile wallet Apple Pay, and in the form of a credit card that it began <a href=\"https:\/\/www.apple.com\/newsroom\/2019\/08\/apple-card-launches-today-for-all-us-customers\/\" data-v-f87c67ca=\"\">rolling out<\/a> in August 2019.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"Ascension Ventures","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"June 2021","content":"DATE"},{"type":"April 2020","content":"DATE"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"Freddy Kelly","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Matt Schofield","content":"PERSON"},{"type":"$2.15 billion","content":"MONEY"},{"type":"Covid","content":"PERSON"},{"type":"$6.5 million","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Aiia","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"August 2019","content":"DATE"},{"type":"$150 million","content":"MONEY"}],"hashtag":[],"authors":["Ryan Weeks","Andrew Rummer","The Block"]}