{"summary":"Magnate Finance, a lending project operating on Ethereum Layer 2 network Base, has seemingly made off with an estimated $6.4 million. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247375\/magnate-finance-rug","publishDate":"2023-08-25T05:13:58","id":13742,"type":null,"title":"Magnate Finance disappears with over $6 million in apparent &#x27;rug pull&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Magnate Finance, a lending project operating on Ethereum Layer 2 network Base, has seemingly carried out an exit scam — making off with an estimated $6.4 million.&nbsp;","Security firm <a href=\"https:\/\/twitter.com\/peckshield\/status\/1694947367030800601?s=46&amp;t=yoL7WJcO9vZ3TjSE2j6FRQ\" data-v-f87c67ca=\"\">PeckShield described the event as a rug pull<\/a>&nbsp;— a term used to refer to crypto developers fraudulently running away with user-deposited funds.&nbsp;It found that Magnate Finance had manually modified the price oracle used by the lending protocol to drain all of the user deposits.","The team has effectively cleared out all of its digital presence. Its social media accounts on platforms such as Twitter and Telegram have been deleted, and the official website is currently unreachable.","The exit scam came to light after <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1694914871165345997?t=Cb9W5zUPYIvAsQcpk0rfog&amp;s=19\" data-v-f87c67ca=\"\">a warning by on-chain analyst ZachXBT<\/a> earlier today. The sleuth had cautioned that Magnate Finance on Base could likely carry out an exit scam. They arrived at this conclusion after discovering that Magnate Finance's deployer address was directly linked to a previous exit scam involving a project called Solfire, where $4.8 million was defrauded.","August has been a troubling month for Base. This incident marks the second rug pull seen this month. Earlier in August, <a href=\"https:\/\/www.theblock.co\/post\/245636\/swirllend-rugpull-base-linea\" data-v-f87c67ca=\"\">SwirlLend disappeared with $460,000<\/a> in an exit scam executed on Base — with some funds also stolen on Linea.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Magnate Finance","content":"ORGANIZATION"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"Linea","content":"LOCATION"},{"type":"$6.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$4.8 million","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"$460,000","content":"MONEY"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}