{"summary":"Tether announced on Friday that USD Tether was natively available on Polkadot.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172633\/tethers-usdt-stablecoin-goes-live-on-polkadot","publishDate":"2022-09-24T09:16:44","id":13751,"type":null,"title":"Tether&#x27;s USDT stablecoin goes live on Polkadot","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">Tether Limited has launched its USD Tether (USDT) stablecoin on Polkadot, an interoperable network connecting several proof-of-stake blockchains. <\/span><span data-v-f87c67ca=\"\">Tether <\/span><span data-v-f87c67ca=\"\"><a href=\"https:\/\/tether.to\/en\/tether-tokens-usdt-live-on-polkadot\/\" data-v-f87c67ca=\"\">announced<\/a> on Friday that the stablecoin was now natively available on <a href=\"https:\/\/www.theblock.co\/post\/100614\/tether-usdt-stablecoin-polkadot-kusama\" data-v-f87c67ca=\"\">Polkadot.<\/a> <\/span>","<span data-v-f87c67ca=\"\">USDT is the largest U.S. dollar-based stablecoin, with market capitalization of nearly $67.5 billion, according to <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\" data-v-f87c67ca=\"\">data<\/a> from The Block. Tether maintains the value of the centralized stablecoin using a basket of assets and cash reserves.<\/span>","<span data-v-f87c67ca=\"\">With the latest announcement, Tether has further expanded its position as a stablecoin available across different blockchains. Besides Polkadot, the stablecoin is supported on other networks, including Ethereum, Solana, Algorand, EOS, Liquid Network, Omni, Tron, and Bitcoin Cash’s Standard Ledger Protocol.<\/span>","<span data-v-f87c67ca=\"\">“We’re delighted to launch USDT on Polkadot, offering its community access to the most liquid, stable, and trusted stablecoin in the digital token space,” said Paolo Ardoino, chief technology officer at Tether. “Polkadot is on a trajectory of growth and evolution this year and we believe Tether's addition will be essential in helping it continue to thrive.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The launch will let developers integrate the asset in decentralized finance (DeFi) applications across parachains — modular blockchains that run in parallel across the Polkadot ecosystem.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin Cash’s Standard Ledger Protocol","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Algorand","content":"LOCATION"},{"type":"Omni","content":"ORGANIZATION"},{"type":"$67.5 billion","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"Paolo Ardoino","content":"PERSON"}],"hashtag":["TETHER"],"authors":["Vishal Chawla","The Block"]}