{"summary":"Bitcoin has been dominating the rally in crypto prices amid the current banking crisis and is up around 70% since the beginning of the year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221222\/bitcoin-rally-is-pure-gravy-for-miners-finally-seeing-a-light-at-the-end-of-the-tunnel","publishDate":"2023-03-20T19:29:43","id":1375,"type":null,"title":"Bitcoin rally is &#x27;pure gravy&#x27; for miners finally seeing a light at the end of the tunnel","category":["CRYPTO INFRASTRUCTURE"],"content":["Bitcoin miners are finally getting some good news thanks to the rally in cryptocurrencies this year.","The first three months of this year are \"shaping up to be a better quarter\" than the previous one, investment firm Stifel <a href=\"https:\/\/stifel2.bluematrix.com\/sellside\/EmailDocViewer?encrypt=0d497b2d-0389-4478-bdca-b54293edf199&amp;mime=pdf&amp;co=Stifel&amp;id=cmoura@theblock.co&amp;source=mail\" data-v-f87c67ca=\"\">said<\/a> in an analyst note on Monday.","Hashprice, which measures how much miners earn based on a number of factors, is up 36% compared to March 12, at $0.08 per terahash.","\"This for us is pure gravy,\" CleanSpark Executive Chairman Matthew Schultz told The Block. \"When you look at the price appreciation in bitcoin, it's essentially another $200,000 a day in free cash flow if you're mining 20 bitcoin a day, which is about where we are.\"","Bitcoin price appreciation is happening at the same miners are finally seeing a slump in power prices — essentially reversing trends that squeezed their margins last year and drove some to bankruptcy. It may be a chance for a turnaround for even the hardest-hit companies.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-hashprice-index\/embed\" title=\"Bitcoin Hashprice Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","&nbsp;","\"The market has helped us a lot,\" a spokesperson with Core Scientific, which filed for bankruptcy in December, said last week. \"Power prices have come down dramatically. And when you're a bitcoin miner power pricing is your primary cost input ... We're spending a lot of money on professional fees, but operationally things are going great.\"","Mining is a balancing act between many factors and as overall economic conditions improve, analysts have warned that the better environment will be partially offset by an increase in mining difficulty as competition heats up.","CleanSpark's Schultz said he's seen an influx of machines coming online, but nothing that surpasses what had already been planned and announced by miners.","\"So we haven't seen a direct impact yet, but we certainly expect that it could have an impact not only on difficulty and mining economics from that perspective but also it's likely to have an impact on the price of mining equipment going forward,\" Schultz said.","Difficulty is expected to jump between 5% and 6% this week according to different estimates. It will be the third increase in a row, <a href=\"https:\/\/www.theblock.co\/post\/214589\/mining-difficulty-up-9-95-with-more-machines-coming-online-amid-recent-rally\" data-v-f87c67ca=\"\">following a 9.95 %<\/a> and 1.16% jump.","\"We expect continued growth to the overall network hash rate in the near term as newer gen machine deliveries are installed and brought online,\" said the note from Stifel.","Because rackspace for machines is scarce at the moment, \"if the price of BTC goes up a lot in 2023, there will be a lag before the difficulty goes up to an extent,\" the Core Scientific spokesperson said.","The market for ASIC machines started trending higher in late January for the first time since December 2021. Prices for those in the top efficiency tier have jumped 9% in the last two months, according to data from Luxor, which runs an ASIC trading desk.","Mid-generation machines are typically more sensitive to changes in mining economics than the absolute newest generation models, and \"we are seeing that play out right now,\" said Luxor COO Ethan Vera.","\"With Bitcoin heading towards $30k it's becoming easier for companies to raise equity capital, allowing them to deleverage their balance sheet. This deleveraging is resulting in less distressed assets coming to market and a reduction of ASIC supply,\" Vera said. \"Miners will look to hedge revenue and costs, take on less leverage then before. But ASIC markets will trend up with bitcoin price.\"","Prices could move \"pretty quickly\" unless machine supply available in the markets remains \"too high,\" he said.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-asic-price-index\/embed\" title=\"Bitcoin ASIC Price Index\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Miners have been in <a href=\"https:\/\/www.theblock.co\/post\/194733\/bitcoins-mining-industry-is-in-survival-mode-whats-in-the-cards-for-2023\" data-v-f87c67ca=\"\">survival mode<\/a> for the past several months — striving to deleverage themselves and clean up their balance sheets. Amid the excitement from the last bull market in 2021 and the race to deploy as fast as possible, some took on large amounts of debt to buy as many machines as possible when prices were comparatively very high.","In June of last year, bitcoin liquidations from miners spiked, <a href=\"https:\/\/theminermag.com\/data\/overview\/bitcoin-liquidation-public-mining\/\" data-v-f87c67ca=\"\">data from TheMinerMag shows<\/a>, and many companies have continued to sell a large portion of their mined bitcoin. Even miners like Marathon and Hut 8 — which historically have held on to their production — started selling off a portion of their holdings in the last couple of months.","\"The debt markets are starting to show signs of life,\" Schultz said. \"But by and large, unless you have a rock-solid balance sheet, they're still mostly closed. So the access to capital is pretty much restricted to either equity or the sale of Bitcoin.\"","CleanSpark said during its last <a href=\"https:\/\/www.theblock.co\/post\/210393\/cleanspark-2023-buying-spree-continues-as-company-seeks-to-add-50-75mw\" data-v-f87c67ca=\"\">earnings presentation<\/a> in February that it would propose to increase the number of shares authorized for issuance from 100 million to 300 million, keeping that as an option as the company builds towards its growth target this year.","In September, Hive Blockchain struck a deal to sell <a href=\"https:\/\/www.hiveblockchain.com\/news\/hive-blockchain-establishes-us100-million-at-the-market-equity-program\/\" data-v-f87c67ca=\"\">up to $100 million in shares<\/a>, while Iris Energy <a href=\"https:\/\/www.theblock.co\/post\/172441\/bitcoin-miner-iris-energy-inks-100-million-share-purchase-deal-with-b-riley\" data-v-f87c67ca=\"\">agreed to sell<\/a> up to the same amount in shares to B. Riley.&nbsp; Terawulf said in January that it <a href=\"https:\/\/www.theblock.co\/post\/208069\/bitcoin-miner-terawulf-raises-32-million-in-equity-offerings\" data-v-f87c67ca=\"\">raised $32 million in equity<\/a>, while also restructuring its existing debt.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Schultz","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"Marathon","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Vera","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$200,000","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"B. Riley","content":"PERSON"},{"type":"Luxor","content":"LOCATION"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"Hive Blockchain","content":"PERSON"},{"type":"$30k","content":"MONEY"},{"type":"100 million","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"9.95 %","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Luxor COO Ethan Vera","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"June of last year","content":"DATE"},{"type":"January","content":"DATE"},{"type":"February","content":"DATE"},{"type":"December","content":"DATE"},{"type":"1.16%","content":"PERCENT"},{"type":"March 12","content":"DATE"},{"type":"December 2021","content":"DATE"},{"type":"36%","content":"PERCENT"},{"type":"last week","content":"DATE"},{"type":"Matthew Schultz","content":"PERSON"},{"type":"$32 million","content":"MONEY"},{"type":"Stifel","content":"ORGANIZATION"},{"type":"$0.08","content":"MONEY"}],"hashtag":["MINING COMPANIES"],"authors":["Catarina Moura","The Block"]}