{"summary":"The zkSync ecosystem is getting its own answer to the OP Stack and its Superchains, with the ZK Stack and Hyperchains.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236322\/zksync-matter-labs-releases-zk-stack-for-building-hyperchains","publishDate":"2023-06-26T09:00:45","id":13763,"type":null,"title":"ZkSync: Matter Labs releases ZK Stack for building ‘Hyperchains’","category":["CRYPTO ECOSYSTEMS"],"content":["Matter Labs this morning released the ZK Stack, a codebase for building networks using the technology underpinning zkSync Era.&nbsp;","The goal is to create a network of interconnected blockchains using zero-knowledge proofs that exist alongside and running on top of the zkSync Era chain. Matter Labs is calling these networks Hyperchains and zkSync Era will be counted as the first Hyperchain.&nbsp;","“What the ZK Stack is, it's the core components for this Hyperchain vision that we've been working towards for some time,” said Anthony Rose, SVP of Technology at Matter Labs. “It’s a way to build and deploy these Hyperchains and it's a toolkit to enable the community to extend this system we've been building —&nbsp;and start working towards this Hyperchain vision that we've been articulating.”","The move is the latest sign of an emerging competition between two alternative visions for scaling Ethereum, with Optimism and zkSync taking similar approaches, albeit with their technology differences. Optimism has its OP Stack and its Superchains, which have already found adoption with crypto exchange Coinbase. The key difference between the two is that Optimism is built on optimistic rollups, while zkSync is built using zero-knowledge proofs for all transactions.","Similar to the OP Stack, running under an MIT license, the ZK Stack is being released under a fully permissive MIT\/Apache open source license.&nbsp;","“Our priority is now helping many more teams understand and contribute to the ZK Stack. With more Hyperchains launching, the number of core contributors will grow, and the community will become the true owner of the zkSync network, which will empower it to be the guardian of the ZK Credo ethos and values,” said Matter Labs in a blog post.","Developers who build Hyperchains can choose to create Layer 2 networks that run parallel to zkSync Era, or Layer 3 networks that run on top of it. They are able to customize the chain, depending on the network’s intended purpose.&nbsp;","Rose said that those running Hyperchains will need to run a sequencer. This is the machine that collects transactions and orders them before they are broadcast to the Ethereum mainnet. He said that Matter Labs will soon have a decentralized sequencer, but not every project will necessarily need their sequencer to be decentralized.","Hyperchains can be connected together using what Matter Labs is calling Hyperbridges. These are designed to allow for cross-chain swaps that take only a few minutes and cost as much as a single transaction. This is also somewhat similar to the Cosmos network and its IBC technology.","“So it lets you start building systems that can actually be connected in a much more meaningful way. You can actually build interoperability in a way that makes sense. You can move value in a way that makes sense,” said Rose.","Matter Labs noted that ZK Stack offers native account abstraction and claimed that some transaction types, such as oracle updates, will be much cheaper using the ZK Stack than through other rollups. It expects the first Hyperchains to go live this year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Anthony Rose","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"ZK Stack","content":"ORGANIZATION"},{"type":"Hyperchains","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SVP of Technology at Matter Labs","content":"ORGANIZATION"},{"type":"Labs this morning","content":"TIME"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":["ZKEVM","ZKSYNC"],"authors":["Tim Copeland","The Block"]}