{"summary":"Bitcoin miner Riot has started to move its rigs out of a third-party hosting facility in New York and into its new Texas site.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156113\/bitcoin-miner-riot-moves-hardware-fleet-out-of-new-york-hosting-facility","publishDate":"2022-07-06T12:51:07","id":1376,"type":null,"title":"Bitcoin miner Riot moves hardware fleet out of New York hosting facility","category":["MINING"],"content":["Bitcoin miner Riot is moving a part of its fleet out of New York and into its new Whinstone facility in Texas, in an effort to lower operational costs.","About 5,700 of the company's rigs are currently offline, according to a monthly update published Wednesday.","That resulted in a reduction of the miner's operating hash rate from 4.6 exahash per second (EH\/s) at the end of May to 4.4 EH\/s.","Riot says the move out of New York will allow it to cut third-party hosting fees and lower power costs. The company has also entered into a miner swap agreement with another bitcoin \"mining counterparty.\" All the rigs that were previously in Coinmint's facility in Massena, NY are expected to be redeployed in June, per Riot's statement.","Riot deployed 4,676 S19j Pro rigs at Whinstone in June and is set to receive 6,333 additional ones in July. The miner expects to reach 5.0 EH\/s once they are all deployed. It also forecasts reaching 12.5 EH\/s by January of 2023.","In June, Riot produced 421 BTC and sold 300, generating $6.2 million. As of June 30, it held 6,654 BTC.","Throughout the month, the company curtailed energy consumption by 8,648 megawatt-hours. Riot coordinates efforts with the Electric Reliability Council of Texas (ERCOT) to power down at times when the grid is under stress and electricity prices go up.","\"We view this as an important part of our partnership-driven approach with ERCOT and our commitment to being a good corporate citizen in our communities,\" said CEO Jason Les. \"Participation in the 4CP program also reduces Riot’s energy costs in the proceeding year.\"","Last month, high temperatures in Texas led to <a href=\"https:\/\/www.theblock.co\/post\/151084\/bitcoin-miners-in-texas-have-been-powering-down-amid-heatwave-and-record-electricity-demand\" data-v-f87c67ca=\"\">record-breaking power use levels for the month of June<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Electric Reliability Council of Texas (ERCOT","content":"ORGANIZATION"},{"type":"January of 2023","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"May","content":"DATE"},{"type":"Coinmint","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Jason Les","content":"PERSON"},{"type":"$6.2 million","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Massena","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}