{"summary":"German neobank N26 has launched cryptocurrency trading tools via a partnership with investment platform Bitpanda. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/178539\/neobank-n26-cryptocurrency-bitpanda-partnership","publishDate":"2022-10-20T04:30:07","id":13760,"type":null,"title":"Neobank N26 launches cryptocurrency trading with more than 100 tokens","category":["FINTECH"],"content":["N26, the German neobank valued at $9 billion, has launched cryptocurrency trading tools via a partnership with investment platform Bitpanda.&nbsp;","Starting today, customers in Austria will be able to trade over 100 tokens, including dogecoin, SOL, AVAX and shiba inu, according to a statement on Thursday. These features will be rolled out to other markets in the coming months.&nbsp;","These tools are enabled through APIs from Bitpanda's white-label business that allows platforms to tap into its trading tools. It will be available to access via the trading section of the N26 app's forthcoming \"Finances\" tab.&nbsp;","“While cryptocurrencies have seen a decline in value over the last year, they remain a requested and interesting asset class for investors and a growing part of the financial system,\" said N26 CEO Valentin Stalf in the announcement. \"Cryptocurrency trading is often the entry point to investing for a new generation of investors who are looking to explore ways to grow their wealth.\"&nbsp;","The Block <a href=\"https:\/\/www.theblock.co\/post\/110577\/thiel-german-neobank-n26-crypto-exchanges-trading-feature\" data-v-f87c67ca=\"\">reported<\/a> in July last year that the German neobank was working with a \"top-tier crypto exchange\" on a new trading feature. This was initially pegged for a late 2021 release.&nbsp;","While N26 has over 8 million customers across Europe, many will have to wait to access the new features. Bitpanda is yet to obtain a license from Germany's financial regulator, BaFin, meaning that the launch of N26 Crypto in its native country is currently not set in stone.&nbsp;","\"The BaFin license comes with a particularly high priority,\" said a Bitpanda spokesperson. \"We have been in the process of acquiring the most extensive license for some time now in order to create a serious and regulated environment for investments in digital assets in Germany.\"&nbsp;","Along with Austrian regulatory approval, Bitpanda is also registered with the French, Italian, Swedish and Spanish regulatory authorities — key markets for N26.&nbsp;","The move to offer these features represents a border push by fintech firms to offer crypto features, despite current market conditions. Earlier this month, banking platform Step <a href=\"https:\/\/www.theblock.co\/post\/176390\/step-secures-300-million-in-debt-funding-launches-crypto-investment-service\" data-v-f87c67ca=\"\">launched<\/a> a crypto investment platform aimed at its core demographic of minors and young adults. Other neobanks such as <a href=\"https:\/\/www.theblock.co\/post\/174960\/fintech-unicorn-stash-deepens-its-push-into-crypto-with-eight-new-offerings\" data-v-f87c67ca=\"\">Stash<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/171631\/revolut-expands-us-crypto-offering-dogecoin-shiba-ina\" data-v-f87c67ca=\"\">Revolut<\/a> have also recently sought to expand their crypto offerings via a partnership with infrastructure provider Apex Crypto.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Austria","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July last year","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"last year","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"Bitpanda","content":"PERSON"},{"type":"$9 billion","content":"MONEY"},{"type":"Bitpanda","content":"LOCATION"},{"type":"BaFin","content":"ORGANIZATION"},{"type":"Valentin Stalf","content":"PERSON"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}