{"summary":"Shortly after The Block reported that Vauld and its committee of creditors (COC) had a rejected &quot;final&quot; takeover proposal from Nexo because of concerns about its financial health and others issues, Nexo responded by saying that Vauld CEO Darshan Bathija doesn&#x27;t have the best interest of its creditors in mind.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199618\/nexo-says-vauld-ceo-doesnt-have-best-interest-of-creditors-in-mind","publishDate":"2023-01-05T16:16:30","id":13766,"type":null,"title":"Nexo says Vauld CEO doesn&#x27;t have &#x27;best interest&#x27; of creditors in mind ","category":["MERGERS & ACQUISITIONS"],"content":["<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">A dramatic tussle between rival crypto lenders Vauld and Nexo escalated on Thursday, with the two companies throwing barbs over a proposed acquisition.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Shortly after The Block <a href=\"https:\/\/www.theblock.co\/post\/199416\/vauld-rejects-nexos-final-acquisition-proposal-questions-companys-solvency\" data-v-f87c67ca=\"\">reported<\/a> that Vauld and its committee of creditors (COC) had a rejected \"final\" takeover proposal from Nexo because of concerns about its financial health and others issues, Nexo responded by saying that Vauld CEO Darshan Bathija doesn't have the best interest of its creditors in mind.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">\"Darshan Bathija and his clique do not have their creditors' best interest in mind; on the contrary, they are now not even trying to hide the fact that they are doing everything they can to push aggressively for a questionable deal with an affiliated obscure fund manager that — given how they operated the company so far — will most certainly result in the total loss of whatever little assets are still left on Vauld's balance sheet through speculation and hefty management fees,\" Nexo management said in a letter that was obtained by The Block.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Vauld has been planning to pursue a fund management option for restructuring, given that it is not keen on the potential Nexo deal, and it has identified six potential candidates.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> \"The contender is an unknown fund manager with no track record, no past performance to point to but grandiose unattested promises of exorbitant annual returns, regardless of market conditions,\" Nexo said in the letter. \"Since the proposal makes little sense, a number of people have argued that those voting for this bid must be part of this secret deal favoring the previous management along with a selected few whale customers.\"<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Nexo says it maintains its view that its final proposal represents the best for Vauld's creditors.<\/span>","<span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> \"Nexo's Final Proposal is the best possible path forward and is the only path forward – we are not sugar-coating the situation, Darshan Bathija's management of Vauld has been devastating,\" the company said. \"Nexo's team has devised a plan that will create the maximum value possible for creditors, and it is a plan that we know and have proven that we can execute.\"<br data-v-f87c67ca=\"\">\n<\/span>","Vauld and Nexo have been in discussions for a potential deal since early July, when the former halted client withdrawals after facing a severe liquidity crunch. Vauld owes more than $400 million to its creditors.","Nexo presented the latest proposal to Vauld creditors on Dec. 26. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Bathija told Nexo on Wednesday that Vauld and its COC \"unanimously\" rejected the offer.&nbsp;<\/span>","Among Vauld’s concerns are how Nexo would treat claims of its U.S.-based creditors since it recently announced plans to exit the market. It's also not sure about Nexo's overall financial health.","Nexo responded by saying that it has published real-time information about its assets and liabilities since 2021. It said that Vauld will have to pay it $20 million if it walks away from the deal.","“Nexo has an exclusivity period for its acquisition of Vauld — having had to hire different advisors and invest significant time, money, and efforts for the successful completion of the Vauld acquisition, Nexo has accumulated material costs,\" the company said. \"While we take no pleasure in enforcing the breakup clause that grants Nexo $20 million, as it would shrink even further the assets available to creditors, Nexo has to recoup the losses it has suffered through the sabotage of Darshan Bathija and his clique.”","Nexo, Vauld and its financial advisor, Kroll, did not immediately respond to requests for comment from The Block.","<em data-v-f87c67ca=\"\">With additional reporting by Jeremy Nation.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Darshan Bathija","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"Kroll","content":"PERSON"},{"type":"Jeremy Nation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Final Proposal","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Dec. 26","content":"DATE"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"COC","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Nexo","content":"PERSON"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}