{"summary":"Crypto payments infrastructure provider and stablecoin issuer Circle has delayed its DeFi application programming interface (API) product.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136269\/circle-delays-its-defi-api-product-citing-need-for-regulatory-guidance","publishDate":"2022-03-04T08:04:19","id":13769,"type":null,"title":"Circle delays its DeFi API product, citing need for regulatory guidance","category":["DEFI"],"content":["Crypto payments infrastructure provider and stablecoin issuer Circle has delayed its DeFi application programming interface (API) product, citing the need for further regulatory guidance on its rollout.","APIs allow businesses to more simply access each others' systems and Circle had announced the product via a blog post shared by CEO Jeremy Allaire <a href=\"https:\/\/twitter.com\/jerallaire\/status\/1408059537853124608\" data-v-f87c67ca=\"\">on Twitter<\/a> back in June last year. He promised \"seamless, safe, secure and regulated infrastructure for accessing and building on DeFi lending markets\".","The DeFi API product, which would've initially helped businesses access Compound on the Ethereum network, has now been delayed and resources instead dedicated to launching the Circle Yield product and making the USDC stablecoin available on new blockchains, Circle said in a statement to The Block today. In the aforementioned <a href=\"https:\/\/www.circle.com\/blog\/bringing-institutional-defi-to-the-world\" data-v-f87c67ca=\"\">blog post<\/a>, users are no longer able to register interest, with the \"join the waitlist\" link leading back to the Circle homepage.&nbsp;","\"We continue to focus on empowering institutions to send, spend and secure USDC and unlock new ways of doing business with the suite of services available through Circle Account,\" the company said. \"The timing of the DeFi API product rollout will be guided by developments in, and the availability of, further regulatory guidance, enhanced compliance tools, and blockchain identity protocols.\"","Circle's spokesperson didn't immediately respond to a question on the exact timing of the revised launch date.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Jeremy Allaire","content":"PERSON"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"June last year","content":"DATE"}],"hashtag":[],"authors":["Tom Matsuda","The Block"]}