{"summary":"Ethereum has become deflationary on a weekly timeframe for the first time since The Merge as activity on the network spikes.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176102\/ethereums-weekly-supply-growth-turns-deflationary-for-first-time-since-merge","publishDate":"2022-10-11T07:59:19","id":13762,"type":null,"title":"Ethereum&#x27;s weekly supply growth turns deflationary for first time since Merge","category":["ETHEREUM"],"content":["<span data-v-f87c67ca=\"\">Ethereum has become deflationary for the first time since The Merge as its new supply growth fell to -0.12% in the last seven days, according to <\/span><a href=\"https:\/\/ultrasound.money\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">estimates<\/span><\/a><span data-v-f87c67ca=\"\"> from ultrasound.money — a<\/span><span data-v-f87c67ca=\"\">&nbsp;direct result of Ethereum’s average gas fees spiking to between 20 and 30 gwei, which has driven down new ETH issuance.<\/span>","<span data-v-f87c67ca=\"\">After Ethereum's transition from a proof-of-work consensus mechanism to proof-of-stake on Sept.15, the rate of new ETH creation dropped nearly 90% as a result of validator rewards being significantly smaller than the miner rewards previously issued under the old proof-of-work mechanism.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Given a portion of fees for processing Ethereum transactions is burned, the overall supply growth was expected to become deflationary whenever the gas fee is above the 15.3 gwei mark — the point at which more ETH is burned than rewarded to validators, leading to decreasing rewards every subsequent block.<\/span>","<span data-v-f87c67ca=\"\">While average gas fees had remained low for some time after The Merge, they suddenly soared last week with the launch of a new staking crypto token called XEN. This token can be minted for free by any Ethereum user and then staked for more rewards.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As users have continued to claim more and more tokens, the project’s smart contract has consumed large amounts of gas on Ethereum. Over the last seven days, the minting of XEN has burned almost 3700 ether ($4.8 million), the highest among all Ethereum apps, according to data from ultrasound.money.&nbsp;<\/span><span data-v-f87c67ca=\"\">\"ETH is turning deflationary again thanks solely to a token named XEN, which has consumed half of all Ethereum blockspace over the last day,\" Ethereum developer foobar <a href=\"https:\/\/twitter.com\/0xfoobar\/status\/1579258215594102786\" data-v-f87c67ca=\"\">noted<\/a> on Monday.<\/span>","<span data-v-f87c67ca=\"\">Still, analysts have pointed out that, while the XEN token is causing ETH to become deflationary, XEN may have suspicious tokenomics — which some say has “Ponzi-like\" properties.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"This new Ponzi was just deployed and it's free to mint the token, and people are minting it, driving the gas prices up. I don't care what it is but this is the cause of it [Ethereum’s deflation],\" EthHub co-founder Anthony Sassano said in a <\/span><a href=\"https:\/\/www.youtube.com\/watch?v=cegoeNDGHkQ\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">video<\/span><\/a> r<span data-v-f87c67ca=\"\">eferring to activity surrounding the XEN token. <\/span><span data-v-f87c67ca=\"\">\"Now that we are above the 15.3 gwei barrier, it's deflationary and you start seeing the supply come down,\" he added.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/top-20-gas-consuming-smart-contracts-30d\/embed\" title=\"Top 20 Gas Consuming Smart Contracts (30D)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"EthHub","content":"ORGANIZATION"},{"type":"Sept.15","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Anthony Sassano","content":"PERSON"},{"type":"-0.12%","content":"PERCENT"},{"type":"$4.8 million","content":"MONEY"},{"type":"last day","content":"DATE"}],"hashtag":["CRYPTO","ETHEREUM"],"authors":["Vishal Chawla","The Block"]}