{"summary":"More than $1 billion of ether can&#x27;t be accessed on Ethereum, according to research by Conor Grogan, a director at Coinbase.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/221453\/over-1-billion-of-ether-lost-forever-bugs-human-error","publishDate":"2023-03-21T07:28:52","id":1377,"type":null,"title":"Over $1 billion of ether has been lost forever due to bugs and human error","category":["CRYPTO ECOSYSTEMS"],"content":["More than $1 billion of ether has been lost forever due to bugs and human error,&nbsp;according to research by Conor Grogan, director of product strategy and business operations at Coinbase.&nbsp;","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">\"I've categorized thousands of instances of Ethereum typos, user errors and buggy contracts,\" Grogan <a href=\"https:\/\/twitter.com\/jconorgrogan\/status\/1637944295746412549?s=20\" data-v-f87c67ca=\"\">said<\/a> on Twitter on Monday. He noted that he'd cataloged 636,000 ETH ($1.15 billion) that is lost, representing 0.5% of the coin's circulating supply.<\/span>","The majority — some 514,000 ETH — is due to a 2017 <a href=\"https:\/\/www.cnbc.com\/2017\/11\/08\/accidental-bug-may-have-frozen-280-worth-of-ether-on-parity-wallet.html\" data-v-f87c67ca=\"\">bug<\/a> in the Parity crypto wallet. Defunct crypto exchange Quadriga lost 60,000 ETH to a contract fault and the Akutars NFT collection lost 11,500 ETH in a failed Mint. On top of those, Ethereum users have cumulatively sent 24,000 ETH to a burn address, where the coins can no longer be accessed.","In most of these cases, the ether wasn't worth anywhere as near as much in dollars at the time of the loss.","Grogan added that his estimate, if anything, is an understatement. \"T<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">his $1.1B+ number significantly undershoots the actual lost\/inaccessible ETH amount — It just covers instances where Ethereum is locked forever,\" he said. <\/span>","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">This is because access to many wallets will have been lost but there's no way of knowing which ones by looking at blockchain data alone.<\/span>","<em data-v-f87c67ca=\"\">Update: Fixed the amount lost in the Parity bug.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grogan","content":"PERSON"},{"type":"Akutars NFT","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"$1.1","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Conor Grogan","content":"PERSON"},{"type":"0.5%","content":"PERCENT"},{"type":"$1.15 billion","content":"MONEY"}],"hashtag":["ETHEREUM","EXPLOITS"],"authors":["Tim Copeland","The Block"]}