{"summary":"Blockfolio, the popular crypto portfolio tracking app, has reduced its headcount and folded its incubator project three months after a large Series A","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7150\/vc-funded-blockfolio-downsizes-and-cuts-side-project-as-monetizing-plans-hang-in-the-balance","publishDate":"2019-01-11T14:00:56","id":13770,"type":null,"title":"VC-funded Blockfolio downsizes, cuts side-project as monetizing plans hang in the balance","category":["STARTUPS"],"content":["Blockfolio, the&nbsp;popular crypto portfolio tracking app, has reduced its headcount and folded its incubator project three months after a large Series A cash-raise.","CEO Edward Moncado confirmed that Blockfolio's California-based team of employees had decreased from 41 to 37 people. Additionally, its affiliated company, DataBlock,&nbsp;<a href=\"https:\/\/cryptobriefing.com\/rebalancing-blockfolio-crypto-app-datablock\/\" data-v-f87c67ca=\"\">has terminated contracts with five people<\/a> after Blockfolio decided to \"sideline\" the incubator. The data-rights programme was set up a year and a half ago and, according to sources, consumed a sizable investment, including a hefty salary for a former Wall Street executive.","\"Laying people off is awful and it's a difficult decision to make,\" Moncado&nbsp;said in an interview, noting the bear market had been the cause of the \"restructuring\" which began in December.","However, after raising $11.5 million in VC funds in its latest round and without an external income stream, its treasury should be in good health, raising questions over what else spurred the nine-person firing. Sources close to the company claim the answer may lie in an unsustainable burn rate, consisting of \"extravagant\" daily catered-lunches and a lavish launch party at the Shangri-La Hotel. A seven-person trip to Prague at the time of the 'Blockfolio 2.0'&nbsp; app launch was also a source of concern, along with the size of its payroll.","\"We didn't need 40 people. Look at delta.app [a competitor] - they have like a dozen people. Why did Blockfolio need to grow like that?\" said a source.","Moncado, for his part, has said the firm had been \"extremely frugal.\"&nbsp;","\"We've taken proactive steps to ensure we'd make it through any market,\" he said, defending the firm's trip to Prague as a crucial platform to develop relationships in the ecosystem. He said the firm has also eliminated all significant marketing costs for the year ahead and had always paid market-rate salaries.","Sources interviewed by <em data-v-f87c67ca=\"\">The Block<\/em> also raised wider concerns around Blockfolio's monetization future. The company was founded in 2014 before launching its widely-used free&nbsp;app, but it still lacks a clear plan for generating revenues. Moncado said the company \"hadn't decided\" yet how to monetize, although it \"would probably [come from] ads at some point.\"","Still,&nbsp;it's not all bad news.&nbsp;Blockfolio has progressed with its launch of Signal, its communications platform for token teams.","\"Signal has been a tremendous success. It's been enthusiastically embraced by all the token team projects,\" Moncado said. \"It was the first of its kind. Now you're starting to see some copycats, but it validates the product,\" he added.","Moncado said the firm is now focusing on developing the app and pushing monetization down the pike.","<em data-v-f87c67ca=\"\">Image credit: <\/em><a href=\"https:\/\/www.shutterstock.com\/g\/piotr+swat\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Shutterstock\/Piotr Swat<\/em><\/a>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Moncado","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"Shutterstock\/Piotr Swat","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$11.5 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Shangri","content":"LOCATION"},{"type":"Prague","content":"LOCATION"},{"type":"Blockfolio","content":"ORGANIZATION"},{"type":"Edward Moncado","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Blockfolio","content":"PERSON"},{"type":"DataBlock","content":"ORGANIZATION"}],"hashtag":[],"authors":["Isabel Woodford","The Block"]}