{"summary":"At the recent Digital Asset Summit, The Block spoke with Catherine Coley, CEO of Binance&#x27;s American partner exchange Binance.US, on a range of topics,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/48600\/catching-up-with-binance-us-ceo-catherine-coley","publishDate":"2019-12-05T14:47:31","id":13771,"type":null,"title":"Catching up with Binance.US CEO Catherine Coley","category":["THE BLOCK"],"content":["<iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/RQljAEI-rEA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-v-f87c67ca=\"\"><\/iframe>","At the recent Digital Asset Summit, The Block spoke with Catherine Coley, CEO of Binance's American partner exchange Binance.US, on a range of topics, including how the company attends to the needs of both institutional and retail clients, how it plans to translate the Binance brand to the U.S. market, and how Oprah taught her to use Twitter.&nbsp;","Founded in China in 2017 and currently headquartered in Malta, Binance provides a platform for trading over 100 cryptocurrencies and sees an average daily volume of $1.2 billion, according to its <a href=\"https:\/\/www.binance.com\/en\" data-v-f87c67ca=\"\">website<\/a>. Binance.US, a byproduct of the murky regulatory environment in the U.S., was launched in September 2019 as a partner of the global exchange to provide services to American investors. Coley hopes importing Binance’s business model to the U.S. market will lead to the emergence and maturation of a more inclusive and efficient crypto ecosystem in the country.","Highlighting that Binance.US ultimately aims to empower the individual user, Coley said she plans to differentiate the company by offering the institutional experience of trading, prioritizing ease of access, diversity of tokens, enhanced security, and first-rate customer support. Eliminating barriers to entry is also a focus of her work, she said, which was why the company decided to offer low trading fees.","In 2020, Coley said she looks forward to further building out the platform and start soliciting more feedback from customers. She intends to use Twitter, which she said she learned from Oprah Winfrey, to engage users and improve her company’s products.","","","<b data-v-f87c67ca=\"\">Frank: <\/b>All right, ladies and gentlemen. Thank you so much for joining me. We are live at the Digital Asset Summit at the Cipriani in Lower Manhattan. I'm joined by Binance.US CEO Catherine Coley — she just got off her panel. What were you talking about?","<b data-v-f87c67ca=\"\">Coley: <\/b>We're talking about all the institutional fun that we're having. So we had Mike Moro from Genesis Global Trading. We had the guys at Curv and Fireblocks. And it was moderated by our great friend Teddy over at Bitwise.","<b data-v-f87c67ca=\"\">Frank: <\/b>I think when people think about Binance — the parent company if you will, the affiliated company.","<b data-v-f87c67ca=\"\">Coley: <\/b>It's a partner. A global partner.","<b data-v-f87c67ca=\"\">Frank: <\/b>They are known so much for their impressive retail flow. How important is having a balanced market for Binance.US, and how do you attract both retail clientele and institutional clientele?","<b data-v-f87c67ca=\"\">Coley: <\/b>There are a couple things. I've thought differently my whole life, but I've spent the majority of my experience in the institutional markets, so it's hard to shake those elements where I know that is what the institutional markets can expect from us. But I'm catering to and delivering to the retail user. So we're bringing the elements that you need from an institutional experience of trading and delivering them for you to access them directly. And that's been kind of a key component that Binance.com has done so successfully — being able to deliver, you know, ease of access on the platform, freedom of choice in terms of the diversity of the tokens that they offer, as well as just the security and the products they can expand upon it. All really come back down to the individual. So that component is something we can really pride on. As well as delivering top-notch customer support. That's something institutional clients really need.","<b data-v-f87c67ca=\"\">Frank: <\/b>When you think about the company, the brand has been so strong at driving the business and driving adoption onto the platform. Is that something that translates into the U.S. company or are there other differentiating factors that you see as supporting Binance.US as a tailwind?","<b data-v-f87c67ca=\"\">Coley: <\/b>Yes, there's a lot of components to why I even wanted to be working or bringing this opportunity to the United States. That really is the alignment with CZ's vision. It's one that I see is still a component that's completely compelling for any geographic area for us to really strive for. And that's just delivering the freedom for the individual to be able to control, access, manage, and grow their own personal capital. And with that, he just had a speech yesterday in Singapore around the idea that you build a good product first and then the ecosystem follows. And I think that's something that I'm very eager to bring to the United States, where we're able to introduce a globally validated trading technology, that speed of execution, as well as a variety of diverse token selection that the U.S. may not have had access to already.","<b data-v-f87c67ca=\"\">Frank: <\/b>I think a lot of people don't realize or know that CZ's strong high frequency trading background and trading technologies which he has brought to the table growing this firm.","<b data-v-f87c67ca=\"\">Coley: <\/b>He was building out some components that I was using while at Morgan Stanley and Bloomberg. So the idea that we both know that world as well as being able to cater to a retail use case and frankly, we're thinking through it through our own eyes. I'm selfishly building the way I want to be operating. Going through the process of buying tokens or Bitcoin. Making sure that KYC is less than 12 minutes. It's something for my own sake.","<b data-v-f87c67ca=\"\">Frank: <\/b>It's funny. You guys had tremendous volume growth as you rolled out with 0 fees. You introduced fees. It kind of brought volumes down a bit. How do you see fees play a role over the next year in an exchange standing out? And what does an exchange do when fees compress?","<b data-v-f87c67ca=\"\">Coley: <\/b>One of the main components that we really care about at Binance and Binance.US is lowering that barrier to entry, fees being one of the most obvious ones that stopped people from beginning to trade or beginning to even entertain the idea of owning a digital asset. And so with that, lowering our fees really has been a component where we said if this was a hurdle to entry, let us get rid of that. The second one that we think about is a lot around the education. Intimidation factor in crypto is still high. You know, I've faced some tougher headwinds before being in Wall Street or in other elements of careers, but coming into crypto you kind of still have to have tough skin. So that is something where we want to be able to bring that barrier lower, educating people, having a welcoming environment, having customer support that understands where you're coming from and is more empathetic in that element that says this is a new world, but we're going to guide you through it.","<b data-v-f87c67ca=\"\">Frank: <\/b>Do you view the role of the exchange as being simply that of the exchange? There are others that are dipping their toes - not even dipping their toes – but <em data-v-f87c67ca=\"\">offering<\/em> custody solutions or settlement services. How do you view the role of the exchange in the crypto market for a market structure perspective?","<b data-v-f87c67ca=\"\">Coley: <\/b>Two years ago, it would have been maybe just the exchange. But as we've seen with Binance, that little exchange has blossomed into something insanely new. So whether they've done, you know, incubating new companies, building out developer platforms, welcoming education academy, building out still that trading technology, increasing the products they offer, whether that is lending or staking or futures. That's a roadmap that we certainly would want to be modeling after, being able to learn and license from the greatest so far that we've seen, is something that's a privilege that we get to work with.","<b data-v-f87c67ca=\"\">Frank: <\/b>What's the biggest way Binance.US will be differentiated from Binance and what exactly might you not model off of them.","<b data-v-f87c67ca=\"\">Coley: <\/b>One of the main components is we are building it for the U.S. user. So whether that's an element around the regulation, so making sure that we're in the guidelines with how the U.S. is expecting people to operate. Going through KYC, optimizing that KYC process so we don't have it as a hurdle. And then the other elements like taxes. Making sure that we have easy to download offerings for Tax U.S. users to understand that. Taking away those components that are difficult for the American user and trying to model those on how the rest of the world trades.","<b data-v-f87c67ca=\"\">Frank: <\/b>And what are you most excited about for 2020?","<b data-v-f87c67ca=\"\">Coley: <\/b>For 2020, my team, we've been working on this for, I guess five in September...","<b data-v-f87c67ca=\"\">Frank: <\/b>How many folks?","<b data-v-f87c67ca=\"\">Coley: <\/b>We have about 10ish? Small team, scrappy. We've got a lot of hats and in 2020 I'm really excited to see a lot of the elements that we are building out gain that action, but not only that. Us being able to get even more feedback from the user. So right now we only have about a month and a half of data from our clients then telling me directly over Twitter what they like, what they don't like. I can't wait for those to continue to add up and our product be improved upon based on their feedback.","<b data-v-f87c67ca=\"\">Frank: <\/b>Twitter is I think one of the areas where CZ and Binance shine in terms of engaging with the clients. You kind of followed that trajectory in a sense. How important is Twitter to your business?","<b data-v-f87c67ca=\"\">Coley: <\/b>Twitter is a wonderful platform. I remember when I signed up, Oprah told me how to sign up a long time ago.","<b data-v-f87c67ca=\"\">Frank: <\/b>Who told you?","<b data-v-f87c67ca=\"\">Coley: <\/b>Oprah!","<b data-v-f87c67ca=\"\">Frank: <\/b>How did that happen?","<b data-v-f87c67ca=\"\">Coley: <\/b> It was a 4 p.m. show of Oprah. She made everyone download Twitter and we all used it. She was the original way for me to adopt technology. Oprah would tell me these things. Times are changing. No one watches TV at 4 p.m. now. But that's how I got into Twitter. It basically gave us a direct line of contact to someone you maybe have nothing in common with, whether they were a celebrity, whether they were your neighbor or whether they were anonymous.","<b data-v-f87c67ca=\"\">Frank: <\/b>Or now whether they're a client on your exchange.","<b data-v-f87c67ca=\"\">Coley: <\/b>Or now they are a client. So that ability to engage with someone and have an interface where we can have direct feedback is one that I really enjoy. And probably people get a little alarmed when I respond and I say: \"what state are you from? How did you get into crypto?\" I really want to know, because it's giving me a better color into the communities that we're building in – which communities are underdeveloped – and giving people that platform like Binance.US, and our referral program and the different features that we're rolling out for them to empower the communities around them.","<b data-v-f87c67ca=\"\">Frank: <\/b>Well, thanks so much for coming on.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"September 2019","content":"DATE"},{"type":"Catherine Coley","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Mike Moro","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Digital Asset Summit","content":"ORGANIZATION"},{"type":"Coley","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Lower Manhattan","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Oprah Winfrey","content":"PERSON"},{"type":"Genesis Global Trading","content":"ORGANIZATION"},{"type":"4 p.m.","content":"TIME"},{"type":"Oprah","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Malta","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}