{"summary":"Web3 onboarding startup Magic has raised $52 million in a funding round led by PayPal Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232762\/paypal-ventures-invests-in-web3-onboarding-startup-magic","publishDate":"2023-05-31T13:12:35","id":13779,"type":null,"title":"PayPal Ventures invests in web3 onboarding startup Magic","category":["COMPANIES"],"content":["PayPal Ventures has led a round of investment into Magic, a digital-wallet provider that helps companies migrate customers to web3.","Magic announced it raised $52 million in what it called a “strategic funding round.\" Cherubic, Synchrony, KX, Northzone and Volt Capital also participated, the company said, noting it had now raised a total of more than $80 million.","“We have witnessed a steady increase in web3 use-cases among large enterprises across a wide variety of verticals,” said Sean Li, Magic’s co-founder and CEO. “Global brands have realized the potential of blockchain beyond crypto and are utilizing it to engage with their customers and monetize the experience in new ways.”","Magic said it has worked with household name brands like Macy’s department store and toy maker Mattel.","<span data-v-f87c67ca=\"\">The company's main focus is making it easy for consumers to store digital assets in a non-custodial wallet which can be setup with an email address or social media account.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mattel","content":"ORGANIZATION"},{"type":"Northzone","content":"ORGANIZATION"},{"type":"$52 million","content":"MONEY"},{"type":"Volt Capital","content":"ORGANIZATION"},{"type":"Macy","content":"ORGANIZATION"},{"type":"PayPal Ventures","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Synchrony","content":"LOCATION"},{"type":"Sean Li","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}