{"summary":"Stablecoins and CBDCs were on the agenda for U.K. central bank chief Andrew Bailey&#x27;s latest speech.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/76862\/boe-stablecoin-speech-cbdcs","publishDate":"2020-09-03T10:58:58","id":13786,"type":null,"title":"Bank of England governor floats future ecosystem of stablecoins and CBDCs","category":["CENTRAL BANKS"],"content":["Andrew Bailey, the governor of the Bank of England, gave a wide-ranging speech on Monday that touched on stablecoins, central bank digital currencies (CBDCs) and the future of payments.","During his <a href=\"https:\/\/www.bankofengland.co.uk\/-\/media\/boe\/files\/speech\/2020\/reinventing-the-wheel-with-more-automation-speech-by-andrew-bailey.pdf?la=en&amp;hash=6B5DE50DC09345C4D88FA9BF6CC1F660CA742FD4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">speech<\/a>, Bailey criticized digital assets like bitcoin — \"they strike me as unsuited to the world of payments, where certainty of value matters,\" he said — but highlighted fiat-tied stablecoins as something that \"could offer some useful benefits\" for payments.","At one point in his speech, Bailey articulates a possible future in which both stablecoins and CBDCs co-exist and complement one another from a user experience perspective.","\"Stablecoins and CBDC are not necessarily mutually exclusive. Depending on design choices, they could sit alongside each other, either as distinct payment options, or with elements of the stablecoin ecosystem, such as wallets, providing consumers with access to a CBDC. So there will likely be a role for the private and public sector working together in the future of payments,\" he said, adding:","\"As well as not being exclusive, stablecoins and CBDC are not the only ways to meet changing demands and reducing frictions in payments. We need to continue to enhance existing infrastructure, including by renewal and harmonisation of RTGS systems. This work will continue in parallel with other developments. There are also initiatives like the U.K.’s New Payments Architecture, which offers a consolidated and open retail payment infrastructure.\"","On the question of a stablecoin framework, Bailey echoed the comments of other regulators in that he sees a need for international coordination.","\"But a global stablecoin is a cross-border phenomenon,\" he remarked. \"It can be operated in one jurisdiction, denominated in another’s currency and used by consumers in a third. The regulatory response must match this. As in&nbsp;banking and traditional payment systems, the regulatory response must be grounded in internationally agreed standards. Global issues require a global response, particularly for multi-currency stablecoins intended for cross-border transactions.\"","To this end, he highlighted work being done by the G7 and the Financial Stability Board (FSB) — the results of which will be made public in greater detail this fall.","\"The FSB consulted in April on the regulatory and supervisory challenges they present, with a final report due in October, and the Bank of England supports the efforts to set a baseline set of expectations,\" said Bailey. \"These include that stablecoins should be regulated based on the functions they perform and risks they create, and that there should be comprehensive domestic and international regulation and supervision.\"","\"Global stablecoins should have robust governance and risk management, and be transparent about their stability mechanisms and coin-holders’ rights,\" he continued.","The Bank of England is one of a number of central banks worldwide <a href=\"https:\/\/www.theblockcrypto.com\/post\/75022\/a-global-look-at-central-bank-digital-currencies-full-research-report\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">pursuing CBDC and e-money projects<\/a>&nbsp;as The Block has reported. It remains to be seen whether the U.K. central bank actually rolls out a wholly digital currency of its own, but years of comments and R&amp;D have placed it near the front of the pack in this area.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bailey","content":"PERSON"},{"type":"RTGS","content":"ORGANIZATION"},{"type":"fall","content":"DATE"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"G7","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Andrew Bailey","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"FSB","content":"ORGANIZATION"},{"type":"Financial Stability Board (FSB","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"October","content":"DATE"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}