{"summary":"The founder and former CEO of FTX is looking for funds as costs rise in his criminal and civil cases.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225799\/bankman-fried-ftx-insurance-legal-defense","publishDate":"2023-04-11T17:34:44","id":13789,"type":null,"title":"Sam Bankman-Fried&#x27;s hoping to tap into FTX insurance money","category":["BANKRUPTCY"],"content":["Before FTX went bust, the company took out an insurance policy to protect its directors and officers in the event of a lawsuit.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> That time has come, and <\/span>Sam Bankman-Fried wants a piece of it.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","On Wednesday, a bankruptcy judge is set to weigh whether Bankman-Fried, the founder and former CEO of FTX, can access the company’s $10 million director and officer liability insurance to reimburse his hefty legal bills.","Bankman-Fried asked the judge to lift a stay that would allow the insurance providers, Relm Insurance and Beazley Insurance, to evaluate whether he’s covered and make payments in line with the terms of the policy.","Although he’s been accused of crimes, Bankman-Fried has not been proven guilty. Lawyers for the ex-billionaire say he should be presumed innocent and allowed to access the insurance to bolster his defense in court.&nbsp;In their words, denying him access to the plan would be “unequal and unfair treatment.”","“It's completely right to say that he hasn't been found guilty of anything yet, but the scope of the fraud and what he's been accused of is certainly far from ordinary,” said Matthew Gold, a partner at the law firm Kleinberg, Kaplan, Wolff &amp; Cohen.","<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">Bankman-Fried claimed in December that he had <a href=\"https:\/\/www.theblock.co\/post\/201323\/unemployed-and-under-house-arrest-sam-bankman-fried-faces-enormous-legal-bills\" data-v-f87c67ca=\"\">less than $100,000<\/a> left in his bank account. He<\/span> is <a href=\"https:\/\/www.forbes.com\/sites\/sarahemerson\/2023\/03\/29\/sam-bankman-fried-legal-fees-funded-by-alameda-money-gifted-to-father-joe-bankman\/?sh=79dbd6593f57\" data-v-f87c67ca=\"\">reportedly<\/a> funding his criminal legal defense with a gift that Alameda Research, his bankrupt crypto trading firm, made to his father.","Judge John Dorsey will hear Bankman-Fried’s motion during a hearing in the U.S. Bankruptcy Court for the District of Delaware. If the judge lifts the stay and allows Bankman-Fried to access the policy, and the insurance provider determines he is covered, he could essentially get an FTX-linked payout before any of the exchange’s creditors.","A Bankman-Fried spokesperson declined to comment.","The full scope of Bankman-Fried’s legal bills is unclear, although <a href=\"https:\/\/www.theblock.co\/post\/201323\/unemployed-and-under-house-arrest-sam-bankman-fried-faces-enormous-legal-bills\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">experts<\/span><\/a> estimate his defense may cost millions. Along with his criminal case, Bankman-Fried is active in the FTX bankruptcy and faces lawsuits from U.S. regulators.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Legal expenses just can grow. You know, it's almost one of those situations where if you have to ask, why bother?” Gold said. “The expenses can be huge. Litigation is expensive.”","The Official Committee of Unsecured Creditors objected to Bankman-Fried’s motion, saying that any cash he receives is money that could go to the FTX creditors. Director and officer liability insurance typically protects the executives of a company in the event that they are targeted by legal action.","“For every dollar extended by the insurance carrier to Mr. Bankman-Fried’s defense costs, there is one less dollar to pay\" those that are owed money by FTX,&nbsp; the committee said.&nbsp;","The committee also said that the insurance plan exists to protect the company and its directors “in situations where they make honest decisions in the ordinary course of the business. “This is not that case,” the committee said, pointing out Bankman-Fried’s criminal fraud charges.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Bankman-Fried’s lawyers slammed the committee’s objections, saying that he is not explicitly seeking the entire $10 million sum available under the insurance plan.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Mr. Bankman-Fried is like any other former director or officer of a company who seeks access to a D&amp;O insurance policy to pay for legal fees. Coverage under the D&amp;O Policies for those legal fees does not change simply because the debtors, the committee, and some class action plaintiffs believe or hope that Mr. Bankman-Fried is guilty,” Bankman-Fried’s lawyers wrote. “This court should not approve of this unequal and unfair treatment.”","For their part, the FTX debtors have also raised questions about Bankman-Fried’s motion, although they say they are contractually obligated not to oppose it in court. The former CEO’s request is “unfair” and “inequitable,” lawyers said, pointing out that other FTX employees are also under legal scrutiny. Lawyers for the debtors did not respond to a request for comment.&nbsp;","“Multiple other current and former directors, officers and employees are facing government inquiries and other claims covered by the D&amp;O Policies. All are looking to the same, limited insurance,\" the FTX debtors said in a court filing.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","The crypto exchange suggested that if the court lifts the stay on the insurance policy, it should be lifted for all who are eligible to use it, rather than only Bankman-Fried.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","\"If the court is inclined to lift the automatic stay ... the court should enter relief broad enough to allow the insurers to pay any or all insureds, pursuant to the terms and conditions of the policies, and not just Mr. Bankman-Fried,\" the FTX lawyers said.&nbsp;","Even if Bankman-Fried’s push to access the insurance policy is successful and he receives a payout, he could still face legal hurdles tied to the policy, experts say.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> The insurance firms did not respond to requests for comment.&nbsp;<\/span>","The former crypto boss is facing an October criminal trial in the U.S. District Court for the Southern District of New York. He’s facing a litany of criminal charges including bank fraud and making illegal political donations. He could spend the rest of his life in jail if convicted on all counts.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","“Coverage is not black and white,” said Richard Mico, the U.S. CEO and chief legal officer of Banxa, a payment-and-compliance infrastructure provider to the global crypto industry. “It is very possible that SBF will still initially be covered under the arrangements until, if at all, a final court determination is made regarding his conduct.”","“In other words, he’s innocent until proven otherwise,” Mico added. “If SBF is proven guilty, he may be required to repay.”","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"John Dorsey","content":"PERSON"},{"type":"Official Committee of Unsecured Creditors","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Matthew Gold","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Banxa","content":"LOCATION"},{"type":"U.S. District Court","content":"ORGANIZATION"},{"type":"Mico","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"SBF","content":"ORGANIZATION"},{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Kleinberg, Kaplan, Wolff &amp; Cohen","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Relm Insurance and Beazley Insurance","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"Richard Mico","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"the District of Delaware","content":"ORGANIZATION"}],"hashtag":["FTX","SAM BANKMAN-FRIED"],"authors":["Stephanie Murray","The Block"]}