{"summary":"Blockchain.com has become the latest company to choose European regulation, instead of forging ahead with its application to the UK FCA’s temporary register.\nThe company has chosen to operate in Europe from a Lithuanian subsidiary. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/139679\/blockchain-com-becomes-latest-firm-to-retreat-from-uk-regulation-application","publishDate":"2022-03-29T14:27:55","id":1378,"type":null,"title":"Blockchain.com becomes latest firm to retreat from UK regulation application","category":["Regulation"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Blockchain.com has become the latest company to confirm it will favour European regulation instead of pressing on with its application to the Financial Conduct Authority's (FCA) cryptoasset licensing process.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The official, <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/107057\/uk-fca-new-registration-deadline-crypto-march-2022\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">twice-revised<\/span><\/a><span data-v-f87c67ca=\"\"> deadline by which firms must either cease trading or get approved as part of the FCA’s anti-money laundering regime falls on March 31, later this week. Being part of the temporary register has allowed Blockchain.com to carry on in the UK while awaiting a final decision from the watchdog.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company has now decided to withdraw its UK application and register its business in Lithuania, the US and Ireland, a person familiar with the matter told The Block. It is also seeking regulatory approval in Germany. It had originally made these moves due to the regulatory uncertainties surrounding Brexit, the person said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Blockchain.com informed its UK customers via its app earlier this month that they would be served by a new legal entity, Blockchain (LT) UAB, but that it would be business as usual other than that.<\/span><a href=\"https:\/\/exchange.blockchain.com\/legal\/terms\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">The company's website<\/span><\/a><span data-v-f87c67ca=\"\"> also laid out the new legal arrangement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Blockchain.com serves millions of customers from the UK and employs around 100 people in its London office.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Blockchain.com is not the first big player to withdraw from the temporary register ahead of the formal deadline. On March 11, The Block revealed that crypto market maker B2C2 had<\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/137484\/crypto-firms-uk-close-fca-register\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">withdrawn from the list<\/span><\/a><span data-v-f87c67ca=\"\"> and plans to shift its spot trading operations to a US entity.<\/span>","<a href=\"https:\/\/www.theblockcrypto.com\/post\/139499\/wires-withdraws-fca-crypto-register\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Wallet firm Wirex<\/span><\/a><span data-v-f87c67ca=\"\"> has also chosen to move to an overseas base in Croatia named Wirex Digital, which is registered with HANFA, the local regulator.<\/span>","<span data-v-f87c67ca=\"\">Several big players in the crypto market — including neobank Revolut and Copper, the custodian — are still listed on the temporary register, awaiting a final decision.<\/span>","<span data-v-f87c67ca=\"\">As cited in earlier reports by The Block, a person familiar with the matter said that Revolut expects to continue selling crypto services beyond the March 31 deadline. Copper, meanwhile, recently set up an entity in crypto-friendly Switzerland that could offer a fallback option if its application fails.<\/span>"],"hashtag":[]}