{"summary":"The TRON ecosystem recently welcomed its first Real World Asset (RWA) product, stUSDT, which is operating through the decentralized platform JustLend.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237636\/the-first-real-world-asset-product-stusdt-launches-on-the-tron-blockchain","publishDate":"2023-07-06T09:00:06","id":13788,"type":null,"title":"The First Real World Asset Product stUSDT Launches on the TRON Blockchain","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">The TRON ecosystem recently welcomed its first Real World Asset (RWA) product, <\/span><a href=\"https:\/\/twitter.com\/stusdt\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">stUSDT<\/span><\/a><span data-v-f87c67ca=\"\">, which is operating through the decentralized platform <\/span><a href=\"https:\/\/portal.justlend.org\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">JustLend<\/span><\/a><span data-v-f87c67ca=\"\">. TRON founder and member of <\/span><a href=\"https:\/\/www.huobi.com\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Huobi's<\/span><\/a><span data-v-f87c67ca=\"\"> global advisory board, <\/span><a href=\"https:\/\/twitter.com\/justinsuntron?lang=en\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Justin Sun<\/span><\/a><span data-v-f87c67ca=\"\">, has voiced his belief that stUSDT will evolve into the crypto version of Alipay’s Yu’e Bao, a money market fund product offered by Alibaba. Sun is convinced that it will serve as a bridge connecting traditional markets to blockchain ecosystems while empowering crypto users with more options.<\/span>","<span data-v-f87c67ca=\"\">With a vast global user base and a $50 billion stablecoin market cap, stUSDT, a TRON-based RWA product, has sparked considerable industry excitement upon its introduction. It is primed to serve as a cornerstone for TRON's RWA endeavors. The stUSDT platform is dedicated to narrowing the divide between retail and institutional investors while connecting the crypto realm with the real world. stUSDT ensures equal opportunities for all to invest in RWAs. This is the first endeavor in the TRON ecosystem to tokenize RWAs and introduce them to the community.<\/span>","<span data-v-f87c67ca=\"\">stUSDT, the TRON ecosystem's answer to stETH on the Lido protocol, is a decentralized token that serves as proof of investment in RWAs and its holders can earn passive incomes from real world assets. stUSDT introduces more decentralized and robust asset management mechanisms. The ultimate goal of stUSDT is to optimize return opportunities for on-chain users from real world assets. Launched by RWA DAO, stUSDT is operated by JustLend DAO under the custody agreement between the two parties. JustLend DAO boasts the highest TVL on TRON and ranks among the top DeFi projects. In addition, TRON hosts the largest circulating supply of USDT (over $46 billion) and a TVL second only to Ethereum, which will also drive the organic growth of stUSDT. The stUSDT team is confident to see an influx of new users and wider expansion of the TRON ecosystem at large.<\/span>","<span data-v-f87c67ca=\"\">In traditional finance, Yu’e Bao, Alipay's money market fund product, has become a handy option for market participants. The TRON-based stUSDT is positioned as the Yu’e Bao of Web3, whose debut unveils a new chapter for the TRON ecosystem to potentially replicate the success story of Alipay. Just as Alipay cracked the market open with its payment services before expanding its user base with Yu’e Bao, TRON has solidified its leading position in Web3 payment infrastructure across the globe, before the ecosystem ventures to new heights via the launch of stUSDT.<\/span>","<span data-v-f87c67ca=\"\">Similar to Alipay’s Yu’e Bao, stUSDT enables users to engage with passive incomes and withdraw their assets at any time while enjoying the transparency, security, and immutability brought by blockchain technology. stUSDT provides a wide range of opportunities for users by connecting on-chain assets with real-world assets. Supported by TRON's robust ecosystem, the platform commits to a user-centric approach and serves as a dynamic bridge to further facilitate the integration of blockchain with traditional finance, poised to propel the next stage of growth in the blockchain industry.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"Alipay’s Yu’e Bao","content":"PERSON"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Alibaba","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Justin Sun","content":"PERSON"},{"type":"$46 billion","content":"MONEY"},{"type":"$50 billion","content":"MONEY"},{"type":"JustLend DAO","content":"ORGANIZATION"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"TRON","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Yu’e Bao","content":"PERSON"},{"type":"Alipay","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}