{"summary":"DeFi Saver is one of the OG DeFi projects that came to fruition before Black Thursday and even before Aave v1 launched.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160909\/defi-saver-a-complete-defi-management-dashboard-with-automation-options","publishDate":"2022-08-04T09:00:43","id":13785,"type":null,"title":"DeFi Saver, a complete DeFi management dashboard with automation options","category":["SPONSORED"],"content":["<a href=\"https:\/\/defisaver.com\/?mtm_campaign=theblock_1st\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">DeFi Saver<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> is one of the OG DeFi projects that came to fruition before Black Thursday and even before Aave v1 launched. The crew working on the project started with a lesser-known name - CDP Saver, in 2019, when there was only MakerDAO with their Collateralized Debt Positions (CDPs) and later rebranded. The story of DeFi Saver started with a liquidation. While on a team retreat in Thailand, a personal, close-call experience with a potential liquidation of a DeFi position in Maker led one of the founders to think of a simple idea. He took a small part of the collateral to pay back part of his debt, increasing the collateral-to-debt ratio on which many DeFi protocols rely in providing overcollateralized loans, thereby reducing his risk of liquidation. The team went a long way from providing manual DeFi loan repayment and leveraging features in a single transaction - a DeFi first, for that matter, to becoming a go-to solution for automated liquidation protection and leverage management for the most trusted protocols. Over time, various on-chain automated strategies were introduced that can either automatically unwind (partially \"self-liquidate\") or fully close out (Stop Loss) a position if it becomes too risky.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:192,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">In the years that followed, as DeFi grew, DeFi Saver continuously expanded support for various lending and borrowing protocols, creating dedicated dashboards for Compound, Aave, Liquity, and Reflexer. Alongside continuous polishing and UI improvements, the team developed several powerful tools evolving into an impressive DeFi protocol aggregator with advanced DeFi asset management features.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:192,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Today DeFi users have all of their needs covered in one comprehensive app, including borrowing, lending, leveraging, and yield farming. They can rely on the <\/span><a href=\"https:\/\/app.defisaver.com\/smart-savings\/manage?mtm_campaign=theblock_1st\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Smart Savings dashboard<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> that enables an easy supply of stablecoin assets to vetted yield farming protocols like Yearn, mStable, and Convex. There is also a convenient and easy-to-use tool that allows users to move their collateral and debt between integrated protocols called the <\/span><a href=\"https:\/\/app.defisaver.com\/shifter?mtm_campaign=theblock_1st\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Loan Shifter<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">. And then there is the <\/span><a href=\"https:\/\/app.defisaver.com\/recipes\/book?mtm_campaign=theblock_1st\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Recipe Creator<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">. A transaction builder intended to abstract the smart contract technical intricacies. Users can mix different actions, multiple protocol interactions, token swaps, and utilize the famous DeFi flash loan functionality in a single transaction. It allows for the cross-interaction of all the protocols mentioned above as well as Uniswap and Lido. Lastly, the much-praised <\/span><a href=\"https:\/\/app.defisaver.com\/?mtm_campaign=theblock_1st_sim\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Simulation mode<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> feature enables anyone to take the application for a spin and test its powerful suite of features.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:192,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">At times, DeFi can be daunting. The number of protocols and apps serving a particular function is mind-boggling. <\/span><a href=\"https:\/\/defisaver.com\/?mtm_campaign=theblock_1st\" data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">DeFi Saver<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> has made a name for itself in the Ethereum ecosystem, saving thousands of users from liquidation while handling over 100,000 transactions and over $6 billion in trade volume. While you may haven't heard of it because the team stayed out of marketing schemes and focused on building instead, the DeFi Saver app has provided excellent tools in a conveniently packaged UI for years. It is worth checking out.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:192,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">This post is commissioned by DeFi Saver<\/i><i data-v-f87c67ca=\"\">&nbsp;and does not serve as a testimonial or endorsement by The Block. This post is for informational purposes only and should not be relied upon as a basis for investment, tax, legal or other advice. You should conduct your own research and consult independent counsel and advisors on the matters discussed within this post. Past performance of any asset is not indicative of future results.<\/i><\/span>","<span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:6,&quot;335551620&quot;:6,&quot;335559739&quot;:192,&quot;335559740&quot;:240}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Smart Savings","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"OG","content":"ORGANIZATION"},{"type":"CDP Saver","content":"LOCATION"},{"type":"Thailand","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"$6 billion","content":"MONEY"},{"type":"Loan Shifter","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}