{"summary":"Gone are the days when it was thought that there would be “one chain to rule them all”.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172398\/interoperability-networks-infrastructure-for-the-multi-chain-future-commissioned-by-axelar","publishDate":"2022-09-23T10:01:40","id":13790,"type":null,"title":"Interoperability Networks: Infrastructure for the Multi-chain Future- Commissioned by Axelar","category":["RESEARCH"],"content":["<b data-stringify-type=\"bold\" data-v-f87c67ca=\"\">The Block Research was commissioned by Axelar to create “Interoperability Networks: Infrastructure for the Multi-chain Future”. To learn more about Axelar, <a href=\"https:\/\/axelar.network\/\" data-v-f87c67ca=\"\">click here<\/a>. To access the full report in PDF format, Please click the “download now” button below.<\/b>","<a href=\"https:\/\/bit.ly\/3EeSRqz\" data-v-f87c67ca=\"\"><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-172410\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/09\/download-now-button-800x160.png\" alt=\"\" width=\"190\" height=\"38\" srcset=\"https:\/\/www.tbstat.com\/wp\/uploads\/2022\/09\/download-now-button-800x160.png 800w, https:\/\/www.tbstat.com\/wp\/uploads\/2022\/09\/download-now-button-1200x241.png 1200w, https:\/\/www.tbstat.com\/wp\/uploads\/2022\/09\/download-now-button-768x154.png 768w, https:\/\/www.tbstat.com\/wp\/uploads\/2022\/09\/download-now-button-1536x308.png 1536w, https:\/\/www.tbstat.com\/wp\/uploads\/2022\/09\/download-now-button.png 1696w\" sizes=\"(max-width: 190px) 100vw, 190px\" data-v-f87c67ca=\"\"><\/a>","<strong data-v-f87c67ca=\"\">Executive Summary&nbsp;<\/strong>","<b data-v-f87c67ca=\"\">Gone are the days when it was thought that there would be “one chain to rule them all”. <\/b><span data-v-f87c67ca=\"\">Dozens of general-purpose layer-1 networks with material levels of adoption have emerged. Several layer-2 networks were recently launched into production and are rapidly onboarding users. Software development kits are making it easy for developers to deploy new application-specific blockchains tailored to one or few use cases.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">To date, cross-chain user experiences have been far from seamless. <\/b><span data-v-f87c67ca=\"\">Layer-1 bridges, which are constructed on an ad-hoc basis and typically employ primitive security mechanisms, have facilitated the bulk of cross-chain flows. While they have been a necessary stop gap solution, they have also placed additional burdens on users and resulted in heightened risk.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Over $2 billion has been misappropriated in cross-chain exploits in the past 18 months. <\/b><span data-v-f87c67ca=\"\">In many cases, interoperability development organizations and financial backers have stepped in to replenish user funds. But there is no guarantee that they will continue to do so in the future. Cross-chain security is already a critical consideration for application developers and users. Leading interoperability projects analyzed in this report are employing a range of security mechanisms, which all have different trade offs, to safeguard cross-chain value transfer.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Universal interoperability networks are improving cross-chain experiences.<\/b><span data-v-f87c67ca=\"\"> Leading networks facilitate value and arbitrary data transfer between ~10 to ~60 blockchains across their respective ecosystems. They are enabling developers to deploy cross-chain native applications that give users easy access to more assets and applications across many blockchains.&nbsp;<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<b data-v-f87c67ca=\"\">On-chain data quantifies the state of the emerging cross-chain economy. <\/b><span data-v-f87c67ca=\"\">In the face of broad-based crypto asset price declines in 2022, most fundamental metrics have declined meaningfully. However, the gross amount of value and information flowing cross-chain is already high. Individual interoperability networks, such as Cosmos IBC, have facilitated ~$12 billion of monthly cross-chain value transfer.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Native tokens are expected to play an important role in decentralizing operation of interoperability networks. <\/b><span data-v-f87c67ca=\"\">Given their relatively early stages of development, many interoperability networks are operated by a small number of independent entities. The impending launch of native tokens is poised to incentivize community participation, reduce development organizations’ influence in their networks, and decentralize network operation.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Development organizations incubating interoperability networks have raised $400 million in funding in 2022.&nbsp; <\/b><span data-v-f87c67ca=\"\">Year to date funding in 2022 is already double total funding in 2021 (~$200 million) and forty times higher than funding in 2020 (~$10 million). Development organizations are well equipped to continue investing in developer talent to deploy their technology and expand the breadth of their networks.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$12 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$400 million","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"$2 billion","content":"MONEY"},{"type":"Block Research","content":"ORGANIZATION"},{"type":"IBC","content":"ORGANIZATION"}],"hashtag":[],"authors":["Andrew Cahill","The Block"]}