{"summary":"Andre Cronje, the founder of decentralized finance (DeFi) project Yearn.Finance (YFI) has clarified his famous &quot;test in prod&quot; statement.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/81174\/yfi-andre-cronje-clarifies-test-in-prod","publishDate":"2020-10-15T06:45:42","id":13797,"type":null,"title":"YFI founder Andre Cronje clarifies his famous &#x27;test in prod&#x27; approach","category":["DEFI"],"content":["Andre Cronje, the founder of decentralized finance (DeFi) project Yearn.Finance (YFI) has clarified his popular \"test in prod\" statement.","In a blog post <a href=\"https:\/\/andrecronje.medium.com\/unpacking-my-involvement-in-defi-cdb6479e337d\" data-v-f87c67ca=\"\">published<\/a> Thursday, Cronje said he has come to \"regret\" this statement. \"Anyone that has listened to some of my interviews, will know I have this statement so that people use caution. It exists to deter people from just using systems without investigation,\" said Cronje. \"It does NOT mean that I don’t test.\"","Test in prod refers to testing in production in engineering — the practice of conducting continuous tests after an application has been deployed to production.","Cronje said there are six stages to his test in prod approach. Stage 1 includes \"local tests\" to make sure everything is functional and works as planned. Stage 2 involves \"interaction testing\" to ensure that everything functions from a one user interaction perspective. Stage 3 includes \"composite testing,\" which compares the interaction between multiple parties. Stage 4 is \"fake prod,\" which replicates Ethereum mainnet and fake deploys contracts and checks their interaction. Stage 5 is \"integration testing,\" i.e., deployment to mainnet, and this allows \"real-world testing,\" i.e., transactions, gas limits, and volume. The last stage 6 is \"prod deployments\" and coincides with user interface and other documentation.","Cronje's clarification comes soon after another one of his unfinished projects, Liquidity Income (LBI), witnessed a rise and fall. \"People bought LBI off of Uniswap, inflating the price, something that a rational actor that understood how the system worked should never have done, this caused a price decline, and this is seen as LBI being a 'failed' project,\" said Cronje.","He went on to say LBI is still in the works, and \"it will become the basis of a much bigger product that will be part of the yearn brand (if they wish to adopt it).\"","Cronje said he did not create Yearn alone. \"The yearn team is far more skilled and capable than I am, and anyone that thinks yearn is dictated, led, or in anyway dependent on me, is doing yearn a disservice. I am happy to be a contributor to something much bigger,\" he said.","Cronje assured that he would continue building but would also need fellow developers to collaborate. \"While I doubt what happened with yearn, seeing an entire team form around it, will happen again, that is truly my wish,\" he said.","Cronje also mentioned his other unfinished project, <a href=\"https:\/\/www.theblockcrypto.com\/post\/79061\/yfi-eminence-defi-protocol-exploited\" data-v-f87c67ca=\"\">Eminence.Finance (EMN)<\/a>, which was exploited recently. He said EMN was at stage 5 when it got attacked.","\"I am a rapid prototyper and I will continue to be one,\" said Cronje. \"I don't foresee ETH disappearing, and I don't foresee builders stopping, and I will continue to build.\"","\"Some of it will be useful, some of it will end up failures. But I think there is more value in trying, even if it is a failure, than all the critics deeming it so,\" said Cronje.","The blog post officially quashes recent <a href=\"https:\/\/www.coindesk.com\/yearn-finances-creator-says-hes-quit-defi-but-project-has-bench-strength\" data-v-f87c67ca=\"\">media reports<\/a>, which said Cronje had quit DeFi.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"EMN","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"LBI","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Cronje","content":"PERSON"},{"type":"Uniswap","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}