{"summary":"The popular portfolio tracking platform Accointing has upgraded their app\nBy focusing on usability, functionality, and automated updates, the team wants to make the app the key jump-off point for all crypto investors\nThe app is now available in app stores anywhere","author":["Sponsored","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43125\/portfolio-tracking-platform-accointing-launches-a-new-app","publishDate":"2019-11-01T09:27:58","id":138,"type":null,"title":"Portfolio Tracking Platform Accointing Launches a New App","category":["Startups"],"content":["<strong data-v-f87c67ca=\"\">What is Accointing?<\/strong>","Accointing is a Portfolio Management platform that shows the development of all coins and investments in a portfolio as well as market insights. The platform provides detailed statistics and analytics for every coin and exchange as well as tax reports for users’ portfolios.","The team around the platform is now launching their new app. The app features a beautiful portfolio overview showing both the total portfolio value and the change in value over the last 24 hours. It can be easily and safely connected to most crypto exchanges and therefore updates any crypto portfolio automatically. Seamless and secure connection to crypto exchanges and enables automatic updates of your crypto portfolio.","Minimalist yet comprehensive, the app shows all relevant information on its screen. At the same time, the dashboard allows for deep dives into prices and market capitalizations with a simple tap. <br data-v-f87c67ca=\"\">\nThe browser-based Accointing interface is also fully capable of automatically generating tax reports that will make your next visit to the accountant much shorter.","<strong data-v-f87c67ca=\"\">Why now?<\/strong>","Investing in the crypto space has become increasingly complex. Tokens come and go, investment strategies change and for every 10x investment return, there are at least five ICOs that go belly-up. At the same time, governments and tax authorities are slowly waking up to the +200 billion market cap full of taxable events that is the crypto economy.","Now, that the Wild West of the early crypto days is slowly getting pushed out of the way by professional investors and institutional money, it is time for investment tools to evolve and become more sophisticated as well.","However, instead of relying on traditional trade desks and the outdated tools of the old markets, usability and convenience need to be given back to the investor. Because with so many different exchanges and wallets, even keeping up with a personal crypto portfolio – important not only when tax season is approaching – takes a lot of time.","<strong data-v-f87c67ca=\"\">How is Accointing doing this?<\/strong>","Accointing aggregates all transaction data in one place. Exchanges are connected directly via APIs, wallets are added using public addresses, and for very obscure coins, manual uploads of transaction data are possible.","The whole set-up process takes between five and thirty minutes and is entirely dependent on how many exchanges and wallets you use. It is easy to start – and through automatic updates, even easier to maintain.","<strong data-v-f87c67ca=\"\">Who built this?<\/strong>","The platform was built by crypto enthusiasts who were dissatisfied with the complexity and rigidness of existing tools. The Accointing team is working hard to create a platform they love to use – and by always listening closely to all users, they keep improving the experience.","<strong data-v-f87c67ca=\"\">Why do we love the new app?<\/strong>","Simplicity. Now, we can check our portfolio anywhere - and once the account is set up, there is no maintenance involved at all. We don’t need to spend as much time collecting data, and will still be much better informed.","Accointing is <a href=\"http:\/\/www.accointing.com?utm_source=the%20block&amp;utm_medium=sponsored%20article&amp;utm_campaign=accointing-release\" data-v-f87c67ca=\"\">Crypto made simple<\/a> and with the new Accointing app, portfolio management becomes even faster, better and more convenient than ever before."],"hashtag":[]}