{"summary":"The platform said it&#x27;s investigating and taking steps to have “third parties freeze funds in flight,” it tweeted.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/176445\/hacker-steals-over-100-million-from-mango-markets","publishDate":"2022-10-11T20:10:13","id":13806,"type":null,"title":"Hacker steals over $100 million from Mango Markets","category":["HACKS"],"content":["A hacker stole $100 million from Mango Markets, a trading and lending platform on Solana.","The exploit appeared to be the result of manipulation in the price of Mango Market’s native MANGO token via an oracle price manipulation attack, Mango Markets <a href=\"https:\/\/twitter.com\/mangomarkets\/status\/1579979342423396352?s=20&amp;t=vJ0I1nsDjjjC5vd4yK9bUg\" data-v-f87c67ca=\"\">tweeted<\/a>. The platform said it's investigating and taking steps to have “third parties freeze funds in flight,” it tweeted.","The attacker first deposited $5 million in USDC to the platform, and then opened an abnormally large long position, according to blockchain security firm Hacken <a href=\"https:\/\/twitter.com\/hackenclub\/status\/1579972197128732672?s=20&amp;t=vJ0I1nsDjjjC5vd4yK9bUg\" data-v-f87c67ca=\"\">on Twitter<\/a>. This caused the token price to jump nearly 1000% in less than an hour, which concurrently spiked the collateral value of the attacker’s account.","The attacker then used this manipulated collateral value in their account to borrow a large debt position across multiple coins on Mango Market’s borrowing and lending platform.","Since the price of the token and their collateral was manipulated much higher, they were able to borrow and steal roughly $114 million across various tokens, according to Hacken.&nbsp;","The price of the MANGO token has dropped roughly 50% in the wake of the attack, according to the Mango Market's price feed.","Mango said it's disabling deposits on the front end to prevent users from using its platform. It also sent out a statement to the attacker, whose <a href=\"https:\/\/solscan.io\/tx\/sq2VX7WkNXVWhn9EHLrZWhyV6TKG31hMGrAAGjuG4EnNfSk27SwPTm4bBktvd4jP2w7hsfi4xpauyCAKjNovTCV\" data-v-f87c67ca=\"\">wallet<\/a> was funded from an FTX exchange account, to contact them regarding a bounty for the return of the funds.","<em data-v-f87c67ca=\"\">Update: This story has been updated with additional details throughout.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Hacken","content":"LOCATION"},{"type":"$114 million","content":"MONEY"},{"type":"Hacken","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Twitter","content":"DATE"},{"type":"1000%","content":"PERCENT"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Mango Market","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$5 million","content":"MONEY"}],"hashtag":["CRYPTO"],"authors":["Mike Truppa","The Block"]}