{"summary":"Voyager counsel filed a proposed order last night to authorize its sale to FTX US, providing more insight on the path forward for customers.  ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/173813\/voyager-files-proposed-order-to-facilitate-ftx-sales-process","publishDate":"2022-09-29T15:22:16","id":13801,"type":null,"title":"Voyager files proposed order to facilitate FTX sales process","category":["LEGAL"],"content":["Voyager counsel filed a proposed order last night to authorize its sale to FTX US, providing more insight on the $1.4 billion winning bid and the path forward for customers.&nbsp;&nbsp;","After a two-week-long auction process, Voyager announced earlier this week that FTX US had won the auction process with a bid that encompassed a $1.3 billion sale of the assets on its platform, with the final price to be based on a to-be-determined date. The bid also included $111 million in \"incremental value.\"","Thursday's filing details that $111 million includes a cash payment of $51 million and an earn-out of up to $20 million. It also features a $50 account credit for customers who move to FTX's platform and pass its know-your-customer process.&nbsp;","At a hearing today, counsel for Voyager told Bankruptcy Judge Michael Wiles that the agreement provides flexibility on how customers can recoup their assets. They may receive their crypto through FTX's platform or cash if the tokens held are not supported by FTX. If they do not wish to sign up for FTX, Voyager would remain responsible for making the distributions, and it's not clear whether that would be in crypto or cash, according to counsel.","Voyager is currently in discussions with FTX counsel to outline the procedures for the plan. Finer details related to customer distribution will be filed in a disclosure statement Voyager plans to file next week. A hearing on the plan is slated for Oct. 19.","\"We intend to provide creditors and customers with all the information that they need to understand how distributions will be made and in what amounts,\" said counsel at today's hearing.","Counsel and FTX had <a href=\"https:\/\/www.theblock.co\/post\/159387\/voyager-document-says-ftx-alameda-proposal-has-misleading-or-outright-false-claims\" data-v-f87c67ca=\"\">a public squabble<\/a> in the early stages of the bankruptcy process when the exchange publicized a proposal to bring early liquidity to customers. Counsel said this violated the integrity of the process since the bidding process requires companies with an intention to participate to enter into confidentiality agreements. They also called the publicized offer a \"low ball bid\" and sought to dispel the notion that FTX was a frontrunner early on.","The final deal \"provides substantially more value to the Debtors' estates that the original offer,\" according to the court filing.","\"Due to this comprehensive marketing process and robust Auction, the Sale provides all creditors with significantly more value through the Sale than they would have received had the Debtors accepted FTX US’s original offer,\" said the filing.","With the deal in hand, the bankruptcy process that began <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">this July<\/a> is in its end stages. Once the motions related to the deal are approved by the court, the plan will be put to a vote.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"last night","content":"TIME"},{"type":"$1.4 billion","content":"MONEY"},{"type":"$50","content":"MONEY"},{"type":"$1.3 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Voyager","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"FTX US","content":"ORGANIZATION"},{"type":"$111 million","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"$51 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"Oct. 19","content":"DATE"},{"type":"Michael Wiles","content":"PERSON"}],"hashtag":["FTX"],"authors":["Aislinn Keely","The Block"]}