{"summary":"Ethena’s founder said the token may see its yield fall as it grows in market share but isn’t concerned until it hits 30-40%.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278802\/ethena-eth-perpetual-futures-open-interest-risk","publishDate":"2024-02-23T14:37:43","id":13803,"type":null,"title":"Ethena captures 5% of ether perpetual futures open interest; founder downplays concerns","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Ethena, the protocol behind the<\/span><a href=\"https:\/\/www.theblock.co\/post\/277565\/ethena-usde-stablecoin-funding-valuation-paypal-brevan-howard-others\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">USDe digital dollar<\/span><\/a><span data-v-f87c67ca=\"\">, now makes up almost 5% of global ether perpetual futures open interest, according to the platform’s <\/span><a href=\"https:\/\/app.ethena.fi\/dashboards\/hedging\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">data dashboard<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">USDe is a token tied to the value of a dollar that offers a high yield. While it has been described as a stablecoin, the team avoids the use of the term —&nbsp;instead preferring the term a “synthetic dollar.” George Calle, VP of Research at The Block, stressed that Ethena’s USDe is essentially a tokenized representation of the cash and carry arbitrage present in crypto markets. As such, it generates yield by shorting ether futures and staking ether.&nbsp;<\/span>","The project's advertised yields of up to 27% have enticed users to mint around $420 million USDe tokens so far, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ethena-usde\" data-v-f87c67ca=\"\">CoinGecko data<\/a>. Though the project initially paid out only 15% of its first-week yield to holders, it <a href=\"https:\/\/x.com\/ethena_labs\/status\/1761029371186561289?s=20\" data-v-f87c67ca=\"\">quickly reversed course<\/a> following backlash, paying out the entire 24% yield generated by its assets instead of reserving funds for core team operations.&nbsp;","<span data-v-f87c67ca=\"\">This growing market share has raised concerns that, as it rises in market share, the yield of the protocol could fall considerably. Yet <\/span><a href=\"https:\/\/www.theblock.co\/post\/240017\/dragonfly-capital-leads-6-million-seed-funding-round-for-ethereum-stablecoin-developer-ethena-axios\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethena<\/span><\/a><span data-v-f87c67ca=\"\">’s founder Guy Young, who goes by the pseudonym Leptokurtic, said he’s not concerned at these levels, but that the protocol might struggle at a higher market share.<\/span>","<span data-v-f87c67ca=\"\">Young said a self-correcting mechanism comes into play if the yield on USDe falls significantly. He explained that such a scenario would see market participants opt out of staking their USDe. If they do that, he said, this would allow the funding rate to revert to a new equilibrium.<\/span>","<span data-v-f87c67ca=\"\">He added that a more concerning situation would be if the protocol made up around 30% to 40% of ether perpetual futures open interest. \"That's when a product like Ethena starts to come into more serious capacity constraints,\" he added.<\/span>","<span data-v-f87c67ca=\"\">Calle noted that Ethena’s design will likely put downward pressure on funding rates but said this doesn’t post questions around solvency or systemic risk. Instead, it raises the question of how much capital the protocol can take in before yields shrink to levels that are unattractive to token holders.<\/span>","<span data-v-f87c67ca=\"\">One of crypto’s biggest collapses was the <a href=\"https:\/\/www.theblock.co\/post\/266389\/terraform-labs-asks-judge-to-let-jury-decide-if-ust-and-luna-tokens-are-securities\" data-v-f87c67ca=\"\">luna<\/a> token and its sister token UST, which was a stablecoin that offered high yields of nearly 20%. Due to this high-level similarity, there have been many comparisons between UST and USDe.<\/span>","<span data-v-f87c67ca=\"\">Yet Calle argued that this comparison is misplaced. He noted that historically, crypto markets have featured positive funding rates and that Ethena’s strategy is to create a delta neutral position that captures this positive funding rate — with a dash of staking yield thrown in.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Given the 20-40% annual yield that this strategy projects at current funding rates, many have falsely equated the strategy to previous algorithmic <a href=\"https:\/\/www.theblock.co\/post\/275448\/stablecoins-yield-ondo-coo\" data-v-f87c67ca=\"\">stablecoins<\/a> like Terra that infamously advertised ~20% yield on UST,” Calle said. “However, Terra was designed in a way that was dependent on perpetual capital inflows to prevent the inevitable death spiral experienced in May 2022, while Ethena can exist safely even if yield or the total value locked in the protocol is reduced.”<\/span>","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Calle added that the protocol's mechanism can actually generate positive yield even during periods of negative funding rates, as long as the negative funding cost does not outweigh positive <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.49%\n    <\/span><\/a> <!----><\/span> staking yield. He noted the protocol also has an insurance fund, currently set at $10 million, that can be drawn on if this were to happen.<\/span><\/span>","<span data-v-f87c67ca=\"\">“What will be interesting to see is if Ethena reaches such popularity that this question becomes relevant, and if the Ethena team would employ other measures, such as capping deposits, to preserve an arbitrary level of expected yield,” he said.<\/span>","<span data-v-f87c67ca=\"\">Last week, Ethena Labs announced it had raised $14 million in a strategic funding round. Dragonfly and BitMEX founder Arthur Hayes' family office, <\/span><a href=\"https:\/\/www.theblock.co\/post\/217082\/arthur-hayes-vows-his-family-office-maelstrom-will-f-some-s-up\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Maelstrom<\/span><\/a><span data-v-f87c67ca=\"\">, co-led the round, Ethena Labs said on Feb. 15.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The decentralized finance platform had commitments of over $50 million for the round but capped it at $14 million as it did not need more cash at the moment, Young told The Block. Ethena Labs originally announced an <a href=\"https:\/\/www.theblock.co\/post\/277565\/ethena-usde-stablecoin-funding-valuation-paypal-brevan-howard-others\" data-v-f87c67ca=\"\">incorrect roster<\/a> of high-profile investors, including firms like PayPal Ventures and Fidelity, that was later corrected.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The round began in late December and closed last week, Young said, adding that it was structured as a simple agreement for future equity with token warrants. The round brought Ethena's valuation to $300 million, he added.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"George Calle","content":"PERSON"},{"type":"VP of Research","content":"ORGANIZATION"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$420 million","content":"MONEY"},{"type":"PayPal Ventures","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$14 million","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"Ethena Labs","content":"ORGANIZATION"},{"type":"27%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"$10 million","content":"MONEY"},{"type":"” Calle","content":"ORGANIZATION"},{"type":"-0.49%","content":"PERCENT"},{"type":"delta","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"May 2022","content":"DATE"},{"type":"Ethena","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Feb. 15","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Young","content":"PERSON"},{"type":"24%","content":"PERCENT"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$300 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["LENDING","PROTOCOLS","STAKING","TOKENS"],"authors":["Brian McGleenon","The Block"]}