{"summary":"After a weekend that called into the question the agency of its community, Arbitrum has backtracked on a key governance proposal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224459\/arbitrum-proposal-backlash-response","publishDate":"2023-04-03T06:20:49","id":13812,"type":null,"title":"Arbitrum to break up $1 billion proposal after backlash","category":["GOVERNANCE"],"content":["Arbitrum backtracked on a key governance proposal after a weekend that called into question exactly how much sway token holders have over the direction of the project.","The proposal — a package of actions named \"Arbitrum Improvement Proposal-1,\" or AIP-1 — controversially planned to send 750 million ARB tokens, worth around $1 billion, to the Arbitrum Foundation. The purpose of the transfer was to give the foundation capital to invest in initiatives built using Arbitrum's technology.&nbsp;&nbsp;","The proposal appeared set to go ahead without the approval of token holders — who make up the decentralized autonomous organization or DAO that in theory governs Arbitrum — who had voted overwhelmingly <a href=\"https:\/\/www.theblock.co\/post\/224444\/arbitrum-sells-tokens-aip1?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">against<\/a> the move. Arbitrum initially tried to style the vote as a “ratification.”&nbsp;","But the project has seemingly now bowed to the pressure, after Arbitrum community lead named eli_defi conceded in a Discord post late on Sunday that AIP-1 “likely will not pass” and committing to addressing the concerns of its community.","“AIP-1 is too large and covers too many topics. We will follow the DAO’s advice and split the AIP into parts. This will allow the community to discuss and vote on the different subsections,” wrote eli_defi.","Arbitrum, an Ethereum Layer 2 scaling project, is the hot ticket in DeFi circles at present, having <a href=\"https:\/\/www.theblock.co\/post\/222205\/arbitrum-airdrop-token-claim-live\" data-v-f87c67ca=\"\">airdropped<\/a> its prized tokens to nearly 300,000 users a few weeks ago — a transfer of value worth close to $1.5 billion at current market prices. The airdrop helped create the Arbitrum DAO, a decentralized autonomous organization that in theory gives holders a say, as well as a stake, in the development of the project. The events of this weekend cast some doubt on that, as well as on just how decentralized the outfit is.&nbsp;&nbsp;","Arbitrum attempted damage control late on Sunday. Its lengthy Discord post also addressed critics who had <a href=\"https:\/\/twitter.com\/chestbrook\/status\/1642570786518052868\" data-v-f87c67ca=\"\">highlighted on-chain transfers of 50 million ARB tokens<\/a>, which appeared to represent sales. Arbitrum’s eli_defi said that 10 million tokens were sold by the Arbitrum Foundation to “fund pre-existing contracts and to pay for near-term operating costs.” That was a necessary step because the foundation is a separate entity from Offchain Labs, the New York-based developer of Arbitrum, they claimed, and needed to fund itself.&nbsp;&nbsp;","“The Foundation does not exist to sell tokens, only sold enough to fund its current operating expenses and has no near-term plans to sell more tokens,” eli_defi wrote.","Arbitrum’s community lead added that, to address community feedback, the allocation of 750 million ARB tokens to the foundation would now be voted on in a separate proposal, and that transparency reports covering how funds are spent over time will be published.","Blockchain sleuths first <a href=\"https:\/\/twitter.com\/Cringe\/status\/1642500640218939393?s=20\" data-v-f87c67ca=\"\">raised concerns<\/a> over the transfer of the 750 million ARB tokens, as well as the sale of 50 million tokens without DAO approval, in mid-March. It is not clear exactly what Arbitrum’s promise of a separate proposal on that transfer means, given that the tokens have seemingly already been sent to the foundation.","The community lead conceded that the so-called “special grants program” — which the 750 million ARB transfer was originally part of — is vague and “lacks DAO involvement.” It will be renamed the Ecosystem Development Fund, providing more information on use of funds, they added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"AIP","content":"ORGANIZATION"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Arbitrum DAO","content":"PERSON"},{"type":"Ecosystem Development Fund","content":"ORGANIZATION"}],"hashtag":["ARBITRUM","DAOS","GOVERNANCE VOTES"],"authors":["Ryan Weeks","The Block"]}