{"summary":"The Solana Layer 1 blockchain continues to suffer from an exploit targeting its crypto wallets, with more than 7,000 addresses affected.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161141\/solana-exploit-enters-second-day-as-ceo-points-to-attack-on-apple-hot-wallets","publishDate":"2022-08-03T05:59:39","id":13815,"type":null,"title":"Solana exploit enters second day as CEO points to attack on Apple hot wallets","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">A hack affecting the Solana ecosystem entered a <a href=\"https:\/\/www.theblock.co\/post\/161115\/more-than-5000-wallets-drained-in-apparent-exploit-on-solana-network\" data-v-f87c67ca=\"\">second day<\/a> on Wednesday, with no firm consensus on the source of the exploit or how it might be stopped.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As of 5 a.m. UTC on Wednesday, the Layer 1 network <a href=\"https:\/\/twitter.com\/SolanaStatus\/status\/1554721709357498368\" data-v-f87c67ca=\"\">said<\/a> 7,767 wallets had been hit. A report from security firm Anchain <a href=\"https:\/\/twitter.com\/AnChainAI\/status\/1554650825493868544\" data-v-f87c67ca=\"\">estimated<\/a> that more than $5 million in assets had been taken.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While it’s not yet confirmed what may be responsible for the exploit, Solana Labs co-founder and CEO Anatoly Yakovenko <a href=\"https:\/\/twitter.com\/aeyakovenko\/status\/1554745536741138433\" data-v-f87c67ca=\"\">said<\/a> on Twitter the incident is likely a \"supply chain attack\" on wallets using Apple's iOS operating system.<\/span>","<span data-v-f87c67ca=\"\">Supply chain attacks happen when a hacker enters and modifies software by injecting their malicious code in a system. The code inserts can be employed to deliver a malicious payload or backdoor malware. In Solana's case, it’s possible that a hacker attacked its iOS wallet libraries to extract private keys, based on the team's analysis.<\/span>","<span data-v-f87c67ca=\"\">Yakovenko came to his conclusion based the fact that exploited wallets didn’t have prior interactions with dApps and had remained inactive for some time. This indicates that hackers may have extracted private keys from Solana’s hot wallets not with the usual phishing attacks carried out with malicious links.<\/span>","<span data-v-f87c67ca=\"\">Gaining access to private keys means the hackers had the ability to transfer out funds from hot wallets, including Phantom and Slope wallet services.<\/span>","<span data-v-f87c67ca=\"\">Hot wallets are considered less secure than cold wallets as they stay connected to the internet. Cold wallets, meanwhile, store private keys within an offline hardware layer.<\/span>","While more than 7,000 Solana wallets have been hit in this hack, that's a tiny fraction of the total. There were about&nbsp;25 million active addresses on the network in July, according to data compiled by The Block.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/solana\/number-of-active-addresses-on-the-solana-network-monthly\/embed\" title=\"Number of Active Addresses on the Solana Network (Monthly)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">The Solana team previously stated that it had been working with engineers and several security firms to put its fingers on a definite vulnerability responsible for the incident. It also opened a survey to collect details on the 7,767 exploited wallets as it continues to look for further clues.<\/span>","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Apple","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"5 a.m.","content":"TIME"}],"hashtag":["HACKS","SOLANA"],"authors":["Vishal Chawla","The Block"]}