{"summary":"Crypto.com confirmed the ad is no longer live and argued that the company did not believe the NFTs available on its platform.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/196923\/uk-advertising-regulator-bans-crypto-nft-promotions","publishDate":"2022-12-21T05:09:47","id":13814,"type":null,"title":"UK advertising regulator bans Crypto.com, Turtle United NFT promotions","category":["METAVERSE & NFT"],"content":["The UK's advertising regulator has ruled against NFT promotions by Crypto.com and a project called Turtle United for failing to lay out the risks of investing in NFTs and not properly illustrating transaction fees.","The decision by the Advertising Standards Authority concerned paid Facebook ads for both Crypto.com and Turtle United from July.&nbsp;","Contesting the ruling, which concerned its NFT marketplace, Crypto.com confirmed the ad is no longer live and argued that the company did not believe the NFTs available on its platform, which included artists’ work and sports collectibles, to be financial in nature. It said that due to the fact NFTs were excluded from recent Treasury consultation papers on crypto, it believed they would be exempt from the financial rules of the ASA's code and should not have to make clear that profits from cryptocurrencies were subject to capital gains tax and that they were unregulated.","Nevertheless, the ASA upheld the complaint.&nbsp;","The ASA had similar concerns about <a href=\"https:\/\/www.asa.org.uk\/rulings\/turtle-united-nft-a22-1162126-turtle-united-nft.html\" data-v-f87c67ca=\"\">Turtle United<\/a>, which did not respond to its complaint. The regulator said that Turtle United did not make clear that past performance or experience does not necessarily give a guide for the future. The project claimed it was “offering a lot of value for its holders,” which implied the NFTs had an assured significant value, the ASA said.","Turtle United's current floor price is 0.02 ETH, or about $24, according to <a href=\"https:\/\/opensea.io\/collection\/turtle-united-genesis-collection\" data-v-f87c67ca=\"\">OpenSea data<\/a>. The mint price was advertised at 0.2 ETH, plus transaction fees.&nbsp;","The Block contacted Turtle United for comment but did not hear back before publication time.&nbsp;","The ruling represents a mere slap on the wrist for both companies, which have been told not to run the adverts in the same format again. Earlier this year the ASA said it would <a href=\"https:\/\/www.theblock.co\/linked\/110934\/uk-advertising-watchdog-crack-down-crypto-firms\" data-v-f87c67ca=\"\">step up<\/a> its focus on crypto advertising and introduce new guardrails for consumers.","In January, Crypto.com was <a href=\"https:\/\/www.theblock.co\/linked\/129097\/uk-regulator-bans-two-crypto-com-ads-in-latest-crackdown\" data-v-f87c67ca=\"\">reprimanded<\/a> by the ASA for two adverts which \"failed to illustrate the risks of the investment, were irresponsible and took advantage of consumers’ inexperience or credulity.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"UK","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Advertising Standards Authority","content":"ORGANIZATION"},{"type":"$24","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Turtle United","content":"ORGANIZATION"},{"type":"ASA","content":"ORGANIZATION"},{"type":"July","content":"DATE"}],"hashtag":[],"authors":["Lucy Harley-McKeown","The Block"]}