{"summary":"Two of the biggest NFT creators in the industry are joining forces as Yuga Labs acquires Proof, the company behind Moonbirds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277905\/bored-apes-creator-yuga-labs-acquires-proof-takes-over-moonbirds-nft-brand","publishDate":"2024-02-16T15:00:04","id":13817,"type":null,"title":"Bored Apes&#x27; creator Yuga Labs acquires Proof, takes over Moonbirds NFT brand","category":["NFT COLLECTIONS"],"content":["Yuga Labs, arguably the biggest NFT studio in the industry, is getting even bigger. The company announced it has acquired rival non-fungible token creator Proof, which is best known for its Moonbirds collection.","\"As a company committed to championing art, culture, and community on the blockchain, we’re excited to have PROOF join the Yuga ecosystem,\" said Yuga Labs CEO Daniel Alegre in a statement.","Yuga Labs declined to reveal any details regarding the acquisition when asked how much the company may have paid to acquire Proof, which was founded by entrepreneur Kevin Rose. Though Proof's <a href=\"https:\/\/www.theblock.co\/post\/240780\/kevin-roses-a16z-backed-moonbirds-launches-200-day-reveal-of-new-collection\" data-v-f87c67ca=\"\">Moonbirds<\/a> collection was at one time one of the more celebrated NFT brands on the market, it never managed to consistently match the sales volumes Yuga Labs' Bored Ape Yacht Club achieved.","In its statement, Yuga Labs said it planned to fold Moonbirds into its gamified, metaverse play Otherside. \"Moonbirds is a collection with great potential and many unifying brand elements with Otherside,\" Alegre said. \"We look forward to PROOF Collective becoming an important part of our ongoing art and community engagement efforts.\"","Overall NFT trading volumes, while rebounding somewhat since the end of last year, have continued to register far below what they did during its bull run of 2021 and 2022. Bored Ape Yacht Club's NFTs surpassed more than $200 million in monthly sales volume on multiple occasions during the period, according to <a href=\"https:\/\/www.cryptoslam.io\/bored-ape-yacht-club?headerPeriod=all&amp;tab=historical_sales_volume\" data-v-f87c67ca=\"\">CryptoSlam data<\/a>.","While the Moonbirds collection nearly hit $500 million in trading volume in April 2022, also according to <a href=\"https:\/\/www.cryptoslam.io\/moonbirds?headerPeriod=all&amp;tab=historical_sales_volume\" data-v-f87c67ca=\"\">CryptoSlam data<\/a>, since then the brand's NFTs have consistently generated less than $5 million in monthly sales.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/ethereum-art-and-collectibles-nft-trade-volume\/embed\" title=\"Ethereum Art and Collectibles NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"Kevin Rose, CEO &amp; Founder of Proof, will undergo a brief handover period before becoming an advisor to the company,\" Yuga Labs said in its statement. Other Proof brands that Yuga Labs will assume control of include Moonbirds' spinoff collections Oddities, Mythics, and Grails.","Rose said in the statement that Proof is both \"excited to bring Moonbirds into Otherside\" and that the two companies' \"combined resources will allow us to innovate faster and reach more people.\"","In 2022, Andreessen Horowitz, known also as a16z, led a $50 million <a href=\"https:\/\/www.theblock.co\/post\/166580\/a16z-leads-50-million-in-funding-for-nft-organization-proof-collective\" data-v-f87c67ca=\"\">Series A fundraise<\/a> for Proof. A16z also <a href=\"https:\/\/www.theblock.co\/linked\/138834\/bored-apes-creator-yuga-labs-raises-450-million-in-round-led-by-a16z-report\" data-v-f87c67ca=\"\">invested<\/a> in Yuga Labs in 2022.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Daniel Alegre","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Yuga Labs","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"\" Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Kevin Rose","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Moonbirds","content":"PERSON"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"\" Alegre","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"CEO &amp; Founder of Proof","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BAYC"],"authors":["RT Watson","The Block"]}