{"summary":"Joseph Bankman and Barbara Fried said the familial relationship is &quot;not actionable&quot; and denied involvement in allegedly fraudulent transfers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273043\/sbf-parents-dismiss-ftx-lawsuit","publishDate":"2024-01-17T01:33:08","id":13828,"type":null,"title":"Sam Bankman-Fried&#x27;s parents seek to dismiss FTX lawsuit against them","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">FTX Founder Sam Bankman-Fried’s parents are attempting to have the lawsuit filed by the exchange against them dismissed, as they argued that they were not involved in allegedly fraudulent transfers or breaches of fiduciary duties.<\/span>","<span data-v-f87c67ca=\"\">In a <\/span><a href=\"https:\/\/www.courtlistener.com\/docket\/67806768\/20\/ftx-trading-ltd-adversary-proceeding\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filing<\/span><\/a> dated Monday,<span data-v-f87c67ca=\"\">&nbsp;the lawyers for Joseph Bankman and Barbara Fried said that plaintiffs — including debtors of FTX and Alameda Research — sought to “capitalize on the sheer fact that Defendants’ son was a founder and executive of the Debtor entities.”<\/span>","<span data-v-f87c67ca=\"\">“That relationship is not actionable,” said the attorneys for Bankman and Fried. “While Plaintiffs allege Defendants interacted with the Debtor entities in limited capacities, neither Defendant ever held an executive role of any sort.”<\/span>","<span data-v-f87c67ca=\"\">The Monday document to support their motion to dismiss the lawsuit came after FTX <\/span><a href=\"https:\/\/www.theblock.co\/post\/251658\/ftx-sues-sbf-parents\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">filed a complaint in September 2023<\/span><\/a><span data-v-f87c67ca=\"\"> against Bankman-Fried’s parents to <\/span><span data-v-f87c67ca=\"\">recover damages caused by fraudulent transfers, breaches of fiduciary duties and other alleged misconduct.<\/span>","<span data-v-f87c67ca=\"\">“As Bankman-Fried’s parents, Bankman and Fried exploited their access and influence within the FTX enterprise to enrich themselves, directly and indirectly, by millions of dollars, and knowingly at the expense of the debtors in these Chapter 11 Cases and their creditors,” the plaintiffs said in the September filing.<\/span>","<span data-v-f87c67ca=\"\">The plaintiffs argued that Bankman had described Alameda as a “family business” and purchased a $16.4 million luxury property in The Bahamas, referred to as “Blue Water” or “Old Fort Bay,” with the funds sourced from cash provided by the debtors.<\/span>","<span data-v-f87c67ca=\"\">Bankman and Fried denied the claims, saying that Bankman’s familial relationship and communications to Bankman-Fried “do not make Mr. Bankman, by association, a de facto director of Alameda or FTX US.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The attorneys said the lawsuit does not allege that the parents used Blue Water as their primary or exclusive residence. “Debtors are well aware that at the times relevant to the Blue Water transaction, many FTX Group operations and business properties were located in the Bahamas, and FTX employees lived and worked there.”<\/span>","<span data-v-f87c67ca=\"\">The lawsuit also alleged that <\/span><span data-v-f87c67ca=\"\">Bankman and Fried pushed for tens of millions of dollars in political and charitable contributions, including to Stanford University, “which were seemingly designed to boost Bankman’s and Fried’s professional and social status at the expense of the FTX Group.”<\/span>","<span data-v-f87c67ca=\"\">The parents’ lawyers argued that such an allegation is “of no legal significance,” as it does not allege that Bankman or Fried received funds donated to Stanford or received any “undefined benefit” as a result of that donation.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Barbara Fried","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Fort Bay","content":"LOCATION"},{"type":"Stanford University","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"The Bahamas","content":"LOCATION"},{"type":"FTX US","content":"ORGANIZATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"September 2023","content":"DATE"},{"type":"$16.4 million","content":"MONEY"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Joseph Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","FTX","LAWSUITS","SAM BANKMAN-FRIED"],"authors":["Timmy Shen","The Block"]}