{"summary":"Metaverses will be decentralised in name only if action is not taken to address digital property rights, argues the report by Galaxy Digital.\nEven if users own the rights to user-generated content, there is no guarantee that the operator of a metaverse will support it within their virtual world.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/164529\/metaverse-platforms-must-act-now-to-offer-different-ownership-vision-to-web2-giants-report","publishDate":"2022-08-21T04:27:31","id":1382,"type":null,"title":"Metaverse platforms must act now to offer different ownership vision to web2 giants: report","category":["Gaming and Metaverse"],"content":["Decentralised metaverses will be decentralised in name only if action is not taken to address digital property rights, according to a new Galaxy Digital report on non-fungible token (NFT) licenses.","Published on Friday, the <a href=\"https:\/\/www.galaxy.com\/research\/insights\/a-survey-of-nft-licenses-facts-and-fictions\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">report<\/a> authors — head of firmware research Alex Thorn, Galaxy Legal director Michael Marcantinio and Galaxy Research’s Gabe Parker — warned that if the digital property of the metaverse is not owned by its users, the technology could provide the designs for something like an all-encompassing social credit system.","“If these problems are not addressed now, the supposed decentralized metaverses will not materially differ from those being built by Web2 giants like Meta (Facebook),” they said.","The report looked at metaverse licensing agreements for The Sandbox and Decentraland in order to understand how real-world copyright and trademarks are perceived in the metaverse landscape. It concluded that both do a “decent job” of attempting to assign ownership to their users for user-generated content, but in both cases the companies retain all intellectual property related to the sales of land parcels in their metaverses, merely assigning usage rights to NFT purchasers.","But even if users own the rights to user-generated content, there is no guarantee that the operator of a metaverse will support it within their virtual world. Content moderation policies allow them to ban or remove content regardless of IP rights.","“Simply owning the rights to a custom-made character skin, for example, does not guarantee that Decentraland or Sandbox will allow the skin to be used within the game… absent a third-party alternative world in which to deploy your user-generated content, its effective use relies upon the consent of the metaverse operator,” they said.","It also took aim at Yuga Lab’s upcoming metaverse project, Otherside, and its land NFTs, Otherdeeds. NFT token holders have commercial rights for other Yuga Labs collections such as the Bored Ape Yacht Club, however Otherdeeds do not grant these.","“The Otherside agreement is explicit that purchasing Otherdeed NFTs conveys no intellectual property rights,” noted the report.","Responding to the report, Sandbox COO and co-founder told The Block that, owing to tokens in its ecosystem being on the blockchain, they have the ability to be used on other platforms or sold on marketplaces.&nbsp;","\"We believe we are still delivering the decentralize metaverse approach that differs from the one built by Web2 giants, where users have no control and no ownership whatsoever of their digital content and data,\" he added, also noting that, as per the company's roadmap, the content moderation process itself is set to be decentralized.&nbsp;"],"hashtag":["DECENTRALAND","OTHERSIDE","THE SANDBOX","YUGA LABS"]}