{"summary":"The move is partly designed to assist victims of Celsius’ bankruptcy with outstanding ether loans to refinance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/279592\/ledn-ether-backed-loans","publishDate":"2024-02-28T10:01:26","id":13829,"type":null,"title":"Ledn launches ether-backed loans as it preps to onboard former Celsius users","category":["COMPANIES"],"content":["Crypto lending platform Ledn has expanded to support loans collateralized in ether, having previously only offered bitcoin-backed loans. This expansion aims to support those affected by the bankruptcy of Celsius.","\"Until recently, Ledn only offered loans backed by bitcoin. However, as the crypto industry matures, more digital assets are proving their worth and resilience,\" Ledn Chief Investment Officer John Glover said in a statement.","Ledn’s new product allows users to access liquidity in their ether assets tax efficiently, avoiding the capital gains taxes that arise from selling crypto. Customers can take out USDC, U.S. dollar or other fiat currency loans, with the ether collateral return once repaid.","Consistent with Ledn’s bitcoin product, the ether-backed loans start at a loan-to-value ratio of 50%, with annual interest rates from 10.4% (12.4% APR), the firm stated. The loans are available globally, with small minimums, no monthly payments and flexible repayment options — typically funded within 24 hours, Ledn added.","Users can choose between “standard” or “custodied” loans — with the former giving Ledn the right to lend the collateral to earn interest, and the latter held in custody with qualified custodians and banks, <a href=\"https:\/\/ledn.io\/borrowing\" data-v-f87c67ca=\"\">according<\/a> to its website.","The move is partly designed to assist the victims of Celsius’ <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">bankruptcy<\/a> in July 2022 by allowing those who still have outstanding ether loans to refinance with Ledn, the Caymans-based firm said. Ledn expects to onboard the majority of former Celsius customers looking to refinance their loans elsewhere, having received interest totaling more than $45 million worth of bitcoin and ether-backed loans.","Celsius <a href=\"https:\/\/www.theblock.co\/post\/275461\/celsius-network-starts-3-billion-payout-emerging-from-bankruptcy\" data-v-f87c67ca=\"\">emerged<\/a> from Chapter 11 bankruptcy in January and has since distributed $3 billion worth of cryptocurrency and fiat to its creditors.","In September 2023, Ledn expanded its <a href=\"https:\/\/www.theblock.co\/post\/253396\/ledn-ether-crypto-savings-yields\" data-v-f87c67ca=\"\">crypto savings<\/a> product to include ether, adding to the crypto lender’s bitcoin, USDC and USDT savings products, with annualized yields of up to 4% APY as an alternative to staking solutions.","Ledn claims it has processed nearly $5 billion in bitcoin-backed loans since 2018.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fiat","content":"ORGANIZATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"John Glover","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"12.4%","content":"PERCENT"},{"type":"10.4%","content":"PERCENT"},{"type":"Ledn","content":"PERSON"},{"type":"$45 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Caymans","content":"ORGANIZATION"},{"type":"September 2023","content":"DATE"},{"type":"July 2022","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["James Hunt","The Block"]}