{"summary":"A cryptocurrency settlement solution provider now enables over-the-counter (OTC)desks to avoid the responsibility of cryptocurrency custody while also","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/42313\/crypto-clearinghouse-partners-with-otc-desks-to-minimize-default-risk-in-crypto-trading","publishDate":"2019-10-07T11:58:50","id":13838,"type":null,"title":"A startup aiming to be crypto&#x27;s &quot;clearinghouse&quot; has come up with a way to decrease risk in OTC","category":["CAPITAL MARKETS"],"content":["A cryptocurrency settlement solution provider now enables over-the-counter (OTC)desks to avoid the responsibility of cryptocurrency custody while also minimizing counterparty risk.","<span data-v-f87c67ca=\"\">KeyTango, an Israel-based startup that offers non-custodial clearing services, recently piloted options trading with OTC firm GSR Markets, in which the OTC desk did not<\/span><span data-v-f87c67ca=\"\"> receive the seller’s collateral in advance. <\/span><span data-v-f87c67ca=\"\">Instead, the seller deposited his collateral in a digital wallet with three key shares, held separately by GSR, the seller, and an agreed-upon arbitrator. <\/span><span data-v-f87c67ca=\"\">Funds locked in the wallet can only be transferred when two of the three key shareholders co-sign the transaction. According to KeyTango CEO Dan Danay, this design delegates the custody responsibility to three parties while also assuring GSR that collateral is deposited.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Currently, in cryptocurrency trading, traders have to deposit funds with OTC desks and exchanges before they can make a trade. This practice could expose traders to risk of the exchanges or OTC desks losing their funds in a hack.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In traditional asset trading, this problem is usually handled by clearinghouses, which act as middlemen between OTC desks and traders to guarantee the enforcement of a trade. Similarly, KeyTango, which claims to the \"clearinghouse\" in crypto trading, provides digital wallets to which clients can deposit their funds instead of handing them over to OTC desks for safekeeping. To settle a trade, the trading desk and the client can use their key shares to co-sign a transaction.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">KeyTango secures its wallets with multi-party computation (MPC), a cryptographic technique in which several key shares are generated, stored separately, and computed collectively to authorize transactions. Under the MPC scheme, authorizing a transaction from the wallet does not require all key shares to be used, only the majority. In the event one side of the trade fails to authorize a transaction, an arbitrator can step in and co-sign.<\/span>","<span data-v-f87c67ca=\"\">“Basically we use MPC to completely decouple running the logic layer in doing any kind of centralized crypto trading, and doing the actual settlement,” said Danay.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To be sure, multi-signature, another cryptographic scheme that has been widely adopted in securing digital wallets, can also facilitate the clearing and settling process that KeyTango is offering with MPC. However, Danay said that multi-signature does not satisfy their needs to settle in different cryptocurrencies.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The comparison between MPC and Multi-signature is exactly like in custody. If you want to do this with multisig, you will be limited to the chains that actually support multisig contracts you can actually trust,” said Danay.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, although non-custodial trading is a feature for decentralized exchanges and many DeFi protocols, in centralizing crypto trading, a clearinghouse is still needed so that neither side of the trade is exposed to counterparty risk. According to Daney, they have onboarded several OTC desks and lending firms as clients, some of which will be announced soon.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We are excited to be involved in the advancement of this new technology. It not only reduces the counterparty risk prevalent in trading digital assets but also helps decentralize the trading process, which is key for the industry’s development,” said GSR co-founder Cris Gil.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Danay","content":"PERSON"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Israel","content":"LOCATION"},{"type":"OTC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Dan Danay","content":"PERSON"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Daney","content":"LOCATION"},{"type":"Cris Gil","content":"PERSON"}],"hashtag":["DERIVATIVES"],"authors":["Celia Wan","The Block"]}