{"summary":"Nasdaq is no longer pursuing plans for a crypto custody service because of regulatory concerns, CEO Adena Friedman said in an earnings call this morning.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240538\/nasdaq-halts-plans-to-custody-crypto-citing-regulatory-concerns","publishDate":"2023-07-19T09:58:44","id":13831,"type":null,"title":"Nasdaq halts plans to custody crypto citing regulatory concerns","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Nasdaq is no longer pursuing plans for a crypto custody service, citing business and regulatory concerns, CEO Adena Friedman said in an earnings call on Wednesday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“<\/span><span class=\"s2\" data-v-f87c67ca=\"\">This quarter, considering the shifting business and regulatory environment in the U.S., we have made the decision to halt our launch of the U.S. digital assets custodian business and our related efforts to pursue relevant license,” Friedman said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The exchange operator had been <a href=\"https:\/\/www.theblock.co\/post\/222866\/nasdaq-says-institutional-appetite-in-crypto-is-steady-as-it-plots-push-into-custody-trading\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">awaiting<\/span><\/a> approval from the New York Department of Financial Services by the end of June to begin offering custody services to clients. Nasdaq announced its intention to move into the space following the collapse of Three Arrows last July and had forged forward, despite a slump in the crypto market.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Friedman said the exchange plants to keep building out technology to “<\/span><span class=\"s2\" data-v-f87c67ca=\"\">position Nasdaq as a leading digital assets software solutions provider to the broader global industry.\"<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Nasdaq <a href=\"https:\/\/www.theblock.co\/post\/237563\/blackrock-refile-for-spot-bitcoin-etf-naming-coinbase-as-surveillance-partner\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">partnered<\/span><\/a> with BlackRock for a spot bitcoin ETF that's currently awaiting approval from the Securities and Exchange Commission. The SEC has yet to greenlight such a product, previously citing concerns of fraud and manipulation.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“More broadly, we remain committed to supporting the evolution of the digital assets ecosystem in a variety of ways, among them, through our ongoing engagement with regulators, the delivery of comprehensive technology solutions across the trade life cycle, and through our partnerships with potential ETF issuers to support tradable exchange listed products,” Friedman said.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Adena Friedman","content":"PERSON"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Friedman","content":"PERSON"},{"type":"end of June","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"This quarter","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}