{"summary":"Copper&#x27;s insurance covers employee collusion, third-party theft and physical loss — and accompanies its existing Aon-brokered crime insurance policy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184601\/copper-cold-storage-insurance-fund-500-million","publishDate":"2022-11-09T02:53:18","id":1383,"type":null,"title":"Copper&#x27;s cold-storage insurance fund hits $500 million","category":["CRYPTO INFRASTRUCTURE"],"content":["Copper, an institution-grade crypto infrastructure provider, has $500 million of insurance for digital assets in cold storage. The cover uses a panel of specialty insurer Canopius-led insurers and was arranged by Aon, a professional services firm.","The insurance covers employee collusion, third-party theft and physical loss, according to a press release, and accompanies Copper's existing Aon-brokered crime insurance policy.","Copper cites a growing demand for cold-storage solutions and offline protection from institutional-level industry and market participants as driving its insurance solution.","The firm's announcement comes less than 24 hours after embattled crypto exchange FTX halted user withdrawals — freezing many customers' funds in the process and putting the topics of cold storage and offline custody toward the forefront of the discussion.","“People have a legitimate reason to worry about the security of their digital assets if one of the world’s largest centralized exchanges ends up in financial difficulties,” Pascal Gauthier, CEO of Paris-based Ledger, <a href=\"https:\/\/www.theblock.co\/post\/184423\/ftxs-bankman-fried-gets-binance-bailout-in-stunning-reversal-of-fortune\" data-v-f87c67ca=\"\">said<\/a> in a statement. “The message has never been more urgent: If you don’t own your keys, you don’t own your crypto, regardless of whatever reassurances are published in the coming days.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$500 million","content":"MONEY"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Pascal Gauthier","content":"PERSON"},{"type":"Aon","content":"ORGANIZATION"},{"type":"Canopius","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["SECURITY FIRMS","WALLET MAKERS"],"authors":["Adam James","The Block"]}