{"summary":"SEC alleges defendants’ $14.6 million ICO was an unregistered securities offering under Howey Test. Also, SEC accuses broker-dealer violations in $650 million raised for 30+ projects.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/40179\/sec-sues-icobox-and-founder-for-14m-ico-and-650m-broker-dealer-violations","publishDate":"2019-09-18T18:23:14","id":13832,"type":null,"title":"SEC sues ICOBox and founder: $14M ICO and $650M in Broker-Dealer Violations","category":["LEGAL"],"content":["<a href=\"https:\/\/www.sec.gov\/litigation\/complaints\/2019\/comp-pr2019-181.pdf\" data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Link to Complaint<\/strong><\/a>","The SEC filed a lawsuit in federal court in the Central District of California today against \"ICOBox\" and its founder Nikolay Evdokimov. According to the Complaint, the defendants violated federal securities laws by selling tokens that were unregistered securities and acting as an unregistered broker dealer.","The Complaint alleges that \"[s]ince August 2017, ICOBox and Evdokimov have engaged in both the unregistered offering of securities through a $14.6 million ICOBox token sale, as well as the unregistered broker activities related to securities offered by ICOBox’s clients, exposing thousands of investors to risky investments without providing the necessary information and protections required by the federal securities laws.\"","The idea behind ICOBox was that in exchange for payment from potential issuers ICOBox would allow holders of its token, maddeningly called ICOS, to swap their tokens for tokens issued by ICOBox's anticipated clients. Suffice it to say that (according to the SEC) things didn't work out as expected and \"ICOBox has facilitated far fewer than 100 clients’ token sales total—let alone 100 per month. In addition, the company has discontinued the ability to swap ICOS tokens, rendering them useless. ICOS tokens now trade, if at all, at approximately $2.41, a fraction of the offering purchase price—roughly 1\/20th of the average purchase price during the offering.\"","Nonetheless, Since August 2017, the defendants allegedly facilitated tokens sales for over 30 clients, raising more than $650 million, and earning significant fees as a part of that process. At least one of those sales, per the SEC, for Paragon Coin, Inc., was a securities offering under the Howey Test.","The Complaint contains two counts. The first is for the unregistered sale of ICOBox's tokens, which the SEC alleges are securities under the Howey Test. The second count alleges that the defendants violated federal law by failing to register as brokers while \"actively solicit[ing] investors for ICOBox’s clients, and receiv[ing] transaction-based compensation for their services, in the form of “success” fees based on the amounts raised from investors during ICOBox’s clients’ ICOs.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nikolay Evdokimov","content":"PERSON"},{"type":"ICOS","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$14.6 million","content":"MONEY"},{"type":"$650 million","content":"MONEY"},{"type":"$2.41","content":"MONEY"},{"type":"Central District of California","content":"LOCATION"},{"type":"August 2017","content":"DATE"},{"type":"Paragon Coin, Inc.","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}