{"summary":"Got DeFi gains? The IRS wants their cut by the 18th of April 2022. Don’t panic - we’re unraveling everything you need to know about crypto tax in our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/141039\/defi-tax-weve-asked-koinly-to-demystify-the-mysterious","publishDate":"2022-04-07T09:00:07","id":13837,"type":null,"title":"DeFi Tax? Koinly demystifies the mysterious.","category":["SPONSORED"],"content":["<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Got DeFi gains? The IRS wants their cut by the 18th of April 2022. Don’t panic - we’re unraveling everything you need to know about crypto tax in our how-to guide.<\/span><\/i>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The IRS has made it very clear you need to pay tax on your crypto and report crypto gains and income in your annual Income Tax return. What’s less clear though is how exactly some DeFi crypto transactions are taxed. The IRS guidance hasn’t been updated since 2019, so while they cover the basics, they’ve left more recent market developments - like DeFi and NFTs, shrouded in mystery..<\/span><\/i>","<i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">But don’t think you’re off the hook! There’s enough guidance to infer the tax implications of DeFi in the US.&nbsp; <\/span><\/i><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Head of Tax, Tony Dhanjal at crypto tax calculator <\/i><\/b><a href=\"https:\/\/koinly.io\/?utm_source=theblockcrypto&amp;utm_medium=guest-blog-2\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Koinly<\/i><\/b><\/a><b data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">,<\/i><\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"> spills the tea.<\/span><\/i>","<span data-v-f87c67ca=\"\">DeFi tax gets <\/span><b data-v-f87c67ca=\"\">complicated<\/b><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">. <\/span><\/i><span data-v-f87c67ca=\"\">It all depends on how the specific protocol you’re using works.<\/span>","<span data-v-f87c67ca=\"\">Buying, trading or selling on dexes? Easy. Follow the same Capital Gains Tax rules as you would for any other crypto coin or token.<\/span>","<span data-v-f87c67ca=\"\">Staking, liquidity mining, yield farming or lending? Whatever you’re up to -&nbsp; the taxes you’ll pay all depends on how your specific protocol works, it could be subject to Capital Gains Tax or Income Tax. It all boils down to whether you earn new tokens or whether the price of your token increases.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Let’s take a look at some different examples from popular protocols and how they’re taxed.<\/span>","<span data-v-f87c67ca=\"\">Liquidity pools essentially break down into three transactions - each of which may be taxed differently:<\/span>","<span data-v-f87c67ca=\"\">You might think that adding and removing liquidity from a given pool is tax free - but it’s not quite that simple because of liquidity pool tokens. When you add liquidity to a given pool, you’ll get LP tokens in return - representing your capital in the pool. Similarly, when you want to remove your capital, you’ll trade your LP tokens back for your capital.<\/span>","<span data-v-f87c67ca=\"\">From a tax perspective, this could be seen as a crypto to crypto trade - which means this transaction will realize a capital gain or loss, and&nbsp; is subject to Capital Gains Tax.<\/span>","<span data-v-f87c67ca=\"\">When it comes to earning through liquidity pools - it all depends on how your specific liquidity pool works, so we’ll use a couple of examples.<\/span>","<span data-v-f87c67ca=\"\">For example, let’s say you added liquidity to a pool on PancakeSwap. You get liquidity pool tokens in return representing your stake in the pool and you get a percentage of the transaction fees as a reward. Your rewards aren’t paid out in the form of new tokens though. Instead, the value of your LP tokens increases. It’s only when you remove your capital from the pool that you’ll realize a profit. This example is more akin to a capital transaction and you’d pay Capital Gains Tax on any profit at the point you realize it. Any other protocols that work like this would be subject to the same tax treatment.<\/span>","<span data-v-f87c67ca=\"\">Now let's say you want to add to a Compound lending pool instead. Like above, you'll get cTokens that represent your capital in the lending pool and these cTokens will accrue value as you earn. So adding and removing liquidity (and some of your rewards) would still be subject to Capital Gains Tax when you transfer capital - like above. However, you'll also receive COMP tokens. You earn new COMP tokens - which you can claim at any time. Because you're earning new tokens, this is more likely to be seen as a kind of additional income and you'd pay Income Tax based on the fair market value of your tokens at the point you received them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Staking can refer to two different activities in the DeFi space - although they’re both similar from a tax perspective.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If you’re staking as part of a proof of stake consensus mechanism - for example if you’re staking ADA, AVAX or SOL - it’s likely that you need to pay Income Tax based on the fair market value of any staking rewards at the point you receive them. However, this is currently being <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/134387\/why-the-irss-settlement-offer-in-a-tennessee-crypto-staking-tax-case-doesnt-mean-much-yet\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">challenged in court<\/span><\/a><span data-v-f87c67ca=\"\">, so the tax treatment of staking&nbsp; could be set to change in the future.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, if you’re staking tokens in various DeFi protocols in order to earn more rewards - like with liquidity pools - it all depends on how your specific DeFi protocol works.<\/span>","<span data-v-f87c67ca=\"\">SushiSwap is a great example for both of the different kinds of tax you could pay. For example, you can stake your SLP tokens and KMP tokens to earn SUSHI tokens. As you're earning new SUSHI tokens, you'll need to pay Income Tax based on the fair market value of your SUSHI tokens (in USD) at the point you receive them.<\/span>","<span data-v-f87c67ca=\"\">You can then stake your SUSHI tokens in the Sushi bar to earn XSUSHI. When you stake your SUSHI tokens though - you'll receive XSUSHI tokens in return. XSUSHI - like SLP and KMP tokens - accrue value. So you'll only realize a gain when you unstake your SUSHI by exchanging your XSUSHI tokens back. This would be more like a trade and therefore you'll pay Capital Gains Tax on any profits from trading your SUSHI tokens instead, both when staking and removing your stake.<\/span>","<span data-v-f87c67ca=\"\">Yield farming tax - like above - all comes down to how your specific DeFi protocol works.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For example, if you’re using the Inari yield farming protocol on SushiSwap - then you’re effectively trading SUSHI for XSUSHI - even if your SUSHI is then being lent out through different protocols in order to earn returns. This would be seen as crypto trade and any profits subject to Capital Gains Tax.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, if you were using PancakeSwap to stake LP tokens to earn CAKE (or even then staking that CAKE in order to earn more CAKE or tokens) then you earn new tokens as a result of your activities. This is more likely to be seen as additional income, so you'd pay Income Tax based on the fair market value of your tokens at the point you received them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">We’ll include NFTs here as a little bonus, because the rules are just as muddy as they are for DeFi. From a tax perspective - NFTs aren’t all that different to any other token. They’re still seen as a kind of property and when you dispose of NFTs by selling or trading them, you’ll pay Capital Gains Tax on any profit you make.<\/span>","<span data-v-f87c67ca=\"\">We’ll include a caveat here though that the tax treatment of sold NFTs depends on whether you made the NFT. If you’re creating and selling NFTs (like a regular artist with a paintbrush), you’ll pay Income Tax instead.<\/span>","<span data-v-f87c67ca=\"\">There’s also the potential that in the future the IRS decides to tax some NFTs under the special collectibles tax rate of 28%,&nbsp; instead of the maximum long-term Capital Gains Tax rate of 20%.<\/span>","<span data-v-f87c67ca=\"\">The IRS will spare you taxes on a select few occasions, including:<\/span>","<span data-v-f87c67ca=\"\">Now you get how it’s taxed, you can see how much of a hellscape crypto tax reporting is. We haven’t even got to the worst part either because not only do the IRS want a cut of your crypto gains and income - but the reporting requirements are heavy.<\/span>","<span data-v-f87c67ca=\"\">You’ll need to report <\/span><b data-v-f87c67ca=\"\">every single<\/b><span data-v-f87c67ca=\"\"> disposal of crypto&nbsp; in Form 8949, your net capital gain and loss in Schedule D, any income from crypto in Schedule 1 and add all this to Form 1040. It should go without saying but for investors involved in DeFi, this is potentially thousands of transactions that they need to report.<\/span>","<span data-v-f87c67ca=\"\">Save yourself hours of pain, use <\/span><a href=\"https:\/\/koinly.io\/?utm_source=theblockcrypto&amp;utm_medium=guest-blog-2\" data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Koinly<\/b><\/a><span data-v-f87c67ca=\"\"> crypto tax calculator and follow these 5 easy steps to file your crypto taxes instead:<\/span>","<b data-v-f87c67ca=\"\"><\/b><span data-v-f87c67ca=\"\">That’s it - you’re done. If you’d like to learn more about crypto tax - check out Koinly’s <\/span><a href=\"https:\/\/koinly.io\/cryptocurrency-taxes\/?utm_source=theblockcrypto&amp;utm_medium=guest-blog-2\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">ultimate US crypto tax guide<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","&nbsp;","<strong data-v-f87c67ca=\"\">Disclosures<\/strong><br data-v-f87c67ca=\"\">\nThis post is commissioned by Koinly. This report is for informational purposes only and should not be relied upon as a basis for investment decisions, nor is it offered or intended to be used as legal, tax, investment, financial or other advice. You should conduct your own research and consult independent counsel on the matters discussed within this report. Past performance of any asset is not indicative of future results.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n© 2022 The Block Crypto, Inc. All Rights Reserved.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"The Block Crypto, Inc","content":"ORGANIZATION"},{"type":"LP","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"18th of April 2022","content":"DATE"},{"type":"KMP","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Inari","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"Tony Dhanjal","content":"PERSON"},{"type":"28%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"SLP","content":"ORGANIZATION"},{"type":"PancakeSwap","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}