{"summary":"Three Arrows Capital co-founder Su Zhu, who was a prominent Luna supporter, has weighed in following its sudden collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146783\/luna-backer-su-zhu-says-ust-collapse-is-terras-dao-hack-moment","publishDate":"2022-05-13T06:59:57","id":13830,"type":null,"title":"Luna backer Su Zhu says UST collapse is ‘Terra&#x27;s DAO hack moment’","category":["STARTUPS"],"content":["Three Arrows Capital co-founder Su Zhu has broken his silence on the collapse of the stablecoin TerraUSD (UST) and its related token Luna, an ecosystem he had supported.","“This has been an incredibly humbling week and [it’s] difficult to find the right words,” he <a href=\"https:\/\/twitter.com\/zhusu\/status\/1525045035070275585\" data-v-f87c67ca=\"\">wrote<\/a> on Twitter on Friday after UST, the algorithmic stablecoin at the center of the Terra blockchain, lost parity with the US dollar this week.","Zhu acknowledged that a number of things had gone wrong. He noted critics had flagged the potential risks, adding that the ecosystem should have moved more slowly in the hope of being safer.","He also said that criticisms of blockchain projects — something often dismissed by loyal supports as “fear, uncertainty and doubt” or FUD — should not be rejected. Instead it should be encouraged and any such criticisms should be met with actual refutations, rather than dismissal.","<span data-v-f87c67ca=\"\">Zhu deleted the tweet about using Anchor. Image: CryptoDeleted.<\/span>","Earlier this month, Zhu had encouraged his Twitter following to take out loans using their bitcoin as collateral. He suggested they should use the proceeds to buy UST and stake in Anchor Protocol for the 18-20% yield. Anyone who had followed this advice and had not sold would have lost practically all of their money and would not be able to pay back the loan. Zhu has since deleted this tweet.","Zhu apologized to his critics and said he should have been more cautious.&nbsp;","As for the blockchain itself, Zhu said, “This is Terra's DAO hack moment.”","This refers to when the first decentralized autonomous organization (DAO) was set up on Ethereum, known as The DAO. It was hacked for $50 million in 2016. Yet becasue The DAO involved so much of the ether supply and the hack was effectively fixed in code, solving the problem meant modifying the network significantly.&nbsp;","Developers eventually forked the chain currently known as Ethereum off the original chain. The original chain ended up surviving and is known to this day as Ethereum Classic.","Currently the Terra blockchain has been taken offline after the UST stablecoin lost its peg to the US dollar and this created a vicious cycle of supply increases and price decreases for its related token Luna. Currently the community is <a href=\"https:\/\/agora.terra.money\/t\/luna-go-forward-proposal\/7136\" data-v-f87c67ca=\"\">weighing up<\/a> what to do next and how to bring the project back to life.","As for Zhu, he said, “I will not pretend to know what the future holds but I will do my part to help.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2016","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"Su Zhu","content":"PERSON"},{"type":"Terra blockchain","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Zhu","content":"PERSON"},{"type":"$50 million","content":"MONEY"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["SU ZHU","THREE ARROWS CAPITAL"],"authors":["Tim Copeland","The Block"]}