{"summary":"Binance&#x27;s new CEO Richard Teng said the exchange will focus on a commitment to users and regulatory collaboration.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/264776\/richard-teng-outlines-binance-vision-after-taking-over-from-ceo-cz","publishDate":"2023-11-27T09:17:07","id":13844,"type":null,"title":"CEO Teng outlines &#x27;responsible growth&#x27; vision amid Binance’s compliance overhaul","category":["PEOPLE"],"content":["New Binance CEO Richard Teng outlined his vision for the crypto exchange in his first <a href=\"https:\/\/www.binance.com\/en\/blog\/from-our-ceo\/my-first-blog-as-binances-ceo-2887294642016890803\" data-v-f87c67ca=\"\">blog post<\/a> since replacing Changpeng Zhao last week, focusing on a commitment to regulatory collaboration.","Zhao <a href=\"https:\/\/www.theblock.co\/post\/253681\/changpeng-cz-zhao-steps-down-as-binance-ceo\" data-v-f87c67ca=\"\">pleaded guilty<\/a> in a Seattle court last week to violating and causing a financial institution to violate the U.S. Bank Secrecy Act. He also agreed to pay a $50 million fine and step down as CEO as part of the plea deal.&nbsp;","The U.S. Department of Justice <a href=\"https:\/\/www.theblock.co\/post\/264010\/justice-department-set-to-announce-settlement-with-binance-bloomberg\" data-v-f87c67ca=\"\">settled<\/a> the connected criminal case with Binance, which probed into alleged money laundering, fraud and sanctions violations. The crypto exchange will pay a $4.3 billion fine, marking one of the largest corporate settlements in U.S. history.","Teng previously worked as Binance’s Global Head of Regional Markets. He also has extensive regulatory experience, serving as the CEO of the Financial Services Regulatory Authority at Abu Dhabi Global Market, chief regulatory officer at the SGX and spending 13 years at financial watchdog the Monetary Authority of Singapore.","In the blog post, Teng wrote that Binance remained committed to bringing value to its users and deliver products. The company’s fundamentals remain “very strong,” Teng asserted, noting that it continues to operate the world's largest cryptocurrency exchange by volume. “You should feel confident in the financial strength, security and safety of the company,” he said.","Teng also noted Binance’s proof of reserves system and 1:1 backing for user assets. However, many have <a href=\"https:\/\/www.theblock.co\/post\/187240\/exchanges-rushed-to-show-proof-of-reserves-its-not-enough\" data-v-f87c67ca=\"\">criticized<\/a> these measures which fail to reveal audited fiat reserves, client and company liabilities and other information to assess a firm’s financial health. Teng also declined to provide specifics on this in an <a href=\"https:\/\/fortune.com\/crypto\/2023\/11\/27\/new-binance-ceo-richard-teng-board-financial-disclosures\/\" data-v-f87c67ca=\"\">interview<\/a> with Fortune published today but said he has a “robust timeline” for it.","Binance had “turned the page” on its historical challenges, Teng added, addressing prior compliance issues by recruiting the right personnel to revamp its compliance program and culture.","With a renewed focus on collaborating with policymakers, and working with peers across the crypto industry, Teng said Binance can “contribute to the development of a globally harmonized regulatory framework that will foster innovation while providing critical consumer protections.”","It remains to be seen if Binance’s users will be convinced by Teng’s statements, with the exchange seeing over $1 billion in outflows since the DOJ settlement and its market share among non-USD exchanges slipping below 45% from 70% at the start of the year amid its regulatory issues, according to The Block’s <a href=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/no-usd-support-exchange-volume-market-share\" data-v-f87c67ca=\"\">data dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/no-usd-support-exchange-volume-market-share\/embed\" title=\"No USD Support Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Beyond the centralized Binance exchange, Teng added he intended to help drive the adoption of web3 and decentralized applications.","“As we usher in the next phase of Binance’s responsible growth, I am excited for the opportunity to engage in a meaningful conversation with global policymakers, to ensure crypto investors remain confident in the industry’s future and to engage and educate the next billion users so that we may work to ensure the long-term sustainability of crypto,” Teng said.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"the SGX","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Binance’s Global Head of Regional Markets","content":"ORGANIZATION"},{"type":"Abu Dhabi Global Market","content":"ORGANIZATION"},{"type":"Teng","content":"PERSON"},{"type":"the Financial Services Regulatory Authority","content":"ORGANIZATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Seattle","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BINANCE","CZ"],"authors":["James Hunt","The Block"]}