{"summary":"A Florida federal judge today denied a long pending motion to dismiss filed by Craig Wright in the Kleiman v. Wright litigation, citing Sir Walter Scott&#x27;s","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/36158\/federal-court-denies-craig-wrights-motion-to-dismiss-calls-out-multiple-conflicting-sworn-statements","publishDate":"2019-08-15T13:36:17","id":13848,"type":null,"title":"Federal court denies Craig Wright&#x27;s motion to dismiss, calls out multiple conflicting sworn statements","category":["LEGAL"],"content":["A Florida federal judge today <a href=\"https:\/\/www.scribd.com\/document\/421990994\/Kleiman-v-Wright-Order-on-Motion-to-Dismiss\" data-v-f87c67ca=\"\">denied<\/a> a long pending motion to dismiss filed by Craig Wright in the <em data-v-f87c67ca=\"\">Kleiman v. Wright<\/em> litigation, citing Sir Walter Scott's famous line<em data-v-f87c67ca=\"\">&nbsp;<\/em>\"Oh what a tangled web we weave when first we practice to deceive.\" &nbsp;","Critical to dismissing this federal lawsuit was presentation by Wright of <strong data-v-f87c67ca=\"\">some<\/strong> evidence of the existence of additional members of one of the plaintiffs, a company called \"W &amp; K Info Defense Research, LLC\" (\"W&amp;K). &nbsp;Oversimplifying a bit, Wright was arguing that the existence of additional \"members\" of this LLC, which were not disclosed to the Court in the original lawsuit, would help show that the court did not have sufficient evidence to establish federal subject matter jurisdiction under the federal diversity jurisdiction statute. &nbsp;It's a civil procedure issue that litigators deal with day in and day out but the bottom line, according to the court, \"the Defendant has failed to present any credible evidence showing that any of the parties he suggests are members of W&amp;K.\"","Rejecting Wright's arguments about the ownership of a corporate entity called W &amp; K, \"the Court notes that the Defendant has made&nbsp;several conflicting&nbsp;statements&nbsp;regarding even his own ownership of W&amp;K\" and cites his own lawyer's statement that there are a \"number of conflicting statements by Dr. Wright.\"","In rejecting Wright's arguments, the Court devotes an entire paragraph to conflicting sworn testimony offered by the Defendant:","At the Hearing, Defendantargued that the Court cannot both rely upon and find that the statements and evidence provided by himare untrue. SeeECF No. [256], at 100:6-9 (“Judge, if everything’s a lie, then thestuff they rely on when Wright files a contract, or when Wrightmakes a statement, can’t be credited either.”). Here, Defendant’s argument is novel. He seems to argue that even though his numerous conflicting statements are the very reason confusion has been created as to the ownership of W&amp;K, the Court should nonetheless use these statements as a basis to challenge the Court’s subject matter jurisdiction. In essence, the Defendant uses the evidence proffered as both his sword and his shield. Unfortunately, the record is replete with instances in which the Defendant has proffered conflicting sworn testimony before this Court. In weighing the evidence, theCourt simply does not find the Defendant’s testimony to be credible. As for the remaining “extrinsic evidence,”none of the evidence demonstrates additional membership in W&amp;Kother than Dave Kleiman.","In short, Wright's motion to dismiss is denied. This case will remain in Florida federal court. A federal judge has pointed out numerous conflicting sworn statements. Remaining for decision is a contempt motion, which could lead to case-ending sanctions against Wright. &nbsp;","We will provide updates as we have them.","<a title=\"View Kleiman_v_Wright_Order_on_Motion_to_Dismiss on Scribd\" href=\"https:\/\/www.scribd.com\/document\/421990994\/Kleiman-v-Wright-Order-on-Motion-to-Dismiss#from_embed\" data-v-f87c67ca=\"\">Kleiman_v_Wright_Order_on_M...<\/a> by <a title=\"View Anonymous RXEhFb's profile on Scribd\" href=\"https:\/\/www.scribd.com\/user\/471975281\/Anonymous-RXEhFb#from_embed\" data-v-f87c67ca=\"\">Anonymous RXEhFb<\/a> on Scribd","<iframe class=\"scribd_iframe_embed\" title=\"Kleiman_v_Wright_Order_on_Motion_to_Dismiss\" src=\"https:\/\/www.scribd.com\/embeds\/421990994\/content?start_page=1&amp;view_mode=scroll&amp;show_recommendations=false&amp;access_key=key-qyWKIU0BvWjpGa4ikM0A\" width=\"100%\" height=\"600\" frameborder=\"0\" scrolling=\"no\" data-auto-height=\"true\" data-aspect-ratio=\"0.7729220222793488\" data-mce-fragment=\"1\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Walter Scott","content":"PERSON"},{"type":"Florida","content":"LOCATION"},{"type":"\"W &amp; K Info Defense Research","content":"ORGANIZATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wright","content":"PERSON"},{"type":"Kleiman v. Wright","content":"PERSON"},{"type":"Dave Kleiman","content":"PERSON"},{"type":"Hearing","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen Palley","The Block"]}