{"summary":"US intellectual property authorities said in an NFT study that the current laws are sufficient to address infringement concerns.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/282104\/existing-laws-sufficient-to-handle-nft-copyright-concerns-say-us-authorities","publishDate":"2024-03-13T01:52:45","id":1384,"type":null,"title":"Existing laws sufficient to handle NFT copyright concerns, say US authorities","category":["POLICY"],"content":["<span data-v-f87c67ca=\"\">The intellectual property authorities in the U.S. noted the current laws are sufficient to address infringement concerns related to non-fungible tokens (NFTs) and there’s no need to change the existing IP laws.<\/span>","<span data-v-f87c67ca=\"\">The U.S. Copyright Office and the U.S. Patent and Trademark Office (USPTO) released a <\/span><a href=\"https:\/\/www.copyright.gov\/policy\/nft-study\/Joint-USPTO-USCO-Report-on-NFTs-and-Intellectual-Property.pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">joint study<\/span><\/a><span data-v-f87c67ca=\"\"> on NFTs on Tuesday, concluding that while changes to IP laws are not necessary or advisable at the moment, public education initiatives should be in place to ensure greater awareness.<\/span>","<span data-v-f87c67ca=\"\">“NFT technology is currently changing rapidly, and new laws unique to NFT issues would likely be premature,” the study said.<\/span>","<span data-v-f87c67ca=\"\">“NFTs offer unique opportunities for creators to leverage their IP rights, but also present new challenges in keeping their work secure,” said Kathi Vidal, under secretary of commerce for intellectual property and director of the USPTO, in a <\/span><a href=\"https:\/\/newsroom.loc.gov\/news\/u.s.-copyright-office-and-u.s.-patent-and-trademark-office-conclude-joint-study-on-non-fungible-toke\/s\/b0780cc9-0e6c-42fb-90a6-31eaf061434c\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">statement<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the report, the offices noted that although NFT technology is novel, the copyright issues it raises generally are not.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“To the extent an NFT contains or links to an unauthorized copy of a copyrighted work, the creation or marketing of that NFT will implicate copyright law the same way as any unauthorized reproduction or display,” the report added.<\/span>","<span data-v-f87c67ca=\"\">The two offices conducted the study on NFTs in response to a June 2022 request from the Senate committee on the judiciary subcommittee on intellectual property.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Kathi Vidal","content":"PERSON"},{"type":"Trademark Office (USPTO","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"USPTO","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"U.S. Copyright Office","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["LAWSUITS"],"authors":["Timmy Shen","The Block"]}