{"summary":"The Ren DAO is voting to create a foundation that will sell newly minted coins to raise money for the DeFi project after Alameda&#x27;s collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195513\/ren-dao-to-vote-on-plan-to-mint-new-funding-tokens-after-alameda-collapse","publishDate":"2022-12-15T15:33:05","id":13853,"type":null,"title":"Ren DAO to vote on plan to mint new funding tokens after Alameda collapse","category":["CRYPTO ECOSYSTEMS"],"content":["The Ren community, which oversees a DeFi protocol that issues wrapped crypto assets, is considering the minting of new tokens to raise capital after the collapse of Alameda Research left the project without access to its funds.","The community is also voting on the creation of the Ren Foundation, an organization that will lead the future development of the project. This vote is based on a <a href=\"https:\/\/forum.renproject.io\/t\/rip-000-018-ren-2-0-funding-and-ren-foundation\/1465\" data-v-f87c67ca=\"\">proposal<\/a> submitted to the DAO forum by Ren Ecosystem Advocate Maximillian Roszko.","As part of the vote, Ren DAO members will decide how many new ren tokens will be minted. The proposal suggested four options — 50 million, 100 million, 150 million or 200 million REN tokens — as well as a fifth option for rejecting the funding plan as a whole. At the current token price, Ren could raise from $4 million and $17 million.","Ren’s most popular wrapped asset is renBTC, a wrapped version of bitcoin. Wrapped tokens are versions of native Layer 1 coins that can be <a href=\"https:\/\/www.theblock.co\/linked\/66533\/rens-new-network-bridges-ethereum-with-bitcoin-bitcoin-cash-and-zcash\" data-v-f87c67ca=\"\">bridged to the Ethereum network<\/a>.&nbsp;","<em data-v-f87c67ca=\"\">The REN token price is down 83% in the last one year. Image: CoinGecko<\/em>","The Ren Foundation, if set up, will fund Ren 2.0 — a new version of the protocol to be rolled out as a community-run upgrade after <a href=\"https:\/\/www.theblock.co\/post\/193274\/alameda-backed-ren-warns-users-of-losses-as-it-plans-to-wind-down-protocol\" data-v-f87c67ca=\"\">sunsetting version 1.0<\/a>. Ren was forced to retire the previous version after running out of funds.","<a href=\"https:\/\/www.theblock.co\/linked\/93581\/alameda-research-acquihires-defi-project-ren-renbtc\" data-v-f87c67ca=\"\">Alameda acquired Ren<\/a> in early 2021 and held the project’s treasury. The trading firm, alongside its sister exchange FTX, has since gone into bankruptcy. Ren <a href=\"https:\/\/www.theblock.co\/post\/188584\/funding-for-defi-protocol-ren-in-limbo-after-alameda-collapse\" data-v-f87c67ca=\"\">previously stated<\/a> that it only had funding through the end of 2022 following the <a href=\"https:\/\/www.theblock.co\/post\/187982\/ftx-bankruptcy-filings-highlight-complete-failure-of-corporate-controls\" data-v-f87c67ca=\"\">Alameda collapse<\/a>.","The funds realized from the sale of the newly minted tokens will be split between the Ren Foundation and darknode operators, ecosystem members who contribute their computing power to secure the network and receive rewards from Ren for contributing their computing power to the network.","The Ren community vote will end on Dec. 21. Data from the voting <a href=\"https:\/\/snapshot.org\/#\/ren-project.eth\/proposal\/0xb306673131ae9eeb78fc1f39cf9fb6e5285cb8f4becd86f0406a260ac74270d2\" data-v-f87c67ca=\"\">page<\/a> on Snapshot shows early support for minting 200 million new ren tokens. This option so far has attracted 75% of the vote.","<span data-v-628af130=\"\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Disclaimer:<\/strong> Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/i><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dec. 21","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"83%","content":"PERCENT"},{"type":"Ren Foundation","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Ren DAO","content":"ORGANIZATION"},{"type":"Ren Ecosystem Advocate Maximillian Roszko","content":"ORGANIZATION"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"$17 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["BANKRUPTCY FILINGS","CROSS-CHAIN SWAPS","DAOS","GOVERNANCE VOTES","INTEROPERABILITY"],"authors":["Osato Avan-Nomayo","The Block"]}