{"summary":"Hashflow will start charging trading fees starting today and Hashflow token stakers will receive a portion of these fees.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260372\/decentralized-exchange-hashflow-to-share-revenue-with-token-stakers-starting-today","publishDate":"2023-11-01T09:00:03","id":13855,"type":null,"title":"Decentralized exchange Hashflow to share revenue with token stakers starting today","category":["CRYPTO ECOSYSTEMS"],"content":["Decentralized exchange and liquidity provider Hashflow will start charging trading fees starting today and will allow Hashflow token (HFT) stakers to receive a portion of these fees.","At present, many DeFi protocols levy fees on trades routed through Hashflow, even though Hashflow itself does not impose any fees.","Going forward, all trades executed on Hashflow will include a nominal fee.&nbsp;This fee will be embedded directly in the price quote and will be automatically deducted at the point of trade execution. This modification is the result of an <a href=\"https:\/\/snapshot.org\/#\/hashflowdao.eth\/proposal\/0x014a10517b46f895583de15713733147ca960f18a40c45d6653db7a150797ba7\" data-v-f87c67ca=\"\">approved proposal<\/a> by the Hashflow DAO and aims to establish the protocol’s first revenue stream.","“By distributing fee proceeds among token stakers as well as the Foundation, this proposal creates a sustainable model that will benefit all stakeholders in the Hashflow ecosystem,” said Varun Kumar, co-founder of Hashflow.","Revenue generated from these fees will be allocated as follows: 50% will be distributed to HFT token stakers, 30% will be earmarked for the community treasury specifically for HFT buybacks, and the remaining 20% will cover the Hashflow Foundation’s operating expenses.","The team has not revealed the exact fee amount for trades, although it has said the fee will be dynamic based on the size of the swap. All collected trading fees will be distributed to token stakers on a monthly basis.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"Hashflow DAO","content":"ORGANIZATION"},{"type":"Varun Kumar","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"Hashflow","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"Hashflow Foundation","content":"ORGANIZATION"}],"hashtag":["DEXS","STAKING"],"authors":["Vishal Chawla","The Block"]}