{"summary":"British crypto investors holding bitcoin are better off than U.S. counterparts who denominate their holders in the stronger Dollar.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/172787\/pound-hits-all-time-low-versus-the-dollar-softening-pain-of-bitcoin-losses-for-brits","publishDate":"2022-09-26T09:26:37","id":13850,"type":null,"title":"Pound hits all-time low versus the dollar, softening pain of bitcoin losses for Brits","category":["MARKETS"],"content":["With the pound in the doldrums, crypto investors in Britain received some respite from bitcoin losses.&nbsp;","The pound hit an <a href=\"https:\/\/www.reuters.com\/markets\/europe\/sterling-plunges-all-time-low-fiscal-plan-spurs-investor-exodus-2022-09-26\/\" data-v-f87c67ca=\"\">all-time low<\/a> of $1.0327 versus the U.S. dollar on Monday, as traders bet against the latest UK Chancellor's budget plans. Kwasi Kwarteng revealed plans to ditch Britain's top income-tax rate, and cancel a planned increase in national insurance, while also cutting stamp duty on a property up to £250,000 (approx. $270,000).&nbsp;","\"New Chancellor Kwasi Kwarteng’s tax-slashing, deficit-ballooning Budget — let’s call a spade a spade — was met with a mixture of surprise, incredulity, and downright bafflement by financial markets, particularly as the full extent of extra borrowing required to fund the largest tax cuts in 50 years became clear,\"&nbsp; Michael Brown, head of market intelligence at Caxton's, wrote on Monday.","However, the plummeting pound might have a silver lining for about 10% of UK adults — the number which say they hold or have held a cryptoasset, per <a href=\"https:\/\/www.gov.uk\/government\/publications\/individuals-holding-cryptoassets-uptake-and-understanding\" data-v-f87c67ca=\"\">research<\/a> commissioned by HM Revenue and Customs, published in July.","FTX's Sam Bankman-Fried <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1574206323549474817?s=20&amp;t=3EDtgpS9TI1pAqCLnS9kOQ\" data-v-f87c67ca=\"\">pointed<\/a> out on Twitter on Monday that people might feel differently about crypto prices, should they measure them in currencies other than the U.S. dollar.","","","Taking the DXY Dollar index, a measure of the value of the U.S. dollar relative to a basket of other foreign currencies, it showcases SBF's point. The DXY recently hit a two-decade high and is currently trading up over 17% this year, meanwhile the pound is trading at all-time lows.&nbsp;","Looking at investments through this scope, Britons holding bitcoin have paper losses of about 53% year-to-date while investors denominating their holdings in dollars are down a little over 62%.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DXY Dollar","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"HM Revenue and Customs","content":"ORGANIZATION"},{"type":"Britain","content":"LOCATION"},{"type":"Michael Brown","content":"PERSON"},{"type":"53%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"62%","content":"PERCENT"},{"type":"17%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$270,000","content":"MONEY"},{"type":"$1.0327","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Caxton","content":"ORGANIZATION"},{"type":"Kwasi Kwarteng","content":"PERSON"}],"hashtag":["BITCOIN","ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}