{"summary":"Multicoin Capital is significantly impacted by FTX’s collapse, a letter obtained by The Block shows.\nAround 10% of Multicoin Master Fund’s total AUM is stuck at the crypto exchange, per the letter.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184766\/multicoin-capital-hit-by-ftx-collapse-with-10-of-its-funds-aum-stuck-on-the-exchange","publishDate":"2022-11-09T09:25:01","id":1385,"type":null,"title":"Multicoin Capital hit by FTX collapse, with 10% of its fund&#x27;s AUM stuck on the exchange","category":["Venture Capital"],"content":["Multicoin Capital, one of the top crypto-focused venture capital firms, is significantly impacted by crypto exchange FTX's collapse, a letter obtained by The Block shows.","The letter, sent Tuesday by Multicoin Capital managing partners Kyle Samani and Tushar Jain to partners of the firm's \"Master Fund,\" shows that around 10% of the fund's total assets under management (AUM) are still pending withdrawals on FTX.","\"Unfortunately, we were not able to withdraw all of the Fund's assets on FTX,\" the letter reads. \"Assets including BTC, ETH, and USD are pending withdrawal and represent approximately 15.6% of the assets in the Fund (excluding side pockets) and approximately 9.7% of total Fund AUM.\"","Before FTX <a href=\"https:\/\/www.theblock.co\/post\/184176\/ftx-appears-to-have-stopped-processing-withdrawals-on-chain-data-show\" data-v-f87c67ca=\"\">halted withdrawals<\/a> on Tuesday, Multicoin Capital was able to withdraw around 24% of the fund’s assets that were held on the exchange, according to the letter. The letter does not mention dollar figures corresponding to the percentages. Multicoin Capital did not respond to The Block's request for comment by press time.","FTX is one of the three exchanges the Multicoin Master Fund trades on, along with Coinbase and Binance, according to the letter. The Sam Bankman-Fried-founded exchange has collapsed amid a liquidity crisis.","Rival exchange Binance reached a deal on Tuesday with FTX for a possible acquisition. If Binance ends up acquiring FTX, then Multicoin expects to be able to recoup 100% of its stuck funds as customers of the FTX exchange. But there is \"still a probability\" that the transaction does not close, and in that case, Multicoin may not see a full recovery of its assets held at FTX and any recovery would likely be further delayed, the letter reads.","Besides its assets being stuck at FTX, Multicoin Capital also held a liquid position in FTT, the troubled exchange's native token, and the assets it traded FTT for are also stuck at FTX.","\"The Fund held a liquid position in FTT. We took immediate action this morning upon the announcement of Binance buying FTX and sold our entire FTT position at an average price of $17.79,\" the letter reads. \"While we took the appropriate action, the assets that we traded FTT for (BTC and USD) are still on FTX and the Fund is unable to withdraw that BTC and USD at this time.\"","FTT is now trading at roughly $5, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/ftx-token\" data-v-f87c67ca=\"\">CoinGecko<\/a>.","Multicoin Capital also has indirect exposure to the FTX situation, it says in the letter. That is in the form of its positions in the Solana (SOL) and Serum (SRM) tokens.","\"The largest position in the Fund is SOL,\" the letter reads. It goes to say that since Solana was generally considered to be within Bankman-Fried's sphere of influence, the FTX situation could mean SOL could likely see increased volatility, and impact its position in the near term. The price of SOL is currently $18.88, down 32% today.","But Multicoin Capital remains optimistic on Solana in the long run, given its growing ecosystem. \"We have been long term SOL bulls not because of one person and\/or entity but because of the broader ecosystem developing on top of Solana and the nature of Solana's underpinning technology,\" the letter reads. \"While the FTX\/Binance situation is obviously not helpful to SOL in the near term, we do not believe it impairs the thesis over our investment time horizon.\"","As for Multicoin's position in Serum, it said in the letter that the fund's SRM tokens unlock over seven years, starting in August 2020 (meaning the fund’s SRM will finish vesting in August 2027). The fund has been selling SRM as it’s been unlocking and has already returned ~30x of its initial investment, per the letter. But the rest of its SRM tokens are designed to unlock directly into custody on FTX.","\"There are approximately five years before the side pocket SRM position will be fully unlocked. Given the circumstances, the unlocking process may or may not change moving forward, and we will work to achieve the best outcome for investors,\" the letter reads.","Multicoin Capital is taking some actions given the FTX situation. Specifically, it is in the process of reducing the fund’s counterparty exposure by recalling all outstanding collateral. \"Outside of the aforementioned exposure to FTX, and the exposure we have to Coinbase (our primary custodian), our only remaining counterparty exposure is with Genesis. This exposure amounts to 1.1% of total Fund AUM and we are working to eliminate it,\" the letter reads.","The venture firm is also working on separate communications for partners who are invested in its other funds that are affected by these events, including <a href=\"https:\/\/www.theblock.co\/post\/157108\/multicoin-capital-announces-its-third-crypto-fund-worth-430-million\" data-v-f87c67ca=\"\">Venture Fund III<\/a>, which is an investor in FTX U.S., and the special purpose vehicle or SPV it put together around one year ago to invest in FTX International (the entity Binance made a deal with), according to the letter."],"hashtag":["BINANCE","FTX"]}