{"summary":"The ban on the sale of crypto derivatives and exchange-traded notes (ETNs) is set to come into force in the UK tomorrow.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/90130\/crypto-derivatives-ban-comes-into-effect-uk","publishDate":"2021-01-05T13:51:31","id":13856,"type":null,"title":"The UK&#x27;s ban on crypto derivatives is set to go into effect on Wednesday","category":["CRYPTOCURRENCY"],"content":["A ban on the sale of crypto derivatives and exchange-traded notes (ETNs) is set to come into force in the U.K. on Wednesday, January 6.","Announced by the Financial Conduct Authority in October after a long and heated period of consultation, the ban forbids the sale, marketing and distribution of CFDs, options, futures and ETNs that reference cryptocurrencies to retail investors. &nbsp;","The regulator reckons it will prevent in the region of £53 million in harm, but industry commentators have <a href=\"https:\/\/www.theblockcrypto.com\/daily\/80943\/crypto-derivatives-uk-ban-defi\" data-v-f87c67ca=\"\">raised concerns<\/a> that it will instead drive consumers onto unregulated exchanges or indeed offshore — and, thus, beyond the FCA’s reach.","The watchdog continues to draw criticism even on the eve of the ban. Dermot O'Riordan, a partner at Eden Block, a European venture capital firm focused on blockchain tech, said the ban is an indication that the FCA doesn’t know how to regulate the space.","“It’s a shame because the only players that actually are regulated (or want to be) to offer crypto derivatives products to retail (Coinshares, Crypto Facilities, etc.) are generally good actors. This move will drive retail users to unregulated platforms like Deribit and BitMEX who will offer even less protection than the regulated players. So, it’s not clear how the average retail user wins in this scenario,” he continued.","The impact of the ban will be felt by a range of firms from specialist asset managers in crypto like CoinShares, which has more than $3 billion in assets under management, to platforms and exchanges such as eToro.","Traditional investment firms with a sideline in crypto have also been affected. Hargreaves Lansdown, the FTSE 100 investment firm, opted to take decisive action ahead of the deadline.","“The FCA’s October Policy Statement made clear their stance on these products. We firmly believe in protecting investors and helping them reach good outcomes, and so decided to implement restrictions in advance of the FCA’s deadline as this is in the best interest of our clients,” said Danny Cox, head of external relations at Hargreaves Lansdown.&nbsp;“Investors are no longer be able to buy these products through HL, but they can continue to hold investments that they already own, and can sell them when they wish to do so.”","IG, the online trading company founded in 1974, is also winding up its crypto CFD products in light of the ban.","Townsend Lansing, head of product at CoinShares, said these types of companies had mostly put a stop to buy-side orders by mid-December.","“In terms of our business, nothing has changed since the announcement [of the ban]. We don’t expect to have a material impact. We have a wide and diverse client base,” he explained.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Danny Cox","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Facilities","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"January 6","content":"DATE"},{"type":"1974","content":"DATE"},{"type":"the Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Hargreaves Lansdown","content":"PERSON"},{"type":"Eden Block","content":"ORGANIZATION"},{"type":"Dermot O'Riordan","content":"PERSON"},{"type":"Townsend Lansing","content":"PERSON"},{"type":"Hargreaves Lansdown","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"FTSE","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["DERIVATIVES","FCA"],"authors":["Ryan Weeks","The Block"]}