{"summary":"UN sanctions experts are warning people not to attend North Korea’s crypto conference next month\nThe UN has previously said that North Korea has collected an estimated $2 billion via cyberattacks\nThe conference is being hosted by North Korea’s government department from February 22-29","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53069\/un-experts-warn-to-stay-away-from-north-koreas-upcoming-crypto-conference","publishDate":"2020-01-15T04:15:08","id":1386,"type":null,"title":"UN experts warn to stay away from North Korea’s upcoming crypto conference","category":["Cryptocurrency"],"content":["Sanctions experts of the United Nations (UN), an intergovernmental organization responsible for maintaining peace and security,&nbsp;are warning people not to go to North Korea’s upcoming cryptocurrency conference in February.","Reuters <a href=\"https:\/\/www.reuters.com\/article\/us-northkorea-sanctions-un-exclusive\/exclusive-u-n-sanctions-experts-warn-stay-away-from-north-korea-cryptocurrency-conference-idUSKBN1ZE0I5\" data-v-f87c67ca=\"\">reported<\/a> the news Wednesday, citing an upcoming annual report by the sanctions experts, which is due to be submitted to the UN Security Council later this month. The report warns that presentations at the conference “have included explicit discussions of cryptocurrency for sanctions evasion and money laundering.”","North Korea is due to hold its second crypto conference from February 22-29, according to its <a href=\"https:\/\/nkcryptocon.com\/\" data-v-f87c67ca=\"\">website<\/a>.","The UN has previously said that North Korea has collected an estimated <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35662\/un-details-how-north-korea-carried-out-crypto-and-swift-hacks-to-amass-2b-to-fund-its-nuclear-programs\" data-v-f87c67ca=\"\">$2 billion<\/a> via “widespread and increasingly sophisticated” cyberattacks to steal funds from crypto exchanges and banks.","Last week, U.S. authorities formally charged Ethereum research scientist <a href=\"https:\/\/www.theblockcrypto.com\/linked\/52464\/ethereum-researcher-virgil-griffith-has-now-been-formally-indicted-in-north-korea-case\" data-v-f87c67ca=\"\">Virgil Griffith<\/a> for illegally traveling to North Korea and presenting at the country's first crypto conference, despite the U.S. Department of State denying his permission to travel to the country.","Griffith has been indicted for \"conspiracy to violate the International Emergency Economic Powers Act.”","“Although the press was not allowed to attend the conference and its proceedings were not published openly, the recent indictment of an American for sanctions violations sheds light on the intended purpose of the conference,” the U.N. sanctions experts wrote in the upcoming report.","North Korea’s second conference specifically <a href=\"https:\/\/nkcryptocon.com\/faq\/\" data-v-f87c67ca=\"\">notes<\/a> that U.S. citizens are allowed to attend and that their passports would not be stamped, “so there will be no evidence of your entry to the country,” according to its website.","“Your participation will never be disclosed from our side unless you publicize it on your own,” the website adds.","The conference is being hosted by North Korea’s government department, the Committee for Cultural Relations with Foreign Countries."],"hashtag":[]}