{"summary":"Britain’s asset managers are lobbying the government for a new fund category that uses blockchain technology","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/156794\/uk-fund-managers-push-for-blockchain-traded-funds-financial-times","publishDate":"2022-07-10T08:08:28","id":13868,"type":null,"title":"UK fund managers push for blockchain-traded funds: Financial Times","category":["REGULATION"],"content":["Britain’s asset managers are lobbying the government for a new fund category that uses blockchain technology, the <a href=\"https:\/\/www.ft.com\/content\/b29b8e67-01ae-41b2-a238-aecfa7be0609\" data-v-f87c67ca=\"\">Financial Times reported<\/a> on Thursday.","The Investment Association, which represents the UK’s asset management industry, is seeking approval of blockchain-traded funds that would issue digital tokens to investors, the report said.","Using blockchains’ digital ledgers to achieve greater efficiency in buying and selling mutual funds would save on costs, the association told the FT.","The group is also backing formation of a task force to investigate how blockchain technology might facilitate new products and services.","“Greater innovation will boost the overall competitiveness of the UK funds industry and improve the cost, efficiency and quality of the investment experience,” Chris Cummings, Investment Association chief, told the FT","Blockchain-traded funds could be rolled out by the middle of next year if the Financial Conduct Authority were to hasten approval, the FT reported, adding that Franklin Templeton launched the first US mutual fund using blockchain last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the Financial Conduct Authority","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Investment Association","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Chris Cummings","content":"PERSON"},{"type":"FT","content":"ORGANIZATION"},{"type":"Financial Times","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"}],"hashtag":[],"authors":["Mike Millard","The Block"]}