{"summary":"Fed Official Bowman said she has not yet seen a compelling argument that a U.S. CBDC would solve issues that other alternatives couldn&#x27;t.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/257939\/federal-reserve-governor-throws-cold-water-on-future-cbdc","publishDate":"2023-10-17T11:01:37","id":13867,"type":null,"title":"Federal Reserve governor throws cold water on future CBDC","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Federal Reserve Governor Michelle Bowman said she has not yet seen a compelling argument that a U.S. central bank digital currency would solve issues that other alternatives couldn't.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bowman said arguments made in favor of a CBDC, including financial inclusion and addressing frictions within the payment system, may not be unique to just CBDCs. The Fed official spoke Tuesday at a roundtable hosted by Harvard Law School.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"These are all important issues. I have yet to see a compelling argument that a U.S. CBDC could solve any of these problems more effectively or efficiently than alternatives, or with fewer downside risks for consumers and for the economy,\" Bowman said in a <a href=\"https:\/\/www.federalreserve.gov\/newsevents\/speech\/bowman20231017a.htm\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">speech<\/span><\/a>.&nbsp;&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Bowman, <\/span><span class=\"s1\" data-v-f87c67ca=\"\">who has been hesitant about CBDCs in the past, said FedNow and other soultions could solve those challenges. FedNow was launched over the summer, which allows financial institutions to send and receive instant payments in real time, cutting down the time for transactions to settle.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"FedNow, and a similar private sector service, is designed to help make everyday payments faster and more convenient, allowing consumers to instantly receive funds with same-day access, and enabling small businesses to more efficiently manage cash flows without processing delays,\" Bowman said. \"Future innovations may further build upon these services to more effectively address payment systems frictions and financial inclusion.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Federal Reserve has been exploring the possibility of issuing a CBDC, though an <a href=\"https:\/\/www.theblock.co\/post\/249935\/top-fed-official-says-he-is-deeply-concerned-about-stablecoins-without-federal-oversight\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">official<\/span><\/a> said in September that the central bank was not close to developing it quite yet. The central bank released a report last year examining the pros and cons of a CBDC, and it <\/span><span class=\"s5\" data-v-f87c67ca=\"\">has said it would need support from Congress in order to issue a CBDC.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Bowman did say, however, that research is still vital as other countries continue to pursue CBDCs. <\/span><span class=\"s1\" data-v-f87c67ca=\"\">So far 130 countries, representing 98 percent of gross domestic product, are exploring a CBDC, according to the Atlantic Council.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">Bowman also criticized stablecoins and said they could pose risks to consumers and the U.S. banking system.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"While I support responsible innovation that benefits consumers, I caution against solutions that could disrupt and disintermediate the banking system, potentially harming consumers and contributing to broader financial stability risks,\" Bowman said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers are weighing legislation to regulate stablecoins. A bill was <a href=\"https:\/\/www.theblock.co\/post\/241852\/stablecoins-bill-advances-in-us-house-after-tense-day-of-debate\" data-v-f87c67ca=\"\"><span class=\"s6\" data-v-f87c67ca=\"\">advanced<\/span><\/a> out of a House committee over the summer, but will likely face headwinds if taken up by the Senate.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"98 percent","content":"PERCENT"},{"type":"Harvard Law School","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Bowman","content":"PERSON"},{"type":"Atlantic Council","content":"ORGANIZATION"},{"type":"Michelle Bowman","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"September","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE"],"authors":["Sarah Wynn","The Block"]}