{"summary":"Questions have swirled around the health of Genesis and DCG since Genesis Global Capital, the lending business of Genesis Trading, temporarily suspended redemptions and new loan originations  last week in the wake of FTX&#x27;s collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189307\/dcgs-silbert-addresses-noise-around-genesis-even-as-it-grows-louder","publishDate":"2022-11-22T16:28:59","id":1386,"type":null,"title":"DCG&#x27;s Silbert addresses &#x27;noise&#x27; around Genesis even as it grows louder","category":["THE BLOCK"],"content":["Barry Silbert broke his silence to address what he called the \"noise\" around his Digital Currency Group even as the drumbeat about a possible bankruptcy grew louder.&nbsp;","The CEO, in a letter addressed to shareholders, said the company would come out of the current environment \"stronger\" a day after media reports that its Genesis may need to file for bankruptcy protection and as the New York Times reported that it had hired investment bank Moelis &amp; Company to explore options.&nbsp;","“DCG will continue to be a leading builder of the industry and we are committed to our long-term mission of accelerating the development of a better financial system,” he wrote in a note to clients obtained by The Block. “We have weathered previous crypto winters and while this one may feel more severe, collectively we will come out of it stronger.”","Questions have swirled around the health of Genesis and DCG since Genesis Global Capital, the lending business of Genesis Trading, temporarily suspended redemptions and new loan originations last week in the wake of FTX's collapse.","DCG gave Genesis a $140 million equity infusion after it said its derivatives business had $175 million locked up on the FTX platform.","Genesis sought an emergency loan of $1 billion from investors before the suspending redemptions, The Wall Street Journal reported. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSilbert said that DCG had received investment offers, adding that he would let shareholders know if the company decides to do a financing round. His note also confirmed that Genesis hired financial and legal advisors.","“This is an issue of liquidity and duration mismatch in the Genesis loan book,” Silbert said. “Importantly, these issues have no impact on Genesis’ spot and derivatives trading or custody businesses, which continue to operate as usual.”","Silbert said that DCG has a liability to Genesis Global Capital of roughly $575 million, which is due in May 2023. The company also took on the debt that bankrupt Three Arrows Capital failed to pay Genesis, which was estimated to be over $1 billion.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n\"Despite the difficult industry conditions, I am as excited as ever about the potential for cryptocurrencies and blockchain technology over the coming decades and DCG is determined to remain at the forefront.\"","The full note to shareholders:","<em data-v-f87c67ca=\"\">Dear Shareholders,<\/em><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<em data-v-f87c67ca=\"\">There has been a lot of noise over the past week and I want to get in touch directly to clarify where we stand at DCG.<\/em>","<em data-v-f87c67ca=\"\">Most of you are aware of the situation at Genesis, but to recap up front: Genesis Global Capital, Genesis’ lending business, temporarily suspended redemptions and new loan originations last Wednesday, November 16 after market turmoil sparked unprecedented withdrawal requests. This is an issue of liquidity and duration mismatch in the Genesis loan book. Importantly, these issues have no impact on Genesis’ spot and derivatives trading or custody businesses, which continue to operate as usual. Genesis leadership and their board decided to hire financial and legal advisors and the firm is exploring all possible options amidst the fallout from the implosion of FTX.<\/em>","<em data-v-f87c67ca=\"\">In recent days, there has been chatter about intercompany loans between Genesis Global Capital and DCG. For those unaware, in the ordinary course of business, DCG has borrowed money from Genesis Global Capital in the same vein as hundreds of crypto investment firms. These loans were always structured on an arm’s length basis and priced at prevailing market interest rates. DCG currently has a liability to Genesis Global Capital of ~$575 million, which is due in May 2023. These loans were used to fund investment opportunities and to repurchase DCG stock from non-employee shareholders in secondary transactions previously highlighted in quarterly shareholder updates. And to this day, I’ve never sold a share of my DCG stock.<\/em>","<em data-v-f87c67ca=\"\">You may also recall there is a $1.1B promissory note that is due in June 2032. As we shared in our previous shareholder letter in August 2022, DCG stepped in and assumed certain liabilities from Genesis related to the Three Arrows Capital default. As stated in August, because these are now DCG liabilities, DCG is participating in the Three Arrows Capital liquidation proceedings on the Creditors’ Committee and is pursuing all available remedies to recover assets for the benefit of creditors. Aside from the Genesis Global Capital intercompany loans due in May 2023 and the long-term promissory note, DCG’s only debt is a $350M credit facility from a small group of lenders led by Eldridge.<\/em>","<em data-v-f87c67ca=\"\">Taking a step back, let me be crystal clear: DCG will continue to be a leading builder of the industry and we are committed to our long-term mission of accelerating the development of a better financial system. We have weathered previous crypto winters and while this one may feel more severe, collectively we will come out of it stronger. DCG has only raised $25M in primary capital and we are pacing to do $800M in revenue this year.<\/em>","<em data-v-f87c67ca=\"\">I bought my first bitcoin a decade ago in 2012 and made the decision that I would commit to this industry for the long term. In 2013, we founded the first BTC trading firm – Genesis – and the first BTC fund, which evolved into Grayscale, now the world’s largest digital currency asset manager. Foundry runs the largest bitcoin mining pool in the world and is building tomorrow’s decentralized infrastructure. CoinDesk is the industry’s premier media, data, and events company and they have done phenomenal work covering this crypto winter. Luno is one of the most popular crypto wallets in the world and is an industry leader in the emerging markets. TradeBlock is building a seamless institutional trading platform and as the newest subsidiary, HQ is establishing a life and wealth management platform for digital asset entrepreneurs. Each of these subsidiaries are standalone businesses that are independently managed and are operating as usual. Lastly, with a portfolio of 200+ companies and funds, we’re often the first check for the industry’s best founders.<\/em>","<em data-v-f87c67ca=\"\">We appreciate the words of encouragement and support, along with offers to invest in DCG. We will let you know if we decide to do a financing round.<\/em>","<em data-v-f87c67ca=\"\">Despite the difficult industry conditions, I am as excited as ever about the potential for cryptocurrencies and blockchain technology over the coming decades and DCG is determined to remain at the forefront.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"June 2032","content":"DATE"},{"type":"August 2022","content":"DATE"},{"type":"$1.1","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Silbert","content":"PERSON"},{"type":"$175 million","content":"MONEY"},{"type":"Barry Silbert","content":"PERSON"},{"type":"$25M","content":"MONEY"},{"type":"$140 million","content":"MONEY"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"last Wednesday, November 16","content":"DATE"},{"type":"Creditors’ Committee","content":"ORGANIZATION"},{"type":"August","content":"DATE"},{"type":"$800M","content":"MONEY"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"May 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Moelis &amp; Company","content":"ORGANIZATION"},{"type":"$350M","content":"MONEY"},{"type":"Eldridge","content":"ORGANIZATION"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"$575 million","content":"MONEY"}],"hashtag":[],"authors":["Nathan Crooks","Catarina Moura","Frank Chaparro","The Block"]}