{"summary":"With generative art booming, Fidenza artist Tyler Hobbs thinks NFTs are here to stay but that they might go through boom and bust cycles.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117084\/fidenza-artist-tyler-hobbs-nfts","publishDate":"2021-09-09T07:28:25","id":13880,"type":null,"title":"Fidenza artist Tyler Hobbs: NFTs to &#x27;play a huge role in the art world&#x27;","category":["NFTS"],"content":["Generative artist Tyler Hobbs, like many of his peers, is still trying to adjust to his newfound fame.","“This has already been a really big reality shift for me so I’m trying to give myself a little bit of time to adjust to it,” said Hobbs. &nbsp;","His signature project, Fidenza, debuted on the non-fungible token (NFT) platform Art Blocks in June. Generated at random by an algorithm of Hobbs’s design and rich with colorful curves and blocks, 999 of the pieces were minted at a price of 0.17 ether each (around $400 at the time). They now trade on the secondary market OpenSea for <a href=\"https:\/\/opensea.io\/assets\/0xa7d8d9ef8d8ce8992df33d8b8cf4aebabd5bd270\/78000313\" data-v-f87c67ca=\"\">as much as 1,000 ether<\/a> (roughly $3.5 million) each.","A summer surge in the popularity of NFTs has <a href=\"https:\/\/www.theblockcrypto.com\/news+\/116957\/nft-generative-art-future\" data-v-f87c67ca=\"\">been a boon<\/a> to the generative art community. According to The Block’s&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/data\/nft-non-fungible-tokens\/marketplaces\" data-v-f87c67ca=\"\">data dashboard<\/a>, $3.25 billion in NFTs exchanged hands on marketplaces like OpenSea in August — far in excess of the previous monthly high of $315 million in March.","For generative artists, who have toiled at the fringes of the art world for decades, the current state of the market is perhaps their first “mainstream breakthrough,” according to Hobbs.","Fidenza #118","But can the good times last? Some <a href=\"https:\/\/hackernoon.com\/are-nfts-the-next-ico-fraud-r31g37gd\" data-v-f87c67ca=\"\">have compared<\/a> the frenzied nature of speculation in the NFT space to the Initial Coin Offering (ICO) bubble of 2017.","“I would be totally amazed if NFTs went away,”&nbsp; said Hobbs. “I think they’re here to stay, and I think they’re going to play a huge role in the art world particularly for digital art for the foreseeable future.”&nbsp;","Hobbs added, however, that boom and bust cycles occur in many markets. “I think we’ve certainly seen a lot of booming so it would only be natural to expect some sort of equivalent bust at some point,” he said.","Hobbs’s confidence stems in part from his belief that NFTs have already reached a “critical mass of social acceptance,” he said. “As long as everybody agrees that owning an NFT carries some significance, then it does.”","The Art Blocks model offers some reassurance to collectors in this regard. The platform, which has <a href=\"https:\/\/www.theblockcrypto.com\/daily\/115199\/squiggles-art-blocks-nft-frenzy\" data-v-f87c67ca=\"\">swept up a significant chunk<\/a> of the cash flowing into NFTs over the summer, stores the script that is used to generate its artists’ work on the blockchain. This allows owners to verify that the pieces they own originated from the code written by the artist.","“So you’re essentially guaranteed that all that output is from one fully generative program. There was nothing done manually, there was no curation, no hand assembling,” said Hobbs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"$400","content":"MONEY"},{"type":"$315 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$3.5 million","content":"MONEY"},{"type":"$3.25 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"Tyler Hobbs","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fidenza","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Hobbs","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["FIDENZA","OPENSEA"],"authors":["Ryan Weeks","The Block"]}