{"summary":"The code to which it is giving creators access restricts NFT sales to marketplaces that enforce creator fees. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/183518\/opensea-creates-tool-to-help-nft-collections-enforce-royalties-on-chain","publishDate":"2022-11-06T11:53:32","id":13883,"type":null,"title":"OpenSea creates tool to help NFT collections enforce royalties on-chain","category":["NFTS"],"content":["Marketplace giant OpenSea laid out the first of a suite of tools for its users this weekend, allowing creators of new NFT collections to enforce royalties on-chain.&nbsp;","Debuting on Nov. 8, the company said it wants to \"take a thoughtful, principled approach to this topic,\" following a protracted debate among players in the market about the correct course of action on enforcing payments to creators.","The code to which it is giving creators access restricts NFT sales to marketplaces that enforce creator fees.&nbsp;","\"It’s clear that many creators want the ability to enforce fees on-chain &amp; we believe that choice should be theirs–not a marketplace’s–to make,\" the company wrote on Twitter. \"So we’re building tools we hope will balance the scales by putting more power in creators’ hands to control their business model.\"","<span data-v-f87c67ca=\"\">\"We’re interested in making a better system,\" OpenSea CEO Devin Finzer said in an interview with The Block shortly after announcing the move. \"Our thinking is always to take a step back and think of all the possible solutions to the problem rather than going with a portion of the industry.\"<\/span>","In the coming months, the company will also produce additional tools serving a similar purpose and solicit community feedback on the developments.&nbsp;","For existing collections wanting options to enforce creator payments, it said that it would wait to roll out any changes until at least Dec. 8.","The company is considering a range of approaches. These may include continuing to enforce off-chain fees for some subsets of collections, allowing optional creator fees or collaborating on other on-chain enforcement options for creators. The smart contracts of some existing collections may already allow OpenSea's upgrade, which would enforce royalties on-chain, while other contracts will be a bigger challenge to change, Finzer said.&nbsp;","The moves come as marketplaces across the board are scrambling to set out their stalls as the primary venue for NFT trading. Some marketplaces, such as Solana marketplace <a href=\"https:\/\/www.theblock.co\/post\/178362\/magic-eden-coo-calls-0-royalties-a-prisoners-dilemma\" data-v-f87c67ca=\"\">Magic Eden<\/a>, have opted to cut creator fees altogether or make them optional, while others such as <a href=\"https:\/\/www.theblock.co\/post\/180785\/stepn-founders-bright-idea-for-its-new-nft-marketplace-compulsory-royalties\" data-v-f87c67ca=\"\">Stepn's<\/a> new NFT marketplace Mooar, have moved to a subscription model.","OpenSea's voice on the subject had been conspicuously absent, as the marketplace that clocks the lion's share of NFT market trading volume.&nbsp;","\"The last few months haven’t felt WAGMI,\" OpenSea <a href=\"https:\/\/opensea.io\/blog\/announcements\/on-creator-fees\/\" data-v-f87c67ca=\"\">wrote<\/a> on the phenomenon.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/nft-marketplace-monthly-transactions\/embed\" title=\"NFT Marketplace Monthly Transactions\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Finzer","content":"PERSON"},{"type":"Dec. 8","content":"DATE"},{"type":"Devin Finzer","content":"PERSON"},{"type":"Mooar","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"weekend","content":"DATE"},{"type":"Nov. 8","content":"DATE"},{"type":"Stepn","content":"ORGANIZATION"}],"hashtag":["OPENSEA"],"authors":["Lucy Harley-McKeown","The Block"]}