{"summary":"Binance asked projects for details of any market-making relationship details and if they would contribute tokens to its savings products.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247353\/binance-low-cap-projects-market-manipulation","publishDate":"2023-08-25T03:17:33","id":1388,"type":null,"title":"Binance pushes low-cap projects to boost liquidity over manipulation fears","category":["EXCHANGES"],"content":["Binance is pushing crypto projects with low-liquidity tokens trading on its exchange to take steps to boost liquidity.","In the past week, staff at Binance reached out to multiple projects asking for details of their relationships with market makers and whether they would consider contributing funds to the exchange’s savings products, excerpts of messages obtained by The Block show. Specifically, Binance asked whether those projects would consider contributing 1-5% of their circulating tokens to its savings accounts to earn interest. <a href=\"https:\/\/twitter.com\/napgener\/status\/1694477415702012203\" data-v-f87c67ca=\"\">Screenshots of similar outreach have also been shared on Twitter<\/a>.","Binance also demanded an explanation if the projects in question did not have relationships with market makers or did not wish to contribute to its savings products, the messages show.&nbsp;","A spokesperson for Binance said the outreach is part of an “ongoing risk management initiative” and targeted a small number of crypto outfits that have tokens listed on the exchange with either lower-liquidity trading pairs or a smaller market capitalization relative to the wider marketplace. Such features, the spokesperson said, may expose users to risk, “including potential market manipulation.”","“The main purpose of our risk management outreach is to encourage project teams to take the recommended steps required to enhance their liquidity protection. Engaging market maker support is one way to enhance such protection,” they said. Market makers are liquidity providers who agree to buy assets at certain prices to help exchanges function smoothly.&nbsp;","“Another possible risk mitigation measure is to make contributions on saving pools, such as Binance Savings. This is the place where users can borrow tokens from, either via Margin or Loan, and trade more actively to inject liquidity into the current market,” the spokesperson added, emphasizing that contributions are optional.","Binance’s savings products offer users and projects rewards for tying up tokens, with interest rates varying depending on the term. Such products have come under intense regulatory scrutiny over the past year following <a href=\"https:\/\/www.theblock.co\/post\/214880\/stop-swimming-naked-reboot-crypto-lending\" data-v-f87c67ca=\"\">the collapses of lenders<\/a> such as BlockFi, Celsius and Voyager Digital — which all offered high rates on crypto deposits before filing for bankruptcy.","Binance itself is currently dealing with mounting regulatory pressure. Both the United States Securities and Exchange Commission and the Commodity Futures Trading Commission have filed multiple charges against the exchange operator and its founder, Changpeng Zhao, this year. <a href=\"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance\" data-v-f87c67ca=\"\">The CFTC alleged Binance had violated U.S. federal laws and failed to register as an exchange<\/a> in the U.S., while <a href=\"https:\/\/www.theblock.co\/post\/233652\/sec-binance-and-us-affiliate-redirected-billions-in-customer-assets-to-zhaos-funds\" data-v-f87c67ca=\"\">the SEC’s charges included alleged fraud, market manipulation and misleading customers<\/a> as to the location and safety of their assets.","<a href=\"https:\/\/www.binance.com\/en\/blog\/from-cz\/czs-response-to-the-cftc-complaint-2408916493005890282\" data-v-f87c67ca=\"\">Binance pushed back on both complaints<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/234323\/binanceus-responds-to-fraud-market-manipulation-asset-safeguarding-claims\" data-v-f87c67ca=\"\">highlighting its efforts to comply with rules and cooperate with regulators<\/a>.","Matt Batsinelas, founder of Glass Markets, an analytics platform that monitors exchange liquidity, said a few trading venues, including Binance, have sought to gain greater oversight of market makers’ behavior on their platforms recently.&nbsp;“We see this as a net positive for exchanges to be monitoring market makers to ensure they’re providing liquidity,” he added.","Binance’s spokesperson said that “digital assets of high quality” help to protect users —&nbsp;and that market liquidity and market capitalization are two key criteria that the exchange monitors.","“Binance’s intention is to create a safe and secure trading environment for our users, and project teams have been willing to do their part to contribute,” they added.","(<em data-v-f87c67ca=\"\">Updates language in first paragraph to show Binance request was to boost liquidity.<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Matt Batsinelas","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Twitter","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Binance Savings","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Ryan Weeks","The Block"]}