{"summary":"The Block spoke with Sui Chung, CEO of CF Benchmarks, which provides the index set to be used by BlackRock, Valkyrie and WisdomTree&#x27;s proposed spot bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236558\/multi-billion-dollar-question-posed-by-blackrock-move-for-a-spot-bitcoin-etf","publishDate":"2023-06-27T13:25:54","id":13887,"type":null,"title":"The multi-billion dollar question posed by BlackRock&#x27;s bitcoin ETF move","category":["CAPITAL MARKETS"],"content":["Bitcoin's price has surged this month, rising nearly 14% in the wake of BlackRock's move to file for a <a href=\"https:\/\/www.theblock.co\/post\/236415\/blackrock-etf-filing-could-be-turning-point-for-bitcoin-ark-says\" data-v-f87c67ca=\"\">spot bitcoin ETF<\/a> that was quickly followed by other asset managers.","While most attention over the next few months will be on the U.S. Securities and Exchange Commission's response, as the regulator has yet to approve a spot bitcoin fund, the filings pose a larger question of just how much the funds could start to affect the broader market, and price of bitcoin, should they ultimately get the green light.","The Block spoke with <a href=\"https:\/\/www.linkedin.com\/in\/sui-chung-ba9b6a11\/\" data-v-f87c67ca=\"\">Sui Chung<\/a>, the CEO of Kraken-subsidiary <a href=\"https:\/\/www.cfbenchmarks.com\/about\/people\" data-v-f87c67ca=\"\">CF Benchmarks<\/a> that provides the index set to be used by spot bitcoin ETFs being proposed by BlackRock, Valkyrie and WisdomTree.","Chung, who says he's been intimately involved in the bitcoin ETF filing process over the years, spoke about what makes BlackRock's recent filing different from previous efforts. He also spoke about the size of the potential market for the funds.","(<em data-v-f87c67ca=\"\">The interview has been edited for length and clarity.<\/em>)&nbsp;","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">How was CF Benchmarks involved in BlackRock's recent move to file for a spot bitcoin ETF?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: CFB is the provider of the index <a href=\"https:\/\/www.cfbenchmarks.com\/data\/indices\/BRRNY\" data-v-f87c67ca=\"\">BRRNY<\/a>, Bitcoin Reference Rate — New York Variant, that will be the NAV for the fund.","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">How is this latest filing ETF different from ones that have been tried in the past? Ones that didn't receive approval?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: CF Benchmarks has been involved in more bitcoin ETF filings than any other company in the world. Of the 13 filings I think there have ever been, seven have used a CF Benchmarks index.","Once the S-1 is filed, what actually matters is the 19-b4 process, and in this case Nasdaq has to argue why the listing of this ETF will not compromise the exchange vis-à-vis the Securities and Exchange Act. So what's different is something called SSA with bitcoin spot market, which you will find on <a href=\"https:\/\/listingcenter.nasdaq.com\/assets\/rulebook\/NASDAQ\/filings\/SR-NASDAQ-2023-016.pdf\" data-v-f87c67ca=\"\">page 36 of Nasdaq's 19-b4<\/a>. That has never featured in any previous 19-b4 by any national stock exchange in the U.S. attempting to rule change to allow a bitcoin ETF. So that is the thing that is different.","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">What does it do?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: It seeks to address the Commission's concerns that it has previously stated in its disapprovals of other 19-b4 processes. Previously, disapprovals have been stated by the SEC because there are insufficient measures taken by the listing exchange to ensure that there are mechanisms in place to impede and detect manipulative trading, potential manipulation of the shares of the ETF. It's the listing exchange that needs to have this in place.","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">So theoretically, Nasdaq has made changes to address these concerns?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: If you read the actual 19-b4, which is all public, this is something that Nasdaq proposes to put in place to to be able to fulfill that requirement that the SEC has.","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">How much has CF Benchmarks worked with some of these other parties to address these concerns?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: I think it's fair to say that it's a collective effort to understand, to interpret what that bar looks like. The SEC puts a bar there. So obviously, collectively, we analyze, 'okay, how can that bar be met? What have people tried before, which obviously wasn't enough, and so therefore where is that bar? What does reaching that bar look like? And what can we do to to meet that bar?'","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">So what's changed?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: I'd point you to the Nasdaq's words. They're public. They're in the filing. They call it the Spot BTC SSA. So this Spot BTC SSA is expected to have the hallmarks of a surveillance sharing agreement between two members of the ISG.","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">How long could this approval process last?<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: There is a standard amount of time, and that standard amount of time is 45 days. However, the SEC has the ability to extend that by another 45 days. And then secondly, after that 90 days is up, they can also extend it. It's not quite an extension...but it's another way to delay it basically. So they can stretch it out, I think in total of 230 days, before they have to finally come up with either a disapproval or nothing. And it's the nothing that means you can go.&nbsp;","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">If a spot is eventually approved, how do you see that changing the broader bitcoin market? Who influences who here? Will the ETFs just follow the market, or will they start to influence it?&nbsp;<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: That's the sort of multi-billion dollar question. If we think about ETFs as a class of instruments, I think in the U.S., something like 60% of the investing public holds at least one ETF. If you say that's the potential audience for this product, that's a big audience.","Now, how many of that audience who are already familiar with ETFs will want to invest in this one, or indeed any others? So how many of them will want to invest in any given bitcoin ETF? Well, there's another stat which is that 20% of investing Americans already own cryptocurrency. And so you're going to think that, at the very least, those that have held an ETF before and today own crypto will, through their long term savings plans like 401(k)s etc., if they have an option to allocate to a bitcoin ETF, you would think it would make sense that at least some part of their 401(k) will end up in a bitcoin ETF.","That's quite a lot of capital. And of course, it's an ETF, so therefore it's effectively a long-only vehicle. So everyone that subscribes to shares in the ETF, because of the creation\/redemption mechanism, you never have a shortage of shares of the ETF. Every time you create a share of ETF you go out and buy some bitcoin.","And so there's only one way it can go. Once you have an ETF, it's only going to have one type of effect. Now what is the magnitude of that effect? We can guess, we can guesstimate. How big is the investing public? How much money have they got to invest? How many of them might be interested in bitcoin? And when you do that math, the number is pretty big.","<strong data-v-f87c67ca=\"\">The Block<\/strong>: <em data-v-f87c67ca=\"\">There are tax benefits too...<\/em>","<strong data-v-f87c67ca=\"\">Sui Chung<\/strong>: With ETFs, you don't have unrealized gains and losses. There is no tax on the unrealized gains and losses. Now, obviously, your entry and exit will be taxed, depending how you enter an exit. But within a 401(k) wrapper, you're not racking up taxes. Whereas if you sit there on Coinbase, you buy some bitcoin, then you decide to sell some bitcoin, move the dollars into Schwab to buy the S&amp;P 500. There's a taxable event, right?&nbsp;","Even if you are someone who is familiar and comfortable with self custody, with using crypto exchanges, for most people there is a portion of their wealth sat inside a certain wrapper, in the U.S. a 401(k) being the most popular. You can only use that money to buy certain types of instruments. ETFs are one of them. It doesn't say you can't buy bitcoin ETFs. You can buy whatever ETF you want.&nbsp;","It's that part of people's capital. It's very easy, being inside the crypto sphere, to think in this binary matter of like 'oh, you either use traditional financial instruments, or you self custody.' Well, that's not true. You can certainly do both. I mean, myself, I have an active stock trading account. I also have, you know, our UK version of a 401(k) that's chock full of stocks that are managed by fund managers.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Sui Chung","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"NAV","content":"ORGANIZATION"},{"type":"BTC SSA","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Schwab","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Bitcoin Reference Rate — New York Variant","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"SSA","content":"ORGANIZATION"},{"type":"CFB","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"ISG","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}