{"summary":"After raising $50 million at a valuation near $700 million, crypto brokerage and trading startup FalconX is preparing to expand its customer base of deep-pocketed hedge funds.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/98336\/falconx-fundraise-hedge-funds-bitcoin","publishDate":"2021-03-15T16:53:21","id":13890,"type":null,"title":"FalconX says $50M raise will help it woo billion-dollar hedge funds to the bitcoin market","category":["BITCOIN"],"content":["After raising $50 million at a valuation near $700 million, crypto brokerage and trading startup FalconX is preparing to expand its customer base of deep-pocketed hedge funds.","According to chief executive Raghu Yarlagadda, who previously worked as a lead product manager for Google, the fresh capital will allow the company to expand its sales and marketing team to attract hedge funds that boast assets in excess of $1 billion. These types of firms have historically avoided the crypto market but have increasingly expanded their footprint in recent months.","Indeed, Tiger Global — a major hedge fund and venture capital investment firm — was among the lead participants <a href=\"https:\/\/www.theblockcrypto.com\/linked\/98039\/falconx-crypto-trading-funding-round-valuation\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">in FalconX's raise<\/a>.","\"We believe FalconX is positioned to be an industry leader in the institutional cryptocurrency market,” said Scott Shleifer, partner at Tiger Global.","Tiger Global, which recently closed a raise for a $3.75 billion private equity fund, has more than $36 billion under its management.&nbsp;","\"When we began conversations with Tiger they were just interested in learning more about the space,\" Yarlagadda said. \"They know what it takes to be a one-stop shop for crypto trading and they went deep into the technology.\"","Founded in 2018, FalconX exists in a crowded field of players looking to sit between big investors and the cryptocurrency market. Coinbase's prime unit (formerly Tagomi), NYDIG, and DCG's Genesis Global are all competing for this particular type of client.","Aside from the fresh injection of cash, FalconX can count a few tailwinds, including an already profitable business that's becoming increasingly more focused on institutions.","\"At that rate that the industry is growing, large hedge funds will dominate our volumes,\" Yarlagadda said.&nbsp;","Today, 45% of the firm's business is crypto-native but over the next one to two years, Yarlagadda expects the large hedge funds which top $500 million or larger in size to comprise as much as 30% of its customer base.&nbsp;","<strong data-v-f87c67ca=\"\">Credit&nbsp;<\/strong>","The firm's route to wooing such market participants hints at a broader development underway in the crypto market: the growth of its credit market.","In crypto, unlike in equities and other traditional assets, the ability to borrow funds is limited and expensive. There are also only a few players — including Galaxy, BlockFi, Genesis, and Blockchain.com — that offer such services.","By contrast, that's a common offering on Wall Street, allowing firms to make more capital efficient bets without liquidating existing positions.&nbsp;","As for FalconX, the firm allows clients to delay settlement up to 20 days, which means they don't need to put up the cash on the other side of the trade immediately. FalconX leverages on-chain data to assess the creditworthiness of its clients and provide them with lower interest rates for larger funds to entice them to use the platform.&nbsp;","\"The credit product enables our clients to delay their settlement window with <span class=\"il\" data-v-f87c67ca=\"\">FalconX<\/span>, giving them productized short-term, fixed-rate financing combined with deep crypto liquidity,\" Aya Kantorovich, the firm's head of institutional coverage, said in an email. \"Right now the choice in the market is between hourly funding rates that can swing wildly on one end, and long term fixed rates on the other end – we are solving the trading margin rate, with a combination of seamless in-product workflows, reduced back-office complexity, and great execution all within one venue.\"","While the firm makes most of its revenue from trading, it could ultimately see 60 to 80% of its revenue come from credit-related services in the long run, according to Yarlagadda.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Yarlagadda","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Scott Shleifer","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"$3.75 billion","content":"MONEY"},{"type":"Tiger","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"Aya Kantorovich","content":"PERSON"},{"type":"$500 million","content":"MONEY"},{"type":"$700 million","content":"MONEY"},{"type":"Raghu Yarlagadda","content":"PERSON"},{"type":"$50 million","content":"MONEY"},{"type":"$36 billion","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}