{"summary":"Hong Kong announces plans to allow crypto exchange-traded funds and consult on allowing retail investors to gain access to the crypto sector. The city has a goal of becoming a global center for crypto-related businesses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/180305\/hong-kong-retail-consultation-virtual-assets","publishDate":"2022-10-30T22:48:06","id":13891,"type":null,"title":"Hong Kong plans to green light crypto ETFs and review rules barring retail investors from trading digital assets","category":["REGULATION"],"content":["Regulators in Hong Kong unveiled plans to widen the scope of crypto assets available in the city while also exploring how to open the crypto market to retail investors.&nbsp;","The Securities and Futures Commission is planning to allow certain crypto exchange-traded funds (ETFs) to be sold to investors in the southern Chinese city and will also launch a public consultation on potentially allowing retail investors to trade virtual assets (VA), a government<a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/31\/P2022103000454.htm\" data-v-f87c67ca=\"\">&nbsp;announcement<\/a>&nbsp;and <a href=\"https:\/\/www.sfc.hk\/-\/media\/EN\/files\/COM\/Speech\/HKFW-Speech---Eng_20221031.pdf?rev=34b90c7d8dce42ad9215da652cd77dc5&amp;hash=E11F1164D81137053A27C6CEEFACE9D3\" data-v-f87c67ca=\"\">speech<\/a> by a regulatory official said this morning.","\"We recognise the increasing acceptance of VA as a vehicle for investment allocation by global investors, be they institutional or individual,\" said the Financial Services and the Treasury Bureau, in <a href=\"https:\/\/gia.info.gov.hk\/general\/202210\/31\/P2022103000454_404805_1_1667173469522.pdf\" data-v-f87c67ca=\"\">a statement.<\/a>&nbsp;\"Having these products launched in Hong Kong will provide the connectivity between VA players and traditional financial institutions, offering investors with well-designed products, hence promoting the overall growth of the sector in our market.\"","The news comes as senior officials outlined plans, at the opening sessions of Hong Kong FinTech Week, to try to turn the city into a global center for the digital asset industry.&nbsp;","ETFs with underlying assets in instruments linked to bitcoin and ether futures traded on the Chicago Mercantile Exchange (CME) would likely be the first such products to be approved, Julia Leung, deputy chief executive officer at the SFC said in a conference speech.&nbsp;","The SFC believes the risks of crypto exposure have become ''manageable'' with proper guardrails, she said. ''We could be on the cusp of the future of finance if we get it right, but that's a big if,'' Leung added.&nbsp;","In a recorded video, finance secretary Paul Chan spoke of plans for Hong Kong to launch a Central Bank Digital Currency (CBDC). &nbsp;","\"The HKMA has begun preparatory work to launch our very own CBDC,\" he said. \"It is also working with the People’s Bank of China, the Bank of Thailand, the Central Bank of United Arab Emirates and the Bank of International Settlements Innovation Hub in Hong Kong on a multiple CBDC project enabling real time cross border foreign exchange payment versus payment transactions.\"","In a separate speech, Eddie Yue, chief executive of the Hong Kong Monetary Authority, touched on a wide range of crypto-related topics, including the use of the metaverse by financial institutions for brand-building; the benefits of \"composability\" in DeFi; and how tokenization could be used to foster innovation in everything from bond issuance to art ownership.&nbsp;","But Yue cautioned that \"a radically open mind does not mean that financial stability will fall by the wayside,\" stressing the need for the \"right guardrails.\" &nbsp;","Hong Kong has long positioned itself as the world's trading gateway into China and in recent weeks officials there had&nbsp;<a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/13\/P2022101100500.htm\" data-v-f87c67ca=\"\">spoken<\/a> of their goal to also become an international virtual assets center. At the fintech summit, which this year focused on Web3 and the metaverse, visitors were <a href=\"https:\/\/www.info.gov.hk\/gia\/general\/202210\/13\/P2022101100500.htm\" data-v-f87c67ca=\"\">given<\/a> proof of attendance protocol tokens issued as a non-fungible token.","The city was one of the first to introduce a regulatory licensing regime for fund managers and exchanges that traded digital assets, with other governments around the world trialling their own approaches to supervising crypto-related activities. Singapore last week <a href=\"https:\/\/www.theblock.co\/post\/179929\/singapore-regulator-proposes-banning-crypto-trading-with-borrowed-capital\" data-v-f87c67ca=\"\">proposed<\/a> new rules for retail crypto investors, including that they should not trade with borrow funds. The south east Asian city-state at the same time also issued a consultation paper on the regulation of stablecoins. Also last week, UK lawmakers <a href=\"https:\/\/www.theblock.co\/post\/179906\/uk-lawmakers-voted-to-include-crypto-rules-in-finance-regulation-bill\" data-v-f87c67ca=\"\">voted<\/a> through amendments to a finance bill that will widen regulatory supervision of digital assets.","Hong Kong lawmakers are currently reviewing new rules that will require crypto exchanges and digital asset service providers soliciting business from city residents to be licensed. At present, only professional investors in Hong Kong, who have to prove a set minimum net worth, can trade on exchanges run by BC Group and Hashnet, the only two exchange operators to have gained licenses so far under a current opt-in regime.&nbsp;","To date, other exchange operators looking at applying for licenses have been hesitant to proceed because of rules restricting the services they can offer, including a ban on more lucrative areas like taking leverage positions and derivatives trading, as well as limitations on providing liquidity, said <span class=\"msg-s-message-group__profile-link msg-s-message-group__name t-14 t-black t-bold hoverable-link-text\" data-v-f87c67ca=\"\"><a href=\"https:\/\/www.kwm.com\/au\/en\/people\/urszula-mccormack.html\" data-v-f87c67ca=\"\">Urszula McCormack<\/a>, partner at King &amp; Wood Mallesons. Firms can only offer pure automated matching, meaning international exchanges could instead offer brokerage or pursue an offshore reverse inquiry model without the same hurdles. ''While many are asking why would you bother, a&nbsp;lot of exchanges do value licenses, they are valuable from a reputational standpoint,'' McCormack said.<\/span>","The consultation on retail access marks a clear shift from recent comments to lawmakers scrutinising the new supervisory framework for digital asset service providers. It was prudent that only sophisticated investors be allowed to trade crypto, government officials&nbsp;<a href=\"https:\/\/www.legco.gov.hk\/yr2022\/english\/bc\/bc05\/minutes\/bc0520220729.pdf\" data-v-f87c67ca=\"\">told<\/a> lawmakers in July at a hearing on the proposed rule changes. After lawmakers pushed back at the meeting, suggesting that if retail investors were unable to trade on locally licensed exchanges they would use unlicensed overseas ones, officials said the regulator would likely hold a public consultation on the issue.","Speaking at the conference, the SFC's Leung also said the regulator saw benefits in Security Token Offerings (STOs) and the use of Digital ledger technology in securities issuing and trading. The watchdog is also working on a circular that will outline a new regime for STOs.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"Paul Chan","content":"PERSON"},{"type":"Central Bank of United Arab Emirates","content":"ORGANIZATION"},{"type":"Bank of Thailand","content":"ORGANIZATION"},{"type":"Hong Kong Monetary Authority","content":"ORGANIZATION"},{"type":"Eddie Yue","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"the SFC","content":"ORGANIZATION"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"People’s Bank of China","content":"ORGANIZATION"},{"type":"McCormack","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"},{"type":"FinTech Week","content":"ORGANIZATION"},{"type":"Julia Leung","content":"PERSON"},{"type":"Securities and Futures Commission","content":"ORGANIZATION"},{"type":"SFC","content":"ORGANIZATION"},{"type":"King &amp; Wood Mallesons","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Digital","content":"ORGANIZATION"},{"type":"Urszula McCormack","content":"PERSON"},{"type":"BC Group","content":"ORGANIZATION"},{"type":"Bank of International Settlements Innovation Hub","content":"ORGANIZATION"},{"type":"Treasury Bureau","content":"ORGANIZATION"},{"type":"Leung","content":"PERSON"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"Central Bank Digital Currency","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Benjamin Robertson","The Block"]}