{"summary":"Aave DAO delegates have voted in favor of a proposal to rescue tokens lost by users of the DeFi lending protocol.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218375\/lost-and-found-aave-begins-first-phase-of-token-recovery-rescue-mission","publishDate":"2023-03-10T05:59:28","id":13895,"type":null,"title":"Lost and found: Aave begins first phase of token recovery rescue mission","category":["CRYPTO ECOSYSTEMS"],"content":["DeFi lending protocol Aave is set to rescue lost tokens for its users after the DAO voted unanimously in favor of commencing phase one of the asset recovery process.","The first phase will <a href=\"https:\/\/governance.aave.com\/t\/bgd-rescue-of-tokens-locked-on-aave-overview-and-phase-1\/8150\" data-v-f87c67ca=\"\">focus<\/a> on tokens mistakenly sent to smart contracts for AAVE, LEND, and staked AAVE tokens. These include tokens like AAVE, LEND, and stkAAVE, as well as UNI and USDT.","The value of rescued tokens is about $2.18 million, according to figures <a href=\"https:\/\/app.aave.com\/governance\/proposal\/?proposalId=166\" data-v-f87c67ca=\"\">provided<\/a> by <a href=\"https:\/\/www.theblock.co\/post\/209312\/aave-integrates-chainlinks-proof-of-reserves-on-avalanche-via-bgd-labs\" data-v-f87c67ca=\"\">Aave developer<\/a> Bored Ghosts Developing Lab. AAVE tokens form the bulk of the recovery in this phase with more than 29,188 AAVE and 107 staked AAVE tokens worth a total of $2.16 million. The LEND tokens recovered will be transformed to AAVE at a ratio of 100 LEND to 1 AAVE token.","Bored Ghosts Developing Labs said the rescue process is in response to calls from community members. The team said that the recovery mission will help many affected users.","However, not all lost tokens will be recovered during the process. Only tokens worth at least $500 will be included. This is because the cost of recovery would outweigh the value of the tokens. The recovery plan does not also include lost tokens sent from the wallets of centralized exchanges.","The recovered tokens will be sent to a distributor smart contract. Users will then be able to retrieve their lost tokens from the contract. To do so, they will have to use the same wallet address from which they initially lost them.","The recovery plan involves upgradable smart contracts within its ecosystem. Upgradable smart contracts allow project teams to run upgrades, fix bugs and generally improve upon smart contracts even after they are deployed on the blockchain. These changes only affect certain logic elements within the contract, without interfering with its state.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"$2.16 million","content":"MONEY"},{"type":"UNI","content":"ORGANIZATION"},{"type":"$500","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"DAO","content":"ORGANIZATION"},{"type":"$2.18 million","content":"MONEY"}],"hashtag":["AAVE","ASSETS","DAOS","DEXS","GOVERNANCE VOTES","SMART CONTRACTS"],"authors":["Osato Avan-Nomayo","The Block"]}