{"summary":"Top Democrat Maxine Waters, D-Calif., who used to lead the House Financial Services Committee, noted that one bill that the committee plans to mark up did not garner bipartisan support.\nThe committee is considering two CBDC-related bills on Wednesday, one led by Republicans and one that has bipartisan support. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252093\/maxine-waters-criticizes-anti-innovation-stance-of-republicans-over-anti-cbdc-bill","publishDate":"2023-09-20T11:38:33","id":1389,"type":null,"title":"Maxine Waters says Republicans are &#x27;anti-innovation&#x27; over CBDC bill","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Top Democrat Maxine Waters is not a fan of a Republican-led bill that would block the Federal Reserve from issuing a central bank digital currency to individuals.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Waters, D-Calif., who used to lead the House Financial Services Committee, noted that one bill that the committee plans to mark up did not garner bipartisan support.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The Republican bill before us today would stifle that research and prevent us from moving forward even if it means that the dollar loses its status as the world's reserve currency and even if it means that U.S. citizens lose out on faster, cheaper and simpler payments,\" Waters said on Wednesday. \"I am disappointed that Republicans have taken such a deeply anti-innovation stance.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Tom Emmer, R-Minn, introduced his \"CBDC Anti-Surveillance State Act,\" HR 5403, last week, which would prohibit the central bank from issuing a CBDC directly to individuals and block the Fed from indirectly issuing a CBDC through an intermediary. His bill is one of many bills being marked up on Wednesday and has 50 Republican cosponsors, according to a <a href=\"https:\/\/emmer.house.gov\/2023\/9\/emmer-reintroduces-cbdc-anti-surveillance-state-act\" data-v-f87c67ca=\"\">statement<\/a> from Emmer.&nbsp;<\/span>","Another bill related to CBDCs being marked up on Wednesday takes a more bipartisan turn. The Power to Mint Act, H.R. 3402 from Rep. Jake Auchincloss, D-Mass., and Rep. French Hill, R-Ark. would <a href=\"https:\/\/auchincloss.house.gov\/media\/in-the-news\/cong-auchincloss-fights-digital-currency-plan\" data-v-f87c67ca=\"\">require<\/a> the central bank to get authorization from Congress before issuing a CBDC.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Some conservative politicians have been <a href=\"https:\/\/www.theblock.co\/post\/224555\/fighting-digital-dollar-becomes-new-conservative-crypto-cause-to-champion\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">charging<\/span><\/a> against a CBDC. Florida Governor and presidential candidate Ron DeSantis signed a bill in May to ban the use of a federal CBDC in the Sunshine State. Vivek Ramaswamy, another presidential candidate, has also taken a strong position on CBDCs.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Every GOP candidate needs a clear answer to CBDCs: hell no,\" Ramaswamy posted in March on X.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Federal Reserve has been exploring the possibility of issuing a CBDC, though an <a href=\"https:\/\/www.theblock.co\/post\/249935\/top-fed-official-says-he-is-deeply-concerned-about-stablecoins-without-federal-oversight\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">official<\/span><\/a> said earlier this month that the central bank was not close to developing it quite yet. The Fed last year released a report examining the pros and cons of a CBDC.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"At this point, nobody fully understands the potential benefits and challenges of CBDCs or how their implementation could affect the preeminence of the U.S. dollar and global finance more broadly. That is why the Biden administration and the Federal Reserve are researching this,\" Waters said.<\/span>","<em data-v-f87c67ca=\"\">Updated to add details about bills&nbsp;<\/em>"],"hashtag":[]}