{"summary":"The EU has finalized technical discussions on its landmark MiCA regulatory framework.\nA leaked version of the final MiCA report shows a lift on restricting measures on stablecoins.\nThe report is now pushed to the next steps towards enforcement, projected to the start of 2024.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171740\/stablecoin-restriction-dropped-from-e-u-digital-asset-framework","publishDate":"2022-09-21T12:00:30","id":139,"type":null,"title":"Stablecoin restriction dropped from E.U. digital asset framework","category":["Policy"],"content":["European Union officials have taken the next step in crafting a comprehensive framework to govern digital assets, with a major win for stablecoin advocates included in the latest version.","A new draft of the markets in crypto-assets (MiCA) regulation, expected to be the final version of the rulemaking, obtained by The Block shows that limitations on the use of U.S. dollar-pegged tokens within the E.U. have been removed.","Digital asset industry lobbyists were concerned over the language, arguing that it could cause unintended consequences for the trading of cryptocurrencies in Europe.","Once final, the rulemaking will place binding guardrails on the digital asset industry in Europe. Per E.U. procedure the document must be translated into member country languages. Provisions for stablecoins are expected to come into force in January 2024, and the rest of the provisions in June 2024.","&nbsp;“It is now clear that transactions for trading are not to be counted to reach those thresholds,” said Tommaso Astazi, head of regulatory affairs at the Blockchain for Europe lobbying group. “It could have been a real problem for the whole trading market for cryptocurrencies in Europe.”","The legislation focuses more on stablecoins and other digital asset trading, but leaves the door open for further rulemaking on decentralized finance (DeFi) and non-fungible tokens (NFTs) by the European Banking Authority and other financial regulators. &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;","The rulemaking is the result of official “trilogue” discussions between the European Parliament, European Commission and European Council, which concluded on June 30. Unusually, parts of the text were intentionally left open for further discussion despite receiving initial tri-institutional approval.","European officials began the rulemaking process in response to the Facebook-supported Libra digital currency initiative, which has since stalled, though other stablecoins have since proliferated."],"hashtag":[]}