{"summary":"Since the Ethereum London upgrade was activated, more than 32,000 ETH has been burned — worth more than $100 million.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114334\/ethereum-network-burns-100-million-of-eth-in-first-week-after-london-upgrade","publishDate":"2021-08-12T07:44:11","id":13903,"type":null,"title":"Ethereum network burns $100 million of ETH in first week since &#x27;London&#x27;","category":["ETHEREUM"],"content":["The Ethereum network has now burned $100 million in ETH since the introduction of a transaction fee burning mechanism in its recent London upgrade. According to burn tracking site <a href=\"https:\/\/watchtheburn.com\/\" data-v-f87c67ca=\"\">WatchTheBurn<\/a>, 32,100 ETH has been destroyed so far since the upgrade occured on August 5.","This represents about half of the amount of ETH that was issued in this time to miners as a reward for creating blocks (and processing transactions). About 61,600 ETH ($194 million) was issued in this timeframe.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/cumulative-value-of-burned-eth-after-eip-1559\/embed\" title=\"Cumulative value of burned ETH after EIP-1559\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","The London upgrade contained a change referred to as EIP-1559, which was focused on simplifying the transaction fee process. It split the fees into two: a base fee that gets burned and a priority fee that is effectively a tip to the miner.","The base fee is generated based on the size of the previous block and is designed to increase when there's high demand and decrease when there's low demand. This is intended to work as a recalibration mechanism to accomodate the fluctuating demand for space on the blockchain. The base fee is burned and can no longer be used on the network — adding a disinflationary element.","The priority fee is similar to the previous type of fee. It goes directly to the miner and rewards them for processing the transaction (on top of the 2 ETH they get for mining the block). It can be used to entice miners to prioritize a specific transaction.","By burning a portion of transaction fees, this may reduce Ethereum miner revenue. That's likely to happen unless priority fees rise so much that they represent the levels transaction fees were at prior to the upgrade — an occurance that would mean higher fees for users.","The upgrade also doubled the maximum Ethereum block size. Blocks can now accommodate transactions that, in total, contain up to 30 million in gas, rather than the previous limit of 15 million. This is designed to help with periods of high demand. Despite this change, the base fee is designed to help the block size tend toward the 50% mark.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$100 million","content":"MONEY"},{"type":"$194 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"August 5","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"1559","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["Tim Copeland","The Block"]}