{"summary":"Coinbase said it is laying off more than 60 employees who work in its human resources division amid a turbulent market startled by the possible demise of fellow cryptocurrency exchange FTX.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185626\/coinbase-layoffs-more-than-60-recruiting-onboarding-employees","publishDate":"2022-11-10T15:50:56","id":13901,"type":null,"title":"Coinbase layoffs more than 60 recruiting, onboarding employees","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Coinbase said it is laying off more than 60 employees amid a turbulent market startled by the possible demise of fellow cryptocurrency exchange FTX.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The U.S.-based Coinbase said in a statement the plan to layoff employees who work in recruiting and onboarding would help the cryptocurrency exchange “operate as efficiently as possible.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Those employees affected would receive \"generous\" severance packages, according to a company spokesperson. In June, Coinbase cut 1,100 jobs, or 18% of its workforce, and its chief product officer departed as the exchange restructured its product team in early November.&nbsp;<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">FTX’s rapid fall from grace has sent shockwaves through the crypto industry. Trading platforms like Coinbase and Binance appear particularly concerned about proving they are not making, and will not make, the errors which may have contributed to FTX’s troubles.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["COINBASE","LAYOFFS"],"authors":["RT Watson","The Block"]}