{"summary":"Central bank digital currencies (CBDCs) will replace cash in the long term, according to Deutsche Bank’s research team.\nThe bank said the coronavirus pandemic has accelerated the use of digital payments over cash, and the trend will eventually lead to CBDCs taking over cash.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/84516\/deutsche-bank-cbdc-will-replace-cash","publishDate":"2020-11-13T07:05:38","id":1390,"type":null,"title":"Deutsche Bank says central bank digital currencies will replace cash in the long run","category":["Central Banks"],"content":["Central bank digital currencies (CBDCs) will replace cash in the long term, according to Deutsche Bank's research team.","In its latest edition of the \"Konzept\" periodical, <a href=\"https:\/\/www.dbresearch.com\/PROD\/RPS_EN-PROD\/PROD0000000000513730\/Konzept_%23_19%3A_What_we_must_do_to_rebuild.PDF?&amp;&amp;&amp;&amp;&amp;undefined&amp;realload=rNo7h23qUj9fn4qZT3GJd4SM\/4V5U89b6zYNkP2u0JtH7dA4WH3FriNRVNsfLBb8djYwxTrJsOfl4NCshm4MwA==\" data-v-f87c67ca=\"\">published<\/a> Tuesday, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/24483\/deutsche-bank-to-undergo-tough-cutbacks\" data-v-f87c67ca=\"\">the bank<\/a> said the coronavirus pandemic has accelerated the use of digital payments over cash, and the trend will eventually lead to CBDCs taking over cash.","However, many countries are behind in their progress for digital currencies, said Marion Laboure, a macro strategist at <a href=\"https:\/\/www.theblockcrypto.com\/linked\/12783\/deutsche-bank-suffers-one-of-its-largest-losses-on-a-single-trade-ever\" data-v-f87c67ca=\"\">Deutsche Bank<\/a>. China and Sweden, for instance, are leading the digital currency development. But if other countries do not catch up, \"they may find that their companies are forced to adopt the digital currencies and policies of other countries as payment mediums,\" said Laboure.","The U.S. and Europe, in particular, need to catch up, according to Laboure. Their development in the area is \"too slow,\" she said. While both the countries have been studying CBDCs, they do not appear to be in a rush to issue one.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">Key challenges&nbsp;<\/strong><\/span>","Laboure said developed nations need to overcome two key challenges for the issuance and adoption of CBDCs: Low interest rates and cultural\/ privacy norms.","CBDCs could help in today's environment of negative real interest rates, according to Laboure. \"That is because consumers currently have little incentive to deposit or save money. So, moving cash from under the mattress into a bank account is unlikely to happen (at scale) in the near term,\" said Laboure.","\"Similarly, with bank accounts paying low-interest rates, a CBDC could help disintermediate the banking system. People might choose to hold their money directly at the central bank.\"","As for privacy, Laboure said perspectives on this topic vary from culture to culture. In China, for instance, only a tenth of <a href=\"https:\/\/www.theblockcrypto.com\/post\/84516\/deutsche-bank-cbdc-will-replace-cash\" data-v-f87c67ca=\"\">Deutsche Bank's<\/a> survey participants reported concerns about anonymity and traceability. People in advanced economies, on the other hand, \"are more worried about privacy,\" said Laboure, citing the survey.","As CBDC developments will take time, countries should prioritize their digital payment systems in the meanwhile, according to Laboure. European nations, for instance, must have an independent European payment solution, similar to Sweden's Swish, said Laboure.","\"On a region-by-region basis, the penetration of the smartphone, the rollout of 5G technology, and the advance of digital ledger technology, or blockchain, could all disrupt traditional card payment systems,\" said Laboure."],"hashtag":["CBDCS"]}