{"summary":"New York Supreme Court judge Joel M. Cohen has granted the motion to modify the substance and temporal scope of the preliminary injunction Letitia James,","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/23758\/bitfinex-preliminary-injunction-modified-to-last-90-days-tethers-ability-to-extend-credit-line-still-frozen","publishDate":"2019-05-16T20:16:42","id":13913,"type":null,"title":"Bitfinex preliminary injunction modified to last 90 days, Tether&#x27;s ability to extend credit line still frozen","category":["EXCHANGES"],"content":["New York Supreme Court judge Joel M. Cohen has <a href=\"https:\/\/iapps.courts.state.ny.us\/nyscef\/ViewDocument?docIndex=gaZbHCDM5gRkxPSn0XDLCg==\" data-v-f87c67ca=\"\">granted the motion<\/a> to modify the substance and temporal scope of the preliminary <a href=\"https:\/\/iapps.courts.state.ny.us\/fbem\/DocumentDisplayServlet?documentId=4b49tAiV0nyEdhkNq3l0\/Q==&amp;system=prod\" data-v-f87c67ca=\"\">injunction<\/a> Letitia James, NY AG, filed against Bitfinex on April 25.","In the newly granted motion by Cohen, the court finds that the NYAG, \"has made a sufficient showing to warrant a targeted preliminary injunction preventing Respondents from continuing to let dollars flow out of Tether’s reserves via the type of extraordinary transaction that triggered Petitioner’s concern.\"","The motion also states that due to vagueness and being overboard on restrictions, the injunction should be modified to be more narrow in scope, and not impact the ordinary course of Bitfinex's commercial activity.","\"The Court finds that the preliminary injunction should be tailored to address OAG’s legitimate law enforcement concerns while not unnecessarily interfering with Respondents’ legitimate business activities. The&nbsp;Petitioner [NYAG] contends that she does not intend to restrict Respondents’ ordinary course of business activities, but the existing language creates a risk of doing just that.\"","The modified injunction directs Bitfinex to produce additional information and materials subject to the NYAG investigation, while ordering Bitfinex and Tether to restrain access to credit lines on USD reserves held by Tether. It also maintains that principals, executives, and agents of Bitfinex shall not receive distribution or dividends from funds received from Tether.","The preliminary injunction now has a set deadline of 90 days until it expires, granting the NYAG the ability to file an extension up to 14 days prior to expiration to petition a longer time-frame on its provisions.","In a <a href=\"https:\/\/www.bitfinex.com\/posts\/363\" data-v-f87c67ca=\"\">blogpost responding to the new modified injunction<\/a>, Bitfinex stated, \"This order is a victory in the ongoing defense of our business against the New York Attorney General’s office. We are grateful that Judge Cohen recognized, in argument before his court, that the original injunction obtained by the New York Attorney General was “both amorphous and endless,” and that it needed to be “as narrow as possible.”","\"We will vigorously defend against any action by the New York Attorney General’s office, and we remain committed, as ever, to protecting our customers, our business, and our community against their meritless claims,\" Bitfinex concluded.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York","content":"LOCATION"},{"type":"Letitia James","content":"PERSON"},{"type":"NY AG","content":"ORGANIZATION"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"April 25","content":"DATE"},{"type":"Bitfinex","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Joel M. Cohen","content":"PERSON"},{"type":"New York Supreme Court","content":"ORGANIZATION"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Cohen","content":"PERSON"}],"hashtag":[],"authors":["Ryan Todd","The Block"]}