{"summary":"Revolut’s crypto business appears to be doing well.\nIts customers held £93.3 million (~$121 million) worth of crypto assets at the end of 2019, 152% higher than 2018.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/74643\/revoluts-customers-held-more-than-120-million-worth-of-cryptocurrencies-in-2019","publishDate":"2020-08-12T08:50:40","id":1391,"type":null,"title":"Revolut&#x27;s customers held more than $120 million worth of cryptocurrencies in 2019","category":["Cryptocurrency"],"content":["European fintech unicorn Revolut's crypto business appears to be booming. Its customers held £93.3 million (~$121 million) worth of crypto assets at the end of 2019, the company revealed in its 2019 annual report published on August 10.","A Revolut spokesperson separately confirmed the numbers to The Block. The 2019 figure is 152% higher than the 2018 number of £37.1 million (~$48 million), meaning Revolut's customers held more crypto assets last year.","It is not clear which cryptocurrencies Revolut's customers held the most, the spokesperson declined to provide details. Revolut <a href=\"https:\/\/www.revolut.com\/legal\/cryptocurrency-terms\" data-v-f87c67ca=\"\">currently supports<\/a> six cryptocurrencies via its investing app — Bitcoin (BTC), ether (ETH), XRP, bitcoin cash (BCH), litecoin (LTC) and Stellar Lumens (XLM).","It remains unclear how much Revolut's customers currently hold in crypto assets, the spokesperson declined to provide 2020 figures. But the startup's crypto business appears to have increased, as Revolut noted in the annual report: \"Some products, such as crypto trading, have been positively impacted by COVID-19 in the short term.\"","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'Intangible assets'<\/strong><\/span>","Revolut recognises customers' crypto assets as \"intangible assets,\" per U.K. accounting standards. \"Cryptocurrencies are recognised at fair value using the revaluation model. Accordingly, an impairment loss on an asset that was not previously remeasured is recognised in profit or loss,\" Revolut said in the annual report.","While Revolut offers customers the ability to purchase cryptocurrencies via its app, the company itself owns cryptocurrencies, as noted in the annual report. \"The cryptocurrencies are held in trust with a qualified custodian, a cryptocurrency wallet provider, or with one of two currency exchanges and can be in either 'hot' (connected to the internet) or 'cold' (not connected to the internet) wallets. Revolut takes the security of the cryptocurrency extremely seriously and has robust systems in place to prevent unauthorised access,\" the company said in the report.&nbsp;","","","Revolut was launched in 2015 and <a href=\"https:\/\/blog.revolut.com\/revolut-launches-easiest-fastest-way-to-buy-cryptocurrencies\/\" data-v-f87c67ca=\"\">started offering crypto services<\/a> in December 2017, when bitcoin was at an all-time high of $20,000. Revolut currently has nearly 13 million retail customers, per the annual report.","Revolut <a href=\"https:\/\/www.theblockcrypto.com\/post\/71636\/revolut-teams-up-with-paxos-to-launch-crypto-service-in-the-us-and-it-points-to-broader-trends-in-the-fintech-space\" data-v-f87c67ca=\"\">recently said<\/a> that its active crypto clientele in Europe is above 1 million. Last month, the company <a href=\"https:\/\/www.theblockcrypto.com\/post\/71636\/revolut-teams-up-with-paxos-to-launch-crypto-service-in-the-us-and-it-points-to-broader-trends-in-the-fintech-space\" data-v-f87c67ca=\"\">also launched<\/a> its crypto service in the U.S., by partnering with Paxos Crypto Brokerage. Several U.S. fintech firms already provide crypto services, including Square's Cash App and SoFi. PayPal is also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/72177\/paypal-has-reportedly-partnered-with-paxos-to-launch-its-crypto-service\" data-v-f87c67ca=\"\">reportedly working<\/a> with Paxos on the launch of a crypto service.","While Revolut's crypto business appears to be doing well, the company remains a loss-making firm. Revolut's net loss tripled in 2019 to £106.5 million ($139.6 million) from £32.9 million ($42.7 million) in 2018. That was despite Revolut's revenues surging 180% to £162.7 million ($221.6 million) in 2019 as compared to £58.2 ($75.7 million) in 2018."],"hashtag":["FINTECH"]}