{"summary":"At Breakpoint last year, Solana Labs announced two funds totalling $250 million. Yet only a small portion has actually been deployed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190060\/solanas-flagship-gaming-and-social-media-funds-have-been-only-partially-deployed","publishDate":"2022-11-26T08:20:24","id":13911,"type":null,"title":"Solana’s flagship gaming and social media funds have been only partially deployed","category":["CRYPTO ECOSYSTEMS"],"content":["At Breakpoint 2021, Solana Labs announced two flagship funds: a $100 million fund focused on decentralizing <a href=\"https:\/\/www.theblock.co\/post\/123763\/privacy-policy\" data-v-f87c67ca=\"\">social media<\/a> and a $150 million fund to encourage <a href=\"https:\/\/www.theblock.co\/linked\/127476\/solana-ventures-announces-new-150-million-fund-for-blockchain-gaming\" data-v-f87c67ca=\"\">blockchain-based gaming<\/a>.","The social media fund was in partnership with Reddit co-founder <span data-v-628af130=\"\" data-v-f87c67ca=\"\">Alexis Ohanian<\/span>, while the gaming fund was in <span data-v-628af130=\"\" data-v-f87c67ca=\"\">partnership with blockchain gaming startup Forte and VC firm Griffin Gaming Partners — and was expected to be fully deployed within 18 months.<\/span>","A year on, the funds have only been partially deployed and the focus has been on small seed round investments, according to Solana Labs CEO Anatoly Yakovenko, speaking in an interview earlier this month in Lisbon at Breakpoint 2022. In terms of the social media fund, Yakovenko said the amount deployed so far is “nowhere near half.”","“We've done like a bunch of small investments, like usually our seed level checks from solana ventures are $100K or something like that. So we're never a big lead,” he said.&nbsp;","Due to a prevalence of well-capitalized VC funds that are interested in the Solana ecosystem, Solana Labs has been able to be frugal with its investments, he added.","When it comes to social media, Yakovenko said a number of products are in development, including Dispatch, Squads, Dialect and Wordcell, which are effectively decentralized versions of Reddit, WhatsApp, Twitter and other social media platforms.","“So every permutation of social is being tried. It's still very early, right?” Yakovenko said, adding that the projects have had only had 12 months to build so far and are under the gun to grind for product market fit. “I would love to see like a million users across all of them by next Breakpoint.”","As for the gaming funds, more capital has been deployed there, a spokesperson for Solana Labs chimed in. But it’s the same picture. Yakovenko said only small checks have written and Solana Labs hasn’t had to deploy most of the fund.&nbsp;","As for the state of blockchain gaming on Solana, Yakovenko said that 37 games are either live or in the process of going live. He contrasted it with the previous Breakpoint, where there was a dearth of gaming teams.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Griffin Gaming Partners —","content":"ORGANIZATION"},{"type":"Yakovenko","content":"PERSON"},{"type":"Squads","content":"LOCATION"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"$100K","content":"MONEY"},{"type":"Solana Labs","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Lisbon","content":"LOCATION"},{"type":"Solana","content":"LOCATION"},{"type":"$150 million","content":"MONEY"}],"hashtag":["SOLANA"],"authors":["Tim Copeland","The Block"]}