{"summary":"As the crypto space continues to mature, we at Eventus stand ready to put our expertise to work for the betterment of all stakeholders.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/99305\/sprinting-toward-surveillance-nydfs-techsprint-features-valuable-discussion-from-regulators-and-industry-firms-alike","publishDate":"2021-03-25T08:50:39","id":13915,"type":null,"title":"Sprinting Toward Surveillance: NYDFS Techsprint Features Valuable Discussion from Regulators and Industry Firms Alike","category":["THE BLOCK"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">By: Joe Schifano, Global Head of Regulatory Affairs, Eventus Systems<\/em><\/span>","Earlier this month, I participated in the <a href=\"https:\/\/www.dfs.ny.gov\/techsprint\" data-v-f87c67ca=\"\">NYDFS Techsprint<\/a>, a two-week hackathon that convened over 90 participants from a variety of digital assets stakeholders, including regulators, BitLicensees, consultants, vendors and more. The sprint culminated with a demo event that drew over 550 viewers across 22 countries. The nine teams collaborated to build solutions to solve four problem statements identified by NYDFS:","With the dust settled, the Techsprint appears to have been a big success. It served as a clarifying moment for NYDFS, demonstrating how industry engagement can help solve the challenge of supervising digital asset businesses.","The teams took similar but nuanced approaches reflecting current challenges of supervision in digital assets. One winning team built a dashboard, creating a one-stop shop of widgets for risk assessment. Another winner chose to consolidate data and metrics to a self-regulatory organization model and share relevant results with NYDFS. My team, the Block-Busters, which was capably led by Suzanne Lampow-Bernard from <a href=\"https:\/\/www.fticonsulting.com\/\" data-v-f87c67ca=\"\">FTI Consulting<\/a>, built a collaborative supervisory tool that analyzes structured data from BitLicensees to help NYDFS examiners improve effectiveness of their risk-based reviews. This won an award for Most Functional Prototype.","While approaches varied, several common themes emerged. All incorporated consolidated data across venues and data sources, moved toward real-time, accelerated reaction times and sought to provide better tools to identify bad actors. The teams also highlighted well-understood challenges: an uncertain regulatory landscape, questions around cybersecurity and data privacy, and the lack of a common reporting method among venues.","The Techsprint highlighted the natural tension between quickly empowering existing regulators with tools that leverage consolidated data and creating a more decentralized supervisory framework. This tension was evident as the judges repeatedly raised the issue of standardizing data while respecting the realities of the current regulations, data privacy and cybersecurity. Participants shared a desire to foster transparency and fairness. We learned that in a nascent industry like this one, a robust discussion is crucial for refining ideas and securing industry buy-in.","Looking ahead, NYDFS set the standard for regulators to be thoughtful and proactive in their quest to effectively supervise digital asset businesses. The Techsprint is an example of what can be achieved through a public and private sector partnership. Regulators globally are engaged both with the industry and among themselves to ensure regulations and supervision keep pace.","In an industry where bad actors cause massive financial losses and negative public sentiment, function matters above all else. I was proud to play a part in delivering the most useable surveillance technology to NYDFS, just as I am proud to deliver best-in-class surveillance every day for our clients around the world at <a href=\"https:\/\/www.eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus Systems<\/a>. As the crypto space continues to mature, we at Eventus stand ready to put our expertise to work for the betterment of all stakeholders.","***","<em data-v-f87c67ca=\"\">Joe Schifano is the Global Head of Regulatory Affairs at <a href=\"https:\/\/www.eventussystems.com\/\" data-v-f87c67ca=\"\">Eventus Systems<\/a>, where he partners with client stakeholders, champions their needs and concerns, communicates regulatory trends, offers insights to maximize effectiveness, and helps compliance and supervisory staff build best-in-class surveillance and monitoring capabilities<\/em>","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eventus Systems","content":"ORGANIZATION"},{"type":"Busters","content":"ORGANIZATION"},{"type":"Global Head of Regulatory Affairs","content":"ORGANIZATION"},{"type":"Suzanne Lampow","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Joe Schifano","content":"PERSON"},{"type":"Bernard","content":"PERSON"},{"type":"sprint","content":"ORGANIZATION"},{"type":"FTI","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}