{"summary":"Binance and Mastercard are partnering to launch a prepaid card in Brazil. It&#x27;s currently in testing phases and will launch within the next few weeks.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206662\/binance-mastercard-issuing-prepaid-card-in-brazil-as-regional-crypto-interest-grows","publishDate":"2023-01-30T10:09:51","id":13928,"type":null,"title":"Binance, Mastercard issuing prepaid card in Brazil as regional crypto interest grows","category":["COMPANIES"],"content":["Crypto exchange Binance and payments provider Mastercard are teaming up once again, this time to launch a prepaid Binance card in Brazil.","The card will enable Binance users with valid national identification to make purchases and pay bills with cryptocurrencies, according to a company release.","\"The prepaid card is part of the ongoing efforts toward evolving the bridge between existing financial services and the growing crypto ecosystem,\" Binance said.","The card is issued by Dock and is in beta testing with plans for it to be widely released in the coming weeks.","Last year, Binance <a href=\"https:\/\/www.theblock.co\/post\/161521\/binance-and-mastercard-launch-prepaid-crypto-to-fiat-card-in-argentina\" data-v-f87c67ca=\"\">rolled<\/a> out a prepaid card with Mastercard in Argentina.","“Brazil is an extremely relevant market for Binance, and we will continue to invest in new services for local users, as well as contributing to the development of the blockchain and crypto ecosystem in the country,\" said Guilherme Nazar, general manager at Binance for Brazil.","Latin America was the seventh largest cryptocurrency market in the Chainalysis index last year, with citizens of Latin American countries receiving $562 billion in crypto in the year through June 2022, a 40% jump. Interest in cryptocurrencies has flourished in places like Argentina where inflation nearly topped 100% in 2022. Cryptocurrencies are frequently also used for remittances between countries in an effort to avoid capital controls and costly transfer fees.","Binance plans to continue to expand the card into new markets. Several crypto exchanges have rolled out card partnerships including <a href=\"https:\/\/www.theblock.co\/post\/180006\/blockchain-com-launches-visa-debit-card-with-1-cashback-in-crypto\" data-v-f87c67ca=\"\">Blockchain.com<\/a> and <a href=\"https:\/\/crypto.com\/cards\" data-v-f87c67ca=\"\">Crypto.com<\/a>. Collapsed crypto exchange FTX <a href=\"https:\/\/www.theblock.co\/post\/175494\/ftx-to-launch-visa-debit-card-in-40-new-countries\" data-v-f87c67ca=\"\">planned<\/a> to roll out a Visa debit card out to more than 40 countries not long before its bankruptcy filing. Visa <a href=\"https:\/\/www.theblock.co\/post\/186753\/visa-ends-crypto-debit-card-partnership-with-ftx\" data-v-f87c67ca=\"\">terminated<\/a> the partnership as the exchange filed for Chapter 11 bankruptcy protection and said the U.S. debit card program would be wound down by the issuer.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"$562 billion","content":"MONEY"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Guilherme Nazar","content":"PERSON"},{"type":"Latin America","content":"LOCATION"},{"type":"Brazil","content":"LOCATION"},{"type":"40%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Argentina","content":"LOCATION"},{"type":"100%","content":"PERCENT"},{"type":"Binance","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["BINANCE","PAYMENTS"],"authors":["Kari McMahon","The Block"]}