{"summary":"Lending thrived in 2021 only to get hit the following year with a crisis stemming from the bankruptcy filings of FTX and Three Arrows Capital.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202202\/crypto-execs-agree-lending-needs-to-mature-outgrow-its-cliquish-nature-to-thrive","publishDate":"2023-01-13T12:49:25","id":1392,"type":null,"title":"Crypto execs agree lending needs to mature, outgrow its cliquish nature to thrive","category":["FINANCE FIRMS"],"content":["Crypto lending needs to diversify if it hopes to thrive, according to panelists speaking at the CFC Conference in St Moritz.","The bull cycle of 2021 marked a period of wild exuberance that sent the price of cryptocurrencies to astronomical heights, with the price of bitcoin hitting an all-time high of almost $69,000. Underpinning that froth was a surge in lending activities, supercharged by active traders seeking leverage to make large bets on coins.","In one case, Genesis Global Capital, owned by Digital Currency Group, originated $131 billion in loans for the year — seven times more than in 2020. During the third quarter, Genesis originated $8.4 billion in new loans, down 80% from the previous period. The firm is now verging on bankruptcy following last year's credit crunch stemming from the meltdown of Three Arrows Capital and Sam Bankman-Fried's Alameda and FTX.","Crypto's credit crisis was underpinned by a lack of diversity in counterparties and parameters that would give traders a better sense of their counterparties' risk, Diogo Monica, co-founder of crypto financial services provider Anchorage, said.","In traditional finance, “since there’s more counterparties … you end up not having huge risk,” he said. “And in fact, there’s a lot of rules and regulations that make you give enough data so that you can actually judge what other people’s positions are at other prime brokers. None of that exists in crypto. It’s all the same people.”","The desire to draw upon the principles of traditional finance was echoed by SwissBorg’s Cyrus Fazel, who said that the market “should take what was in asset management, what was in banking, and power it with many institutions in crypto.”","Fazel, Monica and fellow panelist David Olsson of Kraken agreed that decentralized lending could also play a larger role in the crypto credit market.","Olsson, who recently joined Kraken to lead its prime finance business, said that the crypto exchange could draw upon pools of decentralized credit from protocols like Aave and Compound.","“There is a model where you can have a two-speed solution where we could do certain lending for a client on balance sheet ... and then if there are risks that we are not comfortable with as an institution … we could participate in a DeFi protocol,\" Olsson said.","DeFi lending for institutions will have to be permissioned, Olsson said, noting that institutional investors need “a lot of hand-holding and human intelligence around … red flags that are outside the world of pure protocol and computational power.”","“That’s going to be the way it is 30 years from now,\" Olsson said.","<i data-v-f87c67ca=\"\"><span data-contrast=\"none\" data-v-f87c67ca=\"\">Disclaimer: Beginning in 2021, Michael McCaffrey, the former CEO and majority owner of The Block, took a series of loans from founder and former FTX and Alameda CEO Sam Bankman-Fried. McCaffrey resigned from the company in December 2022 after failing to disclose those transactions.<\/span><\/i><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"80%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Anchorage","content":"LOCATION"},{"type":"David Olsson","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$8.4 billion","content":"MONEY"},{"type":"$69,000","content":"MONEY"},{"type":"Diogo Monica","content":"PERSON"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Cyrus Fazel","content":"PERSON"},{"type":"$131 billion","content":"MONEY"},{"type":"CFC Conference","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Monica","content":"PERSON"},{"type":"St Moritz","content":"LOCATION"},{"type":"Olsson","content":"PERSON"},{"type":"Michael McCaffrey","content":"PERSON"},{"type":"Genesis Global Capital","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"third quarter","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}