{"summary":"The investment powerhouse says it will offer commission-free trading of bitcoin and ether alongside traditional stock investments.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/182635\/fidelity-turns-its-attention-to-retail-investors-with-new-crypto-offering","publishDate":"2022-11-03T08:56:03","id":13925,"type":null,"title":"Fidelity turns its attention to retail investors with new crypto offering","category":["BITCOIN"],"content":["Fidelity is going after retail investors with a new crypto offering.&nbsp;","The investment powerhouse opened up a waiting list for <a href=\"https:\/\/www.fidelity.com\/crypto\/trading\" data-v-f87c67ca=\"\">Fidelity Crypto<\/a>, which it says will offer commission-free trading of bitcoin and ether alongside traditional stock investments in one app. Other cryptocurrencies are being evaluated and could be added in the future.&nbsp;","While users won't be charged a commission, the site says a spread of 1% will be factored into every trade execution price.","The retail-oriented product is being backed by its institutionally focused Fidelity Digital Assets unit. There was no indication on the site as to when trading will be available to early adopters.&nbsp;","The product is getting rolled out just weeks after Fidelity Institutional President Michael Durbin said he <a href=\"https:\/\/www.theblock.co\/post\/179409\/fidelity-institutional-president-sees-room-for-more-crypto-in-consumer-portfolios\" data-v-f87c67ca=\"\">sees<\/a> more room for crypto in consumer portfolios.&nbsp;","Fidelity has been quicker to embrace digital assets than most other large investment companies. The company offers a bitcoin exchange-traded fund in Canada, multiple crypto and metaverse-related ETFs in the U.S. It has also allowed investment in bitcoin through 401(k) retirement accounts.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fidelity Crypto","content":"ORGANIZATION"},{"type":"Canada","content":"LOCATION"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Michael Durbin","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"U.S","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Larry DiTore","The Block"]}