{"summary":"A committee tasked with advising the CFTC voted to advance a digital assets taxonomy that they say is a first in providing regulatory clarity. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/280977\/cftc-advisory-committee-votes-to-advance-pioneering-digital-assets-taxonomy-for-agency-review","publishDate":"2024-03-06T16:59:38","id":13921,"type":null,"title":"CFTC advisory committee votes to advance pioneering digital assets taxonomy for agency review","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">A committee tasked with advising the Commodity Futures Trading Commission voted on Wednesday to advance a digital assets taxonomy that they describe as unprecedented in offering regulatory clarity. This framework is intended to help draft future legislation and regulations.<\/span>","The CFTC's Global Markets Advisory Committee voted to recommend a comprehensive digital assets taxonomy developed by its Digital Asset Markets Subcommittee. This recommendation, now up for CFTC's consideration, seeks to standardize terminology for regulatory clarity and covers digital assets, central bank digital currencies, stablecoins, and more.","<span class=\"s1\" data-v-f87c67ca=\"\">\"A good friend of mine always says words make worlds, and we are hoping that these words will make regulations where appropriate,\" said Caroline Butler, global head of digital assets at BNY Mellon during the meeting. Butler is also the co-chair of the GMAC's Digital Asset Markets Subcommittee.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Lawmakers in Washington have been working over the past year on bills to regulate crypto by taking a comprehensive approach, but also focusing on creating a federal framework for stablecoins. Regulators have worked on rules impacting the crypto industry, while bringing charges against crypto firms. The industry, meanwhile, has said clarity is needed from both lawmakers and regulators on how rules and laws apply to them.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The new taxonomy looks to have \"consistent language for participants in the digital asset ecosystem to promote innovation, identify and address risk considerations, and enable effective regulatory understanding,\" according to the panel's presentation. The approach will build on work being done by global standard setters such as the Financial Stability Board, they said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The quality of the output is again also tremendous given the socialization and the feedback from not just the members, many of which are global, but also as I understand it from international organizations and regulatory counterparts all around the world,\" said CFTC Commissioner Caroline Pham during Wednesday's meeting. Pham also sponsors the Global Markets Advisory Committee.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Digital Asset Markets Subcommittee","content":"ORGANIZATION"},{"type":"Caroline Butler","content":"PERSON"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"GMAC","content":"ORGANIZATION"},{"type":"Caroline Pham","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Global Markets Advisory Committee","content":"ORGANIZATION"},{"type":"Financial Stability Board","content":"ORGANIZATION"}],"hashtag":["CFTC"],"authors":["Sarah Wynn","The Block"]}