{"summary":"Reddit filed to go public Thursday and it turns out the company has a small amount of cryptocurrencies on its balance sheets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/278723\/reddit-holds-immaterial-amounts-of-bitcoin-and-ether-on-its-books","publishDate":"2024-02-22T17:56:09","id":13934,"type":null,"title":"Reddit holds &#x27;immaterial&#x27; amounts of bitcoin and ether on its books","category":["COMPANIES"],"content":["Reddit filed forms Thursday to go public and it turns out the company behind the social media site has a small amount of cryptocurrencies on its balance sheets.","<span data-v-f87c67ca=\"\">“We invested some of our excess cash reserves in <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.72%\n    <\/span><\/a> <!----><\/span><\/span> and Ether and also acquired Ether and Matic as a form of payment for sales of certain virtual goods, which we may continue to do in the future,” the company said <\/span><a href=\"https:\/\/www.sec.gov\/Archives\/edgar\/data\/1713445\/000162828024006294\/reddits-1q423.htm\" data-v-f87c67ca=\"\">in its S-1 filing<\/a>. “As of December&nbsp;31, 2023, we did not hold digital assets other than Bitcoin and Ether for treasury purposes, and our investment policy requires approval by our board of directors for any investments in cryptocurrencies.”","With that said, Reddit noted on its financial statements, “The net carrying value of our cryptocurrencies, which consisted primarily of Bitcoin and Ether, as well as all related cryptocurrency activity, was immaterial for the periods presented.” In other words, it wasn’t enough to break out in the filing.","Perhaps with a wary eye to regulators, Reddit was careful with what cryptocurrencies it held on to. The filing noted that it limited its treasury holdings to bitcoin, ether, and “any other cryptocurrency” which regulators such as the Securities and Exchange Commission or the Commodities Futures Trading Commission will likely not view as a security.","Reddit has pursued crypto-related projects in the past, most notably its series of Polygon-based NFTs which the company calls Collectible Avatars, shying away from the \"NFT\" term which has proven controversial to users of the site. At their <a href=\"https:\/\/www.theblock.co\/post\/191984\/reddit-digital-collectible-minting-hits-all-time-high\" data-v-f87c67ca=\"\">peak of popularity<\/a>, hundreds of thousands of collectibles were minted each day.&nbsp;","Reddit also experimented with blockchain-based rewards called Community Points for several popular subreddits, including the \/r\/CryptoCurrency forum; however, the company <a href=\"https:\/\/www.theblock.co\/post\/258016\/reddit-plans-to-sunset-its-blockchain-based-reward-service-community-points\" data-v-f87c67ca=\"\">sunset the program<\/a> last October, citing problems with regulation and scalability.&nbsp;","To go public, Reddit requires approval from the SEC and first filed its paperwork confidentially with the regulator in December 2021. The company, which is seeking to trade its shares on the New York Stock Exchange with the ticker RDDT, has yet to reveal the amount or price of the shares. A panoply of Wall Street’s largest institutions — Morgan Stanley, Goldman Sachs, JPMorgan, and Bank of America Securities — are leading the underwriting, along with Citigroup and Deutsche Bank among others getting in on the action.","Reddit noted that it acquires crypto “in exchange for goods and services.” On its balance sheet, it assesses its holdings quarterly “or more frequently” for impairments, which is then put on its income statement under general and administrative expenses. However, if the price of its holdings subsequently rises, the company noted in its filings, that won’t show up until the crypto is sold.","As is standard practice, Reddit added disclaimers on many of its business practices and outlooks, but it was noteworthy that the company had this sentence in its disclaimer on cryptocurrencies: “While we believe cryptocurrencies and blockchain technology have significant potential, the popularity and prevalence of cryptocurrencies is a relatively recent trend, and whether cryptocurrencies and blockchain technology will continue to be adopted by consumers and businesses in the long term is uncertain.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Community Points","content":"ORGANIZATION"},{"type":"+0.72%","content":"PERCENT"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Matic","content":"PERSON"},{"type":"Deutsche Bank","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"December&nbsp;31, 2023","content":"DATE"},{"type":"Citigroup","content":"ORGANIZATION"},{"type":"Bank of America Securities","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":[],"authors":["Lawrence Lewitinn","The Block"]}