{"summary":"ARK Invest and Glassnode on Thursday announced a new metric for analyzing bitcoin supply and demand dynamics.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247164\/ark-invest-and-glassnode-collaborate-on-new-metric-for-bitcoin-analysis","publishDate":"2023-08-24T12:05:39","id":13937,"type":null,"title":"Ark Invest and Glassnode collaborate on new metric for bitcoin analysis","category":["CRYPTO INFRASTRUCTURE"],"content":["<a href=\"https:\/\/www.theblock.co\/post\/240185\/ark-invest-coinbase-cathie-wood\" data-v-f87c67ca=\"\">ARK Invest<\/a> and <a href=\"https:\/\/www.theblock.co\/post\/180055\/glassnode-acquires-crypto-tax-and-portfolio-platform-accointing-com\" data-v-f87c67ca=\"\">Glassnode<\/a> unveiled a new metric for analyzing bitcoin supply and demand dynamics in a <a href=\"https:\/\/ark-invest.com\/subscribe-to-ark-crypto-reports-ct\/?utm_content=261737576&amp;utm_medium=social&amp;utm_source=twitter&amp;hss_channel=tw-2398137084\" data-v-f87c67ca=\"\">report<\/a> released Thursday.","Called \"Cointime Economics,\" the framework paints&nbsp;\"a more accurate picture of the real economic weight of each bitcoin in the network\" and includes a measure of the last time each bitcoin was transacted.&nbsp;","\"The importance of a single bitcoin should vary based on the last time it moved,\" the report said. \"The information value of a bitcoin that had been unmoved for 10 years is more important than one that had been unmoved for one week.\"","The report described current industry-standard frameworks as leading to \"analyst-made decisions that may be prone to inaccuracies.\" Adjusted supply and free-float supply were highlighted as potentially leading to analyst errors.","The new framework uses a unit of measurement called a Coinblock, which looks at the number of blocks produced during the period in which a bitcoin remained unmoved.","\"It provides a more precise version of the market-value-to-realized-value (MVRV) ratio. It gives a&nbsp; more accurate measurement of bitcoin’s inflation rate over time, its volume, and its time-weighted cost basis,\" the report added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cointime Economics","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Glassnode","content":"PERSON"}],"hashtag":[],"authors":["Brian McGleenon","The Block"]}