{"summary":"Community Labs, a software development company and venture studio, announced a $30 million strategic investment round led by Lightspeed Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168937\/community-labs-raises-30-million-strategic-funding-round","publishDate":"2022-09-09T14:32:00","id":13935,"type":null,"title":"Community Labs raises $30 million strategic funding round","category":["CRYPTOCURRENCY"],"content":["Community Labs, an Arweave-native software development company and venture studio focused on data storage in the Arweave ecosystem, announced a $30 million strategic investment round on Thursday.","The investment round was led by Lightspeed Venture Partners. Among the other investors were Arweave, Bain Capital Crypto and Blockchain Capital.","Arweave is one of the largest decentralized data storage providers in the industry , and it enables the permanent storage of on-chain data. In blockchains, immutability – the ability for a blockchains’ history to remain permanent and unalterable – is fundamental in ensuring trust, correctness and proper functioning of decentralized networks.","Community Labs was founded by 19-year-old Tate Berenbaum, who is now on leave from the University of Virginia to pursue this business venture.","Community Labs believes permanent data storage is “one of the least known yet most impactful advancements to society,” <a href=\"https:\/\/twitter.com\/CommunityLabs1\/status\/1567926467044020224?s=20&amp;t=4GJ5ox_ssDEmQF3AJvq2rg\" data-v-f87c67ca=\"\">it wrote on Twitter.<\/a>","The strategic investment will primarily be geared toward furthering this belief by building and funding teams working toward leveraging on-chain data storage in unique and novel ways.","Community Labs said it is currently working with one project called Execution Machine, which is creating a solution for trustless and serverless application development. What this means is that by using Execution Machine and Arweave, builders and users are able to create and use native web user experiences, while abstracting away crypto native tools such as wallets and transactions.","Although Arweave offers and is known for its data storage offerings, Berenbaum also believes there is unlocked potential using Arweave for financial use cases, such as chains like Ethereum and Solana.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the University of Virginia","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Lightspeed Venture Partners","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Berenbaum","content":"PERSON"},{"type":"Tate Berenbaum","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Execution Machine","content":"ORGANIZATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}