{"summary":"Despite regulatory overhang, analysts increased their price targets for the stock, according to data compiled by The Block Research.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/235296\/coinbase-stock-gains-nearly-6-last-week-consensus-price-target-inches-up","publishDate":"2023-06-18T10:03:15","id":13947,"type":null,"title":"Coinbase stock gained nearly 6% last week, consensus price target inches up","category":["MARKETS"],"content":["Coinbase's stock price picked up nearly 6% over the last week as the average price target among analysts slightly increased, according to data compiled by The Block Research.&nbsp;","Coinbase traded up 5.93% last week, ending the week's session at $55.59 despite the overhang of the US Securities and Exchange Commission's lawsuit against the exchange-operator. The stock is up more than 7% since the SEC announced its suit on June 6.&nbsp;","Meanwhile, the average price target for COIN by analysts inched up slightly from $69.17 per share to $69.70 as of June 18. The tick up was underpinned by one broker removing its sell rating coverage for the stock, which in turn elevated the consensus coverage rating.","","","Aside from regulatory related headlines, the exchange announced last week that it bought back $64.5 million worth of their Convertible Senior Notes, a type of debt that can be exchanged into a set amount of the issuer's shares, at a 29% discount, according to a company&nbsp;<a href=\"https:\/\/www.businesswire.com\/news\/home\/20230615350208\/en\/Coinbase-Announces-Repurchase-of-0.50-Convertible-Senior-Notes-Due-2026\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">release<\/a>.&nbsp;","\"We are always looking for the best opportunities to deploy capital to create shareholder value,” said Alesia Haas, Coinbase's chief financial officer, in a company statement. “This opportunistic repurchase is a continuation of those efforts and reflects our confidence in our business, strong first quarter financial performance, and improved competitive positioning.\"","$1.373 billion of notes will remain outstanding following the close of the repurchase, the firm said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"6%","content":"PERCENT"},{"type":"5.93%","content":"PERCENT"},{"type":"$69.70","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$69.17","content":"MONEY"},{"type":"June 6","content":"DATE"},{"type":"$64.5 million","content":"MONEY"},{"type":"Alesia Haas","content":"PERSON"},{"type":"29%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"June 18","content":"DATE"},{"type":"$1.373 billion","content":"MONEY"},{"type":"US Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$55.59","content":"MONEY"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}