{"summary":"Tether is calling for Roche Freedman to get thrown off the case entirely, arguing the allegations against Roche could extend to the firm.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167286\/tether-asks-court-to-terminate-roche-freedman-from-class-action","publishDate":"2022-09-01T18:00:23","id":13944,"type":null,"title":"Tether asks court to terminate Roche Freedman from class action","category":["LEGAL"],"content":["Digital currency company Tether wants the judge presiding over a class action suit against it to remove law firm Roche Freedman from the case, a request that if granted could weaken the suit against the stablecoin giant. ","The request comes less than a week after video of one of Roche Freedman’s founding partners, Kyle Roche, was published by an anonymous blog, Crypto Leaks, with an accompanying post alleging Roche strategically brought multiple class actions on behalf of development company Ava Labs. Roche claims that the video was selectively edited and illegally obtained, and both he and leadership at Ava Labs vigorously deny the allegation. &nbsp;","Yesterday Roche <a href=\"https:\/\/www.theblock.co\/post\/166816\/attorney-files-to-withdraw-from-tether-bitfinex-tron-and-binance-suits\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"0\" data-v-f87c67ca=\"\">filed to remove himself from the case<\/a>, among other class actions, citing that he is no longer with the firm's class action practice. But in a filing made yesterday, Tether’s lawyers argue Roche’s prior involvement in the case is enough to throw the firm off of it. &nbsp;&nbsp;","\"The individual withdrawal of Mr. Roche, however, does little if anything to address the serious issues regarding the potential misuse of discovery and class action lawsuits generally,\" Tether’s lawyers Tether. \"Even if he is no longer counsel of record, he would still have access to discovery materials, would retain the ability to direct the conduct of other lawyers at his firm, and would profit from any potential recovery in this lawsuit.\" ","Roche Freedman <a href=\"https:\/\/www.theblock.co\/post\/42299\/class-action-lawsuit-against-bitfinex-and-tether-filed-by-lawyers-who-successfully-sued-craig-wrightThe\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-safelink=\"true\" data-linkindex=\"1\" data-v-f87c67ca=\"\">initiated<\/a> the class action against sister firms Bitfinex and Tether in 2019, alleging over $1.4 trillion in damages suffered by plaintiffs. The suit claims a \"sophisticated scheme\" that defrauded investors, manipulated markets and concealed illicit proceeds.","On Thursday Roche filed to withdraw from another suit, the firm’s class action against Binance.US. That case has been one of the firm's highest-profile suits, addressing the fallout of the Terra\/Luna collapse.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Crypto Leaks","content":"PERSON"},{"type":"Roche Freedman","content":"PERSON"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ava Labs","content":"ORGANIZATION"},{"type":"Kyle Roche","content":"PERSON"},{"type":"$1.4 trillion","content":"MONEY"},{"type":"Roche","content":"PERSON"},{"type":"2019","content":"DATE"}],"hashtag":["TETHER"],"authors":["Aislinn Keely","The Block"]}