{"summary":"Liquid MarketPlace is set to bring tokenized trading for physical items, starting with trading cards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140573\/logan-pauls-marketplace-for-tokenized-collectibles-goes-live-after-raising-8-million","publishDate":"2022-04-05T09:52:41","id":13940,"type":null,"title":"Logan Paul’s marketplace for tokenized collectibles launches after raising $8 million","category":["TECHNOLOGY"],"content":["YouTuber Logan Paul may have been bamboozled by a set of fake Pokémon cards that he spent $3.5 million on,&nbsp;but that experience hasn’t deterred his love for collecting trading cards.","Alongside co-creators Ryan Bahadori and Amin Nikdel, he’s now launched a platform called Liquid MarketPlace, with the goal of taking physical (and digital) items like trading cards and tokenizing them. The idea is to take particularly high-end items, especially one-of-a-kind pieces, and make them accessible to anyone.","Someone who wants to sell their physical item on the marketplace has to have it delivered to a vault. Once in Liquid MarketPlace’s possession, the item can then be sold on the marketplace, with each token accounting for 10 cents of the item’s value. The tokens will be ERC-20 tokens on the Ethereum blockchain and can be transferred outside of the marketplace, although it recommends users avoid doing so for safety reasons.","To get under way, Liquid has raised 10 million Canadian dollars ($8 million) from undisclosed investors, according to a press release. At the same time, it touts a number of advisors, including Jeremy Padawar, the former co-president of Wicked Cool Toys, which received the Pokémon toy license outside of Asia, alongside musician Steve Aoki, who’s spent his time recently either selling NFTs or <a href=\"https:\/\/twitter.com\/MonkeyKingdom_\/status\/1472047841044762628\" data-v-f87c67ca=\"\">performing<\/a> in the metaverse.","Bahadori said that the team wanted to level the playing field for those who are passionate about collecting items and claimed that the platform offers “genuine ownership” over the assets.&nbsp;","The issue of ownership when it comes to tokens is a bit complex. It’s unclear whether ownership is fully represented by purchases of tokens, or possession of them after sales on a secondary market.","Another tricky issue regarding tokenizing assets — whether physical or digital — is about what happens at the end of the process. Once an item has been split up into thousands or millions of pieces and these tokens are possessed by thousands of people, how do you piece it back together in order to reclaim ownership?&nbsp;","In this case, there’s a buyout system. If one person manages to acquire a certain buyout percentage (not stated in the platform’s terms and conditions) then they are able to trigger a buyout vote. If 80% of the token holders vote in favor of a buyout at a given price within 72 hours, then that person is able to buy everyone else out. In this case, they are then able to claim the item and have it physically delivered to them.","Upon the marketplace’s launch, it will offer a few items including “Logan Paul’s Personal WOTC Pokémon 1st Edition Base Set Booster Box,” a number of rare National Treasures basketball cards and CryptoPunk #6837, which sports an eye mask and a purple cap.","If Liquid MarketPlace takes off, it will cross off one of Paul’s goals for 2022 that he published to his Instagram account last year. Other goals include building a web3 community through culture and art and leading a shift from NFT 1.0 to NFT 2.0 (whatever that means).","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pokémon 1st Edition Base","content":"ORGANIZATION"},{"type":"80%","content":"PERCENT"},{"type":"Ryan Bahadori","content":"PERSON"},{"type":"10 million Canadian dollars ($8 million","content":"MONEY"},{"type":"Bahadori","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Amin Nikdel","content":"PERSON"},{"type":"Logan Paul","content":"LOCATION"},{"type":"$3.5 million","content":"MONEY"},{"type":"Jeremy Padawar","content":"PERSON"},{"type":"National Treasures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"10 cents","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Steve Aoki","content":"PERSON"},{"type":"Paul’s","content":"PERSON"},{"type":"#6837","content":"DATE"}],"hashtag":["TOKENS"],"authors":["Tim Copeland","The Block"]}