{"summary":"Stakeholders of the Compound lending protocol narrowly rejected a proposal that suggested getting rid of all of its liquidity rewards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142920\/compound-governance-rejects-proposal-wanting-to-end-large-token-rewards","publishDate":"2022-04-21T13:16:16","id":13950,"type":null,"title":"Compound governance rejects proposal wanting to end large token rewards","category":["DEFI"],"content":["<span data-v-f87c67ca=\"\">A <\/span><a href=\"https:\/\/compound.finance\/governance\/proposals\/100\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">governance proposal<\/span><\/a><span data-v-f87c67ca=\"\"> for Compound Finance aimed at removing the protocol’s user rewards failed on Thursday, despite heavy support from VC firm Andreessen Horowitz (a16z).<\/span>","There were 499,849 votes against the proposal and only 492,678 for it (where votes equals tokens). Notably there were more than twice as many crypto addresses that voted for the proposal, suggesting multiple large holders of COMP tokens were against it.","<span data-v-f87c67ca=\"\">At present, Compound, which is a lending and borrowing protocol, works like this. It pays COMP tokens out to borrowers and lenders on its protocol, a process also known as liquidity mining. Such token rewards serve as a yield paid to users locking in funds into Compound. <\/span>","<span data-v-f87c67ca=\"\">Yet some of the protocol’s contributors and investors view these rewards as an issue.<\/span>","<span data-v-f87c67ca=\"\">Compound developer TylerEther, who made the proposal to Compound's governance forum, pitched the idea that Compound should slash these rewards to zero. He argued that user COMP rewards do not add value and those who receive the rewards immediately sell them.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The developer made the case that though the COMP rewards were helpful in bootstrapping the protocol in its early phase — by rewarding early users — they have grown to be \"very problematic\" now.<\/span>","<span data-v-f87c67ca=\"\">“Since most COMP being distributed by the current rewards program is instantly sold off, existing users and token holders are at a great disservice. Their share of the protocol is being diluted for nothing other than farming COMP for profit,” Tyler’s proposal read.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">During the voting period, a16z came out <\/span><a href=\"https:\/\/twitter.com\/_jamico\/status\/1516902742513491968\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">in full support<\/span><\/a><span data-v-f87c67ca=\"\"> of the proposal. The voting results show that more than half of all favorable votes (492,678) came from a16z.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As an entity running a crypto-focused fund worth <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/130954\/andreessen-horowitz-plans-to-raise-4-5-billion-for-new-crypto-funds\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$4.5 billion<\/span><\/a><span data-v-f87c67ca=\"\">, a16z has made sizable bets in the Ethereum’s DeFi ecosystem, including Compound and other popular protocols like Uniswap. In the past, a16z has been criticized for <a href=\"https:\/\/www.theblockcrypto.com\/post\/115705\/a16z-answers-critics-with-fresh-disclosures-on-defi-delegate-program\" data-v-f87c67ca=\"\">swaying decisions<\/a> in specific DeFi protocols it has invested in — primarily by voting with large amounts of governance tokens bought directly from the protocol founders.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Highlighting the issue with Compound’s current system for rewards, Jeff Amico, a partner at a16z Crypto and head of network operations, said the newly-minted Compound rewards go to \"recursive positions,\" which he claimed were not a valuable use of the limited supply of tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">A recursive position is when a user deposits funds into a lending protocol like Compound and uses the collateral to borrow more of the same asset in an effort to grow the position, so they can earn more COMP tokens. Amico <\/span><a href=\"https:\/\/twitter.com\/_jamico\/status\/1516902744736423937\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">estimated<\/span><\/a><span data-v-f87c67ca=\"\"> that it cost the Compound protocol $60 million annually to pay these rewards.<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Those who voted against the proposal, including Compound’s co-founder and chief technology officer Geoffrey Hayes, said the proposal could have harmed Compound’s level of decentralization. Besides supporting a protocol’s liquidity, it is believed that token rewards help contribute to decentralization. By distributing a token far and wide rather, it lessens the chances that the ownership is concentrated in a few hands.<\/span>","<span data-v-f87c67ca=\"\">“I want to be very clear: decentralization of the protocol has been, and should continue to be, the primary target of governance,” Hayes <\/span><a href=\"https:\/\/www.comp.xyz\/t\/comp-reward-adjustments-v2\/3074\/17?u=hayesgm\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\">. He added the protocol should not hurry into passing it and that it should take more time to evaluate its consequences. According to Hayes, stopping the rewards could turn out to be a mistake and lead to a fall in overall health of the protocol.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.5 billion","content":"MONEY"},{"type":"Compound","content":"ORGANIZATION"},{"type":"Compound Finance","content":"ORGANIZATION"},{"type":"Geoffrey Hayes","content":"PERSON"},{"type":"Hayes","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"$60 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Jeff Amico","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}