{"summary":"The U.S. Department of the Treasury held a meeting yesterday to discuss the challenges of regulating the cryptocurrency space\nTreasury said it would not tolerate the use of crypto in support of illicit activities.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57540\/us-treasury-met-with-industry-leaders-to-discuss-crypto-regulatory-challenges","publishDate":"2020-03-03T03:15:24","id":1395,"type":null,"title":"US Treasury met with industry leaders to discuss crypto regulatory challenges","category":["Regulation"],"content":["The U.S. Department of the Treasury held a meeting yesterday to discuss the challenges of regulating the digital assets space.","Industry thought leaders and compliance experts <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/sm926\" data-v-f87c67ca=\"\">joined<\/a> the working session to discuss how cryptocurrencies can be prevented from the misuse by money launderers, terrorist financiers, and other bad actors.","Treasury said it would not tolerate the use of crypto in support of illicit activities.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nJust yesterday, Treasury's Office of Foreign Assets Control (OFAC) <a href=\"https:\/\/www.theblockcrypto.com\/linked\/57497\/u-s-sanctions-chinese-nationals-accused-of-laundering-millions-in-stolen-crypto-for-north-korea-tied-hackers\" data-v-f87c67ca=\"\">sanctioned<\/a> two Chinese nationals - Tian Yinyin and Li Jiadong - for their role in laundering funds tied to a multi-million dollar crypto exchange hack. OFAC also added 20 bitcoin addresses to its sanctions list, all of which are related to Tian and Li.","\"The U.S. welcomes responsible innovation, including new technologies that may improve the efficiency of the financial system,\" said Treasury Secretary Steven Mnuchin. \"We must ensure that we balance innovation with the need to protect our national security and maintain the integrity of our financial system.\"","Mnuchin has been vocal about rooting out bad actors from the crypto space. He once <a href=\"https:\/\/www.theblockcrypto.com\/post\/31628\/video-and-transcript-of-u-s-treasury-secretarys-press-briefing-on-cryptocurrencies\" data-v-f87c67ca=\"\">described<\/a> the issue as a \"national security issue.\" Mnuchin also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/32494\/us-treasury-to-ensure-cryptos-dont-become-swiss-numbered-bank-accounts-says-mnuchin\" data-v-f87c67ca=\"\">said<\/a> at the time that \"very, very strong\" regulations are needed to ensure crypto doesn't become like anonymous Swiss bank accounts, \"which were obviously a risk to the financial system.\"","Last month, President Donald Trump's 2021 budget also <a href=\"https:\/\/www.theblockcrypto.com\/post\/55461\/us-treasury-could-have-more-oversight-over-crypto-if-trumps-budget-proposal-goes-through\" data-v-f87c67ca=\"\">proposed<\/a> moving the U.S. Secret Service back to the Treasury to help fight crypto-related crimes. If the proposal goes through, Treasury could have more supervisory powers over the crypto space.","In separate news, the Internal Revenue Service is also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/56312\/the-irs-is-hosting-a-tax-summit-for-crypto-firms-in-march\" data-v-f87c67ca=\"\">holding a summit<\/a> today at its Washington, D.C. headquarters, to discuss tax-related issues around cryptocurrencies. The summit will feature four 90 minute panels touching on technology updates, taxation issues facing crypto exchanges, tax return preparations, and regulatory compliance."],"hashtag":[]}