{"summary":"The Internal Revenue Service&#x27;s latest Congressional Budget Justification &amp; Annual Performance Report and Plan outlines specific ways through which the U.S. tax regulator will enhance its crypto enforcement efforts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107590\/irs-seeks-millions-in-fresh-funding-to-expand-crypto-tax-enforcement-and-hire-outside-experts","publishDate":"2021-06-08T13:06:12","id":13958,"type":null,"title":"IRS seeks millions in fresh funding to expand crypto tax enforcement and hire outside experts","category":["REGULATION"],"content":["The Internal Revenue Service's latest Congressional Budget Justification &amp; Annual Performance Report and Plan outlines specific ways through which the U.S. tax regulator will enhance its crypto enforcement efforts.","As outlined in the <a href=\"https:\/\/home.treasury.gov\/system\/files\/266\/02.-IRS-FY-2022-CJ.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">IRS budgeting report for the fiscal year 2022<\/a>, the IRS will employ an array of specialized contractors to boost its internal efforts. In practice, the increased funding will be used to award more contracts to firms that can assist the tax regulator in its enforcement of crypto-based tax evasion.","In total, the IRS is seeking $13.2 billion for the 2022 fiscal year, an increase of $1.2 billion compared to the 2021 fiscal year. On the enforcement side, the IRS is asking for $5.46 billion — a year-over-year increase of $458 million.&nbsp;","Within that figure, the IRS wants an additional $32 million to boost its crypto and cyber operations, including funds to hire personnel and build out a full internal dashboard for cryptocurrency and blockchain analytics. The project is already underway, per the report.","“In IRS-CI’s Western CCU, a specialized contractor assists in the development efforts to build an internal, CI-owned dashboard, called STRIKES, for cryptocurrency\/blockchain analytics,” said the report. “This tool harnesses the power of existing vendor products to combine them and take advantage of the strengths each provides.”","Of the $32 million in boosted funding for crypto\/cyber operations, $23 million would be spent on “contractor services.”","In a broader sense, the report indicates that the agency wants to establish a “One-IRS” approach to crypto noncompliance, which would include contractors generating leads on illegal crypto activity.","“Partnering with other IRS business units, this contract would bring on investigators to provide illicit activity pattern identification and monitoring,” said the report.","The agency goes on to note:","“Paired with extensive intelligence gathering, these contractors would supply proactive lead generation around tax compliance and illegal activities involving cryptocurrency. Additionally, these contractors would be strategically positioned within the ACDC facility to leverage training and subject matter expertise. The plan would be to expand the scope of work and reassess the return on investment each year to determine continuation.”","The document's contents are significantly more detailed than those contained in the so-called <a href=\"https:\/\/home.treasury.gov\/system\/files\/131\/General-Explanations-FY2022.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Green Book<\/a>, published in late May by the Biden administration as part of the federal budget process.","In that document, U.S. officials outlined proposed changes to crypto-related data reporting for industry businesses, including exchanges and custodians.","The Biden administration has positioned its crypto tax efforts in the broader context of the so-called<a href=\"https:\/\/www.theblockcrypto.com\/linked\/105543\/irs-biden-crypto-transactions-report-10000-tax-gap\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"> tax gap<\/a>, or the difference between the total estimated obligations among U.S. taxpayers and the actual amount collected each year.","\"Through IRS enforcement efforts and strategies for meeting the needs of taxpayers, the IRS intends to decrease the tax gap,\" the justification report notes.","In April, Commissioner Charles Rettig <a href=\"https:\/\/www.theblockcrypto.com\/linked\/101484\/irs-commissioner-crypto-reporting-congress-tax-gap\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">told Congress<\/a> that reporting requirements for cryptocurrency could be a significant help in closing the tax gap.","Senator Rob Portman of Ohio indicated that legislation focused on this area is also in the works, though to date any prospective bill has yet to be made public.","\"We're working on a cryptocurrency bill that would define cryptocurrency for tax purposes and try to provide appropriate reporting rules,\" Portman said at the time.","With or without Congress, the IRS plans to establish some unified framework at least as it relates to broker reporting.","The budget justification indicates that information reporting for crypto exchanges is incoming. After a discourse on the importance of 1099-K broker reporting for financial institution accounts, the report says “similar reporting requirements would apply to crypto asset exchanges and custodians.”","The IRS also confirmed to The Block that “proposed regulations regarding information reporting on virtual currency under §6045 are on this year’s priority guidance plan.”","Rule 6045 describes requirements related to broker reporting. Many traditional firms utilize form 1099-K, and some crypto exchanges have filed the form in the past. However, because it does not track cost-basis, many argue it’s not the best choice for crypto since it’s led to <a href=\"https:\/\/www.theblockcrypto.com\/linked\/85510\/the-irs-is-mistakenly-sending-warning-notices-to-coinbase-users\" data-v-f87c67ca=\"\">confusion before<\/a> — including when the IRS mistakenly sent out warning notices to Coinbase users.","Instead,<a href=\"https:\/\/www.theblockcrypto.com\/daily\/99743\/why-the-form-1099b-is-emerging-as-a-gold-standard-for-crypto-tax-reporting\" data-v-f87c67ca=\"\"> Form 1099-B <\/a>has emerged as the gold standard, since it does track cost basis, and some exchanges have already begun to file the forms ahead of possible guidance.","Industry sources have told The Block that, based on current regulatory chatter, Form 1099-B has emerged as the likeliest contender for a final standard.&nbsp;","Transfers of crypto trigger taxable events, and establishing the cost of initial purchase to calculate gains and loss is key to 1099-B reporting. However, it may take firms some time to get on the same page, since establishing a cost basis across platforms can be challenging since crypto that arrives on a platform may not have been originally purchased there. But the IRS has already indicated ahead of any guidance that it expects the crypto space to find a solution:","“Separately, reporting requirements would apply in cases in which taxpayers buy crypto assets from one broker and then transfer the crypto assets to another broker, and businesses that receive crypto assets in transactions with a fair market value of more than $10,000 would have to report such transactions.”","Any guidance requiring this reporting would be effective for tax years beginning after December 31, 2022. The IRS has declined to comment on the timing of any coming guidance, but any new requirements will be subject to a comment period before final approval.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$5.46 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Rob Portman","content":"PERSON"},{"type":"Portman","content":"PERSON"},{"type":"$23 million","content":"MONEY"},{"type":"December 31, 2022","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$458 million","content":"MONEY"},{"type":"Charles Rettig","content":"PERSON"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$13.2 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"Through IRS","content":"ORGANIZATION"},{"type":"Green Book","content":"ORGANIZATION"},{"type":"1099","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"6045","content":"DATE"},{"type":"$32 million","content":"MONEY"},{"type":"fiscal year 2022","content":"DATE"},{"type":"Biden","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["IRS"],"authors":["Michael McSweeney","Aislinn Keely","The Block"]}