{"summary":"The world&#x27;s largest gaming company, Tencent saw a 3% increase in its international gaming revenue to $1.65 billion this quarter as domestic Chinese revenues dropped 7% following two years of tech industry crackdowns.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187562\/tencent-international-gaming-revenue-increases-while-domestic-earnings-fall","publishDate":"2022-11-16T10:14:35","id":13959,"type":null,"title":"Tencent international gaming revenue increases while domestic earnings fall","category":["GAMING"],"content":["Tencent, the world's largest gaming company, saw a 3% increase in its international gaming revenue to $1.65 billion in the third quarter as domestic Chinese revenue dropped 7% following two years of tech industry crackdowns.","Regulations introduced last year limiting minors’ access to games have hit demand within the country. Time spent playing games by minors decreased 92% year-on-year and they accounted for just 0.7% of time spent playing overall in July, Tencent reported, according to the company's <a href=\"https:\/\/static.www.tencent.com\/uploads\/2022\/11\/16\/33aad36dea97848eb75aa988d785e9f8.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">third quarter earnings report<\/a>.","The number of adult Daily Active Users (DAUs) increased by a double-digit year-on-year growth rate, while total time spent Tencent's PC and mobile games increased by a single-digit percentage year-on-year.","Chinese companies across the board have been hit hard as the local economy struggles under the weight of ongoing Covid-19 restrictions. Entry and exit from the country remains restricted, while ongoing lockdowns in major cities have led to rare protests from fed-up citizens.","As its ability to produce games for a domestic market weakens — only one game has been approved by censors since they started handing out licenses again in April — Tencent is focusing on investing in gaming firms abroad.","Two months ago, it doubled its stake in French video game company Ubisoft. It’s also developing a new mobile game with Japanese studio Capcom Co for the latter’s Monster Hunter franchise.","Across the entire business, the Chinese tech giant posted a drop in revenue for the second quarter in a row, falling 2% to just below $20 billion from a year earlier.","Tencent will also distribute the large majority of its stake in food delivery company Meituan to shareholders as it once again scales back its exposure to China’s beleaguered tech industry, despite having previously denied it would do so.","The Class B stock, worth over $20 billion, will be distributed in a similar manner to the $16.4 billion stake in commerce platform JD.com which Tencent gave to shareholders last year.","Prior to the previous quarter, Tencent had reported double-digit growth for almost every quarter since going public in 2004.","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"2004","content":"DATE"},{"type":"92%","content":"PERCENT"},{"type":"Capcom Co","content":"ORGANIZATION"},{"type":"3%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"0.7%","content":"PERCENT"},{"type":"$1.65 billion","content":"MONEY"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$16.4 billion","content":"MONEY"},{"type":"Ubisoft","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"April","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["EARNINGS"],"authors":["Callan Quinn","The Block"]}