{"summary":"Curve Finance has requested a 1 million Optimism (OP) token grant to reward liquidity providers on Curve’s Optimism pools.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/159477\/curve-finance-applies-for-1-million-op-token-grant-from-optimism","publishDate":"2022-07-25T12:19:59","id":13964,"type":null,"title":"Curve Finance applies for 1 million OP token grant from Optimism","category":["DEFI"],"content":["Curve Finance has submitted a governance proposal on Optimism for a 1 million OP token grant, according to a <a href=\"https:\/\/gov.optimism.io\/t\/draft-gf-phase-1-proposal-curve\/3089\" data-v-f87c67ca=\"\">post<\/a> on the Optimism forum submitted on July 24.","Curve is the largest liquidity pool for token swaps while Optimism is an Ethereum Layer 2 protocol. Curve’s total value locked on Optimism currently stands at <a href=\"https:\/\/defillama.com\/protocol\/curve\" data-v-f87c67ca=\"\">$17.4 million<\/a> with an average of <a href=\"https:\/\/dune.com\/hildobby\/optimism-dexs\" data-v-f87c67ca=\"\">$3.4 million<\/a> in weekly trading volume occurring on Curve pools in Optimism.","According to the grant proposal, the 1 million OP tokens currently worth $850,000 will be distributed over 20 weeks on Curve. This means 50,000 <a href=\"https:\/\/www.theblock.co\/linked\/149464\/optimisms-governance-token-officially-goes-live\" data-v-f87c67ca=\"\">OP tokens<\/a> will be distributed per week to Curve pools, if it passes.","These tokens will serve as incentives to liquidity providers (LPs) on gauged Curve pools on Optimism. Gauged pools on Curve receive token emissions on a weekly basis. These pools are decided by a weekly on-chain DAO vote on Curve.","There are currently three gauged Curve pools on Optimism: sUSD, sETH, and sBTC. These three pools will be the recipient of the weekly 50,000 OP tokens emissions but the number is expected to increase over time, per the announcement.","According to the proposal, the grant will help to incentivize liquidity on Optimism via Curve-based emissions. These rewards could help to attract more LPs to seed their liquidity to Optimism pools thus expanding the Layer 2 network’s decentralized finance footprint.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$850,000","content":"MONEY"},{"type":"Curve Finance","content":"ORGANIZATION"},{"type":"$3.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"July 24","content":"DATE"},{"type":"$17.4 million","content":"MONEY"}],"hashtag":["OPTIMISM"],"authors":["Osato Avan-Nomayo","The Block"]}