{"summary":"Binance, the centralized cryptocurrency exchange, will make major upgrades to its wallet infrastructure.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238046\/binance-to-retire-certain-deposit-addresses-in-upcoming-wallet-upgrade","publishDate":"2023-07-06T05:19:04","id":13968,"type":null,"title":"Binance to retire certain deposit addresses in upcoming wallet upgrade","category":["COMPANIES"],"content":["Centralized exchange giant Binance announced today that it is rolling out a comprehensive upgrade of its wallet infrastructure. The upgrade, aimed at offering \"better efficiency and fund security,\" will lead to the retirement of selected deposit addresses and memos.","That means Binance users will have to set up new wallet addresses in the coming months.&nbsp;","The transition process will be carried out in phases across various cryptocurrency networks including Bitcoin (BTC), Ripple (XRP), Solana (SOL), Litecoin (LTC), Polkadot (DOT), Avalanche (AVAX), Cardano (ADA) and many others, according to the <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/existing-deposit-addresses-to-be-retired-in-q3-july-september-2023-ffbe37cbd85f46db8fe3021ee3f85eb3\" data-v-f87c67ca=\"\">announcement<\/a>. Users who transact in the listed cryptocurrencies will be individually notified via email. After that, they will have to generate new addresses and memos (if applicable).","<a href=\"https:\/\/www.theblock.co\/post\/237907\/binance-cz-crypto-trading-volumes\" data-v-f87c67ca=\"\">Binance<\/a> has scheduled the migration for the third quarter of 2023. Nevertheless, users are advised to continue using their current deposit addresses until they receive an official notification from Binance indicating that it's time to switch to a new address and memo.","Binance reassured its users that funds deposited into expired addresses will not be lost. Instead, these deposits can be manually credited by users through the “transaction history” page on Binance.&nbsp;The new system will result in deposits made into expired addresses not being automatically credited as before. Users can obtain new deposit addresses and memos by logging into their accounts via the official Binance app or website, the exchange added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"third quarter of 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"AVAX","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Vishal Chawla","The Block"]}