{"summary":"Business-to-business adoption may be the key focus area for China&#x27;s digital yuan as the hype around it fades away, experts say.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240199\/as-digital-yuan-hype-fades-china-must-find-fresh-institutional-use-cases","publishDate":"2023-07-19T02:05:54","id":13967,"type":null,"title":"As digital yuan hype fades, China must find fresh institutional use cases","category":["CENTRAL BANKS"],"content":["Earlier last year, China’s e-CNY was all the rage, with central banks, <a href=\"https:\/\/www.atlanticcouncil.org\/blogs\/econographics\/a-report-card-on-chinas-central-bank-digital-currency-the-e-cny\/#:~:text=The%20e%2DCNY%20was%20the,competition%20in%20China's%20payments%20market.\" data-v-f87c67ca=\"\">think tanks<\/a>, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-02-15\/china-is-showing-off-its-central-bank-digital-yuan-currency-at-beijing-olympics\" data-v-f87c67ca=\"\">journalists<\/a> and <a href=\"https:\/\/www.banking.senate.gov\/newsroom\/minority\/with-digital-yuan-rollout-at-olympic-games-toomey-calls-on-federal-agencies-to-closely-watch-for-national-security-implications\" data-v-f87c67ca=\"\">politicians<\/a> around the world closely watching the implications of the digital yuan pilots.","The People’s Bank of China (PBOC), the central bank, had been fervently testing the e-CNY and <a href=\"https:\/\/www.theblock.co\/linked\/129081\/chinas-digital-yuan-wallet-goes-live-on-app-stores-in-pilot-mode\" data-v-f87c67ca=\"\">rolled out a pilot app<\/a> in January 2022. Discussions and news surrounding what’s considered the world’s most advanced CBDC reached a peak when the country <a href=\"https:\/\/www.atlanticcouncil.org\/blogs\/econographics\/a-report-card-on-chinas-central-bank-digital-currency-the-e-cny\/\" data-v-f87c67ca=\"\">flexed its digital currency muscle<\/a> at the Beijing Winter Olympics the following month. By the end of the year, <a href=\"https:\/\/www.chinadaily.com.cn\/a\/202301\/25\/WS63d09c24a31057c47ebab331.html\" data-v-f87c67ca=\"\">data<\/a> from the PBOC showed the value of the CBDC in circulation reached 13.61 billion yuan ($2 billion).","And yet the hype around it has largely vanished.","Richard Turrin, a Shanghai-based fintech consultant, said there’s less news about e-CNY compared to two years ago because the PBOC is now doing the “hard or dirty work,” which is “fundamentally less newsworthy” than the launch of pilots.","“It takes a lot more to build this ubiquitous national digital currency than it does to launch a cryptocurrency, which you turn on overnight, because you have to make sure it works first time and every time for every user,” Turrin added.","Youwei Yang, chief economist of Bit Mining, agreed that the e-CNY hype has faded “compared to the initial launch of the pilot program as it faces some challenges.”","Key among those challenges in testing the e-CNY include <a href=\"https:\/\/www.internationalaffairs.org.au\/australianoutlook\/the-e-cny-implications-for-the-future-of-digital-china\/\" data-v-f87c67ca=\"\">privacy concerns<\/a>, user habit and interoperability with existing payment systems such as Ant Group’s Alipay and Tencent’s WeChat Pay, Yang added. “Addressing these challenges is crucial for expanding the use cases, building trust and driving wider adoption of e-CNY in the future.”","Since the inception of the <a href=\"http:\/\/www.xinhuanet.com\/english\/2021-07\/17\/c_1310065964.htm\" data-v-f87c67ca=\"\">digital yuan pilots<\/a> in late 2019, the PBOC has expanded its digital yuan trial to at least 26 locations in 17 provincial-level cities and regions, including Beijing, Shanghai, Shenzhen and Suzhou, state media Xinhua <a href=\"http:\/\/www.news.cn\/fortune\/2023-04\/08\/c_1129503697.htm\" data-v-f87c67ca=\"\">reported<\/a> in April.","While the hype surrounding the e-CNY may have died down, Matteo Giovannini, a senior finance manager at Industrial and Commercial Bank of China (ICBC), China’s <a href=\"https:\/\/www.forbes.com\/sites\/sergeiklebnikov\/2022\/05\/12\/the-worlds-largest-banks-2022-banks-face-challenging-economic-environment-but-could-benefit-from-fed-rate-hikes\/?sh=443b9b517e67\" data-v-f87c67ca=\"\">largest state-owned commercial bank<\/a> by assets, said that momentum has “not completely vanished,” adding that “probably right now it is not on top of mind of the central bank.”","“Despite persistent low adoption rates, the e-CNY is by far the world’s largest CBDC pilot in terms of the amount of currency in circulation and number of users,” Giovannini said.","Business-to-business promotion may be the key focus area for the PBOC moving forward, said Stanley Chao, managing director of U.S.-based business strategy firm All In Consulting.&nbsp;","“The PBOC tried to push and market the e-CNY from a retail perspective asking consumers to buy from stores using e-CNY,” Chao, who often works with Chinese businesses, said. “That has somewhat backfired, and I think we'll see the PBOC now marketing the e-CNY from the business-to-business perspective as well as pushing banks to possibly <a href=\"https:\/\/www.abc.net.au\/news\/2023-05-14\/why-china-digital-currency-e-cny-concerning-yuan-rmb\/102328578\" data-v-f87c67ca=\"\">pay salaries<\/a> via the e-CNY, thereby compelling more retail to accept the digital currency.”","Earlier this month, DBS Bank <a href=\"https:\/\/www.dbs.com\/newsroom\/DBS_launches_e_CNY_merchant_collection_solution_for_mainland_businesses_to_receive_CBDC_payments_completes_first_client_transaction\" data-v-f87c67ca=\"\">launched an e-CNY initiative<\/a> that allows corporate clients to receive payments in digital yuan, claiming it is one of the first foreign banks to do so on the Chinese mainland.","“It's a large milestone for the e-CNY that a large, well-known, highly capitalized bank such as DBS decides to use the e-currency,” Chao added. “[The fact] that the bank is based in a democratic country trying to stay neutral in the U.S.-China cold war shows that the e-CNY truly has added value to banking customers.”","Donald Day, chief operating officer of Hong Kong-based crypto platform VDX, told The Block in an email exchange that, given the PBOC has ambitions for the e-CNY circulation to increase significantly during 2023, “wholesale settlement channels such as those offered by DBS are likely expected to be an important driver of issuance volume of the e-CNY.”","Day added that integration with a major institution could be positive for wider adoption, but it remains to be seen “whether offshore entities will favor e-CNY for widespread settlement.”","BNP Paribas SA has also partnered with Bank of China to <a href=\"https:\/\/www.scmp.com\/tech\/article\/3219516\/china-digital-currency-bnp-paribas-promote-digital-yuan-usage-china?module=live&amp;pgtype=homepage\" data-v-f87c67ca=\"\">promote the e-CNY<\/a> to its corporate clients, but the move has been questioned by politicians in the U.S., <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2023-06-30\/bnp-paribas-work-with-china-on-digital-yuan-fuels-questions-in-washington\" data-v-f87c67ca=\"\">Bloomberg reported<\/a> last month. The French lender received a phone call from a Republican congressional aide asking about its work, the report said, citing people familiar with the matter.","“The problem is that nowadays it is tricky for Western financial institutions to engage in partnerships with Beijing promoting the Chinese yuan at a time when efforts towards de-dollarization are growing in several countries,” Giovannini of ICBC said, adding that Western banks need to navigate a “very challenging market environment” where geopolitics prevails on commercial considerations.","Both Alipay and WeChat Pay are <a href=\"https:\/\/www.brookings.edu\/wp-content\/uploads\/2020\/04\/FP_20200427_china_digital_payments_klein.pdf\" data-v-f87c67ca=\"\">ubiquitous mobile payment methods<\/a> in China and, to some extent, have <a href=\"https:\/\/forkast.news\/headlines\/wechat-integrates-digital-yuan-into-payment\/\" data-v-f87c67ca=\"\">integrated the e-CNY<\/a> into their payment services.","“While the e-CNY app has already seen billions worth of the currency transacted throughout China, the biggest challenge is increasing daily usage as most retail users continue to pay via their bank accounts through WeChat Pay and Alipay, skipping the need to put the e-CNY to use,” said Nick Ruck, chief operating officer of Asia-based ContentFi Labs.","One path to challenging the dominance of these platforms is to expand the ways e-CNY can be used.&nbsp;","The southeastern Chinese city of Shenzhen officially started to test prepaid consumption using the e-CNY in June, according to <a href=\"http:\/\/www.szlhq.gov.cn\/english\/news\/content\/post_10691053.html\" data-v-f87c67ca=\"\">local media reports<\/a>. That came after Shenzhen had over 200 firms in industries including education, training and beauty sign up for its e-CNY prepaid platforms in May, state media <a href=\"https:\/\/global.chinadaily.com.cn\/a\/202205\/07\/WS6275c516a310fd2b29e5b277.html\" data-v-f87c67ca=\"\">China Daily reported<\/a>.&nbsp;","Bank of China, one of China's largest state-owned banks, also said this month that it is <a href=\"https:\/\/www.theblock.co\/post\/239063\/bank-of-china-tests-sim-card-nfc-payments-for-digital-yuan\" data-v-f87c67ca=\"\">testing<\/a> a new offline payment method linked to SIM cards for digital yuan. Over the past year, local governments have also been giving away e-CNY vouchers in pilot regions to boost the use of digital money.","But the currency is still limited, with drawbacks including the lack of deposit insurance and interest, according to Day of VDX.","“The e-CNY faces significant headwinds from existing large payment channels embedded in other apps, since there are no tangible benefits to users above the payment channels already offered, and therefore no reason to convert RMB to e-CNY for payment or settlement purposes,” Day said.&nbsp;","“This means that expanding the use cases to scenarios that incentivize users to spend e-CNY, and merchants to accept e-CNY is likely the only way to bootstrap retail users into the e-CNY ecosystem,” he added.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"13.61 billion yuan","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Chao","content":"PERSON"},{"type":"January 2022","content":"DATE"},{"type":"Youwei Yang","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Shenzhen","content":"LOCATION"},{"type":"PBOC","content":"ORGANIZATION"},{"type":"Suzhou","content":"LOCATION"},{"type":"BNP Paribas SA","content":"ORGANIZATION"},{"type":"Giovannini","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"” Giovannini","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Nick Ruck","content":"PERSON"},{"type":"DBS","content":"ORGANIZATION"},{"type":"Western","content":"ORGANIZATION"},{"type":"People’s Bank of China (PBOC","content":"ORGANIZATION"},{"type":"Industrial and Commercial Bank of China (ICBC","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Shanghai","content":"LOCATION"},{"type":"Donald Day","content":"PERSON"},{"type":"$2 billion","content":"MONEY"},{"type":"Beijing","content":"LOCATION"},{"type":"Day of VDX","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Yang","content":"PERSON"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"” Chao","content":"PERSON"},{"type":"Bank of China","content":"ORGANIZATION"},{"type":"Stanley Chao","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"ICBC","content":"ORGANIZATION"},{"type":"Matteo Giovannini","content":"PERSON"},{"type":"DBS Bank","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Bit Mining","content":"ORGANIZATION"},{"type":"Xinhua","content":"ORGANIZATION"},{"type":"Richard Turrin","content":"PERSON"},{"type":"SIM","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Timmy Shen","The Block"]}