{"summary":"Other banks will try to compete for crypto business now that Silvergate and Signature Bank have collapsed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/219439\/former-ftx-exec-brett-harrison-thinks-banks-will-compete-for-crypto-business","publishDate":"2023-03-14T15:27:15","id":13972,"type":null,"title":"Former FTX exec Brett Harrison thinks banks will compete for crypto business","category":["FINANCE FIRMS"],"content":["New banks will compete for business from crypto companies following the demise of Silvergate and Signature bank, former FTX.US president Brett Harrison said.","\"Previously those banks couldn't really compete with the top two or three — Silvergate and Signature being among them — because they had such a large percentage of the market share,\" Harrison said on an episode of The Scoop podcast coming out on Wednesday.","Crypto companies have been left scrambling to find new banking partners after those two firms stopped serving the industry. Some are turning to institutions like Mercury, Brex and Customers Bank, and others looking at non-U.S. based players like Sygnum and Seba Bank, <a href=\"https:\/\/www.theblock.co\/post\/219280\/crypto-startups-seek-refuge-silvergate-svb-signature\" data-v-f87c67ca=\"\">The Block reported<\/a>.","Harrison also believes that the recent developments will further help the push into derivatives.","\"It's already been the case for a long time that the primary source of volume in crypto is in the derivatives, not in the underlying spot,\" Harrison said.","While building out his new venture, Architect, which closed a <a href=\"https:\/\/www.theblock.co\/post\/204140\/brett-harrison-raises-5-million-for-defi-platform-aimed-at-institutions-bloomberg\" data-v-f87c67ca=\"\">$5 million funding round<\/a> in January and expects to get its first product out in a month, Harrison said finding a bank hasn't been hard because he had an existing relationship with a \"systemically important bank.\"","\"Lots of people were seriously affected over the weekend. I mean, many people had near-heart attacks wondering if they were going to make payroll this week,\" he said.","Harrison pointed out how crypto futures on CME <a href=\"https:\/\/www.theblock.co\/post\/207249\/cmes-crypto-derivatives-reach-new-highs-as-traders-seek-safe-port-in-storm\" data-v-f87c67ca=\"\">reached new highs in January,<\/a>&nbsp;and that's primarily \"a result of people losing faith in spot exchanges,\" he said.","Going forward, he sees the potential development of new exchanges that would lessen the requirement for instantaneous bank rails by having delayed settlements similar to what happens in the equities world.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Seba Bank","content":"ORGANIZATION"},{"type":"Harrison","content":"PERSON"},{"type":"Sygnum","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Brett Harrison","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"CME","content":"ORGANIZATION"},{"type":"Customers Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}