{"summary":"After days of consolidating its ether (ETH) holdings, the FTX drainer is now swapping ETH for bitcoin with $72 million moved thus far.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188710\/ftx-drainer-swaps-another-20000-ether-for-bitcoin","publishDate":"2022-11-21T06:11:15","id":13971,"type":null,"title":"&#x27;FTX drainer&#x27; swaps another 20,000 ether for bitcoin","category":["BRIDGES"],"content":["The individual or entity behind suspicious withdrawals from embattled crypto exchange FTX — commonly called the \"FTX Drainer\" — has continued to swap ether for bitcoin. It has now moved $72 million worth of value across both blockchains via the Ren BTC Gateway, a crypto bridge used to move transfer tokens from one network to another.","The main FTX drainer wallet held 250,000 ether ($302 million at the time) on Saturday after <a href=\"https:\/\/www.theblock.co\/post\/188565\/ftx-drainer-consolidates-ether-holdings-to-reach-302-million\" data-v-f87c67ca=\"\">consolidating<\/a> ether holdings from other wallets. Following this consolidation of funds, the alleged hacker began <a href=\"https:\/\/www.theblock.co\/post\/188624\/ether-under-pressure-as-ftx-accounts-drainer-cashes-out-for-bitcoin\" data-v-f87c67ca=\"\">swapping<\/a> ether for bitcoin. This process usually involved sending a batch of ether to a new wallet before swapping for bitcoin, which was done by trading ether for renBTC, a tokenized version of bitcoin issued by Ren. After the swap, the hacker bridges the renBTC to the Bitcoin blockchain using Ren’s crypto bridge service.","The individual or entity in question swapped 20,000 ETH ($22.4 million) for 1,023 renBTC ($16.3 million) on Monday. This follows the 50,000 ETH exchanged for 3,517 renBTC on Sunday. Blockchain security outfit PeckShield has been <a href=\"https:\/\/twitter.com\/PeckShieldAlert\/status\/1594312651688984577\" data-v-f87c67ca=\"\">monitoring<\/a> these transactions and on-chain data shows the hacker has bridged all 4,540 renBTC ($72.6 million) to Bitcoin, as of the time of publishing.&nbsp;PeckShield also tracked a Bitcoin wallet holding some of the bridged funds — this <a href=\"https:\/\/explorer.btc.com\/btc\/address\/bc1qaq09p8qy97pf9rhnwtxvj7htqhmyejvv6n0702\" data-v-f87c67ca=\"\">wallet<\/a> currently holds 2,444 BTC ($39.4 million).","These fund movements have caused the FTX drainer to drop slightly down the list of addresses holding the most ether. On Saturday, the hacker was the 27th-largest ether holder but now has fallen to the 36th position.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"$72 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$39.4 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$302 million","content":"MONEY"},{"type":"Ren","content":"ORGANIZATION"},{"type":"$72.6 million","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"$22.4 million","content":"MONEY"},{"type":"Ren BTC","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$16.3 million","content":"MONEY"},{"type":"Saturday","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BANKRUPTCY FILINGS","CROSS-CHAIN SWAPS","FTX","HACKS"],"authors":["Osato Avan-Nomayo","The Block"]}