{"summary":"French crypto prime broker has received approval from Luxembourg’s financial regulator to offer banking services. \nThis grants the Atomic0-backed company the ability to issue dedicated business international bank account numbers (IBANs) to load fiat currency and crypto for payments, operations and trading. ","author":["Tom Matsuda","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/184412\/european-crypto-broker-aplo-approved-to-offer-banking-solutions-exclusive","publishDate":"2022-11-09T04:00:27","id":1397,"type":null,"title":"European crypto broker Aplo approved to offer banking solutions: Exclusive","category":["Regulation"],"content":["Aplo, a crypto brokerage firm based in France, has received approval in Luxembourg to offer banking solutions across the European Union.&nbsp;","The <a href=\"https:\/\/www.theblock.co\/linked\/120245\/crypto-prime-broker-sheeldmarket-france-series-a-funding\" data-v-f87c67ca=\"\">Atomico-backed<\/a> company currently offers hedge funds, venture capital firms and banks services such as trading, custody and sub-ledger services with a license from the French regulator. But through its new license, granted by the Commission de Surveillance du Secteur Financier, Luxembourg's regulator, Aplo said it is able to offer banking services and passport its regulatory status across the European bloc.&nbsp;","With partner neobank Olkypay providing the underlying banking infrastructure, the Agent Payment Service Provider license grants Aplo the ability to issue dedicated business international bank account numbers (IBANs) to load fiat currency and crypto for payments, operations and trading, it said in a press release.&nbsp;","\"If you're a VC fund or even a hedge fund, you just want somewhere safe to put your collateral, you want to be able to know that if you send euros to us we're not going to put our hand in and start taking the money,\" said Aplo CEO Oliver Yates in an interview with The Block. \"So having that extra guarantee that it's in a bank account under your name — that's helpful.\"&nbsp;","Previously, The Block reported that European venture firms in certain jurisdictions such as France are <a href=\"https:\/\/www.theblock.co\/post\/176920\/european-vc-launching-crypto-funds\" data-v-f87c67ca=\"\">held<\/a> back from launching crypto funds by custody issues.&nbsp;","Aplo claims to be the first crypto broker to offer such services within the European Union. Neither Olkypay nor Aplo hold full banking licenses, merely licenses that allow them to offer banking solutions.","Other crypto companies in Europe have aimed to procure full banking licenses. For instance, last year BCB Group made moves to <a href=\"https:\/\/www.theblock.co\/post\/127429\/bcb-group-swoops-for-germanys-sutor-bank\" data-v-f87c67ca=\"\">acquire<\/a> Germany's Sutor Bank to enable the payment provider to offer banking capabilities, but the deal has still yet to close.&nbsp;"],"hashtag":[]}