{"summary":"UMA, a smart contracts platform, is bringing the S&amp;amp;P 500 to the blockchain with the launch of a new ERC20 token that&#x27;ll represent ownership in the","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/17335\/a-crypto-venture-is-launching-a-tokenized-version-of-the-stock-market","publishDate":"2019-03-27T10:51:37","id":13980,"type":null,"title":"A crypto venture is launching a tokenized version of the stock market","category":["MARKETS"],"content":["UMA, a smart contracts platform, is bringing the S&amp;P 500 to the blockchain with the launch of a new ERC20 token that'll represent ownership in the largest 500 companies in U.S. financial markets, the company announced Wednesday.&nbsp;","UMA, an entity affiliated with Risk Labs, a Two Sigma Ventures-backed firm, also said the new token would trade on Beijing-based decentralized exchange DDEX, to start. MakerDao, the firm behind stable coin DAI, is also involved in the new token, per the release. Investors looking to buy the token are required to purchase it with DAI.&nbsp;","To start, however, the token will not trade in the U.S. due to regulatory constraints. Similar projects in the crypto world that have attempted to offer synthetic exposure to financial markets have been blocked by the Securities and Exchange Commission, including a product by Abra that offered a way for its clients to get exposure to stocks with bitcoin. Many market participants noted Abra's offering was akin to an equity derivative at the time of its news.&nbsp;","\"While traditional derivatives are the closest analog to what we have created, the blockchain technology actually does enable a few different modifications that make the market more transparent,\" Allison Lu, a co-founder of UMA told The Block in an interview.","\"Our design is trust-less meaning there is no counter party risk, here,\" she added. \"The reason why there is no counter party risk is because a smart contract is holding onto all of the collateral backing this trade and the smart contract is over collateralized at all times.\"","Here's how the token works, per Lu:","\"So let's say you buy a token and it is tracking the index. And let's say the index is at $100. The smart contract is actually holding on to more than $100 at all times. So let's say that the index goes up to $110, then liquidity providers are required to put in another $10 and they have an incentive to do this because they lose an initial deposit that gets paid to initial token holders if they fail in this obligation.\"","Those liquidity providers include Alameda, according to a person familiar with the situation. The token will have a set expiration date at which point an investor can redeem their tokens for DAI.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"Sigma Ventures","content":"ORGANIZATION"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"DAI","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"UMA","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Allison Lu","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$110","content":"MONEY"},{"type":"$100","content":"MONEY"}],"hashtag":["DAI","TOKENIZATION"],"authors":["Frank Chaparro","The Block"]}