{"summary":"The collection of non-fungible tokens features pins that celebrate posters, mascots and more from the Games’ 125 years of history.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/107175\/animoca-brands-subsidiary-to-launch-collection-of-olympics-themed-nfts","publishDate":"2021-06-04T06:19:05","id":13983,"type":null,"title":"Animoca Brands subsidiary to launch collection of Olympics-themed NFTs","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">The International Olympic Committee (IOC) is partnering with popular blockchain gaming company <a href=\"https:\/\/www.theblockresearch.com\/animoca-brands-the-lesser-known-firm-in-the-blockchain-gaming-nft-space-79822\" data-v-f87c67ca=\"\">Animoca Brands<\/a> to launch a collection of Olympic-themed non-fungible tokens (NFTs).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">nWay, a subsidiary of Animoca Brands, developed the collection, which consists of digital versions of past Olympic pins — physical badges that are worn on lapels — as well as cross-play multiplayer video games. For many, the original Olympic pins are meant to be badges of honor which represent different aspects of the games.<\/span>","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/www.theblockresearch.com\/nft-ecosystem-map-research-78736\" data-v-f87c67ca=\"\">Non-fungible tokens<\/a> are collectibles stored on the blockchain which can represent items like photos, videos, audio and other digital files. The NFT collection is part of a new licensing agreement the San Francisco-based game developer, publisher and tech platform has established with the International Olympic Committee.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to a statement, the Olympic Pins, which will be available for sale on June 17, have different properties and levels of scarcity. The collection of pins commemorates the art and design of past Olympic Games, including posters, pictograms, mascots and more from the Olympics’ 125-year history.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Olympic pins started as a way to identify athletes, judges and officials, but over the past 125 years it has become an Olympic Games tradition, where everyone from athletes to event staff, journalists and spectators all take part to collect and trade pins in the Olympic Village and beyond,” said Timo Lumme, managing director of the IOC Television and Marketing Services.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“They can now connect with the excitement of the Games in a whole new way and own a piece of Olympic history,” he added.<\/span>","<span data-v-f87c67ca=\"\">Collectors can purchase the pins in three main ways: by buying the pins directly from nWay’s website, by purchasing pins from other collectors on the NWayPlay marketplace, or for free by playing an Olympic-themed video game connected to nWayPlay.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"International Olympic Committee (IOC","content":"ORGANIZATION"},{"type":"Timo Lumme","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"International Olympic Committee","content":"ORGANIZATION"},{"type":"June 17","content":"DATE"},{"type":"IOC Television and Marketing Services","content":"ORGANIZATION"}],"hashtag":["ANIMOCA BRANDS"],"authors":["Saniya More","The Block"]}