{"summary":"The US Labor Department has &quot;grave concerns&quot; about the decision to offer Bitcoin in its retirement savings portfolio.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144303\/labor-department-has-grave-concerns-over-fidelitys-401k-bitcoin-plans","publishDate":"2022-04-29T06:15:54","id":1398,"type":null,"title":"Labor Department has &#x27;grave concerns&#x27; over Fidelity&#x27;s 401(k) bitcoin plans","category":["BITCOIN"],"content":["The US Labor Department will discuss concerns with Fidelity Investments over its <a href=\"https:\/\/www.theblockcrypto.com\/linked\/143498\/fidelity-to-allow-clients-to-invest-in-bitcoin-through-their-401k-accounts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">decision<\/a> to allow retirement savers to include bitcoin in their portfolios.","On Tuesday, Fidelity said it would allow clients to allocate as much as 20% of their 401(k) retirement savings to bitcoin as long as employers permitted it.","“We have grave concerns with what Fidelity has done. There is a lot of hype around ‘you have to get in now because you will be left behind otherwise,’” Ali Khawar, acting assistant secretary of the Employee Benefits Security Administration, told the <a href=\"https:\/\/www.wsj.com\/articles\/labor-department-criticizes-fidelitys-plan-to-put-bitcoin-on-401-k-menu-11651197309?mod=Searchresults_pos2&amp;page=1\" data-v-f87c67ca=\"\">Wall Street Journal<\/a>.","According to Khawar, the Labor Department, which regulates company-sponsored retirement plans, has particular concerns about the potential 20% bitcoin allocation because of market volatility. Fidelity itself has said that number may be subject to change.&nbsp;","“For the average American, the need for retirement savings in their old age is significant. We are not talking about millionaires and billionaires that have a ton of other assets to draw down,” Khawar added.","Fidelity, which manages $4.2 trillion in assets, was among the first global financial institutions to enter the crypto market when it launched a digital assets arm in October 2018. About 23,000 companies use its 401(k) services.","In response to the comments, Fidelity said that its bitcoin offering “represents the firm’s continued commitment to evolving and broadening its digital assets offerings amidst steadily growing demand for digital assets across investor segments, and we believe that this technology and digital assets will represent a large part of the financial industry’s future.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Employee Benefits Security Administration","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ali Khawar","content":"PERSON"},{"type":"October 2018","content":"DATE"},{"type":"the Labor Department","content":"ORGANIZATION"},{"type":"US Labor Department","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"$4.2 trillion","content":"MONEY"},{"type":"Fidelity Investments","content":"ORGANIZATION"},{"type":"Khawar","content":"PERSON"}],"hashtag":[],"authors":["Callan Quinn","The Block"]}