{"summary":"The Aave community is leaning towards deploying a fresh v3 on Ethereum rather than upgrading the previous version.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/174689\/aave-dao-favors-fresh-deployment-of-its-latest-version-on-ethereum","publishDate":"2022-10-04T11:19:14","id":13989,"type":null,"title":"Aave DAO favors fresh deployment of its latest version on Ethereum","category":["GOVERNANCE"],"content":["The Aave community is currently <a href=\"https:\/\/snapshot.org\/#\/aave.eth\/proposal\/0x584eb4e0f79e1d9dcdd99b3a0c831bfc3c654af3f8f619d5f68eae23cd9cb149\" data-v-f87c67ca=\"\">voting<\/a> on how the latest update to its decentralized lending protocol, called <a href=\"https:\/\/www.theblock.co\/linked\/138018\/aave-set-to-launch-third-version-of-its-defi-protocol-across-six-networks\" data-v-f87c67ca=\"\">Aave v3<\/a>, should be deployed on Ethereum.","Aave v2 on Ethereum <a href=\"https:\/\/defillama.com\/protocol\/aave-v2\" data-v-f87c67ca=\"\">controls<\/a> $3.96 billion in liquidity and is the protocol’s biggest implementation across all chains, as it accounts for over 70% of the DeFi lender’s total value locked. Deciding on how to bring about the new version in Ethereum has a direct impact on the future of Aave v2 which is currently the <a href=\"https:\/\/defillama.com\/top-protocols\" data-v-f87c67ca=\"\">largest<\/a> decentralized lender in Ethereum's DeFi ecosystem.","The community is deciding whether to issue a new version of the application (which keeps the old one in place) or to upgrade the old version. So far, 99% of the votes cast have been in favor of a fresh Aave v3 deployment on Ethereum rather than upgrading the previous version. The voting process will end on Oct. 11 at 6:00 AM EST.","Both approaches have their own advantages and possible drawbacks.","Aave contributor Bored Ghosts Developing (BGD) has been working on coordination and execution parameters for a possible upgrade of Aave v2 to Aave v3 on Ethereum. The team recently put forward a <a href=\"https:\/\/governance.aave.com\/t\/bgd-aave-v3-ethereum-new-deployment-vs-aave-v2-upgrade\/9990\" data-v-f87c67ca=\"\">summary<\/a> of the possible trade-offs between both approaches.","One of the supporting arguments for a fresh deployment is that it is the easier route to follow. Aave v3 can easily be deployed on Ethereum and the transaction cost will be cheaper than upgrading the older version's smart contracts. A fresh deployment will also not require a security audit as this has already been performed, whereas doing the upgrade would require another set of audits.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/cryptocurrency-lending\/top-5-lending-markets-for-eth-borrowed\/embed\" title=\"Top 5 Lending Markets for ETH Borrowed\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","On the flip side, a fresh deployment will fragment Aave’s liquidity on Ethereum between both versions. Upgrading the old version would sidestep this issue and remove the need for users to migrate their positions from v2 to v3.","For BGD, a fresh deployment is better than a version upgrade. “Our opinion is that the advantages of doing a new deployment of an Aave v3 Ethereum holistically and importantly outweigh those of upgrading the current Aave v2 smart contracts,” said the BGD team.","So far, Aave v3 has already been deployed on several other blockchains and layer two scaling solutions: Arbitrum, Fantom, Harmony, Optimism, Polygon and Avalanche.","For Polygon and Avalanche, each had the older version running on their chains prior to the development of the new version. This meant that the community had to decide between deploying a fresh v3 or upgrading the older v2 to the new version.","The Aave DAO favored the first option and so both versions of the DeFi lending platform now exist on Polygon and Avalanche.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.96 billion","content":"MONEY"},{"type":"70%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"6:00","content":"TIME"},{"type":"Oct. 11","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Aave v3 Ethereum","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"AM EST","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["AAVE"],"authors":["Osato Avan-Nomayo","The Block"]}