{"summary":"Lightning wallet Mutiny has reached public beta, helping users to control their funds without relying on Apple or Google app store downloads.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239615\/mutiny-normie-ready-lighting-wallet-avoiding-apple-google-app-stores","publishDate":"2023-07-14T07:26:39","id":13981,"type":null,"title":"Mutiny launches &#x27;normie-ready&#x27; Lightning wallet avoiding Apple, Google app stores","category":["CRYPTO ECOSYSTEMS"],"content":["Mutiny Wallet, a self-custodial Lightning wallet operating on the web, has reached its public beta phase, helping users to control their own funds without relying on Apple or Google app store downloads.","Stringent app store requirements mean many bitcoin wallets get stripped of features like tipping users or paying for digital content, Mutiny said in a blog <a href=\"https:\/\/blog.mutinywallet.com\/mutiny-wallet-open-beta\/\" data-v-f87c67ca=\"\">post<\/a> yesterday, claiming to make bitcoin more accessible to the 5 billion global internet users with access to a web browser.","The Nostr-based decentralized Twitter alternative <a href=\"https:\/\/www.theblock.co\/post\/207448\/nostr-based-decentralized-twitter-alternative-damus-goes-live-on-apple-app-store\" data-v-f87c67ca=\"\">Damus<\/a> is one such example, with Apple warning it would remove the app from its store unless it dropped its Lightning tipping feature last month. Apple also rejected the latest version of the Lightning-enabled bitcoin wallet app <a href=\"https:\/\/www.theblock.co\/post\/234818\/apple-reject-bitcoin-wallet-zeus\" data-v-f87c67ca=\"\">Zeus<\/a>, as it facilitated “the transmission of a virtual currency but was not submitted by a corresponding exchange or recognized financial institution.”","Mutiny Wallet said it leveraged the Lightning Development Kit project from Jack Dorsey’s Block, which offers developers customizable control over every aspect of the Lightning stack, including the ability to compile it for the web.&nbsp;","To simplify liquidity management for users, the wallet firm also partnered with Lightning infrastructure project Voltage to help users receive payments without worrying about opening channels or managing liquidity. This means users can receive their first Lightning payment within seconds of launching the application.","Lightning Network operates as a network of bi-directional payment channels on top of the Bitcoin blockchain, designed to enable fast and cost-effective micropayments. It offers a solution to the slower transaction speeds and higher fees associated with Bitcoin's mainnet, enabling users to transact directly without immediate settlement on the main blockchain.","While Mutiny said unified balances were an end goal for the wallet — abstracting away the distinction between users’ on-chain bitcoin and Lightning Network balances — the wallet still segregates funds locked up in Lightning channels from those available for on-chain spending for now. The team noted it made this trade-off to provide users with greater control over their funds but that when <a href=\"https:\/\/www.theblock.co\/post\/239098\/phoenix-wallet-lightning\" data-v-f87c67ca=\"\">splicing<\/a> becomes more widely available it would help solve the complexities of unified balances.","Splicing technology enables users to add or remove funds to a single channel, eliminating the need for multiple channels per user. Bitcoin self-custodial Lightning wallet Phoenix <a href=\"https:\/\/www.theblock.co\/post\/239098\/phoenix-wallet-lightning\" data-v-f87c67ca=\"\">launched<\/a> its third-generation wallet earlier this week, introducing splicing technology.","Mutiny Wallet secures on-chain funds using a seed phrase and offers encrypted and remote storage to restore users’ Lightning-related data in case of clearing browser storage or migrating their device. In the future, Mutiny plans to enable the same wallet to be used across multiple devices simultaneously but warned, “Please stay on a single device for now, bad things will happen otherwise.”","Nostr’s open protocol enables decentralized and censorship-resistant social media. Mutiny Wallet also incorporates Nostr Wallet Connect, allowing users to request payments directly from their wallet, facilitating social tipping on nostr clients like Damus and Amethyst and enabling further decentralized payment integrations like subscriptions. While payments currently require manual approval, Mutiny Wallet plans to introduce automatic payments in the future.","Mutiny Wallet acknowledged that the beta phase may still encounter some bugs and limitations, urging caution when loading large amounts of funds into the wallet during this early stage. However, the Mutiny Wallet team said it welcomed feedback from the community and was committed to stamping out any remaining bugs and shipping new features quickly, with the aim of creating a “normie-ready” wallet that appeals to both bitcoin enthusiasts and newcomers alike.","In April, Mutiny Wallet <a href=\"https:\/\/blog.mutinywallet.com\/introducing-mutiny\/\" data-v-f87c67ca=\"\">announced<\/a> it had raised $300,000 during a pre-seed funding round.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Phoenix","content":"LOCATION"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Nostr Wallet Connect","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Mutiny Wallet","content":"ORGANIZATION"},{"type":"Mutiny","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Mutiny","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"Damus","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","WALLETS"],"authors":["James Hunt","The Block"]}