{"summary":"Luna Foundation Guard published an audit today by JS Held showing its efforts to defend the UST peg during the May collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/187488\/luna-foundation-guard-says-it-spent-2-8-billion-to-defend-ust-peg","publishDate":"2022-11-16T08:22:05","id":13982,"type":null,"title":"Luna Foundation Guard says it spent $2.8 billion to defend UST peg","category":["CRYPTO ECOSYSTEMS"],"content":["Luna Foundation Guard (LFG), a non-profit created in January to grow the Terra ecosystem, has published an audit stating that it spent $2.8 billion in bitcoin and stablecoins to defend the TerraUSD (UST) stablecoin peg during the May collapse.","LFG was set up to <a href=\"https:\/\/www.theblock.co\/post\/134871\/luna-founation-guard-token-sale\" data-v-f87c67ca=\"\">defend<\/a> the UST peg as one of its mandates. The organization held bitcoin, stablecoins and other cryptocurrencies to defend UST’s peg to the U.S. dollar.","The audit was <a href=\"https:\/\/lfg.org\/audit\/LFG-Audit-2022-11-14.pdf\" data-v-f87c67ca=\"\">performed<\/a> by JS Held, according to an LFG statement on Wednesday. The audit report stated that LFG spent 80,081 BTC and $49.8 million in stablecoins, amounting to $2.8 billion in total, to defend the UST peg. This defense happened during the Terra ecosystem's death spiral that occurred in May. At the time, UST lost its parity with the U.S. dollar, triggering a system-wide collapse of the Terra ecosystem — including its flagship crypto, Luna.","Apart from LFG’s efforts, the report also stated that Terraform Labs, headed by Do Kwon, also tried to defend the UST peg. Terraform Labs reportedly spent $613 million of its own funds to defend the UST peg.","The JS Held audit report countered claims that LFG and Terraform Labs embezzled funds during the UST de-peg incident.&nbsp;“The report shows that all LFG funds were spent to defend UST’s peg parity with the Dollar as declared and that LFG’s remaining balances are the only funds remaining,” the audit report stated.","<span class=\"citation\" data-v-f87c67ca=\"\">LFG balances between May 7 and May 16. Image: JS Held audit of LFG's books<\/span>","Reports emerged back in September that LFG had another previously unknown wallet. The report stated the wallet held over 3,300 BTC that Korean authorities were <a href=\"https:\/\/www.theblock.co\/linked\/148253\/korean-police-seek-freeze-on-luna-foundation-guard-assets-kbs\" data-v-f87c67ca=\"\">looking<\/a> to freeze. LFG <a href=\"https:\/\/www.theblock.co\/post\/173269\/luna-foundation-guard-denies-reports-it-moved-bitcoin\" data-v-f87c67ca=\"\">denied<\/a> the allegation at the time — and today’s audit report supported LFG’s position, stating that the organization has not moved any funds since May 16.","Kwon commented on the audit report, stating that it was important to distinguish between the Terra collapse and FTX’s bankruptcy.","“While there have been multiple recent failures in crypto, it is important to distinguish between Terra’s case, where a transparent, open-source decentralized stablecoin failed to maintain peg parity and its creators spent proprietary capital to try to defend it, and the failure of centralized custodial platforms where its operators misused other people’s money (customer funds) for financial gain,” said Kwon.","With the audit published, attention could now shift towards compensation efforts for users affected by the Terra ecosystem collapse. LFG previously <a href=\"https:\/\/www.theblock.co\/post\/175618\/luna-foundation-guard-postpones-compensation-efforts-cites-ongoing-and-threatened-litigation\" data-v-f87c67ca=\"\">postponed<\/a> work on compensation, citing ongoing litigation by aggrieved parties.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"May 16","content":"DATE"},{"type":"May","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"May 7","content":"DATE"},{"type":"January","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Luna","content":"LOCATION"},{"type":"Kwon","content":"PERSON"},{"type":"$613 million","content":"MONEY"},{"type":"LFG","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Luna Foundation Guard (LFG","content":"ORGANIZATION"},{"type":"$2.8 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Terra ecosystem","content":"ORGANIZATION"},{"type":"$49.8 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["DO KWON"],"authors":["Osato Avan-Nomayo","The Block"]}