{"summary":"A new project on Blast is enabling speculation on crypto’s most prominent individuals — although it’s on testnet for now.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286909\/cryptos-latest-craze-is-swapping-influencers-as-trading-cards","publishDate":"2024-04-08T05:44:18","id":13993,"type":null,"title":"Crypto&#x27;s latest craze is swapping influencers as trading cards","category":["CRYPTO ECOSYSTEMS"],"content":["From <a href=\"https:\/\/www.theblock.co\/post\/118133\/bitclout-creator-decentralized-social-blockchain-200-million-funding-a16z-others\" data-v-f87c67ca=\"\">Bitclout<\/a> to <a href=\"https:\/\/www.theblock.co\/post\/252072\/friend-tech-users-have-earned-12-million-in-fees-but-is-it-sustainable\" data-v-f87c67ca=\"\">FriendTech<\/a>, it’s clear Crypto Twitter likes nothing more than speculating on each other.","The latest craze comes in the form of trading cards with a project called Fantasy.top. It has created cards for nearly 250 crypto individuals, which can be traded on the platform. Collected players can be put into a team and then entered into a competition. According to the project’s X account, 23,800 users entered into the latest competition.&nbsp;","Cards started trading on Fantasy.top in mid-Feburary, according to historical price data. It appears to have picked up traction recently on the back of posts by larger crypto influencers on X, such as crypto trader Ansem. Currently, the platform is only on testnet, so traders aren’t spending “real” money, as it were. However, the project is planning to come to mainnet soon — where it will find out whether it can attract the same attention.","\"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">Following the Ansem tweet, our growth has been explosive. While we've seen Fantasy's virality from the start, the scale this time is unprecedented,\" said Fantasy.top's founder who goes by the pseudonym Travis Bickle. \"We anticipated hitting full speed with the mainnet launch but are thrilled to witness such widespread interest already.\"<\/span>","While these are testnet numbers, some individuals have seen large trading volumes for their cards. Ansem, for instance, has seen 439 testnet ether of trading volume. This has <a href=\"https:\/\/t.co\/2V5N8xBTV3\" data-v-f87c67ca=\"\">earned him<\/a> a couple of testnet ether in rewards. FriendTech saw large success by adopting a similar model with very high fees, as it incentivized influencers to use and promote the app.","When anyone joins the platform — currently in invite code-only access — they receive three testnet ether on the Blast Sepolia testnet, which they can use for buying cards. It currently doesn't seem possible to get extra testnet ether within the app, beyond earning it through trading. New users also get five cards to start with. These are available in four types: common, rare, epic and legendary. So far, more than 1 million cards have been minted.","The platform shows social analytics data for the individuals on each trading card, as well as who they interact with the most on X. The idea here may be to help value individuals based on their social media status.","Fantasy.top is based on Blast, a Layer 2 network on Ethereum that went <a href=\"https:\/\/www.theblock.co\/post\/279883\/ethereum-layer-2-chain-blast-releases-official-mainnet\" data-v-f87c67ca=\"\">live on mainnet<\/a> in February. Blast aims to provide a native-yield model for ether and stablecoins, offering 4% interest for the former and 5% for the latter. It was built by Tieshun Roquerre, the founder of NFT marketplace Blur.","BitClout was one of the first social apps of this kind to take off, although its launch was marred in controversy as the platform attracted too many users before it was ready, and it had many missing features, such as withdrawals, when it launched.&nbsp;","BitClout provided an X-like experience but where users could bet on the value of profiles. These values were based on a bonding curve, so they would rise exponentially. Profile owners would receive a share of trading volumes. BitClout appears to have been replaced, or renamed, as Diamond.","FriendTech was the next big app to succeed based on a similar model. It was similar in that it was possible to bet on individuals' profiles, but its selling point was that buying someone's \"key\" gave access into their private group chat. While activity on FriendTech has largey died down, the project keeps hinting at some <a href=\"https:\/\/twitter.com\/friendtech\/status\/1767699517594628473\" data-v-f87c67ca=\"\">kind of next phase<\/a> in the near future.","<em data-v-f87c67ca=\"\">Update: Clarified types of cards, added total number of minted cards and comments from the founder.<br data-v-f87c67ca=\"\">\n<\/em>","<i data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Blast.<\/i>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"Tieshun Roquerre","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"FriendTech","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Larry Cermak","content":"PERSON"},{"type":"Diamond","content":"ORGANIZATION"},{"type":"Travis Bickle","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Tim Copeland","The Block"]}