{"summary":"The research and investment firm says “we always knew something like this was possible&quot; following the collapse of the TerraUSD stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/147755\/delphi-digital-admits-we-were-wrong-on-terra-stablecoin-risks","publishDate":"2022-05-19T04:03:14","id":13992,"type":null,"title":"Delphi Digital admits &#x27;we were wrong&#x27; on Terra stablecoin risks","category":["DEFI"],"content":["Crypto-focused research and investment group Delphi Digital has published a post-mortem on the losses inflicted by last week's collapse of TerraUSD (UST) algorithmic stablecoin, concluding that it \"always knew something like this was possible.\"","\"We understood the risks of the algorithmic model upfront and sought to be transparent about them throughout; however, it’s clear we miscalculated the risks,\" Delphi wrote in <a href=\"https:\/\/members.delphidigital.io\/reports\/learnings-from-last-week\" data-v-f87c67ca=\"\">a blog post<\/a> late Wednesday. \"To the vocal critics of Terra’s algorithmic design — you were right and we were wrong.\"","UST <a href=\"https:\/\/www.google.com\/search?client=safari&amp;rls=en&amp;q=ust+de-peg+theblockcrypto&amp;ie=UTF-8&amp;oe=UTF-8\" data-v-f87c67ca=\"\">de-pegged from the dollar<\/a> in catastrophic fashion last week, destroying more than $40 billion in value for investors. Delphi, which competes with The Block to offer research on the crypto industry, had been a backer of the Luna Foundation Guard (LFG), a Singapore-based non-profit entity with a mission to boost the Terra ecosystem.&nbsp;","“We always knew something like this was possible, and we tried to stress the risks to a system like this in our research and public commentary, but the fact is we miscalculated the risk of a ‘death spiral’ event coming to fruition,” Delphi said. “We’ve taken some heat for this over the last week, and we deserve it. The criticism is fair and we accept it.”","As recently as April, Delphi had written in a research newsletter that LFG's bitcoin purchases \"gives higher security to defend UST’s peg to the dollar\" and is \"likely reducing the risk of it heading into a death spiral.\" And in March the firm had launched an offer to allow clients to pay for their subscription with their UST balance and interest earned from Terra's Anchor Protocol.&nbsp;","Delphi is one of a large number of crypto operators that carried significant exposure to the Terra ecosystem at the time of its collapse. In its post, the group assessed the damage publicly for the first time.","Delphi said its venture capital arm Delphi Ventures Master Fund had, in early 2021, purchased an amount of Terra’s native token Luna equal to 0.5% of its net asset value (NAV). That exposure increased over time, resulting in “a large unrealized loss.” At its peak price, Luna and other Terra-native tokens accounted for around 13% of Delphi Ventures' NAV.","These numbers include a $10 million investment in Luna in February, part of <a href=\"https:\/\/www.theblockcrypto.com\/post\/134871\/luna-founation-guard-token-sale\" data-v-f87c67ca=\"\">a $1 billion token sale<\/a> by LFG. Delphi said that investment is “entirely lost” based on Luna's current price, but stressed that it sold no Luna during the token’s slide. José Maria Macedo, a partner at Delphi Digital, is a member of LFG’s <a href=\"https:\/\/lfg.org\/team\/\" data-v-f87c67ca=\"\">governing council<\/a>.","Delphi Labs, the software research and development company, suffered worst among the group’s offshoots. Delphi Labs spent more than a year working on joint ventures focused on the Astroport and Mars protocols on Terra — and had received grants of 30,000 LUNA and 466,666 UST from Terraform Labs for its work on the latter. The group stressed that the labs entity never sold any of the tokens it holds.","“We decided to build on Terra because we believed that decentralized money had the greatest chance of succeeding if it were to be integrated at the L1, focused on real world adoption, and built on a relatively scalable and interoperable blockchain,” said Delphi. “As for the future, after making a big bet on Terra and failing, we want to make sure we learn our lessons and make the right choice on where to focus our efforts. We’ve put together a cross-sectional team of some of our brightest minds across Research and Labs and we’ll be taking our time to ensure we assess all possible options and make the right long-term decision.”","Delphi also shared reflections on Terra’s Anchor Protocol, which advertised interest rates of 20% to UST depositors.","The group said it had seen the LFG — and the bitcoin reserves it amassed to backstop UST in times of stress — as a “a massive step” towards mitigating the risk of a bank run on the Anchor Protocol. “It effectively converted some of the excess UST demand into exogenous reserves that could be used to defend the peg if necessary,” said Delphi. “Creating partial exogenous collateralization while bringing down Anchor APY would materially reduce the systemic risk in the network.”","Delphi continued: “We believed a high level of external collateralization was a necessity in the long run, and we saw this as a path to get there. Unfortunately it didn’t grow fast enough compared to UST supply, and, combined with a fall in value of the BTC reserves, the liability overhang was too large to be defended.”","Delphi’s research arm had churned out six Terra-focused reports since February 2021 — none of which were paid for, according to the group's blog post. It said Delphi Research was largely unaffected by Terra’s implosion, from a financial standpoint.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delphi Labs","content":"ORGANIZATION"},{"type":"Delphi Ventures' NAV","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Delphi Research","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"Terra’s Anchor Protocol","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"February 2021","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Terra","content":"LOCATION"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"José Maria Macedo","content":"PERSON"},{"type":"Luna Foundation Guard","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Luna","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Terraform Labs","content":"ORGANIZATION"},{"type":"LFG","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Luna","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Delphi Ventures Master Fund","content":"ORGANIZATION"},{"type":"Delphi","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["DO KWON"],"authors":["Ryan Weeks","The Block"]}