{"summary":"The U.K. central bank and financial regulator are consulting on their proposed DSS approach before opening applications in the summer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286264\/bank-of-england-fca-digital-securities-sandbox","publishDate":"2024-04-03T10:07:28","id":13991,"type":null,"title":"Bank of England, FCA target autumn 2024 as earliest starting date for first UK Digital Securities Sandbox cohort","category":["REGULATION"],"content":["The Bank of England and the U.K.’s financial regulator, the Financial Conduct Authority, are targeting autumn 2024 for the first cohort of applicants under the country's Digital Securities Sandbox, <a href=\"https:\/\/www.bankofengland.co.uk\/news\/2024\/april\/the-boe-and-fca-issue-joint-consultation-and-draft-guidance-on-the-digital-securities-sandbox\" data-v-f87c67ca=\"\">outlined<\/a> in a joint consultation and draft guidance for firms looking to enter the DSS on Wednesday.","The DSS aims to help facilitate the adoption of innovative technology in digital assets, modifying regulations to enable eligible U.K. firms to use new technologies, such as blockchain and distributed ledger networks, in the trading and settlement of digital securities like shares and bonds. However, derivative contracts and “unbacked crypto assets” such as bitcoin and ether, are not in the scope of the DSS.","“The new Digital Securities Sandbox reshapes how we regulate by allowing firms to test regulatory changes using real world situations before these changes are made permanent. We hope this will be a more effective, collaborative and quicker way of delivering regulatory change,” FCA Executive Director Sheldon Mills said in a statement. “The new sandbox also helps strengthen the U.K.’s leading position as a global and vibrant financial center, by driving adoption of new technologies for trading and settling traditional assets.”","Importantly, the DSS differs from the similarly named <a href=\"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector\" data-v-f87c67ca=\"\">Digital Sandbox<\/a>, launched by the FCA in August 2023, to support firms in the early stages of digital product development.","The U.K. Treasury first consulted on the DSS in July 2023, with the U.K. government <a href=\"https:\/\/assets.publishing.service.gov.uk\/media\/655c893ed03a8d001207fda1\/M8298_Draft_response_to_DSS_consultation_final.pdf\" data-v-f87c67ca=\"\">responding<\/a> to the consultation and <a href=\"https:\/\/www.theblock.co\/post\/264389\/uk-finance-minister-announces-legislation-to-boost-the-nations-digital-asset-sector\" data-v-f87c67ca=\"\">outlining<\/a> plans to pass legislation to implement the initiative in November. The government subsequently <a href=\"https:\/\/www.theblock.co\/post\/268212\/uk-introduces-new-regulations-for-its-digital-securities-sandbox\" data-v-f87c67ca=\"\">introduced<\/a> the new regulations in December, providing the nation's financial watchdogs rules for supervising the sandbox, which came into force on Jan. 8 as part of the U.K.'s Financial Services and Markets Act 2023.","Following the publication of the joint consultation paper today, feedback is open to interested parties until May 29, after which the BOE and FCA will issue a response and open up applications to the DSS — planned for summer 2024. The regulators anticipate the first cohort of DSS applicants will enter the sandbox initiative from as early as autumn.","<span data-v-f87c67ca=\"\">DSS timeline. Image: <a href=\"https:\/\/www.bankofengland.co.uk\/paper\/2024\/cp\/digital-securities-sandbox-joint-bank-of-england-and-fca-consultation-paper\" data-v-f87c67ca=\"\">Bank of England<\/a>.<\/span>","“The Digital Securities Sandbox is an important tool for regulators to learn how we need to react to benefit safely from developments in technology and changes to vital financial market processes such as securities settlement,” BOE Executive Director for Financial Market Infrastructure Sasha Mills said. “We welcome views from potential participants and look forward to working with the FCA, government and industry over the lifespan of the DSS.”","Successful applicants can provide securities depository and settlement services and operate a trading venue under a single legal entity. According to the regulators, the DSS will be open to a wide range of firms “to maximize the opportunities to learn and for the U.K. financial system to benefit from private sector innovation and competing business models,” which could lead to “faster and cheaper ways for these securities to trade, settle and be utilized among financial market participants.”","The initiative will run for five years, subject to entry limits, and could lead to new permanent regulations for trading and settling digital assets in the future.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"summer 2024","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"DSS","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"August 2023","content":"DATE"},{"type":"May 29","content":"DATE"},{"type":"Sheldon Mills","content":"PERSON"},{"type":"U.K. Treasury","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"BOE Executive Director for Financial Market Infrastructure Sasha Mills","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"Financial Services","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Jan. 8","content":"DATE"},{"type":"BOE","content":"ORGANIZATION"},{"type":"Digital Securities Sandbox","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"July 2023","content":"DATE"}],"hashtag":["BOE","FCA","UK PARLIAMENT"],"authors":["James Hunt","The Block"]}