{"summary":"Archimedes, a decentralized lending and borrowing protocol focused on leverage, raised $4.9 million in a seed funding round.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/207526\/defi-protocol-archimedes-raises-4-9-million-in-seed-funding","publishDate":"2023-02-01T12:00:28","id":13995,"type":null,"title":"DeFi protocol Archimedes raises $4.9 million in seed funding","category":["COMPANIES"],"content":["Archimedes, a decentralized lending and borrowing protocol focused on leverage, raised $4.9 million in a seed funding round.","Hack VC led the round, with Uncorrelated Ventures, Truffle Ventures, Haven VC and others participating, Archimedes announced Wednesday. The seed round brings Archimedes's total funding to $7.3 million, having <a href=\"https:\/\/archimedesfi.medium.com\/archimedes-raises-2-4m-in-an-oversubscribed-pre-seed-round-to-bring-high-quality-leverage-to-defi-6538a37aba04\" data-v-f87c67ca=\"\">raised<\/a> $2.4 million in a pre-seed funding round led by Shima Capital in March last year.","Archimedes was founded last year by Oz Rabinovitch, Tomer Mayara and Derek Moen, who call themselves \"g(r)eeks.\" The protocol is still under development, set to launch this month, according to the announcement. Archimedes <a href=\"https:\/\/docs.archimedesfi.com\/introduction\" data-v-f87c67ca=\"\">says<\/a>, once launched, the protocol will allow lenders or liquidity providers to earn \"sustainable higher\" returns and borrowers or leverage takers to earn up to 10x yield of what other yield-bearing stablecoins offer.","\"Archimedes throws an extra screw into the equation which multiplies a user's original yield opportunity — leverage,\" it said in the announcement. \"Leverage takers that use Archimedes are sent an NFT which represents a yield-generating stablecoin position that has been leveraged at up to 10 times the principal collateral amount.\"","Archimedes's borrowers will have to pay a fee to access leverage. They will also pay a performance fee on their proceeds from the leveraged positions. \"With these fees paid by the borrowers, Archimedes is then able to close the loop and pay the lenders for lending their money,\" it <a href=\"https:\/\/archimedesfi.medium.com\/an-introduction-to-crypto-lending-and-borrowing-af4cdf81940e\" data-v-f87c67ca=\"\">said<\/a> in a recent blog post.","Archimedes's native stablecoin is called lvUSD, and its native token is dubbed ARCH.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Uncorrelated Ventures","content":"ORGANIZATION"},{"type":"$2.4 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"March last year","content":"DATE"},{"type":"Tomer Mayara","content":"PERSON"},{"type":"Truffle Ventures","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$7.3 million","content":"MONEY"},{"type":"Derek Moen","content":"PERSON"},{"type":"$4.9 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Shima Capital","content":"ORGANIZATION"},{"type":"Oz Rabinovitch","content":"PERSON"}],"hashtag":["LENDING","SEED &AMP; PRE-SEED"],"authors":["Yogita Khatri","The Block"]}