{"summary":"Adrian Orr, the governor of the Reserve Bank of New Zealand, doesn&#x27;t appear to be a fan of digital currencies, including bitcoin and stablecoins.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/277060\/bitcoin-fiat-new-zealand-central-banker","publishDate":"2024-02-12T07:26:09","id":13996,"type":null,"title":"Bitcoin &#x27;not at all&#x27; a substitute or complement to fiat, says New Zealand central banker","category":["CENTRAL BANKS"],"content":["Adrian Orr, the governor of the Reserve Bank of New Zealand, doesn't appear to be a fan of independent digital currencies — including bitcoin and stablecoins.","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.75%\n    <\/span><\/a> <!----><\/span><\/span> is not, according to Orr, a medium of exchange, store of value, or unit of account, \"yet people try to use it as that,\" he <\/span><a href=\"https:\/\/vimeo.com\/showcase\/10758103\/video\/912104765\" data-v-f87c67ca=\"\">told<\/a> a parliamentary committee on Monday. \"It's got other purposes, but it is not at all a substitute for, not even a complement to, central bank money,\" he said.","Orr also seems critical of stablecoins, saying they are \"the biggest misnomers such as hedge funds\" and \"oxymorons.\"","\"Stablecoins are not stable,\" he said. \"They're only as good as the balance sheet of the person offering that stablecoin.\"","Orr commented on <a href=\"https:\/\/www.theblock.co\/prices\" data-v-f87c67ca=\"\">bitcoin<\/a> and <a href=\"https:\/\/www.theblock.co\/learn\/251859\/the-different-types-of-stablecoins-explained\" data-v-f87c67ca=\"\">stablecoins<\/a> in response to a question about whether central banks worldwide are concerned about independent digital currencies versus central bank fiat currencies and their potential impact on the international financial system. \"The answer is yes, critically concerned,\" Orr said. \"Mostly in that what is advertised on the tin is not what is in the tin for these purported alternatives to central bank cash.\"","Fiat currencies such as the New Zealand dollar exist because they have the power of parliament behind them \"and a credible institution such as an independent central bank to maintain low and stable inflation,\" he added.","Last June, New Zealand's central bank <a href=\"https:\/\/www.rbnz.govt.nz\/hub\/news\/2023\/06\/rbnz-ramps-up-monitoring-of-stablecoins-and-cryptoassets\" data-v-f87c67ca=\"\">said<\/a> it was ramping up its monitoring of <a href=\"https:\/\/www.theblock.co\/learn\/251862\/what-is-a-stablecoin-and-how-does-it-work\" data-v-f87c67ca=\"\">stablecoins<\/a> and crypto assets because of uncertainties surrounding the sector's evolution and the potential risks they could pose to the financial system. \"We agree that caution is needed, which also reinforces the need for enhanced data and monitoring to build understanding,\" the Reserve Bank of New Zealand director of money and cash Ian Woolford said at the time.","Regarding the central bank’s own digital currency, it <a href=\"https:\/\/www.rbnz.govt.nz\/money-and-cash\/future-of-money\/cbdc\" data-v-f87c67ca=\"\">said<\/a> last year that it is still in the exploration phase to determine whether it will introduce one alongside cash.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New Zealand","content":"LOCATION"},{"type":"Reserve Bank of New Zealand","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Orr","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ian Woolford","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Adrian Orr","content":"PERSON"},{"type":"+0.75%","content":"PERCENT"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}