{"summary":"Forget mining gold, sell them axes and shovels: The legend of Levi Strauss is that a few years after the California gold rush began he headed west to seek","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231\/gold-in-them-thar-hills-bitmains-ipo-is-the-modern-merchant-fable-come-true","publishDate":"2018-08-10T16:39:59","id":14,"type":null,"title":"Gold in them thar hills: Bitmain’s IPO is the modern merchant fable come true","category":["BITCOIN"],"content":["Forget mining gold, sell them axes and shovels: The legend of Levi Strauss is that a few years after the California gold rush began he headed west to seek his fortune. No, not by finding precious metal but rather by selling goods to those who tried. That business would later give birth to durable, riveted pants and an empire selling denim was born.","That cryptocurrency adopted the term “mining” to describe the creation of digital coins makes the news of a forthcoming blockbuster IPO all the more delicious in its parallelism. Seven years ago in China, Jihan Wu translated Satoshi’s original bitcoin paper into his native language and unleashed a revolution there. First he created a leading bitcoin news site. But then two years later in 2013 Wu enlisted the help of Micree Zhan to launch a new company around bitcoin mining.","The goal was to develop the modern-day equivalent of the perfect pick axe: a silicon chip, purpose built to make the math behind mining bitcoin easier. They called the company Bitmain and developed that ASIC (an application-specific integrated circuit). Bitmain took off like a rocket. By 2017, two thirds of all bitcoin mining was being powered by Bitmain’s technology.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Backing the backers<\/strong>","Making all this happen wasn’t easy for Bitmain; to be the merchant to the miners cost money. And Bitmain raised bucketloads. If Strauss had been around in a modern times trying to get capital in the San Francisco Bay Area for&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">his<\/em>&nbsp;startup, there’s a good chance he would find his way to the offices of Sequoia Capital. And indeed so did Bitmain.","Sequoia was part of&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.bloomberg.com\/news\/articles\/2017-09-04\/sequoia-idg-are-said-to-invest-in-china-bitcoin-mining-giant\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.bloomberg.com\/news\/articles\/2017-09-04\/sequoia-idg-are-said-to-invest-in-china-bitcoin-mining-giant\" data-v-f87c67ca=\"\">last year’s $50 million financing at Bitmain<\/a>&nbsp;as well as a follow-on round earlier in 2018 that brought Bitmain another $400M. For good measure, Bitmain added another $1B to its coffers just last month. The proposed IPO is said to be raising upwards of $18B.","For Sequoia, Bitmain will be just another massive win assuming the proposed IPO stays on track. From Apple, to Google, to Dropbox, to Cisco, to WhatsApp, and eventually to AirBnB and Stripe, if there’s a giant thing happening in Silicon Valley, Sequoia is usually involved. Its investments are in firms worth literally&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">trillions<\/em>&nbsp;of dollars (see&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.forbes.com\/sites\/georgeanders\/2014\/03\/26\/inside-sequoia-capital-silicon-valleys-innovation-factory\/#794fc9453a82\" target=\"_blank\" rel=\"noopener nofollow\" data-href=\"https:\/\/www.forbes.com\/sites\/georgeanders\/2014\/03\/26\/inside-sequoia-capital-silicon-valleys-innovation-factory\/#794fc9453a82\" data-v-f87c67ca=\"\">this&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">Forbes<\/em>&nbsp;story<\/a>&nbsp;for more detail, just note it’s already pretty old).","Of course,&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263\" data-v-f87c67ca=\"\">Bitmain itself is happening far from the Valley, indeed halfway around the world. And it’s a harbinger of at minimum a power sharing — if not a power shift — that sees Asia emerging as a superpower in tech “startups”.<\/span>Japan’s Softbank has become&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.recode.net\/2018\/2\/5\/16974032\/this-is-where-chart-softbank-vision-fund-masayoshi-son-venture-capital\" target=\"_blank\" rel=\"noopener nofollow noopener\" data-href=\"https:\/\/www.recode.net\/2018\/2\/5\/16974032\/this-is-where-chart-softbank-vision-fund-masayoshi-son-venture-capital\" data-v-f87c67ca=\"\">the deepest-pocketed investor<\/a>&nbsp;in the biggest deals, notably putting billions into WeWork. Softbank is targeting taking its mobile unit public and possibly raising $30B. China’s Tencent is eyeing a US IPO for its music business, a Spotify-like service with 700 million total users (though many fewer are paying subscribers). Expect eye-popping numbers from that deal too.","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">Bitmain’s big numbers<\/strong>","Still, the Bitmain IPO could be among the biggest in tech history, and that’s perhaps all the more impressive given the company is hardly a household name — not just in the U.S. but really anywhere. Given their behind-the-scenes presence that’s not surprising. After all, there was a time no one outside networking had heard of Cisco. But what’s different here is how explosive the numbers are despite being nearly invisible.&nbsp;<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263\" data-v-f87c67ca=\"\">(Bitmain might raise more in its offering than Facebook, which was already being used by 800+ million people at IPO; not even one tenth that many have&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">heard<\/em>&nbsp;of Bitmain.)<\/span>","In 2017, Bitmain is said to have done $2.5B in revenues. The&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.coindesk.com\/crypto-unicorn-bitmain-weighs-18-billion-ipo-one-of-worlds-largest\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.coindesk.com\/crypto-unicorn-bitmain-weighs-18-billion-ipo-one-of-worlds-largest\/\" data-v-f87c67ca=\"\">reports from<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">CoinDesk<\/em>&nbsp;suggest<\/a>&nbsp;in just the first quarter of 2018 revenues touched $2B. That kind of growth could explain how Bitmain’s valuation rose from an estimated $8B to $15B over just a three-month period this year. So, too, could reports of its alleged profits. There is talk of a $2B&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">net income<\/em>&nbsp;this year which would nearly match last year’s revenues.","Details on this will wait till the IPO filing are available, but there’s reason to believe the numbers. Not only does Bitmain sell the ASICs that power most of the world’s bitcoin mining computers, it also runs two of the largest mining pools where people own a “stake” in the success of the operation. AntPool and BTC.com are constantly working the math problems that are integral to Bitcoin mining and Bitmain has a share in their success.","One of Bitmain’s mining facilities is opening in Texas, presumably to take advantage of the low price of wind power in the state. The energy intensiveness of bitcoin mining has pushed the bulk of operations to places where inexpensive energy is available. And most of that powerful is renewable these days. Hard to predict how growing U.S.-Chinese trade tension could affect these kinds of investments, but most definitely worth watching.","<span class=\"markup--quote markup--p-quote is-other\" data-creator-ids=\"56f89f949263\" data-v-f87c67ca=\"\">The overall Bitmain mining operation itself is producing billions in total value, with&nbsp;<em class=\"markup--em markup--p-em\" data-v-f87c67ca=\"\">CoinDesk&nbsp;<\/em>suggesting that’s now a business in the tens of billions. Again, Bitmain’s share isn’t entirely clear nor is much of the detail investors will seek out ahead of the IPO.<\/span>","<strong class=\"markup--strong markup--p-strong\" data-v-f87c67ca=\"\">The future of the future<\/strong>","That said, Bitmain has built a spectacularly successful business on the back of the spectacular rise of bitcoin itself. Despite recent price gyrations, newly “minted” coins are still worth $6,000 making partcipation in the mining pools or ownership of rigs powered by Bitmain’s chips highly desirable. And while the company will likely continue to profit from those endeavors, it has its sights set beyond bitcoin.","The next set of its chips will likely power an Ethereum-mining rig and then a move into artificial intelligence applications. Wall Street has noticed the potential impact on nVidia, who dominates the market for the graphics chips at the hear of many cryptocurrency mining machines. Indeed,&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/www.cnbc.com\/2018\/02\/23\/secretive-chinese-bitcoin-mining-company-may-have-made-as-much-money-as-nvidia-last-year.html\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/www.cnbc.com\/2018\/02\/23\/secretive-chinese-bitcoin-mining-company-may-have-made-as-much-money-as-nvidia-last-year.html\" data-v-f87c67ca=\"\">Bitmain is said to be as profitable<\/a>&nbsp;as the nearly quarter-century-old graphics giants.","The technology that makes Bitmain successful is a moving target, and of course the company might mis-step along the way. But it’s clearly planning on big things and the IPO proceeds should give it the resources to go toe-to-toe not just with nVidia, but anyone developed specialized chips to power the next generation of crypto, AI, and beyond.","Unlike Levi’s, Bitmain can’t just keep churning out 501s for a generation and hoping for the best. It will have to adapt to changing styles and needs to remain relevant. But the backstop of its bitcoin operations is a strong base on which to grow from here, barring a total collapse in the currency’s price. Bitmain is said to have been creative in selling its gear to account for fluctuations. At $6,000 per bitcoin, that creativity should remain quite lucrative. If prices were to trend much lower, perhaps less so.","All the more reason to get the IPO out soon, though that risk will likely keep it from some of the most frothy valuations the public markets are seeing. Even at more tempered multiples, though, the Bitmain IPO is likely to be a blockbuster. What comes next will determine if the company becomes legendary. Wu and Zhan might want to start studying&nbsp;<a class=\"markup--anchor markup--p-anchor\" href=\"https:\/\/theidleman.com\/manual\/arrivals\/brands\/the-history-of-levis\/\" target=\"_blank\" rel=\"nofollow noopener\" data-href=\"https:\/\/theidleman.com\/manual\/arrivals\/brands\/the-history-of-levis\/\" data-v-f87c67ca=\"\">the history of Levi’s<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2.5","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Levi’s","content":"PERSON"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"the first quarter of 2018","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"Bitmain","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"$18B","content":"MONEY"},{"type":"Asia","content":"LOCATION"},{"type":"Satoshi’s","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"$1B","content":"MONEY"},{"type":"then two years later","content":"DATE"},{"type":"Strauss","content":"PERSON"},{"type":"Sequoia","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$400M","content":"MONEY"},{"type":"$6,000","content":"MONEY"},{"type":"Bitmain IPO","content":"ORGANIZATION"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"$8B","content":"MONEY"},{"type":"Valley","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Texas","content":"LOCATION"},{"type":"$15B","content":"MONEY"},{"type":"nVidia","content":"ORGANIZATION"},{"type":"Levi Strauss","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"Dropbox","content":"LOCATION"},{"type":"$30B","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"$2B","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"San Francisco Bay Area","content":"LOCATION"},{"type":"trillions<\/em>&nbsp;of dollars","content":"MONEY"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"$50 million","content":"MONEY"},{"type":"Cisco","content":"ORGANIZATION"},{"type":"Softbank","content":"ORGANIZATION"}],"hashtag":[],"authors":["John Biggs","The Block"]}