{"summary":"Multicoin Capital’s hedge fund has returned 9,281% of its value since its inception in 2017. \nThe investment firm’s fund had a 537% increase in returns in 2023, as the crypto market experienced a resurgence.","author":["Elizabeth Napolitano","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285724\/multicoin-capitals-hedge-fund-has-grown-9281-since-2017-investor-note-shows","publishDate":"2024-03-29T19:00:26","id":14,"type":null,"title":"Multicoin Capital&#x27;s hedge fund has grown 9,281% since 2017, investor note shows","category":["Companies"],"content":["<span data-v-f87c67ca=\"\">Multicoin Capital’s crypto-focused hedge fund has brought its first investors more than 9,000% returns since 2017, according to the investment firm’s annual investor letter, reviewed by The Block. The surge in returns marks a stunning reversal of fortunes for the bear market-battered fund, which lost nearly all its value in 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to the letter to investors dated February 16, Multicoin Capital Master Fund has returned 9,281% of its value since its launch on Oct. 1, 2017. <\/span><span data-v-f87c67ca=\"\">The staggering gains are largely the result of the cryptocurrency market's resurgence, giving the fund a return of 537% in 2023. <\/span><span data-v-f87c67ca=\"\">The firm is expected to file a Form ADV, mandatory for advisers who must register with the Securities and Exchange Commission and exempt reporting advisors. Last year, they reported assets of over $1.36 billion in assets under regulatory management, according to their <a href=\"https:\/\/reports.adviserinfo.sec.gov\/reports\/ADV\/297302\/PDF\/297302.pdf\" data-v-f87c67ca=\"\">Form ADV<\/a>.&nbsp;&nbsp;<\/span>","“In 2023, crypto did what it does best and defied death, again,”&nbsp;Multicoin executives Tushar Jain, Kyle Samani and Matt Shapiro said in the letter. “Markets rebounded in spectacular form and our hedge fund was able to capture the market’s overreaction to meaningfully outperform.”","<span data-v-f87c67ca=\"\">The strong returns more than made up for Multicoin Capital's 91.4% loss in 2022. (<\/span><span data-v-f87c67ca=\"\">The fund said in its letter that its performance since inception figures includes various investments made through side pockets<\/span><span data-v-f87c67ca=\"\">.)<\/span>","<span data-v-f87c67ca=\"\">The bear market cycle was a particularly “painful,” but ultimately inconsequential, time for the investment firm, according to the executives.<\/span>","<span data-v-f87c67ca=\"\">“2022 was a particularly painful cycle d<\/span><span data-v-f87c67ca=\"\">ue to the triple threat of macro tightening, a directed political vendetta, and a once-in-lifetime financial fraud,” <\/span><span data-v-f87c67ca=\"\">Multicoin’s executives said in their note, alluding to the collapse of embattled crypto exchange FTX, to which their firm was exposed.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, those events were ultimately not a death knell for the company. “The combination of these events created a wave of panic selling that in all likelihood was worse than <\/span><span data-v-f87c67ca=\"\">the actual events themselves,” they said.&nbsp;<\/span>","The Block contacted Multicoin Capital for comment, but the firm declined to do so.&nbsp;","<span data-v-f87c67ca=\"\">Multicoin Capital is currently experiencing a financial turnaround, as a boom in the digital assets market has sent a handful of cryptocurrency prices skyrocketing. <\/span>","\"Most institutional investors have crypto exposure via venture funds but are missing the largest segment of<br data-v-f87c67ca=\"\">\nthe market: liquid tokens,\" the fund's managers said. \"We believe crypto public markets can also produce similar—if not<br data-v-f87c67ca=\"\">\nbetter—venture-scale returns than the private markets, especially if you employ a longer-term strategy.<br data-v-f87c67ca=\"\">\nThis fund is a great example of that—since inception, this fund has returned 93.81x on net basis, outpacing<br data-v-f87c67ca=\"\">\njust about every venture fund over the same time period, including our first venture fund (launched July<br data-v-f87c67ca=\"\">\n2018)\"","<span data-v-f87c67ca=\"\">Bitcoin is trading at roughly $69,602 as of the time of writing, up more than 70% since its price at the height of the bear market, according to <\/span><a href=\"https:\/\/www.theblock.co\/price\/248348\/bitcoin-btc-usd\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">The Block’s price data<\/span><\/a><span data-v-f87c67ca=\"\">. Meanwhile, several altcoins, such as solana and dogwifhat, have seen their prices increase since their inception by more than 20,000% and 2,000%, respectively, according to The Block’s data. <\/span>"],"hashtag":["INVESTMENT FIRMS"]}