{"summary":"Rep. Tom Emmer, R-Minn., who sits on the House Financial Services Committee, criticized the U.S. Treasury Department for having a savior-like complex when asked about its crypto recommendations on Thursday during the Blockchain Association Policy Summit.","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/265561\/rep-tom-emmer-lambasts-treasury-department-recommendations-for-more-control-over-crypto","publishDate":"2023-11-30T17:49:49","id":140,"type":null,"title":"Rep. Tom Emmer lambasts Treasury Department recommendations for more control over crypto","category":["Policy"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Republican lawmakers are digesting recommendations from the Treasury Department that would give it more tools to strengthen its authorities over the crypto industry.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Rep. Tom Emmer, R-Minn., who sits on the House Financial Services Committee criticized the agency for having a savior-like complex when asked about its plan on Thursday during the Blockchain Association Policy Summit.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I've always had this attitude —&nbsp;beware of the self proclaimed savior that rides in on a white horse and tells you I'm here to protect you,\" Emmer said.&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The Treasury Department sent recommendations to lawmakers this week, including one for new sanctions tools and another that would bolster its authority over dollar-based stablecoins. <\/span><span class=\"s3\" data-v-f87c67ca=\"\">Deputy Secretary Wally <\/span><span class=\"s2\" data-v-f87c67ca=\"\">Adeyemo had said \"dollar-backed stablecoin providers\" that are outside the U.S. should not be able to use U.S. currency without putting in place procedures to block terrorists from taking advantage of their platform.<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">\"I am increasingly concerned about things like dollar-based stablecoins that aren't based here in the United States, but give people the privilege and the ability to use the dollar outside of our jurisdiction,\" Adeyemo said on Wednesday during a fireside chat at the Blockchain Association Policy Summit.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Emmer pushed back on Adeyemo's recommendations and noted that the Treasury had not yet responded to a letter he and other <a href=\"https:\/\/www.theblock.co\/post\/263196\/lawmakers-look-to-president-biden-for-answers-on-cryptos-role-in-financing-hamas\" data-v-f87c67ca=\"\"><span class=\"s4\" data-v-f87c67ca=\"\">lawmakers<\/span><\/a> sent it asking about how crypto played a role in Hamas financing. The agency did not immediately respond to a request for comment.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Tell us what the issue is first,\" Emmer said on Thursday.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"They want to swallow this all up into the surveillance security state that they've created. We just can't let it happen. This is Congress's purview not his,\" Emmer continued.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sen. Cynthia Lummis, R-Wyo., who is a member of the Senate Banking Committee, took a more measured approach on Thursday during the Blockchain Policy Summit when asked in a panel discussion about the Treasury's proposal.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I'm going to be looking specifically about what they recommend with regard to mixers and tumblers to see if that's an area where we can sit down with Treasury,\" Lummis said.&nbsp;<\/span>"],"hashtag":["SEC","SENATE BANKING COMMITTEE","SENATE FINANCE COMMITTEE"]}