{"summary":"Starknet, an Ethereum Layer 2 network, is preparing to release a significant upgrade named ‘Quantum Leap’ this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237841\/ethereum-layer-2-starknet","publishDate":"2023-07-05T12:00:55","id":140,"type":null,"title":"Ethereum Layer 2 network Starknet plans &#x27;Quantum Leap&#x27; upgrade on July 12","category":["CRYPTO ECOSYSTEMS"],"content":["Starknet, an Ethereum Layer 2 network, is preparing to launch an upgrade this month to boost its capacity for transactions per second.","Scheduled for launch around July 12, the \"Quantum Leap\" upgrade aims to elevate the network's throughput to over hundred transactions per second. This would mark a significant upswing from current levels, according to the team at StarkWare, a key network contributor.","Currently undergoing testing, Starknet version 12.0 awaits approval from the Starknet community through an ongoing vote. If it passes the community validation, the upgrade will be deployed to the mainnet. After a dedicated period of engineering by StarkWare, LambdaClass, and other participants within the Starknet ecosystem, the upgrade was first released on the Goerli testnet on July 3.","“Starknet’s new version, Quantum Leap, is exactly what the name suggests – a leap in TPS, the likes of which nobody has yet achieved in the Ethereum ecosystem,” said Eli Ben-Sasson, co-founder of StarkWare.","Starknet, a decentralized Layer 2 network, utilizes a solution classified as a Zero Knowledge roll-up, which condenses multiple transactions on an off-chain layer and publishes them together on the Ethereum network. <a href=\"https:\/\/www.theblock.co\/post\/208731\/starkware-open-sources-prover-technology-for-ethereum-layer-2-network\" data-v-f87c67ca=\"\">StarkWare<\/a> was the original architect of Starknet, employing the Stark cryptographic proofs mechanism invented by the team. Today, StarkWare is among a collaborative group of contributors shaping Starknet’s evolution, with the network’s operations and roadmap now under the purview of the Starknet Foundation.","While the upgrade is expected to position Starknet at the top of the TPS leaderboards for Ethereum Layer 2 scaling solutions, it will also improve latency, with an expected time-to-inclusion of under 15 seconds under normal conditions. According to StarkWare, this is expected to help scale DeFi applications and the gaming niche by facilitating faster transactions and greater throughput for users.","The Starknet roadmap includes plans for version 13.0 later this year that aims to cut down transaction costs. Version 14, meanwhile, will introduce a system where developers can pay extra to prioritize transactions, thereby creating a marketplace for block space on the Layer 2 network.","Ben-Sasson added that a major focus for the Starknet network in the future will also be leveraging the account abstraction feature. The mechanism could enable innovative integrations within crypto apps, such as the use of two-factor authentication for signing crypto transactions and wallet recovery.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sasson","content":"PERSON"},{"type":"StarkWare","content":"ORGANIZATION"},{"type":"July 12","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July 3","content":"DATE"},{"type":"Eli Ben-Sasson","content":"PERSON"},{"type":"Starknet Foundation","content":"ORGANIZATION"}],"hashtag":["STARKNET"],"authors":["Vishal Chawla","The Block"]}