{"summary":"Bankman-Fried used the phrase &quot;I don&#x27;t remember&quot; at least 10 times in an interview that lasted almost two hours.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191616\/sam-bankman-frieds-still-sorry-but-now-he-says-his-memory-isnt-great","publishDate":"2022-12-01T19:24:45","id":14008,"type":null,"title":"Sam Bankman-Fried’s still sorry, but now he says his memory isn&#x27;t great","category":["EXCHANGES"],"content":["Sam Bankman-Fried feels bad about his FTX “screw-up,” but he claims he doesn’t remember some of the details about what went wrong.","The former FTX CEO fielded questions about his troubled exchange for almost two hours during a Twitter Spaces event Thursday evening.","Bankman-Fried said he’s working with new lawyers, and there were some questions he doesn’t want to answer.","Former FTX CEO Sam Bankman-Fried regrets how he mishandled his troubled crypto exchange, but he doesn’t quite remember all the details.","The disgraced crypto mogul spoke for almost two hours about the collapse of FTX during a <a href=\"https:\/\/twitter.com\/i\/spaces\/1DXxyvQZzdnKM\" data-v-f87c67ca=\"\">Twitter Spaces event<\/a> hosted by Mario Nawfal, telling a half-dozen interviewers that he wasn’t clear about some of the events that caused his firm to file for bankruptcy protection. At least 38,000 listeners tuned into the event.&nbsp;","Bankman-Fried used the phrase “I don’t remember” at least 10 times during the interview, sidestepping questions about how he mishandled his crypto empire. He expressed regret for how his business imploded, saying he “wasn't on top of sh-t” and felt compelled to explain what went wrong.&nbsp;","“I feel like you all deserve to hear from me about what happened,\" Bankman-Fried said, responding to a question about why he wanted to talk. \"I feel incredibly bad about it.”","But some of the details that actually matter were fuzzy. Bankman-Fried said he didn’t recall whether he updated investors on his risk management profile, the details of his dealings with Bahamian securities regulators, or whether he was involved in his trading firm Alameda’s interactions with the press.","Bankman-Fried did mention he’s receiving legal advice, although he wouldn’t say how he is paying his lawyers. He didn't want to talk about his parents, and he sidestepped multiple questions about Caroline Ellison, the former head of FTX's sister trading firm Alameda Research who he reportedly dated for a time.&nbsp;","In his latest remarks, the former FTX boss seemed to have trouble remembering what he said yesterday as interviewers pressed him on comments about whether his firm marked assets properly.","“I actually don't remember exactly what I had said then,” Bankman-Fried said.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\"> He also questioned just who he might be. \"Who is 'you' here?\" he responded to a question about himself.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sam Bankman","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"evening","content":"TIME"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Mario Nawfal","content":"PERSON"}],"hashtag":[],"authors":["Stephanie Murray","The Block"]}