{"summary":"","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103436\/why-shield-protocol-is-the-next-best-solution-in-the-decentralized-derivatives-market","publishDate":"2021-05-05T08:51:17","id":14001,"type":null,"title":"Why Shield Protocol is the next best solution in the Decentralized Derivatives Market.","category":["SPONSORED"],"content":["<span data-v-f87c67ca=\"\">In 2020, the DeFi market, which had been dormant for more than 2 years, finally exploded under the macro background of the global liquidity glut. Bitcoin mining halved to kick off the digital asset bull market, and micro innovations such as liquidity mining and AMM automatic market makers. Among them, the DeFi space of decentralized stablecoins, lending and spot exchanges all made substantial leaps forward and gradually gave birth to a number of leading projects.<\/span>","<b data-v-f87c67ca=\"\">The Revolutionary core features of DeFi<\/b>","<span data-v-f87c67ca=\"\">The success of these DeFi projects has led us to recognize the revolutionary core feature of DeFi:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the long term, these revolutionary qualities will drive a paradigm shift in traditional financial markets. Put simply – DeFi is eating CeFi and TradFi with its competitive edge and appeal, and becoming an unstoppable trend in the process.<\/span>","<span data-v-f87c67ca=\"\">The derivatives space, one of the largest financial markets in the world, has not witnessed the emergence of paradigm-shifting DeFi products. To understand why we need to start by analyzing the user needs of the current derivatives market.<\/span>","<span data-v-f87c67ca=\"\">Derivatives are primarily used to meet hedging and speculative needs. The current digital asset derivatives market is dominated by speculative demand. Years of practice show that the main requirements of users in the speculative market are:<\/span>","<span data-v-f87c67ca=\"\">Based on the current performance of the public chain, derivatives DEX in these core needs lag way behind CEX, just as the 1700’s stream train did not beat the horse and carriage on anything other than speed.<\/span>","<img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-medium wp-image-103452\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.29.35-AM-671x450.png\" alt=\"\" width=\"671\" height=\"450\" srcset=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.29.35-AM-671x450.png 671w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.29.35-AM-1006x675.png 1006w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.29.35-AM-768x515.png 768w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.29.35-AM.png 1106w\" sizes=\"(max-width: 671px) 100vw, 671px\" data-v-f87c67ca=\"\">","<span data-v-f87c67ca=\"\">Here’s a closer look at why this is so:<\/span><img decoding=\"async\" loading=\"lazy\" class=\"alignnone size-medium wp-image-103453\" src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.31.27-AM-800x306.png\" alt=\"\" width=\"800\" height=\"306\" srcset=\"https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.31.27-AM-800x306.png 800w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.31.27-AM-768x294.png 768w, https:\/\/www.tbstat.com\/wp\/uploads\/2021\/04\/Screen-Shot-2021-04-30-at-11.31.27-AM.png 1176w\" sizes=\"(max-width: 800px) 100vw, 800px\" data-v-f87c67ca=\"\">","<span data-v-f87c67ca=\"\">Uniswap’s great success has not come from delivering a better spot trading experience than the current CEX, but from meeting the demand for long-tail asset distribution that the CEXes could not meet with a license-free, extremely low-cost offering. Essentially, its success came from tapping into a new unmet need in the market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The fundamental solution to cracking this game lies only in applying the characteristics of blockchain technology to meet needs unmet by traditional finance. <\/span><a href=\"http:\/\/www.shieldex.io\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Shield<\/span><\/a><span data-v-f87c67ca=\"\">, a Pay Little to Win Big risk-free perpetual protocol, is one such derivative protocol that follows the same path as the Uniswap breakout.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">From a trader’s perspective:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Take an example here:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is addressing a whole new demand for trading – a market that has always existed but one that had not been explored.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">But why had such a market not been explored?&nbsp;Because such a setup actually requires super-advanced financial engineering product design capabilities and the need to cross a huge trust gap. The market could not be activated if the top financial institutions do not step in.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That was until the emergence of blockchain, which broke the trust gap and allowed the talents of financial engineering experts buried in top universities and internet companies to come to the fore.<\/span>","<span data-v-f87c67ca=\"\">The financial engineering of the Shield protocol is its exotic offering of no expiration dates. A daily option fee is charged in the form of a funding fee paid by the trader. Unlike traditional Black-Scholes options, pricing an option that has no delivery date, i.e., is perpetual, remains a difficult academic problem. As seen in the Shield whitepaper, the Shield team successfully derived and solved the exact analytical solution of the partial differential equation for pricing the Shield protocol funding fee.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At the same time, unlike the traditional nonlinear pricing model, Shield applies linear approximation by cutting up the nonlinear process, allowing decentralized risk-free perpetual work well on the Ethereum blockchain with on-chain settlement.&nbsp;<\/span>","<b data-v-f87c67ca=\"\">Conclusion&nbsp;<\/b>","<span data-v-f87c67ca=\"\">The Steam engine trains survived in the capacity market in the 17th century by comparing load rather than speed and then continued optimization iterations revolutionized the capacity market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Shield protocol fully applies the revolutionary qualities of DeFi with academic-level financial engineering (perpetual options) innovation to meet a differentiated market need that has been unmet by CEX today with limited blockchain infrastructure. With its IDO (Initial Dex Offering) scheduled in the next 2 weeks, the market is about to see a truly innovative offering very soon.<\/span>","<span data-v-f87c67ca=\"\">In short – with Shield, a new path has been created for derivatives to break the ice.<\/span>","<span data-v-f87c67ca=\"\">Here’s a hearty welcome to the Shield Community. Follow them on social media:<\/span> <a href=\"https:\/\/t.me\/shielddaoofficial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Telegram<\/span><\/a><span data-v-f87c67ca=\"\">, <\/span><a href=\"https:\/\/twitter.com\/shield_dao\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Twitter<\/span><\/a><span data-v-f87c67ca=\"\">, and <\/span><a href=\"https:\/\/medium.com\/@shielddaoofficial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Medium<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>"],"entity":[{"type":"DEX","content":"ORGANIZATION"},{"type":"Scholes","content":"PERSON"},{"type":"Shield","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"2020","content":"DATE"},{"type":"Shield Community","content":"ORGANIZATION"},{"type":"1700","content":"DATE"}],"hashtag":[],"authors":["Sponsored","The Block"]}