{"summary":"The FCA is concerned by the “lack of engagement” from unregistered crypto firms to its incoming financial promotions regime.\nAll crypto asset firms marketing to UK consumers will need to comply with the regulatory regime from Oct. 8.","author":["Brian McGleenon","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252341\/uk-regulator-warns-crypto-firms-over-lack-of-engagement-with-new-rules","publishDate":"2023-09-21T10:55:27","id":1400,"type":null,"title":"UK regulator warns crypto firms over &#x27;lack of engagement&#x27; with new rules","category":["Policy"],"content":["The UK's Financial Conduct Authority warned unregistered crypto firms about&nbsp;their lack of engagement with the regulator over the upcoming <a href=\"https:\/\/www.theblock.co\/post\/233554\/fca-to-roll-out-stricter-rules-for-crypto-ads-including-referral-bonus-ban\" data-v-f87c67ca=\"\">financial promotions regime<\/a>.","In a <a href=\"https:\/\/www.fca.org.uk\/publication\/correspondence\/final-warning-cryptoasset-firms-marketing-consumers.pdf\" data-v-f87c67ca=\"\">letter<\/a> sent Thursday, the UK regulatory body said many firms have refused to engage with the FCA.","\"Despite our best efforts only 24 firms responded to a survey that was sent to over 150 firms,\" the regulator said, adding it harbored the most concern for overseas crypto asset firms who have UK customers.","\"The lack of engagement gives us serious concerns about unregistered firms’ readiness to comply with the new regime,\" it continued.","All crypto asset firms marketing to UK consumers, including firms based overseas, will need to comply with the UK <a href=\"https:\/\/www.fca.org.uk\/firms\/cryptoassets\/marketing-uk-consumers#:~:text=When%20the%20regime%20comes%20into,by%20an%20FCA%20authorised%20person.\" data-v-f87c67ca=\"\">financial promotions<\/a> regime from Oct. 8.","The new rules apply for crypto promotions across a wide range of media forms, from websites and social media outlets, to online advertising. To stay on the right side of the guidelines, unregistered crypto asset firms will need to ensure promotions are approved by an FCA authorized person.","The FCA's letter sets out the steps firms can take to comply with the regime, and it also explains the actions the FCA may take against firms that fail to comply.&nbsp; The <a href=\"https:\/\/www.fca.org.uk\/publication\/guidance-consultation\/gc23-2.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">new guidelines<\/a> contain a section on non-compliant crypto memes, that the regulator could consider as financial promotions.","The regulator said unregistered crypto asset firms who fail to comply are likely to be in breach of section 21 of the UK's Financial Services and Markets Act 2000. This would be a criminal offence, punishable by up to two years imprisonment, an unlimited fine, or both.","The regulator also addressed its expectations for businesses that support unregistered crypto asset firms, including social media platforms, app stores, search engines and payments firms. These businesses were urged to be aware of the risks associated with supporting firms engaged in illegal promotions that target UK consumers.","In the warning letter, the FCA reminded UK businesses to carefully consider their obligations under the Proceeds of Crime Act 2002 .","\"We are concerned that businesses supporting unregistered crypto asset firms may be at risk of committing money laundering offences under POCA,\" the FCA said in the letter. \"Intermediaries are at risk of receiving and dealing with this criminal property through, for example, the fees generated by app stores, social media platforms, search engines and domain name registrars hosting illegal financial promotions.\""],"hashtag":["FCA"]}