{"summary":"Bitcoin&#x27;s association with illicit activities like drug trafficking and hacks is often brought up by critics, but detecting such activities in Bitcoin is","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/34504\/blockchain-analytics-startup-elliptic-mit-researchers-collaborate-to-detect-money-laundering-in-bitcoin-using-deep-learning-techniques","publishDate":"2019-08-02T09:00:36","id":14006,"type":null,"title":"Blockchain analytics startup Elliptic, MIT researchers collaborate to detect money laundering in bitcoin using machine learning","category":["RESEARCH"],"content":["<span data-v-f87c67ca=\"\">Bitcoin's association with illicit activities like drug trafficking and hacks is often brought up by critics, but detecting such activities in Bitcoin is much easier compared to physical cash because of its transparent and pseudo-anonymous nature.&nbsp;<\/span>","Now, blockchain analytics startup Elliptic has partnered with researchers from Massachusetts Institute of Technology (MIT) and tech giant IBM to apply deep learning techniques to analyze over 200,000 bitcoin transactions as part of an effort to detect illicit activities such as money laundering and ransomware.","Based on the analysis, Elliptic has <a href=\"https:\/\/www.kaggle.com\/ellipticco\/elliptic-data-set\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">released a data set<\/a>, claiming to be “the world’s largest set of labeled transaction data publicly available for any cryptocurrency.\" The data set has been formed using several machine learning methods such as Logistic Regression, Random Forest, Multilayer Perceptrons, and Graph Convolutional Networks (GCN), with the GCN being an “emergent new method.”","“Graph convolutional networks are still a young class of methods, and we’re early days in these experiments, but we do believe GCN’s power to capture the relational information in these large, complex transaction networks could prove valuable for anti-money laundering,” said Mark Weber, a researcher at MIT-IBM Watson AI Lab, who took part in the analysis of bitcoin transactions.","Elliptic’s data set is a time-series graph of 203,769 bitcoin transactions and payment flows. The analysis found that 2% of the analyzed transactions were illicit, 21% were licit, and the remaining transactions were labeled as unknown.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","","\"This work will contribute to enabling our clients, including cryptocurrency exchanges and financial institutions, to use our software to better identify illicit transactions and meet their anti-money laundering obligations,\" Dr. Tom Robinson, chief scientist and co-founder of Elliptic, told The Block.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlthough the current efforts focus on bitcoin (BTC), it could be applied to several other cryptocurrencies ranging from ether (ETH) to Facebook's upcoming cryptocurrency, Libra, Robinson added.&nbsp;<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe MIT and IBM researchers said they hope to inspire others to use such emerging techniques to fight “societally important challenge” of detecting money laundering activities and thereby making financial systems \"safer and more inclusive.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nSharing similar thoughts, blockchain analytics firm CipherTrace recently <a href=\"https:\/\/cdn2.hubspot.net\/hubfs\/4345106\/crypto_aml_report_2018q2.pdf\" data-v-f87c67ca=\"\">said<\/a> that “sophisticated” technology is needed to uncover money laundering in cryptocurrencies. “Tracking funds through the Blockchain system requires the most advanced computer science and cybercrime knowhow,” it said.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nEarlier this year, blockchain analytics firm Chainalysis also <a href=\"https:\/\/www.theblockcrypto.com\/2019\/04\/24\/chainalysis-extends-its-compliance-service-to-ten-new-cryptocurrencies-citing-high-demand-and-regulatory-pressure\/\" data-v-f87c67ca=\"\">strengthened<\/a> its compliance services, helping financial institutions, exchanges, and law enforcement agencies to monitor illicit activities across more blockchains' networks.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Random Forest","content":"ORGANIZATION"},{"type":"Multilayer Perceptrons","content":"PERSON"},{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tom Robinson","content":"PERSON"},{"type":"Mark Weber","content":"PERSON"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Robinson","content":"PERSON"},{"type":"Graph Convolutional Networks","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"GCN","content":"ORGANIZATION"},{"type":"Massachusetts Institute of Technology (MIT","content":"ORGANIZATION"},{"type":"Libra","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}