{"summary":"The Treasury is asking the public for comment on risks and benefits of cryptocurrencies. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/157197\/per-bidens-executive-order-treasury-requests-public-comment-on-digital-currency-policy","publishDate":"2022-07-12T16:05:19","id":14012,"type":null,"title":"Per Biden&#x27;s executive order, Treasury requests public comment on digital currency policy","category":["REGULATION"],"content":["The Treasury is asking the public for comments on the risks and benefits of cryptocurrencies.&nbsp;","The request for <a href=\"https:\/\/www.federalregister.gov\/documents\/2022\/07\/08\/2022-14588\/ensuring-responsible-development-of-digital-assets-request-for-comment\" data-v-f87c67ca=\"\">public comment<\/a> went live on the Federal Register on July 8, but the Treasury did not formally announce it until July 12. The request comes as the Treasury solidifies its policy on digital assets.&nbsp;","“For consumers, digital assets may present potential benefits, such as faster payments, as well as potential risks, including risks related to frauds and scams,” said Nellie Liang, in a statement.&nbsp;","The undersecretary for domestic finance, Liang spearheaded the <a href=\"https:\/\/www.theblock.co\/post\/134352\/treasury-official-touts-the-flexibility-of-bank-charters-for-stablecoin-issuers-during-senate-hearing\" data-v-f87c67ca=\"\">Treasury's proposal on stablecoin regulation<\/a>, which ultimately concluded that Congress should limit stablecoin issuance to insured depository institutions, i.e. banks.&nbsp;","The Treasury's announcement also noted concern that digital assets posed a greater risk to vulnerable populations:&nbsp;","\"The rise in use of digital assets, and differences across communities, may also present disparate financial risk to less informed market participants or exacerbate inequities. It is critical to ensure that digital assets do not pose undue risks to consumers, investors, or businesses, and to put in place protections as a part of efforts to expand access to safe and affordable financial services experienced by more vulnerable populations.\"","Last week, the Treasury <a href=\"https:\/\/www.theblock.co\/post\/156435\/treasury-sends-biden-framework-for-international-work-on-crypto-over-the-next-year\" data-v-f87c67ca=\"\">sent the White House<\/a> its framework for international engagement on cryptocurrencies. President Joe Biden put out <a href=\"https:\/\/www.theblock.co\/linked\/137013\/white-house-releases-text-of-bidens-crypto-focused-executive-order\" data-v-f87c67ca=\"\">the executive order<\/a> at the heart of the development back in March.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nellie Liang","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"July 8","content":"DATE"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"July 12","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Joe Biden","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"}],"hashtag":["JANET YELLEN"],"authors":["Kollen Post","The Block"]}