{"summary":"The major market structure bill could be considered by the full House of Representatives as early as September, though it could hit a wall in the Senate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241812\/historic-crypto-market-bill-approved-to-advance-to-full-us-house","publishDate":"2023-07-27T13:45:58","id":14016,"type":null,"title":"Historic crypto market bill approved to advance to full US House","category":["POLICY"],"content":["The House Agriculture Committee advanced legislation to overhaul how crypto markets are regulated in the U.S., a day after the House Financial Services Committee did the same.","The bill becomes the most significant piece of digital asset legislation to advance this far in Congress. Now that committees debated, amended and advanced the unusual cross-jurisdictional effort, the legislation is likely to be voted on by the entire House of Representatives in the near future. Uncertainty remains in the Senate though, and the Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/240688\/sec-said-to-be-slow-walking-assistance-requested-for-us-crypto-market-bill\" data-v-f87c67ca=\"\">appears to be skeptical of the effort<\/a>.","The historic step came amidst tenser debate at the House Financial Services Committee over a separate, but related bill that had been expected to garner more bipartisan support.","House Republicans, as well as industry advocates, have worked to gain as much support from Democrats as possible in order to give the market structure bill, titled the ‘FIT for the 21st Century Act’, enough momentum for it to be considered despite skepticism in the Democrat-majority Senate.","The market bill appeared to have more Democratic support in the Agriculture Committee, though the measure was advanced by a voice vote, making it hard to quantify how much bipartisan support there was. But multiple Democrats offered amendments to tweak the bill that were accepted by Republican Agriculture Committee Chair Glenn \"GT\" Thompson and other Republican members of the committee, who hold a small majority on both the panel and in the full House of Representatives.","\"The legislation marks a significant milestone in the House Committee on Agriculture’s efforts to create a much-needed digital asset regulatory framework that protects consumers and investors while promoting American leadership in finance and technology,” said the Pennsylvania Republican at Thursday’s committee meeting.","In addition to granting more power and funding to oversee crypto spot markets for so-called digital commodities, bitcoin being the most notable, by the Commodity Futures Trading Commission, the bill also would direct regulators to create a clear pathway for a digital asset to transition from being a security investment to a commodity, with less disclosure requirements for the latter. The bill also would allow a process for streamlined, securities-style capital raises through digital asset offerings, and adds $120 million to the CFTC’s budget for three years by redirecting it from the Securities and Exchange Commission. &nbsp;","Thursday’s debate and amendment process at the House Agriculture Committee was significantly less tense than either Wednesday’s debate of the same bill, or a concurrent debate over the stablecoin bill in the House Financial Services Committee. The bill had an unusual two committee debate and amendment process due to shared jurisdiction over the two different types of asset markets, and respective regulatory agencies, at play: securities and commodities.","Bipartisan talks over a comprehensive framework for payment stablecoins, seen as a connected effort to the market bill because of the role stablecoins often play in shifting investments from one cryptocurrency to another, <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\">broke down<\/a> in a very public way at the same time as the Agriculture Committee's meeting. The stablecoin effort was also seen as more driven by recent market events, as talks around the issue began last summer following the Terra\/Luna collapse.","Democrats raised concerns that the bill would allow tech companies like Meta and Amazon to issue their own stablecoins and cut out federal regulation of the digital assets.","Rep. Maxine Waters, D-Calif., the top Democrat on the committee, called the current Republican-led draft of the bill under consideration <span data-v-25901368=\"\" data-v-f87c67ca=\"\">“deeply problematic and bad for America” during Thursday's meeting. <\/span>","Republicans sought input from the New York Department of Financial Services, seen as one of the stauncher state-level regulators, on the main sticking point, a provision that allows states to approve stablecoin issuance, to attempt to counterbalance concerns over the state licensing option.","The Biden administration <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\">has issues with the provision<\/a>, according to statements made at Thursday’s tense committee meeting on the bill. Traditional financial industry players like banks and credit unions also raised <a href=\"https:\/\/www.theblock.co\/post\/241353\/bank-objections-over-state-provision-could-complicate-stablecoin-bill\" data-v-f87c67ca=\"\">similar concerns in correspondence<\/a> last week. House Financial Services Committee Chair Patrick McHenry, R-N.C., <a href=\"https:\/\/www.theblock.co\/post\/241585\/financial-services-chair-pushes-back-on-bank-criticism-of-stablecoin-bill\" data-v-f87c67ca=\"\">fired back<\/a> that they could also benefit from the legislation.","As his own committee recessed from the tense stablecoin debate, <a href=\"https:\/\/www.theblock.co\/post\/241749\/us-stablecoin-talks-stall-as-senior-house-republican-blames-white-house\" data-v-f87c67ca=\"\">McHenry<\/a> informed members that the Agriculture Committee approved its portion of the joint market bill a few minutes earlier, by the expedited voice vote. In contrast, <a href=\"https:\/\/www.theblock.co\/post\/241508\/democrats-oppose-crypto-market-overhaul-but-stablecoin-deal-possible\" data-v-f87c67ca=\"\">debate and amending of the same bill<\/a> occupied the financial policy panel for much of Wednesday, only for six Democrats to end up joining Republicans in the recorded vote.","“I don’t seek to emulate the Ag Committee in many ways, but man, oh man, was that sweet,” quipped McHenry.","A recorded vote on the stablecoin bill is scheduled for later Thursday.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Maxine Waters","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"Ag Committee","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Pennsylvania","content":"LOCATION"},{"type":"House Committee on Agriculture’s","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"McHenry","content":"ORGANIZATION"},{"type":"Agriculture Committee","content":"ORGANIZATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"House Agriculture Committee","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Republican Agriculture Committee Chair Glenn \"GT\" Thompson","content":"ORGANIZATION"},{"type":"Terra\/Luna","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"$120 million","content":"MONEY"},{"type":"summer","content":"DATE"},{"type":"Biden","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":["CONGRESS","FEDERAL RESERVE","GARY GENSLER","HOUSE AGRICULTURE COMMITTEE","HOUSE FINANCIAL SERVICES COMMITTEE","MAXINE WATERS","PATRICK MCHENRY","SEC"],"authors":["Colin Wilhelm","Sarah Wynn","The Block"]}