{"summary":"Once implemented into smart contracts, such NFTs can augment blockchain-based gaming, metaverse land sales and more. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161604\/life-for-rent-how-a-new-nft-token-standard-could-create-the-next-generation-of-landlords","publishDate":"2022-08-05T06:40:04","id":14014,"type":null,"title":"How a new Ethereum token standard could let you rent out your NFT","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">In late-June, a new Ethereum token standard called ERC-4907 reached the final stages of development; one which will allow the user to loan out their non-fungible token (NFT).<\/span>","<span data-v-f87c67ca=\"\">ERC-4907 adds a new role in the NFT standard, splitting who is the owner and who is the user of an NFT – making “renting” possible. The renter can use the NFT until the loan period expires, automatically sending the NFT back to its owner.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Before the ERC-4907, every time you transferred the NFT, you lost your ownership,” says Lareina, growth lead for Double Protocol, a startup building out rentable NFT infrastructure and the developer of the new token standard. But by splitting up ownership and usage rights, it’s now possible for NFTs to be&nbsp; loaned out and rented in permissionless ways.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">To be sure, rentable NFTs are not yet officially available. Reaching “final” status means that the Ethereum proposal, or project aiming to improve the Ethereum blockchain, can no longer be updated. Other builders can now incorporate that proposal into smart contracts without fear of the developers later changing it.<\/span>","<span data-v-f87c67ca=\"\">Once built into smart contracts, rentable NFTs have the potential to disrupt blockchain gaming, metaverse land sales, blockchain-based media platforms and more.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Most of the NFTs with the highest profiles, such as Bored Ape Yacht Club, CryptoPunks and Azuki, were either minted or wrapped in the ERC-721 token standard, which represents ownership of a digital or physical asset that is verified on the Ethereum blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">These token standards necessitate that the owner of the NFT may use that digital asset. In order to use, say, Axie #5 in the play-to-earn game Axie Infinity, you must have that NFT in your wallet. To have the NFT in your wallet, you must have either minted that Axie or purchased it on a secondary market.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In other words, purchasing that Axie precedes your ability to use it — as it would for other NFTs minted under ERC-721.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">NFTs minted under ERC-4907 token standard split ownership and usage rights with a digital asset. The ERC-4907 token standard can be wrapped around existing NFTs minted under ERC-721 or other Ethereum standards, allowing the wrapped NFT to be read by the smart contracts of rentable NFT marketplaces, and be loaned or rented as if it were originally minted under the ERC-4907 standard.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition, the owner can set time parameters for which an individual may use their rented NFT. When that time ends, the user can no longer use that NFT, and the rented NFT reverts back in the hands of the original owner — without the owner having to manually ask for their asset back.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sharing the usage rights of an NFT is not new. Gaming guilds purchase NFTs that are prohibitively expensive for most players and loan them out in exchange for a portion of the player’s profits. Such guilds, like <\/span><a href=\"https:\/\/www.theblock.co\/post\/152064\/yield-guild-games-walks-away-from-merit-circle-with-10-times-its-investment-following-ouster\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Yield Guild Games<\/span><\/a><span data-v-f87c67ca=\"\"> (YGG), emerged in the late summer and early fall last year for <\/span><a href=\"https:\/\/www.theblockcrypto.com\/news+\/113637\/axie-infinity-is-getting-so-popular-it-has-struggled-to-stay-running\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Axie Infinity,<\/span><\/a><span data-v-f87c67ca=\"\"> when the game’s popularity was at its height.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“When the owner assigns [their NFT’s] rights to the guild, it's very risky,” Double Protocol builder, who goes by Shrug Newton, told The Block in an interview. “You have to trust the guild. If the guild disappears, then you lose your assets.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, ERC-4907 allows users to create a sort of do-it-yourself guild out of valuable NFTs that they already own, in which loaners can charge a rental fee and users can keep profits earned from gaming. And they can do it in a trustless and permissionless way by leveraging Ethereum smart contracts, Lareina says.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While this may seem like a threat to guild business models, Double Protocol considers blockchain-based gaming guilds to be market makers — entities that buy and sell securities and often provide liquidity — for rentable NFTs. And established guild organizations such as YGG can leverage ERC-4907 make their guilds more decentralized.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Lareina adds that Double Protocol considers gaming guilds as big stakeholders in the rentable NFT marketplace and thus wants to cater to them. This could include creating tools where guild organizations can create new guilds through one click of a button, as well as ways to control how gaming earnings are split between the loaner and renter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Aside from gaming, rentable NFTs can also augment metaverse land usage. Lareina notes that metaverse land owners can rent out their property for events. And should an investor have purchased a metaverse land parcel but lack the capacity to build on top of it, they can rent out that land to another party to build it out and earn revenue through rent, protecting any other property they own by removing it during the rental period and adding it back when the rental period is over.<\/span>","<span data-v-f87c67ca=\"\">This technology can also facilitate web3-based library loans or free trials of a product, Lareina adds, as well as other areas.<\/span>","<span data-v-f87c67ca=\"\">In all, rentable NFTs unlock a new marketplace of usage rights of NFTs now that they’ve been decoupled from ownership, Lareina said. “We are building our product on top of this philosophy.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lareina","content":"PERSON"},{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"Double Protocol","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Shrug Newton","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"4907","content":"DATE"},{"type":"summer","content":"DATE"}],"hashtag":["ETHEREUM"],"authors":["MK Manoylov","The Block"]}