{"summary":"E-Money is unwinding its euro-backed stablecoin EEUR because of current crypto market conditions, which are fairly dire.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/200358\/cosmos-based-e-money-discontinues-euro-backed-stablecoin","publishDate":"2023-01-10T06:04:04","id":14015,"type":null,"title":"Cosmos-based e-Money discontinues euro-backed stablecoin","category":["CRYPTO ECOSYSTEMS"],"content":["Cosmos-based electronic payment system e-Money has stopped issuing its euro-backed stablecoin EEUR citing <a href=\"https:\/\/www.theblock.co\/post\/192707\/crypto-market-has-experienced-an-education-by-fire-says-loomdart\" data-v-f87c67ca=\"\">bear market conditions<\/a>.","e-Money <a href=\"https:\/\/medium.com\/e-money-com\/eeur-stablecoin-unwind-cf945820fb3f\" data-v-f87c67ca=\"\">stated<\/a> that it will honor EEUR stablecoin redemptions until Mar. 6. Customers with funds below 100,000 EEUR can unwind their positions by swapping their tokens directly in the stablecoin market on <a href=\"https:\/\/www.theblock.co\/post\/193252\/cosmos-largest-dex-osmosis-launches-a-stableswap-exclusive\" data-v-f87c67ca=\"\">Osmosis<\/a>, the largest decentralized exchange on Cosmos. They can exchange their tokens for USDC or Cosmos-native assets like atom and osmo. e-Money advised users to unwind their positions in small batches to reduce market congestion and price slippage.","Customers who wish to redeem amounts larger than 100,000 EEUR can do so directly for euros, the announcement added. These users will have to pass through customer identification checks and the process will take up to five business days.","e-Money stated that unwinding its stablecoin project was a difficult decision. “Given the current market conditions, that effort has unfortunately reached a stage where it is prudent and responsible to wind it down,” the project stated.","Despite unwinding its EEUR stablecoin, e-Money stated that its blockchain project will continue to operate. The project has plans for a chain upgrade within the first quarter of the year, which will integrate the latest Cosmos features.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"USDC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"first quarter of the year","content":"DATE"}],"hashtag":["COSMOS","USDC"],"authors":["Osato Avan-Nomayo","The Block"]}