{"summary":"Circle has cut a portion of its staff to strengthen its balance sheet.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239277\/circle-cuts-marginal-amount-of-staff-to-strengthen-balance-sheet-coindesk","publishDate":"2023-07-12T15:19:09","id":14023,"type":null,"title":"Circle cuts &#x27;marginal&#x27; amount of staff to strengthen balance sheet: CoinDesk","category":["COMPANIES"],"content":["Circle has laid off a portion of its workforce to strengthen its balance sheet, CoinDesk reported.","The firm, which is best known for launching stablecoin USDC, told <a href=\"https:\/\/www.coindesk.com\/business\/2023\/07\/12\/circle-cuts-workforce-ends-certain-non-core-activities-will-continue-hiring-globally\/\" data-v-f87c67ca=\"\">CoinDesk<\/a> that the staff cut would allow it to \"focus on core business activities and execution.\"","\"We have reduced or ended investments in non-core activities and reduced operational expenses which includes a marginal reduction in headcount,\" the firm added. \"At the same time, we have identified new areas for investment and are continuing to hire in key areas of focus on a global basis.\"","Circle has made headlines in recent weeks for a number of big ticket hires and appointments including former U.S. Commodities Futures Trading Commission head Heath Tarbert, who joined the firm as its chief legal officer and head of corporate affairs at the beginning of July. Goldman Sachs' former chief risk officer, Craig Broderick, who retired from the bank after 32 years in January, <a href=\"https:\/\/investor.circle.com\/corporate-news\/news-details\/2023\/Circle-Appoints-Financial-Risk-Management-Leader-Craig-Broderick-to-Board-of-Directors\/default.aspx\" data-v-f87c67ca=\"\">joined<\/a> Circle's board of directors at the end of June.&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Circle","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.S. Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"July","content":"DATE"},{"type":"Craig Broderick","content":"PERSON"},{"type":"Heath Tarbert","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","The Block"]}