{"summary":"Skale Network released Levitation Protocol, a new entrant to Zero Knowledge (ZK) rollup-based scaling solutions.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232622\/skale-network-introduces-ethereum-zk-rollup-levitation-protocol","publishDate":"2023-06-01T12:00:11","id":14028,"type":null,"title":"Skale Network introduces Ethereum ZK-Rollup Levitation Protocol","category":["CRYPTO ECOSYSTEMS"],"content":["Skale Network has released the Levitation Protocol — a Zero Knowledge (ZK) rollup aimed at providing a new scaling solution for Ethereum developers.","Skale operates as an ecosystem of more than 20 application-specific sidechains that run parallel to Ethereum. These chains stand to provide scaling benefits through the deployment of <a href=\"https:\/\/www.theblock.co\/post\/162098\/zk-rollups-likely-to-be-main-layer-2-solution-for-ethereum-says-vitalik-buterin\" data-v-f87c67ca=\"\">ZK-Rollups<\/a>, which, along with Optimistic Rollups, constitute the most widely adopted Layer 2 solutions.","Beyond enabling developers to write ZK-Rollups for Ethereum, Skale’s core team intends to launch a dedicated decentralized Layer 1 blockchain to augment Levitation. This blockchain will be specifically designed for publishing Levitation-derived Layer 2 ZK proofs back to Ethereum and is intended to expand Ethereum’s scalability by utilizing off-chain computation, while simultaneously preserving the security of the primary blockchain.","A public testnet is anticipated for later this year, with the mainnet launch scheduled for the fourth quarter of 2023. This, according to Skale contributors, suggests a comprehensive scaling-centric roadmap that Skale is striving for.","“By uniting Skale’s instant finality with the enhanced security of a novel Layer 2 ZK approach, Skale offers developers a platform for creating new, decentralized applications,” Chris Sharp, CTO of Blockdaemon and a validator of the Skale Network, commented on the new release. “Developers will now have the opportunity to utilize not only app-specific chains but also ZK roll-ups, and SKALE-G. We believe this pioneering approach will significantly expand the blockchain ecosystem.”","The rollout of the Levitation Protocol occurs in a competitive landscape. Over the past few years, Layer 2 projects such as Polygon, Starknet, zkSync, and Scroll have been aggressively vying for dominance in the ZK-based Layer 2 sector.","Skale Labs, the developer behind this blockchain scaling ecosystem, closed a <a href=\"https:\/\/www.theblock.co\/post\/41638\/ethereum-scaling-network-skale-raises-17-1m-in-new-funding-to-speed-up-its-mainnet-launch\" data-v-f87c67ca=\"\">$17 million<\/a> in a 2019 funding round from notable venture capital firms including Winklevoss Capital, Arrington XRP Capital, ConsenSys Labs, and Multicoin Capital.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon","content":"LOCATION"},{"type":"Chris Sharp","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Skale Network","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Skale","content":"PERSON"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"fourth quarter of 2023","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"$17 million","content":"MONEY"},{"type":"Winklevoss Capital","content":"ORGANIZATION"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}