{"summary":"The House Financial Services Committee will investigate the FTX collapse in a hearing on Dec. 13.\n\nThe hearing is titled “Investigating the Collapse of FTX, Part I,” and is expected to include details of how the collapse affects the broader digital asset industry. ","author":["Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/190370\/house-lawmakers-set-first-ftx-hearing-for-dec-13","publishDate":"2022-11-28T13:07:10","id":1402,"type":null,"title":"House lawmakers set first FTX hearing for Dec. 13","category":["Policy"],"content":["House lawmakers will begin their investigation into the collapse of crypto exchange FTX, and its broader impact on the digital asset industry, at a hearing scheduled next month.","The House Financial Services Committee will hold its first FTX-focused hearing on Dec. 13. The hearing, titled “Investigating the Collapse of FTX, Part I,” is likely to be part of a series.","FTX, once valued at $32 billion, filed for bankruptcy protection earlier this month. The firm collapsed after a run on its native utility token, FTT.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span class=\"s2\" data-v-f87c67ca=\"\">The committee did not release a list of witnesses for the December hearing. Waters and Ranking Republican Rep. Patrick McHenry, R-N.C., have <a href=\"https:\/\/www.theblock.co\/post\/187617\/u-s-house-committee-to-hold-hearing-on-ftx-collapse-and-crypto-fall-out\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">previously<\/span><\/a> said they want former FTX CEO Sam Bankman-Fried to participate, along with companies involved including Bankman-Fried’s Alameda Research trading firm and rival exchange Binance.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span><\/span>McHenry, the likely chair of the committee next Congress, told The Block earlier this month that he expects <a href=\"https:\/\/www.theblock.co\/post\/187617\/u-s-house-committee-to-hold-hearing-on-ftx-collapse-and-crypto-fall-out\" data-v-f87c67ca=\"\">Binance's role in the collapse<\/a> to also be a focus of the hearing.&nbsp;","Bankman-Fried is set to speak at a New York Times summit later this week, but has not yet publicly indicated whether he will cooperate with the congressional investigation.","Senate lawmakers are also taking a close look at the FTX crisis.&nbsp;The Senate Agriculture Committee will <a href=\"https:\/\/www.theblock.co\/post\/188842\/senate-committee-to-hold-ftx-related-hearing-in-december\" data-v-f87c67ca=\"\">hold<\/a> a hearing on Thursday, and the Senate Banking Committee is <a href=\"https:\/\/www.theblock.co\/post\/187758\/senate-banking-committee-eyes-hearing-on-sam-bankman-frieds-ftx-collapse\" data-v-f87c67ca=\"\">working<\/a> to schedule an FTX hearing.&nbsp;"],"hashtag":["CONGRESS","HOUSE FINANCIAL SERVICES COMMITTEE","SENATE AGRICULTURE COMMITTEE","SENATE BANKING COMMITTEE"]}