{"summary":"The Treasury Department released proposed rules that would require brokers, such as exchanges, to report certain sales on crypto.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247478\/treasury-irs-release-proposed-crypto-tax-reporting-rules","publishDate":"2023-08-25T10:12:28","id":14027,"type":null,"title":"Treasury, IRS release proposed crypto tax reporting rules","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The U.S. Treasury Department released <a href=\"https:\/\/public-inspection.federalregister.gov\/2023-17565.pdf\" data-v-f87c67ca=\"\">proposed rules<\/a> that would require brokers and exchanges to report certain sales on crypto from bitcoin to NFTs to close the tax gap and “ensure that everyone plays by the same set of rules.”&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Treasury, alongside the Internal Revenue Service, released a set of proposed <a href=\"https:\/\/public-inspection.federalregister.gov\/2023-17565.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">regulations<\/span><\/a> on Friday as part of the Infrastructure Investment and Jobs Act passed in 2021 that included crypto language to increase reporting made by brokers on customers’ crypto activity.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Under the proposed rules, crypto brokers would be treated similarly to brokers for more traditional investments like stocks and bonds. Currently, taxpayers owe tax on gains and can deduct losses on digital assets when they are sold, but the Treasury said it is hard for taxpayers to calculate their gains.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Under the new rules, brokers would need to provide a new Form 1099-DA to help taxpayers figure out if they owe taxes under the proposed rules.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">“These regulations align tax reporting on digital assets with tax reporting on other assets, and, as a result, avoid preferential treatment between different types of assets,” the Treasury Department said in a statement.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Under the proposal, brokers would be defined to encompass platforms, payment processors and certain hosted wallets.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The IRS and Treasury also seemingly looped in decentralized exchanges that would then need to collect customer information and report sales information.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"This decision was made because the reasons for requiring information reporting on dispositions of digital assets do not depend on the manner by which a business operating a platform effects customers’ transactions,\" the Treasury Department said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Treasury and the IRS addressed privacy concerns among some in the industry and asked for comments on alternative ideas.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Brokers would need to begin reporting information on sales and exchanges of digital assets in 2025, under the proposal, and is expected to bring in about $28 billion over 10 years, according to the Treasury.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Comments are due October 30 and the Treasury Department will hold hearings on the proposal in November.&nbsp;<\/span>","Blockchain Association CEO Kristin Smith said people need to pay their taxes if they transact in crypto, but warned that crypto is different from traditional assets.","\"If done correctly, these rules could help provide everyday crypto users with the necessary information to accurately comply with tax laws,\" Smith said on Friday in a <a href=\"https:\/\/theblockchainassociation.org\/blockchainassociation-ceo-kristin-smith-statement-on-proposed-irs-rules\/\" data-v-f87c67ca=\"\">statement<\/a>. \"However, it’s important to remember that the crypto ecosystem is very different from that of traditional assets, so the rules must be tailored accordingly and not capture ecosystem participants that don’t have a pathway to compliance.\"","The DeFi Education Fund said the proposed rules were \"confusing, self-refuting, and misguided,\" in a statement.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"It attempts to apply regulatory frameworks predicated on the existence of intermediaries where they don't exist, an 'unsquarable' circle that the proposal itself acknowledges,\" said the organization's CEO Miller Whitehouse-Levine. \"This approach won’t make filing taxes easier nor improve tax compliance, and we look forward to providing our comments as to why this proposal must be reconsidered.”<\/span>","<em data-v-f87c67ca=\"\">Updated at 10:50 a.m. ET with comments<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2025","content":"DATE"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"10:50 a.m.","content":"TIME"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Kristin Smith","content":"PERSON"},{"type":"October 30","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"DeFi Education Fund","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$28 billion","content":"MONEY"},{"type":"Levine","content":"PERSON"},{"type":"\" Smith","content":"PERSON"},{"type":"Miller Whitehouse","content":"PERSON"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}