{"summary":"Bitcoin miner Greenidge Generation said that it is pausing plans to develop additional sites in Texas as it reports $107.9 million in second quarter net losses.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163653\/bitcoin-miner-greenidge-generation-pauses-texas-expansion-plans-reports-107-9-million-in-second-quarter-net-losses","publishDate":"2022-08-15T19:39:28","id":14021,"type":null,"title":"Bitcoin miner Greenidge Generation &#x27;pauses&#x27; Texas expansion plans, reports $107.9 million in second-quarter net losses","category":["MINING"],"content":["Bitcoin miner Greenidge Generation will \"pause\" parts of its expansion into Texas, focusing instead on sites in South Carolina and New York, the company said on Monday","\"We have chosen to pause our plans to develop certain additional sites in our pipeline in the ERCOT market and, instead, intend to concentrate our operations at our two existing sites in South Carolina and New York for the time being,\" the company said in a statement. ERCOT, or the Electric Reliability Council of Texas, manages the state's power grid.&nbsp;","The company reported $107.9 million in net losses in the second quarter, mainly due to a $71.5 million nonrecurring, non-cash charge, according to a statement on Monday.","The miner said that due to the \"sudden change in mining economics\" it has opted to prioritize liquidity and capital preservation over \"aggressive growth.\" It expects to reach a hash rate of at least 3.6 exahash per second (EH\/s) &nbsp;by the first quarter of 2023, having finished the second quarter at 2.5 EH\/s.","The company <a href=\"https:\/\/ir.greenidge.com\/news-releases\/news-release-details\/greenidge-generation-announces-comprehensive-expansion-plans\" data-v-f87c67ca=\"\">announced last year<\/a> that it closed an exclusive deal with a developer that had a development pipeline of at least two gigawatts of capacity and a separate exclusive agreement with a company controlling over one gigawatt of power generation, both in Texas.","Greenidge mined 10.7% more bitcoin (621 BTC) in the second quarter but saw its revenues decrease by 17% to $31.3 million compared to the first quarter.","\"While our team once again delivered strong operational performance in terms of bitcoin production and plant uptime for the quarter and for the month of July, the approximately 60% decrease in the price of bitcoin during the second quarter coupled with the spike in global energy prices clearly presents a challenging earnings environment,\" said&nbsp; CEO Jeff Kirt.","Greenidge is planning to focus operations at its current sites in New York and South Carolina \"for the time being.\"","The company recently had its <a href=\"https:\/\/www.theblock.co\/post\/155188\/greenidges-permit-renewal-denied-by-new-york-regulators\" data-v-f87c67ca=\"\">air permit renewal denied by New York's Department of Environmental Conservation<\/a> but said it would challenge the regulator's decision and continue to mine in the meantime.","\"While no adjudicatory proceedings have been scheduled to date, Greenidge has been advised that, based on the progression of previous and ongoing cases of a similar nature, the appeals process may take a number of years to fully resolve,\" it said Monday.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitcoin miner Greenidge Generation","content":"ORGANIZATION"},{"type":"Greenidge","content":"PERSON"},{"type":"South Carolina","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$107.9 million","content":"MONEY"},{"type":"10.7%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"first quarter of 2023","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"Texas","content":"LOCATION"},{"type":"$71.5 million","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"first quarter","content":"DATE"},{"type":"17%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"$31.3 million","content":"MONEY"},{"type":"Department of Environmental Conservation","content":"ORGANIZATION"},{"type":"Jeff Kirt","content":"PERSON"},{"type":"Electric Reliability Council of Texas","content":"ORGANIZATION"},{"type":"second quarter","content":"DATE"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}