{"summary":"The SEC&#x27;s Hester Peirce called SAB 121 a &quot;pernicious weed,&quot; criticizing her agency&#x27;s closed-door approach to regulating the crypto industry. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/286110\/sec-commissioner-hester-peirce-denounces-sab-121-and-criticizes-her-agencys-regulatory-approach","publishDate":"2024-04-02T13:12:15","id":1403,"type":null,"title":"SEC Commissioner Hester Peirce denounces SAB 121 and criticizes her agency&#x27;s regulatory approach","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Securities and Exchange Commission's Hester Peirce called a controversial crypto accounting guidance a \"pernicious weed,\" criticizing her agency's approach to regulating the industry.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">During a two-day \"SEC Speaks\" event sponsored by the Practicing Law Institute, the Republican commissioner singled out Staff Accounting Bulletin 121, citing her past speech called the '<a href=\"https:\/\/www.sec.gov\/news\/speech\/peirce-secret-garden-sec-speaks-040819\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">SECret Garden<\/span><\/a>,' — a reference she said was to \"the maze of staff guidance that serves to define practices across the securities industry in a way that may be inconsistent with&nbsp; a plain reading of the rulebook.\"&nbsp;<\/span>","Peirce noted, as she usually does in public speeches, that her views are hers and not those of the SEC.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">\"Nobody can challenge the diktats because they're not final agency action, but compliance is mandatory for anyone who is trying to avoid SEC delays, denials and enforcement and examination scrutiny,\" Peirce said on Tuesday. \"So everybody silently complies. Since I gave that speech, a particularly pernicious weed has cropped up in that secret garden — that's staff accounting bulletin 121 and related oral guidance.\"<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">Released in March 2022, staff accounting bulletin 121, also called SAB 121, requires firms that custody crypto to record on their balance sheets their customers' crypto holdings as liabilities. <\/span><span class=\"s4\" data-v-f87c67ca=\"\">The bulletin has drawn controversy over the past year over concerns in the crypto industry that it could prevent banks from custodying digital assets. Lawmakers <a href=\"https:\/\/www.theblock.co\/post\/280000\/house-finance-committee-votes-to-move-forward-with-measure-to-overturn-secs-custody-bulletin\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">advanced<\/span><\/a> a resolution last month to rescind the bulletin after a Congressional <a href=\"https:\/\/www.theblock.co\/post\/260282\/congressional-watchdog-says-sec-needs-lawmaker-approval-before-moving-forward-with-controversial-bulletin\" data-v-f87c67ca=\"\"><span class=\"s5\" data-v-f87c67ca=\"\">watchdog<\/span><\/a> said the SEC needed congressional approval before moving forward with SAB 121.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"The bottom line is that rules of such broad effect should be set by the full commission, not by the staff that reports only to the chairman,\" Peirce said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Peirce also spoke generally on Tuesday about what she called the \"dwindling of genuine commission engagement with the public.\" When people and entities come to the SEC for feedback, concerns and questions — they're too often met with \"crickets,\" Peirce said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">SEC staff does not have the bandwidth, Peirce said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"But the root of the problem is that the Commission discourages the staff from offering much more than shrugs, silence, slow walking, sighs,\" Peirce added. \"The culture at the top of the SEC has changed and that has led to a change across the whole agency in the way we interact with the public.\"&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"Practicing Law Institute","content":"ORGANIZATION"},{"type":"Peirce","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Exchange Commission","content":"ORGANIZATION"},{"type":"SAB","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Sarah Wynn","The Block"]}