{"summary":"Bitcoin mining manufacturer Bitmain announced a discount on the S19 Pro, which is one of their main mining machines.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/171736\/a-sign-of-the-times-bitmain-slashes-price-of-flagship-s19-mining-rig","publishDate":"2022-09-21T12:30:19","id":14030,"type":null,"title":"A sign of the times: Bitmain slashes price of flagship S19 Pro mining rig","category":["BITCOIN"],"content":["Bitcoin hardware manufacturer Bitmain on Tuesday announced a discounted price for one of its more popular models, the S19 Pro, reflecting an industry-wide decline in the cost of bitcoin mining rigs.&nbsp;","The company is now selling those machines at $19 per terahash (TH), reflecting the trend of declining ASIC machine prices, which have fallen more than 60% in the past six months, according to Bitcoin mining pool Luxor's index data dashboard.","The S19 Pro model was trading at $28\/TH in secondary markets before the Bitmain announcement, said Lauren Lin, operations manager at Luxor's ASIC Trading Desk. \"When they lowered their price to $19\/TH it dropped prices 34%.\"","\"Prepare during the bear market, prosper during the bull market,\" Bitmain said in the <a href=\"https:\/\/twitter.com\/BITMAINtech\/status\/1572210244595646470\" data-v-f87c67ca=\"\">announcement<\/a>.","One company that has recently been scooping up ASICs at discounted prices, CleanSpark, announced a <a href=\"https:\/\/www.theblock.co\/post\/168193\/bitcoin-miner-cleanspark-bought-10000-asics-at-a-significantly-discounted-price\" data-v-f87c67ca=\"\">bulk order of 10,000 S19j Pro machines<\/a> at a rate of roughly $28\/TH — stating also that that same model was sold at Bitmain's website for as much as $116\/TH. This would indicate a 75.9% decrease since the beginning of the year.","\"Decreasing hashprice and a lack of new capital coming into mining has put significant downward pressure on ASIC prices. They have affected both primary and secondary markets,\" Lin said. \"Bitmain’s reduction in pricing on S19 Pros is one part of this, and has led to decreasing prices of over 10% across the board for new-generation machines.\"","Going forward, Luxor expects there to be \"resistance lines\" in the mid- to high teens per TH, \"with strong buy walls at that level,\", said Lin.","Bitmain also said that customers that bought S19 Pro machines with scheduled deliveries in the third and fourth quarters of this year would be eligible for discount coupons.","A couple of other models are also included in this deal, namely S19 Pro Hyd and S19 Pro+ Hyd. Details of the coupon offer are laid out <a href=\"https:\/\/support.bitmain.com\/hc\/en-us\/articles\/10687719622681\" data-v-f87c67ca=\"\">here<\/a>.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Editor's Note: This story has been updated with comment from Luxor.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bitmain","content":"ORGANIZATION"},{"type":"Lin","content":"PERSON"},{"type":"Lauren Lin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$116","content":"MONEY"},{"type":"$28","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"34%","content":"PERCENT"},{"type":"Bitmain","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"$19","content":"MONEY"},{"type":"75.9%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"ASIC Trading Desk","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}