{"summary":"Zodia Custody, the crypto custody firm, today announced a new “network of networks” to link together different institutional crypto accounts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266456\/zodia-custody-launches-new-product-to-link-up-institutional-accounts","publishDate":"2023-12-07T03:07:22","id":14038,"type":null,"title":"Zodia Custody launches new product to link up institutional accounts","category":["COMPANIES"],"content":["Zodia Custody, the Standard Chartered-backed crypto custody firm, today announced a new “network of networks” to link together different institutional crypto accounts.","The product, named “Interchange Connect,” gives institutional investors a way to easily transfer crypto across different accounts held at the likes of Metaco, Fireblocks and Copper’s ClearLoop, while settling trades off-exchange.","It will be available for customers in the first quarter of 2024, and Zodia plans to bring more networks online in due course.","“As the ecosystem evolves at speed, we move faster to provide comprehensive and global solutions for institutions,” said James Harris, Chief Commercial Officer at Zodia Custody, in a statement.","“Interchange Connect massively opens up the possibilities for institutions by connecting our own bank-grade infrastructure and unique custodial solutions to others, ensuring that institutions gain additional secure, reliable and compliant end-to-end service capabilities.”","Products that support off-exchange settlement have generated some momentum following the failure of FTX, the platform founded by Sam Bankman-Fried, and other major crypto businesses last year. <a href=\"https:\/\/www.theblock.co\/post\/246181\/bitget-copper-clearloop\" data-v-f87c67ca=\"\">Bitget integrated Copper’s ClearLoop<\/a> to allow off-exchange trading and settlement in August, following the lead of Gate.io, which <a href=\"https:\/\/www.theblock.co\/post\/246181\/bitget-copper-clearloop\" data-v-f87c67ca=\"\">integrated with ClearLoop<\/a> earlier in the year.","“No one party will be solely able to evolve the infrastructure underpinning the digital asset ecosystem — but together, we can provide the tools and services to bring digital assets into the mainstream,” said Julian Sawyer (pictured above), CEO of Zodia Custody.","Zodia Custody was originally announced by Standard Chartered and Northern Trust, the asset servicing firm, in 2021.","In April, <a href=\"https:\/\/www.theblock.co\/post\/228573\/zodia-custody-standard-chartered-crypto-raise\" data-v-f87c67ca=\"\">the company raised $36 million<\/a>, while announcing plans to pursue international expansion. SC Ventures, the venture arm of Standard Chartered, and Japanese conglomerate SBI Holdings provided the bulk of the capital, alongside other unnamed investors.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the first quarter of 2024","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Standard Chartered and Northern Trust","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Zodia","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Zodia Custody","content":"LOCATION"},{"type":"Zodia Custody","content":"ORGANIZATION"},{"type":"Interchange Connect","content":"ORGANIZATION"},{"type":"SBI Holdings","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$36 million","content":"MONEY"},{"type":"James Harris","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Metaco","content":"LOCATION"},{"type":"Julian Sawyer","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}