{"summary":"An arbitrage trading bot used a $200 million flash loan to conduct a series of transactions, netting a profit of merely $3.24.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234595\/crypto-bot-borrows-200-million-in-a-flash-loan-to-secure-just-3-of-profit","publishDate":"2023-06-14T09:03:51","id":14040,"type":null,"title":"Crypto bot borrows $200 million in a flash loan to secure just $3 of profit","category":["CRYPTO ECOSYSTEMS"],"content":["An arbitrage bot executed a series of intricate transactions on Ethereum involving a $200 million flash loan, all to make a profit of just $3.24.","Flash loans facilitate uncollateralized lending, as long as the borrowed assets are repaid within the same transaction block. If the loan isn’t returned within the same block, it fails, leaving the network unchanged.","The arbitrage bot leveraged the flash loan, drawing a $200 million loan in DAI stablecoin from MakerDAO through the ‘DssFlash’ contract, Arkham Intelligence <a href=\"https:\/\/twitter.com\/arkhamintel\/status\/1668921478694469634\" data-v-f87c67ca=\"\">said<\/a> in a Twitter thread. This contract enables “zero-fee borrowing on any amount of DAI,” with a debt ceiling of up to $500 million.","Zachary Lerangis, Arkham’s head of operations, explained that these automated bots would execute any transaction that results in a profit, even if the net gain might be slim.","An arbitrage opportunity presents itself when there’s a price disparity for the same asset across different markets. Traders, or in this case, a bot, can capitalize on these differences to earn a profit.","After securing the flash loan, the bot employed it to deposit funds on Aave, a decentralized lending platform. It again borrowed a relatively small sum of $2,300 in Wrapped Ether (WETH) against the deposits, Arkham said. WETH, an ERC-20 token that can be used in smart contracts and is equivalent to Ethereum in price, was subsequently utilized to purchase Threshold Network (T) tokens on the Curve exchange.","Upon completing the arbitrage loop, the bot sold the Threshold Network tokens on the Balancer exchange, generating a gain of 0.019 ETH, approximately $33. However, transaction costs and a $1 fee to an Ethereum block builder significantly eroded the net gain, reducing it to just $3.24.","Despite the bot having access to a considerable sum of $200 million in DAI, it may not have fully leveraged the funds due to constraints such as liquidity limitations or the extent of the price disparity. If it borrowed only a modest sum of $2,300 in WETH from Aave, this could account for the small profit relative to the size of the flash loan.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$2,300","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Arkham Intelligence","content":"ORGANIZATION"},{"type":"Arkham","content":"ORGANIZATION"},{"type":"$3.24","content":"MONEY"},{"type":"$33","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Zachary Lerangis","content":"PERSON"},{"type":"$200 million","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"$1","content":"MONEY"}],"hashtag":["ASSETS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}