{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/17777\/private-equity-firm-ares-management-files-trademark-infringement-complaint-against-crypto-exchange-arescoin-2","publishDate":"2019-03-30T16:37:43","id":14045,"type":null,"title":"Private equity firm Ares management files trademark infringement complaint against crypto exchange ARESCOIN","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\". This week’s guest post by Susan Joseph is “SJ”","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Ares Management LLC v. Starlight Capital Group, Inc., et al., Case No. Civ-1:19-cv-00894-RBJ (D. Colo. March 25, 2019) [NMR]<br data-v-f87c67ca=\"\">\n<\/strong><\/em>","What do you think of when you think about the most valuable companies in the world? Chances are you think about their brand. The distinctive imagery surrounding that company that is often evoked by the company’s logo and\/or name. Companies invest a considerable amount of resources into brand development. One way that they protect that brand is through filing trademarks. Once a company receives a trademark they then have a duty to enforce it if they think people are misusing the mark in some fashion. This newly filed complaint deals with this exact issue. An established financial services firm is suing a blockchain startup for trademark infringement, unfair competition, and other matters.","Plaintiff, Ares Management LLC is a global asset manager that claims to have $131 billion of assets under management. Ares claims to have used the mark and trade name ARES since at least 1997 for their financial services and product offerings. In addition, they also claim to have at least 105 famous marks (whether a mark is considering famous is dependent on a variety of factors related to public perception of the mark) around the world that make use of the Ares name. The defendants run Starlight Capital Group, a crypto startup that is allegedly launching a crypto exchange, ARESCOIN, as well as a couple of other offerings that have the name Ares in them. The plaintiff alleges Starlight is also the owner of several websites that utilize the name Ares in the domain name.","One of the key points in a trademark infringement dispute is whether someone is using your mark “in connection with goods and\/or services in a manner that is likely to cause confusion, deception, or mistake about the source of the goods and\/or services.” So, if the average person would be confused about the source of the goods\/services.","Why would someone be confused about the source of goods and services? Well, for example, if two names or logos look similar, that might cause confusion. This is largely the approach the plaintiff has taken here. To bolster their argument they included some screenshots. Actually, they included a ton of screenshots from the company website, as well as Facebook, Medium, Steem, Twitter, YouTube, Reddit, Vimeo, and a screenshot from each website named in the complaint. The crux of the issue is that Ares alleges Starlight Capital not only used their name, but also the same font, and color scheme in their ARESCOIN logo.","This is the beginning of this lawsuit, and there are some outstanding issues in the complaint such as the actual location of the sole named human defendant, Nicholas Flint, who is listed as a founder of the project. Starlight Capital has some time to respond to the complaint and attempt to mount a defense against the trademark issues raised; however, fair use arguments or First Amendment arguments probably won’t apply. It will be interesting to see their response.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Nicholas Flint","content":"PERSON"},{"type":"Reddit","content":"LOCATION"},{"type":"Starlight","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"1997","content":"DATE"},{"type":"Starlight Capital Group","content":"ORGANIZATION"},{"type":"March 25, 2019","content":"DATE"},{"type":"D. Colo","content":"ORGANIZATION"},{"type":"SDP","content":"ORGANIZATION"},{"type":"$131 billion","content":"MONEY"},{"type":"Starlight Capital Group, Inc.","content":"ORGANIZATION"},{"type":"Palley","content":"PERSON"},{"type":"Vimeo","content":"LOCATION"},{"type":"Susan Joseph","content":"PERSON"},{"type":"Steem","content":"PERSON"},{"type":"Ares Management LLC","content":"ORGANIZATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"}],"hashtag":[],"authors":["Nelson Rosario","The Block"]}