{"summary":"Terraform Labs CEO Do Kwon has set out his plan of action to help the stablecoin TerraUSD (UST) return to its dollar peg.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/146254\/terraform-labs-ceo-do-kwon-unveils-plan-to-restore-ust-peg","publishDate":"2022-05-11T06:28:03","id":14049,"type":null,"title":"Terraform Labs CEO Do Kwon unveils plan to restore UST peg","category":["CRYPTOCURRENCY"],"content":["Terraform Labs CEO Do Kwon has set out his plan of action to help the stablecoin TerraUSD (UST) return to its dollar peg.","In a <a href=\"https:\/\/twitter.com\/stablekwon\/status\/1524331171189956609\" data-v-f87c67ca=\"\">tweet thread<\/a> on Wednesday, he acknowledged that the last 72 hours have been extremely tough for the Terra community and that he hopes he can help it to survive.","Kwon recognized that the amount of capital trying to exit UST has resulted in a lot of selling of Luna, due to how the stablecoin mechanics work. This has resulted in a large price drop for Luna, which is <a href=\"https:\/\/www.theblockcrypto.com\/post\/146225\/luna-price-collapses-below-5-as-ust-slides-further-from-dollar-peg\" data-v-f87c67ca=\"\">down 85% today<\/a>.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Before anything else, the only path forward will be to absorb the stablecoin supply that wants to exit before <\/span><span class=\"r-18u37iz\" data-v-f87c67ca=\"\">UST<\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\"> can start to repeg. There is no way around it,\" he said on Twitter.<\/span>","To begin with, he is endorsing a community proposal that will increase the amount of Luna being minted per day by four times. This would enable more UST holders to cash out.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Naturally, this is at a high cost to UST and LUNA holders, but we will continue to explore various options to bring in more exogenous capital to the ecosystem &amp; reduce supply overhang on UST,\" he said.<\/span>","Going forward, he said the stablecoin will be redesigned to be collateralized.","The proposal to increase minting of Luna was <a href=\"https:\/\/agora.terra.money\/t\/proposal-help-ust-pegging-increase-estimated-minting-capacity-to-1200m\/6287\" data-v-f87c67ca=\"\">put forward<\/a> on Terra's governance forum. So far 80 million Luna has <a href=\"https:\/\/station.terra.money\/proposal\/1164\" data-v-f87c67ca=\"\">voted in favor<\/a> of it with not a single Luna being used to vote against. The vote will pass if it meets 40% of staked Luna, or roughly 114 million tokens.","If adopted, this will allow traders to sell UST for Luna at a faster rate. Currently only so much UST can be sold per day, and the proposal states that this is causing Luna to be minted at a worse price, resulting in excess minting of UST.","By increasing the amount of UST that can be swapped for Luna, it will increase the rate that investors can exit their UST positions through Luna. The theory is that while this might increase the amount of Luna minted in the short term, it might decrease it over a longer period of time and help to restore the peg to the dollar.","\"Allow more efficient UST burning and LUNA minting, will in the short term put pressure to LUNA price, but will be an effective way to bring UST back to peg, which will eventually stabilize LUNA price,\" the proposal stated.","The proposal, however, acknowledged that this could have a negative impact on the price of Luna — which is already down 86% today.","\"Yes, billion of UST will be burned, and LUNA will be diluted significantly. Nevertheless, there are no limit in LUNA supply, this market mechanism will actually work to bring stable UST and stable LUNA price (although likely at lower price point for LUNA),\" it stated.","Luna’s price has fallen from $4.10 to $2.20 since Kwon’s tweets, while UST’s has dropped from $0.50 to $0.41.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/t.me\/the_block_crypto\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","<em data-v-f87c67ca=\"\">This article has been updated with a detailed look at the new proposal.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"Kwon","content":"PERSON"},{"type":"$4.10","content":"MONEY"},{"type":"86%","content":"PERCENT"},{"type":"$2.20","content":"MONEY"},{"type":"$0.50","content":"MONEY"},{"type":"85%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"LUNA","content":"ORGANIZATION"},{"type":"Luna","content":"ORGANIZATION"},{"type":"$0.41","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["CRYPTO","DO KWON"],"authors":["Tim Copeland","The Block"]}