{"summary":"Singapore’s crypto crackdown may move towards limiting retail participation and reducing leverage limits for margin trading.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/155727\/singapore-regulators-mulling-more-restrictive-crypto-policies","publishDate":"2022-07-04T10:16:44","id":14053,"type":null,"title":"Singapore regulators mulling more restrictive crypto policies","category":["POLICY"],"content":["The Monetary Authority of Singapore (MAS) says it is considering more restrictive crypto regulations, the financial regulator stated in a <a href=\"https:\/\/www.mas.gov.sg\/news\/parliamentary-replies\/2022\/reply-to-parliamentary-question-on-restrictions-on-cryptocurrency-trading-platforms-to-protect-members-of-public\" data-v-f87c67ca=\"\">letter<\/a> to the country’s parliament dated July 4.","According to Tharman Shanmugaratnam, senior minister and minister in charge of MAS, the regulator is considering measures that will offer more protection to retail participants in the crypto market.","“These may include placing limits on retail participation, and rules on the use of leverage when transacting in cryptocurrencies,” the letter stated.","The letter signals the MAS plans to further its policy of strict crypto market oversight. The regulator <a href=\"https:\/\/www.theblock.co\/linked\/130457\/singapore-curbs-crypto-marketing-in-digital-asset-crackdown\" data-v-f87c67ca=\"\">cracked down<\/a> on crypto marketing campaigns at the start of the year and has enacted a licensing regime for cryptocurrency businesses in the country.","MAS has previously stated its desire to deal with bad actors in the crypto space, as previously <a href=\"https:\/\/www.theblock.co\/post\/153719\/singapore-regulator-brutal-crypto-bad-behavior-ft\" data-v-f87c67ca=\"\">reported by The Block<\/a>. Singapore’s financial regulator recently <a href=\"https:\/\/www.theblock.co\/post\/155048\/singapore-authorities-reprimand-three-arrows-capital-for-providing-false-information\" data-v-f87c67ca=\"\">reprimanded Three Arrows Capital<\/a>, accusing the embattled hedge fund of misrepresenting its asset holdings to the regulatory agency.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tharman Shanmugaratnam","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"July 4","content":"DATE"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"MAS","content":"ORGANIZATION"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}