{"summary":"The hard fork will focus on implementing the security enhancements proposed in BEP-171, which aim to improve the network&#x27;s cross-chain bridge.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224991\/bnb-chain-planck-hard-fork","publishDate":"2023-04-05T08:19:32","id":14051,"type":null,"title":"BNB Chain prepares for Planck hard fork to enhance cross-chain security","category":["CRYPTO ECOSYSTEMS"],"content":["BNB Chain is set to undergo a hard fork upgrade called Planck at block height 27,281,024 — currently slated for April 12. This upgrade will introduce enhanced security and improved stability to the network, the core team said.","The hard fork is designed to implement security enhancements proposed in <a href=\"https:\/\/github.com\/bnb-chain\/BEPs\/blob\/master\/BEP171.md?ref=binance.ghost.io\" data-v-f87c67ca=\"\">BEP-171<\/a>. This proposal aims to strengthen the cross-chain bridge between the two blockchains that form part of the BNB Chain network — namely, the Beacon Chain and Smart Chain. Through the upgrade, BNB Chain hopes to improve its blockchain network's security, efficiency, and interoperability.","In late 2022, BNB Chain fell victim to a <a href=\"https:\/\/www.theblock.co\/post\/176511\/bnb-chain-executes-hard-fork-to-secure-network-after-100-million-hack\" data-v-f87c67ca=\"\">major hack<\/a>&nbsp;— which was traced back to a flaw in the IAVL proof verification mechanism. This security mechanism safeguards the cross-chain bridge, allowing users to transfer assets between BNB Smart Chain, BNB Beacon Chain and other networks.","The upcoming Planck upgrade will involve a migration from the vulnerable IAVL proof verification to the more-secure bridge security mechanism, called <a href=\"https:\/\/github.com\/cosmos\/ibc\/tree\/main\/spec\/core\/ics-023-vector-commitments?ref=binance.ghost.io\" data-v-f87c67ca=\"\">ICS23 specification<\/a>. Additionally, the upgrade will introduce a timer-lock mechanism for large cross-chain fund transfers, as well as the automatic pausing of cross-chain channels in the event of forged proof detection or during emergencies, such as reported hacks. These measures aim to bolster the security of the BNB Chain network and better protect user funds against potential attacks.","To ensure a smooth transition to the upcoming Planck upgrade, the BNB Chain core team has called on all stakeholders to prepare accordingly. In particular, full node operators have been told to download and compile the latest software, version v1.1.21, to enable the hard fork.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"BNB","content":"ORGANIZATION"},{"type":"BEP","content":"LOCATION"},{"type":"BNB Beacon Chain","content":"ORGANIZATION"},{"type":"Planck","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"April 12","content":"DATE"},{"type":"BNB Smart Chain","content":"ORGANIZATION"}],"hashtag":["BNB CHAIN"],"authors":["Vishal Chawla","The Block"]}