{"summary":"Crypto.com reportedly pulled out of a five-year sponsorship deal with the Uefa Champions League.\nThe deal would have been worth just over $100 million annually. ","author":["Lucy Harley-McKeown","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/166989\/crypto-com-pulls-out-of-uefa-champions-league-deal","publishDate":"2022-09-01T06:04:45","id":1405,"type":null,"title":"Crypto.com pulls out of Uefa Champions League deal at 11th hour: Sport Business","category":["Exchanges"],"content":["Exchange giant Crypto.com has reportedly pulled out of a sponsorship deal to plaster its name on the Uefa's Champions League soccer tournament.&nbsp;","Valued at just over $100 million per year, the contract had been under discussion but never signed, according to a report by <a href=\"https:\/\/www.sportbusiness.com\/news\/exclusive-crypto-com-pulled-out-of-huge-champions-league-sponsorship-at-last-moment\/\" data-v-f87c67ca=\"\">Sport Business<\/a> published on Wednesday.","The Block has contacted Crypto.com for comment but has not heard back before press time.&nbsp;","The move follows the exchange's official approval as an official Fifa World Cup sponsor <a href=\"https:\/\/www.theblock.co\/linked\/138842\/crypto-com-picked-as-an-official-fifa-world-cup-sponsor\" data-v-f87c67ca=\"\">in March<\/a>, and several other audacious marketing plays in the world of sport.","Last year, the Singapore-based company&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/linked\/128244\/crypto-com-strikes-multi-year-deal-with-las-angel-city-football-club\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">sponsored the Angel City Football Club<\/a>, a Los Angeles-based women's soccer team, as a founding partner. It also became&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/110655\/crypto-com-ufc-fight-kit-partner\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">UFC's official global \"fight kit\" partner<\/a>, meaning its logo will be featured in UFC apparel worn by athletes in competitions. And, perhaps most notably, Crypto.com inked&nbsp;<a href=\"https:\/\/www.theblockcrypto.com\/post\/124583\/crypto-com-spending-700-million-cash-rename-staples-center-los-angeles\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a $700 million deal<\/a> to change the name of the Staples Center in Los Angeles to the Crypto.com Arena.","Understandably, there has been hesitation to fork out big sums in a crypto bear market for expenses such as sports marketing deals.&nbsp;","\"Crypto companies are evaluating the return on their sponsorship packages right now,\" Sunny Singh, CEO of media partnerships agency Van Hawke, told The Block. \"Fees being paid by crypto have been over and above market rate.\"","Singh added that several other sports marketing deals involving crypto that had been in the offing have now been put on hold."],"hashtag":[]}