{"summary":"Blockchain analytics will help Robinhood give users the option to withdraw cryptocurrency from the mobile investing app.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127186\/robinhood-onboards-chainalysis-in-preparation-for-crypto-wallet-launch","publishDate":"2021-12-13T04:00:39","id":14057,"type":null,"title":"Robinhood onboards Chainalysis in preparation for crypto wallet launch","category":["EXCHANGES"],"content":["In preparation for its crypto wallet rollout, Robinhood is integrating analytics tools from leading crypto intelligence firm Chainalysis, according to an announcement shared with The Block.","Currently, Robinhood offers users exposure to the price movements of various cryptocurrencies on its brokerage app, which also offers more traditional stock trading. However, users cannot withdraw or deposit crypto off-platform.&nbsp;","In September, Robinhood <a href=\"https:\/\/www.theblockcrypto.com\/post\/118271\/robinhood-rolling-out-crypto-wallet-transfer-features\" data-v-f87c67ca=\"\">announced plans to change this<\/a> and allow users to move tokens as they would be able to on a crypto exchange like Coinbase or Kraken. That is primarily a regulatory challenge, as the expectations for such a widely used platform to protect against money laundering are quite high.&nbsp;","“The executive team has spent significant resources and capital to embed that principle into every level of the organization,\" Ben Einstein, Robinhood Crypto's head of partnerships, said in a statement. \"Chainalysis works closely with regulators and law enforcement to develop industry best practices and that approach is aligned with Robinhood’s commitment to working with policymakers in a collaborative manner.”","Specifically, Robinhood will be using Chainalysis KYT and Chainalysis Reactor. The former flags risky transactions in real time, noting wallet addresses that have previously been associated with illicit activity. The latter visualizes chains of transactions, which is handy for due diligence checks.&nbsp;","It was only on December 9 that Robinhood Crypto <a href=\"https:\/\/twitter.com\/christine_hall\/status\/1468667465773297668\" data-v-f87c67ca=\"\">announced<\/a> the conclusion of the alpha program for its crypto wallets. Starting in January, it will be onboarding users to beta testing, for which the firm says that 1.6 million users are on a waitlist.&nbsp;","Despite interest in its coming crypto wallets, Robinhood has faced a rough time in the markets. Shares in HOOD priced at $34 upon its initial public offering in July, promptly peaking at $80. As of the end of trading on Friday, December 10, its shares had slipped below $22.&nbsp;","<em data-v-f87c67ca=\"\">Source: <a href=\"https:\/\/www.nasdaq.com\/market-activity\/stocks\/hood\" data-v-f87c67ca=\"\">NASDAQ<\/a><\/em>","Chainalysis is one of the oldest firms working on blockchain analytics and is in many ways the go-to contractor for government agencies in the US looking to investigate cryptocurrency transactions.","As that has become a larger mission over time and especially since the surge in high-profile ransomware attacks at the beginning of this year, <a href=\"https:\/\/www.theblockcrypto.com\/news+\/109700\/ransomware-attacks-crypto-analytics-firms-fundraising\" data-v-f87c67ca=\"\">analytics firms have seen a surge in funding<\/a>. Chainalysis, in particular, has benefitted, closing a funding round this summer that <a href=\"https:\/\/www.theblockcrypto.com\/linked\/109515\/chainalysis-valuation-hits-4-2-billion-after-100-million-series-e-fundraise\" data-v-f87c67ca=\"\">valued the firm at over $4 billion<\/a>.&nbsp;","Alongside the rash of fundraises at more established blockchain investigators, a number of new players have entered into the market.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Robinhood Crypto","content":"ORGANIZATION"},{"type":"December 10","content":"DATE"},{"type":"$34","content":"MONEY"},{"type":"$4 billion","content":"MONEY"},{"type":"$22","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"NASDAQ","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"December 9","content":"DATE"},{"type":"September","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Ben Einstein","content":"PERSON"},{"type":"$80","content":"MONEY"}],"hashtag":["ROBINHOOD"],"authors":["Kollen Post","The Block"]}