{"summary":"BlackRock, VanEck have filed amended S-1 forms for their respective spot bitcoin ETF applications to address final comments from the SEC.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271203\/blackrock-vaneck-hand-in-amended-s-1-forms-for-spot-bitcoin-etfs-to-address-final-comments","publishDate":"2024-01-09T07:01:10","id":14056,"type":null,"title":"BlackRock, VanEck hand in amended S-1 forms for spot bitcoin ETFs to address final comments","category":["COMPANIES"],"content":["BlackRock and VanEck have filed amended S-1 forms for their respective spot bitcoin ETF applications to address final comments from the Securities and Exchange Commission.","The SEC sent comments to some of the prospective issuers yesterday after they filed their latest forms, <a href=\"https:\/\/www.coindesk.com\/policy\/2024\/01\/09\/sec-hustles-to-answer-latest-bitcoin-etf-filings-source\/?_gl=1*g69i8p*_up*MQ..*_ga*MzMzMTQ5NDA5LjE3MDQ4MDA3OTI.*_ga_VM3STRYVN8*MTcwNDgwMDc5MS4xLjEuMTcwNDgwMDkyNi4wLjAuMA..\" data-v-f87c67ca=\"\">according to CoinDesk<\/a> citing a source. These comments were focused on minor details and were not expected to delay the applications.","The forms filed today show minor changes, including language on what happens if an authorized participant or bitcoin trading counterparty suffers insolvency and highlights that there could be potential conflicts of interest. They also included some warnings for potential investors of cases where there could be impaired liquidity.","Bloomberg ETF analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1744690137550799015\" data-v-f87c67ca=\"\">noted on X<\/a> that the 24 turnaround time between the filing, comments and re-filings show that all parties involved are \"<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">aiming to get this show on [the] road pronto.<\/span>\"","The amended S-1 forms filed on Monday also <a href=\"https:\/\/www.theblock.co\/post\/270834\/spot-bitcoin-etf-applicants-file-amended-s-1-forms-in-final-step-toward-approval\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">provided final details<\/a> regarding <a href=\"https:\/\/www.theblock.co\/post\/270851\/bitcoin-spot-etf-fees-race-to-the-bottom\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">respective fee structures<\/a>. Multiple providers are offering zero fees for a limited amount of time, with Bitwise offering the lowest fixed fee of 0.24%. Ark\/21Shares is right behind it at 0.25%, and BlackRock is not far off at 0.3%.","Going ahead, these issuers are waiting on the SEC to approve their 19b-4 forms and for their S-1 filings to go into effect. Once both of these have taken place, trading will be able to start the following day.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Bloomberg ETF","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"0.25%","content":"PERCENT"},{"type":"0.24%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"0.3%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Eric Balchunas","content":"PERSON"}],"hashtag":["BITCOIN","SPOT BITCOIN ETF"],"authors":["Tim Copeland","The Block"]}