{"summary":"Blockstream is set to launch a second series of the Blockstream ASIC (BASIC) Note, following oversubscription.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/267418\/blockstream-to-launch-series-2-of-bitcoin-denominated-investment-vehicle","publishDate":"2023-12-13T09:16:17","id":14050,"type":null,"title":"Blockstream to launch series 2 of Bitcoin-denominated investment vehicle","category":["COMPANIES"],"content":["Bitcoin infrastructure firm Blockstream is set to launch Series 2 of its bitcoin-denominated investment vehicle, the Blockstream ASIC (BASIC) Note, following Series 1 oversubscription.","The Series 1 Note, which launched in September, closed above its $5 million target, Blockstream stated. Series 2, in collaboration with the Luxembourg-based digital securities platform Stokr, targets qualified non-U.S. investors aiming to capitalize on historically low prices for Bitcoin mining hardware, or Application-Specific Integrated Circuits (ASICs). Blockstream did not disclose the target for the second series.","The response to Series 1 highlighted a growing interest in Bitcoin-centric investments, according to Dr. Adam Back, CEO and co-founder of Blockstream.","“With Series 2, we aim to capitalize on this momentum, offering non-US investors a strategic entry point into the Bitcoin ASIC market through a bitcoin-basis product. Our focus on efficient miner acquisition and strong industry relationships positions us uniquely for the upcoming 2024 halving and beyond,\" Back said.","A total of $4.88 million from Series 1 was allocated to the acquisition of high-efficiency Antminer S19k Pro ASIC miners, leveraging its relationship with wholesale distributor Sunnyside Digital to secure bulk discounts. The remainder of the funds were retained to cover costs.","The period following the purchase of these miners saw a 9.25% increase in ASIC quotes, influenced by the appreciation in bitcoin prices, with bitcoin-denominated ASIC pricing still approximately 6.6 times lower than in January, Blockstream stated.","Each series issues a unique set of BASIC Notes via the Liquid Network — a sidechain protocol built on top of the Bitcoin blockchain, created by Blockstream. The BSIC1 token is also available for peer-to-peer swaps via SideSwap — a settlement infrastructure client of the Liquid Network.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Blockstream","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"9.25%","content":"PERCENT"},{"type":"Sunnyside Digital","content":"ORGANIZATION"},{"type":"$4.88 million","content":"MONEY"},{"type":"Adam Back","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"$5 million","content":"MONEY"},{"type":"Luxembourg","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["BITCOIN","INVESTMENT FIRMS","MINING COMPANIES"],"authors":["James Hunt","The Block"]}