{"summary":"Decentralized crypto derivatives exchange dYdX has released a beta version of its iOS mobile app, promising a better user experience.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136992\/dydx-ios-mobile-app-beta-launch","publishDate":"2022-03-09T11:00:19","id":14060,"type":null,"title":"dYdX launches beta iOS app for limited users","category":["THE BLOCK"],"content":["Decentralized crypto derivatives exchange dYdX has released a beta version of its iOS mobile app.","Sharing the news exclusively with The Block on Wednesday, dYdX said the app is currently available to 10,000 users that meet specific criteria.","There are two open waitlists that describe such criteria: the priority waitlist and the referral waitlist. The former requires users to hold at least 10 DYDX or stkDYDX tokens or at least one Hedgie, a collection of 4,200 NFTs that was recently distributed by dYdX to its community. They also have to do a trading volume of at least $1,000 after 4pm UTC on March 9 to qualify. The priority waitlist is open until March 23.","To access the referral waitlist, users will have to sign up for the beta app and share their link on social media platforms to earn points. They will earn one point for signing up, another for sharing on social media, and three points for each successful referral. In a classical startup growth hack, the more points they rack up, the higher they'll rank on the waitlist.","dYdX said it is one of the first DeFi platforms to launch a mobile app. The idea is to give users an experience on par with centralized exchanges, dYdX founder Antonio Juliano told The Block.","\"The app experience has a much better UI\/UX than interacting via a mobile browser, as it is native to the device,\" said Juliano. \"Once you connect, you will also have the ability for the app to 'remember' your info and not have to go through the connection steps again.\"","Users will be able to directly connect their crypto wallets to the dYdX mobile app and start trading. Since it is a beta app, users may run into some bugs, but the general security of the app is equivalent dYdX's main desktop app, said Juliano.","The general public launch of the dYdX iOS app is expected by the end of next month, said Juliano. The exchange also plans to release an Android app in the future, but it currently doesn’t have a set timeline.","dYdX is one of only a few DeFi protocols to offer a mobile app, joining 1inch, which <a href=\"https:\/\/www.theblockcrypto.com\/linked\/102979\/dex-aggregator-1inch-launches-wallet-app-for-ios-users\" data-v-f87c67ca=\"\">launched<\/a> its iOS app last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Antonio Juliano","content":"PERSON"},{"type":"Juliano","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Hedgie","content":"ORGANIZATION"},{"type":"March 9","content":"DATE"},{"type":"$1,000","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 23","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}