{"summary":"Together with UBS, BOCI became the first Chinese financial institution to issue a tokenized security in Hong Kong.\nIt was tokenized on Ethereum.","author":["Adam James","MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/234241\/bank-of-china-boci-tokenized-security-ethereum","publishDate":"2023-06-12T09:49:25","id":1406,"type":null,"title":"BOCI issues first tokenized security in Hong Kong on Ethereum","category":["Finance firms"],"content":["Bank of China investment bank BOCI issued fully digital structured notes worth 200 million of offshore renminbi ($28 million)&nbsp;on the Ethereum blockchain, making it the first Chinese financial institution to <a href=\"https:\/\/www.ubs.com\/global\/en\/media\/display-page-ndp\/en-20230609-tokenized-notes.html?caasID=CAAS-ActivityStream\" data-v-f87c67ca=\"\">issue<\/a> a tokenized security in Hong Kong.","\"This transaction marks the first product of its kind in Asia Pacific constituted under Hong Kong and Swiss law and tokenized on the main Ethereum blockchain, successfully introducing regulated securities onto a public blockchain,\" UBS, the originator and BOCI's partner, said in a <a href=\"https:\/\/www.ubs.com\/global\/en\/media\/display-page-ndp\/en-20230609-tokenized-notes.html?caasID=CAAS-ActivityStream\" data-v-f87c67ca=\"\">statement<\/a>.&nbsp;","The issuance comes after UBS issued a $50 million tokenized fixed rate note in December on a permissioned blockchain under English and Swiss law.","\"We are driving the simplification of digital asset markets and products, for customers in Asia Pacific through the development of blockchain-based digital structured products, designed specifically for customers in Asia Pacific,\" Ying Wang, Deputy CEO at BOCI, said in the statement. \"We are encouraged by the evolution of Hong Kong's digital economy and are committed to promoting the digital transformation and innovative development of Hong Kong's financial industry.”","The move comes amid a flurry of activity in Hong Kong after it <a class=\"c-link\" href=\"https:\/\/www.theblock.co\/post\/232404\/beijing-web3-white-paper\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/232404\/beijing-web3-white-paper\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">released<\/a> new guidelines for the crypto industry on June 1. First Digital said <a href=\"https:\/\/www.theblock.co\/post\/232791\/hong-kong-based-first-digital-introduces-usd-stablecoin\" data-v-f87c67ca=\"\">earlier this month<\/a> that it is introducing a new stablecoin that will be pegged to the U.S. dollar but regulated in Asia.","China, meanwhile, has been the subject of much speculation about its crypto plans after it released a white paper for web3 innovation and development <a href=\"https:\/\/www.theblock.co\/post\/232404\/beijing-web3-white-paper\" data-v-f87c67ca=\"\">last month<\/a>. Binance CEO Changpeng \"CZ\" Zhao said that Chinese-speaking communities had been \"<a href=\"https:\/\/www.theblock.co\/post\/232027\/binance-cz-says-china-is-buzzing-after-bitcoin-tv-segment\" data-v-f87c67ca=\"\">buzzing<\/a>\" after state broadcaster China Central Television appeared to broadcast a segment about cryptocurrencies that featured the Bitcoin logo.","(<em data-v-f87c67ca=\"\">Updates with additional comment in fourth paragraph.<\/em>)","&nbsp;"],"hashtag":["ETHEREUM","FINTECH","TRADFI BANKS"]}