{"summary":"A surprise million-dollar mint created a bizarre, inverted crypto gaming concept. Here’s what&#x27;s going on with Loot and derivatives.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/116746\/cryptos-latest-trend-is-to-play-games-before-theyre-even-built","publishDate":"2021-09-06T12:45:54","id":1407,"type":null,"title":"Crypto’s latest trend is to play games before they’re even built","category":["GAMING AND METAVERSE"],"content":["Crypto gaming has taken a strange turn.","The new trend in town is to create characters, take them on adventures and level them up, as well as purchase in-game items and other traits — all for games that don’t even exist yet.","And here’s the second catch. Those offering the items have no plans to build the game. It’s entirely down to the community to do all the heavy lifting. And yet, without any guarantees of any future utility at all, these items and artifacts are selling for millions.","It all started with a thing called Loot.","On August 27, Vine co-founder Dom Hofmann <a href=\"https:\/\/twitter.com\/dhof\/status\/1431277410377506819\" data-v-f87c67ca=\"\">tweeted<\/a> that he would be, “dropping a weird experiment in a little bit” having previously teased the project, <a href=\"https:\/\/twitter.com\/dhof\/status\/1430529561729683458\" data-v-f87c67ca=\"\">describing<\/a> it as “dungeons &amp; degens.” A few hours later, he announced Loot, <a href=\"https:\/\/twitter.com\/dhof\/status\/1431316631934967815\" data-v-f87c67ca=\"\">describing<\/a> it as “randomized adventurer gear” and stating that there were only 6,000 bags.","He provided a link to an Ethereum contract. Members of the crypto community used this contract to create the bags and send them to themselves. It was free to claim the bags but you had to pay transaction fees. The 6,000 bags were snapped up in less than four hours.&nbsp;","Each bag contains 8 items for a supposed adventurer, a few wearables and a weapon. They’re all named like any mythological game, with such items as a “Dragonskin Armor” or a “Platinum Ring of Anger.”","But these are not real bags, or even digital ones. They are simply white text on a black background, saved as images and minted as non-fungible tokens, or NFTs. They look like this:","<span data-v-f87c67ca=\"\">Bag #2088, which last sold for 14 ETH ($54,600). Source: OpenSea.<\/span>","The wacky idea is that game developers can build a game or multiple games around these collectibles, assigning items that match the attributes in the bags. So anyone who owns the bags may be able to access such items within these yet-to-be-created games.","“Loot is the unfiltered, uncensorable building block for stories, experiences, games, and more, in the hands of the community, at no cost,” its website describes.","And despite the lack of any secure future, these bags have become incredibly valuable. Currently the cheapest price for any Loot is 12.4 ETH ($48,360) while the highest sale yet was for just shy of $1 million — for a single bag.","The crypto community has already started experimenting with these bags. A computer graphics designer has <a href=\"https:\/\/twitter.com\/dhof\/status\/1433161836665389061\" data-v-f87c67ca=\"\">already created<\/a> a set of AI-generated images representing the items in each bag. Holders of synthetic Loot can see a <a href=\"https:\/\/twitter.com\/stephancill\/status\/1433800337639489536\" data-v-f87c67ca=\"\">visual representation<\/a> of their character. Plus there are already decentralized autonomous organizations (DAOs) for Loot owners, depending on which type of items they own, and a <a href=\"https:\/\/twitter.com\/lootproject\/status\/1432793428614684674\" data-v-f87c67ca=\"\">host of other services<\/a> being built.","While the infrastructure is being built out — whether it turns into a fully fledged game or just multiple trading venues — Loot has spawned a range of similar projects and airdrops.","With the barrier to entry as low as thinking up a few thousand names and a bit of blockchain know-how, it’s no surprise that a host of projects tried to recreate Loot’s success — and ride on its coattails.","There are versions of Loot based around different types of settlements — for any game that wants to show cities throughout the ages — as well as Loot for Cyberpunks, with items like the “Gauntlet of Nightcity.” Plus there’s Bloot, a NSFW [Not Safe For Work] version aimed at the crypto crowd with one safer attribute called the “Pixelated band of WAGMI” — an acronym of “We’re all gonna make it.”","And there have been a lot of airdrops to such Loot (and other) holders. Any Loot holder can claim a randomly generated <a href=\"https:\/\/twitter.com\/boredGenius\/status\/1433587853833826304\" data-v-f87c67ca=\"\">Name NFT<\/a> for their character. Bloot holders each received 10,000 based gold (BGLD) tokens, a sum worth around $8,300.&nbsp;","Inspired by Loot, Yearn.Finance founder Andre Cronje has created the core of a game called Rarity. But he has taken it one step further than naming a bunch of items.","Instead, he’s created the fundamentals of the game, on the Fantom blockchain — where fees are relatively cheap. To create a warrior, you interact with the contract address (or use this <a href=\"https:\/\/rarity-visualizer-ui.vercel.app\/\" data-v-f87c67ca=\"\">handy website<\/a> txxnano built) and receive a token. That token represents the warrior you picked, whether that’s a Druid, Monk or Sorcerer.","<span data-v-f87c67ca=\"\">A first version of a community-built way of interacting with the game. Source: txxnano.<br data-v-f87c67ca=\"\">\n<\/span>","Then you can essentially play the game but in a rather boring way (until someone builds a UI for the whole thing). Every day, you can go back to the contract and interact with it in a way that’s called “going on an adventure.” You can only do this once per day. Each time you do this, it levels up your warrior.&nbsp;","And, although some of this is still in development, the idea is that you can then start doing things like crafting potions or choosing which skills to develop. And at level 2 you can start claiming the in-game currency called Rarity Gold.&nbsp;","Now all this is akin to playing a game like World of Warcraft, if you were to just press “complete level” instead of actually playing the game. But again, it needs someone to actually build the game at some point — otherwise all this levelling up will be for nothing.","Cronje told The Block that he doesn't have a vision for the game, he just \"codified the ruleset, spells, feats, crafting, adventuring, etc.\"","\"What people do with that, is up to them,\" he added. \"I'll create the world for them, but they should adventure.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$48,360","content":"MONEY"},{"type":"2088","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Vine","content":"ORGANIZATION"},{"type":"$8,300","content":"MONEY"},{"type":"$54,600","content":"MONEY"},{"type":"August 27","content":"DATE"},{"type":"“Gauntlet of Nightcity","content":"ORGANIZATION"},{"type":"Fantom","content":"LOCATION"},{"type":"Rarity Gold","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Dom Hofmann","content":"PERSON"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Name NFT","content":"ORGANIZATION"},{"type":"Druid","content":"LOCATION"},{"type":"Cronje","content":"PERSON"}],"hashtag":["CRYPTO"],"authors":["Tim Copeland","The Block"]}