{"summary":"MicroStrategy&#x27;s strategy for holding bitcoin long term will not change following a leadership reshuffle, the company&#x27;s incoming CEO said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/161083\/microstrategy-holds-the-course-on-bitcoin-strategy-despite-change-in-leadership","publishDate":"2022-08-02T18:32:07","id":14074,"type":null,"title":"MicroStrategy holds the course on bitcoin strategy despite change in leadership","category":["EARNINGS"],"content":["Michael Saylor <a href=\"https:\/\/www.theblock.co\/post\/161025\/michael-saylor-to-step-down-as-microstrategy-ceo-shift-to-executive-chairman-role\" data-v-f87c67ca=\"\">is stepping down as CEO of MicroStrategy<\/a> on August 8, but the firm says its outlook on bitcoin will not change — despite huge losses related to digital assets in the second quarter.","The software company revealed impairment charges relating to bitcoin of $918 million for the second quarter of 2022, following losses of $425 million in the first quarter. The firm's revenue decreased 2.6% compared with the second quarter of 2022.","<a href=\"https:\/\/www.microstrategy.com\/content\/dam\/website-assets\/collateral\/financial-documents\/events-presentations\/Q2-2022_microstrategy-earnings-presentation.pdf\" data-v-f87c67ca=\"\">MicroStrategy<\/a>","Incoming CEO Phong Le said the firm's plans to hold bitcoin long term will not change.","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Saylor will continue to chair the firm’s investment committee, he said on Tuesday's earnings call, while also increasing his advocacy efforts for bitcoin. Saylor told analysts the reshuffling of roles was a win for everyone involved.<\/span>","In an attempt to preempt questions on bitcoin's price dropping, Chief Financial Officer Andrew Kang said the firm has sufficient collateral to pledge in case of any further volatility in crypto markets.&nbsp;","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The decision on Phong Le's succession was seven years in the making — since Le joined the firm and worked closely with Saylor on various projects.<\/span>","Saylor told listeners in his opening remarks that the current wave of scrutiny facing cryptocurrency was good for the asset class in the medium to long term. The demise of Celsius, Voyager and 3AC has removed dangerous business practices from the market, he said, and has kickstarted regulatory preparations – which he said should be good for bitcoin in the long run.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"August 8","content":"DATE"},{"type":"$918 million","content":"MONEY"},{"type":"2.6%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Andrew Kang","content":"PERSON"},{"type":"second quarter of 2022","content":"DATE"},{"type":"first quarter","content":"DATE"},{"type":"$425 million","content":"MONEY"},{"type":"Phong Le","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"second quarter","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"Michael Saylor","content":"PERSON"}],"hashtag":["BITCOIN"],"authors":["Adam Morgan McCarthy","The Block"]}