{"summary":"The DeFi developer says he wants to promote regulated crypto access instead of fighting with the authorities over crypto regulations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/142472\/andre-cronje-regulated-crypto-more-feasible-than-crypto-regulations","publishDate":"2022-04-19T07:57:03","id":14085,"type":null,"title":"Andre Cronje: &#x27;regulated crypto&#x27; more feasible than ‘crypto regulations’","category":["REGULATION"],"content":["Prominent DeFi developer Andre Cronje has <a href=\"https:\/\/andrecronje.medium.com\/crypto-regulation-vs-regulated-crypto-aae56b36dcd8\" data-v-f87c67ca=\"\">called<\/a> for the emergence of what he termed \"regulated crypto,\" where cryptocurrency businesses are licensed to operate under a national blockchain framework, over more heavy handed \"crypto regulation.\"","Writing in his blog today, Cronje called regulated crypto a more feasible approach than trying to police the industry by way of cryptocurrency regulation.","Regulated crypto will involve crypto businesses applying for the required licenses in the countries in which they operate, Cronje argued. Countries looking to regulate their respective cryptocurrency industries can launch what he called “national blockchains.”","“Instead of trying to fight regulatory bodies because of crypto regulation, we should be trying to engage and educate on regulated crypto. What should a token issuance license look like? What should an exchange’s activities be expanded to?” Cronje added.","Today’s statement follows a blog post published on Monday where <a href=\"https:\/\/www.theblockcrypto.com\/post\/142299\/andre-cronje-crypto-culture-has-strangled-crypto-ethos\" data-v-f87c67ca=\"\">Cronje railed against crypto culture<\/a> while calling for better regulations.","Cronje used the latest blog post to clarify why he thinks the future lies in regulated crypto access. Stating the core focus on this mission, Cronje listed areas like crypto ETFs and mutual funds, compliant custody services, risk reporting solutions and asset tokenization platforms.","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/136545\/fantom-tvl-slumps-as-colleague-tweets-andre-cronje-is-quitting-defi\" data-v-f87c67ca=\"\">Cronje quit the crypto space<\/a> back in March and announced at the time that he was handing over control of several protocols. These latest statements from the DeFi developer could be signalling a return to the industry.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Andre Cronje","content":"PERSON"},{"type":"Cronje","content":"PERSON"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}