{"summary":"ClayStack has entered Ethereum restaking via EigenLayer and is offering users reward points ahead of its token launch in a 1:1 ratio.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274139\/claystack-ethereum-restaking-reward-points-token-launch","publishDate":"2024-01-23T14:00:03","id":14083,"type":null,"title":"ClayStack enters Ethereum restaking, offering reward points ahead of token launch in 1:1 ratio","category":["DEFI"],"content":["Crypto liquid staking platform ClayStack has entered the Ethereum restaking space via EigenLayer and is offering users reward points ahead of its token launch at a 1:1 ratio.&nbsp;","ClayStack is changing its Ethereum liquid staking token called csETH into a liquid restaking token, the project said Monday. ClayStack uses the pioneering Ethereum restaking protocol EigenLayer to offer the new service.","The platform currently accepts native ETH for direct restaking on EigenLayer, with liquid staking tokens such as Lido staked ether (stETH) and Rocket Pool ether (rETH) to follow in \"a few days,\" ClayStack founder and CEO Mohak Agarwal told The Block.","\"We currently accept stETH and rETH, but they are unstaked and restaked, whereas after a few days, we will deposit them directly on EigenLayer,\" Agarwal said.","Ethereum restaking has been gaining momentum since the launch of EigenLayer last June. The total value locked, or TVL, in EigenLayer's smart contracts currently stands at about $1.7 billion. Last week, <a href=\"https:\/\/www.theblock.co\/post\/272679\/ethereum-restaking-protocol-renzo-eigenlayer-funding-valuation\" data-v-f87c67ca=\"\">Renzo Protocol also entered<\/a> the Ethereum restaking space via EigenLayer, when it announced a $3.2 million seed funding round. Renzo is currently only in the beta phase and has already reached a TVL of over $116 million, according to its website.","Restaking extends beyond conventional staking and liquid staking. Traditional staking entails locking tokens to generate rewards, while liquid staking offers liquid tokens that represent locked assets, usable on various platforms for extra rewards. Restaking, on the other hand, enables the utilization of staked ether and liquid staking tokens across multiple platforms to further boost earnings.","<a href=\"https:\/\/www.theblock.co\/post\/111129\/crypto-staking-protocol-claystack-5-2-million-saft-sale\" data-v-f87c67ca=\"\">ClayStack<\/a>'s TVL stands at about $2.25 million. It first launched liquid staking for Polygon's MATIC token in 2022. Then, last September, it began offering Ethereum liquid staking. But with today's launch, it will shift its focus to Ethereum restaking.","\"Due to shrinking yield and the limited DeFi ecosystem on Polygon outside major ones like Compound and Aave (which delisted the majority of the less traded or volatile assets), it became very difficult to build more utility on Polygon liquid staking,\" Agarwal said.","ClayStack is offering reward points to users who will utilize its Ethereum restaking service at a 1:1 ratio, meaning each clay point will be redeemable for one clay token in the future.","\"There is no other points system currently that offers 1:1 redemption. You can own 1 million points in other programs and you could end up getting 100 tokens,\" Agarwal claimed.","Twenty clay points will be given per ETH per week, Agarwal noted, adding that the rate will change every Monday and then mostly remain the same for the week. There are no minimum or maximum points for any user, he added. However, there is a total cap every week on points that all the users can get combined, which will also refresh at the beginning of the week and will be visible on the platform, he said.","To be sure, ClayStack's clay points aren't totally new. A version of these points has already been live since the project began its Ethereum liquid staking service last September, Agarwal said, adding that the revamped points system is going live today and will keep running until the end of the first quarter of this year.","Besides clay points, ClayStack will also offer its users EigenLayer restaked points.","\"When ClayStack natively restakes the ETH on EigenLayer, ClayStack's smart contract ends up accruing those points,\" Agarwal said. \"We don't know what they will be redeemable to; we will just pass along those points to csETH holders, considering so much excitement amongst users for EigenLayer points.\"","EigenLayer Restaked points will not be redeemable for CLAY tokens, he noted.&nbsp;","ClayStack will announce its token launch plans next month, Agarwal said, while declining to specify the launch date.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"TVL","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"end of the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Renzo Protocol","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"EigenLayer last June","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Mohak Agarwal","content":"PERSON"},{"type":"$2.25 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"September","content":"DATE"},{"type":"Agarwal","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$3.2 million","content":"MONEY"},{"type":"$116 million","content":"MONEY"},{"type":"last September","content":"DATE"}],"hashtag":["ETHEREUM","STAKING"],"authors":["Yogita Khatri","The Block"]}