{"summary":"This is now the second time the project has faced difficulties, after its first version was paused due to a smart contract bug.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232419\/jimbos-protocol-exploited-for-7-5-million-three-days-after-v2-launch","publishDate":"2023-05-28T03:56:44","id":14095,"type":null,"title":"Jimbos Protocol exploited for $7.5 million three days after V2 launch","category":["CRYPTO ECOSYSTEMS"],"content":["Crypto project Jimbos Protocol was exploited for 4,090 ETH ($7.5 million) just three days after its version 2 was launched.","The hack was enabled by the protocol's lack of control over slippage for the tokens under its control, <a href=\"https:\/\/twitter.com\/peckshield\/status\/1662650673731624961\" data-v-f87c67ca=\"\">according<\/a> to crypto analysts PeckShield. The exploiter made use of a $5.9 million flash loan — where tokens are borrowed and instantly repaid — to carry out the attack.","\"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">We are aware of the exploit regarding our protocol and are actively in contact with law enforcement and security professionals. We will release further information when possible,\" the protocol <a href=\"https:\/\/twitter.com\/jimbosprotocol\/status\/1662711995072909312\" data-v-f87c67ca=\"\">said<\/a> on Twitter.<\/span>","The Arbitrum-based Jimbos Protocol is an attempt to make a token with a semi-stable floor price, that's backed by an amount of assets. It attempts to take some elements of the Olympus DAO project — which rose quickly in price before eventually collapsing — but with a few changes hoped to make it more sustainable. The core idea is to use the project's own liquidity to support its price, in combination with taxes and incentives.","The project initially launched on May 16 but shortly after the launch, a smart contract bug stopped the protocol from working as expected. Users were told to not interact with version 1 and wait for version 2. Following today's exploit of version 2, the token's price has collapsed from $0.24 to $0, <a href=\"https:\/\/traderjoexyz.com\/arbitrum\/trade?outputCurrency=0xc3813645ad2ea0ac9d4d72d77c3755ac3b819e38\" data-v-f87c67ca=\"\">according<\/a> to decentralized exchange TraderJoe.","On the project's website, it <a href=\"https:\/\/www.v2.docs.jimbosprotocol.xyz\/history\/issues-with-jimbo-v1\" data-v-f87c67ca=\"\">notes<\/a> that \"these mechanisms are experimental, the contracts are unaudited, and that any amount of money you put into this protocol can be lost due to unforseen circumstances at any time.\"","On May 25, popular crypto investor DCF God said he had bought some jimbo tokens, before realising it lacked the feature he had bought them for. Today he <a href=\"https:\/\/twitter.com\/dcfgod\/status\/1662626326438658048\" data-v-f87c67ca=\"\">noted<\/a>, \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Oh and now I’m rugged.\"<\/span>","<em data-v-f87c67ca=\"\">Updated current price of jimbo token.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$0.24","content":"MONEY"},{"type":"May 25","content":"DATE"},{"type":"DCF","content":"ORGANIZATION"},{"type":"May 16","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$7.5 million","content":"MONEY"},{"type":"$5.9 million","content":"MONEY"},{"type":"Jimbos Protocol","content":"ORGANIZATION"},{"type":"Olympus DAO","content":"ORGANIZATION"},{"type":"$0","content":"MONEY"}],"hashtag":["ASSETS","EXPLOITS","HACKS","SMART CONTRACTS"],"authors":["Tim Copeland","The Block"]}