{"summary":"Frax Finance co-founders have proposed a $20 million token buyback and burn program to boost the FXS token price.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150847\/frax-co-founders-propose-spending-20-million-to-buyback-fxs-token?utm_source=twitter&utm_medium=social","publishDate":"2022-06-08T10:46:06","id":14098,"type":null,"title":"Frax co-founders propose spending $20 million to buyback FXS token","category":["GOVERNANCE"],"content":["Sam Kazemian and Travis Moore, co-founders of Frax Finance, have published a new governance <a href=\"https:\/\/gov.frax.finance\/t\/fip-77-20m-fxs-buyback-program-using-twamm\/1523\" data-v-f87c67ca=\"\">proposal<\/a> Wednesday for a $20 million buyback of the protocol’s Frax Shares (FXS) token.","Frax Finance is a fractional algorithmic stablecoin protocol and its stable currency is called FRAX. The stablecoin maintains its US dollar peg via two mechanisms — partial collateral backing by USDC and an algorithm that trades FRAX and FXS.","The proposal’s authors say the buyback is necessary to reverse the token’s price downtrend. FXS is down more than 85% from its all-time high price of $42.80 reached at the start of the year.","Today’s proposal acknowledged that FXS, like the rest of the crypto market, has lost a lot of its value during the course of the current bear market. Kazemian and Moore, however, countered that Frax’s as a stablecoin project is still in a healthy condition.","As such, FXS at its current price is the most undervalued asset in the project’s treasury. The proposal stated that a buyback of the token is “the best use of capital dollar for dollar spent.”","If passed, the protocol will buy back and burn $20 million worth of FXS. The buyback and burn process will remove those tokens from circulation leading to a decrease in circulating supply.","Frax is currently trading at $6, up from $4 when the proposal went live. At the current price, a $20 million buyback could remove about 3.37% of the 99.8 million coins in the token’s total supply.","The buyback will happen via Fraxswap, a decentralized exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/141099\/frax-finance-may-buy-large-amounts-of-major-cryptos-to-back-its-stablecoin\" data-v-f87c67ca=\"\">built <\/a>to process large trades at minimal slippage if the community approves the proposal. The process could take between three days or a month to be completed.","This latest governance proposal on Frax goes against the recent trend seen in some DeFi protocols where community members are calling for emergency treasury management actions.","The Block recently reported that a Lido developer proposed the project <a href=\"https:\/\/www.theblockcrypto.com\/post\/141099\/frax-finance-may-buy-large-amounts-of-major-cryptos-to-back-its-stablecoin\" data-v-f87c67ca=\"\">sell $17 million of ether<\/a> from its treasury funds to “prepare for the bear market.”","Other projects like Fei are also looking at plans to liquidate a portion of their treasuries for the same reason.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$42.80","content":"MONEY"},{"type":"Moore","content":"PERSON"},{"type":"Sam Kazemian","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Frax Finance","content":"ORGANIZATION"},{"type":"3.37%","content":"PERCENT"},{"type":"85%","content":"PERCENT"},{"type":"$6","content":"MONEY"},{"type":"$4","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"$20 million","content":"MONEY"},{"type":"Travis Moore","content":"PERSON"},{"type":"$17 million","content":"MONEY"}],"hashtag":[],"authors":["Osato Avan-Nomayo","The Block"]}