{"summary":"The surge is largely due to Blur&#x27;s lending platform, which saw roughly 350 Azuki NFT loans getting liquidated after the Elementals mint.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237081\/long-term-azuki-holders-selling-jumps-817-after-elemental-drop-nansen?utm_source=rss&utm_medium=rss","publishDate":"2023-06-29T15:39:36","id":14097,"type":null,"title":"Long-term Azuki holders selling jumps 817% after Elemental drop: Nansen","category":["METAVERSE & NFT"],"content":["Long-term holders of Azuki NFTs are selling off the digital assets en masse after the Elementals drop.&nbsp;","Defined as holding onto the non-fungible token for more than a year, 132 long-term Azuki holders sold their NFTs during or after this week's drop of the new Elemental collection. That was a 817% spike in long-term holders selling their Azukis, according to crypto data provider Nansen.&nbsp;","Launched a couple days ago, Elementals is a new NFT collection which belongs to the Azuki ecosystem, a blue-chip brand in the world of digital assets. The first 20 minutes of the launch was reserved exclusively for owners of Azuki NFTs. An entire batch of 10,000 NFTs sold in about 15 minutes, <a href=\"https:\/\/www.theblock.co\/post\/236681\/azuki-nft-collections-ends-elemental-mint-with-37-5-million-before-it-was-ever-open-to-the-public\" data-v-f87c67ca=\"\">generating $37.5 million<\/a> in revenue. That was in addition to another 10,000 Elementals being airdropped to existing Azuki members.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBecause of the speed in which the new Elementals collection sold out, the general public never had a chance to buy into the Azuki ecosystem.","Holders of Beanz Official non-fungible tokens, a collection of 20,000 anthropomorphic-bean NFTs that act as \"sidekicks\" to the human avatars featured in the main Azuki collection, were also able to purchase Elementals during the exclusive 20-minute window. Since then, Beanz non-fungible tokens have also been part of a major sell off as 89 established owners have sold the digital assets since the Elementals launch; a 155% increase in long-term Beanz holders unloading the NFTs.","\"The significant sell-off appears to be largely attributed to Blur's <a href=\"https:\/\/www.theblock.co\/post\/228966\/blur-paradigm-lending-nft\" data-v-f87c67ca=\"\">lending platform<\/a>,\" said Brad Kay, research analyst at The Block Research. \"Before the airdrop, Azuki and Beanz had 700 and 550 outstanding loans respectively. Following the Elemental minting, which triggered a flash sell-off, over 50% of outstanding loans were liquidated\/repaid. While values have recovered to pre-airdrop levels, the substantial increase in supply may have catalyzed this cascade event.\"","<span data-v-f87c67ca=\"\">Data of long-term holders selling off Azuki and Beanz NFTs. Image: Nansen<\/span>","Some in the Azuki community have lamented that the Elementals launch failed to live up to the promise of growing the ecosystem by adding new members. In addition, critics noted that the new NFT collection — teased as including new attributes like flourishes of lightning, water, earth and fire — looked too similar to Azuki's original collection.&nbsp;","The Azuki team said they \"<a href=\"https:\/\/www.theblock.co\/post\/236923\/azuki-elementals-nft\" data-v-f87c67ca=\"\">missed the mark<\/a>\" with the Elemental drop and promised to do better in the future.","The Azuki NFT collection, a subsidiary of the Los Angeles-based startup <a href=\"https:\/\/www.theblock.co\/post\/171617\/chiru-labs-azuki-creator-30-million-series-a-fundraise\" data-v-f87c67ca=\"\">Chiru Labs<\/a>, launched in January 2021. This week's Elementals drop caused Azuki trading volume to reach its highest level in over a year, according to The Block's Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/art-collectibles\/ethereum-art-and-collectibles-nft-trade-volume\/embed\" title=\"Ethereum Art and Collectibles NFT Trade Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Brad Kay","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"817%","content":"PERCENT"},{"type":"January 2021","content":"DATE"},{"type":"Azuki NFT","content":"ORGANIZATION"},{"type":"Los Angeles","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"Azuki","content":"ORGANIZATION"},{"type":"$37.5 million","content":"MONEY"},{"type":"Beanz","content":"ORGANIZATION"},{"type":"155%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Nansen","content":"ORGANIZATION"},{"type":"Elemental minting","content":"ORGANIZATION"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Beanz Official","content":"ORGANIZATION"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}