{"summary":"As the Ethereum blockchain gears up for its move to proof of stake crypto exchanges and banks are lining up to offer staking rewards.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168271\/crypto-firms-rush-to-offer-ethereum-staking-ahead-of-the-merge?utm_source=rss&utm_medium=rss","publishDate":"2022-09-07T09:37:27","id":14108,"type":null,"title":"Crypto firms rush to offer Ethereum staking ahead of The Merge","category":["THE MERGE"],"content":["Several crypto firms are rushing to offer Ethereum staking ahead of The Merge next week.&nbsp;","On Wednesday Binance.US and SEBA Bank both announced Ethereum staking programs, with the former offering 6% returns, while its Swiss counterpart didn't share info on its yields.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/166708\/the-merge-everything-you-need-to-know-about-ethereums-big-upgrade\" data-v-f87c67ca=\"\">The Merge<\/a> will see Ethereum move to a proof-of-stake consensus mechanism, where the blockchain is secured by validators who are selected by staking tokens. Anyone can set up a validator node as long as they meet the staking requirement, otherwise users can pool their assets together by delegating their tokens to a validator and sharing in the rewards.&nbsp;","Binance's American subsidiary is launching its own product, with returns higher than current staking rewards elsewhere.","Binance.US <a href=\"https:\/\/blog.binance.us\/eth-staking\/\" data-v-f87c67ca=\"\">launched<\/a> its own Ethereum staking product on Wednesday, notably offering a starting annual percentage yield (APY) of 6% – just three months after launching staking services.","Activating validator software requires users to deposit 32 ETH ($49,000), validators are responsible for \"storing data, processing transactions, and adding new blocks to the blockchain,\" <a href=\"https:\/\/ethereum.org\/en\/staking\/#:~:text=Further%20reading-,What%20is%20staking%3F,new%20ETH%20in%20the%20process.\" data-v-f87c67ca=\"\">per<\/a> the Ethereum website. However, users of Binance.US will only have to commit a minimum of 0.001 ETH to stake on the platform.&nbsp;","The firm's CEO Brian Shroder said Ethereum plays a critical role in the Web 3 ecosystem, and as such the exchange is excited to offer staking ahead of The Merge.","Swiss crypto bank SEBA also launched its own Ethereum staking services on Wednesday, aimed at institutions.","SEBA's staking platform will allow institutions to generate rewards from investments on proof-of-stake blockchains, per its statement. Its Ethereum staking services will pay out rewards on a monthly basis and adjustable lock up periods also available post-merge.&nbsp;","The firm's head of technology and client solutions Mathias Schütz said The Merge is a significant milestone for the cryptocurrency, delivering improvements for its users across the areas of security, scalability and sustainability.&nbsp;","\"The launch of our Ethereum staking services will enable institutional investors to play a key role in securing the future of the network, via a trusted, secure and fully regulated counterparty,\" Schütz said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"6%","content":"PERCENT"},{"type":"Mathias Schütz","content":"PERSON"},{"type":"SEBA","content":"ORGANIZATION"},{"type":"Brian Shroder","content":"PERSON"},{"type":"Schütz","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"SEBA Bank","content":"ORGANIZATION"},{"type":"$49,000","content":"MONEY"}],"hashtag":["BINANCE","STAKING"],"authors":["Adam Morgan McCarthy","The Block"]}