{"summary":"New Hampshire Republican Bruce Fenton is behind in the polls for Tuesday&#x27;s Senate primary, but pushing bitcoin toward the forefront of debate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/169115\/bitcoiner-bruce-fenton-mines-senate-race-for-support-in-granite-state?utm_source=twitter&utm_medium=social","publishDate":"2022-09-12T08:00:18","id":14118,"type":null,"title":"&#x27;Bitcoiner&#x27; Bruce Fenton Mines Senate Race for Support in Granite State","category":["POLICY"],"content":["<span data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"TextRun SCXW243097389 BCX2\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"auto\" data-v-f87c67ca=\"\"><span class=\"NormalTextRun SCXW243097389 BCX2\" data-v-f87c67ca=\"\">SALEM, N.H. — New Hampshire Republican Bruce Fenton is down in the polls, and plenty of Gr<\/span><\/span>anite Staters haven’t even heard of him, but the self-described “bitcoiner” is doing his part to get people talking about crypto.&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fenton, a former Navy medic who found success in traditional finance before embracing digital assets, served as executive director of the Bitcoin Foundation and made a fortune in crypto. Now, he’s using those millions to wage a longshot Senate campaign in the state where “Live Free or Die” is more than just a motto. <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I didn't intend to run for office. I just want to be left alone. I wanted my own business and to have the government mind their own business,” Fenton said. “That's why I came to New Hampshire along with thousands and thousands of other people.”<\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fenton is running an untraditional campaign. He’s self-funding his bid with his bitcoin fortune – he reported pouring 85 bitcoin, worth nearly $1.6 million, into his campaign – rather than soliciting cash from Republican donors. He spends hours in audio chatrooms on Twitter talking about his political philosophy and educating listeners about digital assets. He hasn’t spoken with the National Republican Senatorial Committee, the party’s major campaign organizing force, even though it’s traditionally a major source of funding for candidates. <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Currently running a distant third in a five-person race, Fenton likely won’t get the chance to vie for a Senate seat. But his campaign has managed to give crypto airtime during the run-up to tomorrow’s primary. And at a time when many financial privacy advocates are on edge over what they see as government overreach, Fenton’s campaign, like bitcoin itself, is in many ways a protest against the power of the state. <\/span>&nbsp;<br data-v-f87c67ca=\"\">\n&nbsp;<br data-v-f87c67ca=\"\">\n<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fenton’s bitcoin background has drawn attention. At a recent candidate forum in Salem, a town of 30,000 on the border of Massachusetts, <\/span><span data-contrast=\"auto\" data-v-f87c67ca=\"\">the first moderator question<\/span> <span data-contrast=\"auto\" data-v-f87c67ca=\"\">was about Fenton’s claim that US currency is just “pictures of presidents.” <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“We have a very deeply broken fiat money system,” Fenton said. “Bitcoin is sound and limited in supply. The United States dollar is not. It is unlimited in supply, and it is printed with reckless abandon by politicians who have no accountability whatsoever.” <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The message resonated in the libertarian-heavy state. Three of the four candidates on stage agreed with Fenton, acknowledging crypto’s move into the mainstream. Former Londonderry Town Manager Kevin Smith even mentioned that he owns digital assets. Vikram Mansharamani, an author who has written about cryptocurrency and lecture<\/span>s<span data-contrast=\"auto\" data-v-f87c67ca=\"\"> at Harvard University, also owns digital assets. He<\/span><a href=\"https:\/\/news.bloombergtax.com\/crypto\/crypto-fans-flock-to-new-hampshires-gop-congressional-campaigns\" data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> reported<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\"> owning between $1 million and $5 million in cryptocurrency on a financial disclosure form. <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fenton, who calls himself a Ron Paul Republican in reference to the libertarian-minded former Texas congressman, was running his own financial firm when he was introduced to bitcoin in 2012. He became so passionate about the original cryptocurrency that he later volunteered as executive director of the Bitcoin Foundation. He then founded the Satoshi Roundtable, an invitation-only blockchain industry retreat. Fenton has served as managing director of the New Hampshire-based Chainstone Labs, a digital assets advisory and portfolio management firm, for four years.  <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">The married father of four moved to New Hampshire in 2017 as part of the Free State Project. The movement is aimed at “turning the tide against big government” by encouraging people to move in large numbers to New Hampshire to promote libertarian ideas, according to its website. The nonprofit project says it attracts people, “who<\/span> <span data-contrast=\"auto\" data-v-f87c67ca=\"\">are on a mission to prove that more liberty leads to more prosperity for everyone.”<\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Should he somehow defy the polls, Fenton’s plan for the Senate would be to “pretty much vote no on almost everything.” He’d like to abolish the Securities and Exchange Commission, which much of the cryptocurrency industry sees as a thorn in its side.  <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I’d like to see their budget cut. I’d like to see their powers cut. I’d like to see their authority cut, or better yet, the entire agency removed,” along with 30 other federal agencies he views as exerting too much power over Americans, Fenton said.&nbsp;<\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“Nobody wants to do anything here because the regulations are so hard,” Fenton added. “If something is a security — nobody should care.” <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fenton’s bid<\/span> <span data-contrast=\"auto\" data-v-f87c67ca=\"\">is focused on a wide range of issues, not just what he sees as flaws in the financial system. But Fenton acknowledges his bitcoin background is perhaps the best-known aspect of his campaign. His candidacy has been met with skepticism by some New Hampshire Republicans, who note crypto is not a major issue for Granite State voters, even though bitcoin has roots in the state. Libertarians built a “<\/span><a href=\"https:\/\/www.forbes.com\/sites\/rebeccacampbell1\/2019\/02\/14\/market-downturn-the-people-using-crypto-show-why-the-market-is-not-dead\/?sh=4b793d9865ff\" data-v-f87c67ca=\"\"><span data-contrast=\"auto\" data-v-f87c67ca=\"\">crypto Mecca<\/span><\/a><span data-contrast=\"auto\" data-v-f87c67ca=\"\">” in the college town of Keene in the 2010s, for example. <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Despite the cryptocurrency ties, Fenton hasn’t gained much traction, running well behind the two frontrunners, retired Army General Don Bolduc and state Senate President Chuck Morse. It’s not a surprise to some longtime political operatives in the state. <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I get that there are crypto enthusiasts out there. But the idea that they're like, a key part of the Republican coalition is laughable,” said Fergus Cullen, a former state Republican <\/span>Committee <span data-contrast=\"auto\" data-v-f87c67ca=\"\">chair in New Hampshire and a Morse ally. “Have you seen the average Republican primary voter lately? I mean, grandpa's not that big on crypto. He’s just not.” <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Fenton is far from the first crypto-friendly person to run for Congress. Wyoming Republican Sen. Cynthia Lummis has reported owning between $100,000 and $350,000 worth of bitcoin in her investment disclosures, and recently authored a bill co-sponsored by Sen. Kirsten Gillibrand (D-N.Y.), to significantly overhaul the way cryptocurrencies would be regulated.  <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Despite strong industry support for the sweeping bill, Fenton isn’t impressed. <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I don't support a bill like Sen. Lummis’s bill that adds new things and new restrictions and new powers. I want to get them entirely out of it,” Fenton said. “The only laws I would support are things that clearly protect that on a federal level, to say something like you know, there shall be no law interfering with bitcoin” <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">Patrick Murck, a co-founder of the Bitcoin Foundation who has known Fenton for years, saw him as distinct from Lummis or other crypto-friendly officeholders.  <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">“I think of Sen. Lummis as somebody who is friendly to crypto and certainly has been an advocate for crypto in the Senate,” Murck said. “But she's not somebody who sort of emerged from the community.”&nbsp;<\/span>","<span data-contrast=\"auto\" data-v-f87c67ca=\"\">A moment later he said of Fenton, “It doesn’t surprise me that he would want to go there in an official capacity to change the rules.” <\/span><span data-ccp-props=\"{}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Fenton","content":"PERSON"},{"type":"Patrick Murck","content":"PERSON"},{"type":"Fenton","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Keene","content":"PERSON"},{"type":"$1.6 million","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"Chuck Morse","content":"PERSON"},{"type":"Bitcoin Foundation","content":"ORGANIZATION"},{"type":"Satoshi Roundtable","content":"PERSON"},{"type":"Massachusetts","content":"LOCATION"},{"type":"New Hampshire","content":"LOCATION"},{"type":"Lummis","content":"LOCATION"},{"type":"Lummis","content":"PERSON"},{"type":"Murck","content":"PERSON"},{"type":"N.H.","content":"LOCATION"},{"type":"Republican <\/span>Committee","content":"ORGANIZATION"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"— New Hampshire Republican Bruce Fenton","content":"ORGANIZATION"},{"type":"New Hampshire Republicans","content":"ORGANIZATION"},{"type":"$350,000","content":"MONEY"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"National Republican Senatorial Committee","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"$5 million","content":"MONEY"},{"type":"N.Y.","content":"LOCATION"},{"type":"Fergus Cullen","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Salem","content":"LOCATION"},{"type":"Free State Project","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Harvard University","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Army General Don Bolduc","content":"ORGANIZATION"},{"type":"Ron Paul Republican","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"Vikram Mansharamani","content":"PERSON"},{"type":"Morse","content":"ORGANIZATION"},{"type":"Kevin Smith","content":"PERSON"},{"type":"2010s","content":"DATE"},{"type":"Navy","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Fenton","content":"ORGANIZATION"}],"hashtag":["BITCOIN","CONGRESS","CYNTHIA LUMMIS","SEC"],"authors":["Stephanie Murray","The Block"]}