{"summary":"A new report from U.S. president Joe Biden&#x27;s White House encouraged a broad policy push to reduce greenhouse gas emissions and encourage the use of clean energy by American crypto mining companies.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168621\/white-house-report-proposes-possible-restrictions-on-proof-of-work-crypto-mining?utm_source=rss&utm_medium=rss","publishDate":"2022-09-08T11:08:13","id":14119,"type":null,"title":"White House report proposes possible restrictions on proof-of-work crypto mining","category":["MINING"],"content":["A new White House report encouraged a broad policy push to reduce greenhouse gas emissions and urged the use of clean energy by U.S. crypto mining companies — and potentially more restrictive measures should such efforts fail to reduce the industry's environmental impact.&nbsp;","<a href=\"https:\/\/www.whitehouse.gov\/wp-content\/uploads\/2022\/09\/09-2022-Crypto-Assets-and-Climate-Report.pdf\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">A report from the White House Office of Science and Technology Policy<\/a> proposed that U.S. lawmakers and policymakers consider legal limitations or outright restrictions to reduce crypto mining's environmental impact if other strategies fail to catch on.","The report, which <a href=\"https:\/\/www.theblock.co\/linked\/149850\/white-house-office-report-on-crypto-mining-icted-in-august-bloomberg\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">was mandated<\/a> by executive order earlier this year, called for efforts to minimize the environmental impacts from crypto assets.","Government institutions like the Environmental Protection Agency \"should provide technical assistance and initiate a collaborative process with states, communities, the crypto-asset industry, and others to develop effective, evidence-based environmental performance standards for the responsible design, development, and use of environmentally responsible crypto-asset technologies.\"","Those proposed standards focus on the use of clean energy, low water and low energy intensities, among others, the report said.&nbsp;","\"Should these measures prove ineffective at reducing impacts, the Administration should explore executive actions, and Congress might consider legislation, to limit or eliminate the use of high energy intensity consensus mechanisms for crypto-asset mining,\" according to the report, which mentioned proof-of-work (PoW) consensus, currently used by bitcoin and other digital assets to create the next block of transactions on the network. The miner that creates a block is rewarded with both a subsidy — currently 6.25 BTC — as well as transaction fees, but the process is highly energy-intensive.","Miners run specialized hardware around the clock and they make a profit when the cost to produce blocks is greater than what they paid for power and other resources. Numerous U.S. crypto companies have emerged in recent years, particularly in Texas.&nbsp;","Such growth has sparked opposition, most notably in New York where lawmakers advanced and passed a two-year moratorium on some crypto mining operations. The legislation has yet to be officially signed into law by New York Governor Kathy Hochul, and officials such as New York Mayor Eric Adams have called for a veto of the legislation.","Other proposals in the report include more comprehensive data collection on crypto mining energy use and the development of \"energy conservation standards for crypto-asset mining equipment, blockchains, and other operations.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Environmental Protection Agency","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Kathy Hochul","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"White House Office of Science and Technology Policy","content":"ORGANIZATION"},{"type":"Eric Adams","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Administration","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}