{"summary":"The team behind ETHPoW published an open letter in which it claimed its proof-of-work fork of Ethereum was going to be “inevitable.”","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/163229\/ethpow-team-says-its-miner-led-ethereum-fork-is-inevitable?utm_source=rss&utm_medium=rss","publishDate":"2022-08-12T10:07:14","id":14110,"type":null,"title":"ETHPoW team says its miner-led Ethereum fork is &#x27;inevitable&#x27;","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">The team behind ETHPoW today published an<\/span> <a href=\"about:blank\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">open letter<\/span><\/a><span data-v-f87c67ca=\"\"> claiming its proof-of-work fork of Ethereum was “inevitable.”<\/span>","<span data-v-f87c67ca=\"\">ETHPoW is a planned fork of Ethereum. Led by a miner called Chandler Guo, it aims to split away from the Ethereum main network.&nbsp;<\/span><span data-v-f87c67ca=\"\">ETHPoW issued an<\/span> <a href=\"https:\/\/news.marsbit.co\/20220812075220170319.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">open letter<\/span><\/a><span data-v-f87c67ca=\"\"> addressed to ETC Cooperative, the development team behind Ethereum Classic. This came in response to ETC Cooperative’s <\/span><a href=\"https:\/\/etccooperative.org\/posts\/2022-08-08-open-letter-to-chandler-guo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">prior letter<\/span><\/a><span data-v-f87c67ca=\"\"> addressed to Chandler Guo, discussing the reasons why ETHPoW fork would not succeed and that miners should simply migrate to Ethereum Classic.<\/span>","<span data-v-f87c67ca=\"\">In the statement, it argued that Ethereum Classic will not accommodate all the existing Ethereum miners. Hence it claimed there's need for not one but multiple PoW forks.<\/span>","<span data-v-f87c67ca=\"\">“The small pool of ETC cannot hold the entire computing power pool of ETH at all. This is a hard fact. In the face of such hard facts, this hard fork is inevitable,” the ETHPoW team said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The project also shed light on its preparations. The team said it had removed the<\/span> <a href=\"https:\/\/www.theblock.co\/post\/155081\/ethereum-finishes-gray-glacier-hard-fork-difficulty-bomb\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"difficulty bomb\"<\/span><\/a><span data-v-f87c67ca=\"\"> feature on its version of the Ethereum code, among many other development changes.&nbsp;<\/span><span data-v-f87c67ca=\"\">The difficulty bomb is a mechanism designed by Ethereum core developers to prevent miners from interrupting the merge by making Ethereum blocks harder to mine. By removing this mechanism, ETHPoW is hoping to allow miners to readily produce fresh blocks when its fork takes place.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In addition, the ETHPoW team provided details on other developments. It said it is planning an ETHPoW testnet where developers can test the fork code before it’s deployed. The team also updated the chain ID, a network identifier used to connect to crypto wallets and claimed to have added protection against replay attacks, a type of network exploit that may occur during blockchain forks.<\/span>","<span data-v-f87c67ca=\"\">According to the letter, the ETHPoW would execute the fork in September, potentially around the same time as the merge.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"ETC Cooperative","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Chandler Guo","content":"PERSON"},{"type":"Ethereum Classic","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}