{"summary":"Vauld has applied for another four months of protection against creditors, according to court documents obtained by The Block.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179034\/vauld-seeks-another-four-months-of-protection-against-creditors?utm_source=rss&utm_medium=rss","publishDate":"2022-10-21T13:22:35","id":14111,"type":null,"title":"Vauld seeks another four months of protection against creditors","category":["LENDING"],"content":["Troubled Asian crypto lender Vauld needs more time to sort out its financial problems, as the firm has applied for another four months of protection against creditors, according to court documents obtained by The Block.","The application, filed on Oct. 18 in the Singapore High Court, seeks additional protection through March 7, 2023. Vauld's existing creditor protection <a href=\"https:\/\/www.theblock.co\/post\/160510\/vauld-gets-three-month-moratorium-extension-to-continue-exploring-options\" data-v-f87c67ca=\"\">expires on Nov. 7<\/a>.","The new application comes shortly after Nexo, a Vauld rival and its potential acquirer, further extended its due diligence period for \"as long as needed,\" <a href=\"https:\/\/www.theblock.co\/post\/177233\/nexo-once-again-extends-due-diligence-period-on-potential-vauld-deal\" data-v-f87c67ca=\"\">as The Block reported last week<\/a>.","Vauld states in the court documents that the four-month extension is needed to prevent legal proceedings while it proposes a restructuring plan with its creditors and any potential investors. As for Nexo's potential acquisition, discussions are still ongoing.","\"Even if the deal with Nexo does not materialize, I am confident that there would be another party that would be interested in a potential investment in the Vauld platform,\" Vauld co-founder and CEO Darshan Bathija states in the court documents. \"We have also received support from significant creditors that Defi Payments' business 'remains attractive' and would likely receive 'further offers for acquisition'.\" Defi Payments is the Singapore entity of Vauld involved in the court proceedings.","Earlier this month, Vauld formed a committee of creditors, according to the court documents. The committee comprises 17 undisclosed Vauld creditors, per the documents.","The committee held its first meeting on Oct. 10 along with Vauld's management team and its financial advisors Kroll LLC. Vauld discussed the draft terms of its restructuring plan at the meeting, among other things, and concluded that if Vauld were to go into liquidation, estimated recoveries for creditors are expected to be in the range of 38% and 49%.","But Vauld said \"it is a possible outcome of any deal with Nexo that creditors may recover 100% of their claims.\"","Vauld is also weighing the conversion of its assets into a fund managed by a third-party \"professional crypto asset fund manager.\" Recoveries under this restructuring proposal would depend on the fund's performance, but it is \"possible that the returns to creditors may exceed 100% depending on fund performance,\" per the court documents.","Vauld's creditor committee is apparently in support of the four-month extension, according to the court documents. If granted, Vauld will buy more breathing space to finalize a restructuring plan, or it could face liquidation.","Vauld halted client withdrawals in July and&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.theblock.co\/post\/158647\/crypto-lender-vauld-owes-363-million-to-retail-investors-after-halting-withdrawals\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">owes<\/a>&nbsp;$402 million to creditors, and $363 million — or 90% — of that amount comes from individual retail investors' deposits.","Vauld did not respond to The Block's request for comment by press time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Darshan Bathija","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Nexo","content":"ORGANIZATION"},{"type":"Nov. 7","content":"DATE"},{"type":"Vauld","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"$402 million","content":"MONEY"},{"type":"March 7, 2023","content":"DATE"},{"type":"Vauld","content":"ORGANIZATION"},{"type":"Singapore High Court","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Singapore","content":"LOCATION"},{"type":"Kroll LLC","content":"ORGANIZATION"},{"type":"Oct. 10","content":"DATE"},{"type":"$363 million","content":"MONEY"},{"type":"38%","content":"PERCENT"},{"type":"49%","content":"PERCENT"},{"type":"Nexo","content":"PERSON"},{"type":"Oct. 18","content":"DATE"}],"hashtag":[],"authors":["Yogita Khatri","The Block"]}