{"summary":"Binance.US, the American affiliate of global crypto exchange Binance, has cut bitcoin trading fees to zero for select pairs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153495\/binance-us-bitcoin-trading-fees-zero-select-pairs?utm_source=rss&utm_medium=rss","publishDate":"2022-06-22T07:52:41","id":14123,"type":null,"title":"Binance US drops bitcoin trading fees to zero for select pairs","category":["EXCHANGES"],"content":["Binance.US, the American affiliate of global crypto exchange Binance, has cut bitcoin trading fees to zero for select pairs, becoming the first exchange in the US to do so.","Effective immediately, all new and existing users of Binance.US will pay no fees for trading bitcoin in these four pairs — BTC\/USD, BTC\/USDT, BTC\/USDC, and BTC\/BUSD — the exchange announced today.","\"Binance.US is offering zero fees on BTC across four pair trades indefinitely as we endeavor to revolutionize the way fees are approached in our industry and increase accessibility to crypto,\" a Binance.US spokesperson told The Block.","The news comes at a time when crypto exchange trading volumes are sliding amid a market downturn. When asked why it's trimming trading fees now when prices are falling, the spokesperson said that \"there is no better time to introduce zero fees than now. We are taking a bold move and providing more value to our customers at a time when the community needs it most.\"","Binance currently charges trading fees in the form of the maker (traders that create orders) and taker (traders that fulfill someone else's order) fees. The fees vary depending upon the volume traded.","With the new fee structure, \"customers in the free tier will experience zero trading fees on the four bitcoin pairs, irrespective of trading volume,\" said the spokesperson.","Zero fees mean a loss in revenue for Binance.US. But the exchange's spokesperson said bitcoin is just one of more than 100 tokens listed on Binance.US and that spot trading is just one service it offers to customers.","\"We continue to roll out new products and services, such as staking earlier this month,\" said the spokesperson.","They went on to say that, unlike Binance.US's competitors, who have spent \"hundreds of millions of dollars on advertisements, naming rights, and the like,\" the exchange has taken \"a prudent approach to marketing spend and instead invested that money back into the business.\"","When asked if the zero-fee structure will also be extended for other cryptocurrencies, the spokesperson said bitcoin will serve \"as a test for the model, which could potentially be rolled out across other tokens and pairs down the line.\"","The news comes two months after Binance.US <a href=\"https:\/\/www.theblock.co\/post\/140833\/binance-us-raises-funding-200-million-4-5-billion-valuation\" data-v-f87c67ca=\"\">raised<\/a> $200 million in its first funding round at a $4.5 billion pre-money valuation. The exchange is reportedly looking to raise another $50 million.","Rival exchange <a href=\"https:\/\/www.theblock.co\/post\/123134\/coinbase-is-testing-a-subscription-service-with-zero-trading-fees-and-prioritized-support\" data-v-f87c67ca=\"\">Coinbase<\/a> is testing a new subscription-based service that would give users access to enhanced features, including zero-fee trading, as The Block reported late last year. Commission-free trading is more common in the traditional finance space.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$4.5 billion","content":"MONEY"},{"type":"USDT","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"\"hundreds of millions of dollars","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["BITCOIN"],"authors":["Yogita Khatri","The Block"]}