{"summary":"Multichain said it was &quot;unable to contact CEO Zhaojun and obtain the necessary server access for maintenance.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232754\/multichain-team-says-it-cant-contact-ceo-amid-protocol-problems?utm_source=rss&utm_medium=rss","publishDate":"2023-05-31T12:27:22","id":14122,"type":null,"title":"Multichain team says it can&#x27;t contact CEO amid protocol problems","category":["CRYPTO ECOSYSTEMS"],"content":["Multichain, the cross-chain protocol, confirmed Wednesday that the team is unable to contact its chief executive amid ongoing technology problems.","\"In the past two days, the Multichain protocol has experienced multiple issues due to unforeseeable circumstances,\" the team wrote in <a href=\"https:\/\/twitter.com\/MultichainOrg\/status\/1663941611380965376?t=agzfDEy6MWrrId1YoBpWfg&amp;s=19\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a message<\/a> on its official Twitter account. \"The team has done everything possible to maintain the protocol running, but we are currently unable to contact CEO Zhaojun and obtain the necessary server access for maintenance.\"","As The Block has previously reported, the protocol has been plagued by technology issues and dogged by rumors around the whereabouts of its team — namely, that they had been arrested in China.&nbsp;","The protocol's problems relate to its so-called routers, which enable the connections between chains. Two of the routers — Router 2 and now Router 5 — are impacted, affecting the connection between chains like Kava, zkSync and Polygon zkEVM.&nbsp;","The latest issue, disclosed today, affects a series of chains, the team said, which explained that \"this problem is beyond the team's current permissions and ability.\"","\"In order to protect the interests of our users, we have decided to suspend the corresponding cross-chain service for the affected chain on the UI. Last week, the same issue happened on Router2,\" the team wrote.&nbsp;","As The Block's Tim Copeland wrote this week, an admin in Multichain's Chinese Telegram channel had said that users needed to \"wait for Zhaojun to come back.\"","At press time, the price of Multichain's token — which has gyrated recently — appeared unaffected by the news, and is up about 7% in the past twenty-four hours, according to <a href=\"https:\/\/www.coingecko.com\/en\/coins\/multichain\" data-v-f87c67ca=\"\">CoinGecko<\/a>.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"Multichain","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Multichain","content":"LOCATION"},{"type":"Tim Copeland","content":"PERSON"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Zhaojun","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}