{"summary":"BlockTower Capital, the cryptocurrency investment firm, is capitalizing on Wall Street&#x27;s unquenchable thirst for yield. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/110192\/after-acquisition-blocktower-looks-to-capitalize-on-wall-streets-hunt-for-yield","publishDate":"2021-07-01T12:09:45","id":1412,"type":null,"title":"After acquisition, BlockTower looks to capitalize on Wall Street&#x27;s hunt for yield","category":["INVESTMENTS"],"content":["BlockTower Capital, the cryptocurrency investment firm, is capitalizing on Wall Street's unquenchable thirst for yield.&nbsp;","The firm, co-founded in 2017 by Matthew Goetz and Ari Paul, recently acquired Gamma Point in a $35 million deal, as previously reported by <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-06-08\/blocktower-acquires-rival-crypto-hedge-fund-gamma-point\" data-v-f87c67ca=\"\">Bloomberg<\/a>. Gamma Point specializes in so-called market neutral strategies and has now been fully integrated into BlockTower, according to a source familiar with the firm's operations.","BlockTower announced quietly that acquisition on June 28, noting in a press release that \"there's a tremendous market neutral opportunity in cryptocurrency, and it's something we've consistently heard as important from investors and institutions looking for a strategy with this kind of profile that can remove the volatility so many focus on in this market.\"","A source said that the firm officially launched its new fund with Gamma Point on Thursday, which will now begin to deploy capital into market-neutral strategies, meaning they won't take directional long or short bets on a given token or coin.&nbsp;","The plan is to continue to expand the fund's strategies — which can span DeFi yield farming to capitalizing on basis funding rates — and opportunistically take on new investors via individual accounts. Thus far, BlockTower has seen success in wooing progressive endowments to the new vehicle, according to a source.&nbsp;","There are also fund of funds looking to incorporate crypto into their existing market-neutral strategies, the person added.&nbsp;","<strong data-v-f87c67ca=\"\">Hunt for yield&nbsp;<\/strong>","Indeed, demand for the new vehicle was significant from such investors, which are hunting for yield in a low-yield environment.&nbsp;","That's been evident in the junk U.S. municipal bond market, which has seen strong demand among investors, as noted by <a href=\"https:\/\/www.ft.com\/content\/ac29c563-3549-4ef1-b896-dccf12f5d515\" data-v-f87c67ca=\"\">The Financial Times<\/a>. Often, when yields are low, investors flock to riskier investment opportunities.&nbsp;","In a sense, a market-neutral strategy is more digestible for a large allocator to stomach—relative to other crypto investment opportunities. The thinking goes that such strategies don't necessarily require an investor to buy into the story of a given token, but rather the notion that inefficiencies in the fast-growing crypto market can produce returns that don't exist elsewhere.&nbsp;","As for the logic behind the deal, Gamma Point offered BlockTower a technology stack and execution monitoring capabilities that the firm thinks will provide it with a moat relative to its competitors. BlockTower will continue to eye new \"tuck-ins\" — that is, acquisition deals that can help build out the firm's capabilities.&nbsp;","The firm's expansion is in line with broader market moves.","Large crypto-focused venture capital and investment firms have been expanding. Paradigm, for instance, recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/105073\/paradigm-trading-comms-hires-crypto-vc-growth\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">brought on talent<\/a> to help portfolio companies recruit and market their wares to the crypto community. a16z — which just unveiled <a href=\"https:\/\/www.theblockcrypto.com\/post\/109408\/a16z-third-crypto-venture-fund\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a new $2.2 billion fund<\/a> — has brought on several heavy hitters to help their portfolio companies with similar functions.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$35 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"$2.2 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Matthew Goetz","content":"PERSON"},{"type":"Gamma Point","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"BlockTower","content":"ORGANIZATION"},{"type":"June 28","content":"DATE"},{"type":"The Financial Times","content":"ORGANIZATION"},{"type":"Ari Paul","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}