{"summary":"The official website of the web3 credentials and rewards platform Galxe was compromised due to a DNS hijack attack on its front-end website.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255260\/web3-platform-galxe-hit-by-dns-attack-on-front-end-website?utm_source=rss&utm_medium=rss","publishDate":"2023-10-06T12:22:23","id":14132,"type":null,"title":"Web3 platform Galxe hit by DNS attack on front-end website","category":["CRYPTO ECOSYSTEMS"],"content":["The official website of the web3 credentials and rewards platform Galxe was compromised due to a DNS hijack attack on its front-end website, the team confirmed.","The team notified users of the incident, advising them not to use the site. During the attack, hackers executed a DNS exploit to take control of Galxe's official website link and redirected users to a phishing site associated with a malicious contract aiming to steal user funds.","Galxe stated the compromise targeted its account with the domain name registrar, Dynadot.","\"We’ve detected a security breach affecting the DNS record for 'galxe.com' through our Dynadot account. Please refrain from visiting the site from all channels while we are resolving the issue,\" the team <a href=\"https:\/\/twitter.com\/Galxe\/status\/1710318639381881280\" data-v-f87c67ca=\"\">said<\/a>.","The incident appears to have resulted in a loss of funds, with crypto sleuth ZachXBT <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1710308430991286513?s=20\" data-v-f87c67ca=\"\">noting<\/a> that an address linked to the hacker has received funds from Galxe users.","In total, the hacker’s <a href=\"https:\/\/debank.com\/profile\/0x4103babcfa68e97b4a29fa0b3c94d66afcf6163d\" data-v-f87c67ca=\"\">address<\/a> received over $160,000 in user funds. The same address was tied to the attacker who executed a similar DNS hijack&nbsp;on the <a href=\"https:\/\/www.theblock.co\/post\/251970\/balancer-dns-attack-frontend?utm_source=twitter&amp;utm_medium=social\" data-v-f87c67ca=\"\">Balancer<\/a> decentralized exchange on Sept. 20.","Galxe is a web3 platform that allows developers to leverage digital credential data and NFTs to reward users for their participation in various crypto activities. Users receive custom reward programs from projects and developers for attending community events, participating in governance tasks, or completing incentivized activities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"DNS","content":"ORGANIZATION"},{"type":"Galxe","content":"ORGANIZATION"},{"type":"$160,000","content":"MONEY"},{"type":"Sept. 20","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Dynadot","content":"LOCATION"},{"type":"Galxe","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}