{"summary":"Revisions to the EU’s anti-money laundering regulation show that self-hosted wallets should not be prohibited, but are still subject to transaction limits.\nThe shift from “self-hosted wallets” to “self-hosted addresses” clarifies policymakers’ intentions to oversee non-custodial accounts.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213380\/self-hosted-wallet-ban-avoided-in-new-draft-of-eus-anti-money-laundering-bill","publishDate":"2023-02-22T07:48:25","id":1413,"type":null,"title":"Self-hosted wallet ban avoided in new draft of EU’s anti-money laundering bill","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">Self-hosted addresses, formerly known as “unhosted wallets” in the European Union's policies, are back in discussion as European Parliament staff look to clarify that lawmakers do not want an outright ban on non-custodial services.<\/span>","<span data-v-f87c67ca=\"\">Privacy-enhancing crypto assets and “anonymizing instruments,\" including privacy wallets or crypto mixers, may be prohibited under the current text&nbsp;<\/span>of the anti-money laundering regulation draft bill<span data-v-f87c67ca=\"\">, <\/span>according to documents seen by The Block. The latest changes to the text clarify that these restrictive provisions should not apply to self-hosted wallets in most cases.","Non-custodial services have been in the EU's crosshairs since the Transfer of Funds Regulation (TFR) <span data-v-f87c67ca=\"\">first <a href=\"http:\/\/theblock.co\/post\/139913\/eu-parliament-aml-law-vote-crypto-wallets\" data-v-f87c67ca=\"\">sparked<\/a> debates on “unhosted wallets\" last year when it set down crypto transaction and know-your-customer rules.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When it comes to rules on transaction limits, the latest version of the European Parliament’s review of the anti-money laundering bill resulted in changing up the language to “self-hosted addresses” from “self-hosted wallets.\"&nbsp;<\/span>","With this change, policymakers aim to clarify their objective of preventing non-custodial wallets from existing without being linked to an identified account on an crypto service provider like an exchange, said Tommaso Astazi, head of regulatory affairs at lobby group Blockchain for Europe. The previous wording could have implied that crypto service providers in the EU would have been prohibited from providing non-custodial services all together.","<span data-v-f87c67ca=\"\">Self-hosted wallets will still be subject to a transaction limit of €1,000 ($1,070) if the owner cannot be identified. This aligns with the TFR<\/span><span data-v-f87c67ca=\"\">&nbsp;requiring originator and beneficiary data on crypto transactions of the same cap.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The change from “self-hosted wallets” to “self-hosted addresses,” however, may cause regulatory uncertainties since the TFR, with its text finalized, uses different language from the Parliament's AML proposal. The AML proposal under the European Council also currently refers to \"wallets\" and not \"addresses.\"<\/span>","Members of the European Parliament have until March 28 to debate the anti-money laundering files, so provisions are still subject to changes. After a vote from the two committees working on the file, the regulation will need to go through a plenary vote in Parliament, expected in April, before entering inter-institutional negotiations in May. This will be an opportunity for the European Commission, Parliament and Council to defend their positions on the file.","<span data-v-f87c67ca=\"\">Crypto entities like DAOs, NFTs and decentralized finance protocols were previously <\/span><a href=\"https:\/\/www.theblock.co\/post\/173652\/europe-aml-rules-could-implicate-defi-daos-and-nfts\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">swept<\/span><\/a><span data-v-f87c67ca=\"\"> into the regulation. While platforms trading NFTs were left out of the scope of the EU’s comprehensive Markets in Crypto-Assets framework, NFT traders could be subject to the provisions of the AML regulation.<\/span>","The European Commission first introduced the anti-money laundering legislative package in July 2021, with strong implications for crypto in the 27-nation bloc. The bundle also includes the TFR,<span data-v-f87c67ca=\"\"> which awaits a final vote in April before entering into force,<\/span><span data-v-f87c67ca=\"\">&nbsp;and sets requirements on crypto transactions. In addition, the <\/span>EU's anti-money laundering authority proposed in the package extends to crypto firms.&nbsp;"],"hashtag":["EUROPEAN PARLIAMENT","EUROZONE REGULATION"]}