{"summary":"The U.S. government holds billions of dollars of bitcoin seized during criminal investigations.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231563\/the-us-government-is-one-of-the-largest-bitcoin-whales-what-does-that-mean-for-the-crypto-market?utm_source=rss&utm_medium=rss","publishDate":"2023-05-19T12:38:52","id":14143,"type":null,"title":"The US government is one of the largest bitcoin whales. What does that mean for the crypto market?","category":["THE BLOCK"],"content":["These days, the ranks of so-called bitcoin whales — major holders like Michael Saylor's MicroStrategy and Binance boss Changpeng Zhao — include the U.S. government.&nbsp;","The government presently possesses over 50,000 BTC,&nbsp;which it <a href=\"https:\/\/www.justice.gov\/usao-sdny\/pr\/us-attorney-announces-historic-336-billion-cryptocurrency-seizure-and-conviction\" data-v-f87c67ca=\"\">seized<\/a> during an investigation into a years-old theft from the now-defunct dark market Silk Road. These holdings have since become the subject of intense scrutiny and chain-watching for any signs of life or movement.","Still, while it's clear that MicroStrategy and other whales are by all appearances keen to \"hodl\" their bitcoins, the market intentions of the U.S. government — and the overall impact their position has on the market — is less clear.&nbsp;","That level of uncertainty has been cause for concern before. Last month, <a href=\"https:\/\/www.theblock.co\/post\/228517\/bitcoin-price-crash-us-government\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a data labeling issue<\/a> on a chain-sleuthing platform mistakenly signaled that funds held by the U.S. government were on the move. Those revelations turned out to be untrue, but for a time, the market treated them as gospel.&nbsp;","These days, such matters — and the potential for legitimate movements — are the subject of chatter among trading desks.&nbsp;","\"Players have begun to monitor for the appearance of various statistically robust indicators of 'authentic' selling, and they have likewise started to observe and estimate the timing and nature of the execution, and how to respond to it in kind,\" noted Gordon Grant, co-head of trading at Genesis Trading.&nbsp;","Indeed, relative to market participants across the space, the U.S. government is perhaps viewed as the most important.&nbsp;","<span class=\"m_-7458580910839499336normaltextrun\" data-v-f87c67ca=\"\">\"Owing to the degree of transparency on-chain, there is a far greater ability to monitor the movements of these concentrated holdings than there would be for other state actors who, even if at all comparable in size, are not nearly as observable,\" Grant added. \"Hence, in terms of magnitude, psychological import, and quantitative precision, the US government's actions with bitcoin will remain extremely closely watched.\"<\/span><u data-v-f87c67ca=\"\"><\/u>","The sheer size of the U.S. government's holdings makes it an anxiety-inducing \"bogeyman\" given the prospect that — in the interest of the U.S. dollar dominance — federal officials could sell off its holdings en mass to tank the market. But in Grant's view, the government has been more tactical.&nbsp;","\"The timing and tempo of future sales may help determine if this is more than a ghoulish fascination of the broader market - such as one with a specific intent to create price effects or provide liquidity into an unbalanced market, as some EM central banks do,\" he explained.&nbsp;","Such prospective sales may also offer a new business opportunity for startups keen to get a piece of the action.","Two people familiar with the situation have told The Block that the U.S. government uses Coinbase to sell its bitcoin, and other industry firms are interested in drawing away some of that business. Coinbase declined to comment when reached.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Grant","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Gordon Grant","content":"PERSON"},{"type":"US","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}