{"summary":"Momentum on the adoption of blockchain technology has positively shifted, say researchers at Citi.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/224014\/citi-tokenized-securities-use-case?utm_source=twitter&utm_medium=social","publishDate":"2023-03-30T10:35:20","id":14148,"type":null,"title":"Citi: Tokenized securities market could reach $4 trillion by 2030","category":["COMPANIES"],"content":["Tokenizing financial and real-world assets could be the \"killer use-case\" that blockchain needs to drive a breakthrough, with trillions of dollars worth of securities tokenized by the end of the decade, according to Citi's latest global perspectives and solutions report.&nbsp;","\"Almost anything of value can be tokenized,\" Citi wrote in its March report. The bank forecasts up to $4 trillion in tokenized digital securities and up to $5 trillion of central bank digital currency could be circulating in major economies in the world, half or which could be linked to distributed ledger technology.","While the potential for tokenization via blockchain technology has been touted for some time now, it's not quite at the point of mass adoption, said Kathleen Boyle, managing editor of the Citi GPS. Since blockchain is a back-end infrastructure technology without a prominent consumer interface, its innovations are less visible.&nbsp;","Despite innovation taking time, the space is approaching an inflection point, Boyle said, and the promised potential of blockchain could soon be realized.","\"Successful adoption will be when blockchain has a billion-plus users who do not even realize they are using the technology,\" Boyle said. That will likely be driven by the adoption of central bank digital currencies, tokenized assets in gaming and blockchain-based payments on social media.&nbsp;","Mainstream adoption requires enablers including, decentralized digital identities, zero-knowledge proofs, Oracles, and secure bridges. Legal plumbing is also essential, as are regulatory considerations to allow adoption and scalability without \"hindering innovation.\"","<span data-v-f87c67ca=\"\">source: Citi GPS March 2023<\/span>","\"Although we think mass adoption could still be six to eight years away, momentum on adoption has positively shifted as governments, large institutions, and corporations have moved from investigating the benefits of tokenization to trials and proofs of concept,\" Boyle said.&nbsp;","Citi isn't alone in saying this. <a href=\"https:\/\/www.blackrock.com\/corporate\/about-us\/leadership\/larry-fink\" data-v-f87c67ca=\"\">BlackRock's Larry Fink<\/a> wrote about the operational potential of the underlying technologies in digital assets in his annual <a href=\"https:\/\/www.theblock.co\/post\/220498\/blackrock-larry-fink-digital-assets-letter\" data-v-f87c67ca=\"\">letter<\/a> to shareholders earlier this month, saying they have \"exciting applications.\"","\"In particular, the tokenization of asset classes offers the prospect of driving efficiencies in capital markets, shortening value chains, and improving cost and access for investors,\" Fink said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"Boyle","content":"PERSON"},{"type":"$5 trillion","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Larry Fink","content":"PERSON"},{"type":"$4 trillion","content":"MONEY"},{"type":"March 2023","content":"DATE"},{"type":"Kathleen Boyle","content":"PERSON"},{"type":"Citi GPS","content":"ORGANIZATION"},{"type":"Fink","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Citi","content":"ORGANIZATION"}],"hashtag":["ANALYST REPORTS","ECONOMIC INDICATORS","EQUITY MOVERS","INVESTMENT FIRMS","TRADFI BANKS"],"authors":["Adam Morgan McCarthy","The Block"]}