{"summary":"Worldpay from FIS and Flutterwave hosted a panel discussion that coincided with the launch of Worldpay’s payment processing capabilities in the United Arab Emirates (UAE) this year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236781\/the-next-wave-of-crypto-and-fintech-middle-east-and-north-africa-edition","publishDate":"2023-06-28T09:00:29","id":1414,"type":null,"title":"The Next Wave of Crypto and Fintech: Middle-East and North Africa Edition","category":["SPONSORED"],"content":["Worldpay from FIS and Flutterwave hosted a panel discussion that coincided with <a href=\"https:\/\/www.fisglobal.com\/en\/about-us\/media-room\/press-release\/2023\/worldpay-from-fis-opens-new-growth-opportunities-with-united-arab-emirates-expansion\" data-v-f87c67ca=\"\">the launch<\/a> of Worldpay’s payment processing capabilities in the United Arab Emirates (UAE) this year. The panel discussion delved into the payments landscape focusing on digital technologies transforming payments and financial services, particularly in the middle-east and the north-African (MENA) regions. Panelists included Joseph Weinberg (Co-founder of Shyft), Nabil Manji (Head of Crypto &amp; Web3 at Worldpay from FIS), Omosalewa Adeyemi (Head of Expansion &amp; Partnerships at Flutterwave) and Tom Gregory (Head of Payments and Fiat at Binance).","<iframe frameborder=\"0\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/tyz2hN1o7jM\" title=\"YouTube video player\" width=\"560\" data-v-f87c67ca=\"\"><\/iframe>","Let’s unpack the key topics that arose during the discussion: <strong data-v-f87c67ca=\"\">i) consumer behavior &amp;<\/strong><strong data-v-f87c67ca=\"\"> the rise of<\/strong> <strong data-v-f87c67ca=\"\">digital payments,<\/strong> <strong data-v-f87c67ca=\"\">ii) payments infrastructure &amp; the impact of cryptocurrencies as well as, iii) CBDCs &amp; fragmented crypto regulatory frameworks<\/strong>.&nbsp;","<em data-v-f87c67ca=\"\">\"If you roll the clock forward 5-10 years, what you're going to see is, at least in MENA..., [is that] you will have gone from [an] environment... of a few acquiring banks that had maybe a few PSPs built on top of them, to this very… competitive ecosystem where you've got a lot of different fintechs that are focused on different verticals, or different types of payments or different use cases.”<\/em> – Nabil Manji, Head of Crypto &amp; Web3, Worldpay from FIS","<strong data-v-f87c67ca=\"\">Consumer behavior &amp; the rise of digital payments<\/strong>","Mass adoption dynamics are difficult to predict, but disruptive innovations do drive new market behavior and preferences. Over the past two decades, the internet and the mobile revolution helped birth the financial-technology (“fintech”) sector that partly comprised the <a href=\"https:\/\/www.mckinsey.com\/~\/media\/mckinsey\/industries\/financial%20services\/our%20insights\/the%202022%20mckinsey%20global%20payments%20report\/the-2022-mckinsey-global-payments-report.pdf\" data-v-f87c67ca=\"\">~US2.1 trillion<\/a> in revenues for 2021 across the global payments industry. Similarly, digital assets on public blockchain networks have reached a total market capitalization of ~US$1.2 trillion (as of writing) in a little more than a decade and are undergoing <a href=\"https:\/\/www.dbresearch.com\/PROD\/RPS_EN-PROD\/PROD0000000000504589\/The_Future_of_Payments_-_Part_III__Digital_Currenc.pdf?undefined&amp;realload=TR~yEYx1x7TlZZ2YT7fSMMtw9ctqZN\/a6AHVs~uEnSCFJvX9xeRl1h2yBEsm0KDi\" data-v-f87c67ca=\"\">mass adoption trends<\/a> similar to that of the internet itself. Ahead of the curve are the Middle East and North African (MENA) regions, which are amongst the <a href=\"https:\/\/blog.chainalysis.com\/reports\/middle-east-north-africa-cryptocurrency-geography-report-2022-preview\/\" data-v-f87c67ca=\"\">regions<\/a> for crypto and CBDC adoption. Remittance payments and an increasingly clear crypto regulatory regime are significant contributors to this trend.","Over the past 2-3 years, the speakers emphasized the COVID-19 pandemic’s impact on payment behavior globally – accelerating the adoption of digital payment methods and “<a href=\"https:\/\/a16z.com\/2022\/12\/16\/super-app-definition-guide\/\" data-v-f87c67ca=\"\">super-apps<\/a>” as people sought to reduce physical contact to minimize the spread of the virus. Another prominent shift in behavior is a move away from cash-usage worldwide, especially in emerging markets such as the MENA region. The <a href=\"https:\/\/www.fisglobal.com\/en\/global-payments-report\" data-v-f87c67ca=\"\">2023 FIS report<\/a> shows a decline in cash usage from 26% of all point-of-sale (POS) transaction value in 2019, to 16% in 2022. As such, the super-app model is showing <a href=\"https:\/\/impact.economist.com\/perspectives\/sites\/default\/files\/ei-mastercard-super_apps-report-v11.pdf\" data-v-f87c67ca=\"\">significant consumer appeal<\/a> in the MENA region with prominent players there (e.g., <a href=\"https:\/\/www.careem.com\/\" data-v-f87c67ca=\"\">Careem<\/a> &amp; <a href=\"https:\/\/halan.com\/\" data-v-f87c67ca=\"\">Halan<\/a>) aiming to recreate successes in China (e.g., WeChat &amp; Alipay).","Consumers have also turned to online shopping in larger numbers in the past 2-3 years, requiring businesses to quickly adapt to meet this demand. E-commerce platforms and payment providers therefore saw significant growth in the same time period and many traditional brick-and-mortar retailers shifted their focus to online sales. Business-to-business (B2B) transactions and person-to-business (P2B) payments are therefore also <a href=\"https:\/\/www.fisglobal.com\/en\/global-payments-report\" data-v-f87c67ca=\"\">on the rise<\/a>.","<em data-v-f87c67ca=\"\">“…merchants are always driven by consumer behavior… merchants will always want to promote the payment types that their customers are likely to use.” <\/em>– Omosalewa Adeyemi, Head of Expansion\/Partnerships, Flutterwave","<strong data-v-f87c67ca=\"\">Payments infrastructure &amp; the impact of cryptocurrencies<\/strong>","The pandemic has also highlighted the need for robust and reliable payment infrastructure, especially in emerging markets where increased use of digital payment methods has put pressure on existing payment systems. There is therefore a flurry of activity from software developers who are partnering with banks and (potentially) incorporating blockchain technologies to create seamless and convenient digital payment experiences. Blockchain integrations in these solutions may take many forms:","According to the <a href=\"https:\/\/go.chainalysis.com\/geography-of-crypto-2022-report.html\" data-v-f87c67ca=\"\">2022 Geography of Cryptocurrency<\/a> Report by Chainalysis, MENA-based users received $566 billion in cryptocurrency from July 2021 to June 2022, a 48% increase from the previous year. Further, the Egyptian National Bank has begun a project to build a crypto-based remittance corridor between Egypt and the UAE, where many Egyptian natives work. In countries like Turkey and Egypt, fluctuating cryptocurrency prices have coincided with rapid fiat currency devaluations, strengthening the appeal of crypto for savings preservation.","The panel was generally optimistic about the potential for crypto and blockchain technologies to drive financial inclusion and economic growth in MENA and emerging markets. However, they also noted significant challenges for implementing know-your-customer (KYC), anti-money laundering (AML) and combating financing of terrorism (CFT) compliance for transactions on permissionless and decentralized blockchains.","Regardless, on-chain stablecoins are already emergent as a means for payments. There has been incredible growth in on-chain stablecoin issuance over the past three years going from ~US$5billion in early-2020, to ~US$130 billion today (although note that on-chain stablecoin issuance is also correlated to speculation). We also see significant stablecoin issuance in low-fee blockchain ecosystems (e.g., Tron, BSC). This supports findings by the <a href=\"https:\/\/www.imf.org\/en\/Publications\/fintech-notes\/Issues\/2022\/09\/26\/Regulating-the-Crypto-Ecosystem-The-Case-of-Unbacked-Crypto-Assets-523715\" data-v-f87c67ca=\"\">International Monetary Fund<\/a> (IMF), and the <a href=\"https:\/\/documents1.worldbank.org\/curated\/en\/206121625810043720\/pdf\/Developing-Digital-Payment-Services-in-the-Middle-East-and-North-Africa-A-Strategic-Approach.pdf\" data-v-f87c67ca=\"\">World Bank Group<\/a> about stablecoin adoption both as a means of payment and as a store of value in emerging markets.","","","During its discussions, the panel stressed the importance of collaboration between regulators and fintech companies to drive digital payment systems adoption, such as incentivizing central bank digital currencies (CBDCs) adoption through joint efforts.","<strong data-v-f87c67ca=\"\">CBDCs &amp; fragmented crypto regulatory frameworks<\/strong>","<a href=\"https:\/\/www.bis.org\/about\/bisih\/topics\/cbdc.htm\" data-v-f87c67ca=\"\">86% of all central banks<\/a> are currently researching central bank digital currency (CBDC) as of 2021. Unlike bank deposits, CBDCs could represent a claim on the central bank and be issued as legal tender, like cash (although exact specifications for CBDCs <a href=\"https:\/\/www.annualreviews.org\/doi\/abs\/10.1146\/annurev-economics-051420-020324?casa_token=0ssvdMwmWwsAAAAA:O18ZQTRw423EGU_Iczoux2KoK_yp87Tf7p8D6lmI25XBhc7W3Snr9-7Vu2tf7LrXphpB1OT1gz_9\" data-v-f87c67ca=\"\">may vary greatly<\/a> depending on the jurisdiction they are issued in). There is a broad spectrum of potential advantages for CBDCs, such as enhanced verification and enforcement of KYC\/AML\/CFT protocols. CBDCs may also offer novel monetary instruments for central banks to bolster financial stability during unforeseen events. In the MENA region, countries like the United Arab Emirates and Saudi Arabia have explored domestic and cross-border settlements using a single regional currency. Israel has also begun testing a digital shekel. With many MENA countries making strides in CBDC adoption, the region is actively participating in the charge for financial inclusion through CBDCs. For example, countries such as Iran, Saudi Arabia, and the UAE are piloting CBDCs, signaling a potential shift in the way payments are made and the role of central banks in the digital age.","","","The rapid innovation in the payments space has left many regulatory bodies struggling to reconcile how pre-existing laws and frameworks apply. For cryptoassets and decentralized blockchains, this has led to diverse global responses – from proactive rule-making in some MENA countries (e.g.,<a href=\"https:\/\/www.pwc.com\/gx\/en\/about\/new-ventures\/global-crypto-regulation-report-2023.html\" data-v-f87c67ca=\"\"> Dubai’s authority<\/a> setup solely for virtual assets), \"regulation by enforcement\" in the US, to a complete ban on cryptocurrency transactions by China's PBoC. The future role of cryptocurrencies in the global economy and potential prohibitions by countries remains uncertain.","<em data-v-f87c67ca=\"\">“... the regulatory environment… [is] developing… we're still defining something that's going to take another 10 years to mature.”<\/em> – Tom Gregory, Head of Payments &amp; Fiat, Binance","","","The above table illustrates the highly fragmented nature of crypto regulations across the globe, adding significant friction to product offerings from enterprises that incorporate blockchain technologies. Even amid regulatory uncertainty however, various fintechs have gone ahead with blockchain integrations in the US (e.g., Robinhood, Paypal, Venmo, Cash app and Strike). The panelists strongly agreed about the immediate need for clear regulatory frameworks surrounding cryptocurrency and digital assets. They also noted the importance of building trust and addressing concerns related to security, privacy, and regulatory compliance in the crypto industry.","“…<em data-v-f87c67ca=\"\"> we're going through a lot of rearchitecting… regulations… rearchitect the players, the markets, and ultimately how we access retail consumers and institutions… and we need to make sure we get that right<\/em>.” – Joseph Weinberg, Co-founder, Shyft","Summing up, the panel unpacked the fast-paced transformation of payment systems, cryptocurrencies, CBDCs, regulations and the challenges\/opportunities for payment processors and merchants, with a focus on emerging economies such as the MENA. The panelists stressed i) the importance of unified payment infrastructures, ii) the adaptive nature of businesses in this competitive landscape, and iii) the need for collaboration between regulators and fintech companies as well as, iv) addressing the fragmented and diverse global crypto regulations.","As the MENA region embraces technological advances in the payments industry, an intriguing question arises: will this adoption of cutting-edge technology solutions help propel the region to become a growth champion in the global financial landscape over the coming decades?","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Head of Payments &amp; Fiat","content":"ORGANIZATION"},{"type":"MENA","content":"ORGANIZATION"},{"type":"86%","content":"PERCENT"},{"type":"$566 billion","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"Flutterwave","content":"LOCATION"},{"type":"the <a href=\"https:\/\/documents1.worldbank.org\/curated\/en\/206121625810043720\/pdf\/Developing-Digital-Payment-Services-in-the-Middle-East-and-North-Africa-A-Strategic-Approach.pdf\" data-v-f87c67ca=\"\">World Bank Group","content":"ORGANIZATION"},{"type":"Head of Crypto &amp; Web3","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Nabil Manji","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Egyptian National Bank","content":"ORGANIZATION"},{"type":"19","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"International Monetary Fund<\/a> (IMF","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"CFT","content":"ORGANIZATION"},{"type":"PBoC","content":"ORGANIZATION"},{"type":"Venmo","content":"LOCATION"},{"type":"Paypal","content":"ORGANIZATION"},{"type":"Tom Gregory","content":"PERSON"},{"type":"Joseph Weinberg","content":"PERSON"},{"type":"26%","content":"PERCENT"},{"type":"US$130 billion","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"July 2021","content":"DATE"},{"type":"Iran","content":"LOCATION"},{"type":"UAE","content":"ORGANIZATION"},{"type":"Nabil Manji (Head of Crypto &amp; Web3","content":"ORGANIZATION"},{"type":"Saudi Arabia","content":"LOCATION"},{"type":"Turkey","content":"LOCATION"},{"type":"United Arab Emirates (UAE","content":"ORGANIZATION"},{"type":"FIS","content":"ORGANIZATION"},{"type":"Omosalewa Adeyemi","content":"PERSON"},{"type":"fintech","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Careem<\/a> &amp; <a href=\"https:\/\/halan.com\/\" data-v-f87c67ca=\"\">Halan","content":"ORGANIZATION"},{"type":"United Arab Emirates","content":"ORGANIZATION"},{"type":"3 years","content":"DATE"},{"type":"Israel","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Tom Gregory (","content":"PERSON"},{"type":"Head of Expansion\/Partnerships","content":"ORGANIZATION"},{"type":"US$1.2 trillion","content":"MONEY"},{"type":"Egypt","content":"LOCATION"},{"type":"Middle East","content":"LOCATION"},{"type":"June 2022","content":"DATE"},{"type":"US$5billion","content":"MONEY"},{"type":"Shyft","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"WeChat &amp; Alipay)","content":"ORGANIZATION"},{"type":"today","content":"DATE"},{"type":"Omosalewa Adeyemi (Head of Expansion &amp; Partnerships","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"US","content":"LOCATION"},{"type":"48%","content":"PERCENT"},{"type":"Fiat","content":"ORGANIZATION"},{"type":"10 years","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["The Block Research","The Block"]}