{"summary":"A revised lawsuit has been filed against Bitfinex, Tether, and affiliated entities for allegedly manipulating the crypto market\nBittrex and Poloniex exchanges have been added as new defendants in the amended lawsuit\nThe lawsuit claims that the defendants fraudulently inflated crypto prices and caused “billions of dollars of damage” to traders","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/67379\/amended-lawsuit-filed-against-bitfinex-and-tether-for-allegedly-manipulating-crypto-market-bittrex-and-poloniex-added-as-new-defendants","publishDate":"2020-06-04T05:00:53","id":1415,"type":null,"title":"Amended lawsuit filed against Bitfinex and Tether","category":["Legal"],"content":["An amended class-action lawsuit has been filed against Bitfinex, Tether, and affiliated entities for allegedly manipulating the cryptocurrency market.","Crypto exchanges Bittrex and Poloniex have been added as new defendants in the updated lawsuit, filed on June 3 in the Southern District Court of New York. The initial lawsuit was <a href=\"https:\/\/www.theblockcrypto.com\/post\/42299\/class-action-lawsuit-against-bitfinex-and-tether-filed-by-lawyers-who-successfully-sued-craig-wright\" data-v-f87c67ca=\"\">filed<\/a> in October 2019.","The <a href=\"https:\/\/www.courtlistener.com\/docket\/16298999\/110\/in-re-tether-and-bitfinex-crypto-asset-litigation\/\" data-v-f87c67ca=\"\">156-page amended lawsuit<\/a> alleges that the defendants manipulated the crypto market by fraudulently inflating prices and caused “billions of dollars of damage” to traders.","“Tether issued billions of USDT to itself with no U.S. dollar backing—simply creating the USDT out of thin air,” the filing says. “Tether hid that fact by ‘selling’ newly issued USDT to Bitfinex. [...] Because Bitfinex and Tether were essentially the same, Tether could simply transfer newly issued USDT into its account on Bitfinex without receiving U.S. dollars in exchange, as was required from genuine customers.”","The amended lawsuit further alleges that Bittrex and Poloniex were “knowing participants in the scheme,” meaning they knew that Bitfinex was transferring large amounts of unbacked USDT to their exchanges.","“Bittrex and Poloniex accepted these transfers and knowingly allowed Bitfinex and Tether—as owners of the addresses holding the USDT—to sell the debased USDT for cryptocommodities on their exchanges, driving up the cryptocommodity prices,” says the filing.&nbsp;","There are also some revisions to the plaintiff list in the amended lawsuit. Crypto trader Matthew Script has been added as an additional plaintiff, while David Leibowitz has been removed as a plaintiff. Global Trade Solutions AG, which was initially one of the defendants, has now been removed in the amended filing.","It is worth noting that the initial lawsuit claimed the total damages of $1.4 trillion. The amended filing does not mention that amount. The plaintiffs are now rather seeking “reasonable costs of suit, pre- and post-judgment interest, and reasonable attorneys’ fees” and are demanding a trial by jury for all claims.","It remains to be seen what a jury decides. The plaintiffs are represented by Vel Freedman and Kyle Roche of Roche Cyrulnik Freedman LLP – the lawyers who are also involved in a federal lawsuit against Craig Wright from last year. Other representatives in the amended lawsuit are law firms Selendy &amp; Gay PLLC and Schneider Wallace Cottrell Konecky LLP.","Following publication of this article, Bitfinex and Tether released a statement denouncing the amended class-action lawsuit filing.","“Even after taking three full months to amend their complaint, the plaintiffs’ allegations remain untethered to either the facts or the law. They conflate perceived correlation with causation in an effort to prop up theories that are untrue and unsupportable,\" Bitfinex general counsel Stuart Hoegner said in a statement, going on to add: \"Bitfinex and Tether will vigorously defend themselves, their customers, their stakeholders, and the crypto community against these unfounded allegations and continue to counter fiction with facts.\"","<strong data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Editor's Note:<\/em><\/strong><em data-v-f87c67ca=\"\">&nbsp;This article has been updated to note that the lawsuit involving Craig Wright was not won.<\/em>"],"hashtag":["LAWSUITS","TETHER"]}