{"summary":"The Block&#x27;s data dashboard shows that the so-called BTC DVol Index barely budged on the news that the SEC is suing Binance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233232\/crypto-volatility-sec-lawsuit-binance?utm_source=rss&utm_medium=rss","publishDate":"2023-06-06T03:47:47","id":14161,"type":null,"title":"Crypto volatility remains low in wake of SEC lawsuit against Binance","category":["MARKETS"],"content":["The crypto market has been locked in one of the least-volatile periods of its history, and it appears that not even the United States Securities and Exchange Commission lawsuit against Binance can shake up a sleepy trading regime.","Crypto prices fell in the wake of the agency's announcement of its <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\">lawsuit against exchange behemoth Binance<\/a>. The SEC alleges the firm misled customers and misdirected funds to a separate investment fund owned by the firm's chief executive officer, Changpeng 'CZ' Zhao.&nbsp;","Still, volatility in the wake of the news remains low, with implied options volatility — a gauge for the market's expectation of future volatility throughout an options contract's lifetime — compressed. The dynamic reflects the belief in the market that volatility will remain low — a bet that's proven profitable for large traders in recent months.&nbsp;","The Block's data dashboard shows that the so-called BTC DVol Index picked up slightly, rising from 39 on June 3&nbsp;— its lowest level of the year — to 41 on June 5.&nbsp;","One trader at a large options and volatility trading shop lamented: \"I've been shitting blood with the decay so tell me about it.\"","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/options\/btc-dvol-index-vol-of-vol\/embed\" title=\"BTC DVol Index Vol of Vol\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Seasonality may also be at play. \"We should consider the summer factor,\" noted Laura Vidiella of LedgerPrime. \"Vols are already lowest since 2020 — historically, summers are always flat and low Vol, so traders are already positioned.\"","The lack of volatility following the SEC's announcement may also be tied to large traders having already expected some form of regulatory action against the firm. Still, unlike the meltdown of defunct giant FTX, there is no indication that customer funds have been impacted, Vidiella added. Nor is it clear if the SEC's authority will extend to Binance.","\"With FTX, the consequence of events was more obvious because of the connection with Alameda and the leaked financials,\" she said, adding:&nbsp;\"There were a few billion the market knew there was a chance were missing, and so the market reacted accordingly. With Binance, the market reacted with an obvious drop. But that’s all the information we have.\"","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"United States Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Vidiella","content":"PERSON"},{"type":"summer","content":"DATE"},{"type":"Laura Vidiella of LedgerPrime","content":"ORGANIZATION"},{"type":"June 5","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Changpeng","content":"PERSON"},{"type":"June 3","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["BINANCE"],"authors":["Frank Chaparro","The Block"]}