{"summary":"Bitcoin’s workaround for creating tokens is now being used on other chains that don’t need a workaround. Here are some reasons why.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why?utm_source=rss&utm_medium=rss","publishDate":"2023-12-06T08:29:15","id":14167,"type":null,"title":"BRC-20 style tokens are spreading to chains beyond Bitcoin. But why?","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">When the <span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/257008\/ordi-ordi-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ordi.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ORDI<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -4.064%\n    <\/span><\/a> <!----><\/span> token temporarily crossed a <\/span><a href=\"https:\/\/www.theblock.co\/post\/266146\/bitcoin-ordinals-token-ordi-jumps-35-over-past-24-hours\" data-v-f87c67ca=\"\">$1 billion market cap<\/a> earlier this week, it became the first BRC-20 token to hit this milestone.&nbsp;","Following in its wake are a number of other BRC-20 tokens, all hoping to be the next hyped up memecoin or <i data-v-f87c67ca=\"\">coin du jour<\/i>. Yet what’s peculiar is that these tokens — which were created on Bitcoin through a workaround because it doesn’t have native support for tokens —&nbsp;are now expanding to other chains that do support native tokens.","On Bitcoin, an inscription is where an individual satoshi — the smallest unit of bitcoin —&nbsp;gets associated with a piece of data, such as an image for an NFT or a token. This is done using a small amount of data storage space that’s available when making transactions. Tokens made in this way on Bitcoin are called BRC-20 tokens and each token is part of its own collection.&nbsp;","When brought to other chains, these token standards are given their own names, like PRC-20 on Polygon PoS, but it’s the same core idea. Such tokens include <a href=\"https:\/\/www.theblock.co\/post\/236632\/ordinals-like-tokens-on-ethereum-surge-past-1-million-in-volume\" data-v-f87c67ca=\"\">Ethscriptions<\/a> on Ethereum, Doginals on Dogecoin and Solana Inscriptions on Solana.","The blockchains Celo, Avalanche and Fantom have each seen more than 20 million inscriptions on their networks, while Polygon PoS counts 109 million inscriptions, according to a <a href=\"https:\/\/dune.com\/hildobby\/inscriptions\" data-v-f87c67ca=\"\">Dune Analytics dashboard<\/a> created by Hildobby, a pseudonymous researcher at VC firm Dragonfly. In total there have been more than 200 million inscriptions for thousands of tokens across 11 blockchains other than Bitcoin.","This is also causing huge spikes in network activity on these chains. These blockchains are seeing major surges in the number of transactions made per day as users mint and transfer these tokens. For instance, the number of transactions being made per day on the Celo blockchain, as a seven-day moving average, has risen from 277,000 transactions per day to 3.7 million.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/evm-chains-stats\/transaction-count-for-evm-chains\/embed\" title=\"Transaction Count on EVM Chains (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","This activity has even caught the eye of Tron founder Justin Sun. He posted on X <a href=\"https:\/\/twitter.com\/justinsuntron\/status\/1732259173109567805\" data-v-f87c67ca=\"\">asking for community feedback<\/a> on bringing support for inscriptions to Tron and enabling the creation of BRC-20 tokens on the network.&nbsp;","Beyond this, NFTs are also being launched on other blockchains — that again, have native NFT support — using the same approach. For instance, Ethereum Punks has recreated the original CryptoPunk collection but using inscriptions.","The development has raised questions over why these tokens are spreading to other chains. These chains have their own native support for creating tokens so they don’t need to apply this workaround. Plus, these tokens are arguably bad for the network since they aggressively expand the blockchain’s data requirements, making it harder for those running nodes or validators on the networks — a reason why some Bitcoin developers are <a href=\"https:\/\/wublock.substack.com\/p\/bitcoin-developers-discuss-network?utm_source=substack&amp;utm_medium=email\" data-v-f87c67ca=\"\">trying to get rid<\/a> of inscriptions.","Eric Wall, co-founder of Bitcoin NFT collection Taproot Wizards, reckoned that these kinds of tokens are proving popular because they enable wider participation in the token mining process. He said this is somewhat similar to proof-of-work mining that is used for Bitcoin — something that’s no longer particularly accessible to the average person.&nbsp;","“If you make it so that the issuance of 100% of the coin supply of a BRC-20, SLP-20 or [Ethereum Virtual Machine]-equivalent derivative requires you to spam not one, not two, but several days (or even months!) of full blocks in any of these chains it means you now have [an] open-to-anyone issuance mechanism. A bit similar to Proof-of-Work mining issuance; we can call it ”Proof-of-Wasted-Blockspace.” he said on X.","HedgedHog, a high-profile crypto trader and co-founder of eGirl Capital, said that speculation is likely taking place because these tokens are a new vertical with no previous pricing metrics or point of reference. “I kind of think it's just flavor of the month,” he said. “They are taking off but it's all speculation.”","Another element is that transacting with inscription-based tokens can be cheaper than with tokens built natively on blockchains. This is because it's cheaper to move, for instance, Ethereum's native coin ether (ETH) — and the inscription-based token along with it — than using a token built natively on Ethereum using smart contracts.","<span class=\"css-1qaijid r-bcqeeo r-qvutc0 r-poiln3\" data-v-f87c67ca=\"\">\"Inscription-based tokens are expanding to chains that have native token support because the inscriptions approach is 10x+ cheaper than using Smart Contracts and just as decentralized,\" said Tom Lehman, creator of Ethscriptions, claiming that smart contracts are unnecessary and a waste of money.<br data-v-f87c67ca=\"\">\n<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Blockspace","content":"ORGANIZATION"},{"type":"Bitcoin NFT","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Hildobby","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Fantom","content":"PERSON"},{"type":"Eric Wall","content":"PERSON"},{"type":"X.","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Tron","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"SLP","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"-4.064%","content":"PERCENT"},{"type":"Justin Sun","content":"PERSON"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"PRC","content":"ORGANIZATION"},{"type":"Ethereum Punks","content":"ORGANIZATION"},{"type":"Solana Inscriptions on Solana","content":"ORGANIZATION"},{"type":"Taproot Wizards","content":"ORGANIZATION"},{"type":"Tom Lehman","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["BITCOIN","CRYPTOPUNKS","ETHEREUM"],"authors":["Tim Copeland","The Block"]}