{"summary":"The developer of the popular video game, Mojango Studios, adopted a restrictive stance on NFTs and blockchain in a July 20 post.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158759\/minecraft-developer-mojang-to-restrict-use-of-nfts-blockchain-tech-with-guideline-update?utm_source=rss&utm_medium=rss","publishDate":"2022-07-20T13:31:07","id":14162,"type":null,"title":"Minecraft developer Mojang to restrict use of NFTs, blockchain tech with guideline update","category":["THE BLOCK"],"content":["Non-fungible token (NFT) integrations are \"generally not something we will support or allow,\" Minecraft developer Mojang Studios said Wednesday.&nbsp;","The comments came in <a href=\"https:\/\/www.minecraft.net\/en-us\/article\/minecraft-and-nfts\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">a blog post<\/a> published on the official Minecraft website and come ahead of a planned update to the Minecraft community guidelines.&nbsp;","Mojang said it is opposed to NFTs on the grounds that their use would create a culture of unequal access in Minecraft. \"In our Minecraft Usage Guidelines, we outline how a server owner can charge for access, and that all players should have access to the same functionality. We have these rules to ensure that Minecraft remains a community where everyone has access to the same content. NFTs, however, can create models of scarcity and exclusion that conflict with our Guidelines and the spirit of Minecraft,\" the firm said.","The company went on to say:","\"To ensure that Minecraft players have a safe and inclusive experience, blockchain technologies are not permitted to be integrated inside our client and server applications, nor may Minecraft in-game content such as worlds, skins, persona items, or other mods, be utilized by blockchain technology to create a scarce digital asset.\"","Mojang didn't name any specific projects by name that use NFTs in conjunction with Minecraft. The Block Research recently highlighted <a href=\"https:\/\/www.theblockresearch.com\/nftworlds-leveraging-on-minecrafts-source-code-141220\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">NFTWorlds<\/a>, which uses Minecraft's source code as a basis for an NFT-powered metaverse.&nbsp;","In a statement posted to its Discord, the NFTWorlds team said it was \"blindsided\" by the Mojang statement.","\"We have talked with Minecraft's IP department multiple times in the past. They have never clearly indicated that anything we were doing was going to be ruled on\/restricted (other than existing EULA items, which we complied with for the entirety of the project, such as our stance on advertising\/IP within the game),\" the team wrote. \"I know this is extreme cause for concern in the community, and it is for us too. But we're currently considered all options, and will do our best to figure out another option going forward, even if thats a pivot.\"","In its blog post, Mojang didn't completely shut the door on the use of blockchain tech in Minecraft.","\"We will also be paying close attention to how blockchain technology evolves over time to ensure that the above principles are withheld and determine whether it will allow for more secure experiences or other practical and inclusive applications in gaming. However, we have no plans of implementing blockchain technology into Minecraft right now,\" the company said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Mojang","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Minecraft","content":"PERSON"},{"type":"EULA","content":"ORGANIZATION"},{"type":"Minecraft","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Minecraft Usage Guidelines","content":"ORGANIZATION"},{"type":"Mojang Studios","content":"ORGANIZATION"},{"type":"Minecraft","content":"ORGANIZATION"},{"type":"Block Research","content":"ORGANIZATION"}],"hashtag":[],"authors":["Michael McSweeney","The Block"]}