{"summary":"ConsenSys has updated its privacy policy, stating that it collects IP addresses and wallet addresses of some MetaMask users.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/189717\/consensys-says-it-collects-ip-addresses-of-metamask-users-via-infura?utm_source=cryptopanic&utm_medium=rss","publishDate":"2022-11-24T06:01:32","id":14179,"type":null,"title":"ConsenSys says it collects IP addresses of MetaMask users via Infura","category":["CRYPTO INFRASTRUCTURE"],"content":["<span data-v-f87c67ca=\"\">Ethereum-focused software company ConsenSys collects IP addresses and wallet address information of those who access Ethereum wallet MetaMask via the blockchain infrastructure service Infura. That's according to its updated <a href=\"https:\/\/consensys.net\/privacy-policy\/\" data-v-f87c67ca=\"\">privacy policy<\/a>.<\/span>","<span data-v-f87c67ca=\"\">ConsenSys owns both MetaMask and Infura. Infura runs blockchain nodes on behalf of wallets and individuals. When someone makes a blockchain transaction via their MetaMask wallet, it defaults to Infura, which broadcasts the transaction to the Ethereum blockchain. MetaMask connects to Infura through what's called a remote call procedure service (RPC).<\/span>","<span data-v-f87c67ca=\"\">“When you use Infura as your default RPC provider in MetaMask, Infura will collect your IP address and your Ethereum wallet address when you send a transaction,” ConsenSys said.<\/span>","<span data-v-f87c67ca=\"\">ConsenSys added that if users accessed MetaMask with alternative RPC providers like Ankr, Alchemy and others, the firm would not collect such data. Still, it pointed out that third-party RPC providers may collect such data if they want to.<\/span>","The concern is that companies collecting both on-chain data, like blockchain addresses and transactions, and off-chain data, like IP addresses, could be able to identify individuals and reduce the amount of privacy available on the network.","Yet MetaMask Founder Dan Finlay <a href=\"https:\/\/twitter.com\/danfinlay\/status\/1595647164520140800\" data-v-f87c67ca=\"\">said<\/a> on Twitter that he understands MetaMask is not using IP addresses even if they are being temporarily stored. \"<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">I think we can get this fixed soon,\" he said.<\/span>","<span data-v-f87c67ca=\"\">Earlier this year, ConsenSys<\/span> <a href=\"https:\/\/www.theblock.co\/post\/137740\/consensys-raises-450-million-series-d-at-7-billion-valuation#:~:text=The%20Block%3A%20ConsenSys%20raises%20%24450%20million%20Series%20D%20at%20%247%20billion%20valuation\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">raised $450 million<\/span><\/a><span data-v-f87c67ca=\"\"> in a series D round that closed at a $7 billion valuation, making it one of the largest players in the crypto space. The blockchain firm is led by Joseph Lubin, who played a role in the launch of Ethereum.<br data-v-f87c67ca=\"\">\n<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$7 billion","content":"MONEY"},{"type":"Joseph Lubin","content":"PERSON"},{"type":"$450 million","content":"MONEY"},{"type":"Infura","content":"LOCATION"},{"type":"Dan Finlay","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"RPC","content":"ORGANIZATION"}],"hashtag":["DATA PROVIDERS","WALLET MAKERS"],"authors":["Vishal Chawla","The Block"]}