{"summary":"Ulvetanna, a startup building hardware to increase the efficiency of zero-knowledge-proof generation, raised $15 million in seed funding. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203568\/zk-proof-funding-seed?utm_source=onecryptofeed&utm_medium=social","publishDate":"2023-01-19T06:00:44","id":14173,"type":null,"title":"ZK proof startup Ulvetanna raises $15 million in seed funding","category":["DEALS"],"content":["Ulvetanna, a zero-knowledge-proof (ZKP) hardware firm, closed a $15 million seed round led by Bain Capital Crypto and Paradigm. The round, which Jump Crypto also participated in, valued the startup at $55 million, according to Ulvetanna's founder and CEO Radisav Cojbasic.","Led by Cojbasic, the firm is building hardware that looks to accelerate the process of generating ZKPs, a cryptographic method of authentication to prove specific information without revealing the content of said information. In crypto, this technology has been historically used in scaling solutions for blockchain networks, particularly Ethereum.&nbsp;","\"These investors have strong internal research teams which identified the importance of ZKP acceleration early,\" he said in email correspondence with The Block. \"They were looking to make a move in this direction and we quickly structured a deal,\" he added.&nbsp;","<span data-v-f87c67ca=\"\">\"Web3 infrastructure is the first innovative tech in recent history that requires hardware acceleration on day one,\" Cojbasic said. \"<\/span><span data-v-f87c67ca=\"\">We consider ourselves web3 compute infrastructure enablers and we believe that mass adoption will be achieved with our custom web3-friendly ZKP compute platform.\"<\/span>","Typically using general-purpose computing technology, proof generation can be expensive and computationally intensive — and that's without mentioning the challenge of keeping up with the many types of ZKPs in development today, a headache for even the most skilled engineers.&nbsp;","To increase efficiency, Cojbasic said that Ulvetanna's team — which includes programmers and engineers from Coinbase, Microsoft and Intel — will leverage its cryptographic knowledge with specifically designed hardware to accelerate proof production.","Cojbasic believes that the production of proofs will naturally lend itself to revenue generation, in a similar way to how acting as a validator on a proof-of-stake blockchain or solving cryptographic puzzles on a proof-of-work chain reaps rewards.&nbsp;","<span data-v-f87c67ca=\"\">\"Provers who generate ZKPs will be essential actors in the networks\/protocols, similar to how miners and stakers have the role of confirming transactions on proof-of-work and proof-of-s<\/span><span data-v-f87c67ca=\"\">take blockchains,\" he explained. \"Once the networks\/protocols see wider adoptions, provers will be compensated per processed transaction.\"&nbsp;<\/span>","While last year saw a dramatic drop in revenues as a result of declining bitcoin prices and soaring energy costs, in 2021 Bitcoin miners <a href=\"https:\/\/www.theblock.co\/linked\/128475\/bitcoin-mining-2021-revenue\" data-v-f87c67ca=\"\">drew in<\/a> more than $15 billion in revenue. According to a post on its website in April last year, Paradigm's Chief Technology Officer and research partner Georgios Konstantopoulos <a href=\"https:\/\/www.paradigm.xyz\/2022\/04\/zk-hardware\" data-v-f87c67ca=\"\">believes<\/a> that the opportunity for ZK provers could be similar to the size of the mining market for proof-of-work blockchains.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/bitcoin\/bitcoin-miner-revenue-daily\/embed\" title=\"Bitcoin Miner Revenue (Daily, 7DMA)\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","While currently in pre-production, Ulvetanna plans to primarily focus on generating ZKPs for Layer 2 zero-knowledge Ethereum Virtual Machine networks, a scaling technology that utilizes zero-knowledge technology. It will use the funding to further build out its team and invest further in servers and hardware computer chipping to power its platform.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Radisav Cojbasic","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"April last year","content":"DATE"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"LOCATION"},{"type":"Ulvetanna","content":"ORGANIZATION"},{"type":"Intel","content":"ORGANIZATION"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Cojbasic","content":"PERSON"},{"type":"Cojbasic","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"Georgios Konstantopoulos","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"$55 million","content":"MONEY"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Tom Matsuda","The Block"]}