{"summary":"So far, more than $8.2 million has been withdrawn from crypto exchange FTX since transactions started moving again in the last hour.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185474\/ftx-sees-8-million-in-withdrawals-but-crypto-traders-remain-skeptical","publishDate":"2022-11-10T13:17:28","id":14177,"type":null,"title":"FTX sees $8 million in withdrawals, but crypto traders remain skeptical","category":["COMPANIES"],"content":["<strong data-v-f87c67ca=\"\">UPDATE (3:05 p.m. ET): <\/strong>","Zane Tackett, FTX’s former head of institutional sales, wrote on Twitter earlier today:","“Per our Bahamian HQ's regulation and regulators, we have begun to facilitate withdrawals of Bahamian funds. As such, you may have seen some withdrawals processed by FTX recently as we complied with the regulators.\"","Tackett went on to claim the withdrawn amounts represent a “small fraction” of the assets FTX holds and “we are actively working on additional routes to enable withdrawals for the rest of our userbase.”","So far, $8.2 million has been withdrawn from crypto exchange FTX since transactions started moving again in the last hour, per Nansen data. Yet crypto traders are suspicious that these funds are not going to everyone.","The funds have only gone to either newly created blockchain addresses or the hot wallets of crypto exchange Binances, OKX and Bitfinex. A lot of the withdrawals have been going to a very select number of wallets. This suggests withdrawals have not been fully opened, as otherwise, they would be going to all sorts of wallets.","\"The withdrawals from FTX seem really weird,\" The Block VP of Research Larry Cermak <a href=\"https:\/\/twitter.com\/lawmaster\/status\/1590750976298090496\" data-v-f87c67ca=\"\">said<\/a> on Twitter. \"Some of them actually go to Binance deposit addresses, and some of them appear to be fresh wallets which could indicate a consolidation.”","The transfers out of FTX’s main wallets have slowed down, particularly for larger transactions. After multiple six-figure withdrawals, no transfer over $10,000 has occurred for nearly an hour.","FTX has not made any official statement on the withdrawals, and its website still shows a notice that withdrawals remain closed.","One account that has received 728,000 USDC on the Solana blockchain appears to be associated with a niche Twitter account followed by FTX CEO Sam Bankman-Fried. The owner of the account tweeted the address in June 2021, presumably to show they owned it.","After this was <a href=\"https:\/\/twitter.com\/Tree_of_Alpha\/status\/1590755747620540417\" data-v-f87c67ca=\"\">highlighted<\/a> by Tree of Alpha on Twitter, the <a href=\"https:\/\/twitter.com\/ElMomentoRD\/status\/1402277719719788547\" data-v-f87c67ca=\"\">tweet<\/a> was deleted. The account has also deleted other tweets and changed its profile picture. Tree of Alpha noted that the owner of the account appeared to interview Alameda Research CEO Caroline Ellison in May, according to a related <a href=\"https:\/\/www.youtube.com\/c\/ElMomentoCripto\" data-v-f87c67ca=\"\">YouTube account<\/a>.","An admin of a group related to the account — which seems to be a trading desk for the Dominican Republic — told Tree of Alpha on Telegram that there was nothing fishy about the transaction and that they just clicked withdraw. They said they deleted the tweet to avoid escalation and will return the funds. Well-known crypto trader Cobie said he was contacted by a different account on Telegram purporting to represent the account, who appeared as a low or mid-level employee at FTX and repeated that they intended to return the funds.","The funds have now been returned.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Cobie","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"The Block VP of Research Larry Cermak","content":"ORGANIZATION"},{"type":"Nansen","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$10,000","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"$8.2 million","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Tree of Alpha","content":"ORGANIZATION"},{"type":"Zane Tackett","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"3:05 p.m.","content":"TIME"}],"hashtag":["FTX"],"authors":["Mike Truppa","The Block"]}