{"summary":"Avocado Guild has raised $18 million from Animoca Brands, Solana Ventures, Three Arrows Capital, and others.\nThe six-month-old Avocado Guild is now valued at $200 million.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/125341\/blockchain-gaming-guild-avocado-raises-18-million-from-solana-ventures-and-others","publishDate":"2021-11-24T05:16:57","id":1417,"type":null,"title":"Blockchain gaming guild Avocado raises $18 million","category":["Venture Capital"],"content":["Avocado Guild, a blockchain gaming startup similar to a16z-backed Yield Guild Games, has raised $18 million in a Series A funding round.","Animoca Brands and QCP Soteria Node (QSN) co-led the round, with Solana Ventures, Three Arrows Capital, Polygon Studios, and others participating. The round brings just the six-month-old Avocado Guild's valuation to $200 million.","This is the startup's first fundraise, and it is an equity round, its founder and CEO Brendan Wong told The Block. But the investors will also get some AVG tokens, he said. AVG is Avocado Guild's native token that is yet to be launched.","The round appears to be heavily oversubscribed. According to a pitch deck seen by The Block, Avocado Guild was looking to raise only $5-$8 million for its Series A.","Notably, the startup is on track to an $80 million revenue run rate by the end of this year, according to the deck. Revenue run rate is a forecasting method that enables firms to predict their financial performance over a coming period based on past earnings data.","As a <a href=\"https:\/\/www.theblockcrypto.com\/post\/120409\/blockchain-based-gaming-a-primer-brought-to-you-by-forte\" data-v-f87c67ca=\"\">blockchain gaming<\/a> guild, Avocado Guild purchases in-game items and lends them out to play-to-earn game players in return for a share of rewards earned by the players.","Let's take an example of the Axie Infinity game. It requires players to buy three \"Axies\" — in-game creatures with unique traits — for playing the game.","Axies can be expensive. The current floor price of an Axie is around $100, according to tracker <a href=\"https:\/\/www.chillaxie.com\/price-floors\" data-v-f87c67ca=\"\">ChillAxie<\/a>. That means users will have to spend at least $300 to start playing the game.","With guilds like Avocado Guild and Yield Guild Games, players won't have to buy Axie-like assets and instead borrow them from these guilds.","These guilds run so-called \"scholarship programs\" in which a community manager of a guild lends in-game assets to a scholar or a player. Rewards are then split between the manager and the scholar.","Avocado Guild currently supports seven games, including Axie Infinity, Cyball, and Revv Racing. Its scholarship program includes over 7,000 members, and it aims to increase it to 12,000 by the end of this year.","Avocado Guild's funding comes three months after Yield Guild Games (YGG) raised a small $4.6 million round led by a16z. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">The&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.coingecko.com\/en\/coins\/yield-guild-games\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">YGG token's price has shot up<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">&nbsp;since its launch, and its current market capitalization is over $780 million, and its fully diluted valuation is nearly $9 billion, according to&nbsp;<\/span><a class=\"editor-rtfLink\" href=\"https:\/\/www.coingecko.com\/en\/coins\/yield-guild-games\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">CoinGecko<\/span><\/a><span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">.<\/span>","This partially explains why Avocado Guild's funding round was oversubscribed with backing from notable investors — along with the intersection of crypto and gaming being a hot topic right now.","\"We believe the play-to-earn (P2E) industry is still in its nascent stage,\" Wong told The Block. \"There are over 1 billion active gamers out there in the world who still need exposure to this amazing movement. The guilds of this space are the engine to fuel the P2E economy. P2E is here to stay and AG is committed to help build the future of Web 3.0.\"","There are currently 14 people working for Avocado Guild, and the startup is looking to expand its team in the engineering and operations functions, said Wong.","Avocado Guild is currently also in the process of transitioning to a decentralized autonomous organization or a DAO. \"The transition to AvocadoDAO is in progress while we develop the smart contracts necessary to pass governance to token holders. We are currently planning for the launch of our token to start the process,\" said Wong."],"hashtag":[]}