{"summary":"Ethereum is set for another major upgrade, but two of America&#x27;s financial heavyweights disagree on what it means for ether.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225701\/jpmorgan-fidelity-ethereum-eth-shapella-upgrade?utm_source=rss&utm_medium=rss","publishDate":"2023-04-11T15:24:39","id":14178,"type":null,"title":"JPMorgan, Fidelity differ on what Shapella means for ether price","category":["MARKETS"],"content":["Ethereum's latest upgrade is slated for April 12, and its impact has divided opinion — at least between two of America's most prominent financial institutions.&nbsp;","The blockchain's Shanghai-Cappella upgrade – dubbed Shapella – will enable withdrawals of staked ether on the network for the first time if all goes to plan. While the majority of observers expect the impact on the price of ether to be muted, JPMorgan and Fidelity analysts are divided.&nbsp;","Ethereum's native coin recently topped $1,900 and is at its highest point since last summer on the even of the upgrade. It was trading at $1,904 by 1:45 p.m. in New York, up 0.5% over the past day, according to CoinGecko data.&nbsp;","Last year's&nbsp;<a href=\"https:\/\/www.theblock.co\/linked\/86179\/eth2-beacon-launch-staking\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">Merge<\/a> made Ethereum a proof-of-stake blockchain, but staking has been a one-way system since — that's about to change. Shapella will enable validators and users to withdraw their staked ether and any accrued staking rewards, opening up access to over 18 million staked ether.&nbsp;","JPMorgan analysts said in a recent note that they expect ether will likely face \"some selling pressure\" as more than 1 million worth of ether staking rewards become available to validators after the upgrade.","\"If one adds potential additional selling pressure from staked ether balances belonging to troubled entities, then the selling pressure could be bigger over the coming weeks,\" analysts said, adding they \"expect ether to underperform bitcoin over the coming weeks.\"","The impact of Shapella is more nuanced, according to Fidelity Digital Assets researchers. First, validators' operating expenses are much lower under proof-of-stake than in the energy-intensive proof-of-work system.&nbsp;","Most staked ether positions were at a loss before the recent rally put about half in the money, in ether terms.&nbsp;","<a href=\"https:\/\/dune.com\/hildobby\/eth2-staking\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">source: Dune Analytics @hildobby<\/span><\/a>","Another wrinkle, as Fidelity sees it, are liquid staking tokens and staking service providers. These tokens allow one to participate in staking, while also being able to use or sell them. A third of staked ether is already liquid through these liquid staking tokens, the Fidelity analysts noted, meaning holders have been able to exit before the upgrade.&nbsp;","\"With the amount of ether held by staking service providers, these entities will likely impose their timeframes at which their ether is unlocked,\" the note said.&nbsp;","Based on these factors and the popularity of staking leading to re-staking, the visible impact on the price of ether should be \"muted,\" Fidelity argues.&nbsp;","The upgrade is expected to cause \"some short-term market volatility,\" with the long-term benefits being \"substantial,\" according to Chen Zhuling, founder and CEO of RockX, a blockchain node provider service.&nbsp;","Ethereum will be able to handle more transactions per second, transaction costs will decrease, and the security and efficiency of smart contracts will improve, he told The Block. \"With the Shapella Upgrade, the liquid staking landscape will be transformed forever, and Ethereum will become the benchmark yield for crypto.\"","Riyad Carey, a research analyst at Kaiko, echoed this, saying, \"short term price movements are noise that distracts from the signal of the upgrade.\" Adding withdrawals will make large holders and institutions who had previously been holdouts more comfortable with staking, Carey said.","\"Overall, it doesn't seem that markets are pricing in a huge move, as ether's implied volatility for the April 21, 2023 expiry is only 2% higher than BTC's, while their IV for further expiries is essentially even,\" he said.&nbsp;","Pre-Merge a \"buy the rumor, sell the news\" strategy played out on-chain. Still, this time the flows have been directed towards liquid staking tokens,\" Marc Arjoon, a research associate at CoinShares, told The Block. The narrative of unlocks leading to sell-side pressure could prove to be a headwind, he added, before saying, \"if the price doesn't fall materially enough to match the narrative then I presume this would have an uplift for the price of ether.\"","Shapella will further \"solidify confidence in the Ethereum network,\" Arjoon concluded.&nbsp;","Ethereum developers have successfully tested the Shapella <a href=\"https:\/\/www.theblock.co\/post\/225655\/ethereum-shapella\" data-v-f87c67ca=\"\">upgrade<\/a> on public test networks for many months. It is set to occur on mainnet epoch 620,9536, expected at 6:27  p.m. EST on April 12.","<em data-v-f87c67ca=\"\">(with reporting assistance from Vishal Chawla)<\/em>","<em data-v-f87c67ca=\"\">(Updated to reflect the stakers in profit is in ether terms)<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Kaiko","content":"LOCATION"},{"type":"0.5%","content":"PERCENT"},{"type":"Carey","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"April 21, 2023","content":"DATE"},{"type":"last summer","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"Chen Zhuling","content":"PERSON"},{"type":"$1,900","content":"MONEY"},{"type":"1:45 p.m.","content":"TIME"},{"type":"6:27  p.m. EST","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"$1,904","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"April 12","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"Marc Arjoon","content":"PERSON"},{"type":"Fidelity Digital Assets","content":"ORGANIZATION"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Riyad Carey","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"Shapella Upgrade","content":"ORGANIZATION"},{"type":"CoinShares","content":"ORGANIZATION"}],"hashtag":["ANALYST REPORTS","BITCOIN","CRYPTO MOVERS","EQUITY MOVERS","ETHEREUM"],"authors":["Adam Morgan McCarthy","The Block"]}