{"summary":"FTX CEO Sam Bankman-Fried’s top priority is to conduct a fundraise, according to his Slack message sent to FTX staff and seen by The Block. \nThe message comes after Binance walked away from making a deal with the troubled exchange.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185163\/ftx-ceo-bankman-frieds-top-priority-fundraise","publishDate":"2022-11-10T03:24:08","id":1418,"type":null,"title":"Bankman-Fried tells FTX top priority is fundraising after failed Binance deal","category":["Exchanges"],"content":["FTX CEO Sam Bankman-Fried hasn't given up yet.","A day after rival Binance walked away from making a deal with troubled crypto exchange FTX, Bankman-Fried is once again looking to raise money for his company, according to a Slack message shared by Bankman-Fried to his staff on Thursday and confirmed as genuine by a source at the company.&nbsp;","\"For the next week, we will be conducting a raise. The goal of this raise will be first to do right by customers; second by current and possible new investors; third all of you guys,\" the message reads. \"And in, and only in, a hypothetical world where everything turns out amazingly and everyone else is done right, maybe myself as an investor, fourth and last — but that's not a particularly important part of anything we're going to be doing as a company.\"","With FTX facing collapse, it made a deal with larger rival Binance on Tuesday for a potential acquisition. But Binance <a href=\"https:\/\/www.theblock.co\/post\/184780\/binance-bailed-on-ftx-its-not-the-first-time-the-firm-has-backed-out-of-a-deal\" data-v-f87c67ca=\"\">walked away<\/a> a day later after looking at its financials during due diligence.","Bankman-Fried seemed understandably annoyed at Binance's action. \"On Binance: I shouldn't throw stones in a glass house, so I'll hold back a bit here, except to say: probably they never really planned to go through with the deal, but so be it; we're going to do our jobs here regardless,\" he said in the Slack message.","Bloomberg reported Wednesday, citing a person with direct knowledge of the matter, that Bankman-Fried told FTX investors that the company would need to file for bankruptcy without a cash injection.","Bankman-Fried reportedly informed investors on the call that FTX faced a shortfall of up to $8 billion and needed $4 billion to remain solvent and that FTX is attempting to raise rescue financing in the form of debt, equity, or a combination of the two. The call reportedly took place before Binance pulled out of the deal.","Earlier today, Tron founder Justin Sun <a href=\"https:\/\/www.theblock.co\/post\/185148\/justin-sun-says-he-is-working-on-solution-to-ftx-crisis?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">said<\/a> in a tweet that he is working on a solution with FTX, without giving any details. Bankman-Fried retweeted Sun's tweet. His Slack message also mentions working with Sun. \"As one part of the potential above raise, we have had talks with Justin Sun (as Twitter broke). Details forthcoming there,\" reads the message.","The raise, if successful, may end up being a combined FTX International and FTX U.S. infusion, according to the message.","Besides planning the fundraise, Bankman-Fried's other priorities in the coming days include a detailed explanation of what happened and what went wrong and deciding management structure and leadership going forward.","Bankman-Fried encouraged FTX staff to stay on, but he won't mind if anyone decides to leave the firm, according to the Slack message."],"hashtag":["BINANCE","FTX"]}