{"summary":"Ethereum co-founder Vitalik Buterin supported the idea of increasing the block gas limit to improve the network capacity.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/271847\/vitalik-buterin-ethereum-gas-limit-increase","publishDate":"2024-01-11T05:51:47","id":1418,"type":null,"title":"Vitalik Buterin endorses raising Ethereum gas limit by 33%","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.14%\n    <\/span><\/a> <!----><\/span><\/span> co-founder Vitalik Buterin voiced support for increasing the block gas limit — a move that could enhance the network’s capacity.<\/span>","In a Reddit ask-me-anything session, when questioned about the safe increment of the gas limit, Buterin <a href=\"https:\/\/www.reddit.com\/r\/ethereum\/comments\/191kke6\/comment\/kh7ekx3\/?utm_source=share&amp;utm_medium=web2x&amp;context=3\" data-v-f87c67ca=\"\">recommended<\/a> a 33.3% increase, proposing to raise the Ethereum block gas limit from its current 30 million to 40 million units of gas.","If implemented, this adjustment would allow more transactions in each Ethereum block and improve capacity. Buterin stressed that the current gas limit, set at 30 million, has remained unchanged for nearly three years.","The gas limit in Ethereum represents the maximum computational effort that can be expended on processing transactions or executing smart contracts in a single block.","Martin Köppelmann, co-founder of Gnosis, <a href=\"https:\/\/twitter.com\/koeppelmann\/status\/1745070860099096833\" data-v-f87c67ca=\"\">observed<\/a> that increasing the gas limit would also push the operational requirements for nodes — likely necessitating more costs. Nevertheless, Köppelmann believed that the benefits of a higher gas limit, such as improved network efficiency and capacity, outweigh these potential issues.","Jesse Pollak, Coinbase protocols lead, also <a href=\"https:\/\/twitter.com\/jessepollak\/status\/1745165850926051654\" data-v-f87c67ca=\"\">expressed<\/a> strong support for the change. He stated, “I’m strongly in support of increasing the Ethereum gas limit to 40-45M — we have the network headroom and it will be beneficial for all parties.”","Unlike several changes to Ethereum that necessitated hard forks, the increase in the Ethereum block gas limit can be achieved through validators adjusting their node configurations.","Since Ethereum’s inception in 2015, the average gas limit was approximately three million. This limit has incrementally risen over time — reflecting the network’s escalating usage and adoption.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"33.3%","content":"PERCENT"},{"type":"Köppelmann","content":"PERSON"},{"type":"Martin Köppelmann","content":"PERSON"},{"type":"Buterin","content":"PERSON"},{"type":"+0.14%","content":"PERCENT"},{"type":"Jesse Pollak","content":"PERSON"}],"hashtag":["ETHEREUM","VITALIK BUTERIN"],"authors":["Vishal Chawla","The Block"]}