{"summary":"The agency looks poised to expand further into policing decentralized finance and is likely to declare that rules governing trading exchanges in the U.S. also apply to decentralized finance.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/226344\/sec-poised-to-increase-scrutiny-of-defi?utm_source=twitter&utm_medium=social","publishDate":"2023-04-14T10:00:16","id":14198,"type":null,"title":"The US SEC is getting ready to scrutinize DeFi markets even further","category":["POLICY"],"content":["The U.S. Securities and Exchange Commission removed any doubt that they plan to police decentralized finance.&nbsp;","The commission declared on Friday that rules governing trading exchanges in the U.S. also apply to decentralized finance. The procedural move isn’t a change to rules, but rather an effort to make explicit whether existing exchange rules apply to decentralized finance. The proposed clarification and amendments to the definition of an exchange are subject to a vote by the Democratic majority commission that leads the agency, making them likely to pass.&nbsp;","The action formalizes the SEC’s assertion of jurisdiction over activities labeled \"decentralized\" that the agency sees as still falling under traditional definitions of securities trading. It may also signal increased scrutiny by the regulatory agency into that area of digital assets. So far the SEC has focused more on centralized crypto firms.","“Make no mistake: many crypto trading platforms already come under the current definition of an exchange and thus have an existing duty to comply with the securities laws,” SEC Chair Gary Gensler said in prepared remarks for Friday's meeting. “Yet these platforms are acting as if they have a choice to comply with our laws. They don’t.”","Republican appointees to the commission strongly dissented with the announcement.","<span data-v-f87c67ca=\"\">“No longer does this commission think creatively about regulatory alternatives that advance the commission’s mission while preserving space for potentially disruptive innovation. No longer does the commission worry that regulatory bullheadedness often produces absurd consequences,” said Commissioner Hester Peirce, blasting the application of exchange rules to decentralized finance. “Rather today’s commission aggressively expands its regulatory reach to solve problems that do not exist.”&nbsp;&nbsp;<\/span>","Fellow Republican Commissioner Mark Uyeda added criticism of the expansion of exchange definitions to DeFi.&nbsp;","<span data-v-f87c67ca=\"\">“Where is the evidence that more entities need to be brought into the regulatory framework for exchanges?” said Uyeda, noting that false and misleading statements and market manipulation rules already apply to non-exchanges.&nbsp;<\/span>","The five-member commission passed the announcement along party lines, by a vote of 3-2.&nbsp;","DeFi projects that bring together multiple buyers and sellers for the trading of assets, including non-firms and structured projects, could be considered securities exchanges by the SEC, and subject to civil charges if they fail to register as national securities exchanges or broker-dealers in the U.S. The exchange definition is tied to \"trading interest,\" according to SEC staff.","Peirce argued that the application of exchange rules to DeFi could place legal liability on miners and validators for different blockchain ecosystems, though Tyler Raimo, assistant director for the SEC's Division of Trading and Markets pushed back on that in questioning from Peirce.&nbsp;","<span data-v-f87c67ca=\"\">“I think the validator, miners activity alone is unlikely to meet that criteria,” said Raimo. “You could look at what they’re doing in conjunction with others to a certain respect,” beyond mining and validating activity, he said. He added a common refrain of the SEC that “facts and circumstances” of each individual case would determine how the agency views different projects.&nbsp;<\/span>","The move is meant to make clearer the SEC’s view of DeFi, and may imply that the agency is already investigating certain projects. The SEC does not comment on open investigations, and staff did not single out any particular project during a press call. The Commodity Futures Trading Commission, the other federal U.S. markets regulator, launched the <a href=\"https:\/\/www.theblock.co\/post\/172274\/cftc-files-lawsuit-against-decentralized-autonomous-organization\" data-v-f87c67ca=\"\">first enforcement action<\/a> against a decentralized autonomous organization, Ooki DAO, late last year, and the agencies have competing views on certain digital asset issues. The SEC has previously <a class=\"c-link\" href=\"https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/www.sec.gov\/litigation\/investreport\/34-81207.pdf\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">weighed in on the original DAO<\/a>, but did not take an enforcement action against the project.","Decentralized finance isn’t the only market touched by Friday’s SEC meeting. The Democratic-majority commission also tweaked definitions related to Treasury and municipal bond markets.&nbsp;","But the SEC received a large amount of conflicting views on DeFi following a <a href=\"https:\/\/www.sec.gov\/rules\/proposed\/2022\/34-94062.pdf\" data-v-f87c67ca=\"\">2022 proposal to amend current exchange rules<\/a>, which agency staff say prompted Friday’s meeting and explicit communication that DeFi projects could qualify as securities exchanges.","“In particular, the proposal would require communication protocols—venues that bring together buyers and sellers of securities through structured methods to negotiate a trade—to comply with rules for exchanges,” Gensler said in remarks prepared for Friday’s meeting. “As one example, request-for-quote platforms perform several exchange-like functions in the Treasury markets, among others. Ensuring that exchange-like platforms follow our exchange-specific rules benefits investors and markets alike.”","The move also allows the agency to release its own economic analysis of decentralized finance. A fact sheet for the announcement can be found <a href=\"https:\/\/www.sec.gov\/news\/upcoming-events\/open-meeeting-041423\" data-v-f87c67ca=\"\">here<\/a>. Public comments for the clarification can be made for 30 days after notice in the Federal Register.&nbsp;","Gensler is scheduled to make an appearance before the House Financial Services Committee next week, and he and his agency face scrutiny from Congress over their handling of failed crypto firm FTX.","<em data-v-f87c67ca=\"\">UPDATE: With Peirce and Uyeda's dissents, staff comments during the meeting, and to reflect the commission vote.&nbsp;<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Peirce","content":"LOCATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Mark Uyeda","content":"PERSON"},{"type":"Federal Register","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Raimo","content":"PERSON"},{"type":"Ooki DAO","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Uyeda","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Peirce","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Division of Trading","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Tyler Raimo","content":"PERSON"}],"hashtag":["CONGRESS","DEXS","FTX","GARY GENSLER","HOUSE FINANCIAL SERVICES COMMITTEE","SEC"],"authors":["Colin Wilhelm","The Block"]}