{"summary":"Noble has partnered with financial technology firm Hashnote to offer tokenized real-world asset (RWA) products to the Cosmos ecosystem.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274241\/noble-hashnote-tokenized-securities-cosmos?utm_source=twitter&utm_medium=social","publishDate":"2024-01-24T08:00:07","id":14195,"type":null,"title":"Noble teams up with Hashnote to roll out tokenized securities on Cosmos","category":["CRYPTO ECOSYSTEMS"],"content":["Blockchain project Noble has partnered with asset manager Hashnote to introduce a tokenized real-world asset product on Cosmos.","The product of this collaboration is USYC, a short-duration yield fund product from Hashnote. The USYC token (not to be confused with other stablecoins) issued on the Noble blockchain will provide investors exposure to short-duration securities, including U.S. treasury bills. It could also be moved across the broader Cosmos ecosystem.","Noble is known for being the native asset issuance network for Circle’s USDC stablecoin in the Cosmos ecosystem. On the other hand, Hashnote, backed by investors like DRW Holdings and Cumberland, is an asset manager offering management strategies in crypto and real-world assets.","Noble aims to tap into the RWA niche on Cosmos with its USYC rollout. The market for RWAs is still nascent but rapidly growing. In particular, tokenized securities have seen a swift increase in value over the last year, with the market size estimated at over $500 million, according to Dune <a href=\"https:\/\/dune.com\/steakhouse\/tokenized-securities\" data-v-f87c67ca=\"\">data<\/a>.","Cosmos is an ecosystem of over 80 application-specific blockchains — such as Cosmos Hub, Osmosis, Injective, Noble and several others — which have a combined market capitalization exceeding $45 billion. These blockchains can interact with each other using the Inter-Blockchain Communication Protocol.","As the first cross-chain RWA on Cosmos, USYC is expected to be used across a diverse range of applications, including as collateral in DeFi apps across the Cosmos ecosystem — according to a statement. “This initiative will demonstrate the power of the IBC protocol in making real-world assets natively interoperable,” said Noble CEO and co-founder Jelena Djuric.","According to Noble, USYC will have a \"T+1 redemption\" guarantee. This refers to the promise that an investment can be redeemed (sold back to the issuing entity) one business day after the trade date.","<em data-v-f87c67ca=\"\">Listen to <a href=\"https:\/\/www.theblock.co\/post\/274231\/cosmos-noble-skip\" data-v-f87c67ca=\"\">Jelena Djuric on The Scoop podcast<\/a> discuss how Noble plans to bring interoperable RWAs to Cosmos.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Dune","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"DRW Holdings","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"USYC","content":"ORGANIZATION"},{"type":"Inter-Blockchain Communication Protocol","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Injective","content":"LOCATION"},{"type":"IBC","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"RWA","content":"ORGANIZATION"},{"type":"Hashnote","content":"LOCATION"},{"type":"Cosmos","content":"LOCATION"},{"type":"Cosmos Hub","content":"ORGANIZATION"},{"type":"Cumberland","content":"LOCATION"},{"type":"$45 billion","content":"MONEY"},{"type":"Jelena Djuric","content":"PERSON"}],"hashtag":["ASSETS","COSMOS"],"authors":["Vishal Chawla","The Block"]}