{"summary":"Worldcoin is among the most divisive projects in crypto and must now contend with an increasingly hostile regulatory environment.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237647\/inside-sam-altmans-worldcoin-and-its-quest-to-catalog-all-humans?utm_source=twitter&utm_medium=social","publishDate":"2023-07-07T06:00:19","id":14200,"type":null,"title":"Inside Sam Altman’s Worldcoin and its quest to catalog all humans","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Clearly it’s not enough for Sam Altman, CEO of ChatGPT creator OpenAI, to tussle with one controversial, potentially world-altering technology at a time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He is simultaneously the co-founder of Worldcoin, the crypto project pairing a Minority Report-style retina scanning device with a token destined for global distribution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Today, there are almost 2 million people signed up to receive their share of the Worldcoin token. The launch or “airdrop” had already been pushed back from the first quarter to the first half of this year and is now expected this quarter, according to a person familiar with the matter. The environment for new token launches — thanks largely to <\/span><a href=\"https:\/\/www.theblock.co\/post\/233174\/solana-matic-cardano-others-securities-sec-binance-lawsuit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the actions of regulators in the United States<\/span><\/a><span data-v-f87c67ca=\"\"> — could hardly be less favorable.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The risks and the potential rewards are all the more acute when factoring in the scale of Worldcoin’s ambition.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“After launch, we will rapidly scale market by market and start the race towards signing up all humans,” it wrote in a presentation distributed to potential investors late last year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Parts of that presentation — which The Block has now obtained in full — were referenced in a story published in February about Worldcoin <\/span><a href=\"https:\/\/www.theblock.co\/post\/210014\/sam-altman-worldcoin-fundraise\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">seeking up to $120 million<\/span><\/a><span data-v-f87c67ca=\"\"> in additional funding. In May, the project said it had secured $115 million in a round led by Blockchain Capital, the San Francisco-based venture firm.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The investor deck in its entirety, coupled with interviews with a number of Worldcoin’s prominent boosters and detractors, paint a vivid picture of a project walking a tightrope between financial freedom and big tech surveillance, decentralization and maximizing profits.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Worldcoin is a machine with many moving parts. First, there is the San Francisco-based Tools for Humanity, which was co-founded by Alex Blania, Max Novendstern and Sam Altman in 2020. Acting as the lead developer of the Worldcoin project, TfH has to date raised more than $240 million from venture backers including a16z, Tiger Global, Khosla Ventures and Coinbase Ventures.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Worldcoin’s backers have batted off the backlash drawn by the project. The Series C investment was Blockchain Capital’s second largest to date, behind only zkSync developer Matter Labs. Spencer Bogart, general partner at Blockchain Capital, performed a full volte-face on the company. Initially, he said, the “boots on the ground” method of signing up users was a turn-off. It seemed “excessive and superfluous.” But if Worldcoin could pull it off, he later decided, the project could become the most successful crypto “on-ramp” to date.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Before pulling the trigger, though, Bogart felt he had to double check whether his investment team had the thickness of skin to take on what would inevitably prove a divisive deal. They did.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For some deep-pocketed investors, Worldcoin’s mission to create a global identity register was too hairy and came with significant reputation risk, said one, on condition of anonymity. Still, The Block’s reporting suggests Worldcoin was valued at $3 billion in its latest raise — the same amount it was valued at in March 2022, <\/span><a href=\"https:\/\/www.theinformation.com\/articles\/andreessen-horowitz-khosla-back-worldcoin-in-deal-valuing-tokens-at-3-billion?rc=8uivwi\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">when it raised $100 million<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Blockchain Capital’s Bogart joined TfH’s board of directors as part of the Series C round, a person close to the matter said, adding that a16z Crypto’s Chris Dixon and Bain Capital Crypto’s Alex Evans are board observers. Two independent board members will be appointed in due course, according to the person.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Sam Altman, the former president of Y Combinator whose day job is now running ChatGPT creator OpenAI, is a co-founder of Worldcoin.&nbsp;A person familiar with the matter said Blania runs TfH’s&nbsp;day-to-day operations as CEO, while Altman <\/span>provides strategic guidance and contributes to leadership meetings.<span data-v-f87c67ca=\"\">&nbsp;He helped design the World App, they added, and recently <a href=\"https:\/\/worldcoin.org\/blog\/worldcoin\/key-takeaways-worldcoin-seoul-sam-altman-alex-blania\" data-v-f87c67ca=\"\">spoke at a meet-up for the project in Seoul<\/a>, South Korea.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Altman’s main contributions to the project, according to Bogart, focus on how best to scale it. “Internally we call it the Sam Altman effect,” Bogart said. “Focus on scale. Nothing else matters.”&nbsp;<\/span>","Worldcoin<span data-v-f87c67ca=\"\">’s spokesperson pointed to a McKinsey Global Institute report that found there are more than 4.4 billion people worldwide without a legal identity or who have one that can’t be digitally verified. “The project was designed to meet the needs of billions of individuals,” they said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As with many crypto projects striving for decentralization, Worldcoin also has a non-profit foundation. The Worldcoin Foundation, which is based in the Cayman Islands, is “charged with supporting the protocol and growing the Worldcoin community until the community becomes self-sufficient,” according to its website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tiago Sada, head of product, engineering and design at Tools for Humanity, said in a previous interview that the foundation is a stepping stone to creating a Decentralized Autonomous Organization or DAO. Worldcoin’s website states that its foundation was set up to “enable DAO-based priority-setting for the protocol.” Next steps include the transfer of IP to the foundation and setting up developer grant programs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Product-wise, there’s World ID, <\/span><a href=\"https:\/\/www.theblock.co\/post\/219541\/sam-altmans-worldcoin-unveils-world-id-protocol-and-sdk\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the identity protocol<\/span><\/a><span data-v-f87c67ca=\"\"> that people can use to prove they’re real online; a software development kit; <\/span><a href=\"https:\/\/www.theblock.co\/post\/229742\/sam-altman-worldcoin-app-token\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the World App<\/span><\/a><span data-v-f87c67ca=\"\">, which gives users a way to manage their verified ID and a range of cryptocurrencies; and Worldcoin, the token. With the exception of the token, all these tools debuted earlier this year.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">For-profit entity TfH is responsible for the app. Sada has said in previous interviews that there is, therefore, the potential to introduce fees in the form of a few basis points on each transaction or swap. Already, by early May, more than half a million people were using the app at least once a month.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Worldcoin’s chosen method of getting its token into millions of wallets is to ask people to verify their identity by having their retina scanned by an orb.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The orbs themselves look like something straight out of science fiction. Each one weighs 2.7kgs and has a circumference of 205mm, according to a spokesperson. TfH spent three years developing the devices and, in January, <\/span><a href=\"https:\/\/worldcoin.org\/blog\/engineering\/opening-orb-look-inside-worldcoin-biometric-imaging-device\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">published some details<\/span><\/a><span data-v-f87c67ca=\"\"> about their design.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“When Worldcoin started, at this point many years ago, the orb was definitely not the first option,” Worldcoin’s Sada previously told The Block. “If we found a better way to do it today, we would move away from the orb, it’s as simple as that.”<\/span>","<span data-v-f87c67ca=\"\">As things stand, though, Worldcoin is doubling down on its orb. In March, The Block revealed that Worldcoin <\/span><a href=\"https:\/\/www.theblock.co\/post\/220402\/worldcoin-outsourcing-deal-jabil-iris-scanning-orbs\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">had signed a deal<\/span><\/a><span data-v-f87c67ca=\"\"> with contract manufacturer Jabil to ramp up production of the controversial devices.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Through a relationship with a German unit of Florida-based Jabil, sources said Worldcoin could produce 400 orbs a month. One year earlier, it had just 30 orbs in circulation, according to a Bloomberg report at the time.&nbsp;<\/span><span data-v-f87c67ca=\"\">Worldcoin’s spokesperson said the number of operational orbs at any given moment today is up to 250, with plans to increase that post-launch.&nbsp;<\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">A deconstructed orb. Source: Worldcoin.<\/em><\/span>","<span data-v-f87c67ca=\"\">Worldcoin has been running an operator program that compensates businesses — in stablecoins — for getting people scanned. Operator teams get kitted out in Worldcoin-branded clothes and can be located using an app.&nbsp;<\/span>","Worldcoin lends out its orbs and other equipment to operators when they join the project, according to its spokesperson. Operators do not pay to borrow the orb, but Worldcoin will likely roll out a security deposit program at some point, they added.&nbsp;","“Further, as part of a pilot in two countries, the project has experimented with a process to ensure that operations are optimally and fairly dispersed, allowing Operators to bid for the ability to exclusively operate Orbs in particular areas or locations where they believe they are more likely to be successful in onboarding new users,” said the spokesperson.&nbsp;","<span data-v-f87c67ca=\"\">According to Blockchain Capital’s Bogart, much of Worldcoin’s expenditure to date has been focused on building and distributing orbs.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nearly 2 million people have been signed up so far, predominantly in Latin America, Africa, Southeast Asia and Europe. <\/span><span data-v-f87c67ca=\"\">In its investor presentation, published in December last year, Worldcoin projected getting 18 million people signed up with 3,400 orbs active by the end of 2023. A year later, it projected 235 million sign-ups with 19,400 orbs active. Those estimates also assumed a mainnet launch in the first quarter, however. Worldcoin’s spokesperson declined to comment on the projections.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The deck also shone a spotlight on certain key markets. Nairobi, Kenya, for instance, had brought in a quarter of a million sign-ups by December with just 45 orbs circulating.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">What Worldcoin did not factor into its projections was <\/span><a href=\"https:\/\/www.theblock.co\/post\/231433\/worldcoin-iris-black-market\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">the rise of a black market<\/span><\/a><span data-v-f87c67ca=\"\"> for verified credentials. In May, reports surfaced alleging that in China — where people cannot yet sign up to Worldcoin — people had been purchasing iris scans taken in Cambodia and Africa for as little as $30. A Worldcoin spokesperson acknowledged that, in a few hundred instances, “individuals were incentivized to sign up for a verified World ID that was then delivered to a third party’s World App rather than their own.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Worldcoin took steps to try to contain the issue, including adjustments to the sign-up process and the introduction of dynamic, instead of static, QR codes. It is also working on giving people a way to recover their World ID by revisiting an orb.&nbsp;<\/span>","Worldcoin<span data-v-f87c67ca=\"\">’s<\/span> spokesperson said that while concerns about the incident are understandable,&nbsp;<span data-v-f87c67ca=\"\">“sensitive data was not exposed.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Still, it is exactly the kind of hard-to-foresee risk that privacy advocates are so wary of with Worldcoin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The Worldcoin project provoked outrage among privacy advocates from the moment it was unveiled in June 2021. Whistleblower Edward Snowden warned, at the time, “Don’t catalogue eyeballs.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Worldcoin has offered various defenses, most of them technical in nature. The project’s spokesperson pointed to <a href=\"https:\/\/worldcoin.org\/blog\/developers\/privacy-deep-dive\" data-v-f87c67ca=\"\">a blog post<\/a> from earlier this year that examines Worldcoin’s “privacy-preserving” design.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">On its website, Worldcoin states that those who sign up for a World ID don’t share their name, phone number, email address or home address. The orb scans are instead used to create a unique iris code — and the scans are then immediately deleted, unless users opt in to sharing their data.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In April 2022, Worldcoin seemingly sought to <\/span><a href=\"https:\/\/worldcoin.org\/blog\/developer\/the-worldcoin-protocol\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">assuage the concerns of its critics<\/span><\/a><span data-v-f87c67ca=\"\"> by unveiling what it snappily called a Privacy-Preserving Proof-of-Personhood Protocol. In short, this removed links between the biometric registration stage and the wallet, with the help of zero-knowledge proof technology — a method by which one party can prove something is true to another without divulging any additional information.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“There’s also a lot of misconceptions out there,” Saga told The Block in a previous interview. “As counterintuitive as this sounds, World ID is… the most private identity. I would argue that it’s also the most inclusive and scalable in many ways.”<\/span><span data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet privacy concerns about the orb persist. Harry Halpin, CEO of Swiss privacy startup Nym Technologies, is a vocal critic.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">He doesn’t believe in the premise that the sudden explosion of interest in AI — driven by the success of ChatGPT — will bring about mass unemployment. Nor does he believe that unconditional universal basic income — one possible use case for Worldcoin — is a good idea. “We did not create cryptocurrency to allow Sam Altman to create a giant welfare state,” he said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Most telling, though, were Halpin’s comments on the design of the project.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Technologically it’s dangerous,” he said. “Worldcoin is an example of zero-knowledge washing. Taking a fundamentally evil concept or dubious concept and trying to make it look socially acceptable by adding some zero-knowledge fairy dust on top of it.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And that fairy dust has a shelf life, according to Halpin.&nbsp;<\/span><span data-v-f87c67ca=\"\">“Quantum computing will break zero-knowledge proofs,” he said, guessing that would happen within 5 to 10 years. “You should not collect the data in the first place.”&nbsp;<\/span>","In response, Worldcoin’s spokesperson pointed out that the use of biometrics is already widespread in the tech industry.&nbsp;“Not all biometrics are the same, and their utility can vary widely based on things like entropy and reliability at scale. While Worldcoin utilizes iris codes in a privacy-preserving and decentralized way, organizations such as Apple and Google, are increasingly utilizing biometrics as evidenced with the launch of Optic ID and the use of retinal scans to predict heart disease,” they said.","<span data-v-f87c67ca=\"\">Worldcoin’s backers struck a pragmatic tone. <\/span>","<span data-v-f87c67ca=\"\">“I am a pretty deep believer in the notion of privacy, but I think social norms have changed in the last 100 years because of technology. It is really not tenable in modern society today to not have your identity in a large number of databases,” said Kyle Samani, co-founder and managing partner at Multicoin Capital, which invested in Worldcoin’s $100 million Series B round. “When it comes to Worldcoin, you don’t have to scan your eyeball. Like if you don’t want to, then fucking don’t.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Blockchain Capital’s Bogart said, “You have a headshot on your website. You walk around with your eyes open in front of cameras all day long.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The launch of Worldcoin’s token is a pivotal moment for the project. The airdrop had already been pushed back from the first quarter of this year to the second and has now missed that window too. A spokesperson for Worldcoin told The Block that the exact launch date will be chosen by the Worldcoin Foundation.&nbsp;<\/span>A person close to the matter said the launch <span data-v-f87c67ca=\"\">is expected soon, and&nbsp;<\/span>will now take place in the third quarter of this year.&nbsp;","<span data-v-f87c67ca=\"\">In exchange for getting their eyeballs scanned, registered users will be granted Worldcoin tokens via an airdrop. The December 2022 deck suggests users will be able to claim more tokens every week, with amounts decreasing over time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The same deck reveals more about the project’s planned tokenomics. Ultimately, there will be a total supply of 10 billion WLD tokens, with 80% reserved for users, operators and the ecosystem, and 20% set aside for the Worldcoin team and its backers. A chart in the presentation suggests team members and investors’ tokens will unlock gradually over a three-year period, beginning after one year.&nbsp;<\/span>","Worldcoin<span data-v-f87c67ca=\"\">’s<\/span> spokesperson declined to comment on tokenomics. A person familiar with the matter said more information on the project’s tokenomics, together with a so-called white paper, will be published post-launch. &nbsp;","<span data-v-f87c67ca=\"\">Besides “bootstrapping the network,” Worldcoin also intends to give WLD token holders governance rights — meaning they’ll be able to vote on how the project evolves.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Whenever it happens, insiders expect a “low float” launch for Worldcoin’s token, meaning there will be a limited number available for trading on day one, as the majority will be airdropped to verified users or held by the team and its backers.&nbsp;<\/span>","“Those people around the world who have already verified their uniqueness at an Orb (that is, have a verified World ID) will receive their allocation of the WLD token via World App at launch, and people who verify after launch will also be able to claim their allocation, so long as they are located in a place where the WLD token is intended to be available,” said Worldcoin<span data-v-f87c67ca=\"\">’s spokesperson, adding that WLD tokens will not be available in the U.S. and elsewhere.&nbsp;<\/span>","“At the moment, eligible verified users can claim 1 free WLD token per week with no maximum. The amount is consistent across applicable regions,” they said.&nbsp;","<span data-v-f87c67ca=\"\">Worldcoin is inextricably linked to OpenAI — and not just because they share a co-founder in Sam Altman. In its announcements, Worldcoin has often framed its technology as urgent in the context of the proliferation of user-friendly AI, which has rendered the issue of online identity all the more thorny.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">“You can’t disconnect Worldcoin from ChatGPT, because the whole thesis of Worldcoin is that we’re going to enter a period of mass unemployment brought about by AI,” said&nbsp;Nym’s Halpin.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In such a scenario, what good would a verified human register be? Worldcoin’s CEO Alex Blania has in the past suggested that the project could be used <\/span><a href=\"https:\/\/www.cnbc.com\/2021\/10\/21\/sam-altmans-worldcoin-wants-to-scan-your-eyes-in-exchange-for-crypto.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">as the foundation for universal basic income<\/span><\/a><span data-v-f87c67ca=\"\"> — a social welfare system favored in Silicon Valley.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">That’s just one of many potential use cases, however. A spokesperson for Worldcoin previously told The Block that the network could be used for voting in DAOs; for financial services including under-collateralized lending; by social networks; for incentive programs; in marketplaces; or for other kinds of money distribution.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The December 2022 investor deck shows that Worldcoin had initially earmarked this summer for kicking off the first of its lending pilots. Worldcoin’s spokesperson declined to comment on its product roadmap.<\/span>","<span data-v-f87c67ca=\"\">One zanier potential use case involves metaverses — virtual, interconnected spaces underpinned by blockchain technology. It’s easy to spot humans in “meatspace,” as Multicoin’s Samani puts it. “In digital space that really is not clear at all,” he said. “The obvious way to solve the problem is to tie the digital identity to biology.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Though Worldcoin has declined to specify exactly when its launch will happen, there are signs that the hour draws near. Last week, the project <\/span><a href=\"https:\/\/www.theblock.co\/post\/237018\/worldcoin-germany-okta-auth0-token\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">rolled out sign-ups for World ID in Germany<\/span><\/a><span data-v-f87c67ca=\"\"> and announced that its “sign in with Worldcoin” tool had been integrated into Okta’s Auth0, an authorization platform.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Sada confirmed via Twitter that Worldcoin was responsible <\/span><a href=\"https:\/\/cointelegraph.com\/news\/worldcoin-confirms-it-is-the-cause-of-mysterious-safe-deployments\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">for the deployment of thousands of Gnosis Safes<\/span><\/a><span data-v-f87c67ca=\"\"> on Optimism, a Layer 2 network, in recent weeks. A Gnosis Safe is a multi-signature smart contract wallet that can be used by consumer-facing wallets to offer gas-free transactions. Sada has said in previous interviews that Worldcoin uses Gnosis Safe contracts behind the scenes and that its app pays gas fees on users’ behalf.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">At launch, Multicoin’s Samani will be paying close attention to whether commercial customers are drawn to Worldcoin’s unique method of proving personhood.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The primary metric I’m looking for is not number of people scans, it’s customers who are willing to sign up,” Samani said. “In my opinion, the human API side of the market is the substantially more important side.”<\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">The World App. Source: Worldcoin.<\/em><\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Cayman Islands","content":"LOCATION"},{"type":"$115 million","content":"MONEY"},{"type":"South Korea","content":"LOCATION"},{"type":"Nairobi","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Jabil","content":"LOCATION"},{"type":"April 2022","content":"DATE"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Tiago Sada","content":"PERSON"},{"type":"Halpin","content":"PERSON"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"Bain Capital Crypto","content":"ORGANIZATION"},{"type":"earlier this year","content":"DATE"},{"type":"Multicoin’s Samani","content":"ORGANIZATION"},{"type":"Spencer Bogart","content":"PERSON"},{"type":"Bogart","content":"LOCATION"},{"type":"Florida","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"January","content":"DATE"},{"type":"December","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"Harry Halpin","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Nym’s Halpin","content":"PERSON"},{"type":"$240 million","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$120 million","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Kyle Samani","content":"PERSON"},{"type":"Gnosis Safe","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Africa","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"first quarter to the first half of this year","content":"DATE"},{"type":"Seoul","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"$30","content":"MONEY"},{"type":"Max Novendstern","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Tiger Global","content":"ORGANIZATION"},{"type":"Nym Technologies","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Worldcoin","content":"PERSON"},{"type":"Blockchain Capital’s Bogart","content":"ORGANIZATION"},{"type":"Samani","content":"PERSON"},{"type":"Europe","content":"LOCATION"},{"type":"Bogart","content":"PERSON"},{"type":"Altman","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"Personhood Protocol","content":"ORGANIZATION"},{"type":"first quarter of this year","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"United States","content":"LOCATION"},{"type":"Alex Evans","content":"PERSON"},{"type":"Alex Blania","content":"PERSON"},{"type":"Blania","content":"PERSON"},{"type":"June 2021","content":"DATE"},{"type":"Edward Snowden","content":"PERSON"},{"type":"Southeast Asia","content":"LOCATION"},{"type":"Khosla Ventures","content":"ORGANIZATION"},{"type":"the first quarter","content":"DATE"},{"type":"Kenya","content":"LOCATION"},{"type":"Gnosis","content":"PERSON"},{"type":"December last year","content":"DATE"},{"type":"Decentralized Autonomous Organization","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Cambodia","content":"LOCATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Chris Dixon","content":"PERSON"},{"type":"Sada","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"Worldcoin Foundation","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"McKinsey Global Institute","content":"ORGANIZATION"},{"type":"Blockchain Capital","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"}],"hashtag":[],"authors":["Ryan Weeks","The Block"]}