{"summary":"Meta moves off NFTs less than five months after launching the initiative, which could have introduced millions of people to digital asset ownership.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/220564\/meta-instagram-nft-death-reactions?utm_source=rss&utm_medium=rss","publishDate":"2023-03-16T14:52:13","id":14204,"type":null,"title":"Instagram NFT initiative&#x27;s swift death mints mourners, mehs","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Meta’s decision to test an initiative that allowed artists to sell NFTs on Instagram was widely considered a positive development for the struggling industry. Now that the tech giant has pulled the plug on the project, web3 enthusiasts’ reaction to the sudden move is all over the place.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“I was completely baffled,” said Dave Krugman, one of the first creators able to sell his art to people on Instagram through non-fungible tokens. “It’s so shortsighted.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Krugman’s frustration may resonate with many independent artists. The photographer said he has been making money online with his work for more than a decade. And all the while he has been slowly building an audience on Instagram where he has nearly 320,000 followers. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Meta’s new NFT feature allowed him to interact directly with his audience and he could seamlessly sell NFTs on the platform rather than having to redirect potential buyers to third-party marketplaces like OpenSea. Krugman did only one drop on Instagram of 100 NFTs at $50 a piece, which he said sold in under a minute.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">But Meta is <a href=\"https:\/\/www.theblock.co\/post\/219462\/meta-announces-plans-to-stop-working-on-nfts\" data-v-f87c67ca=\"\">moving<\/a> off of NFTs a little less than five months after launching the initiative that allowed a select few “creators” to showcase and sell “digital collectibles” — NFTs — using Instagram. <\/span><span data-v-f87c67ca=\"\">Stephane Kasriel, Meta’s head of commerce &amp; financial technologies, took to Twitter <a href=\"https:\/\/twitter.com\/skasriel\" data-v-f87c67ca=\"\">earlier this week<\/a> to announce the pilot program was coming to an end. Then the following day CEO Mark Zuckerberg said in a post to Meta’s website the company planned to lay off 10,000 employees on top of the 11,000 people it showed the door in November.<\/span><b data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/b><b data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/b><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">We’re winding down digital collectibles (NFTs) for now to focus on other ways to support creators, people, and businesses,” <\/span><span data-v-f87c67ca=\"\">Kasriel said on Twitter, adding that Meta is <\/span><span data-v-f87c67ca=\"\">“going to focus on areas where we can make impact at scale, such as messaging and monetization [opportunities] for Reels.”<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span>","&nbsp;","&nbsp;","<em data-v-f87c67ca=\"\">Artist Dave Krugman replying to Stephane Kasriel of Meta, who posted to Twitter the announcement the Instagram NFT program would end.<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">Meta’s decision means that, at least for the time being, one of the biggest social media apps in the world — Instagram had 2 billion users last year — is putting off formally embracing digital assets, a key component of the next era of the internet known as web3. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><i data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">“<\/span><\/i><span data-v-f87c67ca=\"\">Overall working with Meta and testing this new feature was pretty exciting,” said Olive Allen, another artist who participated in the test program and said she did well selling her digital art. “For the first time NFTs were available for sale on a truly mainstream platform with billions of users.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Allen, who according to her Twitter profile has been active in crypto since 2018, said she was surprised to see the program come to an end, but not shocked. “It was convenient to mint on the app and put a digital collectible up for sale,” she said.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\"><b data-v-f87c67ca=\"\">Year of efficiency<\/b><\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Meta’s decision may be tied to its cost-cutting efforts during a transformative period at the company that Zuckerberg is calling the “year of efficiency.” The CEO has been under pressure ever since he began pouring billions of dollars into a nascent metaverse amid intense criticism while simultaneously eroding economic conditions caused the company’s share price to plummet.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">As I've talked about efficiency this year, I've said that part of our work will involve removing jobs,” he wrote this week. Meta didn’t immediately respond for comment when asked if layoffs factored into the decision to sunset the NFT program.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Someone with direct knowledge of Instagram’s NFT push doesn’t believe Meta’s canceling of the program is financially motivated. <\/span>","<span data-v-f87c67ca=\"\">\"At such an early stage there’s no way somebody looked at this and said: ‘Wow if we shut down this program we can save millions in cost.’” they said. “There are still a lot of headwinds within this new, emerging web3, NFT market and maybe it’s not quite ready for primetime.\"<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ramifications<\/span><\/strong><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Some prominent voices in the NFT community and “Crypto Twitter” were quick to offer their own assessment of Meta’s decision and what the impact might be, if any.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“It is proof that NFTs on Instagram and Facebook have failed for the time being,” wrote @Waleswoosh, a self-proclaimed web3 advocate with nearly 32,000 followers on Twitter who often posts about NFTs. “If the tool had been really successful and popular, it would hardly have been discontinued.”<\/span>","<em data-v-f87c67ca=\"\">@Waleswoosh's reaction to Meta announcement.<\/em>","<span data-v-f87c67ca=\"\">@NFT_GOD assured their roughly 106,000 Twitter followers Meta’s folding up of the “digital collectibles” scheme was inconsequential. “You’re missing the big picture if you think Meta sunsetting NFTs matters,” they said. “An outdated social media site that is a decade behind TikTok has [zero] impact.”<br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">Long-term, no one knows if Meta will become a major player in web3 or participate somehow in the buying and selling of digital assets. But other established web2 companies like Reddit, and next <a href=\"https:\/\/www.theblock.co\/post\/219473\/game-changer-amazons-rumored-nft-platform-embraced-by-blur-opensea-and-orange-comet\" data-v-f87c67ca=\"\">potentially<\/a> Amazon, could possibly end up playing a major role introducing millions of mainstream consumers to the owning of digital assets.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">At least for now, the winding down of Instagram’s NFT program could have an impact on Polygon, the blockchain company Meta chose to help it run Instagram’s NFT play. Like Krugman, Polygon <\/span><span data-v-f87c67ca=\"\">was disappointed by Meta’s sudden move to end the initiative, according to a person familiar with the matter.<\/span>","<span data-v-f87c67ca=\"\">Although unclear what the drivers were, during Meta’s pilot program both the transaction volume and number of people buying and selling Polygon-powered NFTs hit all-time highs, <a href=\"https:\/\/www.cryptoslam.io\/blockchains\/polygon\" data-v-f87c67ca=\"\">according to CryptoSlam! data<\/a>.<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Polygon transaction number volumes. SOURCE: CryptoSlam!.<\/em>","&nbsp;","<span data-v-f87c67ca=\"\">For Krugman, the potential loss of revenue from selling NFTs won’t shatter his future prospects. But he had hoped to use Instagram’s NFT feature, which he said was excellent, to engage in a unique way with his large audience on the platform. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“I was going to keep a steady stream of work coming out,” he said, adding he already uses non-fungible tokens as a way of offering special perks to particularly avid fans. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“What I can do with those tokens is so powerful … NFTs give creators the ability to build community and not just audience.”<\/span>","<em data-v-f87c67ca=\"\">Yogita Khatri contributed to this story.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"$50","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"Zuckerberg","content":"PERSON"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Olive Allen","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Stephane Kasriel","content":"PERSON"},{"type":"Instagram NFT","content":"ORGANIZATION"},{"type":"Allen","content":"PERSON"},{"type":"Krugman","content":"PERSON"},{"type":"Dave Krugman","content":"PERSON"},{"type":"Kasriel","content":"PERSON"},{"type":"Yogita Khatri","content":"PERSON"}],"hashtag":[],"authors":["RT Watson","The Block"]}