{"summary":"Suspected North Korean hackers have reportedly moved over $63 million worth of ether that was stolen during a bridge attack last year.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202538\/suspected-north-korean-hackers-move-63-5-million-in-ether-stolen-from-horizon-bridge","publishDate":"2023-01-16T07:30:00","id":1421,"type":null,"title":"Suspected North Korean hackers move $63.5 million in ether stolen from Horizon bridge","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Over the weekend, on-chain analysts detected large movements from wallets tied to suspected North Korean hackers that stole about <a href=\"https:\/\/www.theblock.co\/post\/154029\/harmonys-100-million-hacker-took-control-of-its-multi-signature-wallet-analysts-say\" data-v-f87c67ca=\"\">$100 million<\/a> in crypto from Horizon in June last year.&nbsp;<\/span>","Horizon is a bridge that connects Ethereum to the Harmony blockchain. <span data-v-f87c67ca=\"\">At the time, the money was laundered via Tornado Cash, a popular crypto mixer, and spread among many wallets. Blockchain forensic firms Elliptic and Chainalysis <a href=\"https:\/\/techcrunch.com\/2022\/06\/30\/north-korea-lazarus-harmony-theft\/\" data-v-f87c67ca=\"\">traced<\/a> the Harmony hackers to Lazarus — a well-known North Korean hacking group associated with the country's regime.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over 200 days later, the hackers attempted to launder a large sum of portion of the stolen funds — yet again to evade getting caught.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">ZachXBT, a pseudonymous on-chain sleuth for cryptocurrency transactions, and security firm SlowMist were the first to <a href=\"https:\/\/twitter.com\/MistTrack_io\/status\/1614352822899822592\" data-v-f87c67ca=\"\">detect<\/a> suspicious activity involving wallets associated with the hackers.<\/span>","<span data-v-f87c67ca=\"\">The hackers transferred 41,000 ETH ($63.5 million) through over 350 different addresses in the past few days, <a href=\"https:\/\/twitter.com\/zachxbt\/status\/1614771861266792449\" data-v-f87c67ca=\"\">said<\/a> ZachXBT, who aggregated on-chain data and identified these suspicious transactions.<\/span>","<span data-v-f87c67ca=\"\">On Jan. 13, hackers started moving these funds to Railgun, a privacy-focused exchange built directly on the Ethereum blockchain that acts as a mixer, making transactions hard to trace. Such protocols can often be infallible especially when there’s large amounts of funds moving through them in identifiable patterns or clusters of transactions.<\/span>","<span data-v-f87c67ca=\"\">ZachXBT found that after Railgun, the funds were consolidated into specific addresses, and moved to three exchanges: Huobi, Binance and OKX, likely in an attempt to convert the assets into fiat money.<\/span>","<span data-v-f87c67ca=\"\">At least one centralized exchange has frozen a portion of these assets. Binance CEO Changpeng Zhao <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1614887319177428992?s=46&amp;t=f3LtMFMkPd9q6ARp-tQHTQ\" data-v-f87c67ca=\"\">said<\/a> his team was able to seize 124 bitcoin ($2.6 million). The details of how much was transferred to each exchange and how much the hackers were able to successfully launder assets through them remain unclear, ZachXBT noted.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"Railgun","content":"PERSON"},{"type":"Railgun","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"$63.5 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Horizon","content":"LOCATION"},{"type":"June last year","content":"DATE"},{"type":"$2.6 million","content":"MONEY"},{"type":"Jan. 13","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"Changpeng Zhao","content":"PERSON"}],"hashtag":["HACKS","MIXERS"],"authors":["Vishal Chawla","The Block"]}