{"summary":"The executive order is billed as &quot;the first ever, whole-of-government approach to addressing the risks and harnessing the potential benefits of digital assets and their underlying technology.&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/136888\/bidens-executive-order-on-digital-assets-drops-in-four-hours-but-we-have-it-early?utm_source=rss&utm_medium=rss","publishDate":"2022-03-09T02:14:47","id":14222,"type":null,"title":"Biden&#x27;s executive order on digital assets drops in four hours, but we have it early","category":["REGULATION"],"content":["A much-anticipated executive order from President Joseph Biden is scheduled to drop at 6:00 AM EST, according to a fact sheet reviewed by The Block.&nbsp;","The fact sheet describes the order as \"outlining the first ever, whole-of-government approach to addressing the risks and harnessing the potential benefits of digital assets and their underlying technology.\"","The document, shown in full below, was leaked to The Block. It is labeled as under embargo for 6:00 AM EST, an agreement to which The Block was never a party.&nbsp;","<a href=\"https:\/\/www.theblockcrypto.com\/linked\/136813\/biden-reportedly-set-to-order-multi-agency-study-push-on-crypto-cbdcs\" data-v-f87c67ca=\"\">Per earlier reporting<\/a>, the order is fairly benign, despite early fears of a pending crackdown. It does, however, emphasize an all-of-government approach, calling on new work from the Treasury, Financial Stability Oversight Council, Federal Reserve and national security agencies on relevant portions of the crypto ecosystem.","A <a href=\"https:\/\/www.theblockcrypto.com\/linked\/136883\/janet-yellen-says-bidens-crypto-executive-order-supports-responsible-innovation\" data-v-f87c67ca=\"\">statement from Treasury Secretary Janet Yellen<\/a> on the new executive order seems to have gone up accidentally on the Treasury's website before being taken down, but not before its webarchive was captured. Like the fact sheet, Yellen emphasized coordination, as well as the existing basis of agency interest in crypto, saying, \"This work will complement ongoing efforts by Treasury.\"","","","","","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Joseph Biden","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"6:00 AM EST","content":"ORGANIZATION"},{"type":"6:00 AM EST","content":"TIME"},{"type":"Yellen","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"}],"hashtag":["FEDERAL RESERVE"],"authors":["Kollen Post","The Block"]}