{"summary":"Ethereum core developers deployed the Dencun upgrade with proto-danksharding (EIP-4844) on the Goerli test network.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/273050\/ethereum-dencun-goerli-proto-danksharding?utm_source=rss&utm_medium=rss","publishDate":"2024-01-17T02:44:26","id":14220,"type":null,"title":"Ethereum devs implement Dencun upgrade on Goerli testnet","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Ethereum <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248349\/ethereum-eth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/ethereum.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">ETH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -0.78%\n    <\/span><\/a> <!----><\/span><\/span> core developers deployed the Dencun upgrade, incorporating proto-danksharding (EIP-4844) on the Goerli test network — serving as a precursor to its anticipated launch on the mainnet.<\/span>","The Dencun upgrade was forked on the Goerli testnet around 1:35 a.m. ET, as <a href=\"https:\/\/www.youtube.com\/watch?v=jbhFdUFnWUU\" data-v-f87c67ca=\"\">confirmed<\/a> by core developers in a livestream. The upgrade encountered roadblocks, including a potential “chain split” due to issues in clients’ ability to sync with each other. Parithosh Jayanthi, DevOps engineer at the Ethereum Foundation, <a href=\"https:\/\/twitter.com\/parithosh_j\/status\/1747564353467936817\" data-v-f87c67ca=\"\">confirmed<\/a> the Dencun fork on Goerli successfully finalized.","It's worth noting that client issues often arise on testnets during critical upgrades. Typically, client teams resolve synchronization bugs prior to the mainnet launch.&nbsp;","In preparation for this transition, the development team has opted for a phased approach — initially implementing the upgrade on various testnets.","Today it deployed on Goerli, the first testnet for the Dencun upgrade. The next implementation steps include Dencun's activation on the Sepolia testnet on Jan. 30, followed by the Holesky testnet on Feb. 7. The final mainnet release is expected by the end of the first quarter Q1 2024.","The central feature of this Dencun deployment (on Goerli) is the introduction of <a href=\"https:\/\/www.eip4844.com\/\" data-v-f87c67ca=\"\">EIP-4844<\/a> — a novel transaction mechanism known as ephemeral blobs or <a href=\"https:\/\/www.theblock.co\/post\/189829\/ethereum-core-developers-signal-support-for-proto-danksharding\" data-v-f87c67ca=\"\">proto-danksharding<\/a>. This approach allows for the temporary storage and access of off-chain data by Ethereum nodes to reduce storage demands. It is expected to substantially lower transaction costs for Ethereum dApps, particularly benefiting Layer 2 rollup chains.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"4844","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"end of the first quarter Q1 2024","content":"DATE"},{"type":"Jan. 30","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Goerli","content":"LOCATION"},{"type":"Parithosh Jayanthi","content":"PERSON"},{"type":"1:35 a.m. ET","content":"TIME"},{"type":"Feb. 7","content":"DATE"},{"type":"-0.78%","content":"PERCENT"},{"type":"Dencun","content":"PERSON"}],"hashtag":["ETHEREUM"],"authors":["Vishal Chawla","The Block"]}