{"summary":"Binance has put in an undisclosed sum into Taiwanese blockchain startup Numbers\nThe startup allows users to monetize their personal data\nNumbers’ other partners include Stanford University, IBM and HTC’s Exodus unit, among others","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/53686\/binance-invests-undisclosed-sum-in-taiwanese-data-monetization-startup-numbers","publishDate":"2020-01-22T04:10:09","id":1423,"type":null,"title":"Binance invests undisclosed sum in Taiwanese data monetization startup Numbers","category":["Exchanges"],"content":["Cryptocurrency exchange Binance has made yet another investment.","The exchange has put in an undisclosed sum into Taiwanese blockchain startup <a href=\"https:\/\/numbersprotocol.github.io\/#team-section\" data-v-f87c67ca=\"\">Numbers<\/a>, which allows users to monetize their personal data.","Bofu Chen, co-founder and CTO of Numbers, <a href=\"https:\/\/www.binance.com\/en\/blog\/421499824684900371\/Binance-Announces-Investment-in-Open-Data-Framework-Numbers-Protocol-\" data-v-f87c67ca=\"\">said<\/a> that the investment from Binance will help the firm to explore more use cases and expand its technological and business development efforts.","“We want to help everyone to create traceable and trustworthy data through an open data framework. By trading such data, not only can individuals get a reasonable reward, but the society also benefits because we rebuild the trust and enhance the operational efficiency in the process,” said Chen.","Numbers has also been working with Stanford University, IBM and HTC’s Exodus unit, among others, to set up data traceability and verification systems. Phil Chen, HTC’s decentralized chief officer, is also Numbers’ chairperson, according to its <a href=\"https:\/\/numbersprotocol.github.io\/#team-section\" data-v-f87c67ca=\"\">website<\/a>.","Earlier this year, Chen <a href=\"https:\/\/www.theverge.com\/2019\/2\/26\/18234481\/htc-exodus-1-blockchain-dapps-data-opera-mwc-2019\" data-v-f87c67ca=\"\">told<\/a> Verge that the Numbers dapp (decentralized application) is supposed to potentially help users by lowering their car or health insurance premiums if positive data is recorded about their driving or walking habits.","“The Numbers team has strong technical backgrounds and expertise in building blockchain applications with practical use cases,” said Gin Chao, Binance’s strategy officer.","Binance appears to be on an investment-and-acquisition spree. Last month, the exchange <a href=\"https:\/\/www.theblockcrypto.com\/post\/51206\/binance-invests-tens-of-millions-in-alameda-research-backed-crypto-derivatives-platform-ftx\" data-v-f87c67ca=\"\">invested<\/a> in crypto derivatives platform FTX. It also acquired little-known derivatives platform JEX, which has been renamed to Binance JEX.","Binance CEO Changpeng “CZ” Zhao recently <a href=\"https:\/\/www.theblockcrypto.com\/post\/51969\/binance-ceo-says-some-major-strategic-acquisitions-are-in-the-works-for-2020\" data-v-f87c67ca=\"\">said<\/a> that the exchange made “no less than 9 full acquisitions” in 2019 - but only a few were publicly announced.","For 2020, Binance is expected to announce some “major” strategic acquisitions, and CZ is particularly “very excited” about two deals which he believes will have a “significant impact.”"],"hashtag":["BINANCE","CZ"]}