{"summary":"Staking adoption is expected to skyrocket, said Kraken&#x27;s Head of Staked Tim Ogilvie, as more retailers and institutions examine ETH.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186213\/krakens-ogilvie-says-staking-adoption-set-to-skyrocket","publishDate":"2022-11-15T18:14:24","id":1423,"type":null,"title":"Kraken&#x27;s Ogilvie says staking adoption set to skyrocket","category":["EXCHANGES"],"content":["Prior to the fall of FTX, Ethereum’s shift to proof-of-stake was all the rage in crypto circles. Two months removed from The Merge, Ethereum is still playing catch-up with more mature staking networks like Cosmos and Polkadot, but Kraken’s Tim Ogilvie thinks that’s about to change.","“It’s going to just be an absolute rocket ship as you get closer and closer to when withdrawals are enabled,” Ogilvie, Kraken’s Head of Staked, told The Block in an interview, adding that a big transition will be seen as “a huge number of assets are likely to get staked over the course of the next six to nine months.”","When Ogilvie started Staked at Kraken five years ago, a number of questions about staking remained unanswered in terms of security and whether the mechanism would work. In the last quarter the industry saw $63 billion assets staked, generating $5 billion in annuitized rewards, according to a&nbsp;<a href=\"https:\/\/6693156.fs1.hubspotusercontent-na1.net\/hubfs\/6693156\/State%20of%20Staking%20Q3%202022%20by%20Staked_Kraken%20(1).pdf\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">company report<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/on-chain-metrics\/ethereum\/ethereum-share-of-transaction-fee-from-total-miner-revenue-monthly\/embed\" title=\"Ethereum Transaction Fee % of Total Block Validator Revenue\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">Staking revenue percentages on Ethereum have climbed since the network's change in consensus models, data from The Block Research show.<\/span>","<span data-v-f87c67ca=\"\">The growth in the staking market took years to cultivate. Initial participants grappled over unknowns regarding returns and exact parameters on when staked assets would become available again, if ever. These factors, conflated with risks associated with a potentially exploited smart contract that might be either locked or drained by a hacker, made it difficult for anyone to stake 100% of their assets outside of die-hard crypto natives, Ogilvie said.<\/span>","<span data-v-f87c67ca=\"\">Driven by confidence in PoS following the success of The Merge, Ogilvie’s conversations in retail and institutional circles now reveal excitement. “You know, Kraken has a big retail base that uses the customer offering. Staked and Kraken both have a lot of big institutional clients,” he said, noting that on both sides of the coin, “everybody's fired up about ETH.”<\/span>","<span data-v-f87c67ca=\"\">For an ecosystem closely watching the fall of Sam Bankman-Fried’s FTX empire, staking may be even more attractive, said Ogilvie. He thinks that the industry rises in waves that occasionally wash out players.<\/span>","<span data-v-f87c67ca=\"\">“A lot of what I've seen happen in these cycles is you get four or five people come in and two or three of them leave in the ensuing crash,” said Ogilvie, pointing out that situations are made worse when centralized funds like FTX, as well as Celsius, Voyager and Blockfi, “are playing with customer funds in a way that people shouldn't have trusted them to do.”<\/span>","<span data-v-f87c67ca=\"\">Kraken had no material exposure to FTX or FTT from a core business standpoint, according to Ogilvie, who added that the resonating impact of FTX’s collapse is likely to be felt industry-wide.<\/span>","<span data-v-f87c67ca=\"\">In terms of the staking industry at large however, “most funds and institutions in crypto have gotten comfortable that staking is a pretty manageable risk,” Ogilvie said.<\/span>","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">Correction: This story has been corrected with the total amount the industry has staked and the rewards generated.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Tim Ogilvie","content":"PERSON"},{"type":"Ogilvie","content":"PERSON"},{"type":"$63 billion","content":"MONEY"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"Kraken","content":"LOCATION"},{"type":"” Ogilvie","content":"PERSON"},{"type":"Kraken","content":"PERSON"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Blockfi","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"The Merge","content":"ORGANIZATION"},{"type":"Kraken’s Head of Staked","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"five years ago","content":"DATE"},{"type":"last quarter","content":"DATE"}],"hashtag":["KRAKEN"],"authors":["Jeremy Nation","The Block"]}