{"summary":"Crypto exchange Binance has fired non-performers and non-culturally fit people two months after saying it has no plans to cut jobs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/232696\/binance-layoffs-cuts-jobs#:~:text=Crypto%20exchange%20Binance%20has%20laid,no%20plans%20to%20cut%20jobs.","publishDate":"2023-05-31T10:10:16","id":14238,"type":null,"title":"Binance lays off non-performers amid shrinking market share","category":["COMPANIES"],"content":["Binance has laid off a portion of its workforce as the crypto exchange behemoth’s market share continues to shrink.","Responding to Wu Blockchain’s <a href=\"https:\/\/twitter.com\/WuBlockchain\/status\/1663890209526927373\" data-v-f87c67ca=\"\">tweet<\/a> about Binance’s layoffs, a spokesperson of the exchange told The Block, “We periodically review how we can best allocate our talent to the right teams with the right resources. And sometimes, this inevitably leads to letting go of some employees who might not be performing well or who might not be the right cultural fit.”","\"This is not a case of rightsizing, but rather, reevaluating whether we have the right talent and expertise in critical roles, and therefore we will still be seeking to fill hundreds of open roles. This will include looking at certain products and business units to ensure our resources are allocated properly to reflect the evolving demands of users and regulators,\" they added.","Binance's total headcount before the move was around 8,000. The exchange declined to comment on the size of the cuts.","The layoffs come two months after Binance reportedly <a href=\"https:\/\/cointelegraph.com\/news\/binance-not-planning-any-layoffs-500-roles-to-be-filled-in-h1\" data-v-f87c67ca=\"\">said<\/a> in March that it is \"not planning any layoffs\" and is instead trying to fill another 500 roles by the end of June. Binance still has over 300 open positions on its website.","In January, Binance CEO Changpeng Zhao <a href=\"https:\/\/www.theblock.co\/post\/200837\/binance-ceo-outlines-ambitions-to-scale\" data-v-f87c67ca=\"\">said<\/a> the company was planning to increase the number of staff by between 15% and 30% in 2023. \"We will continue to build and hopefully we will ramp up again before the next bull market,\" he said at the time.","Binance, the world's largest crypto exchange by trading volume, has witnessed a declining market share over the past few months, <a href=\"https:\/\/www.theblock.co\/post\/231141\/binance-market-share-crypto-exchange\" data-v-f87c67ca=\"\">as The Block reported recently<\/a>. Binance's sliding market share has coincided with a decline in overall trading volumes. Recent U.S. <a href=\"https:\/\/www.theblock.co\/post\/223485\/cftc-binance-suit-what-comes-next\" data-v-f87c67ca=\"\">regulatory action<\/a> against Binance and Zhao in March might also be a contributing factor to the lower market share.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/spot\/the-block-legitimate-index-market-share\/embed\" title=\"Monthly Exchange Volume Market Share\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","\"Binance has a 'bottom out' (we should probably rename it to something else) program,\" Zhao said <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1663945939482968075\" data-v-f87c67ca=\"\">Wednesday<\/a> on Twitter. \"We constantly say goodbye to people who are not strong fits with the company. Many of them are great people or high performers, but may not fit our unique culture\/situation.\"","\"This 'program' is constant,\" he added. \"I push for it on a weekly basis. There are no % of people we have to 'push out.'\"","Binance, meanwhile, remains bullish on the future. \"Delivering for our users remains our number one priority, as always, and long-term, we’re excited about the growth we’re seeing in our organization — new user registration remains strong and we’re very bullish about the pipeline of innovation across the Binance ecosystem,\" the company spokesperson said.","Binance spokesman Patrick Hillmann said the company regularly goes through a \"talent density audit and resource allocation exercise every six months or so.\" He said the layoffs were not cost-cutting measures.","\"This is a cyclical process,\" he wrote in a <a href=\"https:\/\/twitter.com\/PRHillmann\/status\/1663925657611403264?s=20\" data-v-f87c67ca=\"\">thread<\/a> on Twitter. \"Like previous exercises, this will be done after several teams (including HR, Risk, and Operations) finalize that talent density audit. There is no specific number, just direction on where we need to streamline.\"","(<em data-v-f87c67ca=\"\">Updates with comments from Binance spokesman and Binance CEO<\/em>)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"30%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Patrick Hillmann","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Wu Blockchain","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"no %","content":"PERCENT"}],"hashtag":["BINANCE"],"authors":["Yogita Khatri","The Block"]}