{"summary":"“On the surface there’s a lack of demand from crypto users for PYUSD when other alternatives exist,” Nansen said in a report.","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/247553\/paypals-new-stablecoin-facing-sluggish-demand-from-crypto-users-nansen-says","publishDate":"2023-08-25T15:18:53","id":1424,"type":null,"title":"PayPal&#x27;s stablecoin is facing sluggish demand from crypto users: Nansen","category":["Companies"],"content":["PayPal's <a href=\"https:\/\/newsroom.paypal-corp.com\/2023-08-07-PayPal-Launches-U-S-Dollar-Stablecoin\" data-v-f87c67ca=\"\">new stablecoin<\/a> is off to a bit of a slow start, with data firm Nansen <a href=\"https:\/\/pro.nansen.ai\/token-god-mode\/notable?token_address=0x6c3ea9036406852006290770bedfcaba0e23a0e8\" data-v-f87c67ca=\"\">reporting<\/a> that very few people are using and holding the PYUSD token in self-custody wallets.","\"On the surface there's a lack of demand from crypto users for PYUSD when other alternatives exist,\" Nansen said in a <a href=\"https:\/\/pro.nansen.ai\/token-god-mode\/notable?token_address=0x6c3ea9036406852006290770bedfcaba0e23a0e8\" data-v-f87c67ca=\"\">report<\/a>, suggesting this could be occurring because the payments giant is targeting a different demographic.&nbsp;","PayPal <a href=\"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin\" data-v-f87c67ca=\"\">launched<\/a> the stablecoin earlier this month in partnership with Paxos, but the fact that it's issued on the Ethereum blockchain has <a href=\"https:\/\/www.theblock.co\/post\/243647\/paypal-stablecoin\" data-v-f87c67ca=\"\">raised questions<\/a> about just how useful it will be because of the high transaction fees associated with using the protocol.","Nansen said that \"smart money\" holders seem to be avoiding the stablecoin so far, with Paxos still custodying more than 90% of PYUSD supply. Exchanges Kraken, Gate.io and Crypto.com, meanwhile, hold just over 7% of the supply.&nbsp;","Less than ten holders that aren't contracts or exchanges have balances of more than $1,000. The top holder in that category has less than $10,000 and bought the token after selling three different memecoins, according to Nansen.","PayPal did not immediately respond to a request for comment from The Block.&nbsp;"],"hashtag":["PAYMENTS","USDC"]}