{"summary":"The executive told analysts that while AI is important to the company, he still loves the metaverse and wants to build.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228541\/meta-zuckerberg-metaverse-ai?utm_source=rss&utm_medium=rss","publishDate":"2023-04-26T19:03:57","id":14244,"type":null,"title":"Meta CEO Zuckerberg is still very into the metaverse","category":["METAVERSE & NFT"],"content":["<span data-v-f87c67ca=\"\">Less than two years ago no other business leader appeared more enthusiastic about the metaverse than Meta CEO Mark Zuckerberg.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">He changed the company’s name to Meta from Facebook and began pouring <a href=\"https:\/\/www.theblock.co\/post\/159926\/us-antitrust-watchdog-sues-to-stop-facebook-from-monopolizing-the-metaverse\" data-v-f87c67ca=\"\">billions of dollars<\/a> into his Reality Labs, the company's metaverse division which develops virtual- and augmented-reality technologies. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nBut shareholders cringed. The stock tanked. And then Zuckerberg capitulated, to a degree. A year ago, on an earnings call, the CEO<\/span><span data-v-f87c67ca=\"\">&nbsp;talked about Horizon Worlds, Meta’s flagship metaverse offering, at length, mentioning it nine times. Last quarter, under pressure to cut costs and prioritize core businesses like Facebook and Instagram, Zuckerberg failed to mention Horizon Worlds even once.<\/span>","The change in mood comes as the concept of the metaverse has failed to gain much traction, and Meta has been forced to lay off tens of thousands of employees after hiring aggressively during the pandemic. Last year, Meta reported its first ever drop in revenue and shares have followed suit, sinking more than 44% from an all-time high in 2021.&nbsp;","<span data-v-f87c67ca=\"\">Earlier today, after talking extensively about artificial intelligence during his prepared speech given to analysts, Zuckerberg felt the need to set the record straight, and remind people how passionate he's called the future of social interaction through digital technologies.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">“Beyond AI, the other major technology wave that we’re focused on is the metaverse,” said Zuckerberg. “A narrative has developed that we’re somehow moving away from focusing on the metaverse vision. I just want to say upfront that is not accurate.”<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">If Meta was to pull back from, or table, its metaverse ambitions it would likely be welcome news for many&nbsp; many shareholders. Reality Labs lost $4 billion in the first quarter of this year. It lost nearly <a href=\"https:\/\/www.theblock.co\/post\/206819\/nearing-14-billion-metas-2022-metaverse-losses-piling-up\" data-v-f87c67ca=\"\">$14 billion<\/a> in 2022. And there's more to come.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">The bleeding will not only continue throughout the year, this year’s losses will top 2022’s, Meta said in a statement. <\/span><span data-v-f87c67ca=\"\">“<\/span><span data-v-f87c67ca=\"\">We continue to expect Reality Labs operating losses to increase year-over-year in 2023,” it said.<\/span>","<span data-v-f87c67ca=\"\">Thanks to cost cutting, a drive towards greater efficiency and steady growth Meta’s “Family of Apps” business, which includes Facebook, Instagram, Messenger and WhatsApp, the company beat analysts' estimates on Wednesday when it reported $28.6 billion in revenue for the fiscal quarter ending in March. <\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span><span data-v-f87c67ca=\"\">Compare that to <\/span><span data-v-f87c67ca=\"\">Reality Labs generating $339 million in revenue during the three-month period, which was less than half what the division posted a year ago. But Zuckerberg said there has been some good news on the metaverse front, which he said is a \"long-term project.\"<br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Meta CEO Mark Zuckerberg during a company presentation in 2021.<\/span><\/em>","<span data-v-f87c67ca=\"\">During the call, Zuckerberg noted some metaverse-adjacent milestones. \"More than a billion Meta avatars have been created,\" he said. \"More than half of Quest daily actives spend more than an hour using their device.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThe Quest is a line of virtual-reality googles sold by Meta.<\/span>","<span data-v-f87c67ca=\"\">Horizon Worlds, however, has by most measures been an unmitigated disaster. Earlier this year, the Wall Street Journal <a href=\"https:\/\/www.wsj.com\/articles\/meta-to-revamp-horizon-metaverse-app-plans-to-open-for-teen-use-as-soon-as-march-11675749223?mod=e2tw\" data-v-f87c67ca=\"\">reported<\/a> Meta is hoping to attract younger users between the ages of 13 and 17 as the total number of people using the platform barely exceeds 200,000.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nMeanwhile, the Roblox platform, also a multiplayer virtual world but one that is popular among younger consumers attracted an average of <a href=\"https:\/\/ir.roblox.com\/news\/news-details\/2023\/Roblox-Reports-Fourth-Quarter-and-Full-Year-2022-Financial-Results\/default.aspx\" data-v-f87c67ca=\"\">65 million daily users<\/a> in January of this year.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nThis time last year Zuckerberg promised to deliver a web version of Horizon Worlds by the end of 2022, which would allow users to access the platform as they do Roblox and other metaverse-y platforms like Fortnite and Minecraft.<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“We plan to launch a web version of Horizon later this year that will make it easy for people to step into metaverse experiences from a lot more platforms,” he said on a call with analysts last April. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nNearly five months into 2023, Meta has yet to deliver.<\/span><span data-v-f87c67ca=\"\"><br data-v-f87c67ca=\"\">\n<\/span>","<em data-v-f87c67ca=\"\">Correction: story updated to show that <span data-v-f87c67ca=\"\">Reality Labs' quarterly revenue was less than half what it was a year ago.&nbsp;<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"the fiscal quarter ending","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"the first quarter","content":"DATE"},{"type":"Zuckerberg","content":"PERSON"},{"type":"$4 billion","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Meta","content":"ORGANIZATION"},{"type":"$339 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Facebook","content":"LOCATION"},{"type":"44%","content":"PERCENT"},{"type":"last April","content":"DATE"},{"type":"Last quarter","content":"DATE"},{"type":"Meta","content":"PERSON"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"$28.6 billion","content":"MONEY"},{"type":"March","content":"DATE"},{"type":"$14 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Horizon","content":"LOCATION"},{"type":"Reality Labs","content":"ORGANIZATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}