{"summary":"With the launch of XCM, Polkadot has achieved its main offering of interoperability.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/144989\/polkadot-now-lets-you-natively-send-messages-across-parachains","publishDate":"2022-05-04T09:12:58","id":14250,"type":null,"title":"Polkadot now lets you natively send messages across parachains","category":["TECHNOLOGY"],"content":["<span data-v-f87c67ca=\"\">Polkadot has enabled a messaging system called <\/span><span data-v-f87c67ca=\"\">Cross-Consensus Messaging format (XCM). This allows all Polkadot-based blockchains to directly communicate with each other for the first time.<\/span>","Polkadot is an ecosystem of connected blockchains. One way to imagine it is to think of a wheel with a hub and spokes. The spokes represent each blockchain, known as a parachain, and the hub is the native blockchain element that connects everything together. The goal was always to make it possible for these parachains to talk to one another — something that <a href=\"https:\/\/wiki.polkadot.network\/docs\/learn-crosschain\" data-v-f87c67ca=\"\">XCM<\/a> now enables.","<span data-v-f87c67ca=\"\">XCM is a token messaging format facilitating the exchange of messagesacross Polkadot's parachains. It will lay the foundation for parachain users and developers to exchange data and crypto tokens between them. This will make it easy for users of these blockchains to send messages from one parachain to another.<\/span>","The initial Polkadot parachains <a href=\"https:\/\/www.theblock.co\/linked\/128026\/parachains-officially-launch-on-polkadot-network\" data-v-f87c67ca=\"\">went live<\/a> in December 2021 and until now had remained fragmented. With the launch of XCM, Polkadot has achieved its main goal of being a fully interoperable ecosystem.","<span data-v-f87c67ca=\"\">\"Now that <a href=\"https:\/\/www.theblock.co\/post\/91413\/polkadot-dot-fourth-largest-coin-market-cap-surpassing-xrp\" data-v-f87c67ca=\"\">Polkadot's<\/a> cross-chain messaging protocol has been enabled, Polkadot has fulfilled its objective to be a fully interoperable multi-chain ecosystem,” said Shawn Tabrizi, lead developer at Polkadot, in a statement shared with The Block.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">XCM is not dependent on traditional bridges that rely on the \"wrapping\" of assets to move them from one blockchain to another. Rather the developers baked XCM in the Relay Chain, Polkadot’s central hub that secures all parachains. This means the whole network of connected parachains will now support this flow of data. <br data-v-f87c67ca=\"\">\n<\/span>","<span data-v-f87c67ca=\"\">This setup is considered more secure than <a href=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-l1-bridges\" data-v-f87c67ca=\"\">bridges<\/a> alone, which can have centralized weak points and have often been hacked for significant amounts of crypto. Future iterations of the XCM will allow messages to be sent between parachains without needing to be stored on the Relay Chain.<br data-v-f87c67ca=\"\">\n<\/span>","“With XCM, we have a stable and reliable inter-chain messaging channel that is far superior to the fragmented bridges, ”Hoon Kim, said chief technical officer of Astar, a smart contract service on Polkadot.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"December 2021","content":"DATE"},{"type":"Polkadot","content":"ORGANIZATION"},{"type":"Astar","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Polkadot","content":"LOCATION"},{"type":"Hoon Kim","content":"PERSON"},{"type":"Shawn Tabrizi","content":"PERSON"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}