{"summary":"Mithril wants Binance to refund the 200,000 BNB deposit collected from the project after the crypto exchange delisted its token.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/195326\/mithril-binance-delisting-refund?utm_source=cryptopanic&utm_medium=rss","publishDate":"2022-12-15T08:45:33","id":14256,"type":null,"title":"Mithril demands $53 million BNB refund from Binance following delisting","category":["EXCHANGES"],"content":["Mithril, a blockchain social media project, has asked Binance to refund 200,000 BNB ($53 million) after the crypto exchange delisted its token from the platform earlier today.","The project <a href=\"https:\/\/twitter.com\/mithdotio\/status\/1603356872303865856\" data-v-f87c67ca=\"\">stated<\/a> that it paid a 200,000 BNB deposit to Binance as part of the initial <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-lists-mithril-mith-360019834291\" data-v-f87c67ca=\"\">listing<\/a> in November 2018. “Given that Binance has unilaterally decided to end this partnership, we respectfully ask to have our 200,000 BNB deposit returned,” the project tweeted.","At the time of listing in 2018, the BNB deposit would have been worth about $1 million.","Mithril also claimed that the project had been a longtime collaborator of the crypto exchange. Mithril's token, which carries the ticker MITH, was <a href=\"https:\/\/www.theblock.co\/linked\/20178\/mith-soars-after-mithril-announces-it-will-be-the-first-project-on-binance-chain\" data-v-f87c67ca=\"\">the first token<\/a> on the Binance Chain when it launched in April 2019. It was also the <a href=\"https:\/\/www.theblock.co\/linked\/20868\/binance-dex-officially-launches-listing-mithril-as-the-first-pair\" data-v-f87c67ca=\"\">first listed pair<\/a> on the Binance decentralized exchange. Mithril also added it made donations to Binance Charity and collaborated on other initiatives as part of a longstanding working relationship with the company since 2018. The listing announcement from 2018 shows a 20,000 BNB donation to the Blockchain Charity Foundation.","MITH token tumbles 20% amid Binance delisting announcement. Image: CoinGecko.","Mithril stated that the refund was necessary to continue its operations. The blockchain social media project has largely been inactive for almost two years. Its last Twitter post before today was on Jan. 7, 2021. The project’s website also appears to be offline.","MITH was among four tokens <a href=\"https:\/\/www.binance.com\/en\/support\/announcement\/binance-will-delist-mith-tribe-rep-and-btcst-on-2022-12-22-35a4169422154c838f012331f5f4b425\" data-v-f87c67ca=\"\">delisted<\/a> by Binance on Thursday. The announcement stated that the tokens no longer met the exchange's listing standard.","Binance did not immediately respond to The Block's request for additional comments before publication.","Data from CoinGecko shows Mithril's token ranks outside the top 1,000 crypto tokens according to market capitalization. MITH currently has a market cap of $5.9 million. The token’s spot price has declined more than 20% since the Binance delisting announcement.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2018","content":"DATE"},{"type":"Mithril","content":"ORGANIZATION"},{"type":"earlier today","content":"DATE"},{"type":"Binance Chain","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"today","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"2018","content":"DATE"},{"type":"Blockchain Charity Foundation","content":"ORGANIZATION"},{"type":"$5.9 million","content":"MONEY"},{"type":"$53 million","content":"MONEY"},{"type":"Binance Charity","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"Jan. 7, 2021","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"April 2019","content":"DATE"}],"hashtag":["BINANCE","BNB"],"authors":["Osato Avan-Nomayo","The Block"]}