{"summary":"Development teams for Keep Protocol and NuCypher are proposing an on-chain merger in a network first for Ethereum.\nThe proposals have been shared publicly for community and stakeholder feedback on the concept.","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/97634\/keep-protocol-nucypher-ethereum-merger","publishDate":"2021-03-08T17:48:35","id":1426,"type":null,"title":"Keep Network, NuCypher teams pitch protocol merger on the Ethereum blockchain","category":["Ethereum"],"content":["Development teams for Keep Protocol and NuCypher are proposing an on-chain merger in a network first for Ethereum.","Unlike past instances in which DeFi protocols pledged to collaborate closely, the proposal, as outlined by Keep Network project lead Matt Luongo in <a href=\"https:\/\/forum.keep.network\/t\/proposal-keep-and-nucypher-hard-merge\/74\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a forum thread<\/a>, would see the two protocols join together in a multi-stage process.&nbsp;","As previously reported by The Block, Keep Network is an Ethereum-based protocol for privately storing data offline. Its best-known product is<a href=\"http:\/\/(https:\/\/www.theblockcrypto.com\/post\/63176\/tbtc-a-bitcoin-pegged-token-on-ethereum-has-begun-its-launch-with-makerdao-and-compound-support\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"> tBTC<\/a>, one of a handful of tokens on Ethereum that are backed by bitcoin holdings. <a href=\"https:\/\/www.nucypher.com\/proxy-re-encryption\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">NuCypher<\/a> is also focused on privacy, having built a layer on top of Ethereum that utilizes proxy re-encryption or PRE.","Why the merger? As Luongo puts it, both teams \"realized we have a lot in common.\" In a follow-up interview via DM, Luongo told The Block: \"We have shared values. It felt like we were all excited about the technology and unified against projects we think are too centralized, like WBTC and Ren.\"","He went on to say that \"[w]hile the protocols had gone in different directions in the past year, both have been considering roadmaps that would bring us back into competition for the medium term... Our strengths and weaknesses are complementary.\"","There's an economic factor at play as well, with the teams betting that a protocol merger will shore up their long-term viability as well.","\"The token models are very very similar,\" said Luongo. \"Both are work tokens that can be used to earn fees. Both networks grow when they have more users paying for services When you combine them, you share half of the pie - but the expectation is that the combined network will far exceed what either could do individually. Now tBTC can make use of proxy re-encryption without fear of enriching a competing network, PRE can be used for account recovery, and future applications can build off both.\"","As the NuCypher team, which penned <a href=\"https:\/\/dao.nucypher.com\/t\/codename-keanu-the-first-ever-decentralized-on-chain-network-hard-merge-between-keep-and-nucypher\/159\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">a forum post<\/a> on the so-called Codename KEANU, put it in their tweet thread on the matter:","The two development teams would remain independent under the proposal, with both contributing to the shared protocol if the merger goes forward. At the heart of the shared protocol would be a decentralized autonomous organization, or DAO, to be used for governance. Tokens from the two protocols, KEEP and NU, would carry equal weight under this framework.","Ultimately, the merger will see the two teams collaboratively developing what would become a wholly new protocol. The original protocols wouldn't be abandoned outright, according to Luongo, who said that the Keep and NuCypher developers \"are fully independent and can decide how they spent their time, but on the Keep side I know we plan to maintain.\"","As framed in their respective proposal posts, the union of NuCypher and Keep is contingent on support from their respective communities and stakeholders."],"hashtag":["ETHEREUM"]}