{"summary":"The SEC has filled the vacuum left by a lack of legislation to expand its oversight into two areas identified by U.S. government officials as &quot;regulatory gaps&quot;: stablecoins and crypto firms that integrate traditionally separate financial activities.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/225152\/gensler-sec-crypto-stablecoin-congress?utm_source=twitter&utm_medium=social","publishDate":"2023-04-05T17:41:48","id":14265,"type":null,"title":"SEC fills the vacuum left by lack of new crypto, stablecoin laws in US","category":["POLICY"],"content":["While U.S. lawmakers are grappling with how, or whether, to move forward on legislation to create new rules in the country around digital assets, the Securities and Exchange Commission has filled the vacuum \"regulatory gaps\" identified by President Joe Biden's administration.","Though senior U.S. regulators, including Treasury Secretary Janet Yellen, have called for new laws to govern digital assets, one of the top regulators for the industry, SEC Chair Gary Gensler, reiterated to reporters last week that he doesn’t see the need for new laws to regulate the space.","“If Congress were to act, though I don’t think we need these authorities, not to undermine inadvertently through definitions of what’s in or out, or in essence allowing for conflicts that we don’t allow,” Gensler said following testimony before a House Appropriations subcommittee.","Last fall, the Financial Stability Oversight Council, which is a super committee of U.S. financial regulators that Gensler also sits on, recommended legislation in three areas for digital assets — stablecoins, trading firms that integrate different financial activities that go beyond what a traditional financial exchange does, and direct oversight of spot market trading in bitcoin and other crypto commodities.","The lack of new laws has kept the SEC’s lane clear to proactively regulate in new areas that it hadn’t previously focused on including stablecoins and firms that combine a number of traditionally separate financial activities. &nbsp;","Stablecoins have driven much of the recent instability in the digital asset industry. The collapse of Terra last year led to multiple bankruptcies, as did the collapse of FTX’s FTT token in the fall.","A new law to create standards for stablecoins has been top of the agenda in Congress since the Terra collapse last spring, and bipartisan talks in the House of Representatives ran for months last year as now-House Financial Services Committee Chair Patrick McHenry, R-N.C., and then-House Financial Services Chair Maxine Waters, D-Calif., who remains the top Democrat on the committee, negotiated on legislation for a comprehensive framework.","Despite cooperation from those key policymakers, talks stalled over reluctance from the Treasury Department. Support from the department was seen as helpful to gain support of several fence-sitting Democrats on the House Financial Services Committee and in the Senate, as well as necessary for a bill to receive a presidential signature to become law.&nbsp;","Multiple people familiar with those deliberations say the SEC drove Treasury’s reluctance through constant objections and last-minute revision requests.&nbsp;","“The stablecoins legislation was coming together over the summer, and the SEC was known to oppose it,” said a former government official familiar with the matter. A major objection was that legislation should only touch “payment stablecoins,” the person said. But the SEC demanded a definition so narrow that it would not apply to existing tokens, the person argued.&nbsp;","“I think the true aim was to stop any stablecoin legislation, which interestingly was at odds with the position that they took with the President’s working group report” on digital assets published last year, said the former official. “It tracked with their activities now, which is essentially claiming through enforcement action that these stablecoins are securities.”","A current industry advocate with previous government experience agreed.&nbsp;“The SEC was fighting every bill in Congress, period,” they said.","A third person familiar with those talks, who also asked for anonymity to speak freely, disputed the claim that the SEC actively sought to sink the bill.","The SEC provided technical assistance that “dealt a lot with definitions of issues,” the person said. “Sometimes the technical assistance is discordant,” the person added. “It’s the job of the authors to take what they want and leave with the rest.”&nbsp;","Though any new legislation is unlikely to completely cut the SEC out of regulating digital assets, the lack of new laws in the areas identified as \"regulatory gaps\" by the U.S. government has kept an open vacuum for the SEC to fill.&nbsp;","In February, the agency sent a letter to Paxos informing the crypto infrastructure company of an investigation into its joint stablecoin project with Binance, BUSD. Paxos says it has since stopped minting the token.","And last week the <a href=\"https:\/\/www.sec.gov\/news\/press-release\/2023-64\" data-v-f87c67ca=\"\">SEC took action against Beaxy<\/a> due to the way the platform combined several traditionally separate financial activities under one company, another area where the FSOC recommended new laws to create guardrails.&nbsp;","“To protect investors, there are separate registration requirements for exchanges, brokers, and clearing agencies, with each essentially acting as a check on the other,” Gurbir Grewal, Director of the SEC’s Division of Enforcement, said in a statement connected to the action. “When a crypto intermediary combines all of these functions under one roof—as we allege that Beaxy did—investors are at serious risk. The blurring of functions and the lack of registrations meant that regulations designed to protect investors were not followed or even recognized by Beaxy.”","The move highlights a longstanding criticism of the digital asset space, that ‘exchanges’ combine functions in ways that traditional stock or commodities exchanges don’t by offering investment accounts, market-making in a way that leads to trading against their own customers and providing loans. Laws and ethical considerations prevent the commingling of those activities.","But a Commodity Futures Trading Commission complaint against crypto behemoth Binance last week also showcased how exchanges may be engaged in activities that concern regulators. The company allegedly operated approximately three hundred undisclosed trading accounts on its own platform, in addition to owner Changpeng ‘CZ’ Zhao owning two investment firms that traded through the company’s platform, and two of his own personal trading accounts. That fact raises questions about possible market manipulation, as the company traded against its own customers with advantages in speed of execution and internal data.","The SEC has yet to publicly announce an investigation into Binance, though the charges levied by the CFTC last week could likely be applied in a securities law context. The commodities regulator claims that Binance <a href=\"https:\/\/www.theblock.co\/post\/223143\/binance-details-from-cftc-complaint\" data-v-f87c67ca=\"\">knowingly violates U.S law by not enforcing its own geofencing<\/a> for U.S. customers, allowing it to operate illegally in the U.S. The SEC could claim similar illegal securities-related activity if the agency agrees with the CFTC that Binance is illegally doing business in the U.S. market, in addition to other possible violations over combining various activities on the same platform.","Though the SEC does not comment on ongoing investigations, it acknowledged in court that agency staff sees Binance as an unregistered securities exchange as part of an effort to block Binance.US’ acquisition of Voyager Digital Holdings, a bankrupt digital asset firm.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Janet Yellen","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Beaxy","content":"PERSON"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"House Financial Services Committee Chair Patrick McHenry","content":"ORGANIZATION"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"spring","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"Financial Stability Oversight Council","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Voyager Digital Holdings","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"House Appropriations","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"House Financial Services Chair Maxine Waters","content":"ORGANIZATION"},{"type":"SEC’s Division of Enforcement","content":"ORGANIZATION"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["SEC"],"authors":["Colin Wilhelm","The Block"]}