{"summary":"Coinbase Global, the crypto exchange operator, is adding to the services it offers customers in Singapore.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231030\/coinbase-singapore-services?utm_source=rss&utm_medium=rss","publishDate":"2023-05-16T20:00:08","id":14260,"type":null,"title":"Coinbase expands Singapore services amid international expansion drive","category":["COMPANIES"],"content":["Coinbase Global, the crypto exchange operator, is extending the range of services it offers customers in Singapore.","The move comes as Coinbase takes steps to bolster its international presence, in direct response to a crackdown by regulators in the U.S. — where the company is based.","“The message here is the world is sort of moving on with or without the U.S. and we are very committed as a global company to keep moving forward on international expansion,” said Hassan Ahmed, country director for Singapore at Coinbase.","Coinbase <a href=\"https:\/\/www.theblock.co\/post\/176064\/crypto-exchange-coinbase-gets-license-in-singapore\" data-v-f87c67ca=\"\">received in-principle approval<\/a> as a major payments institution from the Monetary Authority of Singapore (MAS) in October last year. More recently, the company <a href=\"https:\/\/www.theblock.co\/post\/227253\/coinbase-bermuda-offshore-derivatives-exchange\" data-v-f87c67ca=\"\">secured a license<\/a> to operate an international exchange out of Bermuda, where it plans to offer derivatives trading.","This morning, Coinbase announced that it is introducing no-fee purchases of USDC for customers using SGD, allowing users to earn rewards for holding USDC on the platform and rolling out USDC order books for more experienced traders — allowing them to trade over 200 assets against USDC.","The company is also enabling staking for ETH, SOL, ADA, ATOM and XTZ for customers in Singapore.","This new functionality, Coinbase said in its announcement, comes in response to the findings of a survey that sampled 2,000 adults in Singapore.","The findings suggest that fully a quarter of Singaporeans consider crypto the future of finance, on par with the U.S. and surpassing the 17% recorded in an equivalent UK survey. It also found that 32% of Singaporeans own or used to own crypto, while more than half those people expect to trade or hold crypto this year.","“Amid what might seem a somewhat sea of pessimistic headlines I think, for Singaporean consumers and users of crypto, we certainly see a lot of resilience come through,” said Ahmed. “The adoption cycle continues to play out.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"SGD","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Hassan Ahmed","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"32%","content":"PERCENT"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"Bermuda","content":"LOCATION"},{"type":"October last year","content":"DATE"},{"type":"17%","content":"PERCENT"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"}],"hashtag":["COINBASE"],"authors":["Ryan Weeks","The Block"]}