{"summary":"Was Sam Bankman-Fried willing to do anything — and lie to anyone — in order to keep Alameda Research afloat?","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/255326\/inside-sbfs-trial-ftx-numbers-checked-out-except-for-an-8-billion-mystery-friend?utm_source=rss&utm_medium=rss","publishDate":"2023-10-06T18:01:35","id":14267,"type":null,"title":"Inside SBF’s trial: FTX numbers checked out, except for an $8 billion mystery &#x27;friend&#x27;","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">As customers began to withdraw assets from FTX in Nov. 2022, CEO and co-founder Sam Bankman-Fried asked his co-founder and CTO, Gary Wang, to calculate how much money Alameda Research would need to deposit on the exchange in order to cover the outflows.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang found that, excluding the accounts of Alameda Research, the sum of FTX customer balances matched the assets in FTX's hot wallets, he <a href=\"https:\/\/www.theblock.co\/tag\/sbf-trial\" data-v-f87c67ca=\"\">testified<\/a> on Friday under direct questioning from government prosecutors during the fourth day of Bankman-Fried's criminal trial in New York. But, unbeknownst to him, there was a problem with his math.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang only got the full picture, he testified, once Bankman-Fried asked him if he had included \"our Korean friend\" in the calculations. Confused, Wang checked with Nishad Singh, another former FTX executive, who told Wang that the \"Korean friend\" actually referred to the $8 billion <\/span><a href=\"https:\/\/www.theblock.co\/post\/254855\/inside-the-courtroom-why-fiat-will-be-key-to-the-sbf-trial\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">\"fiat@\" hole<\/span><\/a><span data-v-f87c67ca=\"\"> at the heart of FTX's collapse.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang testified that Singh told him that the fiat@ account balance had been reassigned in FTX's internal database to an account bearing the name \"<\/span><span data-v-f87c67ca=\"\"><a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"4c3f29233539222f242d3e20293f74740c2b212d2520622f2321\">[email&nbsp;protected]<\/a><\/span><span data-v-f87c67ca=\"\">,\" which was granted special privileges so that Alameda Research wouldn't have to pay interest on its line of credit. Bankman-Fried also knew FTX's finances were more visible to the public and to investors than Alameda's, Wang testified.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">When Wang confronted Bankman-Fried about the $8 billion hole, Bankman-Fried simply acknowledged that the figure sounded correct with a \"neutral demeanor,\" according to Wang. The following day, after being informed of the hole, Bankman-Fried tweeted, \"<a href=\"https:\/\/www.theblock.co\/post\/183680\/ftx-fine-bankman-fried-binance-work-together\" data-v-f87c67ca=\"\">FTX is fine<\/a>. Assets are fine.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet when Bankman-Fried declared bankruptcy on his empire four days later, it would mark the end of his years-long quest to keep Alameda Research afloat —&nbsp;even if it meant Bankman-Fried had to lie to investors, FTX customers, and the public about its true relationship with FTX.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Over the course of Wang's direct questioning, government prosecutors sought to establish the many ways in which Bankman-Fried gave special treatment to Alameda Research's accounts on the FTX exchange.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang explained that Alameda's accounts had certain privileges not shared by other accounts on the exchange. For example, due to the sheer number of large Alameda positions, traders would sometimes fail to place new positions because the system determined its collateral wasn't large enough.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Under Bankman-Fried's direction, Wang said he increased Alameda's line of credit several times, from a few million, to a few hundred million, then one billion, before its final value: $65.3 billion. Other customers had lines of credit in the \"single to double digit millions,\" according to Wang. Alameda, unlike other customers with lines of credit, was exempt from paying interest on its loan.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Alameda's accounts were also allowed to go negative without being subject to FTX's auto-liquidation procedure, which was designed to close a customer's position before that customer incurred a loss, Wang testified. Yet if Alameda's accounts went more negative than FTX's revenue, that meant one thing, Wang testified: Alameda had to be borrowing FTX customer deposits.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In late 2019, according to Wang's testimony, he overheard an Alameda Research employee asking Bankman-Fried whether or not Alameda was permitted to withdraw funds from FTX. Bankman-Fried reportedly gave the employee the green light, with one caveat: the amount withdrawn should not exceed FTX's trading revenue at the time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, when Wang checked on Alameda's accounts in early 2020, he was surprised to find they had a negative balance of around $200 million at the time, while FTX revenue was only around $150 million.<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried then asked if Wang was including the value of FTT tokens that the pair had created in order to \"sort of act as equity\" in FTX, according to Wang. Wang wasn't, so Bankman-Fried directed him to include the tokens in his calculations, even though most FTT at that point was owned by Alameda. Wang agreed, telling the court that he trusted Bankman-Fried's judgment, despite his own reservations about using the illiquid token as collateral.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Properly accounting for Alameda's assets repeatedly proved to be a challenge for Bankman-Fried and his deputies. Amid the crypto market downturn in June 2022, several of Alameda's lenders recalled their loans. Yet there was a problem: no one could figure out how much money Alameda actually had.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang testified that he initially calculated a -$19 billion balance for Alameda's accounts, while in reality the liability was lower, due to the existence of <\/span><a href=\"https:\/\/www.theblock.co\/post\/255095\/inside-the-trial-sbf-faces-his-former-friends\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">a bug in the fiat@ system<\/span><\/a><span data-v-f87c67ca=\"\"> that overstated Alameda's debt. However, even after accounting for the bug, Wang, Singh, and Alameda Research CEO Caroline Ellison all got slightly different values when they attempted to calculate the total balance of Alameda's accounts on FTX.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">After Wang's best effort, he surmised that Alameda owed FTX about $11 billion, which seemingly comprised nearly $3 billion in borrows on Alameda’s main “info@” account, along with the $8 billion fiat@ liability. Wang testified that he told Bankman-Fried about the negative balances, but that Bankman-Fried authorized Ellison to repay Alameda's lenders anyway.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Wang's testimony also detailed how Alameda Research would sometimes take on losses suffered by FTX. In one notable instance, after an FTX user exploited the price of MobileCoin to generate fraudulent profits of at least several hundred million dollars, Wang testified, Alameda's funds were used to cover the exchange's losses.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Yet even while FTX was operating normally, Wang testified, Alameda often stepped in to cover losses suffered by the exchange due to flaws in FTX's auto-liquidation engine. On certain days, Wang testified, the exchange lost more money due to imperfect liquidations than it made from trading fees. This directly contradicted Bankman-Fried's assertion on an Aug. 2021 <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-08-06\/transcript-sam-bankman-fried-and-matt-levine-on-crypto-market-structure\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">podcast<\/span><\/a><span data-v-f87c67ca=\"\">, a recording of which was played for the court, that FTX had \"never had a day…where there's more money that we've lost in blow outs to revenue that we made just from trading fees.\"<\/span>","<span data-v-f87c67ca=\"\">It was far from the only time Bankman-Fried seemed to have lied about Alameda's closeness to FTX. For example, the court was shown a tweet from Bankman-Fried claiming that Alameda was treated the same as every other market maker on the exchange. However, that tweet was sent on the very same day Bankman-Fried directed Wang to alter Alameda’s privileges in FTX's codebase, according to Wang's testimony.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Sept. 2022, Wang testified, Bankman-Fried learned of an forthcoming <\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2022-09-14\/trading-firm-alameda-research-powers-ftx-ceo-sam-bankman-fried-s-crypto-empire\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">article<\/span><\/a><span data-v-f87c67ca=\"\"> that would shed light on FTX's close relationship with Alameda. In response, Bankman-Fried drafted a document where he proposed shutting down Alameda.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In the document, which he shared with Wang and Singh, Bankman-Fried complained that he wasn't sure he could trust Alameda’s leadership — apparently referring to Alameda CEO Caroline Ellison, his on-and-off girlfriend. Bankman-Fried also complained of low morale among employees and the lack of access to borrowers and lenders at the time.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried also indicated that he would prefer to back Modulo Capital. He and Xiaoyun \"Lily\" Zhang, one of the co-founders of Modulo, had previously been romantically involved, according to <\/span><a href=\"https:\/\/www.nytimes.com\/2023\/01\/24\/business\/ftx-sbf-modulo-capital.html\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reports<\/span><\/a><span data-v-f87c67ca=\"\">. Wang testified that Bankman-Fried had around a 60% ownership stake in Modulo.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Upon receiving the document, Wang testified that he and Singh approached Ellison and asked how much Alameda was currently borrowing from FTX. Wang testified that Ellison's answer — $14 billion — didn't seem to phase Bankman-Fried. <\/span><span data-v-f87c67ca=\"\">Less than two months later, Bankman-Fried would get his wish to shut down Alameda Research as he signed his companies into bankruptcy.&nbsp;<\/span>","Wang will face cross-examination from Bankman-Fried's defense lawyers when court resumes on Tuesday. Wang, throughout his time in court, seemed to deliberately avoid meeting his former friend, roommate, and boss's eyes.","Following Wang's testimony, the government intends to call Caroline Ellison as a witness.","Bankman-Fried's lawyers, meanwhile, have repeatedly tested the patience of Judge Lewis A. Kaplan. About ten minutes before the court was scheduled to adjourn on Friday, attorney Christian Everdell attempted to fill the remaining time with questions that Kaplan found repetitive. The judge admonished him, saying \"Counsel, we really did cover all of this, and it's uncontroversial,\" before calling an early end to the day's proceedings.","<span data-v-f87c67ca=\"\">The Block will continue to coverage Bankman-Fried's trial when court resumes next week.<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"$3 billion","content":"MONEY"},{"type":"$65.3 billion","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Kaplan","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"60%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Modulo Capital","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$19 billion","content":"MONEY"},{"type":"June 2022","content":"DATE"},{"type":"several hundred million dollars","content":"MONEY"},{"type":"Sept. 2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Nov. 2022","content":"DATE"},{"type":"Xiaoyun \"Lily\" Zhang","content":"PERSON"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Wang","content":"PERSON"},{"type":"four days later","content":"DATE"},{"type":"$11 billion","content":"MONEY"},{"type":"Wang","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"$14 billion","content":"MONEY"},{"type":"Christian Everdell","content":"PERSON"},{"type":"Aug. 2021","content":"DATE"},{"type":"Lewis A. Kaplan","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Singh","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"$8 billion","content":"MONEY"},{"type":"$150 million","content":"MONEY"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Zack Abrams","The Block"]}