{"summary":"Base Layer 2 network has opened its mainnet for developers, ahead of a public launch slated for early August.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/239393\/coinbase-base-mainnet-developers?utm_source=twitter&utm_medium=social","publishDate":"2023-07-13T12:00:45","id":14272,"type":null,"title":"Coinbase&#x27;s Base launches mainnet for developers, plans public rollout in August","category":["CRYPTO ECOSYSTEMS"],"content":["The Layer 2 network Base, backed by cryptocurrency exchange Coinbase, has released a mainnet for developers ahead of a public launch, slated for early August.","The developer mainnet, which allows applications to be deployed on Base, comes after the introduction of a <a href=\"https:\/\/www.theblock.co\/post\/214183\/coinbase-unveils-layer-2-network-and-developer-fund\" data-v-f87c67ca=\"\">testnet version<\/a> in February.","Base, built on Optimism's software stack known as the OP Stack, functions as a rollup network. It is a secondary layer that performs off-chain computations with the goal of facilitating faster and cheaper transactions, while maintaining the security advantages of the Ethereum mainnet.&nbsp;","As part of the preparatory process for the mainnet launch, the Base core team carried out comprehensive internal and external security <a href=\"https:\/\/base.mirror.xyz\/_SiAx8dQRYJJ4lygkJc0QvBKvf16VVm7_-mdWMdFv20\" data-v-f87c67ca=\"\">audits<\/a> to bolster the network's safety as well as that of the Optimism Protocol Stack (OP Stack). These reviews involved Coinbase protocol experts and over 100 external security researchers, the team noted in a statement.","Several tools for developers are now live on the Base mainnet. These include node providers Blockdaemon, QuickNode, and Blast, the Safe Wallet, block explorers Etherscan and Blockscout, and data indexers The Graph and Covalent, according to the team.","The team clarified that, as previously stated, there are no plans to issue a native token for Base. The official public launch of the Base mainnet is expected in August. The Base team previously <a href=\"https:\/\/www.theblock.co\/post\/233722\/1-million-wallets-use-coinbase-backed-bases-smart-contracts-during-testing\" data-v-f87c67ca=\"\">reported<\/a> its testnet drew interest from over a million wallet addresses deploying on the network.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Base mainnet","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"OP Stack","content":"ORGANIZATION"},{"type":"Blockdaemon","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["COINBASE","OPTIMISM"],"authors":["Vishal Chawla","The Block"]}