{"summary":"The SEC will likely have no choice but to approve spot bitcoin ETFs following Grayscale&#x27;s victory in its case against the SEC, according to JPMorgan.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/248879\/jpmorgan-bitcoin-etf-sec-grayscale?utm_source=rss&utm_medium=rss","publishDate":"2023-09-03T09:46:12","id":14296,"type":null,"title":"JPMorgan says SEC would likely be forced to approve spot bitcoin ETFs following Grayscale&#x27;s win","category":["MARKETS"],"content":["The United States Securities and Exchange Commission (SEC) will likely have no choice but to approve multiple spot bitcoin exchange-traded fund (ETF) applications following Grayscale's victory in its case against the SEC, according to JPMorgan.","Grayscale’s win implies that the SEC would have to retroactively withdraw its previous approval of futures-based bitcoin ETFs in order to defend its denial of Grayscale’s proposal of converting its bitcoin trust into an ETF, but such a move would be “very disruptive and embarrassing for the SEC” and appears unlikely, JPMorgan analysts led by Nikolaos Panigirtzoglou wrote in a note on Friday. Therefore, \"it looks more likely that the SEC would be forced to approve the spot bitcoin ETF applications that are still pending from several asset managers, including that from Grayscale,\" the analysts said.","Earlier this week, <a href=\"https:\/\/www.theblock.co\/post\/246115\/court-hands-grayscale-win-in-long-running-suit-against-sec\" data-v-f87c67ca=\"\">a federal court ruled<\/a><span data-v-f87c67ca=\"\"> that the SEC must review its rejection of Grayscale's attempt to convert the Grayscale <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.18%\n    <\/span><\/a> <!----><\/span><\/span> Trust (GBTC) into an ETF. The court ruled that there was no justification for the SEC to allow bitcoin futures-based ETFs but deny spot bitcoin ETFs because fraud and manipulation in the bitcoin spot market pose a similar risk to both futures and spot products because the spot bitcoin market and the CME bitcoin futures market are so tightly correlated. Therefore, the SEC's rejection of Grayscale’s proposal was \"arbitrary and capricious\" because the agency failed to explain its different treatment of similar products, the court ruled.<\/span>","The SEC said Thursday that it would <a href=\"https:\/\/www.theblock.co\/post\/248595\/sec-moves-to-delay-decisions-on-spot-bitcoin-etfs-from-wisdomtree-invesco-and-valkyrie?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">delay decisions on spot bitcoin ETFs<\/a> proposed by several firms, including BlackRock, Fidelity and Invesco, until at least mid-October. This postponement \"likely points to approval of multiple spot bitcoin ETF applications at once rather than granting a first-mover advantage to any single applicant,\" the JPMorgan analysts said.","\"That could be beneficial for investors as it would allow for more competition in terms of ETF fees. Grayscale will likely face even bigger pressure to lower fees if its trust gets approval to be converted to the largest bitcoin spot ETF in the world,\" the analysts added.","While Grayscale's win brings closer an eventual approval of spot bitcoin ETFs, such an approval is <a href=\"https:\/\/www.theblock.co\/post\/238316\/jpmorgan-bitcoin-etf-approval-comments\" data-v-f87c67ca=\"\">unlikely to prove a game changer<\/a> for the crypto market, the analysts reiterated in Friday's note. In July, the analysts said that spot bitcoin ETFs have existed in Canada and Europe for some time but have failed to gain significant investor interest. Outflows from gold ETFs over the past year or so have also not benefited bitcoin funds overall, including futures ETFs, the analysts reiterated. Moreover, while spot bitcoin ETFs have some advantages over futures bitcoin ETFs, those benefits are \"rather marginal,\" according to the analysts.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"mid-October","content":"DATE"},{"type":"Nikolaos Panigirtzoglou","content":"ORGANIZATION"},{"type":"+0.18%","content":"PERCENT"},{"type":"United States Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Grayscale <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC","content":"ORGANIZATION"},{"type":"Invesco","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["COURT HEARINGS","INVESTMENT FIRMS","LAWSUITS","SEC","TRADFI BANKS"],"authors":["Yogita Khatri","The Block"]}