{"summary":"Former FTX CEO Sam Bankman-Fried explained to NY Magazine how Alameda’s over-leveraging led to the exchange’s sudden collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/191295\/sam-bankman-fried-ftx-demise?utm_source=rss&utm_medium=rss","publishDate":"2022-12-01T07:55:34","id":14301,"type":null,"title":"Sam Bankman-Fried details two factors that led to FTX&#x27;s demise: NY Magazine","category":["COMPANIES"],"content":["Former FTX CEO Sam Bankman-Fried has been doing a <a href=\"https:\/\/www.theblock.co\/post\/191180\/sam-bankman-frieds-bizarre-apology-tour-goes-prime-time\" data-v-f87c67ca=\"\">lot of apologizing<\/a>. From <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1590709186148847622\" data-v-f87c67ca=\"\">saying so<\/a> on Twitter to repeating it during yesterday's keynote <a href=\"https:\/\/www.theblock.co\/post\/191141\/sam-bankman-fried-set-to-speak-at-new-york-times-event-a-live-look\" data-v-f87c67ca=\"\">interview<\/a> at the New York Times' DealBook Summit.","But the one thing that has been largely missing is a key breakdown into exactly how the exchange went from a money-making machine to a broken shell, missing billions of dollars.&nbsp;","In an interview with <a href=\"https:\/\/nymag.com\/intelligencer\/article\/sam-bankman-fried-ftx-interview.html?utm_campaign=nym&amp;utm_medium=s1&amp;utm_source=tw\" data-v-f87c67ca=\"\">New York Magazine<\/a>, Bankman-Fried delved into more detail as to how this took place, while acknowledging a huge lack of oversight, accountants and risk control. He avoided questions on whether customer funds were used to cover losses at sister firm Alameda Research and whether his negligence will lead to prison time — while also denying his actions should be characterized as fraud.","Bankman-Fried pointed to two main causes for FTX’s collapse. First, that an Alameda margin position became way too big and got liquidated. This didn’t involve direct luna exposure but was majorly impacted by that ecosystem's collapse in May.","The second element is that there was a “stub account” that was left over from the days when FTX couldn’t get bank accounts and Alameda’s wallets were used for deposits and withdrawals. This account somehow built up a large debt position in a way that was hidden from view. “The effective position was billions of dollars bigger than it appeared to be,” he told NY Magazine.","Bankman-Fried described the stub account as an “accounting fuckup,” while acknowledging that the exchange should have hired an accountant and had better controls in place. In a separate <a href=\"https:\/\/www.bloomberg.com\/news\/features\/2022-12-02\/inside-sam-bankman-fried-s-bahamian-penthouse-after-ftx-s-collapse?leadSource=uverify%20wall\" data-v-f87c67ca=\"\">interview<\/a> with Bloomberg, he said money sent to this account was credited to both Alameda and FTX — effectively double counting the money.","“It was a large fuckup of risk analysis and risk attention and, you know, it was with an account that was given too much trust, and not enough skepticism,” he told NY Magazine.","Previously on Twitter, Bankman-Fried <a href=\"https:\/\/twitter.com\/SBF_FTX\/status\/1592958068907806722\" data-v-f87c67ca=\"\">said<\/a> that he miscalculated the amount of leverage on FTX as $5 billion, when it was actually $13 billion. It's unclear how much of that was Alameda's position.","Bankman-Fried detailed that Alameda built up this margin position at some point over the last year (which might include time when former Alameda co-CEO Sam Trabucco worked at the company). The trade was a large short position on the U.S. dollar.","During the collapse of luna, this market position increased substantially while the value of its collateral decreased. “That made it [go] from a massively overcollateralized, very safe position, to a moderately overcollateralized, moderately risky position on FTX,” he said.","A few weeks ago, clients started withdrawing from FTX en masse and the value of the FTT token plummeted. Around this time, the position was margin called, Bankman-Fried said, resulting in a hole that couldn’t be filled with its liquid assets on hand.","One big question has been whether FTX's funds were co-mingled with Alameda's funds to backstop its position. The closest Bankman-Fried came to answering this was by stating that FTX is a margin exchange — where funds are borrowed from other users to make trades.","Bankman-Fried noted that as the position got so big, Alameda wasn't going to be able to close it and pay back its creditors. \"That made it go from a somewhat risky position to a position that was way too big to be manageable during a liquidity crisis, and that it would be seriously endangering the ability to deliver customer funds,\" he said.","Reading between the lines here: Since Alameda's position wasn't liquidated in time, it had effectively borrowed a huge amount of funds from other FTX users and lost those funds when its trade blew out.","The question remaining is how FTX’s customers — who weren’t making margin or futures trades — were affected by the margin position. <a href=\"https:\/\/www.wsj.com\/articles\/how-caroline-ellison-found-herself-at-the-center-of-the-ftx-crypto-collapse-11668899604\" data-v-f87c67ca=\"\">According to<\/a> the Wall Street Journal, Alameda CEO Caroline Ellison told employees Alameda used FTX client funds to cover loans that were being recalled. In his interview with the New York Times, Bankman-Fried denied knowingly co-mingling customer funds.","<em data-v-f87c67ca=\"\">Update: This interview has been updated to clarify how the stub account built up its debt, with new information from a report by Bloomberg.<\/em>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Magazine","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"$5 billion","content":"MONEY"},{"type":"Fried","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"NY Magazine","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$13 billion","content":"MONEY"},{"type":"Sam Trabucco","content":"PERSON"}],"hashtag":["FTX"],"authors":["Tim Copeland","The Block"]}