{"summary":"Uniswap Labs has acquired NFT marketplace aggregator Genie as part of its expansion effort to include NFTs and ERC-20 tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/153366\/uniswap-labs-acquires-nft-marketplace-genie?utm_source=rss&utm_medium=rss","publishDate":"2022-06-21T14:54:52","id":14308,"type":null,"title":"Uniswap Labs acquires NFT marketplace aggregator Genie","category":["NFTS"],"content":["<span data-v-f87c67ca=\"\">Uniswap Labs, the main developer of the Uniswap decentralized exchange protocol, said on Tuesday that it has acquired non-fungible token (NFT) marketplace aggregator Genie.<\/span>","<span data-v-f87c67ca=\"\">The move marks part of its expansion effort to include NFTs and ERC-20 tokens among its products, according to a <a href=\"https:\/\/uniswap.org\/blog\/genie\" data-v-f87c67ca=\"\">statement from the company<\/a> on Tuesday.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The integration will include the Uniswap web app, which allows users to trade NFTs across all major marketplaces. The move will happen as soon as this fall, the company <\/span><a href=\"https:\/\/twitter.com\/Uniswap\/status\/1539306956002820096?s=20&amp;t=kge949Z_Zf5r5SOVptDpyg\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">tweeted<\/span><\/a><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Uniswap will also integrate NFTs into its developer APIs and widgets to make the platform “comprehensive … for users and builders in web3.”<\/span>","<span data-v-f87c67ca=\"\">“We see NFTs as another format for value in the growing digital economy — not a separate ecosystem from ERC20 — and they’re already an important gateway to web3,” Uniswap said in the statement.<\/span>","<span data-v-f87c67ca=\"\">The acquisition will not have an impact on Uniswap’s other products, such as the Uniswap Protocol, Uniswap Governance or the UNI token. Genie users can also still access the marketplace website until the new Uniswap NFT experience is available.<\/span>","<span data-v-f87c67ca=\"\">As part of the acquisition, Uniswap will airdrop USDC to Genie users who used the marketplace more than once before April 15 or to those that hold a Genie Genesis NFT.<\/span>","<span data-v-f87c67ca=\"\">Uniswap has previously ventured into the world of NFT. In 2019, the developer launched Unisocks, an NFT liquidity pool that issued tokens representing a pair of limited edition socks, and several NFTs backed by real world assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Uniswap has the largest share of the market in terms of trade volume since last year. The developer saw over <\/span><a href=\"https:\/\/www.theblock.co\/linked\/148465\/dex-protocol-uniswap-hits-1-trillion-cumulative-trading-volume\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$1 trillion<\/span><\/a><span data-v-f87c67ca=\"\"> in crypto traded on the decentralized exchange (DEX) protocol last month.<\/span>","<em data-v-f87c67ca=\"\">Correction: this story has been updated to show that Uniswap's airdrop will go to holders of <span data-v-f87c67ca=\"\">Genie Genesis NFTs.&nbsp;<\/span><\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"fall","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Uniswap Governance","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Uniswap","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"April 15","content":"DATE"},{"type":"Genie Genesis NFT","content":"ORGANIZATION"},{"type":"$1 trillion","content":"MONEY"},{"type":"Uniswap NFT","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kharishar Kahfi","The Block"]}