{"summary":"Much of today&#x27;s three-hour hearing centered on arguments surrounding decisions to be made at future hearings.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/167331\/celsius-latest-bankruptcy-court-hearing-sets-stage-for-future-decisions?utm_source=rss&utm_medium=rss","publishDate":"2022-09-01T20:22:34","id":14302,"type":null,"title":"Celsius&#x27; latest bankruptcy court hearing sets stage for future decisions","category":["LEGAL"],"content":["The latest hearing in lender Celsius' Chapter 11 bankruptcy <a href=\"https:\/\/www.theblock.co\/post\/157491\/crypto-lender-celsius-declares-chapter-11-bankruptcy-in-new-york\" data-v-f87c67ca=\"\">case<\/a> is setting the stage for future key decisions, but little tangible action was accomplished on key issues today.","The hearing came just hours after Celsius' counsel filed a <a href=\"https:\/\/www.theblock.co\/post\/167214\/celsius-seeks-to-reopen-withdrawals-for-certain-customers\" data-v-f87c67ca=\"\">motion<\/a> in the U.S. Bankruptcy Court for the Southern District of New York requesting the authority to open withdrawals for specific custody and withhold accounts. That request won't be settled until an Oct. 6 hearing, but various parties still gave feedback for a significant portion of the three-hour hearing.","The motion indicates that Celsius has discerned that the funds are not part of the estate, meaning they should be released to the custodial account holders. However, there is contention about who qualifies.","It has discerned assets in the Earn and Borrow programs belong to the estate per the terms of service. Celsius says it has not yet completed the necessary analysis to discern if certain custody customers, such as those who transferred funds from the firm's Earn and Borrow programs, qualify. Counsel for Celsius customers is requesting the relief go to all holders of custody accounts.&nbsp;","Celsius called the current, narrowed request \"phase one\" and said it's possible they will seek to release all the funds in the future.&nbsp;","\"While today’s motion, which will be considered at a later hearing, would apply only to a certain group of customers, we are preparing to address matters related to all customers as we move ahead. We continue to pursue all available avenues as quickly as possible,\" Celsius said in a <a href=\"https:\/\/twitter.com\/CelsiusNetwork\/status\/1565435830876905473?s=20&amp;t=pKXf6Igb_wxqPcut6WREaQ\" data-v-f87c67ca=\"\">tweet<\/a> after the hearing.","Judge Martin Glenn also considered whether to redact information about Celsius creditors, but ultimately kicked the decision to the upcoming Sept. 14 hearing. Celsius counsel is seeking to redact all identifiable information from the public docket, but Glenn made it clear he's opposed to the idea of allowing creditors to be fully anonymous.","\"I'm not going to allow anonymous proofs of claim, I can tell you right now,\" he said.","Usually, creditors must be identifiable in order to lodge claims, but Celsius argues disclosing this information could leave its customers vulnerable to cyber threats since this case deals heavily in the crypto sector, where hacks and digital theft are common. Celsius would prefer creditors volunteer this information to be made public in order to prove their claims in court rather than having that information automatically on the public docket, as is usual in the bankruptcy process.","Although Glenn said he'd be amenable to sealing other information, like email and home addresses, at this time he believes the names should be public.","\"While I'm not ruling today, I want to make clear I have the strongest reservations about not requiring the disclosure of the names,\" he said. \"I think addresses, home addresses, email addresses is a completely different matter. I'm very sensitive to that issue, so I want to give the parties who've addressed this issue in their papers to try and see whether they can reach a consensual resolution of it.\"","<strong data-v-f87c67ca=\"\">The remaining agenda<\/strong>","Glenn also approved an interim motion related to cash management, but larger questions surrounding cash management, including the safety and storage of assets, will come to a head on Oct. 6.","Celsius disclosed it will receive another $61 million back from a loan due to a technicality, allowing the funds to be returned in cash rather than stablecoins, as was originally thought. This relieves some pressure on the estate, which previously <a href=\"https:\/\/www.theblock.co\/post\/163687\/celsius-report-shows-2-8-billion-in-crypto-liabilities-dwindling-cash-flow\" data-v-f87c67ca=\"\">reported<\/a> it could run out of cash as soon as October.&nbsp;","Glenn also granted the de minimis asset sale motion, a point of contention at the previous <a href=\"https:\/\/www.theblock.co\/post\/163956\/celsius-approved-to-access-mined-bitcoin-to-meet-operational-expenses\" data-v-f87c67ca=\"\">second-day hearing<\/a>. At the time, the U.S. Trustee argued it was unclear which assets Celsius was looking to sell, calling Glenn's attention to the vagueness of the request. Now, the parties have reached an agreement in which Celsius will consult with other parties before the sale of the assets.&nbsp;","Glenn also approved the sealing of certain parties that have signed non-disclosure agreements in the bidding process and an extension for Celsius to file their schedules and statements.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S. Bankruptcy Court","content":"ORGANIZATION"},{"type":"Martin Glenn","content":"PERSON"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Oct. 6","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Celsius","content":"PERSON"},{"type":"Sept. 14","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Glenn","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$61 million","content":"MONEY"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}