{"summary":"Polkadot co-founder Gavin Wood is stepping down as CEO of Parity Technologies Ltd.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/179019\/gavin-wood-is-stepping-down-as-ceo-of-parity-bloomberg?utm_source=rss&utm_medium=rss","publishDate":"2022-10-21T12:06:21","id":14328,"type":null,"title":"Gavin Wood is stepping down as CEO of Parity","category":["COMPANIES"],"content":["Polkadot co-founder Gavin Wood is stepping down as the CEO of blockchain infrastructure company Parity, Bloomberg first reported.","He will be replaced by fellow Parity co-founder Björn Wagner. Parity is a key development firm behind the Polkadot blockchain ecosystem.","Wood will continue to be Parity's&nbsp;majority shareholder and chief architect.","\"The role of CEO has never been one which I have coveted (and this dates back long before Parity),\" Wood <a href=\"https:\/\/www.parity.io\/blog\/parity-leadership-update\/\" data-v-f87c67ca=\"\">said in a blog post<\/a>. \"Anyone who has worked with me knows where my heart lies. I’m a thinker, coder, designer and architect. Like many such people, I work best asynchronously.\"","The former CEO said that he has spent a large portion of his time in the past two years presiding over the \"outfitting \"of the company's C-suite.","\"I’ll be pointing my regained focus towards exploring how we can contribute to making Polkadot and Web3 more relevant to large swathes of the population,\" he said.","Wood is also one of the co-founders of Ethereum as well as a creator of the Kusama network.","Parity was initially founded as EthCore in late 2015, with Wagner joining the group as a co-founder a year later, Wood said, adding that in the early days their \"roles were quite fluid.\"","Polkadot <a href=\"https:\/\/www.theblock.co\/post\/66361\/polkadot-blockchain-mainnet-live\" data-v-f87c67ca=\"\">went live in 2020<\/a> and allowed its users more control by letting them create their own parachains that can exchange information between them.","Back in June, the blockchain <a href=\"https:\/\/www.theblock.co\/post\/154838\/polkadot-to-scrap-its-council-body-in-new-governance-system\" data-v-f87c67ca=\"\">let go of its council<\/a> and announced a new governance system called Governance version 2 (or Gov2), in a bid to further decentralize the blockchain's decision-making.","<em data-v-f87c67ca=\"\">Note: This piece was updated with additional information from Parity's blog post.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Wagner","content":"PERSON"},{"type":"Kusama","content":"PERSON"},{"type":"June","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"a year later","content":"DATE"},{"type":"Gavin Wood","content":"PERSON"},{"type":"Björn Wagner","content":"PERSON"},{"type":"Wood","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"}],"hashtag":["ETHEREUM"],"authors":["Catarina Moura","The Block"]}