{"summary":"Privacy is a key priority for a Digital Pound, according to FIS CBDC and digital asset strategy head Julia Demidova.\nThe comments echo those of the Bank of England’s strategy head amid an improving environment for crypto in the UK.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237700\/digital-pound-privacy","publishDate":"2023-07-04T08:55:53","id":1433,"type":null,"title":"Privacy a ‘key priority’ for a Digital Pound, says FIS CBDC strategy head","category":["People"],"content":["Privacy will be a big focus for a potential Digital Pound, according to FIS CBDC strategy head Julia Demidova.","“Privacy continues to be a key priority when it comes to a UK central bank digital currency. With a CBDC, central banks and regulators could achieve greater transparency and increase the visibility of transactions while protecting the privacy of individuals,\" Demidova said in an emailed statement to The Block.","“For example, aggregated data can be used by central banks and governments in real time to analyze the health of the economy. Should the Bank of England press ahead with a Digital Pound, proper safeguards will need to be in place to respect end-user privacy,\" she added.","FIS is a global financial services company. It <a href=\"https:\/\/www.businesswire.com\/news\/home\/20190318005222\/en\/FIS-Worldpay-Combine-Accelerate-Future-Finance-Commerce\" data-v-f87c67ca=\"\">acquired<\/a> the payments giant WorldPay for around $43 billion in 2019 — one of the largest-ever acquisitions in the sector.","Demidova acknowledged there will be challenges though. “Launching a CBDC involves extensive testing, with various technical, regulatory and policy-driven aspects taken into consideration,” Demidova added. “Stakeholders across the industry will need to integrate CBDC into their infrastructure, and merchants will need to add CBDC options to their point-of-sale terminals. It’s likely that the launch of a CBDC will require time and, most importantly, it will require careful planning.”","Demidova’s remarks come as the Bank of England’s consultation on a potential Digital Pound — which <a href=\"https:\/\/www.theblock.co\/post\/209304\/uks-bank-of-england-launches-digital-pound-project-as-new-form-of-money\" data-v-f87c67ca=\"\">began<\/a> in February — came to an end on June 30. Demidova’s comments echoed those of the Bank of England's head of strategy and architecture William Lovell last month in a <a href=\"https:\/\/thepaymentsassociation.org\/event\/demystifying-the-digital-pound\/?ck_subscriber_id=2103501492&amp;utm_source=convertkit&amp;utm_medium=email&amp;utm_campaign=Instructions+for+today%27s+webinar%3A+Demystifying+the+Digital+Pound%20-%2011064308\" data-v-f87c67ca=\"\">webinar<\/a> titled “Demystifying the Digital Pound,” presented by the Digital Pound Foundation and The Payments Association. “Neither the government nor the Bank of England will have access to Digital Pound users' personal data,” Lovell <a href=\"https:\/\/www.theblock.co\/post\/236124\/boe-digital-pound\" data-v-f87c67ca=\"\">said<\/a> at the time.","The Digital Pound offers a new way of providing digital money without the same risks faced under the current monetary system, according to Lovell. Under its “platform model,” the central bank wants to run the underlying ledger, leaving banks and technology companies to handle Know Your Customer (KYC) and Anti-Money Laundering (AML) checks while running front-end services connected to the CBDC.&nbsp;","However, the CBDC will not be completely anonymous to prevent financial crimes, would include limits on the amount of funds users can hold digitally and a final decision on its roll-out in combination with the UK Treasury may not be made for two years while it undertakes more development work, Lovell said last month.","Other countries, such as Switzerland, are <a href=\"https:\/\/www.theblock.co\/post\/236470\/not-just-an-experiment-swiss-central-bank-to-carry-out-cbdc-pilot\" data-v-f87c67ca=\"\">developing<\/a> CBDC pilots and the European Commission also recently <a href=\"https:\/\/www.theblock.co\/post\/236925\/european-commission-outlines-vision-for-digital-euro\" data-v-f87c67ca=\"\">outlined<\/a> its vision for a Digital Euro. However, Fadi Aboualfa, head of research at crypto brokerage Copper, <a href=\"https:\/\/www.theblock.co\/post\/237656\/cbdcs-are-not-yet-a-viable-replacement-for-cash-says-head-of-research-at-copper\" data-v-f87c67ca=\"\">remains skeptical<\/a> that the current wave of CBDCs are a viable replacement for cash.","Beyond a potential CBDC, the UK has shown signs of embracing the crypto industry, with the country’s Law Commission recently publishing recommendations to create a distinct category of personal property to protect digital assets, establish a panel of industry experts to provide guidance on technical and legal issues and develop a bespoke legal framework for crypto.&nbsp;","The Law Commission’s recommendations followed <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">plans<\/a> from UK Prime Minister Rishi Sunak to make the country a web3 hub, with venture capital firm a16z <a href=\"https:\/\/www.theblock.co\/post\/234095\/a16z-uk-expansion\" data-v-f87c67ca=\"\">announcing<\/a> in June it would open up a UK office.","Meanwhile, as regulators in the U.S. continue their crypto crackdown, last week Lightspark CEO David Marcus said it was “disheartening and frustrating to see the U.S. fall behind.” That followed similar <a href=\"https:\/\/www.theblock.co\/post\/233315\/coinbase-sec-lawsuit-is-hurting-americas-economic-competitiveness\" data-v-f87c67ca=\"\">remarks<\/a> from Coinbase CEO Brian Armstrong earlier in June, that the U.S. regulatory environment was “hurting America’s economic competitiveness,” referring to the SEC’s <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\">lawsuit<\/a> filed against the crypto exchange on June 6.","&nbsp;"],"hashtag":["BOE","CBDCS","PAYMENTS"]}