{"summary":"Silvergate shares plunged shortly after the open as the beleaguered crypto bank released preliminary results.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/199429\/silvergate-shares-plunge-as-company-cuts-workforce-amid-transformational-shift?utm_source=rss&utm_medium=rss","publishDate":"2023-01-05T09:58:20","id":14336,"type":null,"title":"Silvergate shares plunge as company cuts workforce amid &#x27;transformational shift&#x27;","category":["COMPANIES"],"content":["Shares in crypto-friendly bank Silvergate plunged in early morning trading after the firm released preliminary fourth-quarter results and said it cut 40% of its staff amid a \"crisis of confidence across the ecosystem.\"&nbsp;","Shares were down around 43% by 9:45 a.m. EST, trading at $12.27. They had risen 27% yesterday, trading around $22 at the close. Most of the losses occurred in pre-market trading, shortly after the firm released preliminary fourth quarter financials.&nbsp;","","","The preliminary metrics <a href=\"https:\/\/ir.silvergate.com\/news\/news-details\/2023\/Silvergate-Announces-Select-Preliminary-Fourth-Quarter-2022-Financial-Metrics-and-Provides-Business-Update\/default.aspx\" data-v-f87c67ca=\"\">showed<\/a> that customer deposits fell by 68% in the three months ending Dec. 31, to $3.8 billion from $11.9 billion as a \"transformational shift\" rocked the industry with significant over-leverage leading to several high-profile bankruptcies, including the beleaguered FTX crypto exchange. Average customer deposits also fell, dropping by $4.7 billion during the quarter to $7.3 billion.&nbsp;","“In response to the rapid changes in the digital asset industry during the fourth quarter, we took commensurate steps to ensure that we were maintaining cash liquidity in order to satisfy potential deposit outflows, and we currently maintain a cash position in excess of our digital asset related deposits,” Silvergate CEO Alan Lane said in a <a href=\"https:\/\/ir.silvergate.com\/news\/news-details\/2023\/Silvergate-Announces-Select-Preliminary-Fourth-Quarter-2022-Financial-Metrics-and-Provides-Business-Update\/default.aspx\" data-v-f87c67ca=\"\">statement<\/a>.","The firm sold $5.2 billion of debt securities for cash proceeds during the fourth quarter of 2022 in order to \"accommodate sustained lower deposit levels and to maintain a highly liquid balance sheet.\" As of Dec. 31, Silvergate said it held total cash and equivalents of about $4.6 billion, which is in excess of deposits from digital asset customers.","Silvergate announced layoffs affecting approximately 200 employees or 40% of its current headcount. The bank cited \"economic realities\" that face the industry and the firm, adding the reduced headcount will help the firm manage expenses in a \"more challenging macro environment.\"","\"As Silvergate prepares for what it expects will be a sustained period of transformation, it is taking several actions to help ensure the business is resilient, including recalibrating its expense base and evaluating its product portfolio and customer relationships going forward,\" the company said.&nbsp;","Silvergate said that its mission had not changed and that it continues to believe in the digital asset industry. It's SEN platform continues to operate 24\/7, with average daily volume totaling $1.3 billion in the fourth quarter compared to $1.2 billion in the third quarter.&nbsp;","The company said that all SEN leverage loans continued to perform as expected, with zero losses and no forced liquidations. It will be streamlining its product portfolio over the coming weeks to reduce complexity.","\"Despite significant industry turmoil, Silvergate stands ready to support its digital asset customers,\" the company said.&nbsp;","Silverage said it would take an impairment charge of $196 million in the fourth quarter related to technology assets purchased from the Diem Group.","\"Given the significant changes in the digital asset industry landscape, this charge reflects the Company’s belief that the launch of a blockchain-based payment solution by Silvergate is no longer imminent,\" the bank said.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"$3.8 billion","content":"MONEY"},{"type":"9:45 a.m. EST","content":"TIME"},{"type":"40%","content":"PERCENT"},{"type":"Alan Lane","content":"PERSON"},{"type":"$7.3 billion","content":"MONEY"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"27%","content":"PERCENT"},{"type":"$5.2 billion","content":"MONEY"},{"type":"fourth quarter","content":"DATE"},{"type":"third quarter","content":"DATE"},{"type":"Dec. 31","content":"DATE"},{"type":"$22","content":"MONEY"},{"type":"$1.3 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"43%","content":"PERCENT"},{"type":"$4.7 billion","content":"MONEY"},{"type":"$11.9 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$12.27","content":"MONEY"},{"type":"68%","content":"PERCENT"},{"type":"$4.6 billion","content":"MONEY"},{"type":"$196 million","content":"MONEY"},{"type":"Diem Group","content":"ORGANIZATION"},{"type":"$1.2 billion","content":"MONEY"},{"type":"preliminary fourth quarter","content":"DATE"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}