{"summary":"Silicon Valley-based payments firm PayPal announced it is launching a U.S. dollar stablecoin in conjunction with Paxos.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/243569\/paypal-launches-stablecoin","publishDate":"2023-08-07T09:22:15","id":14342,"type":null,"title":"PayPal launches stablecoin on Ethereum, citing &#x27;shift toward digital currencies&#x27;","category":["CRYPTO ECOSYSTEMS"],"content":["Silicon Valley-based payments firm PayPal announced it is launching a U.S. dollar stablecoin in conjunction with Paxos.","The new digital token will be pegged to the dollar and “gradually” made available to PayPal’s customers in the U.S., the company said in a <a href=\"https:\/\/newsroom.paypal-corp.com\/2023-08-07-PayPal-Launches-U-S-Dollar-Stablecoin\" data-v-f87c67ca=\"\">press release<\/a>.","Paxos will issue the coin labeled PayPal USD, or PYUSD. Issued on the Ethereum blockchain, PYUSD will be “fully backed by U.S. dollar deposits, short-term Treasuries and similar cash equivalents,\" the company also said.","\"The shift toward digital currencies requires a stable instrument that is both digitally native and easily connected to fiat currency like the U.S. dollar,\" PayPal CEO <span class=\"xn-person\" data-v-f87c67ca=\"\">Dan Schulman said in the statement.<\/span> \"Our track record delivering new experiences to our customers, provides the foundation necessary to contribute to the growth of digital payments through PayPal USD.\"&nbsp;","The Block first <a href=\"https:\/\/www.theblock.co\/post\/103617\/paypal-has-held-exploratory-talks-about-launching-a-stablecoin-sources\" data-v-f87c67ca=\"\">reported<\/a> in 2021 that PayPal was exploring the release of a stablecoin. Plans to do so continued but reportedly <a href=\"https:\/\/www.theblock.co\/post\/210710\/paypal-pauses-stablecoin-project-amid-paxos-probe-bloomberg\" data-v-f87c67ca=\"\">faced<\/a> a setback earlier this year.","Eligible PayPal customers will not only be able to make transfers using the stablecoin, they will also be able to make purchases. PayPal will also allow customers to convert \"supported cryptocurrencies\" into or from PYUSD, the company said.","PayPal said that while services and availability of PYUSD begins today the services will be continually \"rolling out in the coming weeks.\"","By issuing the stablecoin on Ethereum, PayPal said its new token should be useful to the larger crypto community. \"As an ERC-20 token issued on the Ethereum blockchain, PayPal USD will be available to an already large and growing community of external developers, wallets and web3 applications,\" it added in its statement.","At least one U.S. lawmaker was quick to voice his support of PayPal's new intiative.","<span data-v-f87c67ca=\"\">“This announcement is a clear signal that stablecoins, if issued under a clear regulatory framework, hold promise as a pillar of our 21st century payments system,” said North Carolina congressman Patrick McHenry, who is also acting chairman of the House Financial Services Committee.<\/span>","McHenry recently <a href=\"https:\/\/www.theblock.co\/post\/241585\/financial-services-chair-pushes-back-on-bank-criticism-of-stablecoin-bill\" data-v-f87c67ca=\"\">pushed back<\/a> after the American Bankers Association criticized stablecoin legislation the congressman had helped draft.","&nbsp;","&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"PayPal USD","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Patrick McHenry","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"North Carolina","content":"LOCATION"},{"type":"Dan Schulman","content":"PERSON"},{"type":"American Bankers Association","content":"ORGANIZATION"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"House Financial Services Committee","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["RT Watson","The Block"]}