{"summary":"The European Parliament’s final vote on the comprehensive Markets in Crypto-Assets (MiCA) regulation has been postponed to April, stalling the implementation process.\nThe Transfer of Funds Regulation will also be postponed to the same voting session.\nThe vote was meant to happen in February.","author":["Inbar Preiss","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/202723\/eus-final-vote-mica-regulation-postponed-april","publishDate":"2023-01-17T05:28:58","id":1434,"type":null,"title":"EU&#x27;s final vote on MiCA regulation postponed until April","category":["Policy"],"content":["<span data-v-f87c67ca=\"\">The European Union’s landmark crypto regulation, Markets in Crypto Assets (MiCA), won’t see a final vote in the European Parliament until April, stalling the process for the new rules to be enforced.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The delay is “technical” and most likely caused by issues in translating the almost 400-page file into the 24 official languages of the bloc, an EU Parliament spokesperson told to The Block.<\/span>","<span data-v-f87c67ca=\"\">The vote in Parliament’s plenary session, which was previously expected to take place by the end of 2022, was <\/span><a href=\"https:\/\/www.theblock.co\/post\/182776\/eus-mica-regulation-vote-deferred-to-february-2023-spokesperson\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">postponed<\/span><\/a><span data-v-f87c67ca=\"\"> to February in November, also due to translation issues.<\/span>","<span data-v-f87c67ca=\"\">MiCA is one of the first EU regimes to supervise the crypto sector and aims to tame what policymakers <\/span><a href=\"https:\/\/www.eppgroup.eu\/newsroom\/news\/europe-to-become-standard-setter-in-global-crypto-market\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">call<\/span><\/a><span data-v-f87c67ca=\"\"> the “wild west of crypto assets.” Most significantly, MiCA lays out rules for licensing firms offering crypto services in the EU and regulates stablecoin issuance.<\/span>","<span data-v-f87c67ca=\"\">With the final vote delayed, the European financial regulators need to wait longer before they can start drafting implementation rules. Bodies like the European Securities and Markets Authority and the European Banking Authority have 12 to 18 months to draft the technical standards on MiCA once it is officially approved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">MiCA is not the only regulation that has been held back. The Transfer of Funds Regulation (TFR), which is meant to be implemented in tandem with MiCA, is also postponed to the same voting session in April. The TFR requires crypto transfers to include know-your-customer information on both the recipient and receiver side.<\/span>","<span data-v-f87c67ca=\"\">Some European countries are pushing for stricter crypto regulation ahead of MiCA spurred by the turbulent year in crypto markets. For instance, French policymakers and central bankers are <\/span><a href=\"https:\/\/www.theblock.co\/post\/199694\/france-central-bank-crypto-licensing\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">calling<\/span><\/a><span data-v-f87c67ca=\"\"> for the implementation of mandatory crypto firm licensing in 2023.<\/span>"],"hashtag":["EUROPEAN PARLIAMENT"]}