{"summary":"Crypto projects are offering points instead of airdrops — to the delight of VCs and the chagrin of everyone else.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/274587\/crypto-projects-40-billion-points?utm_source=twitter&utm_medium=social","publishDate":"2024-01-26T07:01:56","id":14344,"type":null,"title":"Crypto projects have given out 40 billion points so far. When will it end?","category":["CRYPTO ECOSYSTEMS"],"content":["If there’s one thing that’s united members of the crypto community in recent months, it’s the emergence of points.","Only they’re not in favor of them, but dead set against them.","“Points are probably the stupidest detour crypto has taken in my time here. Also borderline scammy,” <a href=\"https:\/\/twitter.com\/lex_node\/status\/1749910381928075379\" data-v-f87c67ca=\"\">said<\/a> Gabriel Shapiro, general counsel at Delphi Labs, on X.","This frustrated sentiment can be seen in the responses to new projects announcing their points programs. “Wow nice some points, how exciting. Imagine doing tokens when you could give points,” sarcastically <a href=\"https:\/\/twitter.com\/0xG00gly\/status\/1749772190730391889\" data-v-f87c67ca=\"\">replied<\/a> one X user on Jan. 23 when crypto wallet Rabby revealed its new program — while others were <a href=\"https:\/\/twitter.com\/gabrielhaines\/status\/1749780108519293245\" data-v-f87c67ca=\"\">even harsher<\/a> in their criticisms.","It’s not hard to see why. Over the last few years, projects have rewarded loyal users and successful airdrop hunters with sudden issuances of tokens, often worth thousands of dollars — and sometimes in the regions of hundreds of thousands of dollars. For some, it can be life-changing money. Unsurprisingly, this phenomenon resulted in an entire ecosystem of airdrop hunters looking to cash in on the next big airdrop.","But points are antithetical to what the airdrop hunter is looking for. With airdrops, those who carried out some trades in the hope of an airdrop and got lucky when it arrived felt like they had beaten the system in some way — that their ingenuity, or sheer luck, had resulted in this unexpected windfall. Yet with points, users are obeying the system and being obedient, hoping that the system will look kindly upon them and reward their loyal actions with tokens some day. There's no edge to be gained and it’s simply just not as fun.","Beyond this, points are more of an IOU that might never be delivered upon, just a number on a screen that harks back to the days of web2. They’re not onchain, they can’t be traded and they might not turn into any tokens. Most crucially, they’re not worth anything — and maybe never will.","<span data-v-f87c67ca=\"\">A visual take on the emergence of points. Image: <a href=\"https:\/\/twitter.com\/boldleonidas\/status\/1750484229165838440\" data-v-f87c67ca=\"\">Bold Leonidas via X<\/a>.<\/span>","Some investors also worry that points don’t have the same staying power as the lure of a potential airdrop. “Founders think \"points\" are smart and easy mode for them, locking the users in indefinitely. But that's not true; in fact, it's the opposite. Users cannot be everywhere at once, and their attention gets diluted,” <a href=\"https:\/\/twitter.com\/long_solitude\" data-v-f87c67ca=\"\">said<\/a> Long Solitude, a pseudonymous investor at VC firm Zee Prime Capital, on X.","KVK, a pseudonymous investor director at VC firm HASH CIB, concurred that users have a short attention span and noted that most point programs lack a clear end date, making it worse.&nbsp;","“In a world where there is a protocol with a new point-based system every day, it is super hard to stay relevant over time,” they said in a <a href=\"https:\/\/1n5734d0fu.substack.com\/p\/make-icos-great-again\" data-v-f87c67ca=\"\">Substack post<\/a> devoted to points. “Attention is one of the critical ingredients for success, and your quasi-infinite points program (from a user’s perspective) does not help you capture it.”","Out of curiosity, The Block tried to see how many points had been issued in total. As the points aren't on a blockchain, we had to download apps, check leaderboards and reach out to projects directly to get answers. In the end, we totaled up some 40.6 billion points across 12 projects — however meaningless that number is.","FriendTech is a clear example showing why users have been disaffected by points. The project was one of the first to implement a clear points system in its app in a bid to reward engagement. Each week it would drop points based on an unspecified allocation system to its users — something that worked brilliantly until it didn’t.","During the project’s first two months, it saw <a href=\"https:\/\/dune.com\/tk-research\/friendtech\" data-v-f87c67ca=\"\">$412 million of trading volume<\/a> as users bought keys that provide access to key influencers’ group chats in the hope of reselling them at high enough valuations to offset the 10% tax on sales. Yet this quickly dwindled. Over the next three and a half months, it saw just a much slower $126 million of trading volume while the number of daily transactions collapsed.","<span data-v-f87c67ca=\"\">The number of daily transactions on FriendTech has significantly reduced. Image: TK research via Dune Analytics.<\/span>","Part of the reason is that in the beginning, traders were optimistic that the points would lead to an imminent airdrop. At the time, a pseudonymous crypto influencer known as Dingaling —&nbsp;who had one of the most expensive channels — said FriendTech would remain successful <a href=\"https:\/\/www.theblock.co\/post\/252072\/friend-tech-users-have-earned-12-million-in-fees-but-is-it-sustainable\" data-v-f87c67ca=\"\">until the token airdrop<\/a>. When the project received investment from Paradigm, this spurred hopes that one was on the way.&nbsp;","Yet one has so far not taken place, and anyone who burned money hoping for a greater allocation has seemingly lost out.","While many retail investors complain about points, the one class of crypto investors that seem to like them is venture capitalists.","One key element is that points are more flexible than token issuance, which can’t be changed on a whim. “While points can't replace product-market fit, they provide the flexibility to test assumptions without the complexities and costs associated with launching tokens,” Dmitriy Berenzon, partner at VC firm Archetype, told The Block.&nbsp;","Multicoin Capital Partner Tushar Jain agreed that points are useful for incentives prior to a token launch. “Launching a token is a lot of work, and it’s much harder to change economics once the token is live,” he said in the firm’s <a href=\"https:\/\/multicoin.capital\/2024\/01\/16\/what-multicoin-is-excited-about-for-2024\/\" data-v-f87c67ca=\"\">outlook for 2024<\/a>.","A partner at VC firm Dragonfly, who goes by GM, said offering points enabled NFT marketplace Blur to fine-tune its incentives between seasons. Blur is currently on its third season of points. They added that Blur leaving some of the points criteria undisclosed helped it to avoid wash trading.&nbsp;","Edvin Memet, a researcher at The Block Pro Research, argued that airdrops with blind criteria tend to encourage more organic use, typically leading to larger allocations. “An airdrop with blind criteria may not attract as many users pre-airdrop, but it stands out as the fairest method for rewarding genuine users. Additionally, it is the most likely system to lead to substantial airdrop allocations, which can create a lot of publicity and attract new users post-airdrop,” he said, pointing to <a href=\"https:\/\/www.theblock.co\/post\/266735\/jito-token-witnesses-1-1-billion-of-trading-volume-in-first-day\" data-v-f87c67ca=\"\">liquid staking project Jito<\/a> as an example.","Memet noted that Manta’s particular point-based system enabled it to attract a higher amount of value locked in its smart contracts than it would have received otherwise. The project also kept hold of the value by auto-staking ether that was bridged to it. He said he anticipates that other Layer 1 and Layer 2 projects will employ similar systems in the future.","Jain also noted that points help to avoid some of the regulatory risks seen with airdropping tokens because they don’t have value. “Points have no units, no max supply, and less regulatory risk because they are not transferable,” he said.","Some VCs are aware, though, that points may not have an infinite staying power.","“I see it as a new narrative, a new thing, an exciting thing in crypto, but whether it is just a temporary fad is yet to be seen,” Kavita Gupta, founder and general partner of Delta Blockchain Fund, told The Block. “We will definitely have everything continue to use point incentive systems, but I think it is more going to be about attracting customers than being able to retain them for a long time because everybody will end up giving some sort of features like this.”","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Delphi Labs","content":"ORGANIZATION"},{"type":"Zee Prime Capital","content":"ORGANIZATION"},{"type":"GM","content":"ORGANIZATION"},{"type":"Delta","content":"ORGANIZATION"},{"type":"Gabriel Shapiro","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Multicoin Capital Partner Tushar Jain","content":"ORGANIZATION"},{"type":"Edvin Memet","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Long Solitude","content":"LOCATION"},{"type":"FriendTech","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$126 million","content":"MONEY"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"Rabby","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"$412 million","content":"MONEY"},{"type":"Dmitriy Berenzon","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Kavita Gupta","content":"PERSON"},{"type":"Jan. 23","content":"DATE"},{"type":"HASH CIB","content":"ORGANIZATION"},{"type":"Paradigm","content":"LOCATION"},{"type":"40.6 billion","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"Manta","content":"LOCATION"},{"type":"The Block Pro Research","content":"ORGANIZATION"}],"hashtag":["CRYPTO","TOKENIZATION"],"authors":["Tim Copeland","The Block"]}