{"summary":"A new bill from Rep. Emmer wants to amend existing securities laws to clarify securities laws for some tokens.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/78897\/lawmakers-want-to-amend-the-securities-act-to-provide-more-clarity-for-crypto-assets","publishDate":"2020-09-25T16:38:50","id":1435,"type":null,"title":"Lawmakers want to amend the Securities Act to provide more clarity for crypto assets -","category":["REGULATION"],"content":["<span data-v-f87c67ca=\"\">Thursday saw the <a href=\"https:\/\/www.theblockcrypto.com\/post\/78723\/cftc-crypto-exchanges-congress-bill\" data-v-f87c67ca=\"\">introduction of a bill<\/a> that aims to create a uniform path to registration for crypto exchanges, but alongside came was a bill that, if approved, would provide some additional clarity for digital assets themselves.<\/span>","<span data-v-f87c67ca=\"\">Representative Tom Emmer (MN-06) introduced the Securities Clarity Act, which would create a new definition for tokens that exist in the in-between of commodity and security.<\/span>","<span data-v-f87c67ca=\"\">Emmer’s legislation creates the new denomination of “investment contract asset” for assets sold as the object of investment contracts. In essence, this would create a clear asset class for tokens that have long toed the line between securities and commodities.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Investment contracts themselves, according to the Securities Act, involve a person investing capital in a common enterprise on the expectation of profits from the efforts of the promoter or third party —&nbsp;so investment contracts are securities. However, any wares that come with the purchase are not necessarily securities under the current laws and legal interpretations, but, as the bill points out, “the two have been unnecessarily conflated in the context of digital assets.”<\/span>","<span data-v-f87c67ca=\"\">Under the <a href=\"https:\/\/emmer.house.gov\/_cache\/files\/d\/e\/de97d89a-a652-42e9-a436-b36fd541933f\/E5FEB0CE89638FF4E5C649E1AC916FC5.emmer-041-xml.pdf\" data-v-f87c67ca=\"\">Securities Clarity Act<\/a>, digital tokens are set apart from their parent contracts, exempting them from further scrutiny as to whether or not they may be part of an unregistered offering based on the characteristics of the asset. Just because an investment contract is a security, an asset obtained from the purchase of the contract doesn’t automatically make the asset a security as well, according to the bill. If the token wasn’t a security to begin with, it’s status wouldn’t change.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The bill would allow companies that have complied with current securities registration requirements, or who have qualified for an exemption, provide for the distribution of their assets to the public without fear of additional regulatory uncertainty,” Emmer’s office said in a <\/span><a href=\"https:\/\/emmer.house.gov\/2020\/9\/emmer-introduces-legislation-to-provide-clarity-for-digital-assets-under-securities-law\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">release<\/span><\/a><span data-v-f87c67ca=\"\">. “These assets are in fact, and always were, commodities.”<\/span>","<span data-v-f87c67ca=\"\">The Securities Clarity Act accomplishes this by amending the Securities Act of 1933 to include the line “The term ‘security’ does not include an investment contract asset.” It would also amend the act to include the definition of “investment contract asset,” which is those that are sold, transferred or intended for such activities pursuant to an investment contract that aren’t otherwise a security under the existing framework. It explicitly names “assets in digital form” in this section.<\/span>","<span data-v-f87c67ca=\"\">It also amends the Investment Advisers Act of 1940 and Investment Company Act of 1940 with similar provisions, detailing that the term “security” does not include an investment contract asset.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While the definition is aimed at clearing up regulatory uncertainty surrounding tokens, the bill is meant to be technology-neutral, according to Emmer. It’s application reaches further than tokens, applying to any asset sold as part of an investment contract.&nbsp;<\/span><span data-v-f87c67ca=\"\">Though just introduced, the approach is already gaining support from crypto policy think tanks.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"This is the smartest approach we have seen to provide clarity about how securities law applies to digital assets,” said Jerry Brito, executive director of Coin Center.<\/span>","<span data-v-f87c67ca=\"\">The bill is meant to be a companion to the Digital Commodity Exchange Act, which was introduced by Representative Mike Conaway (R-TX) on the same day. Each clarifies a different regulatory area for digital assets.<\/span>","<span data-v-f87c67ca=\"\">“Together, these efforts will help clarify outstanding issues related to when and how securities laws and commodities regulations apply to digital assets,” said Kristin Smith, executive director of the Blockchain Association. “Uncertainty over the application of these rules of the road continues to act as a strong headwind for the crypto ecosystem. These bills would do much to clarify the situation and put into law pro-growth policies for the crypto economy.”<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"1940","content":"DATE"},{"type":"Tom Emmer","content":"PERSON"},{"type":"06","content":"DATE"},{"type":"Emmer","content":"PERSON"},{"type":"Mike Conaway","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Kristin Smith","content":"PERSON"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Digital Commodity Exchange","content":"ORGANIZATION"},{"type":"Jerry Brito","content":"PERSON"},{"type":"1933","content":"DATE"}],"hashtag":[],"authors":["Aislinn Keely","The Block"]}