{"summary":"Gemini has acqui-hired decentralized predictions platform Guesser.\nThe aim is to grow the adoption of GUSD stablecoin within DeFi protocols, Gemini’s Marshall Beard told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/114037\/gemini-acqui-hires-defi-platform-guesser-to-grow-adoption-of-its-gusd-stablecoin","publishDate":"2021-08-10T09:00:12","id":1435,"type":null,"title":"Gemini acqui-hires Guesser to grow adoption of its GUSD stablecoin","category":["Mergers &amp; Acquisitions"],"content":["Crypto exchange and custodian Gemini has acqui-hired decentralized predictions platform Guesser, meaning Guesser's team is joining Gemini, but the platform will be shut down.","Sharing the news exclusively with The Block on Tuesday, Gemini said the acqui-hire is aimed at growing the adoption of its Gemini dollar (GUSD) stablecoin and increasing its presence in the decentralized finance (DeFi) ecosystem.","\"We believe DeFi will play a significant role in the future at Gemini,\" Marshall Beard, head of strategy and corporate development at Gemini, told The Block. \"The Guesser team is experienced in DeFi — including the protocols and applications, how it all works and how to engage in the ecosystem. We're excited about the future of DeFi at Gemini with this team on board.\"","Guesser's team comprises four people, including co-founders Jose Garay and Carlos Gonzalez, and all of them are moving to Gemini, said Beard. Garay is joining Gemini's product team as a product manager, and Gonzalez is joining Gemini's wallet engineering team as a software engineer, said Beard.","Their responsibilities include developing relationships with DeFi protocols and submitting GUSD integration proposals, among others, said Beard.","GUSD currently has a negligible presence in DeFi (see chart below). Other stablecoins, including Circle's USDC and Tether's USDT, have a larger share, according to data compiled by The Block Research. Borrowers and lenders within DeFi protocols use stablecoins to earn a yield, and decentralized exchange users often use it for collateral.","","","USDC has a larger share in DeFi because Circle seems to have historically engaged directly with many DeFi projects, according to Tether CTO Paolo Ardoino. \"Recently Tether has been gearing up good communications with different DeFi projects, which will definitely help to improve the overall presence of Tether in the broader DeFi ecosystem in the coming months,\" Ardoino told The Block.","As for GUSD, Beard said DeFi is still in the early stages and that the acqui-hire of Guesser will help grow the usage of the stablecoin. GUSD has a current total supply of over $250 million, while USDC and USDT have a current total supply of over $27 billion and $63 billion, respectively, according to The Block's Data Dashboard.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Gemini did not disclose the terms of the Guesser deal, but the DeFi platform has raised $2.15 million to date.","Guesser is Gemini's fourth acquisition. The company has previously acquired NFT marketplace <a href=\"https:\/\/www.theblockcrypto.com\/linked\/47589\/winklevoss-brothers-acquire-crypto-collectible-startup\" data-v-f87c67ca=\"\">Nifty Gateway<\/a>, crypto credit card startup <a href=\"https:\/\/www.theblockcrypto.com\/post\/91236\/gemini-acquires-blockrize-launching-credit-card-bitcoin-btc-rewards-crypto\" data-v-f87c67ca=\"\">Blockrize<\/a>, and crypto custody technology developer <a href=\"https:\/\/www.theblockcrypto.com\/post\/107733\/gemini-acquires-crypto-custody-startup-shard-x\" data-v-f87c67ca=\"\">ShardX.<\/a>","When asked if Gemini is looking to acquire more crypto firms in the near future, Beard said the company is always exploring unique opportunities and looking to support talent in the crypto space."],"hashtag":["GEMINI"]}