{"summary":"In 2022, a Norwegian judge sided with Magnus Granath about certain word choices against Craig Wright — a decision Wright sought to appeal.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287877\/craig-wright-drops-defamation-appeal-in-norway","publishDate":"2024-04-11T15:26:58","id":14355,"type":null,"title":"Craig Wright drops defamation appeal in Norway","category":["POLICY"],"content":["Australian computer scientist Craig Wright stopped appealing his 2022 loss of a defamation case in Norway, which was related to his claims of being Satoshi Nakamoto, the pseudonymous creator of Bitcoin.","The appeal was against Magnus Granath, a Norwegian citizen who goes by \"Hodlonaut,\" who published harsh words against Wright on Twitter (now X). In 2022, a Norwegian judge sided with Granath about his word choices and other written statements against Wright — a decision Wright sought to appeal.","\"Just got off the phone with my Norwegian lawyer,\" Granath <a href=\"https:\/\/twitter.com\/hodlonaut\/status\/1778457284806353177\" data-v-f87c67ca=\"\">announced<\/a> on social media. \"My win from 2022 is now final and enforceable. This case started May 19th, 2019 and lasted until today. I’m very happy! Now I just need to get the UK case dismissed\/won and I can finally move on.\"","Wright issued a suit against Granath in May 2019 in Norway for libel, or written and defamatory comments aimed at harming someone's reputation.","\"I’m very happy that my win in Norway is now final, and that five years of work has come to a conclusion here,\" Granath told The Block. \"I am waiting to celebrate until the UK case is gone too.\"","The Block reached out to Wright's Norwegian lawyer and will update the story upon response.","Granath, a \"popular and prolific tweeter,\" had publicly doubted Wright's claim to being Nakamoto years, according to UK court <a href=\"https:\/\/www.bailii.org\/cgi-bin\/format.cgi?doc=\/ew\/cases\/EWHC\/QB\/2022\/1181.html&amp;query=(title:(+granath+))\" data-v-f87c67ca=\"\">materials<\/a>.","In May 2019, Granath posted on Twitter that Wright is a \"fraud,\" claimed he enacted \"scams\" and even created the hashtag \"#CraigWrightIsaFraud.\" Wright and his team asked Granath to take down the claims and issue a public apology stating, \"I was wrong to allege Craig Wright fraudulently claimed to be Satoshi. I accept he is Satoshi. I am sorry Dr Wright. I will not repeat this libel.\"","On May 19, 2019, Granath brought a suit hoping to find judgment that his tweets were lawful in the Oslo District Court. <a href=\"https:\/\/www.theblock.co\/post\/241466\/craig-wright-loses-appeal-peter-mccormack-bitcoin-libel-case\" data-v-f87c67ca=\"\">Wright<\/a> issued a counterclaim in Norway stating the tweets were libel. Wright also issued a defamation case against Granath in a UK court in <a href=\"https:\/\/www.bailii.org\/ew\/cases\/EWCA\/Civ\/2021\/28.html\" data-v-f87c67ca=\"\">the summer of 2019,<\/a> which attempted to narrow the recovery of harm damages of Granath's tweets to England and Wales.","Three years later, a Norwegian judge ruled Granath had evidence-based reasons to use \"scam\" and \"fraud\" related to Wright, as well as to doubt whether he is Nakamoto, CoinDesk <a href=\"https:\/\/www.coindesk.com\/policy\/2022\/10\/20\/hodlonaut-wins-norwegian-lawsuit-against-self-styled-satoshi-craig-wright\/\" data-v-f87c67ca=\"\">reported<\/a> at the time. Wright <a href=\"https:\/\/www.ontier.digital\/post\/appeal-filed-in-norway-satoshi-libel-casemagnus-granath-v-dr-wright\" data-v-f87c67ca=\"\">appealed<\/a> the decision a month later.","In March 2024, a UK court <a href=\"https:\/\/www.theblock.co\/post\/282516\/craig-wright-is-not-satoshi-nakamoto-u-k-judge-rules-report\" data-v-f87c67ca=\"\">ruled<\/a> Wright is not Nakamoto and could not issue copyright claims related to the Bitcoin network, The Block previously reported.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Granath","content":"PERSON"},{"type":"Norway","content":"LOCATION"},{"type":"November 2023","content":"DATE"},{"type":"Craig Wright","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nakamoto","content":"LOCATION"},{"type":"summer of 2019","content":"DATE"},{"type":"England","content":"LOCATION"},{"type":"Wales","content":"LOCATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Oslo District Court","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"March 2024","content":"DATE"},{"type":"Magnus Granath","content":"PERSON"},{"type":"\"Hodlonaut","content":"PERSON"},{"type":"May 19, 2019","content":"DATE"},{"type":"May 19th, 2019","content":"DATE"},{"type":"Wright","content":"PERSON"},{"type":"May 2019","content":"DATE"}],"hashtag":["LAWSUITS"],"authors":["MK Manoylov","The Block"]}