{"summary":"Sam Bankman-Fried, who has since resigned as CEO, denied such a &quot;backdoor&quot; existed when asked by Reuters.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186321\/sbf-built-bespoke-backdoor-to-outwit-ftx-compliance-systems-reuters?utm_source=rss&utm_medium=rss","publishDate":"2022-11-12T07:35:13","id":14361,"type":null,"title":"SBF built bespoke &#x27;backdoor&#x27; to outwit FTX compliance systems: Reuters","category":["COMPANIES"],"content":["Sam Bankman-Fried built a \"backdoor\" to his FTX exchange in an effort to change financial records and move funds without alerting others, according to a <a href=\"https:\/\/www.reuters.com\/markets\/currencies\/exclusive-least-1-billion-client-funds-missing-failed-crypto-firm-ftx-sources-2022-11-12\/\" data-v-f87c67ca=\"\">report by Reuters<\/a> citing two people with knowledge of the matter.&nbsp;","He used bespoke software that was designed so that even external auditors would not be notified of changes to FTX books, the report said. It meant that no red flags were raised when $10 billion of funds were moved to FTX's sister trading arm Alameda.&nbsp;","Bankman-Fried, who has since resigned as CEO, denied such a \"backdoor\" existed when asked by Reuters. He also said he \"disagreed with the characterization\" of the $10 billion transfer.&nbsp;","A serious liquidity crisis brought on by revelations about its balance sheet pushed FTX toward insolvency. Binance, which signed a letter of intent that could have led to an acquisition, ultimately passed on the deal, citing due diligence concerns as well as reports of investigations by American regulators.","On Thursday, following a&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/186132\/ftx-collapse-timeline-six-days-that-rocked-the-crypto-industry\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">spectacular week<\/a> of twists and turns, FTX and Alameda filed for Chapter 11 bankruptcy protection, amid a shortfall of as much as $8 billion.","Filings showed that Alameda has more than 100,000 creditors.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"$10 billion","content":"MONEY"},{"type":"$8 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Lucy Harley-McKeown","The Block"]}