{"summary":"Goldman Sachs has downgraded Coinbase from buy to sell on Monday.\nShares in the US crypto exchange were down 5% in pre-market trading on Monday.\nThe investment bank set a price target of $45 for the stock, revised from $70.","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154286\/shares-in-coinbase-down-5-in-pre-market-as-goldman-sachs-downgrades-stock-to-sell","publishDate":"2022-06-27T07:34:07","id":1436,"type":null,"title":"Shares in Coinbase down 5% in pre-market as Goldman Sachs downgrades stock to sell","category":["Markets"],"content":["<span data-v-f87c67ca=\"\">Coinbase (COIN) was downgraded from buy to sell by Investment bank Goldman Sachs on Monday, while shares plunged over 5% in pre-market trading.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Goldman Sachs has downgraded Coinbase after several weeks of turbulence for the crypto exchange, setting a revised price target of $45, down from $70. <\/span>","<span data-v-f87c67ca=\"\">Shares in Coinbase closed at $62.71 on Friday, up roughly 9% over the week. Yet <\/span><span data-v-f87c67ca=\"\">Coinbase was trading at $59.36 in pre-market today, down 5.34%, at the time of writing according to Nasdaq <a href=\"https:\/\/www.tradingview.com\/chart\/?symbol=NASDAQ%3ACOIN\" data-v-f87c67ca=\"\">data<\/a> via TradingView.&nbsp;<\/span>","","","<span data-v-f87c67ca=\"\">According to Monday’s note the bank expects current cryptocurrency prices and trading volumes to cause “further degradation’ in Coinbase’s revenue base. Plus, analysts are forecasting breakeven to negative adjusted earnings before interest, taxes, depreciation and amortization (EBITDA) — a popular measure of a company’s financial performance — over the next few years<\/span><span data-v-f87c67ca=\"\">.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The downgrade comes just four days after<\/span> <a href=\"https:\/\/www.theblock.co\/post\/153919\/coinbase-downgraded-by-moodys-may-be-cut-further\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Moody’s downgraded Coinbase's senior unsecured notes<\/span><\/a>.<span data-v-f87c67ca=\"\"> Moody's<\/span> <a href=\"https:\/\/www.moodys.com\/research\/Moodys-downgrades-Coinbase-senior-debt-Ba2-and-places-ratings-under--PR_467258?WT.mc_id=AM%7eUmV1dGVyc05ld3NfQU1QU19TQl9OUl9DVl9SYXRpbmdfTmV3c19BbGw%3d%7e20220623_PR_467258\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\"> on Thursday that Coinbase’s Corporate Family Rating (CFR) had been downgraded from a Ba2 to a Ba3, and it guaranteed senior unsecured notes to Ba2 from Ba1.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">These announcements came less than two weeks after Coinbase laid off 18%, or approximately 1,100, of its staff. The layoffs were made in preparation for the tougher economic conditions to come and the prospect of a crypto winter.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to analysts at Goldman, however, these cuts don’t go far enough, as the reduction effort merely brings the company’s headcount back to levels last seen at the end of the first quarter in 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In Monday's research note, Goldman Sachs analysts concluded that:<\/span>"],"hashtag":["COINBASE","GOLDMAN SACHS"]}