{"summary":"BlackRock and Fidelity the early leaders among new spot bitcoin ETFs on the first day of trading where volumes surpassed $4 billion.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272066\/spot-bitcoin-etfs-hit-4-billion-in-trading-volume-on-first-day-so-far?utm_source=rss&utm_medium=rss","publishDate":"2024-01-11T15:08:20","id":14376,"type":null,"title":"Spot bitcoin ETFs hit $4 billion in trading volume on first day so far","category":["MARKETS"],"content":["The market for the newly approved spot bitcoin ETF has seen a robust first day of trading, with volumes on Thursday surpassing $4 billion.","The new crypto-based financial instruments from asset managers including Grayscale, BlackRock and Fidelity <a href=\"https:\/\/www.theblock.co\/post\/271901\/spot-bitcoin-etf-approval-process-disaster\" data-v-f87c67ca=\"\">gained approval<\/a> only yesterday from the Securities and Exchange Commission.&nbsp;","With the day of trading not yet over, Grayscale's converted ETF is leading the way with more than $1.9 billion in trading volume as of 3:02&nbsp;p.m. ET, according to data from Yahoo Finance compiled by The Block. BlackRock and Fidelity's ETFs ranked second and third with $942&nbsp;million and $628&nbsp;million in trading, respectively.&nbsp;","Bloomberg's Senior ETF Analyst Eric Balchunas <a href=\"https:\/\/twitter.com\/EricBalchunas\/status\/1745482003309363499\" data-v-f87c67ca=\"\">speculated<\/a> earlier in the day that most of Grayscale's volume is likely \"all selling.\" Trading volumes for BlackRock and Fidelity's funds, however, are probably made up largely by an inflow of fresh capital as the instruments are completely new.","Unlike the other 10 active ETFs, Grayscale's spot bitcoin ETF is a conversion of its flagship GBTC fund. The lowest performing ETFs so far on Thursday are those offered by Valkyrie, WisdomTree and Hashdex, which had all racked up less than $10 million in volume during the first hours of trading.","Bitcoin's price, meanwhile, saw modest gains after rising more heavily earlier in the day. The world's largest cryptocurrency by market capitalization was trading for $46,851 at 3:05 p.m. ET, up 1.3% over the past 24 hours.&nbsp;&nbsp;","In what <a href=\"https:\/\/www.theblock.co\/post\/271778\/coinbase-calls-spot-bitcoin-etf-approval-watershed-moment\" data-v-f87c67ca=\"\">has been proclaimed<\/a> a \"watershed moment\" for many crypto organizations and enthusiasts, the SEC approved the 11 spot bitcoin ETFs yesterday. All eyes have been on how well the funds would perform in the first 24 to 48 hours of trading. <span data-v-03de5780=\"\" data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">Standard Chartered Bank recently said t<\/span>he new spot bitcoin ETFs&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/270976\/spot-bitcoin-etf-inflows-standard-chartered-bank\" data-v-03de5780=\"\" data-v-f87c67ca=\"\">could bring in<\/a>&nbsp;as much as<span data-v-03de5780=\"\" data-preserver-spaces=\"true\" data-v-f87c67ca=\"\"> $50 billion to $100 billion in 2024.<\/span>","\"Financial advisors must now have an opinion on this asset-class. They might still not recommend it to their clients, but the fact it’s now available through a regulated product means they now need a view,\" CF Benchmarks CEO Sui Chung said by email. \"This could open the door to a much more steady flow of interest in the asset-class.\"","Vanguard, meanwhile, said on Thursday that not it <a href=\"https:\/\/www.theblock.co\/post\/272049\/vanguard-wont-offer-spot-bitcoin-etfs-says-high-volatility-is-bad-for-generating-long-term-returns\" data-v-f87c67ca=\"\">would not allow<\/a> its clients to buy the ETFs, as the institution said the \"highly speculative\" and \"unregulated\" instruments&nbsp; don't fit with the company's long-term investing philosophy.","Some users on X posted how <a href=\"https:\/\/twitter.com\/technologypoet\/status\/1745504687376204249\" data-v-f87c67ca=\"\">they had decided<\/a> to move their investment accounts from Vanguard to Fidelity as a result.","\"Establishment folks underestimate the extent of Bitcoin and crypto ownership in the US, and keep on committing blunders like this,\" Ava Labs <a href=\"https:\/\/twitter.com\/el33th4xor\/status\/1745524264764047522\" data-v-f87c67ca=\"\">founder<\/a> and CEO wrote in a post on X. \"This new asset class is here to stay.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Sui Chung","content":"PERSON"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Yahoo Finance","content":"ORGANIZATION"},{"type":"Valkyrie","content":"ORGANIZATION"},{"type":"$50 billion","content":"MONEY"},{"type":"$942&nbsp;million","content":"MONEY"},{"type":"$1.9 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Eric Balchunas","content":"PERSON"},{"type":"$46,851","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"3:02&nbsp;p.m. ET","content":"TIME"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"3:05 p.m. ET","content":"TIME"},{"type":"1.3%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"$100 billion","content":"MONEY"},{"type":"$628&nbsp;million","content":"MONEY"},{"type":"Vanguard","content":"ORGANIZATION"}],"hashtag":["SPOT BITCOIN ETF"],"authors":["RT Watson","The Block"]}