{"summary":"Telecoms giant Verizon appears to be moving into the blockchain space, according to its latest job search\nThe firm has posted five job openings for “blockchain developers,” and various others which list “blockchain knowledge” as a requirement\nThe job descriptions hint that the firm could be looking to build a customer-facing product geared towards privacy, security, and payments","author":["Isabel Woodford","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/33279\/verizon-eyes-new-blockchain-project-looking-to-recruit-engineers-for-a-distributed-network","publishDate":"2019-07-24T15:52:52","id":1437,"type":null,"title":"Verizon eyes new blockchain project, looking to recruit engineers for a ‘distributed network’","category":["Layer 1s"],"content":["Verizon, the Telecom giant, is looking to build a blockchain team, according to the <a href=\"https:\/\/www.verizon.com\/about\/work\/search\/jobs?q=Blockchain&amp;per_page=100&amp;sort_by=cfml10%2Cdesc\" data-v-f87c67ca=\"\">company’s job site.<\/a>","The firm is advertising for five blockchain engineers, as well as a \"blockchain technology development\" lead. In addition, a keyword search of 'blockchain' shows 35 job-openings where blockchain knowledge is required.","Details about the new roles suggest that Verizon to seeking to build a customer-facing product geared towards privacy, security, and payments.","\"This role will be responsible for developing and delivering of initial prototypes and product proof-of-concepts which includes use case development, technical requirements, customer co-development testing and commercialization handoff. The focus of the individual will be on blockchain and other identity\/security initiatives (e.g. confidential computing, secure payments) in the emerging technology space,\" read <a href=\"https:\/\/www.linkedin.com\/jobs\/view\/1353854043\" data-v-f87c67ca=\"\">one advert.<\/a>","&nbsp;","","","<a href=\"https:\/\/www.verizon.com\/about\/work\/jobs\/4243029-technology-development-blockchain?hl=Blockchain\" data-v-f87c67ca=\"\">The job descriptions<\/a> also state that the company is looking to build a “distributed network\", with \"various use cases.\"","Verizon is not the only player in the telecom space edging into the blockchain space. Earlier this year,<a href=\"https:\/\/www.theblockcrypto.com\/tiny\/mobile-carrier-att-will-now-accept-payments-in-crypto\/\" data-v-f87c67ca=\"\"> AT&amp;T<\/a> announced that it was accepting bitcoins for its cable bill payments via BitPay, although as of yet, no internal blockchain-focused roles have been advertised.","Still, Verizon may take some time to fill the new roles, according to a leading engineer in the space&nbsp;","\"Google, Facebook, Microsoft, those guys are just taking the cream of the crop,\" he told The Block. \"I have interviewed over 100 candidates in the last couple of years and it's getting harder to find good calibre candidates in blockchain.\"","A representative for Verizon did not respond to an inquiry prior to publication.","<em data-v-f87c67ca=\"\">Celia Wan contributed to this piece<\/em>"],"hashtag":[]}