{"summary":"Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario and Stephen Palley. They are not legal advice. These are our","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/18664\/miners-cheap-electricity-in-washington-state-no-more","publishDate":"2019-04-07T11:55:38","id":1437,"type":null,"title":"Miners shocked by electricity price surge in Washington State","category":["LEGAL"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]Blocktree Props., LLC v. Pub. Utility Dist. №2 of Grant Cty. Wash., 2019 U.S. Dist. LEXIS 54423 (E.D. Wash. 2019) [SDP]<\/strong><\/em>","Cryptocurrency litigation really runs the gamut. This particular opinion takes us deep into the really exciting world of electricity rate setting. OK, maybe electricity rates aren’t that exciting … unless you are cryptocurrency miner, like the plaintiffs are in this case, and that case rates are the difference between big bucks and big losses.","The Plaintiffs here are a group of tech firms mostly focused on crypto mining. They asked a federal judge in Washington State to enjoin the Grant County Public Utility District (“PUD”) from implementing a new rate class which would substantially increase electricity rates charged to “evolving industries,” which would include crypto miners. The Court declined to grant the injunction because it found that the rate wasn’t discriminatory, arbitrary, or made without due process, and it didn't violate the miners’ constitutional rights.","The Court begins its analysis by explaining blockchain tech and mining in general. It points out that one of a miner’s biggest expenses (the biggest?) is electricity, so miners locate themselves places with cheap electricity, like Washington State, apparently, with its cheap hydroelectric power.","This particular PUD is a Washington State municipal corporation and claims to have the cheapest electricity in the country. It sets rates based on operations and power consumption, and different industries are grouped together. To deal with the significant interest from mining industry, it created an “evolving industry” rate class for miners.","Suffice it to say that the local mining industry didn’t like this new rate class because they said it would increase their rates between 295% to 400%, effective April 1, which I am sure was just a coincidence.","Utility rates in Washington State are presumed reasonable, the Court says, “and courts will only overturn the rates if they are excessive and disproportionate to the services rendered or arbitrary and capricious.” The Court rejected Plaintiff’s challenge, noting in particular that it “fails to recognize\" one of the main aspects of the District’s justification for classifying cryptocurrency mining as an evolving industry: the sudden influx of interest from cryptocurrency mining companies in the District’s area of service. According to the District, since the summer of 2017, it has received \"125 requests for service totaling 2,000 MW of new load, 75% of the new load being from cryptocurrency mining operations.”","Plaintiffs raise a couple of other arguments — including alleged violation of federal and state due process rights — and the Court shoots these down as well in the opinion. Now this is not a final order and it can certainly be vacated, appealed or modified at some point, but for now it shows that one of the real business risks associated with mining is long-term assurance of electricity pricing. Bitcoin and other proof-of-work cryptocurrencies are in one way of thinking a form of electricity arbitrage. If pricing can go up by 400 percent because some PUD says so, that’s a significant risk to consider at the outset. And as this opinion shows — at least in the U.S. — rate challenges are not a straight over tackle proposition.","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part II of this week's analysis, Crypto Caselaw Minute, is above.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 1","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Grant County Public Utility District (“PUD","content":"ORGANIZATION"},{"type":"Washington State","content":"ORGANIZATION"},{"type":"LLC","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"U.S. Dist","content":"ORGANIZATION"},{"type":"Wash.","content":"LOCATION"},{"type":"400%","content":"PERCENT"},{"type":"Grant Cty","content":"LOCATION"},{"type":"295%","content":"PERCENT"},{"type":"400 percent","content":"PERCENT"},{"type":"SDP","content":"ORGANIZATION"},{"type":"summer of 2017","content":"DATE"},{"type":"Palley","content":"PERSON"},{"type":"Washington State","content":"LOCATION"},{"type":"Stephen Palley","content":"PERSON"},{"type":"Rosario","content":"PERSON"},{"type":"E.D. Wash.","content":"ORGANIZATION"}],"hashtag":[],"authors":["Stephen D. Palley","The Block"]}