{"summary":"Departing a16z VC Katie Haun to raise nearly $1 billion for new crypto venture fund. Hauns new crypto venture funding to raise nearly 1 billion","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/129651\/hauns-new-venture-fund-lining-up-investors-to-raise-approximate-900-million","publishDate":"2022-01-07T19:27:07","id":1438,"type":null,"title":"Haun&#x27;s new venture fund lining up investors to raise nearly $900 million","category":["VENTURE CAPITAL"],"content":["<span data-v-f87c67ca=\"\">Prosecutor turned crypto venture capitalist Katie Haun is looking to raise nearly $900 million for a new venture firm.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Haun, who joined a16z as a partner for its crypto investing unit in 2018, left the firm at the end of last year, as <a href=\"https:\/\/www.axios.com\/crypto-investor-katie-haun-leave-andreessen-horowitz-e11aa2f2-6ad9-4b27-abb4-b44e461174ec.html\" data-v-f87c67ca=\"\">reported by Axios<\/a> at the time. Now, Haun’s new firm —dubbed KRH— is in the process of raising the money across different venture funds, according to sources familiar with the investment firm’s plans.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Haun has secured a16z as a limited partner for the new fund, according to sources. And the two firms are expected to have an informal relationship and collaborate together, a source said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The <a href=\"https:\/\/www.ft.com\/content\/e08066ee-8dfc-4899-afc4-3885d85fa348\" data-v-f87c67ca=\"\">Financial Times<\/a> first reported details of the firm’s fundraising efforts.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As per the Financial Times, the two funds will include a $300 million fund that will make early-stage investments in cryptocurrency startups and another $600 million fund will focus on investments in larger companies and digital tokens.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Haun’s new fund joins an increasingly crowded market of venture capitalists seeking crypto riches. Paradigm and a16z are among the firms that last year announced multi-billion dollar venture funds. Elsewhere, traditional venture capitalists such as Sequoia and Point72 Ventures are keen to increase their presence in the crypto venture market.&nbsp;&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Haun joined Andreessen Horowitz in 2018 as the firm’s first female general partner, where she co-chaired the firm’s three crypto funds and co-led a $2.2 billion fund focused on crypto. Haun currently sits on the board for OpenSea and Coinbase, according to her LinkedIn.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Earlier this week, Haun’s new fund made an investment in OpenSea’s $300 million Series C funding round. While at a16z, she previously led the NFT platform's Series A and B rounds.<\/span>","<span data-v-f87c67ca=\"\">Haun will be joined by several other a16z colleagues, including Rachael Horwitz, who was a16z’s crypto head of marketing and communications, Nick Pacilio, the firm's former head of crypto media relations, Tomicah Tillemann, a16z's former global head of policy and partner focused on web3, and James Rathmell, who had been crypto counsel at the firm.&nbsp; <\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$900 million","content":"MONEY"},{"type":"James Rathmell","content":"PERSON"},{"type":"Haun","content":"PERSON"},{"type":"Katie Haun","content":"PERSON"},{"type":"$2.2 billion","content":"MONEY"},{"type":"Nick Pacilio","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tomicah Tillemann","content":"PERSON"},{"type":"$600 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Rachael Horwitz","content":"PERSON"},{"type":"last year","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Sequoia","content":"LOCATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"$300 million","content":"MONEY"},{"type":"Financial Times","content":"ORGANIZATION"}],"hashtag":["KATIE HAUN"],"authors":["Anushree Dave","Frank Chaparro","The Block"]}