{"summary":"Genesis Trading revealed late Thursday that its derivatives business has exposure to FTX amid the crypto exchange&#x27;s ongoing collapse.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/185665\/genesis-trading-says-derivatives-arm-has-175-million-locked-up-in-ftx-account","publishDate":"2022-11-10T18:14:10","id":14383,"type":null,"title":"Genesis Trading says derivatives arm has $175 million locked up in FTX account","category":["FINANCE FIRMS"],"content":["Genesis Trading revealed late Thursday that its derivatives business has exposure to FTX amid the crypto exchange's ongoing collapse.","\"As part of our goal in providing transparency around this week’s market events, the Genesis derivatives business currently has ~$175M in locked funds in our FTX trading account. This does not impact our market-making activities,\" Genesis wrote, adding:","\"Furthermore, our operating capital and net positions in FTX are not material to our business. Circumstances surrounding FTX have not impeded the full functioning of our trading franchise.\"","The firm, a subsidiary of Digital Currency Group, said, \"to reemphasize, Genesis has no ongoing lending relationship with FTX or Alameda.\"","Genesis was among a number of companies on Tuesday that sought to distance themselves from the FTX crisis. At the time, the firm said, \"With regard to today’s market events, we have managed our lending book and have no material net credit exposure. In addition, Genesis has no exposure to any tokens issued by centralized exchanges.\"","The developments come as the situation around FTX grows more dire, with reports saying regulators in the Bahamas are moving to freeze its assets and are seeking the court appointment of a liquidator. Regulators in the U.S. are also said to be probing FTX and its broader business empire.","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"$175M","content":"MONEY"},{"type":"Bahamas","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Michael McSweeney","The Block"]}