{"summary":"The CFTC sued Binance and its CEO on Monday over the exchange&#x27;s lack of registration in the U.S. despite allegedly allowing U.S. customers to open accounts.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/223015\/cftc-sues-binance#:~:text=Since%202017,%20Binance%20has%20%E2%80%9Ctaken,illegal%20activity%20since%20the%20site","publishDate":"2023-03-27T11:49:12","id":14388,"type":null,"title":"CFTC sues Binance and its CEO &#x27;CZ&#x27; for allegedly violating US laws","category":["POLICY"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">Binance and its CEO Changpeng \"CZ\" Zhao are being sued by the Commodity Futures Trading Commission for allegedly violating federal laws and not registering the exchange in the U.S.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp; <\/span>&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The agency filed a <a href=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/03\/Cm_ECF-NextGen-Live-1.6.3-U.S.-District-Court-Northern-Illinois-Cm_ECF-NextGen-Live-1.6.3-U.S.-District-Court-Northern-Illinois.pdf\" data-v-f87c67ca=\"\">complaint<\/a> against <a href=\"https:\/\/www.theblock.co\/post\/211453\/serious-about-your-crypto-project-binances-ceo-says-you-should-move\" data-v-f87c67ca=\"\">Binance<\/a>, the world’s largest crypto exchange, on Monday in a Chicago federal court.&nbsp; Bloomberg News first reported the suit.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Since 2017, Binance has “taken a calculated, phased approach to increase its United States presence despite publicly stating its purported intent to ‘block’ or ‘restrict’ customers located in the United States from accessing its platform,” the agency argued in the 74-page complaint, an illegal activity since the site has not registered to do business in the U.S. The complaint adds that Binance, Zhao and former Chief Compliance Officer Samuel Lim \"have all chosen to ignore those requirements and undermined Binance’s ineffective compliance program by taking steps to help customers evade Binance’s access controls,” the agency said.&nbsp;<\/span>","Binance \"earned $63 million in fees from derivatives transactions and approximately 16% of its accounts were held by customers Binance identified as being located in the United States,\" in August of 2020, the CFTC says, citing Binance documents obtained by the agency. \"By May 2021, Binance’s monthly revenue earned from derivatives transactions increased to $1.14 billion. Binance’s decision to prioritize commercial success over compliance with U.S. law has been, as Lim paraphrased Zhao’s position on the matter, a 'biz decision.'\"","Employees for the firm also told U.S. customers how to access the site through virtual private networks, despite the ostensible block on U.S. access due to the lack of registration, the CFTC alleges.&nbsp;<span class=\"s1\" data-v-f87c67ca=\"\">This was despite Binance, Zhao and other executives knowing that soliciting customers in the U.S. without register to business in the country, as required under U.S. law, the CFTC said.&nbsp;<\/span>","In addition to offering illicit trades in the U.S., the allegedly lax approach to compliance may have led to more serious implications, like possible transactions by U.S. and EU-designated terrorist organizations on the platform, according to internal communications reviewed by the CFTC.&nbsp;","\"Internally, Binance officers, employees, and agents have acknowledged that the Binance platform has facilitated potentially illegal activities,\" the complaint reads. \"For example, in February 2019, after receiving information 'regarding HAMAS transactions' on Binance, Lim explained to a colleague that terrorists usually send 'small sums' as “large sums constitute money laundering.' Lim’s colleague replied: 'can barely buy an AK47 with 600 bucks.' And with regard to certain Binance customers, including customers from Russia, Lim acknowledged in a February 2020 chat: 'Like come on. They are here for crime.' Binance’s money laundering reporting officer agreed that 'we see the bad, but we close 2 eyes.'\"","In response to the news Zhao tweeted simply \"<a href=\"https:\/\/twitter.com\/cz_binance\/status\/1640372505046052866?s=20\" data-v-f87c67ca=\"\">4<\/a>\", his <a href=\"https:\/\/twitter.com\/cz_binance\/status\/1610018096122851328?s=20\" data-v-f87c67ca=\"\">code<\/a> for reporting or \"attacks\" he does not agree with.&nbsp;","\"The complaint filed by the CFTC is unexpected and disappointing as we have been working collaboratively with the CFTC for more than two years,\" a Binance spokesperson said in a statement provided to The Block. \"We have made significant investments over the past two years to ensure we do not have US users active on our platform, including increasing compliance personnel from \"approximately 100\" to \"around 750 core and supporting compliance personnel today,\" the spokesperson said.&nbsp;","The Securities and Exchange Commission, which sometimes makes concurrent enforcement filings with the CFTC, declined to comment as to whether their own enforcement action could be pending. An SEC lawyer recently told a federal judge in ongoing proceedings over the company's possible acquisition of crypto investment firm Voyager that that it is SEC staff opinion that Binance has operated an unregistered securities exchange in the U.S.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The price of bitcoin immediately declined on the news, trading down 4% to $26,8871 at 10:39 a.m. EDT, but soon partially recovered to over $27,000 per coin.&nbsp;<\/span>","The complaint lists Binance's regional affiliates, including the operating company for Binance.US, BAM Trading, as \"other relevant entities\" and notes that BAM \"has never been registered with the Commission in any capacity\" to trade commodities in the U.S. The complaint also casts doubt on the separation of Binance and Binance.US, citing Zhao's control of both and that \"Binance personnel, including Zhao, have dictated Binance.US’s corporate strategy, launch, and early operations. At Zhao’s direction, Binance.US’s marketing and branding has mirrored that of Binance.com.\"&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The complaint comes a month and a half after crypto service provider Paxos <a href=\"https:\/\/www.theblock.co\/post\/210919\/sec-to-sue-paxos-for-listing-binance-usd-stablecoin-wsj\" data-v-f87c67ca=\"\">received notice<\/a> of an investigation into its joint stablecoin offering with Binance and voluntarily ended its minting of the dollar-pegged token.<\/span>","The CFTC alleges that Binance tried to hide how ineffective its compliance program was from its business partners, including Paxos. The company went through a compliance audit to “satisfy a request from Paxos,” the agency said. “But according to Lim, Binance purposely engaged a compliance auditor that would ‘just do a half assed individual sub audit on geo[fencing]” to ‘buy us more time,’\" the complaint reads.","<strong data-v-f87c67ca=\"\">UPDATE<\/strong>:&nbsp;<em data-v-f87c67ca=\"\">With additional details from the complaint and comment or requests for comment.&nbsp;&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"Paxos","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"EU","content":"ORGANIZATION"},{"type":"August of 2020","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"$26,8871","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Samuel Lim","content":"PERSON"},{"type":"February 2020","content":"DATE"},{"type":"Russia","content":"LOCATION"},{"type":"Chicago","content":"LOCATION"},{"type":"U.S","content":"LOCATION"},{"type":"Binance","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"May 2021","content":"DATE"},{"type":"Commission","content":"ORGANIZATION"},{"type":"$63 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"February 2019","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"10:39 a.m. EDT","content":"TIME"},{"type":"$1.14 billion","content":"MONEY"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"16%","content":"PERCENT"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"HAMAS","content":"ORGANIZATION"},{"type":"BAM Trading","content":"ORGANIZATION"},{"type":"Bloomberg News","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"},{"type":"$27,000","content":"MONEY"}],"hashtag":["BINANCE","CFTC"],"authors":["Sarah Wynn","The Block"]}