{"summary":"Decentralized exchange aggregator 1inch has revealed a hardware wallet that aims to provide a secure option for crypto users to hold their assets.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/203765\/1inch-hardware-wallet","publishDate":"2023-01-19T09:00:18","id":1439,"type":null,"title":"1inch Network enters the hardware wallet business","category":["SECURITY"],"content":["<span data-v-f87c67ca=\"\">Decentralized exchange aggregator 1inch Network has developed a hardware wallet that aims to provide a secure device for crypto users to hold their assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The hardware wallet will be a physical device that claims to offer a secure way to store users' private keys offline. It comes alongside 1inch's existing web-based wallet.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">1inch's hardware wallet is undergoing its final stages of development and testing before being released for sale later this year, 1inch said in a statement shared with The Block. &nbsp;<\/span><span data-v-f87c67ca=\"\">Once launched, it will compete with larger players in the hardware wallet niche, such as&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/140598\/ledger-launches-crypto-hardware-wallet-with-enhanced-nft-support\" data-v-f87c67ca=\"\">Ledger<\/a> and Trezor.<\/span>","<span data-v-f87c67ca=\"\">The move shows the project's efforts to diversify its business. The 1inch team noted: “As the 1inch Network is eager to expand its ecosystem of products and projects, here comes the 1inch hardware wallet, a cutting-edge solution for cold crypto storage.\"<\/span>","<span data-v-f87c67ca=\"\">The 1inch Foundation-supported hardware wallet will have a 2.7-inch touch display. The wallet will be a wireless device, will run on a rechargeable battery, and users can sign transactions wireless using QR codes or NFC technology.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">1inch is the largest decentralized exchange aggregator by daily volume. The project lets traders access liquidity from multiple decentralized exchanges to swap tokens from within a single platform. It processed over <a href=\"https:\/\/dune.com\/k06a\/1inch\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">$1.8 billion<\/a> in trading volume within the past week alone.<\/span>","<span data-v-f87c67ca=\"\">Hardware wallets are becoming increasingly popular to store cryptocurrency assets securely. <\/span>","<span data-v-f87c67ca=\"\">While web-based wallets provide convenience, they come with the risk of getting hacked.&nbsp;<\/span><span data-v-f87c67ca=\"\">Hardware devices, which secure private keys inside hardware to guard users against hacks, can offer what some perceive to be better security than web-based private wallets, including <a href=\"https:\/\/www.theblock.co\/post\/142304\/metamask-advises-users-to-disable-automatic-icloud-backups-of-its-wallet-data-to-prevent-hacks\" data-v-f87c67ca=\"\">MetaMask<\/a> and TrustWallet. They do this by generating and storing private keys offline.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"NFC","content":"ORGANIZATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"1inch Foundation","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"past week","content":"DATE"}],"hashtag":["HARDWARE","WALLETS"],"authors":["Vishal Chawla","The Block"]}