{"summary":"Polygon has planned to launch its new Layer 2 scaling solution, zkEVM, on mainnet beta on Mar. 27.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/211517\/polygon-eyes-mainnet-beta-release-for-zkevm-layer-2-next-month?utm_source=rss&utm_medium=rss","publishDate":"2023-02-14T11:00:12","id":14397,"type":null,"title":"Polygon eyes mainnet beta release for zkEVM Layer 2 next month","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">Polygon is planning to release a new Layer 2 scaling solution, zkEVM, in a mainnet phase on Mar. 27.<\/span>","<span data-v-f87c67ca=\"\">zkEVM will be a zero-knowledge or ZK-Rollup that performs off-chain computations on a secondary layer for faster and cheaper transactions while prioritizing security. The aim is to expand the Ethereum network's scaling capabilities further.<\/span>","<span data-v-f87c67ca=\"\">Polygon claims its <a href=\"https:\/\/www.theblock.co\/post\/197324\/polygons-zkevm-launched-its-second-testnet-the-last-step-before-mainnet-goes-live\" data-v-f87c67ca=\"\">zkEVM<\/a> will be equivalent to Ethereum's Virtual Machine, which means that the network is expected to support the same code as Ethereum. Due to this factor, developers will be able to onboard apps from Ethereum and use them on Polygon's zkEVM network without making significant changes.<\/span>","\"Polygon zkEVM is the gold standard for EVM-equivalence, having passed 100% of the Ethereum test vectors that apply to a zkEVM. Developers can copy-paste code that works on Ethereum and use it to build on Polygon zkEVM,\" the team said in a statement shared with The Block.","<span data-v-f87c67ca=\"\">Although Layer 2 solutions like Arbitrum and <a href=\"https:\/\/www.theblock.co\/post\/205799\/on-chain-activity-on-optimism-drops-after-end-of-nft-incentive-program?utm_source=rss&amp;utm_medium=rss\" data-v-f87c67ca=\"\">Optimism<\/a>, which are Optimistic Rollup-based solutions, have seen growth, zero-knowledge Layer 2 solutions currently lack Ethereum compatibility.<\/span>","<span data-v-f87c67ca=\"\">zkEVM has been in development for over a year and has gone through two third-party security audits.&nbsp;<\/span><span data-v-f87c67ca=\"\">Over the past year, Polygon zkEVM, Starknet, zkSync, and Scroll have fiercely competed to develop a functioning ZK-based Layer 2 that can support Ethereum apps. None of these have yet released a product for public use. But this could change with the launch of Polygon's zkEVM even though there could be last minute development challenges. <\/span><span data-v-f87c67ca=\"\">In October, Polygon's competitor zkSync <a href=\"https:\/\/www.theblock.co\/post\/180846\/matter-labs-releases-first-phase-of-zksync-2-0-mainnet-called-baby-alpha\" data-v-f87c67ca=\"\">released<\/a> a zkEVM solution but for restricted internal use only.&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"100%","content":"PERCENT"},{"type":"Mar. 27","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Ethereum's Virtual Machine","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["POLYGON"],"authors":["Vishal Chawla","The Block"]}