{"summary":"The principal developer of the decentralized derivatives exchange dYdX has publicly released the open-source code for its upcoming version 4.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/258906\/dydx-trading-ships-code-for-version-4-of-its-cosmos-based-dex?utm_source=rss&utm_medium=rss","publishDate":"2023-10-24T08:37:03","id":14404,"type":null,"title":"DYdX Trading ships open-source code for version 4 of its Cosmos-based DEX","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\">DYdX Trading, the principal developer of the decentralized derivatives exchange <span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">dYdX <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248448\/dydx-dydx-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/hjnIm9bV.jpg\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">DYDX<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_negative\" data-v-baf5685a=\"\">\n      -2.017%\n    <\/span><\/a> <!----><\/span><\/span>, released the open-source code for its upcoming version 4. The new version is based on the Cosmos SDK and lays the foundation for an independent blockchain tailored to support the decentralized exchange.<\/span>","The software architecture for the forthcoming <a href=\"https:\/\/www.theblock.co\/post\/153478\/dydx-to-expand-to-its-own-blockchain-in-the-cosmos-ecosystem\" data-v-f87c67ca=\"\">dYdX Chain<\/a> was made publicly accessible today. According to an official statement, the mainnet deployment is still pending subject to a governance vote. This is expected to be finalized by the end of the year.","If the proposal gains approval, all components of v4, from the order book to the matching engine, will become part of a decentralized, community-governed project on a self-contained blockchain, secured by audited smart contracts.","dYdX, developed using StarkEx, an Ethereum Layer 2 scaling solution, is currently the largest decentralized derivatives trading platform with a daily trading volume of above <a href=\"https:\/\/www.coingecko.com\/en\/exchanges\/dydx_perpetual\" data-v-f87c67ca=\"\">$1 billion<\/a>. The transition to a Cosmos-based blockchain was initially announced as part of the v4 update, and the software development has now been completed.&nbsp;","The new chain aims to offer transparent and secure derivatives trading, operated solely by code and governed by its user community.","Beyond the blockchain transition, dYdX Trading plans to cede control over various components of the protocol and discontinue the collection of trading fees. Governance and decision-making responsibilities will be transferred entirely to the community of dYdX stakeholders and ecosystem participants.","\"The dYdX Chain software release marks the full decentralization of dYdX, and is a big step on our mission to democratize access to financial opportunity. With the dYdX Chain, dYdX brings transparency and security to derivatives trading with an exchange that is run solely by code, and controlled by its users,\" said dYdX Trading founder and CEO Antonio Juliano.","To mitigate potential disruptions during the transition, the existing dYdX exchange, version 3, will continue to operate alongside v4 for an unspecified period.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Antonio Juliano","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"-2.017%","content":"PERCENT"},{"type":"Cosmos SDK","content":"ORGANIZATION"}],"hashtag":["DERIVATIVES","DEXS","SMART CONTRACTS"],"authors":["Vishal Chawla","The Block"]}