{"summary":"The now defunct FTX.com crypto exchange owed customers about $8.7 billion, debtors said in report released Monday.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/236474\/ftx-com-exchange-owed-customers-8-7-billion-debtors-say?utm_source=rss&utm_medium=rss","publishDate":"2023-06-26T12:58:19","id":14408,"type":null,"title":"FTX debtors release second investigative report, details on commingling","category":["COMPANIES"],"content":["FTX debtors released a second investigative report on Monday, detailing the commingling and misuse of customer deposits at the now defunct crypto exchange.&nbsp;","\"The image that the FTX Group sought to portray as the customer-focused leader of the digital age was a mirage,\" CEO and Chief Restructuring Officer John J. Ray III said in a statement. \"From the inception of the FTX.com exchange, the FTX Group commingled customer deposits and corporate funds, and misused them with abandon at the direction and by the design of previous senior executives.\"","The exchange owed customers about <span class=\"xn-money\" data-v-f87c67ca=\"\">$8.7 billion, debtors said the <a href=\"https:\/\/www.prnewswire.com\/news-releases\/ftx-debtors-release-second-investigative-report-301863419.html\" data-v-f87c67ca=\"\">report.<\/a><\/span>","A review by debtors is ongoing, and the report is part of a series regarding issues that preceded the company's bankruptcy filing.&nbsp;","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Alameda","content":"LOCATION"},{"type":"Monday","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"John J. Ray III","content":"PERSON"},{"type":"$8.7 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX"],"authors":["Nathan Crooks","The Block"]}