{"summary":"Memecoin BALD fell by more than 70% after a breakneck rally over the weekend.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/242225\/bald-memecoin-developer-liquidity-pull?utm_source=rss&utm_medium=rss","publishDate":"2023-07-31T09:16:00","id":14423,"type":null,"title":"Bald memecoin whipsaws in wild trading session as developer pulls liquidity","category":["LAYER 2S AND SCALING"],"content":["Memecoin trading is not for the faint of heart.","Bald, a popular memecoin, whipsawed during Monday's trading session — falling as much as 90% before paring losses. At the time of writing, the coin was trading up more than 82% over the last five minutes. It is down 49% over the last hour, however.&nbsp;","The developer behind the Bald memecoin <a href=\"https:\/\/basescan.org\/tx\/0xd4fce790ac42a5a801bebb220adc2a6f9d9bf99985de6a824638a269c3e52ade\" data-v-f87c67ca=\"\">removed<\/a> 6,800 ETH ($12.5 million) from the token's liquidity pool on LeetSwap, a decentralized exchange on the Base Layer 2 network, on-chain data shows. This move triggered a liquidity crunch, causing the price to drop from $0.09 to $0.01 before rebounding to $0.04.","Memecoin traders flocked to Coinbase's Layer 2 Base, which launched its mainnet for developers on July 13. It wasn’t slated for public launch until early August. However, over the last few days, it has experienced a significant spike in activity and the introduction of several memecoins.","The Layer 2 recorded over 276,000 transactions yesterday, with memecoins like Bald skyrocketing on the network. Bald previously surged more than 20,000-fold in just 24 hours. Its market capitalization approached $90 million earlier today, as per data from DEX Screener.","","","24-hour volumes on the Layer 2 currently sit at $243.3 million, according to Dex Screener. Over the last day, the blockchain has processed over 600,000 transactions.&nbsp;&nbsp;","Bald trading volumes have exceeded $95 million across decentralized exchanges on the Base platform, including exchanges like LeetSwap and RocketSwap. This represents 40% of Base’s daily volume.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$95 million","content":"MONEY"},{"type":"earlier today","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"July 13","content":"DATE"},{"type":"last few days","content":"DATE"},{"type":"82%","content":"PERCENT"},{"type":"last day","content":"DATE"},{"type":"$12.5 million","content":"MONEY"},{"type":"RocketSwap","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"$0.01","content":"MONEY"},{"type":"$90 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$0.04","content":"MONEY"},{"type":"49%","content":"PERCENT"},{"type":"$0.09","content":"MONEY"},{"type":"$243.3 million","content":"MONEY"},{"type":"Dex Screener","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":[],"authors":["Frank Chaparro","Vishal Chawla","The Block"]}