{"summary":"Coinbase is no longer accepting or initiating payments to or from Silvergate.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/216537\/coinbase-drops-silvergate-for-signature-for-prime-customers?utm_source=companies&utm_medium=rss","publishDate":"2023-03-02T08:29:13","id":14439,"type":null,"title":"Coinbase is no longer accepting, initiating payments with Silvergate","category":["COMPANIES"],"content":["Coinbase said it was no longer accepting or initiating payments to or from Silvergate after the troubled crypto bank said <a href=\"https:\/\/www.theblock.co\/post\/216408\/silvergate-may-be-poorly-capitalized-reevaluating-strategy-in-light-of-regulatory-challenges\" data-v-f87c67ca=\"\">yesterday<\/a> that it may be \"less than well capitalized and was \"reevaluating its business.\"&nbsp;","\"In light of recent developments &amp; out of an abundance of caution, Coinbase is no longer accepting or initiating payments to or from Silvergate &amp; will be facilitating institutional client cash transactions with our other banking partners,\" the company said.","The exchange adopted Signature Bank for&nbsp; its Prime customers, according to an email sent to clients.","\"As a matter of policy, Silvergate does not comment on specific customers or their business activities,\" the bank told The Block in an email.","Coinbase Prime has elected to make changes to our USD banking partners,\" the firm said in a message to customers. \"We are facilitating fiat withdrawals and deposits using Signature Bank, effective immediately.\"","It also said it will be facilitating institutional client cash transactions with its other banking partners.","The changes come after Silvergate, a large bank for fintech and crypto, said it would not be able to file its annual financial report on time. The bank said that it may be “less than well-capitalized\" and that it was “reevaluating its business,” and noted that it expected to “record further losses related to the other-than-temporary impairment on the securities portfolio.”","Silvergate shares hit an all-time low in pre-market trading.&nbsp;","\"Coinbase has de minimis corporate exposure to Silvergate,\" a spokesperson added.","(Updates with additional comment, detail throughout.)","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"USD","content":"ORGANIZATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"}],"hashtag":[],"authors":["Christiana Loureiro","The Block"]}