{"summary":"Binance is taking on its major rival OKX, which introduced similar features earlier this week, to tap the inscriptions market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/275476\/binance-launches-marketplace-for-inscription-tokens","publishDate":"2024-02-01T04:00:03","id":1443,"type":null,"title":"Binance launches marketplace for inscription tokens","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Binance today announced the launch of “Binance Inscriptions Marketplace,” allowing users to buy, sell and mint <\/span><a href=\"https:\/\/www.theblock.co\/post\/266272\/brc-20-style-tokens-are-spreading-to-chains-beyond-bitcoin-but-why\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">inscription tokens<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block, Binance said the new platform is hosted within a self-custody crypto wallet on its app — enabling users to trade or inscribe BRC-20 tokens, EVM tokens and other inscription tokens.<\/span>","<span data-v-f87c67ca=\"\">“Our platform not only supports the trade of inscriptions but also facilitates the minting of BRC-20 and EVM tokens, thus lowering transaction costs,” a Binance spokesperson told The Block. <\/span>","<span data-v-f87c67ca=\"\">“With significant milestones recently like the BRC-20 token ORDI reaching a $1 billion market cap, and over 200 million inscriptions across various blockchains, we believe our arrival into this space is timely rather than belated, marking the ripe moment for Binance users to explore and benefit from this evolving realm,\" they added.<\/span>","<span data-v-f87c67ca=\"\">Binance noted that its new product adopts the API of UniSat, an ordinals and inscriptions marketplace. Such an approach allows its users to access UniSat’s liquidity and the offerings of over 60,000 BRC-20 tokens, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">Binance’s newly launched inscriptions marketplace follows <\/span><a href=\"https:\/\/www.theblock.co\/post\/274753\/okx-doginals-atomicals-stamps-runes\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">OKX’s move earlier this week<\/span><\/a><span data-v-f87c67ca=\"\"> to enable Doginals, Atomicals, Stamps and Runes inscription standards.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"BRC","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Atomicals","content":"LOCATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Binance","content":"PERSON"}],"hashtag":["BINANCE"],"authors":["Timmy Shen","The Block"]}