{"summary":"Mango Markets is proposing to pay back users with different tokens following a $114 million hack last week. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/177736\/mango-markets-proposes-plan-to-pay-back-victims-after-114-million-hack","publishDate":"2022-10-17T14:50:10","id":14432,"type":null,"title":"Mango Markets proposes plan to pay back victims after $114 million hack","category":["DEFI"],"content":["Mango Markets is proposing to pay back users with different tokens following a $114 million hack last week.&nbsp;","The platform will use a snapshot of balances from an hour before the attacker made his first deposit on Oct. 11 at 6:19 p.m. ET. Mango Markets presented the motion in a Discord community call this morning. The DAO will have 72 hours to vote on the proposal once it's published.","Self-proclaimed digital art dealer Avraham Eisenberg admitted to being the person behind the hack, claiming he did nothing illegal. The Mango community voted over the weekend to allow Eisenberg to keep $47 million while returning the remaining $67 million. The attacker’s accepted bounty proposal was contingent on returned stolen funds being used to pay back all users who were affected during the <a href=\"https:\/\/www.theblock.co\/post\/177424\/mango-markets-exploiter-comes-clean-claims-all-actions-were-legal\" data-v-f87c67ca=\"\">controversial exploit.<\/a>","Hackers are having a field day in the web3 sector. October is in the lead for the most crypto funds stolen in a single month, according to <a href=\"https:\/\/go.chainalysis.com\/2022-crypto-crime-report.html\" data-v-f87c67ca=\"\">Chainalysis<\/a>. The blockchain analytics firm reported 11 different hacks totaling $718 million this month as of Oct. 12.","One of the primary goals of the repayment strategy is to minimize the difference between the tokens users had prior to the exploit and the tokens they will receive, Mango Markets co-founder Daffy Durairaj said in Discord.","All perpetual futures, or borrowed funds, will be settled based on the time of the snapshot, and the Profit and Loss (PNL) will be converted to USDC.","Mango Markets will then go through each <a href=\"https:\/\/dao.mango.markets\/dao\/MNGO\/proposal\/GYhczJdNZAhG24dkkymWE9SUZv8xC4g8s9U8VF5Yprne\" data-v-f87c67ca=\"\">token it has<\/a> in its treasury, in order from least to greatest, and pay back borrowed amounts in that order. The price of the tokens when paid to users will be used to calculate their total repayment.","The plan to distribute the tokens with the smallest balance first is to minimize price impact and volatility for users.","The MANGO token will be paid out last, as the price of MANGO has changed the most since the snapshot, down about 50% since the exploit, Durairaj said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"this morning","content":"TIME"},{"type":"$718 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"$114 million","content":"MONEY"},{"type":"Durairaj","content":"PERSON"},{"type":"Discord","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"Daffy Durairaj","content":"PERSON"},{"type":"$67 million","content":"MONEY"},{"type":"Avraham Eisenberg","content":"PERSON"},{"type":"Oct. 11","content":"DATE"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Oct. 12","content":"DATE"},{"type":"Eisenberg","content":"ORGANIZATION"},{"type":"6:19 p.m. ET","content":"TIME"},{"type":"October","content":"DATE"},{"type":"$47 million","content":"MONEY"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}