{"summary":"Crypto asset manager Bitwise provided the SEC with a detailed review of the academic record about the bitcoin futures market and its relationship to spot pricing in an amendment to its filing for a spot bitcoin fund.\nThe regulator in August moved to delay decisions on seven proposals, with Bitwise’s latest application receiving a deadline of Oct. 16. ","author":["Nathan Crooks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/252790\/latest-bitwise-bitcoin-etf-filing-takes-sec-to-task-over-academic-literature","publishDate":"2023-09-25T11:06:25","id":1443,"type":null,"title":"Latest Bitwise bitcoin ETF filing takes SEC to task over academic literature","category":["Companies"],"content":["Crypto asset manager Bitwise provided the Securities and Exchange Commission with a detailed review of the academic record about the bitcoin futures market and its relationship to spot pricing in an <a href=\"https:\/\/www.nyse.com\/publicdocs\/nyse\/markets\/nyse-arca\/rule-filings\/filings\/2023\/SR-NYSEArca-2023-44_Am._1.pdf\" data-v-f87c67ca=\"\">amendment<\/a> to its current application for a spot bitcoin ETF that was filed Sunday by NYSE Arca.","While the SEC has approved ETFs based on bitcoin futures, it has yet to do so for a spot fund, which Bitwise has been <a href=\"https:\/\/www.theblock.co\/post\/51341\/bitwise-writes-to-sec-again-saying-it-is-committed-to-creating-a-bitcoin-etf\" data-v-f87c67ca=\"\">seeking for years<\/a>. The regulator in August <a href=\"https:\/\/www.theblock.co\/post\/248595\/sec-moves-to-delay-decisions-on-spot-bitcoin-etfs-from-wisdomtree-invesco-and-valkyrie\" data-v-f87c67ca=\"\">moved to delay<\/a> decisions on seven recent proposals, with Bitwise's latest application receiving a deadline of Oct. 16.&nbsp;","\"The Commission has repeatedly cited the 'mixed' or 'inconclusive' academic record regarding the lead-lag relationship between spot and futures markets as a core reason it believed that the first prong was not met in past disapproval orders,\" NYSE Arca wrote in the amended filing for the proposed Bitwise fund.&nbsp;","\"In order to address all of the Commission’s critical questions regarding the mixed academic record, the Sponsor reviewed all eleven disapproval orders referenced above and summarized the critical questions the Commission has raised regarding the mixed academic record across these orders,\" it continued.&nbsp;","Bitwise does not believe that academic literature is mixed, the exchange added, stating that it viewed there to be a \"high degree of consensus amongst well-designed studies showing that the CME futures market leads the spot market.\" The filing noted that Bitwise had met with the SEC staff 14 times between January 2020 and August 2021 to demonstrate its findings, which included a 107-page white paper.","Bitwise also submitted a separate, 24-page white paper demonstrating that a new bitcoin fund \"is unlikely to become the predominant influence on prices in the CME bitcoin futures market.\"","\"The Sponsor believes the academic record clearly demonstrates that the CME bitcoin futures market leads the spot market, and therefore meets the first prong of the significant market test,\" NYSE Arca wrote, before beginning a separate section of the filing to \"comprehensively address all eight disagreements the Commission raised regarding the Sponsor’s prior analyses in Bitwise Order II.\"","It argued that trading in a new spot bitcoin ETF \"is unlikely to become a predominant influence on prices in the CME futures market without also becoming a predominant influence on prices in the spot market\" given \"the tight correlation and arbitrage relationship between the bitcoin futures price and spot price.\""],"hashtag":["SEC"]}