{"summary":"Mike Schmidt said the FBI demanded that he hand over personal information of attendees at a Bitcoin core developer event in 2022.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287939\/fbi-luke-dashjr-btc-hack","publishDate":"2024-04-11T22:44:02","id":14442,"type":null,"title":"FBI probed bitcoin core developer event linked to Luke Dashjr’s BTC hack: Mike Schmidt","category":["LEGAL"],"content":["<span data-v-f87c67ca=\"\">The U.S. FBI issued a subpoena demanding personal information of the attendees at a Bitcoin core developer event in 2022, according to Mike Schmidt, co-founder of Bitcoin non-profit Brink. The FBI subpoena is allegedly in connection with Bitcoin developer Luke Dashjr’s claim that he was stolen about 216 BTC in a hack.<\/span>","<span data-v-f87c67ca=\"\">“As part of the investigation into Luke Dashjr’s announced theft of his bitcoins, I received a subpoena from the FBI wanting information about attendees of the October 2022 CoreDev Atlanta event in the days before TABConf 2022,” said Schmidt, in an email screenshot <\/span><a href=\"https:\/\/twitter.com\/mikeinspace\/status\/1778090524802461981?t=JibJUO1UxUFj5vfjr9exxA&amp;s=19\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">posted<\/span><\/a><span data-v-f87c67ca=\"\"> Wednesday by mikeinspace, a pseudonymous X user. “I was legally advised to cooperate.”<\/span>","<span data-v-f87c67ca=\"\">Schmidt, who confirmed with The Block that he sent that email, said in the message to attendees that he had provided the FBI with their first and last names, GitHub usernames and email addresses. Schmidt also said that the FBI demanded that he not disclose the subpoena for a year, which expired shortly before he sent out the email.<\/span>","<span data-v-f87c67ca=\"\">“I do not have any details about the investigation or whether the subpoena was due to a targeted suspect or general information gathering as part of the investigation,” Schmidt added.<\/span>","<span data-v-f87c67ca=\"\">The Brink co-founder told The Block that he has not been in contact with the FBI since, and declined to comment on further details.<\/span>","<span data-v-f87c67ca=\"\">Bitcoin core developer Luke Dashjr <\/span><a href=\"https:\/\/www.theblock.co\/post\/198688\/bitcoin-developer-pgp-exploit\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">claimed<\/span><\/a><span data-v-f87c67ca=\"\"> that he lost over 200 BTC due to a Pretty Good Privacy (PGP) key compromise on Dec. 31, 2022, an estimated loss of about $3.3 million at the time. At the current market value, 200 BTC is priced at over $14 million.<\/span>","<span data-v-f87c67ca=\"\">Dashjr is also well known for his blatant <\/span><a href=\"https:\/\/www.theblock.co\/post\/266298\/bitcoin-dev-luke-dashjr-calls-inscriptions-spam-community-members-push-back\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">criticism against Ordinals and BRC-20 tokens<\/span><\/a><span data-v-f87c67ca=\"\"> on the Bitcoin blockchain. “Inscriptions are exploiting a vulnerability in Bitcoin Core to spam the blockchain,” Dashjr said in an X post last December.<\/span>","<span data-v-f87c67ca=\"\">Dashjr, also the co-founder of Ocean mining pool, did not respond to The Block’s request for comment on the FBI investigation of the announced bitcoin hack.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$3.3 million","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$14 million","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"Ocean","content":"LOCATION"},{"type":"Mike Schmidt","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"FBI","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Schmidt","content":"PERSON"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Dashjr","content":"PERSON"},{"type":"Dec. 31, 2022","content":"DATE"},{"type":"U.S. FBI","content":"ORGANIZATION"},{"type":"Atlanta","content":"LOCATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"PGP","content":"ORGANIZATION"}],"hashtag":["CRIME"],"authors":["Danny Park","The Block"]}