{"summary":"The SEC is delving into decentralized finance in a predictable move as it gears up to sue one of the largest DeFi exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287916\/the-sec-plans-to-sue-uniswap-heres-whats-next","publishDate":"2024-04-11T16:29:36","id":14448,"type":null,"title":"The SEC plans to sue Uniswap, here&#x27;s what&#x27;s next","category":["COMPANIES"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">The Securities and Exchange Commission is delving into decentralized finance in a predictable move as it gears up to sue one of the largest decentralized exchanges.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Decentralized exchange Uniswap said on Wednesday that it had <a href=\"https:\/\/www.theblock.co\/post\/287660\/uniswap-receives-sec-lawsuit-warning\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">received<\/span><\/a> a Wells notice, i.e. a formal notice from the SEC that says the agency plans to bring charges against a respondent, which could come in the next month or so. Uniswap founder and CEO Hayden Adams said he wasn't surprised, but was \"annoyed, disappointed and ready to fight.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC has gone after other exchanges, though those were more centralized, including <a href=\"https:\/\/www.theblock.co\/post\/233270\/sec-sues-coinbase-binance\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Coinbase<\/span><\/a>, <a href=\"https:\/\/www.theblock.co\/post\/263898\/sec-files-new-lawsuit-against-kraken-for-allegedly-operating-online-trading-platform-without-registering\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Kraken<\/span><\/a> and <a href=\"https:\/\/www.theblock.co\/post\/233202\/details-of-the-sec-complaint-against-binance-include-ftx-like-misuse-of-customer-funds\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">Binance<\/span><\/a>. The agency's foray to sue Uniswap is unique, said Jennifer Schulp, <\/span><span class=\"s4\" data-v-f87c67ca=\"\">director of financial regulation studies at the libertarian think tank Cato Institute.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">\"This is a new area for them to be moving forward with, although it's certainly not one that surprises me or anyone that they're continuing to open up new areas of new fronts in the battle against crypto,\" Schulp said in an interview with The Block.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Many DeFi protocols don't operate with U.S. customers and go out of their way to block U.S. customers' access to the protocols. Uniswap was unusual in that it remains committed to servicing U.S. customers, Schulp said.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The crypto industry has criticized the SEC over what it calls its \"regulation by enforcement\" approach and says it's not possible to register with the agency under its current rules.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">In Washington, SEC Chair Gary Gensler has argued that most cryptocurrencies are securities and should be regulated similarly to other investments. The SEC's top enforcer, Gurbir Grewal, <a href=\"https:\/\/www.theblock.co\/post\/286279\/secs-gurbir-grewal-criticizes-crypto-industrys-noncompliance-creative-attempts-to-avoid-rules\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">lashed<\/span><\/a> out at the crypto industry last week, condemning the industry over its \"significant noncompliance\" and \"creative attempts\" to avoid its jurisdiction.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Teresa Goody Guillén, a partner at BakerHostetler law firm and former litigation counsel for the SEC, also said she was not surprised the agency issued a Wells notice to a DeFi exchange.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"The SEC’s approach seems to be going after exchanges and larger actors in the crypto market such that it will have a more significant market impact if they go out of business, which could make it more difficult for the crypto industry to operate,\" <\/span><span class=\"s4\" data-v-f87c67ca=\"\">Goody Guillén said in an interview.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Putting the exchanges out of business has a bigger impact on the industry than one particular cryptocurrency, she added.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"I think this is just the beginning of [the SEC] moving into the DeFi space,\" <\/span><span class=\"s4\" data-v-f87c67ca=\"\">Goody Guillén said, adding that the<\/span><span class=\"s4\" data-v-f87c67ca=\"\"> current securities regulatory regime doesn't work for cryptocurrencies.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"It's unfortunate that the SEC isn't engaging more with industry and realizing the holes that are in the securities regime,\" she said.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The Wells notice comes as the SEC is considering a proposal that would broaden the definition of an exchange to capture DeFi exchanges. The <a href=\"https:\/\/www.theblock.co\/post\/268830\/regulatory-outlook-what-will-the-sec-and-cftc-be-focused-on-in-2024\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">rulemaking<\/span><\/a>, which was proposed in January 2022, would require DeFi projects to make regular filings with the SEC, be subject to mandatory disclosures and have strict limits on how they operate.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The rule proposal can be read as a \"recognition that the current regulatory landscape does not clearly cover DeFi,\" said the Cato Institute's Schulp.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Plainly by proposing that rule, the SEC thinks it has the authority — I would disagree with that and a lot of people disagreed with that,\" Schulp said. \"The fact that they're going to move forward on a DeFi exchange case prior to the rule being put into place is really interesting and disappointing, particularly given the calls for clarity of regulation over the past several years.\"<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">What happens next depends on which judge is assigned to the case, said BakerHostetler's Goody Guillén.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"Different judges have such differing opinions and that’s how circuit splits are created, which can then be resolved at the U.S. Supreme Court,<\/span><span class=\"s4\" data-v-f87c67ca=\"\">\" she said.&nbsp;<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">Judges have all been different in how they approach making decisions in crypto cases, from <a href=\"https:\/\/www.theblock.co\/post\/235926\/sec-lawsuit-over-whether-xrp-is-a-security-will-go-to-trial\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">separating<\/span><\/a> out institutional sales from programmatic sales to siding with the SEC over some crypto, including an algorithmic <a href=\"https:\/\/www.theblock.co\/post\/269579\/new-york-judge-grants-sec-summary-judgement-over-claim-that-terraform-sold-unregistered-securities\" data-v-f87c67ca=\"\"><span class=\"s3\" data-v-f87c67ca=\"\">stablecoin<\/span><\/a>.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">The executive branch is struggling to regulate an industry that does not fit easily within the SEC's current regulatory authority, said John Aughenbaugh, associate professor at Virginia Commonwealth University.<\/span>","<span class=\"s5\" data-v-f87c67ca=\"\">\"For the SEC to investigate Uniswap or any other cryptocurrency exchange, it has to make and justify the claim that the firm operating the exchange is in effect selling bonds or other security instruments that fall within the SEC's authorizing legislation and regulatory authority,\" Aughenbaugh said <span class=\"s4\" data-v-f87c67ca=\"\">in an email to The Block<\/span>.<\/span>","<span class=\"s4\" data-v-f87c67ca=\"\">If the firm gets the \"right\" judges, the SEC could falter, the professor added.<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">\"Thus, until or unless Congress clearly passes legislation on the matter, it is a crapshoot as to whether the SEC has the authority to regulate any cryptocurrency market (like that operated by Uniswap Labs) and whether the federal courts will legally bless the SEC's efforts in this regard,\" he said.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Wells","content":"LOCATION"},{"type":"January 2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Cato Institute's Schulp","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Goody Guillén","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Uniswap","content":"PERSON"},{"type":"Hayden Adams","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"Goody Guillén","content":"PERSON"},{"type":"Jennifer Schulp","content":"PERSON"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Teresa Goody Guillén","content":"PERSON"},{"type":"U.S. Supreme Court","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"Schulp","content":"PERSON"},{"type":"Virginia Commonwealth University","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"John Aughenbaugh","content":"PERSON"},{"type":"Aughenbaugh","content":"PERSON"},{"type":"Cato Institute","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sarah Wynn","The Block"]}