{"summary":"Synthetix founder Kain Warwick argued that Synthetix building a front end called Infinex could help Perps V3 take on centralized exchanges.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/240295\/synthetix-is-targeting-a-q4-launch-for-perps-v3-and-infinex-kain-warwick?utm_source=twitter&utm_medium=social","publishDate":"2023-07-18T11:06:34","id":14455,"type":null,"title":"Synthetix is targeting a Q4 launch for Perps V3 and Infinex: Kain Warwick","category":["CRYPTO ECOSYSTEMS"],"content":["Synthetix is targeting a Q4 launch for the third version of its decentralized perpetual futures exchange and its newly announced front end, called <a href=\"https:\/\/www.theblock.co\/post\/239654\/synthetix-is-building-a-perpetuals-trading-platform-to-rival-cexs\" data-v-f87c67ca=\"\">Infinex<\/a>, according to founder Kain Warwick.","“We're talking like three months,” said Warwick in an interview at the ongoing EthCC event in Paris, when asked about the launch of Infinex. He added the team was confident that its launch will align with Perps V3, which is aimed at Q4.&nbsp;","Synthetix operates as a decentralized protocol, facilitating the trade of synthetic assets and cryptocurrency derivatives. Its offerings include spot trading or perpetual contracts (perps), a type of futures contract that do not have an expiration date.","The Synthetix protocol is presently undergoing an upgrade to its <a href=\"https:\/\/blog.synthetix.io\/what-is-synthetix-v3\/\" data-v-f87c67ca=\"\">third version<\/a>. Upon the completion of this upgrade, its perpetual platform will also become operational on its architecture, under the name Perps V3.","While Perps V3 has been in development for some time, Infinex was only recently announced. On July 14, Warwick published a <a href=\"https:\/\/mirror.xyz\/kain.eth\/NHmuyvkRPXB4ck7R38v_ityer-VMZAaIwLGHu1hIDtE\" data-v-f87c67ca=\"\">blog post<\/a> explaining the necessity of creating a dedicated front end for the exchange with the aim to offer an experience similar to that of a centralized exchange, while still adhering to the ethos of self-custody.","“Our view is that those people who are trading on centralized exchanges, all things being equal, would prefer to trade on a DEX, but they're not willing to forgo that user experience they have. If we can replicate the user experience while having similar fees, similar liquidity, the safety of not having custody of their assets&nbsp;— and having convenience and ease of use — will tip the scales,” said Warwick.","The team said Infinex will focus on making it easy for users to access decentralized perpetuals trading. It aims to provide a better user experience compared to other decentralized exchanges, mainly by eliminating the need to sign a blockchain transaction for every transaction.","Centralized exchanges have frequently encountered problems due to theft or mismanagement — from the Mt. Gox incident in 2014 to the FTX situation in 2022. Yet Warwick expressed doubts that even recent disasters may not be enough to scare users away from centralized exchanges toward their decentralized counterparts.","“The skeptic in me says that a new user coming into the space in 2024, FTX might be a distant memory at that point. We've got short memories in crypto,” he said. “What we need to do is make sure that they have an alternative that is safer and just as easy to use.”","Infinex will solely be providing perpetual trading services for now. Still, Warwick acknowledged that the exchanges that have dominated each crypto cycle have typically offered a variety of trading products in one place.","“Having just perps is not going to be enough, there's no question. But I think, given where the market is now, launching with perps and really getting that right will be sufficient to bring some traders across. And then once you've got that foothold, then you can work out how you expand from there.”","On the regulatory front, Synthetix will not be following in the footsteps of other decentralized exchange services like <a href=\"https:\/\/www.theblock.co\/post\/143036\/uniswap-labs-now-blocks-crypto-wallets-frontend\" data-v-f87c67ca=\"\">Uniswap<\/a>, <a href=\"https:\/\/www.theblock.co\/post\/162928\/dydx-confirms-blocking-user-accounts-tied-to-tornado-cash\" data-v-f87c67ca=\"\">dYdX<\/a> and <a href=\"https:\/\/www.theblock.co\/linked\/119055\/dex-aggregator-1inch-blocks-out-us-trades-in-preparation-for-separate-american-platform\" data-v-f87c67ca=\"\">1inch<\/a>, which have implemented user restrictions on their front ends. Warwick stated that there would be no geographical restrictions or know-your-customer procedures for Synthetix products. He contended that since the front end isn’t directly providing the exchange services, its regulatory status remains a point of contention.","“I think that part of the reason for that is [dYdX is] still a full stack exchange, even if they're a DEX. Right. You know, there's a single entity that's operating the front end that's custodying assets and that's actually executing the trades on the exchange itself,” said Warwick. “In our case, we've kind of teased those things apart. So I think it's less clear in my mind. But I'm sure at some point there'll be more clarity around this.”","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2014","content":"DATE"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Warwick","content":"PERSON"},{"type":"Infinex","content":"PERSON"},{"type":"Kain Warwick","content":"PERSON"},{"type":"July 14","content":"DATE"},{"type":"Synthetix","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["DEXS"],"authors":["Tim Copeland","The Block"]}