{"summary":"The Solana-based development team Anza deployed a network congestion fix in version 1.18.11 on a devnet and urged validators to upgrade.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287942\/anza-releases-proposed-congestion-fixes-on-solana-devnet-asks-validators-to-upgrade-on-testnet","publishDate":"2024-04-12T01:54:42","id":14459,"type":null,"title":"Anza releases proposed Solana congestion fixes on devnet","category":["CRYPTO ECOSYSTEMS"],"content":["Solana’s validator client team Anza <a href=\"https:\/\/twitter.com\/anza_xyz\/status\/1778626752056803546\" data-v-f87c67ca=\"\">released<\/a> proposed congestion fixes in version 1.18.11 on a devnet and asked testnet validators to implement and assist in analyzing its effectiveness.","“Solana testnet validators, the v1.18.11 release is now deployed to devnet, recommended for use on testnet. Please upgrade ASAP to help us start analyzing the effects of the proposed congestion fixes,” Anza <a href=\"https:\/\/twitter.com\/anza_xyz\/status\/1778626752056803546\" data-v-f87c67ca=\"\">stated<\/a>.","Anza, the developer of one of Solana’s Agave validator clients, urged Solana testnet validators to quickly adopt the new version. This step is essential for the team to evaluate the release, allowing for necessary adjustments before the update is implemented on the mainnet.","Recently, Solana has experienced significant <a href=\"https:\/\/www.theblock.co\/post\/286868\/solana-network-congestion\" data-v-f87c67ca=\"\">congestion<\/a>, linked to spam transactions. Such congestion has led to slower transaction processing and higher transaction drop rates, impacting the overall user experience.","Solana’s unique architecture, which processes transactions directly without a mempool, is another factor at play. The developers are working on multiple solutions to tackle the matter. Anza previously <a href=\"https:\/\/twitter.com\/anza_xyz\/status\/1776347491195388156\" data-v-f87c67ca=\"\">stated<\/a> it was working on fixes addressing specific issues related to the network's QUIC implementation.","Phantom, Solana’s most widely used wallet, <a href=\"https:\/\/twitter.com\/phantom\/status\/1778535513441652797\" data-v-f87c67ca=\"\">noted<\/a> that transaction success rates have improved a lot already ahead of the patch. The project stated its metrics showed that transactions were successful nearly 90% of the time, which is almost a fivefold improvement from a week ago.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Solana’s Agave","content":"ORGANIZATION"}],"hashtag":["SOLANA"],"authors":["Vishal Chawla","The Block"]}