{"summary":"On this episode of The Scoop, Tom Lee shared his thoughts on how the research business has evolved over the last 2 decades, why he doesn&#x27;t think bitcoin is a macro-hedge and the largest roadblocks keeping big investors out of the market.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/41686\/thomas-lee-fundstrat","publishDate":"2019-10-01T16:00:11","id":14458,"type":null,"title":"The Scoop: A Conversation with Head of Research at Fundstrat Global Advisors","category":["PODCASTS"],"content":["<em data-v-f87c67ca=\"\">The following transcript is taken from episode twenty two of The Scoop, The Block’s first podcast. Listen below and subscribe to The Scoop on <a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Apple<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Spotify<\/a>,&nbsp;<a href=\"https:\/\/play.google.com\/music\/m\/Imy3oaraedpu5huu2r7nf3pxhry?t=The_Scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Google Play<\/a>,&nbsp;<a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Stitcher<\/a>, or wherever you listen to podcasts. Email feedback and revision requests to&nbsp;<a href=\"\/cdn-cgi\/l\/email-protection#ef9f808b8c8e9c9baf9b878a8d83808c848c9d969f9b80c18c8082\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><span class=\"__cf_email__\" data-cfemail=\"30405f545351434470445855525c5f535b53424940445f1e535f5d\">[email&nbsp;protected]<\/span><\/a>. This transcript has been edited for clarity and length.<\/em>","<em data-v-f87c67ca=\"\"><a href=\"https:\/\/twitter.com\/fundstrat?\" data-v-f87c67ca=\"\">Tom Lee<\/a> is one of the great luminaries of crypto and finance Twitter. The former chief equity analyst at JP Morgan made headlines during the bitcoin boom of 2017 with his calls that the cryptocurrency would soar to its price target of $25,000. Fast forward to today; Lee isn't making anymore price targets on bitcoin but he still makes calls on the market -- leading Fundstrat, a market research shop covering both equities and crypto. On this episode of The Scoop, Lee shared his thoughts on how the research business has evolved over the last 2 decades, why he doesn't think bitcoin is a macro-hedge and the largest roadblocks keeping big investors out of the market. We hope you enjoy the episode. <\/em>","<iframe src=\"https:\/\/playlist.megaphone.fm?e=BLOCK1023421605\" width=\"100%\" height=\"200\" frameborder=\"0\" scrolling=\"no\" data-v-f87c67ca=\"\"><\/iframe>","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Ladies and gentleman thank you so much for tuning into what is a very very special episode of The Scoop. I am joined of course by my co-host Ryan Todd -- first episode in a while. We're happy you're here and then our guest Tom Lee, managing partner and head of research at Fundstrat Global Advisors. He's a dear friend of mine and an accomplished Wall Street researcher with 25 years in the industry, known for his opining on the bitcoin and crypto market but also has spent time and most of the business that he operates is involved in traditional U.S. equities and emerging markets. He also spent time at JP Morgan as a chief equity strategist from 2007 to 2014 and we're very happy to have him here to discuss things shaping both the bitcoin industry as well as some other macro trends that we're noticing here at The Block. Tom thank you so much.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Glad to be here. Thank you for that intro.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> I think an interesting place to start since we're both in similar sorts of businesses. The Block is a research and news platform and you guys are doing equity in crypto research. I guess my first question is when we think about equity, research and analysis we often just think about price targets and what a given stock is going to trade at and in the bitcoin world, what is bitcoin going to trade at? And you've had different theses around that for the past several years. How though are they actually different? Walk us through how those two businesses, last time we spoke over dinner I think you said bitcoin is only really 10% of the business you guys run. How is the 90% different from 10%?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> They're very different businesses. My cumulative work experience is as primarily a fundamental research analyst. I started off covering wireless companies in 1993 and just for perspective in 1993 there were only 34 million cell phone users. Today there's four and a half billion. So it's an industry that's grown by about 1,000x since then. And the investment research business is really built around a couple of things, one is you have to develop like a thesis and sort of show some sort of how this tracks the true narrative and investors therefore as you sort of work with the thesis they want evidence to either support or refute your thesis. And so that's in their minds, the edge. You become their primary source and in the institutional business it's a pretty well-established world where there's active managers and funds and people own equities and their positions and then they have research providers and consultants that help them understand their positioning or calibrate their own views. Crypto is very different because number one, there aren't centralized organizations to deal with. So when you cover a company or you're covering a market there's already information so a company has investor relations and they publish data points like the equivalent of key performance metrics and industries will do surveys or they'll make announcements or they'll push towards legislation in an organized way. And I think crypto is really more like a hive mind community. There really isn't a centralized Mr. bitcoin spokesperson and there's no bitcoin company yet. And they're not publishing KPIs or talking to the trading desk. So it's a very different business and I think because of that it actually makes traditional institutions really leery of trying to enter the market because it's hard for them to believe that they can come in with an edge.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Is it then your job to come up with some of those KPIs and present them as part of your thesis almost giving more information or doing more of the legwork than you would with providing a thesis around something like Ford stock or...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I mean I'd say part of our business is trying to bridge that, trying to explain that if you're a traditional investor how do you develop a thesis around crypto and still sleep at night even though you're lacking all your traditional resources. I mean if you think about how an analyst at a hedge fund, so we're just talking about how they make a decision -- they do a lot of bottoms up work. They write up a thesis. They have a model but they calibrate all this information with either sell-side research or consultants and that way they have a consensus that they can either say is wrong or right and they get a lot of trading color and know where the bodies are buried and who's a holder based on a lot of this information and the data sets. In crypto someone really has to believe more in the 20 year roadmap. I mean I think that's the real basis to make an allocation decision and that's going to be the most important decision for fund -- to put 1% into crypto and then understand the work over the next 20 years. And so it's a very different timeframe process and yes it's very different. I mean I think that question could like last hours because there's a lot of differences.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Sure so what's the value then of your services if it is such a long term outlook? Why put out, I don't know the the rate at which you're putting out reports but if it's on a quarterly or monthly basis, if it is such a long term view, why do you need to update your clients so frequently?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I think it has to start with how traditional markets have evolved, so in traditional like liquid markets, let's just take equities which in the U.S. is 20 trillion but it's 66 trillion globally. These are large markets and to give you a sense, if you're really trading markets in the U.S. there's 4,000 stocks of which the top 10 most liquid stocks in America have 20 times the trading volume of Europe. So if you want to say in the world where's the easiest place to buy and sell stocks it's America. Now here's the interesting question. There's 4000 stocks. So you and I would say oh OK well the stock market is therefore the cumulative price action of 4000 different securities that are businesses that have their own sensitivity to the economy, to their demographics, right? 80% of the performance of a stock is explained by macro factors. So in other words if you look at the performance of an active managers portfolio probably 70% of that performance is explained by a top down decision either related to monetary policy, positioning around a regime change, responding to some cyclical indicator. It means that macro is still one of the, despite people sort of not believing that the [...] it still mostly explains how the stock market moves.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What about as it pertains to bitcoin?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Well I think that's very true therefore in crypto, so if I had to say, can you explain bitcoin by some simple measurements? Believe it or not there are some sort of simple macro things that have explained bitcoins price. We are approaching crypto research from the same lens that we're not the team that's going to do the bottoms up research on a project or tell you what the roadmap is for a project. That is something that we can do but it's a different domain expertise than what I'm trying to accomplish. Fundstrat may publish research on projects but that's not going to necessarily be my domain expertise. Some simple things, one, I think you can show really conclusively that bitcoin is a network value asset so measurements of adoption have explained price movements. The second is because there is a proof of work to bitcoin that mining has actually proven to be a pretty important sort of way to set parameters around what is fair value for bitcoin. And of course it's actually explained because miners end up selling or hodling their block rewards and so it ends up providing essentially, acting as a buffer or a rough range where bitcoin should trade.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> So you're talking about quote unquote intrinsic value backed into by the cost of mining or...?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yeah and I mean like these words are really tough because these are native digital assets. But yes it's largely the concept. I mean I'd say for instance most people think FANG stocks are explained by their individual business model. So some will say oh yeah Facebook is ad sales and it's growth and Amazon is based on its sales and you could you go through every one of these major stocks and explain their business model. But we published a report last year that showed 75% of the return of FANG stocks is explained by the growth of global internet users. So in other words if you just did a simple network value model on FANG 10 years ago or 7 years ago and you said this is what I think the global Internet market will grow by, you got 75% the return of the FANG stocks.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> So you'd say the approach at Fundstrat across the composition of asset classes that you do research on is top down not bottoms up?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yes. I don't know what like the generally accepted math like terminology is for top down versus bottoms up. I would say our work is evidence based research, in the world at top down when when you look at traditional markets when someone says they're top down they'll start with their theory that central banks drive the world and and so then they're truly top down in the sense that they're only looking at a handful of things. I think Fundstrat's research approach is what we call evidence based research so we try to say this is what historically can explain market behavior pretty well and if it's in conflict with what we see as consensus then we have a variant call and then that's where we try to sort of say look, focus on these sort of factors and then if our thesis is right then the market's gonna move in this direction. You could say it's top down but I would say it's really with the belief that a lot of evidence in history can explain the movement of markets and that what we try to find and identify and it's not always the same, it's not static.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Do you think, I think a lot of people when they look at bitcoin don't think it's reasonable that someone can come up with a fair value price or a market price because it's not based on anything in terms of, a company is going to have these different KPIs and such. When you talk to clients how do you convince them that there is a way that you can figure out a value for this thing and help them figure out how they can connect that with their own strategies?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> There's this general rule of thumb in the traditional world that you can either be trying to get time or price correct. Meaning like if you think something is worth this then it's very difficult to put time on that timeframe or if you're trying to say where something is in a certain timeframe it's going to be very difficult to get the price right. bitcoin I think that was probably our really big sort of learning adjustment last year was that if you're gonna be writing about bitcoin you can't really get price and time correct so it's better to either think in terms of price or time but for someone to think that bitcoin is impossible to value because of the lack of KPI is making a statement that is also equally true of traditional markets -- most people think stocks are anchored by fundamental value.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> And to your point earlier most of it is driven by macro.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yes. And in fact the majority of the value the S&amp;P is actually intangible. I mean I'll just give you a simple stat I think only 9% of the S&amp;P 500, so the S&amp;P is trading at $3,000 so technically $3,000 per share. Did you know that like $270 is the value of all the plant and equipment, cash on the books. When you buy the S&amp;P you're buying intangible businesses for FANG and it's close to 95% is intangible. So the stock market...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You're buying growth as well to though, right?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> So the idea is that in the equity world one thing to keep mind is that they always say it takes a whole lot of PE to offset E so even though you see all these analysts talk about earnings forecasts, even in the S&amp;P in the last 30 years only three of the years were explained by earnings. Twenty seven of the last 30 years have been explained by what the PE does. And as you pointed out the PE is the future. So the stock market moves because of what you think is going to happen not today but like what the market thinks of the future and I would say that's pretty much how you value any future based asset which is digital assets as well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So do you think it's a fool's errand to price, whether it's a stock or a cryptocurrency with a specific timeframe and a value?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I think trying to combine both yes is difficult. So like for instance if you ask me now what could bitcoin be worth in the future I could give you some numbers that are based on mining break evens or I've seen other models used for crypto and I think those are perfectly reasonable. But the one challenge is going to be time.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So now you're completely off the bitcoin price target game. What do you think was the aha moment that you kind of alluded to before but was there a specific... Was it a specific Twitter troll maybe or...? And how does it feel to be like the bitcoin 25,000 guy and then just see the market utterly collapse?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Well I think that if I had to think about what I learned in 2018 there is a lot of short term dynamics that involve psychology, trading, buyer strikes -- the dynamics that what someone would say doesn't affect the future value of something but it has an impact in the short term that they're really, their unforecastable, there's an inability to include that into a forecast and so I think to us that's why we won't say...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What was it about bitcoin in 2018 that was unforecastable and that you weren't able to capture?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I'd say part of it's this thing of reflexivity which is as bitcoin's price was falling, interest in bitcoin was declining, right? And so if you were to say well it's a network value assets so you've got to look at active addresses, well that's falling with the price. Well then that's going to affect trading because then if you're holding bitcoin and you're trying to get liquidity but if the price is falling you have illiquidity but it's going to be procyclical as people sell it. That's something that I would say a technician would have a much better time, much better ability to sort of see that taking place. That's why I think systems like Demark or Elliott Wave Counts or even people use [...] moving averages. I mean those are actually proving to be quite useful in crypto. And I think that does a much better job of explaining 6 months 3 months maybe even 12 months for crypto.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Your recent call on CNBC I guess your new thesis around... And it kind of jumps out because it's definitely a contrarian take I guess from the the bitcoin polls that we hear everyday but you came out and mentioned I think last week that when the S&amp;P breaks new highs which you expect it to this year -- bitcoin will soon follow and then it sort of follows this idea of trendless macro. You stated that bitcoin stalled because the macro outlook stalled and added that in a world without trend bitcoin doesn't go up. And yeah so I think this is interesting because it's just a direct contrast to some of the narratives that we hear on a daily basis that trade tensions, central banks being overly accommodative, printing money, devaluing currencies, world's gonna end; all that kind of stuff. Can you talk through that thesis as to why you think bitcoin needs to turn into a risk-on asset again?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I agree I think it's an unpopular opinion. It's probably an unpopular opinion say that if S&amp;P makes a new high that's good for bitcoin because you're right, I think people believe bitcoin was designed as a either a hedge or to supplant traditional regulated systems dollar or interference by governments which means you really need calamity or macro risk to be elevated for bitcoin to actually perform well. And I think I agree with actually that basic belief like I would say hey, look at what happened when you had a crisis in Cyprus. bitcoin did well. But here's evidence based research, if I had to say bitcoins a macro hedge then I would say that the evidence should mechanically show bitcoin price does best when the S&amp;P has a bad year. Let me give you the evidence in the years when the S&amp;P has been down since bitcoin's inception -- bitcoin has averaged a negative 19% annual return. In the years where the S&amp;P has been below its long term average return bitcoin's average gain is 300% which is better, so in other words when bitcoin's trendless it does better than when the S&amp;P is down, sorry when the S&amp;P is trendless. What is bitcoin's average gain in the years where the S&amp;P has been up 15% or more? Average gains 1,800%. bitcoin's best years have all taken place in the years where the S&amp;P has performed very well.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> This year is no exception either too, the market is 20% now this year on the year.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> This is the best year for the S&amp;P since 09 and bitcoin's having a great year.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> The economist and the traditional markets folks that we talked to have a better understanding of what is a flight to safety asset and it's probably not going to be something like bitcoin that's hyper volatile -- it's going to be U.S. treasuries, it's going to be gold. Maybe that changes 5 to 10 years from now but based off the evidence and based off what bitcoin acts like or how it performs, it doesn't really make sense that it would be something that people would use as a hedge.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yeah and I would say that if what we're observing is correct this is actually super positive for bitcoin because if bitcoin does well, if risky markets are doing well... And it makes sense because I would say the logic is oh risky markets do well, people want to seek [...] and they buy bitcoin, so that explains why bitcoin does well in up years but bitcoin if it's digital gold will also be one of the few places that could be an alternative to gold in a world where people get macro scared. If what we're saying is correct this is a more positive scenario because no one, as you guys know things got pretty scary in the macro in August. A lot of people were saying game over S&amp;P is going to crack. In fact that's consensus -- people thought this was the Lehman moment.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You had a great line on Good Morning America. They had inverted yield curve segments on Good Morning America.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Oh and everyone's freaking out that the Dow was down 700 points, comparing it to the financial crisis. Yes sure. 700 points when you have a 22,000 Dow.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> We are an evidence based research shop and so we said look when the market behaves like this you have to back up the truck and the validation will be the market recovers which it has. I would say to us we're still bullish on bitcoin because we think S&amp;P is going to make new highs. I have a view about the S&amp;P for the next few years which is quite bullish. It would make us really bullish on bitcoin whereas of course if someone thinks it's a macro hedging that makes new highs, their thesis of a bitcoin as a hedge then suddenly doesn't look great because the S&amp;P is doing fine.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> I want to jump back to that last train of thought -- you're calling for S&amp;P to make all new highs this year, that's a positive telling for bitcoin. Where does that thesis break down? What's the biggest risk to that being realized?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> If you had to say, what kills a stock market? Historically it's just two things. One is, there's a monetary policy error -- the Fed has explained the end of every cycle. Not because the Fed caused it. It's because the Fed was too easy and inflation got out of control and that's why when they tighten, the curve inverts because they're raising rates on the short end and that's slowing the economy. What has always time and again killed the equity markets, it's not the Fed but it's policy error because inflation got too strong. And as you guys know there's like no inflation in the world anywhere. I don't think you have to worry about that being a root cause. And the second has actually been external shocks, it could be a commodity spike. It could be war. It could be a tariff related shock...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What about this Trump trade war with China?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I don't think anything that's taken place so far is enough to cause any global recession. The reason I would say that is -- these numbers aren't big enough yet. But listen if you said tomorrow we're implementing 300% tariffs and China's doing bilateral tariffs of the same amount or some level I would say you could definitely create a recession. I mean a depression but nothing that we've seen to this point even if they were put in place is enough to cause a recession.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> A lot of the times the things that trigger or serve as the catalyst for an economic downturn are things that percolate kind of unknowingly beneath the surface, arise and bite us in the ass before we can even identify until it's too late so at some point it's almost a question of is it even worth stressing ourselves out over thinking about what could be the end, because we won't even know.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> We could even list a bunch of things like meteor strike, alien invasion or the U.S. somehow splits in half. I mean like there's a million things that could happen -- someone with fat fingers a launches a missile. I mean there's a million things.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> So looking back at the business, I'd be interested to know, there have been a lot of different trends that I've been looking at. When I covered exchanges and market structure and trading one of the things that was a big topic of discussion was this idea of the unbundling of different trading services which had not been tied to equity research. Now these things were being bundled together thanks to [...] and there's a lot of questions about how do you price research. And it's a difficult business to be in. How has that impacted you as sort of an independent shop?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Research has always been a strange business actually. And the reason it's been strange is when I was at Wharton undergrad I took some equity research classes because I was quite interested in the field. This is in the 1980s late 80s early 90s but research was not a highly coveted job back then. It was actually more of a back office like you never... You weren't front facing but I was interested because it's like oh well when you're analyzing companies and plus you could talk to CEOs and everything but it was really in the 90s where IPOs really started to take place but in a very different way. So pre 1990 most IPOs were actually profitable companies, University Southern Florida has a lot of data on this and so you didn't really have to do a lot of work to value a stock but in the 90s, growth companies, companies that were losing money started to go public and that's when equity research started to become quite valuable. Those research analysts that make a difference are still very highly value capture people and I think the active management world does reward those that provide that investment variance. The majority of research today, the quality I think has slipped because I think budgets have slipped and so I don't think like a research analyst today is necessarily as experienced or... and look because of rules like from Spitzer and Reg AC -- the edges change. So I think research is a great business if you're a top tier provider of research.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> You can't argue with that. Do you really need 35 people looking at Apple?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> It ends up being a pyramid. What you do is if you're in the research business you don't want to be average. You want to be top tier and it's not linear, it's a pyramid.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> How do you see automation and technology impacting that business?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> It's a virtue and it's it's a huge problem. The virtue is... it really cleans up information quality. In the early 90s there wasn't like you said the Internet so we had to order the 10 Qs and then in manual input those into the model. And if you were really quick at typing you were the first to fax out your research report. And there wasn't voice blast systems back then so you had to call everybody one at a time -- the sixtieth person on the call list was mad because the first guy got the call first. That doesn't add value anymore. But as you guys know information is just noise. Judgment really makes sense and if you guys think in a world of A.I. today you don't need it, let's just look back in August. All this information that everybody knows whether it's the curve or whatever led people to a certain conclusion. And that was not the correct conclusion. What was the difference? It's not like A.I. made that decision correctly because it would have been a consensus view","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Part of it is the media, right? You have all these scary flashing red headlines that are equating this thing with the end of the world. You couldn't turn off the TV. I mean look to your point -- MSNBC CNN -- inverted yield curve, inverted yield curve, the biggest recession triggers etc.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yeah. So then if you used an A.I. system a learning system, it would have told you to get the heck out of the markets. I would say A.I. is going to scare me when it learns to lie. See I think that's deception and then we don't even need to be human anymore. But I think that today, one of the biggest flaws with A.I. systems is that they don't make the moral decisions that we can make or what I say are emotions that are a combination of either lying or empathy and those those are really your advantage and another advantage I think against A.I. is A.I. does need a large sample set. So like N equals like if you'd say it was a learning system like N equals a thousand or ten thousand so by nature when it's directed at a system it's going to look at a shorter time frame because then you can create a lot of N equals but if you make a century, a 100 year observation there's only N equals three, A.I. provides you 0 edge and so one of the things that we do at Fundstrat is we tend to look at century long cycles whether it's demographic or other things that don't have enough N equal that you can actually say your A.I. system, learning system would disprove it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Are you guys making any individual specific calls on any companies out there? Do you have a particular view on some of these big tech companies that have come to market recently, a lot of them have not really performed all that well. Where do you see growth in a market where most of the companies are coming to market at frothy valuations but also very deep into their lifecycle as a company?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> That's definitely an evolution of markets. Private equity and venture have really evolved in the last 10 years. One, because the total AUM is just that much larger. I mean just so much bigger and they've had great performance, they've really captured a greater %age of the institutional allocation to those businesses. Alternatives is 45 % of some of the large institutional [...] today probably single digits before a decade ago and a decade ago venture capital and private equity were really high net worth people allocating and because they've gotten so big today there's more companies in a private equity portfolio than there are publicly traded stocks. The private equity world, company portfolios are arguably the same size as the stock market and that means if you're a private equity do you want to necessarily release it to the public world where they got K1's and you can be attacked by shorts or do you want to create your own exchange? And I think that's why there's even some interest in people creating an alternative exchange where something could stay private forever. I don't think it's a sign of late cycle for the economy. Venture started companies and private equity companies don't represent the U.S. economy. They represent a certain profile. Silicon Valley funds growth tech and health care and some other verticals like energy but if that's mature it's not the end cycle for the economy it's just the end cycle for that value capture. And same thing with private equity, today private equity is 2 trillion of unallocated money that could buy 10% of the S&amp;P. If you think about it like... Take all the entire mutual fund world, what's their cash balance? Maybe it's 50 billion. Private equity is 2 trillion on the sidelines waiting for a pullback in a recession. That's why I think there's a lot of people that want a recession not because they think we're due it's just because they want to take advantage of it.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> What remains the three top hurdles in your opinion for quote unquote institutional investors looking to get exposure into bitcoin?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> The best way for me too answer it is there's a mechanical issue for crypto in terms of infrastructure that's needed but there's probably also a size of market issue. So let me just maybe start with the simpler stuff. I think crypto is still too small for the institutional world, bitcoin is a hundred eighty billion dollar network value. Gold is 9 trillion. The stock market is 66 trillion the bond market is 86 trillion, bitcoin is not even half a % of the total assets. So if you're asking someone to allocate 1% to bitcoin -- that's like triple the market weighting, like you're you're asking someone to make a massive bet even though it's 1% of their assets because bitcoin is that small. I think when people say there's 20 million holders of bitcoin out there I think people are overestimating the size. I think at most there's a million people that own bitcoin in the world and coin metrics active addresses show it's about a million but a simple thing to do is like look at Twitter, the most widely followed Twitter account for crypto is John McAfee, he has a million followers. If you take a category like music, the top Twitter personality has one hundred eight million followers. So that would say that look if someone is a teen millennial or whatever, they like Kate Perry only 1% of those follow bitcoin. It's probably correct I think about 1% of the U.S. owns bitcoin and at that size it's too small for an institution, it's a hobby. I think the second issue is that infrastructure doesn't exist. But the root cause of that is that there isn't any regulatory protection for bitcoin. So even though bitcoin is legally recognized like in over a hundred countries either as a form of method payment or as legal tender and of course it actually has some precedent in the U.S.. There's not enough legal and regulatory protection for bitcoin in the U.S. to prevent a White House executive order banning bitcoin like nothing today would prevent bitcoin from being outlawed in the U.S.. If I was a bank financial provider in exchange I think you would take...","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> You see this lack of regulatory clarity match with the size of the market and think why is it worth it?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yeah you feel like you have reputational risk because you're extending it to a market that has no regulatory protection if the White House decides they don't like it. So You have to let time change because look by the way if we're correct that only 1% of people own bitcoin the price potential is huge because if you double the percentage, so 2 % of the world owns bitcoin you're going to quadruple the price. And if you look at countries like Asia where 10 or 20% of adults own it, that's a 10x on penetration which would be one hundred x on price. It's actually a virtue that bitcoins as small as it is.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> What do you think in light of that backdrop of the get off zero movement. It's irresponsible if you don't have at least one percent of your assets allocated to bitcoin, does that just seem erroneous?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> I think those people that do take the risk are gonna be really rewarded. I think the 1% could end up being 100% by just pure price appreciation. It does mean that anyone allocating 1% to crypto has to realize it's a hyper volatile asset that could, in that path from 1 to 100 could go to .1% of their net worth as well. And so I think that's really the important part of investor education or hodler education.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Do you pitch investors that know they want exposure but are looking to figure out how to best do that? Whether that's I guess, other funds or funds that can be more nimble. Do you pitch them on the futures that are out, purchasing let's say CME futures?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Suitability is really important. So like knowing our clients so we have a lot of clients. We have clients in 13 countries and every one of them has a different way in terms of how they invest and allocate and the risk tolerance. So a big part of like what we're doing in terms of just crypto education is really not trying to force feed the traditional world in terms of looking at crypto but yes I would say the majority are not going to be willing to have a cold wallet so that they're much more interested in other ways to have liquid access in a way that is protecting them from an institutional perspective and reputation. Whether it's through a fund vehicle or an ETF or a derivatives product or even futures, those are all valid but different solutions for different clients.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Yeah you mentioned crypto. Your thesis being that crypto has a higher beta to the S&amp;P and that's going up at the end of the year. Are there any crypto specific catalysts you're looking at this year that could contribute?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> There's a lot of things to watch and they they all end up really centering aroun, it's really simple, is bitcoin risk protection of regulatory going to improve? Any of those events are catalysts. Are there things that are going to enable institutional participation? Those are really valid catalysts. Anything that's going to grow adoption broadly are catalysts so if you think about what do we see in 2019? I think Libra is a really important development. I know a lot of purists hate it because it's not decentralized but I think that's really one of the most important projects out there. The launch impact which is soon. I think that long term that's going to be very successful. I don't know how their launch is going to go. I mean I'm not really I'm not going to have any views on how it initially launches or how many customers they launch with and then on the regulatory side I'd say that if some regulatory developers take place around crypto that we're providing protection, I think that would be huge.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Are you still bullish on Libra despite, you've had policymakers in Germany, France, many of our own. I mean I was down at the Senate and congressional hearing and it was at some moments akin to sinners in the hands of an angry god. I mean these people hate this company, so many people hate this company. Do you think it will get off the ground in spite of those policy and reputational headwinds?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Yeah I mean I would say that the Washington hearings to me really highlighted how tech companies are not as good at lobbying and playing the Washington game as traditional financial companies. I used to cover telecoms and so I know how smart telecom companies were with dealing with state and local and federal regulators and Congress. And I know financial institutions are very savvy. I mean they have huge armies. And so I think that what we saw in August was really an example of many of those congressmen not being institutionally against Facebook or Libra but really maybe reminding Facebook and Libra that they have to show that Libra would be good for their district. In some ways it was a little bit of an entreaty of get involved with our district, help us in our district and we'd be glad to be advocates. So I think that this was more of a learning moment for Facebook.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Ryan Todd<\/span><\/strong> Looking at Fundstrat's best bets in 2019. You have Facebook, Visa, MasterCard --some companies that could be impacted by Libra or Libra like product. Are you thinking about that yet for those individual stocks or like impacts to those theses?","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> The crypto piece of any traditional like we say is really a call option because it's not the, it's not going to be the source of intrinsic value or the central thesis for any of these companies. But could it be huge. I mean like is Visa a long term winner in a digital asset world that's supplanting a lot of the bank functions? I think they are huge winners. Is Facebook a long term winner in a decentralized crypto world? Yeah I think they are long term winners but it's not central to our thesis. I don't think it should be anyone's thesis but it's a free call option.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Frank Chaparro<\/span><\/strong> Well I think that's a great place to end the podcast.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> at Fundstrat. Thank you so much for stopping by. Hope to talk to you again soon.","<strong data-v-f87c67ca=\"\"><span class=\"speaker\" data-v-f87c67ca=\"\">Tom Lee<\/span><\/strong> Thank you","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"$3,000","content":"MONEY"},{"type":"Ryan Todd<\/span><\/strong> This","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"Amazon","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Lee<\/span><\/strong> Research","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"1,800%","content":"PERCENT"},{"type":"John McAfee","content":"ORGANIZATION"},{"type":"Cyprus","content":"LOCATION"},{"type":"300%","content":"PERCENT"},{"type":"1980s","content":"DATE"},{"type":"last 30 years","content":"DATE"},{"type":"last 10 years","content":"DATE"},{"type":"19%","content":"PERCENT"},{"type":"Spotify","content":"LOCATION"},{"type":"FANG","content":"ORGANIZATION"},{"type":"Ryan Todd<\/span><\/strong> Looking","content":"PERSON"},{"type":"bitcoin","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> You","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"$25,000","content":"MONEY"},{"type":"Lehman","content":"LOCATION"},{"type":"Chaparro","content":"PERSON"},{"type":"CME","content":"ORGANIZATION"},{"type":"Fundstrat","content":"ORGANIZATION"},{"type":"Frank Chaparro","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"Ryan Todd","content":"PERSON"},{"type":"Wharton","content":"LOCATION"},{"type":"A.I.","content":"LOCATION"},{"type":"Ryan Todd<\/span><\/strong> What","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Tom Lee<\/span><\/strong> Thank","content":"PERSON"},{"type":"next 20 years","content":"DATE"},{"type":"Ryan Todd<\/span><\/strong> Your","content":"PERSON"},{"type":"Ryan Todd<\/span><\/strong> Yeah","content":"PERSON"},{"type":"University Southern Florida","content":"ORGANIZATION"},{"type":"4000","content":"DATE"},{"type":"Senate","content":"ORGANIZATION"},{"type":"2014","content":"DATE"},{"type":"45 %","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"a %","content":"PERCENT"},{"type":"S&amp;P","content":"ORGANIZATION"},{"type":"Kate Perry","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"eighty billion dollar","content":"MONEY"},{"type":"White House","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"Good Morning America","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":".1%","content":"PERCENT"},{"type":"Spitzer","content":"PERSON"},{"type":"Germany","content":"LOCATION"},{"type":"JP Morgan","content":"ORGANIZATION"},{"type":"one percent","content":"PERCENT"},{"type":"2 %","content":"PERCENT"},{"type":"Tom Lee<\/span><\/strong> This","content":"PERSON"},{"type":"Demark","content":"PERSON"},{"type":"greater %","content":"PERCENT"},{"type":"Tom Lee<\/span><\/strong> That","content":"PERSON"},{"type":"1993","content":"DATE"},{"type":"9%","content":"PERCENT"},{"type":"Tom Lee<\/span><\/strong> Suitability","content":"PERSON"},{"type":"KPI","content":"ORGANIZATION"},{"type":"1990","content":"DATE"},{"type":"Washington","content":"LOCATION"},{"type":"today","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Tom Lee","content":"PERSON"},{"type":"Fundstrat Global Advisors","content":"ORGANIZATION"},{"type":"Tom Lee<\/span><\/strong> Yeah","content":"PERSON"},{"type":"2007","content":"DATE"},{"type":"America","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"Ford","content":"ORGANIZATION"},{"type":"PE","content":"ORGANIZATION"},{"type":"A.I.","content":"ORGANIZATION"},{"type":"MasterCard","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"$270","content":"MONEY"},{"type":"China","content":"LOCATION"}],"hashtag":["CRYPTO"],"authors":["Frank Chaparro","Ryan Todd","The Block"]}