{"summary":"An Aave fork on Blast unexpectedly updated its liquidation threshold, causing a large swatch of liquidations. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287992\/26-million-in-unnecessary-liquidations-hit-blast-based-lender-pac-finance","publishDate":"2024-04-12T06:47:56","id":14469,"type":null,"title":"$26 million in &#x27;unnecessary liquidations&#x27; hit Blast-based lender Pac Finance","category":["DEFI"],"content":["Pac Finance — a lending protocol and an Aave fork on Blast network — saw <a href=\"https:\/\/parsec.fi\/tx\/0x3585a499b4562a6e7aeda87c22e1e0e24427f1bfb9ad9e2e99c8a54151cad134\" data-v-f87c67ca=\"\">a large amount of liquidations<\/a> on April 11 after the platform suddenly decreased the liquidation threshold for user positions.&nbsp;","\"Random Aave fork on Blast decreased liquidation threshold (LT) instead of loan to value (LTV) causing $26M worth of unnecessary liquidations,\" Avara's Stani Kulechov, the creator of Aave, <a href=\"https:\/\/twitter.com\/StaniKulechov\/status\/1778693911763955870\" data-v-f87c67ca=\"\">said<\/a> on X while reposting news of the liquidations.","The developer wallet <a href=\"https:\/\/blastscan.io\/tx\/0xe74fea5424c90cd13e2de7e574d2021abb81edc79760d86493eb265050f84dcd\" data-v-f87c67ca=\"\">adjusted<\/a> a function on Pac Finance’s PoolConfigurator-Proxy contract, which brought down the liquidation threshold of Renzo restaked ether (ezETH) loans without prior announcement or a timelock, resulting in large&nbsp; liquidations.&nbsp;","Reducing the liquidation threshold in a lending platform can cause a surge in liquidations due to the narrower margin of safety it provides for borrowers.&nbsp;","\"Fundamental problem with forking code is the lack of in-depth knowledge of the software and the parameters,\" Kulechov further commented.","Crypto analyst 0xLoki <a href=\"https:\/\/twitter.com\/Loki_Zeng\/status\/1778646397149196723\" data-v-f87c67ca=\"\">noted<\/a> that 93% of the liquidations was executed by a single address (<a href=\"https:\/\/blastscan.io\/address\/0x4883094b78a6ea2a4aed28b864156276d2acdb3d\" data-v-f87c67ca=\"\">0x..db3d<\/a>), which subsequently profited about 244 ETH from the event.","Pac Finance posted on X that it is aware of the issue and is in contact with impacted users. It also <a href=\"https:\/\/twitter.com\/pac_finance\/status\/1778529972447252497\" data-v-f87c67ca=\"\">claims<\/a> to be \"actively developing a plan with them to mitigate the issue.\"","\"In our effort to adjust the LTV, we tasked a smart contract engineer to make the necessary changes,\" the platform explained. \"However, it was discovered that the liquidation threshold was altered unexpectedly without prior notification to our team, leading to the current issue.\"","\"Going forward, we will set up a governance contract\/timelock and forum for all future upgrades to ensure that discussions are planned ahead of time,\" it added.","<em data-v-f87c67ca=\"\">Disclaimer: Larry Cermak, CEO of The Block, is an angel investor in Blast.<\/em>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Pac Finance","content":"ORGANIZATION"},{"type":"$26M","content":"MONEY"},{"type":"Larry Cermak","content":"PERSON"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"April 11","content":"DATE"},{"type":"Avara","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"LTV","content":"ORGANIZATION"},{"type":"93%","content":"PERCENT"},{"type":"Stani Kulechov","content":"PERSON"}],"hashtag":["AAVE"],"authors":["Adam James","The Block"]}