{"summary":"HashKey said the und issuers working in collaboration with the firm have finalized relevant infrastructure for potential spot bitcoin ETFs.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/287970\/hashkey-finalizes-infrastructure-for-spot-bitcoin-etfs-amid-anticipated-approval","publishDate":"2024-04-12T03:52:13","id":14460,"type":null,"title":"HashKey finalizes infrastructure for spot bitcoin ETFs amid anticipated approval","category":["ASIA"],"content":["HashKey, a licensed crypto exchange in Hong Kong, has completed product features and relevant infrastructure services for potential spot bitcoin exchange-traded funds in Hong Kong, as the region may reportedly approve such an ETF as early as next week.","Livio Weng, chief executive of HashKey Exchange, told The Block that the fund issuers in collaboration with HashKey have finalized developing their spot bitcoin ETFs. HashKey is set to offer infrastructure support for the ETFs and has entered the “integration and functional testing” phase.","“As a fund provider applying for an ETF in Hong Kong, HashKey offers underlying infrastructure support, covering trading, custody, and SSA aspects,” Weng said, adding that HashKey’s own custody business has been operating stably for over a year, with assets under custody exceeding HK$2.2 billion ($280.7 million).","HashKey did not disclose the asset managers it is working with.","Hong Kong regulators may approve the first batch of spot bitcoin ETFs as early as next week, Reuters <a href=\"https:\/\/www.reuters.com\/business\/finance\/hong-kong-set-approve-its-first-spot-bitcoin-etfs-april-sources-say-2024-04-10\/\" data-v-f87c67ca=\"\">reported<\/a>, citing sources familiar with the matter. Regulators have accelerated the approval process, according to one source.","At least four <a href=\"https:\/\/www.theblock.co\/post\/286994\/hong-kong-spot-bitcoin-etf-chinese-asset-managers-apply\" data-v-f87c67ca=\"\">asset managers<\/a>, including those from the Chinese mainland and Hong Kong, have filed their applications to launch such ETFs, according to Reuters.","Unlike its neighboring Chinese mainland’s broader crackdown on cryptocurrency trading and mining, Hong Kong has rolled out the welcome mat for crypto firms last year. In June 2023, Hong Kong officially started its crypto licensing regime for crypto trading platforms, allowing licensed exchanges to offer retail trading services. Hong Kong has granted licenses to two platforms — HashKey and OSL.","<span data-v-f87c67ca=\"\">Weng said that in the near future, “we can expect the launch of spot ether ETFs,” especially if the issue of on-chain staking can be resolved.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“This could attract more large institutional investors to choose this type of ‘yield-bearing asset,’ which may be more appealing than spot bitcoin ETFs,” Weng added.&nbsp;<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"HK$2.2 billion","content":"MONEY"},{"type":"November 2023","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"OSL","content":"ORGANIZATION"},{"type":"$280.7 million","content":"MONEY"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"SSA","content":"ORGANIZATION"},{"type":"Weng","content":"PERSON"},{"type":"HashKey Exchange","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Livio Weng","content":"PERSON"},{"type":"June 2023","content":"DATE"}],"hashtag":["HASHKEY","SPOT BITCOIN ETF"],"authors":["Timmy Shen","The Block"]}