{"summary":"Crypto company Anchorage is setting up a subsidiary in South Dakota\nThe Anchorage Trust Company has received a charter to operate in the state\nThe company will custody crypto assets without utilizing hot wallets or cold storage","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/31883\/anchorage-subsidiary-receives-charter-to-set-up-smart-crypto-custody-shop-in-south-dakota","publishDate":"2019-07-16T17:01:53","id":1447,"type":null,"title":"Anchorage subsidiary receives charter to set up &#x27;smart&#x27; crypto custody shop in South Dakota","category":["Startups"],"content":["Crypto custodian Anchorage is headed to South Dakota, where it’s just received a license from the state for a new subsidiary. The Anchorage Trust Company will be headquartered in Sioux Falls.","In a U.S. Senate Banking Committee hearing today, U.S. Sen. Mike Rounds of South Dakota announced Anchorage’s subsidiary has received its trust charter from the state, which has been a leader in regulatory and trust laws. The state established the U.S.’ first “Trust Task Force” more than a decade ago.&nbsp;","“South Dakota has struck the right balance by developing a strong regulatory regime, while also encouraging growth in the trust industry through the adoption of innovative trust laws,” Nathan McCauley, co-founder and CEO of Anchorage, said in a statement.","Rounds also boasted the state's efforts in digital assets, noting his state strikes a balance between progress and caution. Indeed, South Dakota contains over $3 trillion in assets, according to the FDIC. This eclipses New York three times over. It is also the home of the BitGo Trust, another qualified custodian.&nbsp;","BitGo has called South Dakota home since 2018, receiving approval from the state’s banking committee last year. Anchorage’s move puts it on a similar playing field as BitGo.","As for Anchorage, it purports a unique custody solution, saying clients can use keys for transactions, audits, staking, voting and other activities in real time without removing assets from so-called cold storage. The company claims the solution is safer than hot wallets and cold storage, calling itself a “smart storage” solution.","The state’s Division of Banking will monitor the subsidiary’s finances, operations and compliance.&nbsp;","The announcement of the subsidiary comes just days after Anchorage announced it raised $40 million in a Series B round. Visa and Blockchain Capital were among the lead investors, raising the company’s total funding to $57 million after a previous $17 million Series A.","Visa, Blockchain Capital and Anchorage are also all backers of Facebook’s impending crypto, Libra. The U.S. Senate held a hearing today on Libra, where Round congratulated Anchorage on its subsidiary's plans to set up shop in his state. <a href=\"https:\/\/www.theblockcrypto.com\/2019\/07\/16\/facebook-is-dangerous-senators-grill-facebooks-david-marcus-over-libra-in-2-hour-hearing\/\" data-v-f87c67ca=\"\">Senators grilled David Marcus<\/a>, Facebook’s blockchain lead, on the possible effects of a Facebook crypto."],"hashtag":[]}