{"summary":"Some surprise winners in Drift's road to decentralization include MetaDAO.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/16\/solana-dex-drift-to-airdrop-100m-tokens-in-weeks\/","publishDate":"2024-04-16T11:52:00","id":14474,"type":null,"title":"Solana DEX Drift to Airdrop 100M Tokens in Weeks","category":["Technology"],"content":["Solana-based decentralized exchange (DEX) Drift protocol plans to launch a DRIFT governance token and airdrop the asset to its users within weeks, according to Drift's website and people familiar with the matter.","The new token follows a three-month points program that enticed traders, borrowers, lenders—and, of course, airdrop farmers—into Drift, one of the largest venues for trading perpetuals in Solana DeFi. But contributors to the protocol said most of the 100 million tokens earmarked for this airdrop will go to longtime Drift users.","Airdrops, within the world of cryptocurrencies, refer to the distribution of free tokens or coins to individuals.","Drift is the latest piece of financial infrastructure on Solana to attempt to decentralize its operations by creating a token whose holders can vote on key decisions at the exchange, like which tokens to list or when to upgrade software. In this airdrop, ten percent of DRIFT's total supply will go to its users.","Venture backers are set to get a far larger allocation of DRIFT: 22%. Massive crypto VCs Polychain Capital and Multicoin Capital, as well as a smattering of angel investors that include Solana's founders Anatoly Yakovenko and Raj Gokal have since 2021 poured over $25 million into the protocol's development.","Forty three percent of tokens will go toward \"ecosystem development\" that could include trading rewards, liquidity incentives and future airdrops. And 25% of tokens are reserved for \"protocol development\" payouts to Drift's contributors, according to Drift's website.","Drift protocol's developers plan for the trading service to become a one-stop venue for crypto investors on Solana. Its main product is perpetuals trading for price speculators to long and short cryptos with up to 20x leverage.","Drift also hosts spot trading and a range of exotic financial instruments that give investors exposure to high-risk, high-reward plays. Its newest product lets traders place bets on tokens that haven't launched yet, though for legal reasons it won't offer the service for DRIFT token).","\"Our goal was never to just be a perps DEX,\" core contributor Cindy Leow said in an interview. Instead, Drift Labs (the main company building the protocol) has spent over two years, tens of millions of dollars and its 25 personnel building the \"entire value stack\" for DeFi.","Some of those were stress tested during last week's crypto market crash. Lenders to Drift's insurance fund, a high interest-paying USDC vault that protects the protocol against bad debt, saw $11,600 in socialized losses during crypto's biggest multi day liquidation event since November 2021.","But the insurance fund was designed as such a backstop, and amid a wave of liquidations and bankruptcies that came with the sudden price plunge Drift held up.","\"We had $200 million in open interest\" on Friday morning, Leow said amid the market crash, and \"10% was liquidated.\" She called it the biggest single day market move since December. Nevertheless \"liquidations are going fine.\"","Control over Drift will shift from Drift Labs to a three-pronged governance structure. At the top is a security council that will wield upgrade authority over the protocol, basically, day-to-day control. Members of this council will at least initially come from inside Drift, people familiar with the matter said. They'll need approval from Drift's \"Realms DAO,\" where token holders get to vote.","A third prong of Drift's governance, the Futarchy DAO, will operate much like the MetaDAO does. In short, traders here will get to pull the levers of decision-making by bidding up, or against, the price of DRIFT token in a pair of conditional markets.","The winning market is that which ends with a higher price: its trades settle (those in the losing market revert) and the associated decision executes.","Leow said Drift developers learned about futarchy during the mtnDAO hacker house in Salt Lake City in February and came back insistent that Drift implement its wonky notion that markets make better decisions than democracies. \"We're using MetaDAO in the background,\" she said.","Futarchy DAO decisions will address ecosystem grants: who gets money (in DRIFT tokens), for what and how much.","A press release shared with CoinDesk outlined \"new ecosystem initiatives\" including the development of trading bots, validator clients and alternative frontends – the user interface through which people access Drift's open source trading service – as possible areas of investment.","\"One idea for us is looking at how Solana has decentralized over time,\" Leow said. \"We want to invest in teams that are building frontends on their own."],"entity":[{"type":"$11,600","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"Drift Labs","content":"ORGANIZATION"},{"type":"22%","content":"PERCENT"},{"type":"three percent","content":"PERCENT"},{"type":"Raj Gokal","content":"PERSON"},{"type":"Multicoin Capital","content":"ORGANIZATION"},{"type":"25%","content":"PERCENT"},{"type":"$25 million","content":"MONEY"},{"type":"$200 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"ten percent","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"Cindy Leow","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Solana DeFi","content":"LOCATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Leow","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"morning","content":"TIME"},{"type":"Futarchy DAO","content":"ORGANIZATION"},{"type":"Salt Lake City","content":"LOCATION"},{"type":"Solana","content":"PERSON"},{"type":"Drift","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Solana","DEX","Trading"],"authors":["Danny Nelson"]}