{"summary":"Between 2022 and 2023, crypto alongside retail banking, wholesale banking and wealth management posed the greatest risk of being exploited for money laundering, a report by the U.K. Treasury department showed.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/01\/crypto-was-one-of-the-biggest-money-laundering-risks-in-2022-2023-uk-gov-report\/","publishDate":"2024-05-01T10:49:39","id":14479,"type":null,"title":"Crypto Was One of the Biggest Money Laundering Risks in 2022-2023: UK Govt. Report","category":["Policy"],"content":["Crypto firms, alongside retail banking, wholesale banking and wealth management, posed the greatest risk of being exploited for money laundering between 2022 and 2023, a report by the government’s financial arm said on Wednesday.","The conclusion from the report came from the Financial Conduct Authority risk assessments on 238 firms. The FCA is a financial regulator in the U.K., and it has been ensuring crypto firms register with it and comply with its money laundering rules since 2020.","The country has been trying to clamp down on crypto-related crime recently. The U.K. police said it had crypto tactical advisors stationed across the country to help seize digital assets attached to crime in October 2022. At the time, the National Police Chiefs’ Council said they had managed to seize hundreds of millions worth of crypto from crimes.","Data from the newly released report showed that between 2022 and 2023, there were the equivalent of 52.8 full-time financial crime specialist employees that were dedicated to anti-money laundering supervision at the FCA and 15.8 of those focused on supervising crypto businesses.","Meanwhile, wider supervisory teams outside the dedicated financial crime specialist teams opened 95 cases in relation to crypto-assets between the reports recording period.","Read more: UK Law Enforcement Agencies Can Now Seize Crypto More Easily as New Rules Take Effect","Edited by Parikshit Mishra.","\n","\n"],"entity":[{"type":"2022","content":"DATE"},{"type":"FCA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Financial Conduct Authority","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"National Police Chiefs’ Council","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"October 2022","content":"DATE"}],"hashtag":["Regulations","Crypto","UK","AML","FCA"],"authors":["Camomile Shumba"]}