{"summary":"Shiba Inu is the first layer 2 blockchain to join the media and entertainment association to develop blockchain technology for content security and distribution.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/11\/shiba-inu-joins-cdsa-to-battle-ai-driven-concerns-using-shibarium\/","publishDate":"2024-04-11T14:00:00","id":14475,"type":null,"title":"Shiba Inu Joins CDSA to Battle AI-Driven Concerns Using Shibarium","category":["Markets"],"content":["SHIB, an interconnected family of digital assets and solutions built on the Ethereum blockchain that includes the popular meme coin Shiba Inu, today said it is collaborating with the Content Distribution and Security Association (CDSA) in a release to CoinDesk.","Shiba Inu developers will propose and develop blockchain technology specific to media and entertainment, such as security and content distribution. CDSA is an international nonprofit organization that was founded in 1970 to provide best practices for the delivery and storage of entertainment, software and information technology.","“We look forward to providing a unique and blockchain-first perspective to CDSA’s work in helping media and entertainment executives better utilize these innovative technologies, especially as blockchain and artificial intelligence converge,” Shiba Inu lead developer Shytoshi Kusama said in a message.","Blockchains could help alleviate concerns around deepfakes and plagiarism within the emergent artificial intelligence (AI) sector, Shiba Inu developers said in the release. Most AI models are trained on publicly available content, creating a cause of concern among researchers.","SHIB tokens are up 0.69% in the past 24 hours, underperforming the broad-based CoinDesk 20’s 1.7% rise.","Edited by Oliver Knight."],"entity":[{"type":"1970","content":"DATE"},{"type":"Content Distribution and Security Association (CDSA","content":"ORGANIZATION"},{"type":"0.69%","content":"PERCENT"},{"type":"1.7%","content":"PERCENT"},{"type":"today","content":"DATE"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Oliver Knight","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Shytoshi Kusama","content":"PERSON"}],"hashtag":["Shiba Inu","Trading"],"authors":["Shaurya Malwa"]}