{"summary":"Geopolitical factors could see investors allocate funds to alternative assets such as bitcoin, some analysts say.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/16\/bitcoin-could-surge-to-120k-on-doomsday-rally-trader-says\/","publishDate":"2024-04-16T11:25:13","id":14484,"type":null,"title":"Bitcoin Could Surge to $120K on 'Doomsday Rally,' Trader Says","category":["Markets"],"content":["International politics and the search for an investment hedge could fuel a bitcoin (BTC) surge in the coming months, even after confidence in the largest cryptocurrency was dented by a 10% weekly drop, some traders say.","Bitcoin has long been considered a possible hedge against geopolitical events and was originally created in the wake of the 2008 financial crisis. Some traders say the hedging narrative remains viable despite BTC being highly correlated with traditional market assets for several years.","“Bitcoin remains a viable doomsday asset in 2024, as its correlation to Gold recently increased, and investors continue to diversify away from traditional financial assets,” Edouard Hindi, the chief investment officer at Tyr Capital, said in an email to CoinDesk.","“The ETF is currently spearheading this Doomsday rally and we should expect $120,000 to be hit in the coming months as global geopolitics continues to deteriorate and the middle classes continue to find ways to protect their wealth,” Hindi said.","Crypto markets were shattered over the weekend as tensions between Iran and Israel increased alongside profit-taking ahead of the bitcoin reward halving, a technical event expected on April 20 that will cut network rewards by 50%.","Major tokens lost as much as 18% on the weekend compared to last week’s peak prices before reversing some of the losses on Monday. The slide resumed in Asian morning hours on Tuesday as Israel considered its response to Iran's firing of more than 300 drones and missiles at its territory.","Elsewhere, inflows to bitcoin exchange-traded funds (ETF) have slowed in the past week. Data shows only one product, BlackRock’s IBIT, saw inflows on Monday, while 10 other ETFs all saw outflows.","Some market observers say bitcoin’s short-term price action will set the course for the broader crypto market in the coming weeks.","“The sell-off in US stock markets affected global risk appetite late on Monday, reversing initial positivity. The market is hovering near the lows of March,” Alex Kuptsikevich, an FxPro senior market analyst, wrote in a daily note. “This is a key moment in choosing the market’s direction for the coming weeks. A bounce out of this area will allow for the expectation of an early recovery to the recent highs. A dip below would likely trigger a broader liquidation of positions.”","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Doomsday","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"2008","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"18%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Alex Kuptsikevich","content":"PERSON"},{"type":"Israel","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Tyr Capital","content":"ORGANIZATION"},{"type":"$120,000","content":"MONEY"},{"type":"Edouard Hindi","content":"PERSON"},{"type":"Hindi","content":"PERSON"},{"type":"Iran","content":"LOCATION"}],"hashtag":["Bitcoin","Trading","Markets"],"authors":["Shaurya Malwa"]}