{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of April 25-May 1.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/24\/protocol-village\/","publishDate":"2024-05-01T13:47:04","id":14488,"type":null,"title":"Protocol Village: Chainlink CCIP to Power New 'FIX-Native Blockchain Adapter' With Rapid Addition","category":["Technology"],"content":["May 1: Rapid Addition, a FIX connectivity solutions provider, and Chainlink, a blockchain data oracle and interoperability project, announced development of a FIX-native blockchain adapter for institutional digital asset trading, powered by Chainlink CCIP, which stands for Cross-Chain Interoperability Protocol. According to the team: \"This new collaboration will allow banks and other financial institutions to deliver messages and interact with a broad spectrum of tokenized assets – an untapped market opportunity spanning carbon credits and renewable energy products to real-world assets such as real estate, infrastructure, and collectibles.\"","May 1: Bitcoin layer-2 project Stacks announced a \"significant\" delay to the activation of its highly anticipated Nakamoto upgrade, citing the need for eight more weeks of development time. In a blog post, Mitchell Cuevas, who heads the Stacks Open Internet Foundation, wrote: \"With the benefit of more information and practical experience with aspects of the new network, the core developers have identified the need for a more advanced Signer resiliency\/recovery system, something initially scoped for a later release. As a result, they are projecting an additional eight weeks of development time, plus time for testing, before the second hard fork that brings us Nakamoto features at ‘Activation.’ Code complete on the new Signer resiliency features is expected July 15 and Activation starts August 28. Shifting dates this late in the game is not fun and I recognize this is disappointing. Fast blocks just can’t get here fast enough! However, this change is being made to ensure the safety and liveness of the network upgrade.\"","May 1: Alchemy, a Web3 development platform, is rolling out support for zkSync, an EVM-compatible, zero-knowledge rollup layer-2 solution, according to the team: \"By combining zkSync’s hyperscalable zk-powered technology with Alchemy's powerful developer tools, devs can build fast, affordable and user-friendly onchain apps. Starting today, devs can begin building on zkSync Mainnet and zkSync Sepolia Testnet and will have access to Alchemy Supernode, enhanced APIs and Alchemy Signer for embedded accounts.\"","May 1: Solana Foundation will be hosting an IRL overnight hackathon in Berlin on May 21-22 during Berlin Blockchain Week. According to the team: \"65 developers of all skill levels will have the opportunity to compete for a prize pool of over $15,000 from the Solana Foundation and ecosystem projects. This is a unique opportunity for developers to learn, collaborate and build across three tracks: Decentralized Finance & Payments; Consumer Apps & NFTs; and Public Goods.\"","May 1: Minima, a layer-1 blockchain focused on DePIN, is working with Online Payment Platform (OPP) on a project that would allow electric-vehicle drivers to rent out private chargers to other members of the public. According to a press release: \"Charge Point Operators (CPOs) and private wallbox owners will be able to accept tokens generated on the Minima blockchain. The tokens will represent kWh balances, access rights, or authentication details. This would enable a more secure and efficient ecosystem for electric vehicle charging, offering a novel approach to managing energy resources and facilitating access across a broad network.\"","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","April 30: Coinbase announced the much-anticipated launch of its support for the Lightning Network, \"enabling its millions of users to send, receive, or pay with Bitcoin faster and cheaper than ever, directly from their Coinbase account,\" according to the team: \"Until now, bitcoin transfers processed on-chain via Coinbase could take anywhere from 10 minutes to two hours and could be costly for users. With the Lightning Network, Coinbase will now provide instant off-chain bitcoin transfers at a fraction of the cost.\" The integration was made through a partnership with Lightspark, which is headed and was co-founded by David Marcus, former head of Facebook\/Meta's Libra\/Diem project.","April 30: Ocean, the Bitcoin mining pool backed by Jack Dorsey and led by longtime Bitcoin Core developer Luke Dashjr, said miners can now receive payments over the Bitcoin Lightning Network using the Lightning technology BOLT12. According to the team, miners can \"get liquidity directly into a Lightning channel without having to rely on third-party custodians. This latest announcement aligns with OCEAN’s overarching goal of increasing miners’ sovereignty while promoting greater transparency and decentralization in the Bitcoin network.\" According to a press release: \"BOLT12 is a nextgen upgrade in Lightning which solves previous limitations that restricted Lightning’s utility and adoption.\"","April 30: Style Protocol, which transforms NFTs into 3D assets that can be used in any game or metaverse, has raised $2.5 million in seed funding, according to the team. From the project's whitepaper: \"Style Protocol builds on Polkadot, which creates a blockchain of blockchains. Style Protocol aims to be built on the top of Polkadot to increase the interoperability with all chains and make NFTs available in each chain. However, there are two steps to build the protocol to be flexible and usable for all chains. First, create the bridging logic using smart contracts on Solidity and gain all Ethereum Virtual Machine (EVM) compatible chains such as Binance Smart Chain, Fantom, Polygon and Avalanche. Second, create the logic on a separated pallet (Parachain) on Polkadot to fit with all other chains. Also, from a usability point of view, the first step will allow users to pay through a MetaMask wallet easily. However, the second step will build the Style wallet to host most of the payments that will be done on Polkadot.\"","April 30: Ether.Fi, the biggest liquid restaking protocol in the Ethereum blockchain ecosystem, has integrated SSV.Network's distributed validator technology (DVT) into its platform, according to the team. \"In recent weeks, Ether.Fi has onboarded almost 2,000 validators to SSV.Network,\" according to a press release. \"In addition to increasing resilience, the integration of SSV has improved relay liveness through the use of operators that leverage the same MEV Relay correlation. This has improved protocol efficiency while enhancing overall performance and network stability. Earlier this month, an SSV cluster that was used by Ether. Fi recieved an 11 ETH MEV block reward.\" Ether.Fi has about 40,000 validators overall and also has a partnership with another DVT project, Obol.","April 30: Xai Foundation, supporting the Xai gaming-focused blockchain, announced the public launch of \"mainnet Xai RPC nodes on Nirvana Cloud,\" according to the team: The nodes \"are available for developers via the Nirvana Labs developer platform. This integration will significantly improve cost, global distribution, speed, and reliability for Xai game developers, delivering a better overall user experience for their end users.\" According to a press release, \"Xai is developed by Offchain Labs leveraging Arbitrum technology.\"","April 30: Chirp, a telecommunications network for wireless and Internet of Things (IoT), has joined forces with peaq, a layer-1 blockchain for DePIN and Machine RWAs, to provide decentralized connectivity for smart devices, according to the team: \"Chirp is building a unified, multi-protocol decentralized connectivity network that will enable the exchange of data over any supported protocol and from any distance. Its network includes its 'Blackbird' gateways, already spread across 33 countries, which provide connectivity for other IoT hardware across a variety of channels, including LoRaWAN, LoRa 2.4 gHz, BLE, and more.\"","April 30: TDeFi, the incubation and consulting unit of TradeDog Group, and DMCC, an authority of the government of Dubai, announced \"Cohort-3\" of Web3 Acceleration Program, teaming up with Elysium Chain as the blockchain partner. According to the team: \"The top three projects from this program stand to win $150,000 in investments. With mentors like Mario Nawfal and Ravikant Agrawal, the program offers 15 immersive sessions covering fundraising, compliance, tokenomics and go-to-market strategies.\"","April 30: Sui, the layer-1 blockchain and smart-contract platform created and launched by the core research team responsible for building Facebook’s Libra and Diem projects, is collaborating with Google Cloud to support Web3, via a partnership with Mysten Labs. According to the team: \"This joint effort will focus on enhancing security, scalability, developer tools and user experiences across a range of Web3 and AI-powered applications. Key initiatives of this partnership include data-driven dApps, AI-enhanced development, seamless user experience and robust scalable infrastructure.\" (SUI)","April 30: X10, a crypto exchange featuring an \"optimized hybrid model\" with self-custody and settlement of trades on-chain, emerged from stealth on Tuesday and announced $6.5 million of funding. The project was founded by Ruslan Fakhrutdinov, former head of crypto ops at Revolut, according to the team. Investors include Tioga Capital, Semantic Ventures, Cherry Ventures, Starkware and Cyber Fund. According to the team: \"X10 perfectly fits the post-FTX 2024 landscape, blending the best of both worlds of CeFi and DeFi. The user experience, product portfolio, and speed are inherited from CeFi exchanges, along with the benefits of decentralization, which secures transparency and safety through on-chain trade settlement, validation, and self-custody.\"","April 29: Omnity, the first on-chain, omnichain interoperability protocol built by the Octopus Network team on Internet Computer (ICP), announced its integration of Runes, Casey Rodarmor's UTXO-based Bitcoin metaprotocol that allows for the trading of fungible tokens on Bitcoin. According to the team: \"This integration aims to enable the trading of Rune tokens without gas or transaction fees. It also paves the way for greater Runes utility, including use within DeFi, marketplace integration, and token swaps without having to rely on risky cross-chain bridges.\" (ICP)","April 29: Tether, the issuer of stablecoin USDT, said Monday that it invested $200 million to acquire a majority stake in brain-computer interface company Blackrock Neurotech via its venture capital division Tether Evo. Blackrock Neurotech develops medical devices that are powered by brain signals and aims to help people impacted by paralysis and neurological disorders.","April 29: DeFi lending protocol Dolomite announced it will launch its lending protocol on OKX's new Ethereum layer-2 network, X Layer, according to the team: \"Dolomite seeks to replicate its success on Arbitrum, where it quickly became the fourth largest lending market and the lending market with the most supported assets. Dolomite’s expansion to X Layer will transform it into a multi-chain protocol and introduce X Layer users to sophisticated tools for unlocking dormant capital, launching initially with support for OKB, WETH, USDT, USDC and WBTC.\" As reported by CoinDesk earlier this month, X Layer is built on Polygon's Chain Development Kit, compatible with Ethereum's EVM runtime and making use of zero-knowledge technology.","April 28: Natix, driver-led DePIN powered by AI cameras, has secured $9.6 million in funding in a new round spearheaded by Borderless Capital, co-led by Tioga Capital with angel investors from Bitget, Figment and Crypto Banter, according to the team: \"NATIX, one of the largest crowdsourced camera networks with 92,000 registered drivers globally, sets to transform driver-led data collection and driver applications with Web3 incentives.\" Said Alireza Ghods, NATIX’s CEO and co-founder: \"Looking ahead, collaborating with leading high-performance networks like Solana and Peaq is crucial for advancing our mission.\"","April 28: Burnt Banksy’s XION platform has officially launched its user-friendly chain abstraction solution, according to the team: \"With this launch, users of XION are now able to extend the blockchain’s ease of use with a frictionless sharing of apps, liquidity and more across ecosystems – starting with Injective. For the first time, users are able to interact with Injective’s Talis marketplace from their XION account simply by using an email. They can do so without any understanding of cross-bridging, browser plugins, seed phrases, gas fees and more.\"","April 28: Hinkal, a multi-chain protocol that allows hedge funds and institutional investors to discreetly trade in the DeFi ecosystem, announced a $1.4 million strategic funding led by SALT. According to the team: \"As traditional financial institutions continue to enter the crypto market, they are seeking solutions that grant them the same level of discretion and privacy they are used to in traditional equities markets. Using Hinkal, institutions can execute their trades privately and mitigate the risk of frontrunning or trade copying that is becoming increasingly prevalent in the industry.\"","April 28: The Tezos Foundation and Magic have teamed up to enhance Tezos’ accessibility and usability, according to a message from the project: \"Magic's Wallet-as-a-Service will seamlessly integrate with Tezos, streamlining user onboarding for dApps. This collaboration eliminates traditional password hassles, reducing entry barriers to Web3. Supported by a Tezos Foundation grant, this partnership aims to make dApps more user-friendly and encourage mainstream adoption. Tezos joins Magic's platform as a featured chain alongside Ethereum, Solana, Polygon and Flow, offering developers tools to create secure and user-centric applications.\" (XTZ)","April 28: Blockchain bridge Wormhole's native W tokens are now available on Solana, Ethereum and all Wormhole-connected EVM chains through Wormhole Native Token Transfers (NTT), according to the team: \"With NTT, users can seamlessly transfer W across Solana, Ethereum mainnet, and EVM L2s without the complications of liquidity fragmentation. Making W natively multichain completes the second phase of the W launch roadmap, and will lead to an industry-first multichain governance system, MultiGov, and W locking for self-delegation. These advancements lay the groundwork for future token functionality that is only possible with NTT and a native multichain token.\"","April 26: Bitcoin-centric stablecoin company OpenDelta raised $2.15 million in a pre-seed round led by 6th Man Ventures, CEO Konstantin W端nscher told CoinDesk. “We want to use bitcoin to create stable value in a fiat-denominated currency,\" W端nscher said in an interview. OpenDelta will plant itself in the newest greenfield for decentralized finance (DeFi) atop the newest trend in Bitcoin, Runes.","April 25: SEDA, a data transmission and computation network that enables a permissionless environment for developers to deploy data feeds, announced the launch of its mainnet genesis event. According to the team: \"By mitigating native deployments via a modular and chain-agnostic design, SEDA is building to offer complete developer flexibility with chain-agnostic integrations alongside completely programmable data feeds, enabling a 'permissionless optionality' that promotes Web3's ethos for builders. Mainnet will see the deployment of SEDA’s solvers, an overlay network offering one-click node spinups for community and bespoke mechanics for network OEV capture and value redeployment back into the hands of network participants.\"","April 25: Soarchain, a layer-1 DePIN built for mobility and data exchange, is bringing mobility data on-chain with their mainnet vehicle data network, according to the team: \"Users can now seamlessly upload their vehicle data in real-time and convert their vehicles into connected, data-rich platforms from which they can extract real-world value. Vehicle data can serve as a foundation for applications like smart insurance, maintenance monitoring, and safety enhancements. Soarchain is also collaborating with Maruti and Suzuki to demonstrate the practical applications of their technology with real-world automotive scenarios.\"","April 25: Movement Labs, a blockchain company that aims to bring Facebook's Move Virtual Machine to Ethereum, has secured $38 million in a Series A financing round led by Polychain Capital. The firm was founded by Rushi Manche, 21, and Cooper Scanlon, 24 – Vanderbilt college dropouts who say they are on a mission to \"make blockchain security sexy\" with the launch of Movement L2, their new layer-2 Ethereum blockchain based on the Move programming paradigm.","April 25: Ethereum verification protocol Aligned Layer has raised a $20 million Series A to enable faster and cheaper zero-knowledge (ZK) proofs on the world's second-biggest blockchain. The fundraiser was led by Hack VC and included contributions from DAO5, L2Iterative, NomadCapital_io, FinalityCap, Symbolic VC and Theta Capital. Aligned Layer is an EigenLayer “actively validated service\" (AVS).","April 25: Avail, a blockchain project known for data availability (DA), shared Thursday that five major layer-2 networks in the Ethereum ecosystem will integrate with its Avail DA solution. Those chains include Arbitrum, Optimism, Polygon, StarkWare and zkSync.","April 25: Nym Technologies is partnering with Aleo, a prominent privacy-focused blockchain platform, according to the team: \"The partnership harnesses the power of Aleo's zero-knowledge Layer-1 blockchain with Nym's layer-0 mixnet protocol. Through integration with Nym's mixnet and NymVPN's decentralized privacy solutions, users will enjoy enhanced privacy and security across TCP\/IP and on-chain transactions, ensuring robust protection for their online interactions. Leo Wallet's intuitive user interface will seamlessly connect users with the Nym mixnet, streamlining the integration of the Aleo blockchain and Nym's mixnet.\"","April 25: ZetaChain, describing itself as the \"first Omnichain blockchain for chain abstraction\" has launched a 100 million ZETA ($120M) developer and dapp ecosystem growth program, with 25 million ZETA specifically allocated for Bitcoin projects, according to the team: \"The program aims to support impactful projects focusing on Bitcoin-based DeFi, gaming, and socialfi dapps, offering grants, incentives, and support programs to accelerate their development on the ZetaChain blockchain.\"","April 25: BNB Chain is integrating native liquid staking on BSC following the Beacon Chain sunset, according to the team. The move will enable \"high-APY native staking on BSC in addition to enhanced MEV rewards. Liquid staking on BNB Chain will allow participants to secure the network while maintaining liquidity of their assets. Users can engage in DeFi activities without sacrificing asset utility. The LSDFi integration is scheduled to take place between April and early May.\"","Edited by Bradley Keoun.","\n"],"entity":[{"type":"SEDA","content":"ORGANIZATION"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Facebook's Move Virtual Machine","content":"ORGANIZATION"},{"type":"ETH MEV","content":"ORGANIZATION"},{"type":"$15,000","content":"MONEY"},{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"6th Man Ventures","content":"ORGANIZATION"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"May 21","content":"DATE"},{"type":"Mario Nawfal","content":"PERSON"},{"type":"Decentralized Finance & Payments; Consumer Apps & NFTs","content":"ORGANIZATION"},{"type":"$2.15 million","content":"MONEY"},{"type":"NTT","content":"ORGANIZATION"},{"type":"IRL","content":"ORGANIZATION"},{"type":"$2.5 million","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Tezos Foundation","content":"ORGANIZATION"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Stacks Open Internet Foundation","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Tioga Capital","content":"ORGANIZATION"},{"type":"Blackrock Neurotech","content":"ORGANIZATION"},{"type":"Aleo","content":"PERSON"},{"type":"Dolomite","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"$150,000","content":"MONEY"},{"type":"BNB Chain","content":"ORGANIZATION"},{"type":"The Tezos Foundation","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Cooper Scanlon","content":"PERSON"},{"type":"April 29","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"April 26","content":"DATE"},{"type":"W端nscher","content":"PERSON"},{"type":"April 25","content":"DATE"},{"type":"David Marcus","content":"PERSON"},{"type":"April 28","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Xai Foundation","content":"ORGANIZATION"},{"type":"$9.6 million","content":"MONEY"},{"type":"Rushi Manche","content":"PERSON"},{"type":"Lightspark","content":"PERSON"},{"type":"earlier this month","content":"DATE"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"Theta Capital","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"April 30","content":"DATE"},{"type":"Sui","content":"PERSON"},{"type":"Crypto Banter","content":"PERSON"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Ruslan Fakhrutdinov","content":"PERSON"},{"type":"$20 million","content":"MONEY"},{"type":"TradeDog Group","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Elysium Chain","content":"ORGANIZATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Burnt Banksy’s XION","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Maruti","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Mitchell Cuevas","content":"PERSON"},{"type":"Cherry Ventures","content":"ORGANIZATION"},{"type":"Obol","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"ICP","content":"LOCATION"},{"type":"May 1","content":"DATE"},{"type":"USDT","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"RPC","content":"ORGANIZATION"},{"type":"IoT","content":"ORGANIZATION"},{"type":"$6.5 million","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"Alchemy Supernode","content":"ORGANIZATION"},{"type":"$120M","content":"MONEY"},{"type":"TCP","content":"ORGANIZATION"},{"type":"Cross-Chain Interoperability Protocol","content":"ORGANIZATION"},{"type":"$1.4 million","content":"MONEY"},{"type":"Solana","content":"LOCATION"},{"type":"Suzuki","content":"PERSON"},{"type":"Nirvana Cloud","content":"ORGANIZATION"},{"type":"Nym Technologies","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"Nym","content":"ORGANIZATION"},{"type":"Semantic Ventures","content":"ORGANIZATION"},{"type":"22","content":"DATE"},{"type":"August 28","content":"DATE"},{"type":"Peaq","content":"ORGANIZATION"},{"type":"Tether Evo","content":"ORGANIZATION"},{"type":"Konstantin W端nscher","content":"PERSON"},{"type":"Fantom","content":"PERSON"},{"type":"$38 million","content":"MONEY"},{"type":"Dubai","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"1","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"3","content":"DATE"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"July 15","content":"DATE"},{"type":"Ravikant Agrawal","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Movement Labs","content":"ORGANIZATION"},{"type":"APY","content":"ORGANIZATION"},{"type":"Wormhole Native Token Transfers (NTT","content":"ORGANIZATION"},{"type":"Alireza Ghods","content":"PERSON"},{"type":"Borderless Capital","content":"ORGANIZATION"},{"type":"Public Goods","content":"ORGANIZATION"},{"type":"Injective’s Talis","content":"ORGANIZATION"},{"type":"Magic","content":"ORGANIZATION"},{"type":"SSV","content":"ORGANIZATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}