{"summary":"The summer months, between June and September, have historically brought significantly lower investor returns than other months of the year, says André Dragosch, head of research at ETC Group.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/01\/sell-in-may-and-go-away-the-seasonality-of-crypto-asset-returns\/","publishDate":"2024-05-01T16:00:00","id":14492,"type":null,"title":"‘Sell in May and Go Away’: The Seasonality of Crypto-asset Returns","category":["Opinion"],"content":["Tick, tock, next block. Bitcoin works like clockwork as they say. Approximately every 10 minutes a new block of transactions is timestamped into the public ledger.","Obviously, time plays an important role in Bitcoin’s protocol. But what about the seasons?","Traditional financial research provides ample evidence for seasonality in equity returns. You have probably come across terms like the “January Effect” or “Turnaround Tuesday.”","You're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","Seasonal performance patterns that are statistically significant can be observed on almost any time frame: Quarterly, monthly, weekly, daily, hourly, and so on.","The saying “sell in May and go away” has already been around since the nineteenth century, as the summer months tend to have shown a remarkable weakness in equity returns historically compared to other months of the year.","A look at Bitcoin’s average monthly returns reveals that the summer months between June and September have also shown significantly lower below-average returns.","Why should we care about this?","Well, if you just held cash during the months of August and September (when you were on holidays) and were only invested in Bitcoin during the rest of the year, you would have outperformed a Bitcoin buy-and-hold investor by four times!","Hence, statistically-significant seasonal performance patterns could theoretically be used to derive significant alpha.","Moreover, the average seasonal performance pattern also suggests that Bitcoin could continue to rally over the coming weeks until around June, when the average seasonal performance pattern suggests that bitcoin could make a pause during the summer months before continuing its ascent towards the end of the year.","Having said that, as mentioned above, seasonal performance patterns can be observed on almost any time frame.","In this context, bitcoin seems to have fared best at the beginning of the week (Monday – Wednesday) while the performance towards the end of the week and especially on weekends have historically been below-average.","Similar patterns can be observed during different trading hours: While the performance during Asian trading hours (12 am UTC – 6 am UTC) were mostly below average, European (8 am UTC – 4:30 pm UTC) and American (2:30 pm UTC – 9 pm UTC) trading hours usually show above-average performances historically. That being said, towards the end of the American trading session (9 pm UTC), Bitcoin returns have historically been the worst.","Similar intraday performance patterns can also be observed in the traditional FX market where most of the trading volumes occur during the intersection between European and American trading hours (between 2:30 pm UTC and 4:30 pm UTC).","Bitcoin trades 24\/7\/365 around the globe but fluctuations in price are ultimately a product of human action. Thus, it is no surprise that “sell in May and go away” seems to apply to Bitcoin’s return profile as well.","While Bitcoin continues to work like clockwork, its performance is ultimately determined by the time we are awake or asleep, when we start working ande when most of us are on holidays or not at work.","Tick, tock, next block.","This is not investment advice.","Edited by Benjamin Schiller."],"entity":[{"type":"nineteenth century","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"January","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"August","content":"DATE"}],"hashtag":["Opinion","Crypto Long & Short","Bitcoin Price","Trading","Institutional Adoption","institutional investor","Institutional Investments"],"authors":["André Dragosch"]}