{"summary":"The fundraising will help accelerate Backed's private tokenization offering and onboard asset managers to blockchains, the company said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/30\/tokenized-asset-issuer-backed-raises-95m-as-cryptos-rwa-race-heats-up\/","publishDate":"2024-04-30T13:00:00","id":14493,"type":null,"title":"Tokenized Asset Issuer Backed Raises $9.5M as Crypto's RWA Race Heats Up","category":["Finance"],"content":["Tokenized asset issuer Backed said Tuesday that it has raised $9.5 million in a funding round led by Gnosis.","Exor Seeds, Cyber Fund, Mindset Ventures, Stake Capital Ventures, Blockchain Founders Fund, Blue Bay Capital, and Nonce Classic also participated in the fundraising round.","With the investment, the company aims to speed up its private tokenization offering and onboard asset managers to blockchain rails, according to the press release.","The investment occurred as tokenization of real-world assets (RWA) has become one of the hottest corners of the digital asset industry with crypto firms and global banking and asset management giants racing to bring traditional financial instruments like bonds, funds or credit to blockchains.","Tokenization could offer benefits compared to traditional financial rails such as increased efficiency in settling trades, broader access for investors and lower administration burden. The market for RWAs could swell to $10 trillion by the end of the decade, asset manager 21.co's report forecasted last year.","Read more: Why Asset Tokenization Is Inevitable","Backed, based and regulated in Switzerland, offers tokenization services and has issued over $50 million worth of tokenized RWAs including ERC-20 compatible token versions of exchange-traded funds (ETF) and individual stocks such as Coinbase (COIN) and Tesla (TSLA), according to its website.","\"Global financial markets are fragmented, hindering accessibility and efficiency,\" said Youbin Kang, chief executive of Nonce Classic, one of the investors in the round. \"Backed aims to solve these issues by bringing RWAs on-chain.\"","Edited by Stephen Alpher.","\n"],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"Gnosis","content":"PERSON"},{"type":"Switzerland","content":"LOCATION"},{"type":"Mindset Ventures","content":"ORGANIZATION"},{"type":"Stake Capital Ventures","content":"ORGANIZATION"},{"type":"Youbin Kang","content":"PERSON"},{"type":"$9.5 million","content":"MONEY"},{"type":"$10 trillion","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Blue Bay Capital","content":"ORGANIZATION"},{"type":"Nonce Classic","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["investments","Tokenization","Real World Assets","Tokenized Assets"],"authors":["Krisztian Sandor"]}