{"summary":"The U.S. Department of the Treasury could have more supervision powers over crypto if Trump’s budget proposal goes through\nThe budget seeks to move the U.S. Secret Service back to the Treasury to fight crypto-related crimes\nThe proposal reveals the Trump administration’s policy priorities","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/55461\/us-treasury-could-have-more-oversight-over-crypto-if-trumps-budget-proposal-goes-through","publishDate":"2020-02-11T03:00:22","id":145,"type":null,"title":"US Treasury could have more oversight over crypto if Trump’s budget proposal goes through","category":["Cryptocurrency"],"content":["The U.S. Department of the Treasury could have more supervision powers over the crypto space if President Donald Trump’s budget proposal for the fiscal year 2021 goes through.","<a href=\"https:\/\/www.whitehouse.gov\/wp-content\/uploads\/2020\/02\/budget_fy21.pdf\" data-v-f87c67ca=\"\">Released<\/a> Monday, the $4.8 trillion budget, seeks to move the U.S. Secret Service back to the Treasury to fight crypto-related crimes such as money laundering and terrorist financing. The Secret Service, established in 1865 within the Treasury to protect presidents and combat currency counterfeiting, was transferred to the Department of Homeland Security in 2003.","“Technological advancements in recent decades, such as cryptocurrencies and the increasing interconnectedness of the international financial marketplace, have resulted in more complex criminal organizations and revealed stronger links between financial and electronic crimes and the financing of terrorists and rogue state actors. The Budget proposes legislation to return the U.S. Secret Service to Treasury to create new efficiencies in the investigation of these crimes and prepare the Nation to face the threats of tomorrow,” the proposal reads.","The proposal, however, is reportedly unlikely to get through Congress --but reveals the Trump administration’s policy priorities.","The budget “prioritizes Treasury’s role in fostering a strong economy in the United States, ensuring financial stability abroad, strengthening national security, and effectively managing the taxpayer resources,” said Treasury Secretary Steven Mnuchin in a separate statement <a href=\"https:\/\/home.treasury.gov\/news\/press-releases\/sm904\" data-v-f87c67ca=\"\">published<\/a> Monday.","Mnuchin has been vocal about rooting out bad actors in the crypto space. He once <a href=\"https:\/\/www.theblockcrypto.com\/post\/31628\/video-and-transcript-of-u-s-treasury-secretarys-press-briefing-on-cryptocurrencies\" data-v-f87c67ca=\"\">said<\/a>: “We don't want bad actors using cryptocurrency. That's our number one issue,” adding that it is a “national security issue.”","He also <a href=\"https:\/\/www.theblockcrypto.com\/linked\/32494\/us-treasury-to-ensure-cryptos-dont-become-swiss-numbered-bank-accounts-says-mnuchin\" data-v-f87c67ca=\"\">said<\/a> that “very, very strong” regulations are needed to ensure bitcoin and cryptocurrencies don’t become like anonymous Swiss bank accounts, \"which were obviously a risk to the financial system.\""],"hashtag":[]}