{"summary":"Much-hyped restaking project EigenLayer's 43-page whitepaper about its now-revealed EIGEN token has raised lots of questions. They may not matter initially, because much of the promised functionality won't be ready when the token launches.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/01\/the-protocol-eigenlayers-intersubjective-forking-is-objectively-not-done\/","publishDate":"2024-05-01T18:00:00","id":14501,"type":null,"title":"The Protocol: EigenLayer's 'Intersubjective Forking' Is Objectively Not Done","category":["Technology"],"content":["EigenLayer, the Ethereum \"restaking\" project that quickly shot to the top ranks of the DeFi leaderboards thanks to so-called airdrop farmers, finally acknowledged plans to launch its own EIGEN token. The terms of the planned airdrop – or \"stakedrop\" as Eigen Foundation described it – left many traders disappointed, especially those who failed to manage their expectations. And there were also lots of questions about how the EIGEN tokenomics will work – and when. In this week's episode, we attempt to simplify it all; readers should manage their expectations.","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Also please check out our weekly The Protocol podcast.","ALSO:","INTERSUBJECTIFYING THE FORKIFICATION: The Ethereum restaking project EigenLayer, whose plan to repurpose the Ethereum blockchain's security to hordes of additional protocols has prompted systemic risk warnings from Vitalik Buterin himself, released a 43-page whitepaper on its forthcoming EIGEN token – more than twice as long as the original 19-page whitepaper on EigenLayer. To address the concerns, the project, led by the sesquipedalian computer engineer Sreeram Kannan, came up with a new plan for something called \"intersubjective forking.\" The purpose of this mechanism would be to take care of \"instances of misbehavior that cannot be objectively identified on-chain, yet any two reasonable observers would agree that a penalty is deserved.\" If such an \"intersubjective fault\" were to occur, the EIGEN token could be forked without having to fork the main Ethereum blockchain. Are you with me so far? Well, there's a catch, according to a blog post: Very little of this will be functional when the EIGEN token launches: \"With its design being completely novel, the concept needs to be absorbed and discussed widely by the ecosystem participants. The initial implementation of intersubjective staking at this launch mirrors the full protocol to only a limited extent. However, there are still several parameters that need to be determined for full actuation.\" Such a not-really-fully-functional system would echo EigenLayer's mainnet launch a few weeks ago, where, as detailed by Coindesk, crucial promised features, including the paramount \"slashing\" and \"attributable security\" mechanisms, were held back from the launch, because they weren't ready. It goes without saying that a lot of these details were lost on crypto traders who had poured some $15 billion of deposits into the project, many of them merely hoping to qualify for the EIGEN token airdrop that roughly zero people in crypto doubted would eventually come. The parsimoniousness of the terms, however, apparently left many of these so-called airdrop farmers wanting. \"Not all feedback was glowing,\" as the Bankless newsletter put it, and complaints centered partly on the token's initial period of \"non-transferability.\" Only 15% of the tokens will go to the \"stakedrop\" – the Eigen Foundation's term – and more than half of the tokens will be allocated to investors and early contributors, with unlocks starting after just one year.","In this schematic from the EIGEN token whitepaper, \"intersubjectively attributable faults\" lies somewhere between \"objectively attributable faults\" and \"subjective faults.\"","MIXING IT UP: Ratcheting up a campaign against creators of blockchain protocols allegedly used to facilitate money laundering, U.S. prosecutors charged Samourai Wallet founders Keonne Rodriguez, 35, and William Lonergan Hill, 65, with conspiracy to commit money laundering. Rodriguez has pleaded not guilty. Samourai Wallet was (its servers have been seized) a bitcoin wallet that promised to \"keep your transactions private and your identity masked” through a privacy-preserving service called \"Whirlpool,\" as reported by CoinDesk's Daniel Kuhn. U.S. President Joe Biden's administration has ramped up efforts to knock down these coin \"mixing\" services. That includes arresting Bitcoin Fog operator Roman Sterlingov in April 2021 and participating in the arrest of the co-founders of Tornado Cash in 2023. The cases are prompting a fresh examination of the legal issues around open-source software. Is code speech? Late last week, companies behind the popular Lightning wallet Phoenix and privacy-preserving Wasabi Wallet took steps to close off access to U.S. customers – raising the additional question of whether blockchain innovation is more likely to occur outside the U.S. due to regulatory pressure or uncertainty.","Schematic illustrating basic concepts of how Samourai Whirlpool works. (Samourai)","ALSO:","Top picks of the past week from our Protocol Village column, highlighting key blockchain tech upgrades and news.","1. SEDA, a data transmission and computation network that enables a permissionless environment for developers to deploy data feeds, announced the launch of its mainnet genesis event.","2. Ocean, the Bitcoin mining pool backed by Jack Dorsey and led by longtime Bitcoin Core developer Luke Dashjr, said miners can now receive payments over the Bitcoin Lightning Network using the Lightning technology BOLT12.","3. Bitcoin layer-2 project Stacks announced a \"significant\" delay to the activation of its highly anticipated Nakamoto upgrade, citing the need for eight more weeks of development time. In a blog post, Mitchell Cuevas, who heads the Stacks Open Internet Foundation, wrote: \"Shifting dates this late in the game is not fun and I recognize this is disappointing.\"","4. Minima, a layer-1 blockchain focused on DePIN, is working with Online Payment Platform (OPP) on a project that would allow electric-vehicle drivers to rent out private chargers to other members of the public.","5. Ether.Fi, the biggest liquid restaking protocol in the Ethereum blockchain ecosystem, has integrated SSV.Network's distributed validator technology (DVT) into its platform, according to the team. \"In recent weeks, Ether.Fi has onboarded almost 2,000 validators to SSV.Network,\" according to a press release, out of about 40,000 overall.","Fundraisings","Movement Labs co-founders Cooper Scanlon and Rushi Manche (Movement Labs)","Data and Tokens","Regulatory and Policy","Predictions earlier this year that bitcoin might not see a big rally in connection with last month's quadrennial halving proved true, in hindsight. The bitcoin (BTC) price slid 15% in April, snapping a seven-month winning streak that was the longest in trading data going back to 2012.","Even so, bitcoin managed to lose less than every other coin in the CoinDesk 20 index of digital assets. The index itself fell 26%.","Amid the market selloff, NEAR held up the best among smart-contract blockchains. Aptos's APT lost 53%.","May 1-4: Bitcoin++, Austin, Texas.","May 9-10: Bitcoin Asia, Hong Kong.","May 18-27: Berlin Blockchain Week.","May 29-31: Consensus, Austin Texas.","May 29-31: Bitcoin Seoul.","June 11-13: Apex, the XRP Ledger Developer Summit, Amsterdam.","July 8-11: EthCC, Brussels.","July 25-27: Bitcoin 2024, Nashville.","Aug. 19-21: Web3 Summit, Berlin.","Sept. 19-21: Solana Breakpoint, Singapore.","Sept. 1-7: Korea Blockchain Week, Seoul.","Sept. 30-Oct. 2: Messari Mainnet, New York.","Oct. 9-11: Permissionless, Salt Lake City.","Oct. 21-22: Cosmoverse, Dubai.","Oct. 23-24: Cardano Summit, Dubai.","Oct. 30-31: Chainlink SmartCon, Hong Kong","Nov 12-14: Devcon 7, Bangkok.","Nov. 20-21: North American Blockchain Summit, Dallas.","Feb. 19-20, 2025: ConsensusHK, Hong Kong","Edited by Bradley Keoun."],"entity":[{"type":"May 29","content":"DATE"},{"type":"April 2021","content":"DATE"},{"type":"Bangkok","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Austin","content":"LOCATION"},{"type":"Devcon 7","content":"ORGANIZATION"},{"type":"Austin Texas","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Brussels","content":"LOCATION"},{"type":"Sept. 30","content":"DATE"},{"type":"Rodriguez","content":"PERSON"},{"type":"Oct. 21","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Oct. 23","content":"DATE"},{"type":"Mitchell Cuevas","content":"PERSON"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"May 1","content":"DATE"},{"type":"Keonne Rodriguez","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"13","content":"DATE"},{"type":"Stacks Open Internet Foundation","content":"ORGANIZATION"},{"type":"53%","content":"PERCENT"},{"type":"Whirlpool","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"11","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Oct. 30","content":"DATE"},{"type":"Dallas","content":"LOCATION"},{"type":"$15 billion","content":"MONEY"},{"type":"Feb. 19","content":"DATE"},{"type":"26%","content":"PERCENT"},{"type":"May 9","content":"DATE"},{"type":"June 11","content":"DATE"},{"type":"Seoul","content":"LOCATION"},{"type":"Amsterdam","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitcoin Asia","content":"LOCATION"},{"type":"July 25","content":"DATE"},{"type":"North American Blockchain Summit","content":"ORGANIZATION"},{"type":"27","content":"DATE"},{"type":"Nakamoto","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"Korea Blockchain Week","content":"LOCATION"},{"type":"Oct. 2","content":"DATE"},{"type":"Samourai Whirlpool","content":"ORGANIZATION"},{"type":"24","content":"DATE"},{"type":"Cardano Summit","content":"ORGANIZATION"},{"type":"hindsight","content":"LOCATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Oct. 9","content":"DATE"},{"type":"22","content":"DATE"},{"type":"21","content":"DATE"},{"type":"Cooper Scanlon","content":"PERSON"},{"type":"Dubai","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Rushi Manche (Movement Labs)","content":"ORGANIZATION"},{"type":"William Lonergan Hill","content":"PERSON"},{"type":"Joe Biden","content":"PERSON"},{"type":"Eigen Foundation","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"July 8","content":"DATE"},{"type":"May 18","content":"DATE"},{"type":"Sept. 1","content":"DATE"},{"type":"Phoenix","content":"LOCATION"},{"type":"Sept. 19","content":"DATE"},{"type":"Nashville","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Berlin Blockchain Week","content":"LOCATION"},{"type":"31","content":"DATE"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"20, 2025","content":"DATE"},{"type":"XRP Ledger Developer Summit","content":"ORGANIZATION"},{"type":"Aug. 19","content":"DATE"},{"type":"Nov. 20","content":"DATE"},{"type":"Salt Lake City","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["The Protocol","EigenLayer","DeFi","Arbitrum","Samourai Wallet"],"authors":["Bradley Keoun"]}