{"summary":"Cryptocurrency individual retirement account (IRA) firm Bitcoin IRA has partnered with Genesis Capital to allow retirement account holders to earn","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/43895\/bitcoin-ira-genesis-capital-launch-lending-program-of-ira-holdings","publishDate":"2019-10-21T06:54:53","id":1450,"type":null,"title":"Bitcoin IRA, Genesis Capital launch lending program of IRA holdings","category":["BITCOIN"],"content":["<span data-v-f87c67ca=\"\">Cryptocurrency individual retirement account (IRA) firm Bitcoin IRA has partnered with Genesis Capital to allow retirement account holders to earn interest on their cryptocurrency and cash holdings.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Announced on Monday, the partnership enables Bitcoin IRA users to lend out their assets through cryptocurrency lending firm Genesis Capital and earn interest. The lending program is set to begin in November and will accept bitcoin (BTC), ether (ETH), litecoin (LTC), and privacy-oriented cryptocurrency zcash (ZCASH) at launch.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Bitcoin IRA, interest earned from lending will be paid monthly and deposited directly to users’ retirement accounts. <\/span>","<span data-v-f87c67ca=\"\">Although interest rates and other details of the lending program are yet to be announced, <\/span><span data-v-f87c67ca=\"\">Bitcoin IRA COO and co-founder Chris Kline pointed out that “interest earned by a client can offset trading fees or custodial holding fees, essentially creating a free account making these fees a thing of the past.”<\/span>","<span data-v-f87c67ca=\"\">Founded in 2015, Bitcoin IRA provides retirement accounts that can purchase cryptocurrencies. According to a statement, the firm has signed up over 4,000 clients and proceeded over $350 million transactions since 2016.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Recently, Bitcoin IRA <\/span><a href=\"https:\/\/www.coindesk.com\/bitcoin-ira-bitgo-launch-ira-composed-entirely-of-crypto\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">partnered<\/span><\/a><span data-v-f87c67ca=\"\"> with cryptocurrency custodian BitGo to provide self-directed cryptocurrency IRA. Bitcoin IRA and BitGo were entangled in a<a href=\"https:\/\/www.theblockcrypto.com\/post\/37816\/kingdom-trust-sues-competitor-bitgo-and-bitcoin-ira-for-allegedly-using-its-trade-secrets-to-steal-clients\" data-v-f87c67ca=\"\">&nbsp;lawsuit<\/a> with another custodian, Kingdom Trust, over allegedly stealing Kingdom Trust's clients. However, the lawsuit <a href=\"https:\/\/www.theblockcrypto.com\/post\/43874\/kingdom-trust-federal-court-bitcoin-ira-lawsuit-dismissed-for-lack-of-jurisdiction\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">was dismissed<\/a> in federal court last week for lack of jurisdiction.<\/span>","<span data-v-f87c67ca=\"\">Meanwhile, Genesis Capital, a Digital Currency Group company that focuses on institutional lending, has seen a record-breaking Q2. The firm has originated $746 million cryptocurrency and cash loans in the past quarter and has in total $2.3 billion loans since its inception, according to the statement.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2015","content":"DATE"},{"type":"$350 million","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"$2.3 billion","content":"MONEY"},{"type":"Bitcoin IRA","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"Kingdom Trust","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"IRA","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$746 million","content":"MONEY"},{"type":"LTC","content":"ORGANIZATION"},{"type":"Chris Kline","content":"PERSON"}],"hashtag":[],"authors":["Celia Wan","The Block"]}