{"summary":"Shrapnel, a blockchain-infused first-person shooter game, is expected to be released in 2025. Its creator gives a preview to Jeff Wilser ahead of his appearance at Consensus 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/30\/its-modding-but-on-steroids-mark-long-on-the-future-of-web3-gaming\/","publishDate":"2024-04-30T15:36:39","id":14507,"type":null,"title":"‘It's Modding, But on Steroids’: Mark Long on the Future of Web3 Gaming","category":["Interview"],"content":["Web3 games have a shaky track record. It’s easy to see the appeal: There are literally billions of people playing games, and most of them do it for free. They spend countless hours — and often their own cash — to create content that grows the ecosystem, and they get nothing while the gaming companies get everything. Web3 games, in theory, give power (and equity) to the players.","Or, that was the pitch in the last bull cycle, when Web3 games like Axie Infinity seemed to create new economies and even lift players from poverty. Then prices tumbled, games crumbled. Can Web3 games make a comeback?\n\nMark Long is a speaker at Consensus 2024, in Austin, Texas, May 29-31.","Now at least one thing is different: Top-tier gaming talent has entered the Web3 space, focused on creating games that are actually a blast to play, not just a means to grind out crypto. “It’s very important that it’s a great game, period, whether for Web2 or Web3,” says Mark Long, CEO of Shrapnel, the blockchain-infused and “moddable” first-person shooter game, which is expected to be released in 2025. (Modding refers to the ability of gamers to modify aspects of the game experience.)","Long knows about building great games. He’s the former head of Xcloud, a game-streaming service, at Microsoft, the former head of publishing at HBO Interactive, and he’s produced over 32 games in his 26-year career. And now he’s bringing that savvy to Web3. Long opens up about the extra challenges in creating a Web3 game (the wrong tweak to a database can cost players millions), what gamers can expect from Shrapnel (“modding on steroids”), and why he views Consensus as the most “scholarly” crypto conference.","Interview has been condensed and lightly edited for clarity.","What’s the vision of Shrapnel? What are you trying to pull off?","Mark Long: So, I love triple-A shooters. I just love all shooters; I play all of them all the time. But what I love more is actually modding shooters. And I mean, going all the way back to Doom 2 and Quake and Half-Life.","You're speaking my language. I still remember the keyboard shortcut to pull up the shotgun in Doom.","Yes! So even though I was making games in the studio during the day, at night I would come home and mod those type of games. And if I got 11 people to play my map, I'd be thrilled. Right? Which is ridiculous because I'm making games for millions of players. But this is something very personal. I get a personal joy from modding a game that I really like.","So, fast forward to the Roblox, Minecraft, Fortnite era. Kids start off making their own content in Minecraft, and they age into Roblox, and so they become more proficient. And with Fortnite, 50% of the engagement is made by other players, which is stunning. But when you turn 18 to 35 years old, there's nothing for you to age into.","And I don't think young players are going to stop wanting to make their own games. And our theory is if you gave them the same professional level of tools that we have, they'd actually make some pretty cool shit. So, that's what Shrapnel is. It's an extraction first-person shooter based on Web3. And it’s a free, frictionless database technology that allows us to seamlessly attribute all these contributions that players can make to a game, and then reward them for it.","How so?","You’ll be rewarded for your contribution. And in our world, that can be a lot of things. You can modify our maps — just use all our static meshes and modify them. You can do character skins. You can do character customization. Make emblems, customize weapons. And then, of course, you just mint those. And then I could sell, trade, rent, stake all those items. That's what I'm really excited about. It's modding, but on steroids.","Let’s talk about Web3 gaming more broadly. Taking Shrapnel out of the equation, why do you think there haven’t yet been any great Web3 games?","So, all these games were put into production in the last bull cycle, right? And they’re just now coming to the public in early access or open beta. But I'd argue there are a handful of really good games out there that I'm excited to play. There’s MetalCore, the mech shooter. There's Wildcard, the card-battler game by the husband and wife team that did Words with Friends. I like Dead Drop. I like Off the Grid, which has art direction by Neill Blomkamp. I fucking love Neill Blomkamp. So the short version is there are a handful of games that actually are going to be really good and break through, and then of course there’s Shrapnel.","Fair enough! There are some good games. But those seem to be the outliers.","I think part of your lament for the earlier Web3 games is because of two reasons: A lot of the teams are not game development teams, they're crypto development teams. Right? And two, it’s production values. They haven’t had the money to put into the game to make it really great.","What’s extra challenging about building a Web3 game, compared to a traditional video game? What are the additional wrinkles caused by decentralization?","Great question. I want to start by saying that it’s very important that it’s a great game, period, whether for Web2 or Web3. It’s easy to lose track of that. But to answer your question, one simple thing comes to mind. Think about working on a database in a game. Think about, for example, all the items I can collect for my character — my gear, my helmet, my weapon, all that stuff. You have a pretty complex database and it has to provide for all this attribution. If I make a mistake in normal development, you just reset the database and then start over again.","But here with web3, that has real-world value. Right? So if we fuck up and I delete your $1,000 worth of stuff, I can't claim that I'm World of Warcraft and you never really owned it anyway. That’s a huge problem. So we have to be especially meticulous as we integrate any Web3 component. Then there’s the problem of potential exploits — things that we miss could create a disaster for the economy. It takes longer to integrate the Web3 component. The code has to be audited at a level that game code never normally needs to be audited. That was all brand new to us. It slows down our roadmap. But as we get better at it and there’s more tooling APIs and SDKs available, it will just get better and better.","For many who are only casually following the Web3 gaming space, they’ve heard of the boom-and-bust cycle of “Play to Earn.” There are concerns that this model is not sustainable — it only works when the token price is rising, but then, if the price falls, the economy collapses. What’s the solve for this? What’s the trick for making Web3 games viable for the long-term, and not relying upon price appreciation?","So I would probably guess that for the economies that you’re thinking about that collapsed, they’re kind of pyramid economies where you have to have a large number inflowing at the bottom, and they grind and level-up assets or characters that then get sold to the person above them who’s also grinding. You need lots coming in at the bottom to do that. And then when the community collapses or the token price collapses, nobody's playing because it's a fun game — they’re there to make money off it. So they abandon it.","Ah, so the trick is the game quality itself…","What we think will happen in game economies like Shrapnel is the more players you have, and the more engagement you have, the more they’re using the token in-game. That’s driving the need for the token and it kind of has a burn effect. It’s consuming the supply, and that means there's more buy pressure than sell pressure.","If I hear you right, it sounds like you’re saying there needs to be actual legit utility in these tokens. It’s not sham utility. People are using it. They're using it because they want to play the game and have fun. So the game needs to be good, period. Am I getting that right?","Yeah. Let's just use a rough order of magnitude example. The average paying player in Web3 might be $100 a month versus $10 a month on Web2. So every one of those new Web3 players adds $100 of consumption. Remember, the economy is in the token, so they are spending $100 of the token.","Okay, last couple of questions are about Consensus itself. What’s your favorite Consensus memory?","Well, you know, last year we demoed the game for the first time at Consensus. We were right at one of the main entrances, and by the end of the first day, they had just moved the bar to our space because so many people wanted to play the game, and were excited to get their hands on it.","What are you most looking forward to at Consensus this year?","It’s a really well-curated conference. I would call it a scholarly conference, where the panels are well-vetted.","Love it, and thank you. On a less scholarly front, what’s the best Consensus side-party?","It'll be ours.","Good answer. See you there!","Edited by Benjamin Schiller."],"entity":[{"type":"2025","content":"DATE"},{"type":"Fortnite","content":"PERSON"},{"type":"May 29","content":"DATE"},{"type":"Minecraft","content":"LOCATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"$10","content":"MONEY"},{"type":"Austin","content":"LOCATION"},{"type":"$1,000","content":"MONEY"},{"type":"31","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"Texas","content":"LOCATION"},{"type":"Roblox","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Neill Blomkamp","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"HBO Interactive","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Mark Long","content":"PERSON"}],"hashtag":["Consensus 2024"],"authors":["Jeff Wilser"]}