{"summary":"The social application was one of the biggest blockchain-based platforms by revenue for a short period last year before usage dropped off. A new version is bringing the hype back.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/10\/friendtech-money-metrics-surge-ahead-of-potential-airdrop-v2-release\/","publishDate":"2024-04-10T08:27:24","id":14520,"type":null,"title":"Friend.Tech Money Metrics Surge Ahead of Potential Airdrop, V2 Release","category":["Markets"],"content":["Money is flowing back into social application Friend.Tech as a new version teases an eventual airdrop, bringing users back to what was among the biggest revenue-generating platforms during the bear market.","Over $7 million flowed to Friend.Tech last week after months of outflows, boosting the value locked to nearly $40 million, data shows. Weekly fees have crossed $1.3 million for the first time since November, making the platform over $600,000 in revenue.","Built on Base, a layer-2 network, Friend.Tech lets crypto personalities on X issue “shares” for access to a closed group chat. For users, the allure of these chats is that their owners could offer trading insights, token picks or access to seed-funding deals – which raises the value of the shares.","The bump in activity precedes the coming of version 2 of the application, which developers said will be released after April 20. A key element of the update is expanding the platform beyond X to attract newer users.","Over the weekend, developers also teased a FRIEND token. Expectations among users are that these could be distributed based on how many points – a reward for Friend.Tech usage – they accumulate before the token release.","Friend.tech was earning in excess of $1 million per day in fees at its August peak after going viral on X and gaining more than 100,000 unique users, a significant number for crypto application standards. Shares of some crypto X personalities, such as @Cobie and @HsakaTrades, jumped to as much as three ether, or nearly $5,000, at the time.","Activity fell off in the months following as the initial allure wore off. Security risks later marred the platform alongside opportunities elsewhere in the sector, leading to months of outflows since November.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"last week","content":"DATE"},{"type":"$5,000","content":"MONEY"},{"type":"$40 million","content":"MONEY"},{"type":"$7 million","content":"MONEY"},{"type":"$1.3 million","content":"MONEY"},{"type":"$600,000","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"November","content":"DATE"},{"type":"August","content":"DATE"}],"hashtag":["Trading","Investing","Markets","Social Media"],"authors":["Shaurya Malwa"]}