{"summary":"Today, offshore firms dominate the list of the biggest cryptocurrency exchanges. Expect the center of gravity to come onshore going forward, says Paul Brody, head of blockchain at EY.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/30\/cryptos-transition-bringing-capital-onshore\/","publishDate":"2024-04-30T16:02:38","id":14522,"type":null,"title":"Crypto’s Transition: Bringing Capital Onshore","category":["Opinion"],"content":["The world of cryptocurrencies and digital assets is currently in transition from a largely unregulated world of innovation into a much more regulated and structured world of large companies and organized product offerings.","The opportunity for blockchain-based digital assets is enormous because, large though they might seem, offshore assets are a pretty small share of total global assets.","Paul Brody is EY's global blockchain leader and a CoinDesk columnist.","It is estimated that there are about $700 trillion of global financial and business assets on planet earth. That includes roughly $100 trillion in global stock markets, another $100 trillion in bonds, another $100 trillion in bank deposits, and over $350 trillion in real estate, and that’s just what you need to buy a two-bedroom condo in San Francisco. Of that, the blockchain ecosystem is about $2 trillion in total and there’s another roughly $20 trillion in commodities.","Of this approximately $700 trillion, about $685 trillion is considered an “onshore” asset – that is, they are held by people and entities that are officially and accountably residents in the countries in which they operate or exist. Estimates by the Organization for Economic Cooperation and Development (OECD) put all the offshore assets at around $12 trillion. That’s a lot of money, but in the context of global assets, it’s a drop in the ocean, less than 2% of the total. Right now, that 2% is relatively lightly, or not at all regulated and a fair chunk of that is cryptocurrencies.","As much money as that is, it’s not a big deal compared to the vast quantities of money that reside onshore in structured, regulated markets. Much of the world’s liquid assets are managed by regulated institutions. CalPERS, the California state employee pension fund, has nearly $500 billion under management alone. TIAA-CREF, which represents about 5 million active and retired teachers in the U.S., has another $1.3 trillion in assets. That’s more than the entire crypto-asset market today, and neither firm can make sizable investments that aren’t highly regulated.","As the world of blockchain-based digital assets becomes structured and regulated, that opens up a flood of capital and will transform the industry. Based on the data available, we’re still very clearly in the early stages of this transformation. Of the top 10 crypto exchanges, seven are based in offshore environments like the Seychelles or British Virgin Islands, and they represent 80% of current spot crypto volume (as of 21 February per CoinGecko).","If you go and read reports about asset allocation, you can’t even find a category that is crypto-focused. A few European pension funds do have explicit allocations for commodities and precious metals, but the overwhelming majority of assets being managed still fall into some basic categories such as stocks, bonds, and real estate. We have, in other words, barely scratched the surface of likely future allocations to digital assets and cryptocurrencies.","To be clear, we should not confuse less-regulated or offshore money with criminal activity. These are not the same, though some might like to conflate the two. However, we should expect that as the scope of regulatory control grows, most of the net new growth in transactions and volumes is likely to come from onshore enterprises doing business with regulated peers in pension funds, banks, and private equity.","This doesn’t mean that the offshore component of the business is going away or likely to fail, but it does mean that onshore, regulated firms are likely to be the main beneficiaries of the next wave of growth. And for companies in this space, it has never been more important to be engaged in local markets with local regulators.","The challenge here exists for much of the world’s biggest cryptocurrency exchanges: nearly all of them are based in offshore markets like the Seychelles, the Bahamas, Virgin Islands, for example. Today, offshore firms dominate the list of the biggest cryptocurrency exchanges. My guess is that this won’t last.","As regulation matures, the center of gravity for exchanges is going to migrate from offshore to onshore. Right now, there is nearly no-overlap between these offshore and onshore ecosystems – what I mean is that almost no companies offering offshore services have also successfully navigated onshore regulatory rules and established themselves in those markets.","The transition ahead, then, isn’t just where the center of gravity will be; it will also be where the dominant industry players are focused. For firms that top the leaderboard today, the challenge is clear: get into onshore, regulated markets, or see your relevance shrink in the future.","Edited by Benjamin Schiller."],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"$20 trillion","content":"MONEY"},{"type":"$2 trillion","content":"MONEY"},{"type":"80%","content":"PERCENT"},{"type":"$700 trillion","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"the Bahamas","content":"LOCATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"CREF","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Seychelles","content":"LOCATION"},{"type":"Paul Brody","content":"PERSON"},{"type":"$12 trillion","content":"MONEY"},{"type":"$100 trillion","content":"MONEY"},{"type":"$350 trillion","content":"MONEY"},{"type":"California","content":"LOCATION"},{"type":"$1.3 trillion","content":"MONEY"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"$500 billion","content":"MONEY"},{"type":"Virgin Islands","content":"LOCATION"},{"type":"$685 trillion","content":"MONEY"},{"type":"TIAA","content":"ORGANIZATION"},{"type":"Organization for Economic Cooperation and Development (OECD","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion"],"authors":["Paul Brody"]}