{"summary":"The two entities addressed concerns about large sales in the past and said there needs to be change in the future.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/206507\/secret-labs-and-secret-foundation-battle-it-out-openly","publishDate":"2023-01-29T08:00:15","id":1453,"type":null,"title":"Secret Labs and Secret Foundation battle it out openly","category":["CRYPTO ECOSYSTEMS"],"content":["Guy Zyskind, founder and CEO of Secret Labs, raised a number of questions around the past operations of the Secret Foundation and its founder Tor Bair. Both entities support the Secret Network, a privacy-focused blockchain in the Cosmos ecosystem.","Zyskind raised allegations around a lack of transparency from the foundation, an alleged mishandling of an OTC sale that incurred a loss of about $250,000 and a potential open loan to collapsed trading firm Alameda. The concerns were raised in a <a href=\"https:\/\/forum.scrt.network\/t\/an-update-and-disclosure-concerning-secret-foundations-financial-transparency\/6762\" data-v-f87c67ca=\"\">post<\/a> on the Secret Network governance forum.","He asserted that in 2021 the Secret Foundation sold a large amount of secret tokens and that Bair cashed out a significant part of them without disclosing this to the community.&nbsp;","On the back of the claims, Zyskind called for the foundation to be restructured as a non-profit, return all of its current funds to the community and then be required to apply for grants to carry out activity supporting the ecosystem.","A restructuring proposal is being crafted by the community and will be presented in the next few days, Zyskind told The Block.","Bair confirmed that he sold $2.6 million of secret tokens in 2021, in a <a href=\"https:\/\/forum.scrt.network\/t\/secret-foundation-update-and-disclosure\/6763\" data-v-f87c67ca=\"\">response<\/a> posted to the same governance forum. He said that he received token compensation that was subject to vesting periods and sold the tokens once they had been vested.","He noted that the foundation regularly issued transparency reports that did not contain token compensations for any employee, including his own. He also noted that his token sales were disclosed in its 2021 tax filings, which he claimed had been reviewed by Labs.","Bair acknowledged that it’s time for the foundation to make changes. He suggested this could include restructuring the entity or establishing a global board. He also said there should be standards set for compensation and transparency going forward.","He did not address the alleged loan to Alameda.","As for the mishandled OTC sale, Bair had previously <a href=\"https:\/\/forum.scrt.network\/t\/disclosure-of-june-2021-otc-event-secret-foundation\/6701\" data-v-f87c67ca=\"\">disclosed<\/a> this on the governance forum. In December, he said the foundation attempted to make an OTC sale of $200,000 of secret tokens. It was scammed by a counterparty who impersonated a legitimate venture capitalist to arrange the sale and also impersonated Bair on Telegram to get the funds released from the escrow account.","Bair said that the foundation had chosen to not disclose this situation when it happened 18 months prior to his post.","Bair declined to comment for this story.","<em data-v-f87c67ca=\"\">Update: Added a comment from Zyskind.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$250,000","content":"MONEY"},{"type":"Tor Bair","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$2.6 million","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"Bair","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Secret Foundation","content":"ORGANIZATION"},{"type":"$200,000","content":"MONEY"},{"type":"Zyskind","content":"PERSON"},{"type":"Secret Network","content":"ORGANIZATION"},{"type":"Zyskind","content":"LOCATION"}],"hashtag":["COSMOS"],"authors":["Tim Copeland","The Block"]}