{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of May 2-8.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/02\/protocol-village\/","publishDate":"2024-05-06T13:27:46","id":14530,"type":null,"title":"Protocol Village: Volta, Creator of Multisig Non-Custodial Platform, Raises $4.1M","category":["Technology"],"content":["May 5: Volta, creator of Volta Circuit, a multi-signature non-custodial platform for institutional investors to secure digital assets, secured $4.1 million in seed funding from Fika Ventures and Haven Ventures, alongside support from Soma Capital, Dispersion Capital and Uphonest Capital. \"Volta Circuit embraces open signature standards, rendering the platform wallet-agnostic. This feature allows any wallet to integrate rules and permission controls, offering users the flexibility to tailor their wallet solutions according to their preferences,\" according to a press release. Volta was co-founded by George Melika, previously co-founded sFOX, and Daniel Kim, who led the growth of Maple Finance.","May 5: Jesse Pollak, who oversees the crypto exchange Coinbase's layer-2 network, Base, unveiled a new incentives campaign, \"Onchain Summer II,\" with more than 600 ETH ($2 million) of prices, grants and gas credits offered by the project and its ecosystem partners. \"Onchain Summer will kick off with a month-long online hackathon hosted by Base and partners,\" according to the post. \"Base is collaborating with teams across the ecosystem, including Coinbase, to enable tools for Onchain Summer builders,\" including easier wallet onboarding with Coinbase's new smart wallet recently launched on Base Sepolia testnet and \"seamless user experiences\" with account abstraction.","May 5: Aave Labs, the main developer behind Aave, a DeFi protocol, proposed to develop its \"V4\" as part of a wider grant proposal, involving community feedback and testing, with a timeline starting this quarter and leading to a full release by mid-2024. \"Aave V4 would be built with a completely new architecture with an efficient and modular design, while minimizing the impact on third-party integrators,\" the proposal reads. A key change would be the introduction of a \"unified liquidity layer\" and a new oracle design with Chainlink. (AAVE) (LINK)","May 5: MicroStrategy (MSTR), the largest corporate holder of bitcoin, unveiled plans to develop a decentralized identity service using Ordinals inscriptions. The goal of \"MicroStrategy Orange\" is to provide \"trustless, tamper-proof and long-lived\" decentralized identities using the Bitcoin blockchain, founder Michael Saylor said at the company's Bitcoin For Corporations conference on Wednesday. Orange harnesses Bitcoin's Ordinals Protocol. MicroStrategy has already built one application using its service called \"Orange For Outlook,\" which integrates digital signatures into emails to enable recipients to verify the identity of the sender. An unofficial draft describing the project was posted on MicroStrategy's GitHub page.","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","May 2: Polyhedra Network launched an open-source ZK proof system, Expander, \"that can generate proofs nearly 2x faster than alternatives while enhancing security and efficiency of ZK proof process,\" according to the team: \"Expander represents a new era in scaling ZK-proof tech and combines classical interactive proofs, establishes truth of a process and that it can be executed, with advanced polynomial commitment schemes that ensure proof is accurate and can't be changed once created. It follows Polyhedra’s recent partnership with Google Cloud where they are collaborating on Polyhedra’s ZK tech to all Google Cloud services via Proof Cloud.\" According to a blog post, \"Expander can prove 4,500 Keccak-f permutations per second on an Apple M3 Max Machine.\" Keccak-256 is a \"cryptographic hash function standardized by NIST in the secure hash algorithm 3 (SHA-3) and is the hash function used by the Ethereum blockchain,\" according to the post. The new proof system builds on Polyhedra's Libra paper, lead-authored by Polyhedra co-founder and CTO Tiancheng Xie.","May 2: Eclipse, an Ethereum layer-2 network powered by Solana Virtual Machine (SVM), said it is the \"first to break the EVM-SVM compatibility barrier\" with the deployment of Neon Stack, developed by the core Neon EVM team, according to a press release. Neon Stack is \"a standardized development stack that makes it easy for SVM-based blockchain networks to gain EVM compatibility for smart contract developers, which Eclipse will utilize on its SVM L2.\"","May 2: BOB (Build on Bitcoin), a hybrid layer-2 solution merging Bitcoin and Ethereum capabilities, has launched its mainnet, according to the team: \"Supported by leading crypto investors such as UTXO and CMS Holdings, BOB is advancing Bitcoin's relevance in the DeFi space by making Bitcoin assets like Ordinals, Runes and BRC20s accessible to ETH and other Web3 users. With the UX for Bitcoin DeFi still very limited, BOB aims to be the best place to start experimenting with Bitcoin L2. Notable projects deploying on BOB include Sovryn, Velodrome and Layerbank.\"","May 2: The Graph Foundation, stewarding core devs of The Graph Network, announced its Sunrise Upgrade Program, beginning May 2. The community-driven program will aid in The Graph’s pursuit to democratize data via a variety of “missions” that reward participants completing on chain and off chain activities. The Graph Foundation has committed up to 4M GRT (approx. $1.2M USD as of April 29), to recognize and reward participants for their contributions by completing missions in the program. (GRT)","May 2: Nibiru Chain, a secure smart contract platform that simultaneously addresses decentralization, security and scalability, announced its expansion into the Asia region, appointing Yura Nam, an ex-head of StarkNet Asia, to lead Asia growth, and Nicholas Lo, a former APAC Growth Manager at Bored Ape Yacht Club developer Yuga Labs, to oversee Asia business development.","May 2: Resonance, a provider of blockchain and smart-contract audits, announced a pre-seed fundraising of $1.5 million from Arca, Fabric and Blockchain Founders Fund, according to the team: \"The company’s initial raise will fuel a rapid expansion that has proceeded at an exponential rate since launching in March 2023.\" Resonance launched V1 in March after \"a highly successful beta phase that resulted in engagements with major Web2 and Web3 projects,\" according to the project.","May 2: Lukso, an EVM-compatible blockchain designed for the new creative economy, announces the launch of a new grant program designed to cultivate a vibrant ecosystem of user-centric, social and creative projects built on Lukso. The first application wave of the Lukso Grants Program is backed by $1 million, which will be followed by subsequent quarterly application waves.","May 2: Untangled Finance, a tokenized real-world asset (RWA) platform backed by Fasanara Capital, opened its first private credit pool on the Celo (CELO) network on Thursday with French fintech lender Karmen. The pool, structured under Luxembourg's securitization regulations with a debt ceiling of $6 million at the start, lets accredited investors deposit the USDC stablecoin and will provide capital to Karmen, which specializes in providing instantaneous loans and working capital to small and medium-sized digital enterprises in France, according to a press release. Institutional asset manager Fasanara Capital and The Credit Collective, a Celo community-led ecosystem development organization, were early investors in the facility.","Edited by Bradley Keoun.","\n"],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"Layerbank","content":"ORGANIZATION"},{"type":"Karmen","content":"LOCATION"},{"type":"Keccak","content":"PERSON"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Daniel Kim","content":"PERSON"},{"type":"Bitcoin DeFi","content":"ORGANIZATION"},{"type":"Untangled Finance","content":"ORGANIZATION"},{"type":"BOB","content":"ORGANIZATION"},{"type":"StarkNet Asia","content":"ORGANIZATION"},{"type":"Fika Ventures","content":"ORGANIZATION"},{"type":"Yura Nam","content":"PERSON"},{"type":"Volta","content":"LOCATION"},{"type":"May 2","content":"DATE"},{"type":"The Graph Foundation","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"CTO Tiancheng Xie","content":"ORGANIZATION"},{"type":"APAC Growth Manager","content":"ORGANIZATION"},{"type":"Volta Circuit","content":"ORGANIZATION"},{"type":"March 2023","content":"DATE"},{"type":"Apple M3 Max Machine","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Uphonest Capital","content":"ORGANIZATION"},{"type":"Bitcoin For Corporations","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Dispersion Capital","content":"ORGANIZATION"},{"type":"Polyhedra Network","content":"ORGANIZATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"France","content":"LOCATION"},{"type":"Neon Stack","content":"ORGANIZATION"},{"type":"Karmen","content":"PERSON"},{"type":"$1.2","content":"MONEY"},{"type":"Sovryn","content":"LOCATION"},{"type":"Asia","content":"LOCATION"},{"type":"April 29","content":"DATE"},{"type":"The Graph Network","content":"ORGANIZATION"},{"type":"Haven Ventures","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"CMS Holdings","content":"ORGANIZATION"},{"type":"Polyhedra","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"Graph Foundation","content":"ORGANIZATION"},{"type":"$6 million","content":"MONEY"},{"type":"$4.1 million","content":"MONEY"},{"type":"Onchain Summer","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"M USD","content":"ORGANIZATION"},{"type":"Solana Virtual Machine (SVM","content":"ORGANIZATION"},{"type":"Nicholas Lo","content":"PERSON"},{"type":"Maple Finance","content":"ORGANIZATION"},{"type":"MicroStrategy Orange\"","content":"ORGANIZATION"},{"type":"$2 million","content":"MONEY"},{"type":"Fasanara Capital","content":"ORGANIZATION"},{"type":"George Melika","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"NIST","content":"ORGANIZATION"},{"type":"Soma Capital","content":"ORGANIZATION"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Nibiru Chain","content":"ORGANIZATION"},{"type":"Bitcoin's Ordinals Protocol","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Luxembourg","content":"LOCATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}