{"summary":"Non-custodial crypto wallet provider ZenGo has raised $20 million in a Series A funding round.\nWith fresh capital at hand, ZenGo plans to launch a Visa payments card and add crypto trading and savings features to its wallet.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/102974\/non-custodial-crypto-wallet-zengo-20-million-series-a","publishDate":"2021-04-27T09:00:40","id":1453,"type":null,"title":"Non-custodial crypto wallet ZenGo raises $20 million in Series A funding","category":["Venture Capital"],"content":["ZenGo, a non-custodial crypto wallet provider based in Israel, has raised $20 million in a Series A funding round.","The round was led by Insight Partners, with participation from Distributed Global, Austin Rief Ventures, and other existing investors. ZenGo CEO Ouriel Ohayon told The Block that Distributed Global is a crypto fund that is essentially funded by Singapore state investor Temasek.","With fresh capital at hand, ZenGo plans to launch a Visa payments card and add crypto trading and savings features to its wallet.","The card will be launched \"in about a quarter,\" Ohayon told The Block, adding that it would be the first card associated with a non-custodial or self-hosted wallet.","ZenGo uses multi-party computation-based \"Keyless Wallet technology\" that replaces the traditional crypto private key with two independently created mathematical secret shares and keeps users in control of their funds.","Ohayon said ZenGo has grown in popularity this year as the firm added 100,000 customers in the first quarter alone. The firm now has over 200,000 customers, and its top five markets are the U.S., Canada, France, Nigeria, and Australia, Ohayon told The Block.","As for the planned trading and savings features to be offered through the wallet, Ohayon said ZenGo would add liquidity providers and payment gateways to enable users to buy, sell and swap cryptocurrencies.","ZenGo is also planning to add support for more coins and tokens to its wallet across blockchains. The wallet currently supports over 50 crypto-assets on several blockchains, including Bitcoin and Ethereum.","In light of the expansion plans, ZenGo plans to double its headcount from the current 20 people to 40 in the near future, Ohayon told The Block. The firm is hiring across engineering, product, marketing, and other functions.","Insight Partners leading ZenGo's Series A is notable since it is the venture firm's first crypto investment. Daniel Aronovitz, Insight Partners' lead in Isreal, has also joined ZenGo's board of directors, Ohayon told The Block.","The Series A brings ZenGo's total funding to date to $24 million. In 2019, the firm <a href=\"https:\/\/www.theblockcrypto.com\/daily\/20008\/zengo-raises-4m-to-bring-keyless-crypto-wallets-to-mainstream-users\" data-v-f87c67ca=\"\">raised $4 million in a seed funding round<\/a>. Ohayon declined to comment on ZenGo's current valuation."],"hashtag":["SERIES A"]}