{"summary":"More people are calling for crypto companies and those behind products such as stablecoins to prove they have enough funds to pay their customers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-fully-backed-reserves\/","publishDate":"2022-11-22T23:04:02","id":14533,"type":null,"title":"What Are 'Fully Backed' Reserves?","category":["Learn"],"content":["Regular banks do not actually hold all of your money. They lend out most of your deposits in an attempt to eke out returns from financial markets. This works, for the most part, because the bank insures deposits with the federal government and because the bank widely diversifies its exposure to risk to ensure that it won’t be caught short in the event of a financial crash.","This system occasionally fails in traditional finance (see: Lehman) but fails frequently in crypto. The government does not insure deposits to crypto platforms and the platforms often do not manage risk particularly well (see: FTX, Voyager Digital, Celsius Network), making high-risk bets that end in catastrophe.","Read More: Proof of Reserves: Could it Have Prevented the FTX Meltdown?","After so many platforms squandered customer funds, crypto traders are thinking twice about depositing funds to crypto exchanges and lending institutions that “rehypothecate” uninsured deposits – which means they repurpose customer money and lend the funds out in the markets. A safer bet looks like trading on platforms that “fully back” their reserves. But what does this really mean, and should such claims be taken with a pinch of salt?","When a financial product, such as a stablecoin or depositary institution, claims to “fully back” its reserves, it means that it has stored enough money behind a product, like a stablecoin or a customer’s trading account, to support its worth.","So, a crypto exchange that “fully backs” its reserves should always be able to pay out customer withdrawals, no matter the state of the market. One such example is Coinbase, which does not lend out its customers’ funds without their express permission, meaning it should always have enough money on hand to prevent a bank run.","A stablecoin that “fully backs” its reserves is always able to fulfill conversions to the original asset, no matter what. One example is wBTC, or wrapped bitcoin, which holds real bitcoin (BTC) in a cold wallet, then issues an equal amount of an Ethereum-based version of the coin that trades as an ERC-20 token.","Fully backed, however, does not necessarily mean that assets are held one to one. That claim refers to the idea that if you, say, give me a dollar, I’ll hold that dollar as a dollar and won’t turn it into something else. Lots of stablecoins that claim to be fully backed, like U.S.-dollar stablecoin USDC, are not backed one to one.","This is because the companies that issue USDC hold the deposits of real U.S. dollars in “cash and cash equivalents.” Cash equivalents refer to U.S. Treasury bonds, which is debt issued by the U.S. Treasury Department. These bonds, which pay small returns to holders over time, are close enough to the worth of actual U.S. dollars that the market accepts bonds being essentially worth the same.","But “fully backed” does not always mean that the backing can withstand financial shocks. U.S. dollar stablecoin tether (USDT) also claims that its reserves are fully backed, but this backing is secured by “other assets and receivables from loans made by Tether [the issuing company] to third parties.” So, USDT may be fully backed, but it is partially backed by loans to other crypto companies.","Until October 2022, USDT was also backed by commercial paper – short-term commercial debt to other companies – and moved those funds to U.S. Treasurys. The concern about the commercial paper was that nobody knew which companies Tether was using to back USDT, so it was impossible to determine the worth of that backing. What’s more, its “fully backed” claim has historically turned out not to be true after it emerged in 2019 that USDT was, at one point, only 74% backed. As wrote the Commodity Futures Trading Commission's Dawn D. Stump, the claim that it was backed to the U.S. dollar was “not 100% true, 100% of the time.”","Read more: What Is Tether? How USDT Works and What Backs Its Value","Some stablecoins do not fully back their reserves, which has led to catastrophic results in some cases. The popular algorithmic stablecoin UST, for instance, crashed in spectacular fashion, wiping billions from the market.","On the opposite end of the spectrum, U.S. dollar stablecoin DAI overcollateralizes its reserves with crypto, meaning it has more than enough crypto on hand to back its coin. DAI has survived several market crashes.","\n"],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"October 2022","content":"DATE"},{"type":"74%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Dawn D. Stump","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Learn","industry","Beginner"],"authors":["Robert Stevens"]}