{"summary":"The former Twitter CEO announced its backing of the social networking startup in December 2019 in an effort to decentralize social media.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/06\/jack-dorsey-leaves-bluesky-board-touts-freedom-technology-of-x-and-nostr\/","publishDate":"2024-05-06T15:48:25","id":14543,"type":null,"title":"Jack Dorsey Leaves BlueSky Board, Touts 'Freedom Technology' of X and Nostr","category":["Finance"],"content":["Former Twitter CEO turned crypto entrepreneur as well as CEO of payments firm Block (SQ), Jack Dorsey is no longer a board member at BlueSky, the social network startup that he started backing in 2019 in an effort to decentralize social media.","Dorsey, in a post on X on Saturday called upon his followers to use “freedom technology” such as X, and to not depend on corporations “to grant you rights.” He said something very similar on Nostr, the open source protocol aimed at enabling a fully decentralized, censorship-resistant social media experience, where he's been very active in past weeks and to which in 2022 he donated 14 bitcoin (worth about $245,000 at the time) to the protocol's founder.","One year later, Dorsey donated $10 million to OpenSats, a non-profit organization for free and open-source bitcoin projects, like Nostr.","When asked if he was still on the board of BlueSky following his post, Dorsey said “no.”","“We sincerely thank Jack for his help funding and initiating the bluesky project,” the company wrote in a post on Saturday. It is now looking for a new board member to replace Dorsey.","In Dec 2019, Dorsey announced that Twitter, which he then led as its CEO, was funding a small independent team to develop an “open and decentralized standard for social media,” which Twitter would ultimately follow as well.","“New technologies have emerged to make a decentralized approach more viable,” he said back then. “Blockchain points to a series of decentralized solutions for open and durable hosting, governance, and even monetization. Much work to be done, but the fundamentals are there.”","The social networking service, which launched to the public in February, is led by CEO Jay Graber, a software engineer and entrepreneur.","The ascension of Nostr over the past couple of years, though, essentially obviated the need for BlueSky.","\"There is no Nostr board,\" Dorsey said on that platform Monday morning.","Edited by Stephen Alpher."],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"BlueSky","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$245,000","content":"MONEY"},{"type":"Jack","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Jay Graber","content":"PERSON"},{"type":"Dorsey","content":"PERSON"},{"type":"Dec 2019","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Saturday","content":"DATE"}],"hashtag":["Jack Dorsey","Nostr","Bluesky"],"authors":["Helene Braun"]}