{"summary":"Coinbase said it&#x27;s well-positioned to navigate an increasingly tight regulatory environment in the U.S.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/213814\/coinbase-says-its-in-strong-regulatory-position-despite-disjointed-u-s-approach","publishDate":"2023-02-21T18:14:21","id":1454,"type":null,"title":"Coinbase says it&#x27;s in strong regulatory position despite &#x27;disjointed&#x27; US approach","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Crypto giant Coinbase singled out regulation, and the company’s positioning relative to it in the U.S., as a strength in its earnings <a href=\"https:\/\/s27.q4cdn.com\/397450999\/files\/doc_financials\/2022\/q4\/Shareholder-Letter-Q4-2022.pdf\" data-v-f87c67ca=\"\">report<\/a> for the fourth quarter of 2022.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We remain committed to working with global regulators and policymakers to drive prudent regulation in this emerging asset class,” the company said in a letter to shareholders that accompanied the report.<\/span>","<span data-v-f87c67ca=\"\">Still, Coinbase painted a challenging picture for the digital asset industry in the U.S.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“While the SEC moves to expand its jurisdiction, other agencies seem to prefer crypto to be pushed out of the regulatory sphere,” Coinbase said, citing recent U.S. bank regulator warnings to financial institutions about holding crypto on public blockchains. <\/span>","<span data-v-f87c67ca=\"\">“Some banks have felt subsequent pressure to provide fewer basic services to crypto companies,” Coinbase said, adding that it would continue efforts with banks internationally “to work through these challenges, demonstrating the rigorous and mature approach Coinbase has taken to maintenance of these important relationships.”&nbsp;<\/span>","During the company's earnings call, CEO Brian Armstrong echoed the sentiment, saying \"policy is my top priority for this year.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n","<span data-v-f87c67ca=\"\">Calling the U.S. approach to crypto regulation “disjointed,” the U.S. exchange giant reiterated a call for federal legislation and public rulemaking around digital assets.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The comments came after the&nbsp;&nbsp;Securities and Exchange Commission last week began revising custodial rules to explicitly include cryptocurrencies as a way of tightening protections around customer assets following multiple high-profile crypto company failures in 2022. Coinbase executives have insisted they are well-positioned for the change, but SEC Chair Gary Gensler cast doubt that any crypto companies are in compliance with current asset safeguarding rules.<\/span>","<span data-v-f87c67ca=\"\">The SEC has likewise cast doubt on staking-as-a-service lines of business for crypto companies, announcing a $30 million settlement with U.S. exchange Kraken two weeks ago; Coinbase has also insisted its own staking business will not be affected.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“We do not believe we have violated any securities laws: Coinbase staking products are not securities, USD Coin (USDC) is not a security,” the company said in its report Tuesday, also saying that it does not have an exchange token, avoids offering high leverage products to customers, and does not operate as a market maker–items that have led to significant scrutiny of other companies.&nbsp;<\/span>","Still, in its 10-K filing with the SEC, Coinbase noted risks related to the regulatory environment, noting that, \"We are subject to an extensive, highly-evolving and uncertain regulatory landscape,\" and a failure to comply with laws and regulations, \"could adversely affect our brand, reputation, business, operating results, and financial condition.\" The filing also notes that some of its competitors are \"regulated or less regulated companies\".","<span data-v-f87c67ca=\"\">The company also acknowledged some previous regulatory “shortcomings” in following current financial laws in the U.S., referring to a $100 million consent order it entered into with the New York Department of Financial Services, a state regulator, over what the agency called “significant failures” to comply with anti-money laundering and suspicious activity reporting laws. Coinbase agreed to pay a $50 million fine and invest $50 million into complying with those laws.&nbsp;<\/span>","Armstrong, Coinbase's CEO, said he spent part of last week lobbying Congress and described other jurisdictions as further ahead of the U.S. in crypto policy on Coinbase's earnings call.&nbsp;","Coinbase in its report said there were some reasons to be optimistic about crypto policy, highlighting developments in India, Brazil, the UK and the EU, where it said the significance of the MiCA framework finalized last year \"cannot be understated.\"","\"These international jurisdictions are doing the hard work of drafting fit-for-purpose rules to govern the industry, which will benefit both consumers and industry participants alike,\" Coinbase said.","<em data-v-f87c67ca=\"\">Additional reporting by Adam Morgan McCarthy.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Adam Morgan McCarthy","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Brazil","content":"LOCATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"the fourth quarter of 2022","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"Armstrong","content":"ORGANIZATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["CONGRESS","SEC"],"authors":["Colin Wilhelm","The Block"]}