{"summary":"Bitcoin will likely trade in a range between $60,000 and $70,000 through the next few months, the former BitMEX CEO said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/03\/bitcoin-hits-62k-as-cryptos-bounce-correction-likely-over-but-expect-a-slow-grind-higher-arthur-hayes-says\/","publishDate":"2024-05-03T16:55:10","id":14549,"type":null,"title":"Bitcoin Hits $62K as Cryptos Bounce; Correction Likely Over But Expect a 'Slow Grind Higher,' Arthur Hayes Says","category":["Markets"],"content":["Cryptocurrencies bounced on Friday led by bitcoin's (BTC) gain, sparking hopes that the worst of the drawdown might be over.","BTC surged almost 5% to briefly above $62,000 during U.S. morning hours following a cooler-than-expected U.S. April jobs report that eased concerns about higher interest rates. At press time bitcoin was changing hands at $61,600, up 4.4% and outperforming the broad-market CoinDesk 20 Index's (CD20) 3% advance over the past 24 hours.","Ether (ETH) reclaimed the $3,000 level and was up 3% during the same period, while altcoin majors dogecoin (DOGE), shiba inu (SHIB) and Near Protocol's NEAR jumped 5%-10%.","The rally happened as the U.S. economy added 175,000 jobs in April, less than the analyst consensus of 245,000 and the previous month's 315,000, according to the government's Nonfarm Payrolls report. It also showed the unemployment rate inching higher to 3.9% from 3.8% in March.","Following the report, market participants saw a 68% odds for at least one rate cut by September, up from 57% a week ago, CME FedWatch data indicated.","Read more: Bitcoin’s Recent Weakness Is More Tied to Global Markets Than to Anything Crypto Specific, Coinbase Says","Bitcoin's correction since mid-March coincided with mounting concerns of the Federal Reserve policymakers adopting a more hawkish stance in face of sticky inflation in recent months, with some traders even dismissing chances of any rate cut this year. That's helped the U.S. dollar index to its highest level since November, often a bearish signal for risk assets like crypto.","In addition to the soft jobs data, Coinbase analysts David Han and David Duong took note of this week's FOMC meeting at which policymakers indicated no interest in cutting rates, but did taper the pace of the central bank's balance sheet runoff – often referred to as quantitative tightening (QT) campaign – as a dovish sign.","\"We believe that the FOMC’s more dovish-than-expected statement has signaled the peak in the USD’s upward momentum against both FX [foreign currencies] and crypto pairs,\" Han and Duong wrote.","Arthur Hayes, former CEO of crypto exchange BitMEX, said in his latest essay early Friday that bitcoin has likely bottomed at this week's lows of $56,000, but warned investors to expect a gradual climb instead of a swift recovery to the March highs as markets will cool for the next few months. \"Did bitcoin hit a local low [...] earlier this week,\" asked Hayes. \"Yes,\" he concluded. \"I expect prices to bottom, chop, and begin a slow grind higher.\"","Speaking about what's next, he forecasted \"a rally to above $60,000 and then range-bound price action between $60,000 and $70,000 until August.\"","Edited by Stephen Alpher."],"entity":[{"type":"$3,000","content":"MONEY"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"earlier this week","content":"DATE"},{"type":"CME FedWatch","content":"ORGANIZATION"},{"type":"David Han","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"David Duong","content":"PERSON"},{"type":"3.8%","content":"PERCENT"},{"type":"Hayes","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"57%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"August","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"3.9%","content":"PERCENT"},{"type":"3%","content":"PERCENT"},{"type":"4.4%","content":"PERCENT"},{"type":"5%","content":"PERCENT"},{"type":"$56,000","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"$70,000","content":"MONEY"},{"type":"68%","content":"PERCENT"},{"type":"$61,600","content":"MONEY"},{"type":"FOMC","content":"ORGANIZATION"},{"type":"$62,000","content":"MONEY"}],"hashtag":["Market Wrap","Bitcoin","Ether","FOMC","Arthur Hayes"],"authors":["Krisztian Sandor"]}