{"summary":"Once they reach a certain level of sophistication, there’s a clear trend for Web3 asset holders to transition their digital asset wealth to self-custody.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/02\/crypto-for-advisors-digital-asset-custodys-future\/","publishDate":"2024-05-02T16:00:00","id":14548,"type":null,"title":"Crypto for Advisors: Digital Asset Custody’s Future","category":["Finance"],"content":["Custody of digital assets is evolving, whether it be the technology itself, the plethora of new tokenized investment products, or the risks of leaving assets with service providers like centralized exchanges, whether real or perceived.","Colton Dillion, CEO of Hedgehog Technologies, breaks down the evolutions in digital asset custody, focusing on the shift of wealth to self-custody in the space and how advisors must support this shift.","In Ask an Expert, Jessy Gilger from Sound Advisory answers questions about direct bitcoin ownership within an IRA account.","–S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Web3 rails will eventually swallow traditional finance, and there’s no question about it.","Weighing in at an impressive $2.3 trillion market capitalization, the digital asset industry still has some growing up to do before it can surpass the $110 trillion stock market, but in case you haven’t been paying attention, real-world assets (RWAs) and stablecoins have seen some recent big bets from major players like Blackrock, Stripe, Franklin Templeton and others.","These firms are slowly cloning traditional securities like money market funds and mutual funds for on-chain consumption and seamless peer-to-peer transfers, and it’s only a matter of time before regulators catch up with the market to allow the exchange of traditional securities, such as Fortune 500 stocks or exchange-traded funds (ETFs), in the same exact manner. Eventually every type of traditional asset will also be an on-chain asset. All we need is time.","So, what does that mean for custodians?","Chainalysis reported last June that personal wallets were increasing exponentially even while assets being sent back to exchanges were decreasing quarter over quarter. Both retail and institutional clients are choosing to keep their assets on-chain rather than trust them with custodians who may turn out to be another FTX or otherwise risk their funds in highly interconnected networks of rehypothecation. If you could avoid having your funds locked up in Silvergate’s bankruptcy proceedings, wouldn’t you?","While Coinbase, Kraken and Gemini all support at least one of the spot bitcoin ETFs as a primary custodian, and institutional use-cases are migrating more slowly, there’s a clear trend for Web3 asset holders to start transitioning their wealth to self-custody once they reach a certain level of sophistication. Once insurance methods catch up with wallet compromise, we expect that most individuals and institutions will choose to handle the segregation of their accounts directly and demand control of their own private keys.","As advisors and fiduciaries, it behooves us to be prepared for the day that clients come to us asking to support self-custody solutions. There are many options out there for intrepid self-custodians, from multi-sig accounts to account abstraction (AA) smart contract wallets, from institutional hardware to multi-party computation (MPC) wallets, but each entails their own security and usability tradeoffs, as well as cost considerations.","Multisig","Safe (originally known as Gnosis Safe) is the original multi-signature solution for Ethereum-based networks and comes with some handy tools for managing your treasury in a wallet where multiple people have to agree before a transaction can happen. On other chains, you have to find other solutions, like a dedicated wallet software that supports Shamir’s Secret Sharing. For under $500, one can set up a wallet with m of n signatures (eg 2 out of 3 or 8 out of 9 have to sign for a valid transaction), but the permissioning on these accounts is less robust without including the new account abstraction proposals, most notably ERC-4337. If you have one of the signatures, you can help sign away any privileges on the Safe account.","Account Abstraction","This is another EVM-only solution for the time being, but in principle, any chain that supports smart contracts can support the standard. Account abstraction allows a savvy developer to layer additional permissions and capabilities on top of a standard account so that certain signers can only sign on certain types of transactions. Many providers also leverage these capabilities to add transaction batching, non-native gas tokens, transaction forgiveness, and more. These players include Gnosis Safe and groups like ZeroDev, Biconomy and Fun.","Institutional Cold Storage","Many custodians out there offer a cold storage solution that leverages hardware security modules and robust physical security to keep your assets as safe as the gold bars under Fort Knox. By using specialized chips that are extremely expensive to crack, they can generate private keys and sign transactions securely on your behalf without the flexibility and speed of a hot wallet. Depending on the provider, these solutions are often combined together with a multisig, AA, or MPC solution, but the cost usually runs into double-digit basis points with hefty minimum balances and account maintenance fees.","Multi-party Computation","One of the most flexible options out there, MPC is not limited to a specific network by a smart contract, but it does require trust in potentially opaque partners. MPC is closer to the base layer of crypto, the private key entropy, and all the participants in an MPC wallet participate together to recreate the private key, instead of having multiple private keys send their own valid signatures. There’s Qredo and Lit protocols for those who are more technically savvy, which are fully decentralized solutions, but for advisors that want a little more white glove treatment and are willing to work with trusted third parties, Anchorage Digital just released their enterprise solution, Porto, and my own company Hedgehog just released an MPC account management product, powered by Capsule, with a focus on fund administration, sub-advisory, and turnkey asset management programs.","Obviously we agree with Nathan McCauley, the CEO of Anchorage, when he summarized their rationale for launching a self-custody solution:","\"Right now, many people look to self-custody solutions to allow them to do a more flexible set of activities on the blockchain. We really think of this as expansionary and additive.\"","Whatever you choose as an advisor, it’s important to keep in mind the Custody rule and be certain that you don’t have arbitrary withdrawal privileges on your clients’ accounts. There hasn’t been a lot of guidance for some of these account structures, and there still remains some clarity to be had around the extent to which any particular multisig, AA, or MPC protocol qualifies as substantial control over client funds. Nonetheless, we must forge a path forward or be left behind in our clients’ dust.","– Colton Dillion, CEO, Hedgehog Technologies","Q. Can you hold bitcoin in an IRA account?","Yes, there are several ways to gain exposure to bitcoin in both traditional and Roth IRA accounts. The easiest method is through one of the spot bitcoin ETFs traded on major brokerages. However, this route only provides U.S. dollar exposure to bitcoin's price movements, not direct ownership of the actual coins.","For many bitcoin investors, the preferred option is opening an IRA through a specialized provider that allows direct ownership and storage of bitcoin within the account. Key control is crucial here – the ability for you to maintain the private keys means you have full ownership and control of the bitcoin in your IRA, without entrusting it to a third-party custodian. This avoids the centralization and counterparty risks of other options.","Q. What’s the benefit of holding bitcoin in an IRA?","The main advantage is being able to invest in bitcoin as a long-term store of value while enjoying the tax benefits of an IRA account. Since bitcoin is viewed by many as a superior form of savings, it aligns well with the long-term horizon of retirement accounts.","Specific benefits include tax-deferred or tax-free growth (traditional or Roth), allowing your bitcoin holdings to compound more efficiently over decades. Bitcoin has historically appreciated in consistent 4-year cycles, so capturing those gains tax-free can significantly accelerate your retirement timeline.","Holding bitcoin in an IRA also enables taking distributions in bitcoin itself rather than having to sell for dollars and realize taxable gains. For clients wanting full sovereignty, key control over their IRA's bitcoin is paramount to avoid third-party custody risks. The downside is reduced liquidity and increased rules and age restrictions compared to a standard brokerage account. But for long-term investors convinced of bitcoin's role as hard money, the tax benefits of an IRA can outweigh this.","- Jessy Gilger, CCO & Senior Advisor, Sound Advisory","CORRECTION (May 3, 2024, 13:43 UTC): Corrects names of Safe.","Edited by Bradley Keoun."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"4337","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Nathan McCauley","content":"PERSON"},{"type":"Capsule","content":"ORGANIZATION"},{"type":"$500","content":"MONEY"},{"type":"Anchorage","content":"LOCATION"},{"type":"Colton Dillion","content":"PERSON"},{"type":"S.M.","content":"LOCATION"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"Porto","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Roth IRA","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Roth)","content":"PERSON"},{"type":"AA","content":"ORGANIZATION"},{"type":"Fort Knox","content":"LOCATION"},{"type":"May 3, 2024","content":"DATE"},{"type":"$110 trillion","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$2.3 trillion","content":"MONEY"},{"type":"Gnosis","content":"PERSON"},{"type":"quarter over quarter","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Sound Advisory","content":"ORGANIZATION"},{"type":"IRA","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Jessy Gilger","content":"PERSON"},{"type":"Hedgehog Technologies","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","Financial Advisers","Custody","Self custody","Real World Assets","Wallet","Multisig","multi-signature wallets","Multisig wallet","Cold Storage","Institutional Adoption","Institutional Investment"],"authors":["Sarah Morton","Colton Dillion"]}