{"summary":"GBTC, the biggest spot bitcoin ETF, has seen its assets under management lead over BlackRock's IBIT shrink.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/04\/grayscales-bitcoin-etf-sees-inflow-for-first-time-since-january-debut\/","publishDate":"2024-05-04T00:04:24","id":14551,"type":null,"title":"Grayscale's Bitcoin ETF Sees First Inflow After Billions Lost Since January","category":["Finance"],"content":["The Grayscale Bitcoin Trust (GBTC), the largest bitcoin ETF by assets, saw a net inflow of new money from investors, according to Farside Investors, the first daily increase since the product debuted in January.","A net $63 million was added on Friday, according to Farside's tally.","The Grayscale product had been the dominant conventional investment vehicle for those looking to invest in bitcoin (BTC) without directly purchasing the cryptocurrency. But it got competition in January when it was converted into an easier-to-trade ETF at the same time nine rival spot bitcoin ETFs began trading.","GBTC has much higher fees, and investors yanked billions of dollars from it. Its bitcoin holdings have dropped from more than 600,000 bitcoin to around 290,000 bitcoin, according to fund data compiled by CoinDesk.","Read more: Grayscale's Planned Mini Bitcoin ETF Will Have a 0.15% Fee, the Lowest Among Spot Bitcoin ETFs","While the Friday inflow ends the streak of net GBTC withdrawals, BlackRock's iShares Bitcoin Trust (IBIT) is challenging the fund for the title of biggest bitcoin ETF. GBTC now has $18.1 billion in assets, versus IBIT's $16.9 billion. IBIT, now in second place, started at zero in January, while GBTC had more than $26 billion."],"entity":[{"type":"$16.9 billion","content":"MONEY"},{"type":"billions of dollars","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"$63 million","content":"MONEY"},{"type":"$26 billion","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"IBIT","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$18.1 billion","content":"MONEY"},{"type":"Farside Investors","content":"ORGANIZATION"},{"type":"Farside","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"0.15%","content":"PERCENT"}],"hashtag":["Grayscale","Bitcoin ETF"],"authors":["Nick Baker"]}