{"summary":"Bitcoin mining firm Luxor is launching an over-the-counter derivative product based on bitcoin mining revenues.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175588\/luxor-launches-derivatives-product-based-on-bitcoin-mining-revenue","publishDate":"2022-10-10T09:48:29","id":1455,"type":null,"title":"Luxor launches derivatives product based on bitcoin mining revenue","category":["BITCOIN"],"content":["Bitcoin mining firm Luxor, which runs a mining pool and a hardware trading desk, is launching an over-the-counter derivative product based on bitcoin mining revenues.","The new product, Luxor Hashprice NDF, is a non-deliverable forward contract for Bitcoin mining \"hashprice\" — a term coined by the company, referring to revenue miners earn from a unit of hashrate over a specific timeframe.","\"While many derivative instruments exist for miners to hedge their Bitcoin price exposure, as well as their power and energy exposure, the space was lacking an instrument to easily hedge their hashrate exposure,\" Luxor Head of Derivatives Matt Williams said.","It will also give proprietary trading firms, hedge funds and other investment firms exposure to the bitcoin mining industry, the company said.","Luxor will settle payments using its <a href=\"https:\/\/data.hashrateindex.com\/chart\/bitcoin-hashprice-index\" data-v-f87c67ca=\"\">bitcoin hashprice index<\/a> as the reference rate for hashrate value. Contracts can pay out in either dollars, BTC or a USD stablecoin. Their durations will be flexible and bespoke according to counterparty needs.","Contract terms will be structured according to a locked-in price, daily hashrate being sold and the duration of the contract.&nbsp;","The company said this is just the first of \"many derivatives\" that it plans to launch next year.","\"Hashprice derivatives are the apotheosis of our vision of hashrate as an asset class,\" said Luxor co-founder and CEO Nick Hansen.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Nick Hansen","content":"PERSON"},{"type":"Luxor Hashprice NDF","content":"ORGANIZATION"},{"type":"\" Luxor Head of Derivatives Matt Williams","content":"ORGANIZATION"}],"hashtag":["DERIVATIVES"],"authors":["Catarina Moura","The Block"]}