{"summary":"BlockFi, a crypto lending company, was founded in October 2017 and filed for bankruptcy just over five years later in the wake of FTX's collapse.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/blockfis-rise-and-fall-a-timeline\/","publishDate":"2022-11-30T21:43:42","id":14552,"type":null,"title":"BlockFi’s Rise and Fall: A Timeline","category":["Learn"],"content":["Crypto lender BlockFi is kaput. The platform, which offered high yields on crypto deposits, has filed for bankruptcy protection. It’s the latest company to fall after the catastrophic collapse of FTX. Indeed, bankruptcy filings show that BlockFi had $355 million worth of cryptocurrencies frozen in FTX and relied on the firm for its credit facility. But how did it all go so wrong? CoinDesk has compiled a timeline to help you piece together the picture.","Zac Prince and Flori Marquez founded BlockFi in October 2017 with a lofty mission: provide credit services to the cryptocurrency market. Prince, the CEO, had worked in sales before founding BlockFi. Marquez, the company’s chief operating officer, managed financial portfolios for Bond Street, a small-time lender that Goldman Sachs acquired in 2017, before founding BlockFi. The firm set up shop in Jersey City, New Jersey, and in subsequent years expanded to New York, Singapore, Poland and Argentina. In January 2018, BlockFi launched its first offering: loans of U.S. dollars backed by cryptocurrencies. Simply, clients could deposit bitcoin (BTC) or ether (ETH) and take out loans in fiat against that crypto collateral.","Venture capital money followed swiftly. In February 2018, BlockFi raised $1.55 million in a seed round led by ConsenSys Ventures. In July 2018, it raised a hefty $52.5 million in a funding round led by Mike Novogratz’s Galaxy Digital. And at the end of 2018, BlockFi raised another $4 million by issuing convertible notes, with Akuna Capital the main buyer.","Flush with cash, the startup got to work. In March 2019 it launched a crypto deposit account that would reinvest earnings from bitcoin or ether deposits and provide an opportunity to earn compound interest at a 6.2% annual percentage yield (APY). BlockFi adjusted these rates over time; oin May 2019 it almost halved the interest rate on ETH deposits. The risk of the high-interest account, as explained to CoinDesk, was that it \"doesn’t come with the backing of the federal government like a savings account at a bank does.” As the market heated up over the next few years and BlockFi continued to grow, that didn’t seem to hold people back from depositing their money with the company.","The firm’s next huge cash injection came in August 2019, when BlockFi raised $18.3 million in a Series A funding round led by Peter Thiel’s Valar Ventures. They were joined by Winklevoss Capital, Galaxy Digital, ConsenSys, Akuna Capital and others. Earlier that year, BlockFi reached a milestone of having over $50 million deposited in its interest-bearing accounts.","In December 2019, BlockFi got into the crypto trading game, offering an unusual model that charged zero fees on purchases and sales. Instead of charging trading fees, BlockFi profited by selling trading data to institutional crypto firms that, in turn, provided liquidity to BlockFi, similar to Robinhood’s business model. “Market makers want the information about what trades are happening, and they get it by having relationships with as many venues as they can support to receive that order flow,” BlockFi’s CEO said.","Peter Thiel’s Valar Ventures led BlockFi’s $30 million Series B funding round in February 2020, with repeat investors including Akuna Capital and new investors including HashKey Capital, which CEO Prince noted as key to helping “BlockFi expand into Singapore” and the Asia-Pacific region.","BlockFi partnered with Silvergate Bank to allow customers to utilize cash deposits via wire transfer to buy bitcoin. Prior to the move, BlockFi was limited to “crypto payment rails” such as stablecoins. Prince said he had been inundated by “requests every day from our existing clients, and also from folks who aren't already cryptocurrency owners.” The company disclosed the previous month it had $650 million of assets on its platform.","All was going well. Then: a hack! In 2020, a single attacker targeted an employee’s phone with a “SIM swap” that tricked the mobile carrier into activating the employee’s phone on another device. This allowed the hacker to gain access to some of BlockFi’s retail marketing systems. No funds were lost, but the attacker managed to access confidential information about BlockFi’s customers.","In August 2020, BlockFi raised $50 million in a Series C round led by Morgan Creek Digital. At the time, Zac Prince said the lender held $1.5 billion in assets and made a little under $10 million in revenue each month. National Basketball Association star Matthew Dellavedova was among the investors.","In October 2020, BlockFi invested big into Grayscale’s Bitcoin Trust (Grayscale is owned by CoinDesk's parent, Digital Currency Group), taking a 5% stake of the $4.8 billion fund. The other big whale invested in GBTC at the time? Hedge fund Three Arrows Capital, which had a 6% stake as of June 2020.","BlockFi continued to expand its stake in GBTC, to $1.7 billion in GBTC by February 2021. Unfortunately, it later turned out that it was difficult to get money out of GBTC. In addition, as of writing, shares in the trust trade at a huge discount to bitcoin.","Early in 2021, BlockFi registered its own Bitcoin Trust with the U.S. Securities and Exchange Commission, putting it in direct competition with Grayscale’s product. The fund offered a lower management fee and partnered with Fidelity Digital Asset Services to custody the assets. In November of that same year, it filed for approval for a spot bitcoin exchange-traded fund.","All was going well for BlockFi. With bitcoin’s soaring price hitting all-time highs (bitcoin crossed the $60,000 mark for the first time in March 2021), BlockFi raised $350 million, giving the company a valuation of $3 billion. It held $15 billion in assets and aimed to increase its staff to 500 people by the end of the year. It said it had 225,000 users, up from 10,000 in late 2019. What could go wrong?","New Jersey’s Bureau of Securities was the first to deliver a big blow. The state’s financial regulator claimed BlockFi’s interest accounts amounted to sales of an “unregistered security” and issued a ban on creating new interest-bearing accounts. Alabama issued its own notice to the lender shortly after, and Texas joined on the same day. Two days later, Vermont lodged its complaint, and at the end of the month Kentucky ordered the lender to stop signing up new interest account customers.","The CEO called on the U.S. Securities and Exchange Commission to look into the matter. So the national securities regulator did exactly that – and it didn’t end well for BlockFi (we’ll get to that next). It was poor timing for BlockFi, which was looking to raise $500 million in a Series E and was launching a Visa rewards credit card.","In February, BlockFi settled with the SEC for $100 million over its high-yield lending product. It registered with the SEC, but from mid-February stopped offering the interest account to new clients in the U.S., and prevented existing U.S. clients from adding more money to their accounts. “Today’s settlement makes clear that crypto markets must comply with time-tested securities laws,” SEC Chair Gary Gensler said in a statement.","In June, BlockFi’s valuation sank to $1 billion in a “down round” – a third of its $3 billion valuation the previous March, when it raised $350 million. At the end of June, the lender held $1.8 billion in open loans and $600 million of exposure. In particular, BlockFi had made huge loans to the huge crypto hedge fund Three Arrows Capital, which officially filed for bankruptcy protection on July 1. Three Arrows had failed after being overexposed to the collapsed stablecoin ecosystem, Terra; BlockFi, according to reports, had liquidated the hedge fund's collateral before its bankruptcy. In the same month, bitcoin fell below $20,000. A month later, BlockFi’s main rivals, Voyager Digital and Celsius Network, also filed for bankruptcy protection.","In dire straits, BlockFi received a $400 million line of credit from crypto exchange FTX later that summer. The exchange also won the right for its U.S. unit to buy BlockFi FTX US almost bought the lender for just $25 million, and in August could have bought the company for as little as $15 million if certain key terms weren’t met, such as receiving SEC clearance to operate its yield-generating services in the U.S.","At the start of the month, FTX itself collapsed after CoinDesk published a story based on private financial documents on Nov. 2 that poked holes in the balance sheet of FTX sister company, trading firm Alameda Research. It took only nine more days for FTX to completely melt down, and it went to bankruptcy court on Nov. 11.","That was bad for BlockFi, which needed FTX’s credit facility to remain afloat. Late on Nov. 10, BlockFi paused customer withdrawals amid “the lack of clarity” about FTX. On Nov. 11, California’s financial regulator revoked BlockFi’s lending license.","BlockFi started preparing for its bankruptcy filing shortly after that. On Nov. 28, it officially filed for protection under Chapter 11, leaving over 100,000 creditors in the lurch. Filings later revealed that Alameda had defaulted on $680 million worth of loans to BlockFi. After filing in the bankruptcy court, BlockFi sued Sam Bankman-Fried's Emergent Fidelity Technologies for its Robinhood shares, which were pledged to BlockFi as collateral for a loan.","In the first bankruptcy hearing, lawyers for BlockFi said the lender held $355 million in crypto on FTX. All the while, one question looms: Will customers get anything back?","Read More: Latest BlockFi Stories"],"entity":[{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$680 million","content":"MONEY"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"December 2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"New Jersey’s Bureau of Securities","content":"ORGANIZATION"},{"type":"March 2019","content":"DATE"},{"type":"February 2021","content":"DATE"},{"type":"February 2020","content":"DATE"},{"type":"$18.3 million","content":"MONEY"},{"type":"Terra","content":"LOCATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"$350 million","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"$52.5 million","content":"MONEY"},{"type":"February 2018","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"March 2021","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"January 2018","content":"DATE"},{"type":"Kentucky","content":"LOCATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Flori Marquez","content":"PERSON"},{"type":"California","content":"LOCATION"},{"type":"$15 billion","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Matthew Dellavedova","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"summer","content":"DATE"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"New Jersey","content":"LOCATION"},{"type":"$1.55 million","content":"MONEY"},{"type":"$20,000","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"November","content":"DATE"},{"type":"October 2020","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Nov. 10","content":"DATE"},{"type":"Nov. 11","content":"DATE"},{"type":"Valar Ventures","content":"ORGANIZATION"},{"type":"Jersey City","content":"LOCATION"},{"type":"June 2020","content":"DATE"},{"type":"6.2%","content":"PERCENT"},{"type":"$4 million","content":"MONEY"},{"type":"October 2017","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Vermont","content":"LOCATION"},{"type":"$15 million","content":"MONEY"},{"type":"Grayscale’s Bitcoin Trust (Grayscale","content":"ORGANIZATION"},{"type":"Nov. 28","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"Peter Thiel’s Valar Ventures","content":"ORGANIZATION"},{"type":"National Basketball Association","content":"ORGANIZATION"},{"type":"Emergent Fidelity Technologies","content":"ORGANIZATION"},{"type":"Akuna Capital","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$355 million","content":"MONEY"},{"type":"$400 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"May 2019","content":"DATE"},{"type":"$1.7 billion","content":"MONEY"},{"type":"August","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"Morgan Creek Digital","content":"ORGANIZATION"},{"type":"July 2018","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Poland","content":"LOCATION"},{"type":"$650 million","content":"MONEY"},{"type":"August 2019","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Pacific","content":"LOCATION"},{"type":"Argentina","content":"LOCATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"Winklevoss Capital","content":"ORGANIZATION"},{"type":"July 1","content":"DATE"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"$10 million","content":"MONEY"},{"type":"ConsenSys Ventures","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"$4.8 billion","content":"MONEY"},{"type":"Zac Prince","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Fidelity Digital Asset Services","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Nov. 2","content":"DATE"}],"hashtag":["industry","Beginner","Learn","BlockFi","Bankruptcy","FTX Collapse"],"authors":["Robert Stevens"]}