{"summary":"One-on-One with Alana Ackerson on Blockchain and More","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/coindesk-indices\/2024\/03\/04\/entrepreneurial-insights\/","publishDate":"2024-03-04T17:29:04","id":14550,"type":null,"title":"Entrepreneurial Insights","category":["CoinDesk Indices"],"content":["Alana Ackerson, president of Oasis Pro, discusses what makes successful entrepreneurs, the role blockchain technology will play in shaping the future of financial services and how the blockchain and digital asset space differs from her time in traditional financial services.","The interview was conducted by CoinDesk Indices and is not associated with CoinDesk editorial.","What strategies do you believe differentiate successful entrepreneurs from others?","To build a truly transformative business, an entrepreneur must identify a unique insight or \"secret\" that others have overlooked. This could be a novel technology, an unmet market need, or a disruptive approach to solving an existing problem. Next, they have to convince others of what they believe is possible. Instead of limiting their talent search to traditional channels, successful entrepreneurs actively seek out individuals from unconventional backgrounds or industries who possess the skills and creativity needed to drive their ventures forward. For example, I’ve hired former special forces officers who have repeatedly proven to be among the most valuable contributors to my teams. By casting a wider net, and embracing divergence in their teams, entrepreneurs can access fresh ideas and perspectives that fuel innovation and differentiation.","What role do you believe blockchain technology will play in shaping the future of financial services?","Blockchain technology has the potential to democratize access to financial services, making it more inclusive and efficient. By facilitating faster, cheaper, more transparent, and inherently less risky transactions, Oasis Pro has rapidly become the trusted middleware layer and solutions provider powering legacy financial institutions and fund managers into blockchain. We enable global banks and asset managers to swiftly leverage these solutions without the need for a substantial resource allocation. One of our strategic partner’s average implementation period is 12-18 months, whereas we completed our implementation with them in just two-and-a-half months.","How does your work in the blockchain and digital asset space differ from your time in traditional financial services?","What has been most striking is the collective effort among creators, builders, and developers to shape the evolving landscape of blockchain and digital assets. Despite fierce competition, there's a notable culture of mutual support and collaboration among operators. There is a very real shared goal of pioneering innovative infrastructure and reshaping established systems. Partnerships and collaborations hold significant value, driving collective progress and fostering a sense of community among industry players in the space.","How did partnerships shape your success at Figure Technologies and Provenance Blockchain?","We were incredibly tactical in using partnerships to lay the foundation for widespread adoption of our fintech solutions. Forging alliances with leading financial institutions like J.P. Morgan, Goldman Sachs, and Jefferies empowered us to revolutionize the lending industry through innovative blockchain solutions. We also collaborated closely with regulatory bodies like the OCC to ensure compliance and credibility - key during the early stages of new technology innovation. The power of these kinds of strategic partnerships is evident in last year’s Project Guardian proof of concept, with the participation of Oasis Pro, Provenance Blockchain, J.P. Morgan, Apollo, WisdomTree, Ava Labs, Axelar, LayerZero, Biconomy, and the Monetary Authority of Singapore.","What strategic considerations did you take into account when forming partnerships to launch innovative products?","The digital asset industry is very broad, so for certain partnerships - like ours with Methodic Capital Management (MCM) - Oasis Pro’s industry connectivity and comprehensive platform was crucial to the launch of the Methodic CoinDesk ETH Staking Fund. Not only did it prevent wasted time on MCM’s part in development, but it also opened doors to connecting with other companies in the industry to form further relationships, like with CoinDesk Indices as the fund seeks to match the returns of the CoinDesk Ether Total Return Index (ETXTR). Additionally, with the uncertainty in regulation around digital assets, creating products requires a multi-faceted view of regulators and regulation. We work closely with our partners to take novel approaches to developing funds and solutions.","Disclaimer: Investments into crypto currencies and\/or digital assets are subject to material and high risk including the risk of total loss. The Fund’s performance may not always replicate the changes in the price of CoinDesk Ether Total Return Index (ETXTR as represented by CoinDesk Ether Total Return Index (ETXTR). Due to cash held by the Fund, Fees and expenses incurred by the Fund. Securities offered by Oasis Pro Markets, LLC member of FINRA \/ SIPC."],"entity":[{"type":"OCC","content":"ORGANIZATION"},{"type":"Methodic Capital Management (MCM","content":"ORGANIZATION"},{"type":"Alana Ackerson","content":"PERSON"},{"type":"LLC","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Axelar","content":"LOCATION"},{"type":"SIPC","content":"ORGANIZATION"},{"type":"J.P. Morgan","content":"ORGANIZATION"},{"type":"18 months","content":"DATE"},{"type":"Ava Labs","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Monetary Authority","content":"ORGANIZATION"},{"type":"Figure Technologies","content":"ORGANIZATION"},{"type":"Jefferies","content":"ORGANIZATION"},{"type":"Provenance Blockchain","content":"PERSON"},{"type":"Biconomy","content":"LOCATION"},{"type":"FINRA","content":"ORGANIZATION"}],"hashtag":["CoinDesk Indices"],"authors":["Kim Greenberg"]}