{"summary":"Early Friday, Friend.Tech airdropped its native token, FRIEND, while debuting version 2 of the platform.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/03\/friendtechs-native-token-tanks-to-25-after-debut\/","publishDate":"2024-05-03T08:42:16","id":14554,"type":null,"title":"Friend.Tech's Native Token Tanks to $2.5 After Debut","category":["Markets"],"content":["Decentralized social platform Friend.Tech on Friday airdropped its native token, FRIEND, while unveiling version 2 of the platform, which is packed with new features, including the Money Club.","The token's price rose as high as $169 immediately after it began trading on Base before quickly collapsing to $2.5, data from DEXscreener show.","\"It looks like the price dump has been driven by liquidity issues, similar to what happened with Renzo last week,\" Hitesh Malviya, founder of crypto analytics platform DYOR, told CoinDesk. Liquidity refers to market's ability to absorb large buy and sell orders at stable prices. In a low liquidity environment, a few large orders can have an outsized impact on the market price.","Friend.Tech debuted in August last year on Coinbase's Ethereum-based layer-2 blockchain Base as an invite-only platform with a point system that rewards users for their engagement.","The new Money Club feature will facilitate an exclusive space for financial discussion and networking alongside a new point system. At press time, crypto assets worth $29.8 million were locked in Friend.Tech, more than 40% off the peak of $52.04 million in early October, according to DeFiLlama.","Activity picked up last month in anticipation of the version 2 launch, initially planned for April 20 as well the FRIEND token airdrop teased by developers.","The platform took a snapshot for the highly anticipated 100% airdrop of FRIEND last week.","Several users, however, seem to be having issues with claiming their airdrop.","\"I'm not selling my FRIEND airdrop (cause I can't even claim it),\" Dubai-based crypto analyst and trader Reetika Malik said on X.","Malviya said the distribution was a \"concentrated airdrop,\" where leading creators took the most supply home.","\"Most users got 10x less airdrop than what they were expecting, so they are not even claiming that airdrop, as its less than 200$ for most of the retail investors,\" Malviya told CoinDesk in a direct message on X. \"But at the same time few people ended up making crazy amount. So its a clear case of very concentred airdrop where leading creators took the most supply home through airdrop, leaving retail in disguise.\"","Friend.Tech had not responded to a request for clarification by publication time.","Edited by Sheldon Reback.","\n"],"entity":[{"type":"$ for","content":"MONEY"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"$2.5","content":"MONEY"},{"type":"$169","content":"MONEY"},{"type":"Money Club","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"August last year","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"Renzo","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Hitesh Malviya","content":"PERSON"},{"type":"$29.8 million","content":"MONEY"},{"type":"Dubai","content":"LOCATION"},{"type":"Malviya","content":"PERSON"},{"type":"$52.04 million","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"October","content":"DATE"},{"type":"Reetika Malik","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Base"],"authors":["Omkar Godbole"]}