{"summary":"We have a world currency already: it's the dollar. Do we want to keep it that way?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/03\/the-dollar-won-but-might-the-us-lose-control-of-the-dollar\/","publishDate":"2024-05-03T17:26:50","id":14555,"type":null,"title":"The Dollar Won, but Might the U.S. Lose Control of the Dollar?","category":["Consensus Magazine"],"content":["The dominance of the U.S. dollar is hard to overstate at the moment. It’s not just that the U.S. economy is on a roll. The U.S. dollar is the preferred choice for international business transactions at a level that’s even larger than the U.S. economic position.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","To put these two in perspective, the U.S. economy represents about 25% of global output – a level that has been stable for over 40 years (an astonishing achievement when you consider the rapid growth achieved in China, parts of Asia, and Eastern Europe). When it comes to global finance, though, the dollar is even more dominant than the U.S. economy.","The Bank of International Settlements estimates that the U.S. dollar is used in 90% of all international payments and settlements, with 40% of all trade invoiced in U.S. dollars. In the world of blockchain stablecoins, the U.S. dollar represents 99% of all global stablecoin transactions. (USDT and USDC, the leading players, are both USD-backed and based on Ethereum.)","All these U.S. dollar transactions put much of the world’s financial infrastructure within reach of U.S. regulators. Most of these U.S. dollars are electronic and consequently they all have ties back to U.S. banks and, in turn, eventually, U.S. regulators and the U.S. Federal Reserve. The extra-territorial nature of U.S. law and the reach of U.S. institutions and digital networks makes it very difficult to transact in dollars without encountering U.S. regulations.","There’s always cash, but the largest bill printed by the U.S. Treasury today is $100. That will get you dinner in New York, for one (no wine). Imagine how many of them you’ll need to cover the cost of that new aircraft carrier. For any substantial funding requirements, you need digital payments.","This dollar dominance gives the U.S. considerable power in the global markets, especially when it comes to sanctions against individuals and governments. Banks, wary of being cut off from 90% of all global payments, are going to follow U.S. directives whether they are binding or not.","Other countries have tried to supplant the dollar, largely without success. There is, however, a new option that exists: synthetic dollars on a blockchain.","Synthetic dollars are dollar-denominated stable coins that contain no dollars. Instead, they are digital tokens that are pegged to the U.S. dollar in value but backed by a mix of other real and digital assets and managed by an algorithm to maintain a peg with the U.S. dollar. In the world of blockchain, they are known as algorithmic stablecoins.","Algorithmic stablecoins aren’t perfect and they aren’t risk free. Because they are dollar-denominated but often don’t consist of dollars, they can “lose their peg” with the U.S. dollar. Sometimes this happens because of fraud, but it can also happen when the underlying assets change rapidly in value. In periods of high market turmoil and uncertainty, this happens.","Synthetic dollars, in effect, can cost more than “real” dollars because you need to over-capitalize your collateral in order to avoid the risk of losing that alignment with the U.S. dollar. Despite these risks, quite a few blockchain-based digital assets have been established with a peg to the U.S. dollar. The dai, from MakerDAO, is probably the most successful of these, though its backing today includes some U.S. dollar assets. There are others, however, that are pegged purely based on cryptocurrencies and other digital assets that do not connect with the dollar.","See also: Crypto's Transition: Bringing Capital Onshore | Opinion","Widespread availability of these assets could alter the regulatory landscape for individuals, companies, and governments – allowing them to transact in the world’s standard currency of choice while remaining outside the U.S. regulatory structure. This would be particularly useful when those people want to move money across borders or buy goods that are globally priced in U.S. dollars, such as oil.","Not everyone really wants a synthetic stablecoin. Their share of the market is relatively small compared to stablecoins that are wholly or partially backed with U.S.-dollar-denominated assets. When it comes to risk and cost, a U.S. dollar stablecoin that is backed with U.S. dollars or U.S. -dollar-denominated assets like U.S. Treasury bonds̅ by far the lowest risk option. It’s clear that many users prefer this to other choices for that reason.","The implications for U.S. policy are significant. Widespread adoption of these assets could diminish the power of sanctions and the reach of U.S. regulatory structures. To head off that risk, perhaps the simplest strategy for the U.S. is to speed up the approval and regulatory integration of existing U.S.-dollar-backed stablecoins.","The U.S. dollar is more than just a currency; it’s a strategic asset for the United States and a global symbol of our national resiliency and economic power. That’s worth protecting."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"Asia","content":"LOCATION"},{"type":"Bank of International Settlements","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"25%","content":"PERCENT"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Eastern Europe","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Paul Brody"],"authors":["Paul Brody"]}