{"summary":"The U.S. derivatives regulator approved a proposed rule that punctuates a long-standing legal dispute between the agency and predictive markets platforms.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/10\/us-cftc-proposes-ban-on-political-event-contracts\/","publishDate":"2024-05-10T16:11:49","id":14564,"type":null,"title":"U.S. CFTC Proposes Ban on Political Event Contracts","category":["Policy"],"content":["The U.S. Commodity Futures Trading Commission (CFTC) proposed a formal rejection of event contracts that bet on the outcome of political activity in a vote on Friday, beginning an effort to wall off U.S. customers from platforms that allow the trading of predictive contracts.","The agency has conducted a years-long legal fight with such firms, and the proposed rulemaking approved by the three Democratic appointees to the U.S. derivatives agency would declare trading on political outcomes as \"contrary to the public interest\" and legally equate them with illicit contracts on war, terrorism and assassination. Agency officials also noted that the CFTC is not a gambling regulator, and the agency wouldn't be capable of ensuring market integrity in this field.","Prediction platforms including PredictIt, Polymarket, Zeitgeist and Kalshi give users opportunities to buy contracts on the outcomes of actual events, including elections and policy developments, and they've been popular in crypto circles. Buyers make yes-or-no bets that pay off if they're right and cost them money if they're wrong. Contracts on political contests, awards contests and the outcome of games would be banned for U.S.-regulated companies under the proposal.","\"Contracts involving political events ultimately commoditize and degrade the integrity of the uniquely American experience of participating in the democratic electoral process,\" Chairman Rostin Behnam argued in the Friday meeting. \"To be blunt, such contracts would put the CFTC in the role of an election cop.\"","Behnam had signaled in March that this proposal was coming, and the draft rule that moved forward today still needs to pass through a 60-day period of public comments and then a process to approve a final rule.","During the Friday meeting, Commissioner Caroline Pham – one of the opponents of the proposal – called it a \"stunning overreach.\" She also criticized the agency's legal and enforcement track record and suggested a need for Government Accountability Office review of the regulator.","\"A third-party review can help us get back to the basics and on track,\" Pham said.","Commissioner Summer Mersinger also voted against the proposal.","Because the rule had such a significant enforcement aspect, Commissioner Christy Goldsmith Romero called it a \"dereliction of their duties\" that the agency's enforcement staff wasn't on hand for Friday's meeting.","Brian Quintenz, a former CFTC commissioner and current adviser to prediction markets company KalshiEx (which is suing the regulator for denying its own effort to launch election markets), said in an email to CoinDesk that this move represents \"bad government.\"","\"Instead of regulating these new markets and letting them flourish responsibly, the Commission is simply going to ban a large swath of it. \"Financial regulation should be based on data and the law, not ignorant preconceptions. Further, the Commission is creating huge amounts of uncertainty and is already pushing individuals who need these risk management tools to offshore and unregulated venues, potentially exposing consumers to significant harm.\"","Nikhilesh De contributed reporting.","UPDATE (May 10, 2024, 19:10 UTC): Adds KalshiEx reference.","Edited by Nikhilesh De."],"entity":[{"type":"Brian Quintenz","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Caroline Pham –","content":"PERSON"},{"type":"Rostin Behnam","content":"PERSON"},{"type":"U.S. Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Kalshi","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Polymarket","content":"LOCATION"},{"type":"May 10, 2024","content":"DATE"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Christy Goldsmith Romero","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Pham","content":"PERSON"},{"type":"Government Accountability Office","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"}],"hashtag":["Regulations","Prediction Markets","PredictIt","Kalshi","Polymarket","Commodity Futures Trading Commission"],"authors":["Jesse Hamilton"]}