{"summary":"Ngako is a speaker at this year's Consensus festival, in Austin, Texas, May 29-31.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/05\/08\/kgothatso-ngako-how-i-brought-the-machankura-bitcoin-app-to-africa\/","publishDate":"2024-05-08T21:25:59","id":14573,"type":null,"title":"Kgothatso Ngako: How I Brought the Machankura Bitcoin App to Africa","category":["Consensus Magazine"],"content":["Ever since Satoshi Nakamoto dropped the white paper, one of the selling points of bitcoin has been, “You don’t need a bank. All you need is a smartphone.”","But what if you don’t have a smartphone?","This is the case for millions of people in Africa, which is why Kgothatso Ngako, a former software developer for Amazon, created the no-frills app called Machankura.","Kgothatso Ngako is speaker at this year's Consensus festival, in Austin, Texas, May 29-31.","Or maybe “app” is misleading, as it’s designed to work on simple phones that lack touchscreens or cameras or the bells and whistles of an iPhone. All you need is the ability to text. Using the Lightning Network, Machankura (slang for “money”) lets users send and receive bitcoin, with or without the internet.","This is something most of us take for granted. Consider a bitcoin wallet address: Usually it’s something that looks like “37LaxH5ihB5hZMXs72fofA8qzanipuWTF!” Typing it in manually would ruin your week. If you make a typo – and you’ll make a typo – your bitcoin is lost forever.","Thankfully we can copy and paste this monster using our laptop or smartphone. But without a smartphone? “The user may not have copy-and-paste-functionality,” says Ngako. “But bitcoin has these wonderful things called lightning addresses, which are like an email.” Now, users of Machankura can use bitcoin by just typing in normal-looking numbers and email addresses.","Before heading to Austin for Consensus, Ngako shares how Facebook did something smart that inspired Machankura, how its 15,000 users are spending bitcoin, and why the usage patterns in Africa are, in a sense, surprisingly similar to the patterns in the United States.","Interview has been condensed and lightly edited for clarity.","Before creating Machankura, you helped spread the word about bitcoin in Africa. How so exactly?","Kgothatso Ngako: I grew up in a township called Mamelodi. So the main barrier at the time was that a lot of the literature that explains Bitcoin is in English, right? But we have all these different African languages. So if somebody is intrigued by Bitcoin and they don't speak English, how would they get content to learn about it? So we started an organization called Exonumia. Its aim is to translate Bitcoin literature into African languages.","What Bitcoin literature did you use? I’m guessing the white paper?","Yeah, the white paper. A few simple ones. The email Satoshi sent out when Bitcoin version 0.1 released, and Hal Finney's reply to that. And, of course, the \"I Am Hodling\" post.","Classic.","And a few others, like Understanding Lightning Network and The History of Bitcoin and the Kenya Government. We're also translating a few books, like “The Blocksize War\" and \"21 lessons.\"","And then eventually you launched Machankura. What was the goal?","So I’m trying to tell as many people as I can about Bitcoin with my translated articles, but I’m met with all these problems. A person may not have a smartphone. If they have a smartphone, they don’t have data bundles on it. If they do have interest or you give them a Wi-Fi hotspot, they don’t have enough space on their phone.","All of these problems are solved by having a service that a person does not have to install on their phone, and does not have to pay to use. So USSD [Unstructured Supplementary Service Data] is pretty much that. It’s like a website that is reverse-billed. Look at what Facebook does in developing countries, and I think Twitter did as well. Facebook is available for free, right? People on a mobile cellular connection can access Facebook without paying to access Facebook, because Facebook will settle the bill with the telecom at a later time. So most USSD interfaces work on a similar principle.","So what does that look like from the user’s experience, exactly? Especially if they’re not using a smartphone?","The user may not have copy-and-paste-functionality. But bitcoin has these wonderful things called lightning addresses, which are like an email, but for human-readable addresses. So mine is kgothatso@8333.mobi. I can share this with pretty much everyone. And alternatively, if someone has my number, 0739 383 807, they could also use that as my lighting address.","This is your phone number?","Yeah. So whether or not you have copy-and-paste functionality, if you have Bitcoin, you can type out either of the two. And then you can send me Bitcoin.","Amazing. How many users do you have, and where are they?","So we’re at almost 15,000 users now. We’re in a few countries — South Africa, Nigeria, Kenya, Ghana, Malawi, and so on and so forth.","What are some of the things people are doing with it?","In South Africa, we have a concept called Stockpile. In other places it has other names. In Kenya they call it a “chama.” Effectively, it’s a tabletop accounting.","You come together as a group of people in somebody’s home, and you put money on the table. And if we all contributed an equal amount each month, we’re going to distribute it at the end of the year, or maybe buy groceries or whatever in bulk.","Interesting. So this is a way to nudge people to save money, through positive peer pressure and accountability?","Yes. And also it can be an economic “starter pack” for people in the group, to help them buy in bulk. This would satisfy a minimum purchase order that one person couldn’t do on their own, but the group can.","Am I right that instead of trying to get merchants to accept Bitcoin — which can be tricky — they’re mostly using bitcoin to purchase gift cards? And where are they spending it?","Yes. The top culprits are [internet] airtime, electricity, and groceries. And if you have a gift card for a grocery store in South Africa, you effectively have so much you can do with your bitcoin. You can pay your bills because some grocery stores let you pay your bills at the till, you could book a bus trip, you can even pay for a flight at the grocery store.","How many users, from what you can tell, are using Bitcoin as the primary way to pay their bills and get through life?","That's not a lot of users. That's a very small number of users from the total. And a lot of people are still working normal jobs that do not pay Bitcoin, right? So maybe it’s like 10% or 20% of the total users.","So what’s the main thing that people are using it for?","Exploration, I think. That's the major thing. A lot of people are saying, “Okay. I've heard about this Bitcoin thing. So how do I use it?\" So a lot of people create an account and then look around, and then you're like, \"Oh, okay. This person hasn't came back.\" And then an all-time high comes around, and then that person is back again.","Honestly, that sounds very similar to how people use bitcoin in the U.S.","That’s exactly how it is.","Thanks Kgothatso, good luck with the project and see you at Consensus."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"May 29","content":"DATE"},{"type":"Austin","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"South Africa","content":"LOCATION"},{"type":"20%","content":"PERCENT"},{"type":"Ghana","content":"LOCATION"},{"type":"Malawi","content":"LOCATION"},{"type":"Ngako","content":"PERSON"},{"type":"Kgothatso Ngako","content":"PERSON"},{"type":"Mamelodi","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Hal Finney","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Kenya","content":"LOCATION"},{"type":"Ngako","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"31","content":"DATE"},{"type":"Texas","content":"LOCATION"},{"type":"Exonumia","content":"ORGANIZATION"},{"type":"Machankura","content":"ORGANIZATION"},{"type":"Nigeria","content":"LOCATION"},{"type":"USSD [Unstructured Supplementary Service Data]","content":"ORGANIZATION"},{"type":"Africa","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Opinion","Consensus 2024"],"authors":["Jeff Wilser"]}