{"summary":"To properly regulate stablecoins in the U.S., look at e-money abroad, says Marcelo Prates, a speaker at Consensus 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/opinion\/2024\/05\/09\/how-the-us-should-regulate-stablecoins\/","publishDate":"2024-05-09T19:54:12","id":14572,"type":null,"title":"How the U.S. Should Regulate Stablecoins","category":["Opinion"],"content":["In a recent podcast, Hilary Allen, a law professor at American University, painted stablecoins as a dangerous threat to the banking system and, ultimately, to the public at large. In her view, stablecoins could destabilize banks and eventually require a government bailout.","Her comments come amid a new push in the U.S. Congress for regulating stablecoins at the federal level. Although the chances of any stablecoin bill being enacted into law in a year of presidential elections are slim, Allen is concerned that these bills are “giving public backing to stablecoins.” For her, “stablecoins serve no important purpose and frankly just should be banned.”","Marcelo M. Prates, a speaker at Consensus 2024, is a financial policy and regulation expert writing about money, payments, and digital assets.","Are her concerns valid? Only for those who are against competition and don’t like regulatory clarity. What Allen depicts as a scary and useless fad is an upgraded version of one of the most revolutionary financial innovations in the last 25 years: electronic money, or simply e-money, issued by non-banks.","In the early-2000s, the European Union decided it was about time for more people to have access to faster and cheaper digital payments. With that in mind, E.U. legislators developed a regulatory framework for e-money and allowed start-ups making the most of technology, the so-called fintech, to provide payment instruments in a regulated and safe way.","The idea behind it was simple. As banks are complex institutions providing multiple services and are subject to higher risks and increased regulation, opening a bank account to make digital payments was usually difficult and costly. The solution was to have a separate licensing and regulatory regime for non-banks focused on one service: transforming cash they received from their customers into e-money that could be used for digital payments either through a prepaid card or an electronic device.","In practice, e-money issuers work like narrow banks. They are legally required to safeguard or insure the cash they receive from their customers so that e-money balances can always be converted back to cash with no loss of value. As they are licensed and supervised entities, customers know that, aside from gross regulatory failure, their e-money is safe.","It's thus easy to see that the vast majority of existing stablecoins, those denominated on a sovereign currency like U.S. dollars, are just e-money with a kick: as they are issued on blockchains, they are not restricted to a national payments system and can circulate globally.","Instead of a scary financial product, stablecoins are really “e-money 2.0,” with the potential to keep delivering on the original e-money promises of increasing competition in the financial sector, lowering costs for consumers, and advancing financial inclusion.","But for these promises to be fulfilled, stablecoins do need to be properly regulated at the federal level. Without federal law, stablecoin issuers in the U.S. will continue to be subject to state money transmitter laws that aren’t uniformly designed or consistently enforced when it comes to segregation of clients’ funds and integrity of assets kept in reserve.","Considering the decades-long experience of the European Union in e-money and improvements brought by other countries, an effective stablecoin regulation should be built around three pillars: granting of a non-bank license, direct access to central-bank accounts, and bankruptcy protection for backing assets.","First, it’d be contradictory to restrict stablecoin issuance to banks. The essence of banking is the possibility of holding deposits from the public that aren’t always 100% backed, which is traditionally known as “fractional reserve banking.” And that happens so that banks can make loans without using only their capital.","For stablecoin issuers, on the other hand, the goal is that each stablecoin is fully backed with liquid assets. Their sole job is to receive cash, offer a stablecoin in return, hold safely the cash received, and return the cash anytime someone comes with a stablecoin to redeem. Lending money isn’t a part of their business.","Stablecoin issuers, much like e-money issuers, are meant to compete with banks in the payments sector, especially in cross-border payments. They’re not supposed to replace banks or, worse, become banks.","That’s why stablecoin issuers should be granted a specific non-bank license, as happens for e-money issuers in the E.U., U.K., and Brazil: a simpler license with requirements, including capital requirements, that are proportionate to their limited activity and lower risk profile. They don’t need a banking license, nor should they be required to get one.","Second, and to reinforce their lower risk profile, stablecoin issuers should be able to have a central-bank account to hold their backing assets. Transferring the cash received from their customers to a bank account or investing it in short-term securities are typically safe options, but both can become riskier in times of stress.","Circle, a U.S. stablecoin issuer, had a hard time when Silicon Valley Bank (SVB) failed, and $3.3 billion of its cash reserves (almost 10% of the total reserves) that had been deposited with SVB were temporarily unavailable. And several banks, including SVB, that were holding U.S. treasuries suffered losses after interest rates rose in 2022, and the treasuries’ market price declined, leaving some of them short on liquidity and unable to face withdrawals.","Read more: Dan Kuhn - What Visa’s ‘Organic’ Stablecoin Report Misses","To avoid problems in the banking system or the treasuries market spilling over to stablecoins, issuers should be required to deposit their backing reserves directly with the Fed. This rule would effectively eliminate credit risk in the U.S. stablecoin market and enable real-time supervision of stablecoins’ backing — no need for deposit insurance and no bailout risk, just like e-money and contrary to bank deposits.","Note that central-bank accounts for non-bank institutions wouldn’t be unprecedented. E-money issuers in countries like the U.K, Switzerland and Brazil can keep users’ funds safeguarded directly with the central bank.","Third, customers’ funds should be considered by law segregated from the issuer’s and not subject to any insolvency regime if the stablecoin issuer were to fail — for example, because of the materialization of operational risks, like fraud.","With that additional layer of protection, stablecoin users could quickly regain access to their funds during a liquidation process, as general creditors of the bankrupt issuer wouldn’t be able to seize customers’ funds. Again, something like what’s considered the best practice for e-money issuers.","In the public debate about stablecoin regulation, alarming takes might impress a distracted audience. But, for those paying attention, balanced arguments based on successful examples and experiences from around the world should prevail.","Edited by Benjamin Schiller."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"E.U.","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"last 25 years","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"fintech","content":"ORGANIZATION"},{"type":"100%","content":"PERCENT"},{"type":"Allen","content":"PERSON"},{"type":"Silicon Valley Bank (SVB","content":"ORGANIZATION"},{"type":"European Union","content":"LOCATION"},{"type":"American University","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Brazil","content":"LOCATION"},{"type":"Dan Kuhn","content":"PERSON"},{"type":"Marcelo M. Prates","content":"PERSON"},{"type":"$3.3 billion","content":"MONEY"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Hilary Allen","content":"PERSON"},{"type":"SVB","content":"ORGANIZATION"},{"type":"2000s","content":"DATE"},{"type":"ups","content":"ORGANIZATION"}],"hashtag":["Opinion","Consensus 2024"],"authors":["Marcelo Prates"]}