{"summary":"At the Mar-a-Lago dinner, Donald Trump wooed a constituency Joe Biden has thoroughly snubbed. But the presidential candidate isn't exactly fluent in cryptocurrency policy.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/05\/11\/trumps-pro-crypto-bluster-at-nft-gala-lacked-policy-substance\/","publishDate":"2024-05-11T16:00:00","id":14575,"type":null,"title":"Trump’s Pro-Crypto Bluster at NFT Gala Lacked Policy Substance","category":["Policy"],"content":["PALM BEACH, FL. — During his first stint in the White House Donald Trump was no fan of cryptocurrencies; he once tweeted they were \"based on thin air.\" He later sold millions of dollars worth of NFTs. This week, he rebranded himself as crypto's candidate of choice.","\"If you’re in favor of crypto you’re gonna vote for Trump because they want to end it,\" he said at a Wednesday night party in Mar-a-Lago, referring to Democrats and President Joe Biden. He also vowed to make sure his campaign can accept crypto donations.","The 77-year-old candidate's apparent turnabout came as little surprise to his audience of some 200 supporters. Many had bought $10,000 of Trump Trading Card NFTs to join this surreal, sweltering outdoor reception at the former President's Floridian palace. A CoinDesk reporter also attended (as a +1).","For nearly an hour, Trump fielded questions from a sea of sweat-drenched suit-wearers. Only a handful of them focused on crypto, an incredibly niche wedge issue that was the nominal anchor of the entire event.","But it was enough to make a few things clear:","One exchange highlights points 1 and 3 (we will return to 2 later). When asked how he felt about central bank digital currencies (CBDCs) and \"government blockchains\" (two things that crypto proponents generally oppose) Trump responded \"I think it all has its place.\"","He continued:","\"We have some incredible things happening, I mean crypto, if you go back to crypto a couple years ago, people said it wasn’t gonna make it but now it's up in record numbers. I guess you could say it's a form of currency and I think I’m for that, more and more I’m for that.\"","The substance of Trump's support for crypto might be less important to the industry's (likely small) cadre of single-issue voters than the fact he's saying anything positive about it. Trump appears to be the first major party presidential candidate that's embraced crypto.","On the other side of the race is an openly hostile presidential administration. Joe Biden's SEC chairman Gary Gensler is waging lawfare against many parts of the crypto industry. And earlier Wednesday, hours before his opponent's golf-resort gala, the President vowed to block a House effort to dismantle an SEC accounting rule for crypto that political opponents argue has hampered the industry's growth.","\"Biden doesn’t even know what it is. If you ask Biden, 'Sir, are you for or against crypto?' he’ll say, 'What’s that? Get me off the stage.' He has no idea,\" Trump said. Whether or not that somewhat plausible presumption is true, Trump followed up with an attack on Gensler, an official well-versed in crypto.","\"I’ll say this: I’m fine with it, I want to make sure it's good and solid and everything else but I’m good with it,\" Trump said of crypto. He later said, \"If we’re gonna have what we have then we’re going to have to embrace a lot of things that not everybody likes.\"","Hours before Trump's impromptu Q&A, the Biden campaign team roasted \"people suckered into paying as much as $10,000 for simple digital images of him\" in an email to supporters. The email blasted Trump for holding a glitzy NFT dinner instead of campaigning during his midweek break from court.","But Trump was campaigning on Wednesday night. He was vying for votes from the exceptionally loud crypto crowd that Biden had thoroughly snubbed. Sure, only a few hundred heard him firsthand. Their videos of Trump's pro-crypto musings ricocheted across social media and triggered a torrent of media coverage for crypto's self-appointed political champion.","\"There's 50 million crypto holders in the U.S. That's a lot of voters,\" Ryan Selkis, the CEO of crypto data platform Messari claimed to Mar-a-Lago's packed ballroom where VIPs (those who bought $10,000 of NFTs ) mingled with dinner attendees (who paid $4,700). Trump had unexpectedly called Selkis onstage.","The soundbites that emerged from Wednesday's NFT gala may accelerate crypto's polarization by locking it in the same us-or-them shackles that bind much of American politics. Bitcoin's libertarian roots hardly resonate today; crypto has its proponents on both sides of the aisle.","Republican politics' most powerful voice cast crypto's bipartisan reality aside in declaring Democrats want to kill it off. \"The Democrats are very much against it,\" Trump said, hours after 21 of the House's 213 Democrats voted to repeal the SEC accounting rule.","Trump framed himself as the industry's only hope. His fluency in the industry's issues was spotty. Asked how he would change hostile U.S. policies that drive crypto businesses out of the country, he said: \"We'll stop it, because I don't want that, I don't want that. I want that – if we're going to embrace it then we have to let them be here.\"","There was one area of crypto where Trump spoke more-or-less expertly: his NFTs. Three collections of Trump NFTs – digital trading cards that depict an uber-jacked Donald in various states of patriotism – have generated millions of dollars in sales. Wednesday's dinner gala celebrated high-rollers who bought into his \"Mugshot Edition\" third collection.","\"We did it when NFTs were not hot and we made NFTs hot again,\" Trump claimed of his cards, adding that some NFT buyers made tens of thousands of dollars on the resale market.","Asked by one attendee if he would sell a fourth NFT collection, the longtime businessman demurred. \"I believe in supply and demand. And as you know 1 did great, 2 did great, 3 did great. At some point maybe that turns around.\"","He polled the audience: How many Mugshot high-rollers wanted a series 4 collection of NFTs? Most raised their hands. Trump sounded bewildered: \"Based on supply and demand, wouldn’t that maybe keep your prices, of the stuff you already bought, wouldn't that keep it lower?\" He tested their resolve. \"Who would like not to see a fourth collection for that reason?\" Only a couple of hands shot up.","\"Ok, a couple of economists,\" Trump said to the laughter of the crowd.","Edited by Marc Hochstein and Nikhilesh De.","\n"],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Trump","content":"ORGANIZATION"},{"type":"White House Donald Trump","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Trump NFTs","content":"ORGANIZATION"},{"type":"night","content":"TIME"},{"type":"FL","content":"LOCATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"$10,000","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Trump","content":"PERSON"},{"type":"Donald","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"\" Trump","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Joe Biden","content":"PERSON"},{"type":"Trump Trading Card NFTs","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"$4,700","content":"MONEY"}],"hashtag":["Election 2024","NFT","Donald Trump"],"authors":["Danny Nelson"]}