{"summary":"Known for her fiery dissenting opinions, \"Crypto Mom\" discusses how the SEC operates, why she wants to see crypto thrive and her \"Safe Harbor\" proposal to allow projects to decentralize.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/10\/what-are-we-waiting-for-sec-commissioner-hester-peirce-discusses-moving-crypto-regulation-foward\/","publishDate":"2024-04-10T15:21:12","id":14584,"type":null,"title":"'What Are We Waiting for'? SEC Commissioner Hester Peirce Discusses Moving Crypto Regulation Forward","category":["Consensus Magazine"],"content":["The U.S. Securities and Exchange Commission is not a monolithic institution. Look no further than Hester Peirce (a.k.a. Crypto Mom), who is currently serving her second term as one of five overseeing commissioners. Over the past several years, Peirce has made a reputation as a defender of cryptocurrencies and blockchain technology — writing innumerable dissenting opinions regarding the many legal actions the SEC has waged against crypto protocols and companies.","SEC Commissioner Hester Peirce will speak at Consensus 2024 this May. Grab your pass here.","To some extent, Peirce’s disagreements with SEC Chair Gary Gensler stem from their varying philosophical and political beliefs. Peirce, a Republican and member of the Federalist Society, thinks the government should have a limited hand in regulating commerce. Whereas Gensler, who swims in Democratic circles, is often harder to pin down. While Gensler has seemingly evolving opinions on crypto (having appeared as a blockchain supporter while teaching the subject at MIT), Pierce has remained steadfast in her support of economic innovation.","“It’s a fundamental American principle that people are free to make choices. The government is not there to protect people from their own choices,” Peirce told CoinDesk in an interview. This view colors Peirce’s opinions on whether the SEC should block spot ETH exchange-traded funds (ETFs), go after U.S.-based exchanges like Coinbase and Kraken as well as what role agency should play in overseeing crypto markets.","CoinDesk caught up with Commissioner Peirce ahead of Consensus 2024, where she’s scheduled to speak this May, to discuss the SEC’s enforcement actions, her distaste of Big Banks and where U.S. crypto regulation first went wrong.","Hi mom. To start off with an easy one, would you be able to describe the fundamental split in opinion that you have with SEC Chair Gary Gensler?","It's not an easy question.","Just to start out, look, the views I represent and will reflect are my own views, not necessarily those of the SEC or my fellow commissioners, so I can't speak for anyone else at the commission.","Are you talking about crypto specifically or about the universe of issues?","I wanted to maybe widen the scope. What are your fundamental political or philosophical differences?","So, in terms of philosophy — I have the view that I don't necessarily know what's best for other people. We have our statutory mandates that we have to implement. But within those mandates, we're often given discretion. And if we have discretion, my preference is to say, well, let's let market participants make a decision about what they want to do. Now, sometimes there's a reason that we have to step into the middle of a transaction, and say “No, you can't do that” or “Yes, you can do it, but you have to do it in this particular way.” But we better have a really good reason for stepping into the middle of that transaction.","See also: SEC in 'Enforcement-Only Mode' for Crypto, Commissioner Peirce Says","It’s a fundamental American principle that people are free to make choices. The government is not there to protect people from their own choices. It's there to protect people if someone else harms them, but not to make their life decisions for them.","In the past, you've been critical of big banks but have also argued that the regulatory response to the Great Financial Crisis was offbase. I’m wondering if this somehow connects to your interest in crypto?","I think my interest in crypto stems from a couple of things. First, I think it's a good test for how we handle innovation — or maybe a bad test in the sense that I think we're not passing it. Crypto came to us with a lot of new players and a lot of new ideas. I think we should have figured out how to work with these new players and figure out a way how they could do what they wanted to do in a way that would be compliant, but also allowed them to move forward.","There is a connection in the sense that when I look at the financial crisis — a lot of people have looked at it and come to different conclusions about the causes — one of the things going on was poor regulatory design. A regulatory design that led to everyone making the same dumb mistake at the same time. One way to address that is to build resilience into the system, and having heterogeneity in the system is a good way to build resilience. There are some interesting concepts within crypto that allow for more decentralization of the financial system.","So yes, in that sense, there's a connection. But do I think that the decentralized future is going to replace centralized intermediaries in the financial system? My prediction would be not; people want to deal with a centralized intermediary. But I think that there will be a role for decentralized finance. Maybe it's in the background. Maybe it’s more than that. I predict most people will access it through a centralized intermediary. I could be wrong.","You don't have to answer this question, but do you hold cryptocurrencies?","Because I work on these issues all the time. I do not, and would not even if I could. I feel like there'd be a conflict. If you work on these issues, you can't have crypto, basically. I'm speaking only for what the rules are that apply to me.","A question from my editor: Prometheum; what's going on there? Is this an example of the SEC picking winners?","I'm not going to speak to any particular entity. Nice try.","That's fair enough. Your Safe Harbor proposal is common sense, but in the intervening years since you've published it, I think it's arguably become clear that maybe three years is too short of a time for protocols to decentralize. Solana, Cardano, even Ethereum to an extent have centralized entities directing development — the non-profit organizations founded alongside the network. Do you think we should be thinking about decentralization on a longer timeline? Decades?","Again, decentralization is not an end in itself. It is the right thing in certain circumstances. However, sometimes having a centralized entity is the right thing. We should all take a step back and think about what we're trying to achieve. And fundamentally, what we need to achieve is the ability for people to know whether or not they're dealing with a security, so when they do something or sell something they understand whether it’s a securities offering.","They need to know that in the primary and secondary markets. Then, if we decide that certain crypto assets are securities, or that it doesn't make sense to adjust the rules, there is a sensible framework that makes sense for crypto assets. Does it make sense to set up some sort of disclosure regime for centralized entities? That's really a congressional decision. But we can't even really have these conversations at the SEC right now because the conclusion is just to apply exactly the same rules that apply to stocks and be done with it — and I just don't think that works.","But just taking a step back and thinking about what we're really trying to solve might take some pressure off the decentralization question.","How closely do you or the other four commissioners work with the Enforcement Division. Do you suggest cases to litigate?","So, just to give you a sense of how things work on the enforcement side. As with the rulemaking side, it's the staff that does the bulk of the work. They consider a rule and will propose it for us and we'll consider it. Often the vote happens at a public, open meeting. With enforcement actions, we also get recommendations. Typically, the staff will recommend authorizing an enforcement action and settling it at the same time. So we often don't see the case until the end, and are not involved in the guts of the matter. So we're either going to authorize the division to sue or authorize you to sue and settle with them on the same day. Most of our cases settle like that right away. The voting happens in a process called seriatim, where we're just voting on the papers, or we vote at a meeting where we have a discussion, but those meetings are, as you might guess, not open to the public.","So in a way, if there was a change in the presidential administration in the upcoming election, then the current enforcement regime could continue, more or less, as is?","I think these are great questions because the structure of the agency is a little strange. Strange in the sense that it's not like a lot of other agencies that have a single head. But while there are five of us commissioners, Chair Gensler does have the authority to set the rulemaking agenda and staff also report to him. The chair can certainly push the direction that things go, but you're right, it's not as if when a new chairman comes in all the existing enforcement investigations just stop. The agency is designed to keep going.","Would you take the job if Trump or Tulsi were elected?","That's not even on the radar.","No?","Yeah, I'm focused on The Now, and trying to try to shift us to a better place. I've been here for six years, and it's very discouraging to see that we have not taken a productive path at all. To me, it's inevitable that we'll have to take a productive path at some point — so why not start now? What are we waiting for?","This isn't a question about the present, but I am curious in what ways the agency has changed since your first couple of stints during the early 2000s at the SEC?","Over the years we've gotten progressively more prescriptive in our rulemaking approach. An issue I raised in a speech last week is that we've gotten less willing to engage on some of the difficult issues with the staff and the public. That has not been a positive set of changes.","Is there any reason to believe or to hope that the spot market ETH ETF process won't unfold similarly to what happened with the spot market bitcoin ETFs?","I can't talk about that one because we've got some applications under consideration.","Do you think the 2017 DAO Report set the crypto regulation off on the wrong foot?","Yeah, I do. Because I think that the facts of the DAO Report are different from the facts of most crypto offerings that we see, right? The facts were unique. And I just don't think that the legal analysis that we've applied to thinking about tokens has been helpful for really getting to the crux of the issue.","See also: SEC Blasts 'Purportedly Decentralized' DAOs in $1.7M Barnbridge Settlement","So if I could rewind — I wasn't here at the time of the DAO report, though I’ve learned a lot in that time — I would change the way we approach things.","Do you agree with Judge Failla’s interpretation in the XRP case, that tokens aren't necessarily securities, but when you sell them to qualified investors it’s an investment contract?","Well, again, because that's litigation, I don't want to talk about any particular judge's opinion. But as I have said, in other contexts, when you think about an investment contract, whether it's a digital asset or some other kind of a tangible asset, the asset itself is not the security on its own. It’s when you offer that asset along with an investment contract that’s what makes a security a security. It becomes the object at the center of the investment contract. But you still have to think about those two things as distinct. The orange groves in Howey were not on their own securities.","Your dissenting opinions are often quite artful. Was it your idea or your co-author Mark Uyeda’s idea to include a play in the ShapeShift document?","I can't answer that question either.","Thanks again for your time.","Well, I appreciate you taking the time and I hope you have a great afternoon."],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"Pierce","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"$1.7","content":"MONEY"},{"type":"M Barnbridge Settlement","content":"ORGANIZATION"},{"type":"MIT)","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Big Banks","content":"ORGANIZATION"},{"type":"Cardano","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Enforcement Division","content":"ORGANIZATION"},{"type":"Failla","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Peirce","content":"PERSON"},{"type":"Mark Uyeda","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"Great Financial Crisis","content":"ORGANIZATION"},{"type":"SEC Commissioner Hester Peirce","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"2024 this May","content":"DATE"}],"hashtag":["Opinion","The Node","Newsletters","SEC","Hester Peirce","Gary Gensler","Decentralization","Consensus 2024"],"authors":["Daniel Kuhn"]}