{"summary":"In this week's issue of The Protocol newsletter, we dive into the crypto industry's fundraising method du jour – it's all about the decentralization! PLUS: Polyhedra says its ZK prover is 2x faster than anyone else's.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/05\/08\/the-protocol-from-node-sales-to-address-poisoning-the-moneys-in-crypto\/","publishDate":"2024-05-08T17:50:00","id":14599,"type":null,"title":"The Protocol: From 'Node Sales' to 'Address Poisoning,' the Money's in Crypto","category":["Technology"],"content":["What could be more crypto than raising tens of millions of dollars via a \"node sale?\" In this week's issue of The Protocol, we explain the blockchain industry's newest fundraising method, which explicitly leans on its decentralizing impact.","ALSO:","Tiered node sales, like this one from Sophon, mean that the price goes up, the longer buyers wait (Sophon\/modified by CoinDesk using PhotoMosh)","NODES FOR SALE: It's the blockchain industry's latest innovation – not in technology, but in how to round up cash from investors. \"Node sales\" involve selling blockchain nodes directly to investors – a process that brings in quick cash while ostensibly giving projects an easy path to decentralization. Still a relatively new phenomenon in fast-moving crypto, they are becoming more common: Aethir, a decentralized GPU cloud infrastructure provider, disclosed last week that it had distributed more than 73,000 node licenses valued at over 41,000 ETH ($126 million). Other blockchain projects raising funds via node sales include CARV, XAI Games and Powerloom. The latest to come to market is Sophon, an entertainment-focused blockchain ecosystem based on zkSync technology, relying on Celestia for data. The project attracted more than $60 million in a node sale over the past week, even though its founders are semi-anonymous. Certain mechanics of the sales appear designed to drive the fear of missing out, or FOMO – such as a system of tiering, where the price goes higher as more nodes are sold, and the use of exclusive whitelists that reserve early spots for certain users. \"Buyers hope to get high quality projects,\" says Calvin Chu, a former Binance researcher who helped start Impossible Finance, which has facilitated some of the sales. As with many crypto-related investments, buyers also hope for juicy yields in the forms of token rewards, and possibly to qualify for eventual token airdrops.","'ADDRESS POISONING?' A cryptocurrency user has lost $68 million worth of wrapped bitcoin (WBTC) after falling victim to a type of exploit known as \"address poisoning,\" according to blockchain security firm CertiK. As reported by CoinDesk's Oliver Knight, \"Address poisoning is a technique that involves tricking the victim into sending a legitimate transaction to the wrong wallet address by mimicking the first and last six characters of the true wallet address and depending on the sender to miss the discrepancy in the intervening characters. Wallet addresses can be as long as 42 characters.\" In this case, the exploiter mimicked a 0.05 ether (ETH) transaction before receiving 1,155 wrapped bitcoin (WBTC) from the victim.","STILL WHIRLING. A hacker that stole $125 million from Poloniex's hot wallets in November has sent 1,100 ether (ETH) to sanctioned coin mixer Tornado Cash, according to blockchain data. The developers of Tornado Cash, a blockchain protocol that can be used to obscure the origin and destination of cryptocurrency transfers, are facing charges by U.S. authorities that they conspired to commit money laundering, even though they claim all they really did was write code.","Former New England Patriots and Tampa Bay Buccaneers tight end Rob Gronkowski agreed to pay $1.9 million to settle claims brought against him by former customers of Voyager Digital, a cryptocurrency lender.. This was despite a viral joke at his retired teammate Tom Brady's expense where \"Gronk,\" as the National Football League star is known, was portrayed as having dodged crypto troubles.","A back-and-forth broke out on X over the blockchain project Sui's token supply.","This year, Consensus is hosting its first ever in-person hackathon together with the world's number 1 Web3 learning app, EasyA. This will be a three-day, multi-chain IRL hackathon with world-class sponsors from Sui to Stellar to Polkadot and beyond, and will attract the world’s best developers to build the future of Web3 and raise funding for their projects.","Projects launched by EasyA alumni are valued at over $2.5 billion. The EasyA Consensus hackathon is going to be 2024's most important hackathon yet.","We have a few remaining spots left for hackers, so if you're excited about participating, make sure you sign up here!","Top picks of the past week from our Protocol Village column, highlighting key blockchain tech upgrades and news.","Polyhedra co-founder and CTO Tiancheng Xie (Polyhedra)","1. Polyhedra Network launched an open-source ZK proof system, Expander, \"that can generate proofs nearly 2x faster than alternatives while enhancing security and efficiency of ZK proof process,\" according to the team. According to a blog post, \"Expander can prove 4,500 Keccak-f permutations per second on an Apple M3 Max Machine.\" Keccak-256 is a \"cryptographic hash function standardized by NIST in the secure hash algorithm 3 (SHA-3) and is the hash function used by the Ethereum blockchain,\" according to the post. The new proof system builds on Polyhedra's Libra paper, lead-authored by Polyhedra co-founder and CTO Tiancheng Xie.","2. MetaMask, the most popular crypto wallet for Ethereum, is rolling out a new feature this week designed to help users avoid the consequences of maximal extractable value, or MEV. The optional new feature, called Smart Transactions, will allow users to submit transactions to a \"virtual mempool\" before they are officially cemented on-chain. According to Consensys, the company behind MetaMask, the virtual mempool will protect against certain kinds of MEV strategies, and it will run behind-the-scenes simulations of transactions to help users get lower fees.","3. MicroStrategy (MSTR), the largest corporate holder of bitcoin, unveiled plans to develop a decentralized identity service using Ordinals inscriptions. The goal of \"MicroStrategy Orange\" is to provide \"trustless, tamper-proof and long-lived\" decentralized identities using the Bitcoin blockchain, founder Michael Saylor said at the company's Bitcoin For Corporations conference on Wednesday.","4. Aave Labs, the main developer behind Aave, a DeFi protocol, proposed to develop its \"V4\" as part of a wider grant proposal, involving community feedback and testing, with a timeline starting this quarter and leading to a full release by mid-2024. \"Aave V4 would be built with a completely new architecture with an efficient and modular design, while minimizing the impact on third-party integrators,\" the proposal reads. A key change would be the introduction of a \"unified liquidity layer\" and a new oracle design with Chainlink.","5. Citi, JPMorgan, Mastercard, Swift and Deloitte are among major companies with an interest in financial services teaming up to explore sharing ledger technology by simulating multiasset transactions in U.S. dollars. The research project, titled Regulated Settlement Network (RSN) proof-of-concept (PoC), will explore the potential of bringing commercial-bank money, wholesale central-bank money and securities such as U.S. Treasuries and investment-grade debt to a common regulated venue, according to a statement shared with CoinDesk. The New York Innovation Center of the Federal Reserve Bank of New York will act as a technical observer.","Screengrab from the EIP-3074 proposal (Ethereum.org, modified by CoinDesk using PhotoMosh)","As blockchain teams strive for the holy grail of mainstream adoption, making crypto wallets easier to use is suddenly at the top of the agenda.","Ethereum developers have been moving along with their discussions and inclusions of certain Ethereum Improvement Proposals (EIPs) for the blockchain’s next big hard fork, Pectra.","One of the proposals that has drawn both support and concern from the Ethereum community is EIP-3074, a code change that is supposed to improve the user experience with wallets on the blockchain.","Paradigm Chief Technology Officer Georgios Konstatonopolous said on X that EIP-3074 “is a big deal. Wallet UX will 10x.”","Click here for the full story by Margaux Nijkerk","P.S. THIS JUST IN: Ethereum co-founder Vitalik Buterin has proposed an \"EIP-3074 alternative\" called EIP-7702. It's super technical, but Jarrod Watts, a developer relations engineer with Polygon, put out a good tweet thread about it.","Fundraisings","Lava Network schematic (Lava)","Deals and grants","Data and Tokens","Edited by Bradley Keoun."],"entity":[{"type":"RSN","content":"ORGANIZATION"},{"type":"Keccak","content":"PERSON"},{"type":"New England Patriots","content":"ORGANIZATION"},{"type":"Jarrod Watts","content":"PERSON"},{"type":"Tom Brady","content":"PERSON"},{"type":"CTO Tiancheng Xie (Polyhedra)","content":"ORGANIZATION"},{"type":"$126 million","content":"MONEY"},{"type":"$1.9 million","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"Georgios Konstatonopolous","content":"PERSON"},{"type":"Poloniex","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"CTO Tiancheng Xie","content":"ORGANIZATION"},{"type":"tens of millions of dollars","content":"MONEY"},{"type":"Rob Gronkowski","content":"PERSON"},{"type":"Apple M3 Max Machine","content":"ORGANIZATION"},{"type":"Margaux Nijkerk","content":"ORGANIZATION"},{"type":"3074","content":"DATE"},{"type":"Bitcoin For Corporations","content":"ORGANIZATION"},{"type":"Calvin Chu","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"7702","content":"DATE"},{"type":"Oliver Knight","content":"PERSON"},{"type":"New York Innovation Center of the Federal Reserve Bank of New York","content":"ORGANIZATION"},{"type":"National Football League","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"Sophon","content":"LOCATION"},{"type":"$68 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"$125 million","content":"MONEY"},{"type":"Polyhedra","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Gronk","content":"ORGANIZATION"},{"type":"3","content":"DATE"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Citi","content":"ORGANIZATION"},{"type":"Pectra","content":"LOCATION"},{"type":"Impossible Finance","content":"ORGANIZATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"MicroStrategy Orange\"","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Sui","content":"PERSON"},{"type":"NIST","content":"ORGANIZATION"},{"type":"$2.5 billion","content":"MONEY"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"Tampa Bay Buccaneers","content":"LOCATION"}],"hashtag":["The Protocol","Nodes","Fundraising","Ethereum"],"authors":["Bradley Keoun"]}