{"summary":"Crypto exchange Bybit will offer futures contracts settled in USDC stablecoin.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/154323\/bybit-to-offer-futures-contracts-settled-in-the-usdc-stablecoin","publishDate":"2022-06-27T09:03:09","id":1460,"type":null,"title":"Bybit to offer futures contracts settled in the USDC stablecoin","category":["EXCHANGES"],"content":["<span data-v-f87c67ca=\"\">Crypto exchange Bybit announced on Monday that it will offer futures contracts settled in the stablecoin USD Coin (USDC), rather than bitcoin.<\/span>","<span data-v-f87c67ca=\"\">This is the first time Bybit will offer futures settled in USDC rather than bitcoin, in an effort to give users stable prices for the duration of the contract, according to a statement.&nbsp; The total number of bitcoin futures contracts held by users on its platform — bitcoin futures open interest — is one of the largest of any exchange.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/share-of-open-interest-across-bitcoin-futures-monthly\/embed\" title=\"Share of Open Interest across Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-v-f87c67ca=\"\">CEO and co-founder, Ben Zhou, said in the statement that Bybit was very pleased with how the roll-out of its option trading product went. He went on to say “our derivatives platform has the world’s best liquidity and tightest spread, so traders are ensured the best quote and best execution in the market even during extreme volatility.”<\/span>","Bybit's announcement noted that unlike bitcoin-settled contracts, using USDC allows for stability for the duration of each contract. The move comes at a time when stablecoins have come under renewed scrutiny from regulators and investors, with several high profile stables de-pegging over the past month.&nbsp;","<span data-v-f87c67ca=\"\">Monday’s announcement comes just five days after Bybit was <\/span><a href=\"https:\/\/www.theblock.co\/linked\/153686\/ontario-regulator-fines-bybit-and-bars-kucoin-in-continued-fight-against-unregistered-crypto-exchanges\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">fined<\/span><\/a><span data-v-f87c67ca=\"\"> by the Ontario Securities Commission (OSC), although the exchange committed to working with the regulator as part of the settlement.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Founded in Singapore in 2018, Bybit has grown to be the second-largest crypto exchange in futures trading over the past four years to, according to data via The Block Research.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/crypto-markets\/futures\/volume-of-bitcoin-futures-monthly\/embed\" title=\"Volume of Bitcoin Futures\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Monday","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"Ben Zhou","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ontario Securities Commission (OSC","content":"ORGANIZATION"},{"type":"2018","content":"DATE"}],"hashtag":[],"authors":["Adam Morgan McCarthy","The Block"]}