{"summary":"Synapse is the first bridge protocol to launch its own smart contract platform. Here&#x27;s why the team says the new platform is needed.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160329\/why-popular-blockchain-bridge-protocol-synapse-is-launching-its-own-smart-contract-platform","publishDate":"2022-08-02T14:06:33","id":1462,"type":null,"title":"Why Synapse is launching its own smart contract platform","category":["DEFI"],"content":["Synapse announced the launch of its native cross-chain application layer on July 28.","Synapse is the first bridge to launch its own platform for cross-chain applications.","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Synapse, one of the most popular cross-blockchain bridges, revealed last week that it will be the first bridging protocol to develop its own smart contract platform. The firm says the new platform, called \"Synapse Chain,\" will address limitations to the current infrastructure for cross-chain applications.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Since launching in August 2021, Synapse's bridge, which connects various Layer 1 and Layer 2 blockchains, has facilitated more than $11 billion in volume by more than 150,000 users. Now, the goal is to pivot from simply processing swaps across blockchains to enabling the creation of applications that work across multiple blockchains.<\/span>","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/scaling-solutions\/scaling-overview\/value-locked-of-ethereum-l1-bridges\/embed\" title=\"Value Locked of Ethereum L1 Bridges\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">“Developers can birth a whole suite of new primitives with multi-chain state that’s deployed on a single blockchain,\" the company said in its <a href=\"https:\/\/synapse.mirror.xyz\/L6dBb7aXIJ1Ll5_sxP2bIJxVEYNd43ZzIV6dRylQJxw\" data-v-f87c67ca=\"\">announcement post<\/a>. \"These primitives can then be used as building blocks for completely new user experiences and applications that are better tailored to our multi-chain reality.”&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Cross-chain applications are growing in popularity because they allow traders to interact with multiple blockchain ecosystems. But according to the Synapse team, one of the main problems many teams building cross-chain applications are facing is the lack of a single execution environment. Instead, they must deploy smart contracts on multiple chains, which increases security risks,&nbsp; communication barriers and development needs.<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Unlike existing systems, Synapse's platform, and specifically it's cross-chain messaging protocol, will enable developers to deploy a cross-chain smart contract exclusively on Synapse Chain. \"A<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">pplications built on Synapse Chain will be able to execute their business logic across any blockchain,\" the company said.&nbsp;Transactions will settle on Ethereum.&nbsp;<\/span>","Synapse Chain will feature an \"Ethereum-based optimistic rollup design\" for scalability, security, user experience and compatibility with the Ethereum Virtual Machine (EVM).","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Optimistic rollups increase speed and lower fees while maintaining security from Ethereum. <\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">“Instead of needing to bootstrap independent security systems, optimistic rollups enable dapps to leverage the security and decentralization of Ethereum’s base layer, which has the highest security spend out of any generalized smart contract blockchain,” the team said.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">Its compatibility with Ethereum Virtual Machine (EVM) will enable any existing application to be deployed on Synapse Chain and give developers a similar building experience to other EVM chains. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The launch of Synapse Chain and the associated \"Synapse V2\" upgrade will also both have implications for Synapse's native SYN token.<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span><span data-contrast=\"none\" data-v-f87c67ca=\"\">SYN will be used for staking and contributing to the security and consensus of the network, adding a new dynamic to the economic incentives underlying the Synapse ecosystem. <\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","<span data-contrast=\"none\" data-v-f87c67ca=\"\">The team plans to release more details on Synapse V2 over the coming months.&nbsp;<\/span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559739&quot;:160,&quot;335559740&quot;:259}\" data-v-f87c67ca=\"\">&nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Synapse Chain","content":"ORGANIZATION"},{"type":"Synapse","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"July 28","content":"DATE"},{"type":"$11 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":[],"authors":["Mike Truppa","The Block"]}