{"summary":"EigenLayer e protocolos similares de “retomada” são atualmente o investimento mais movimentado em blockchain, mas a Tecnologia T está isenta de riscos.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/restaking-101-what-are-restaking-and-liquid-restaking\/","publishDate":"2024-05-02T16:05:30","id":14623,"type":null,"title":"O que é reestabelecimento? O que é reabastecimento de líquido? O que é EigenLayer?","category":["Learn"],"content":["Em menos de um ano, o rolo compressor de “retomada” do Ethereum , EigenLayer, engoliu mais de US$ 16 bilhões em depósitos de éter (ETH) – ativos digitais que teoricamente serão usados ​​para ajudar a proteger protocolos de Criptomoeda iniciantes.","O Restake – a ideia de usar um blockchain para proteger outros aplicativos – rapidamente se tornou a maior nova tendência de investimento da indústria de Cripto . Novas startups de reestabelecimento parecem chegar toda semana, e indústrias caseiras inteiras, “serviços ativamente validados” e plataformas de “reestabelecimento líquido”, aproveitaram o hype com suas próprias abordagens sobre a tecnologia.","Embora alguns elogiem a reformulação como uma oportunidade de investimento promissora e um grande salto para a segurança Cripto , outros a veem como uma jogada muito mais arriscada – um esquema de rehipoteca que promete recompensas boas demais para serem verdadeiras com base em fundamentos frágeis.","Restake é a resposta mais recente à questão de segurança que está no cerne de tudo na Cripto: como usar jogos econômicos para proteger sistemas de computação descentralizados","No centro de todas as blockchains está a ideia de “descentralização” – onde uma rede amplamente distribuída de operadores, em vez de uma única parte, recebe transações dos usuários, as grava no livro-razão digital da cadeia e garante que todos os outros operadores relatem os dados honestamente. .","Em contraste com blockchains de prova de trabalho como o Bitcoin, onde os “mineradores” gastam poder de computação para KEEP uma cadeia segura, os blockchains de prova de participação como Ethereum e Solana são administrados por “validadores” que “apostam” a moeda para ajudar a administrar o rede.","Leia Mais: Cripto Staking 101: O que é piquetagem?","Os validadores ganham juros como recompensa pelo seu trabalho. Quanto maior for a aposta, mais ganharão em recompensas. A aposta também funciona como garantia; se um validador tentar mentir para o blockchain ou estiver mal configurado, uma parte da aposta será revogada pela rede.","A mecânica exata por trás do staking pode variar de cadeia para cadeia, mas a conclusão importante quando se trata de staking é esta: o custo de atacar (leia-se: drenar dinheiro de) um sistema de prova de aposta é aproximadamente a quantidade de dinheiro que foi investido. apostado em sua defesa. É por isso que o Ethereum, em particular, é considerado tão seguro: há mais de US$ 100 bilhões em ETH apostados nele.","A Restake promete aplicar esse jogo econômico a praticamente qualquer coisa, aproveitando os grandes números de apostas em protocolos existentes para ajudar a proteger aplicativos blockchain iniciantes. Como uma oportunidade de investimento, é apresentada como uma forma de extrair um BIT de interesse extra do staking convencional.","EigenLayer, líder de reestabelecimento do Ethereum, permite que os usuários peguem o ETH que apostaram no Ethereum e depois o reestaquem com os chamados “Serviços Ativamente Validados”, ou AVSs. Hoje, isso são principalmente protocolos blockchain que fornecem suporte para soluções de escalonamento Ethereum .","Os defensores da tecnologia argumentam que o reestabelecimento ajuda a melhorar a segurança de aplicativos blockchain menores, uma vez que eles podem ter dificuldades para sustentar seus próprios sistemas de segurança de prova de participação, visto que isso requer capital substancial e uma comunidade ativa.","Em uma entrevista ao CoinDesk no mês passado, o fundador da EigenLayer, Sreeram Kannan, explicou como isso funciona usando o exemplo de 100 protocolos blockchain, cada um garantido por US$ 1 bilhão em participação: imagine que \"em vez de cada um dos protocolos ter US$ 1 bilhão apostados separadamente, havia US$ 100 bilhões comumente apostados em 100 protocolos\", disse Kannan. \"Para atacar ONE protocolo, agora você precisa de US$ 100 bilhões em vez de US$ 1 bilhão.\"","As especificidades podem parecer diferentes em outros blockchains, mas a essência é a mesma. No Solana, por exemplo, os usuários poderão reassentar o SOL que apostaram naquela rede para ganhar juros extras e ajudar a proteger outros aplicativos.","Reapostar por meio de uma plataforma como EigenLayer normalmente significa depositar o próprio ETH (ou selecionar derivados de ETH ) no protocolo, criar um operador e, em seguida, selecionar quais AVSs garantir em troca de juros.","Uma maneira mais simples de apostar é por meio de serviços de reestaqueamento líquido como Puffer, Ether.Fi e Renzo. Estes são intermediários que retiram activos dos utilizadores, depositam-nos em EigenLayer e plataformas equivalentes, e oferecem recibos, chamados “tokens de restabelecimento de liquidez” (LRTs), que acumulam juros e podem ser negociados em Finanças descentralizadas para obter rendimentos ainda maiores.","As plataformas de reestaqueamento líquido fazem todo o trabalho pesado de configurar o software do operador e selecionar com quais AVSs trabalhar. Os LRTs permitem que os usuários entrem e saiam facilmente de posições de reinvestimento e oferecem aos usuários a capacidade de aumentar sua alavancagem reinvestindo em protocolos Finanças descentralizados.","Os serviços espelham plataformas como o Lido, o gigante de apostas líquidas no Ethereum que aposta ativos em nome dos investidores e oferece um token derivado de apostas líquidas, “Lido staked ETH” (stETH), que rastreia o preço da ETH. StETH é extremamente popular em Finanças descentralizadas, e plataformas iniciantes de reestabelecimento de liquidez esperam replicar o sucesso do Lido com seus LRTs orientados para a conveniência.","Embora investidores, desenvolvedores e empresas de risco tenham adotado o reestabelecimento, alguns temem que a tendência seja a mais recente bomba-relógio da criptografia, uma rehipoteca de confiança que inevitavelmente entrará em colapso.","Eles apontam para o espectro do risco de contágio – a ideia de que se um operador for cortado por um AVS, o impacto poderá repercutir em todo o ecossistema de staking, esgotando o valor de todo o pool de reestabelecimento e reduzindo a segurança de todos os outros AVS. como resultado. (EigenLayer está adicionando um programa de seguro chamado “segurança atribuível” para resolver essa preocupação, mas os detalhes ainda T foram finalizados.)","Com a ascensão dos VLTs surge um medo ainda maior de uma catástrofe em massa. Se os protocolos começarem a alavancar a confiança das pessoas, permitindo-lhes apostar tokens, tokens de aposta líquida e também tokens de re- aposta líquida, então a área de superfície para uma crise de rehipoteca aumentará. Um evento devastador ou um ativo desestruturado poderia derrubar muitos.","Embora já existam versões de segurança agrupada há algum tempo – principalmente no ecossistema blockchain Cosmos – a formulação moderna de “reestabelecimento” permanece mais teoria do que realidade. EigenLayer foi tecnicamente o primeiro protocolo de reestabelecimento a ser lançado na rede principal do Ethereum, mas permanece em beta limitado. O EigenLayer aceita depósitos, mas a maioria de seus principais recursos – incluindo redução – ainda não existia até o momento, e os AVSs só podem se registrar no programa, mas ainda T podem ser implantados.","Leia Mais: EigenLayer, o maior projeto da Crypto lançado este ano, ainda carece de funcionalidades cruciais","O único incentivo para reesquecimento e reesquecimento líquido até agora foram os “pontos”, que são contagens de pontuação rastreadas pelo EigenLayer e protocolos de reesquecimento líquido que os depositantes esperam que estejam vinculados a futuros lançamentos aéreos de ativos digitais.","Os pontos T foram projetados para ter qualquer valor, mas os usuários começaram a comprá-los e vendê-los imediatamente – desencadeando um frenesi especulativo em torno da reafirmação de que algum medo T está fundamentado na realidade econômica e pode levar à decepção e a grandes vendas no futuro. . O EigenLayer e o protocolo de restabelecimento líquido Renzo já mostraram como os sistemas de pontos podem definir expectativas irrealistas: ambos os projetos provocaram fúria no mês passado, quando revelaram planos de lançamento aéreo de tokens que apresentavam cotas menores para ganhadores de pontos do que alguns depositantes haviam previsto.","Um prolífico investidor anjo de projetos Solana disse à CoinDesk que “não havia (ainda)” investido em nenhuma equipe de reestabelecimento para esse ecossistema. Quando questionado sobre o motivo, ele respondeu atrevidamente: “Apenas debatendo quando o reestaque explode a Cripto”.","Danny Nelson contribuiu com reportagem","Editado por Bradley Keoun and Nick Baker."],"entity":[{"type":"Puffer","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"Danny Nelson","content":"PERSON"},{"type":"Leia Mais","content":"PERSON"},{"type":"US$ 100","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Kannan","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Solana disse à CoinDesk","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["EigenLayer","Staking","Restaking","Ethereum","Liquid staking","Lido","Eigenlabs","portuguese"],"authors":["Sam Kessler"]}