{"summary":"Interessado em investir em Cripto, mas preocupado com a pegada de carbono e as preocupações com o consumo de eletricidade levantadas pelos críticos?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/can-crypto-go-green-how-to-invest-in-eco-friendly-cryptocurrencies\/","publishDate":"2022-01-25T15:21:21","id":14638,"type":null,"title":"A Cripto pode se tornar verde? Como investir em criptomoedas ecológicas","category":["Learn"],"content":["Até agora, quase todo mundo já ouviu falar sobre quanta energia a mineração de Bitcoin consome . Apenas para alimentar uma única transação BTC são necessários mais de 2.264 quilowatts-hora (kWh) de eletricidade – o suficiente para ferver 1.500 chaleiras. Mas não é apenas o Bitcoin que tem esse problema. Outras criptomoedas que também utilizam o mesmo mecanismo de consenso de prova de trabalho (PoW) enfrentam o mesmo problema.","À medida que um número crescente de investidores valoriza mais as empresas que enfatizam os princípios ambientais, sociais e de governança (ESG) – especialmente a parte ambiental – os fabricantes de Criptomoeda poderão em breve ter que responder à pergunta: É possível que a Cripto se torne verde?","A crescente conscientização sobre o consumo de energia das criptomoedas, a pressão de pessoas altamente influentes como ELON Musk (que suspendeu os pagamentos de Bitcoin na Tesla devido ao impacto ambiental das criptomoedas) e as medidas repressivas em grandes países como a China estão pressionando a indústria Cripto a se adaptar.","Em resposta a esses Eventos, projetos de blockchain novos e existentes estão explorando tudo, desde a migração para sistemas de validação com menor consumo de energia até a exploração da mineração baseada em energia renovável. Ethereum é talvez um dos exemplos mais proeminentes de um projeto líder de Criptomoeda que está em transição de PoW para um sistema de prova de aposta ( PoS ), com o objetivo de reduzir seu consumo geral de energia em 99,95% .","Ao contrário do PoW, o PoS seleciona validadores com base em quantos tokens nativos do projeto eles bloqueiam em um contrato inteligente de piquetagem. Quanto mais tokens uma pessoa bloquear, maior será a chance de ela ser escolhida pelo protocolo para adicionar novos dados ao blockchain.","Semelhante à mineração, os validadores escolhidos recebem uma quantidade de tokens recém-criados como recompensa pela sua participação. Um dos maiores benefícios deste sistema em relação à mineração de Cripto é que os requisitos de hardware são significativamente mais baixos, o que significa que mais pessoas podem se tornar validadores. Isto, por sua vez, aumenta a descentralização do projeto e melhora ainda mais a segurança da rede. Também tem o benefício adicional de reduzir a quantidade de energia necessária para alimentar a rede.","Leia Mais: O que é prova de participação?","Há também incentivos financeiros crescentes para melhorar a pegada de carbono das Criptomoeda, à medida que as políticas ambientais pesam mais no processo de tomada de decisão dos investidores e os reguladores aumentam o seu foco no uso de energia Cripto .","Desenvolvedores e defensores da Cripto estão fazendo esforços em direção à sustentabilidade do blockchain e do ecossistema Cripto . Organizações como o Cripto Climate Accord , por exemplo, estão trabalhando em direção ao objetivo de ter todas as blockchains alimentadas por energia renovável até 2025, e até produziram um documento de auditoria de 32 páginas para contabilizar o impacto ambiental da Criptomoeda. Em um relatório divulgado recentemente, o Conselho de Mineração de Bitcoin pesquisou 32% de sua rede e afirmou que seus usuários estavam minerando com uma combinação de energia renovável de 67%.","Vários fatores afetam a sustentabilidade e o impacto ambiental de uma Criptomoeda. O uso de energia é um dos mais citados, mas T se trata apenas de qual Criptomoeda consome mais energia. Você também deve levar em consideração de qual combinação de fontes vem esse poder.","Quantas operações mineiras são alimentadas por fontes de energia renováveis, se houver? Qual sistema de validação eles usam? Quanto equipamento físico é necessário para extrair novas moedas?","Leia Mais: O debate frustrante, enlouquecedor e que consome tudo sobre a energia do Bitcoin","Operações de mineração como Equinor e Crusoe Energy reaproveitaram usinas de energia convencionais não utilizadas ou o excesso de Gas da perfuração, que geralmente é queimado para fornecer energia às operações de mineração. Os críticos salientaram, no entanto, que isto T elimina as emissões prejudiciais – apenas as transfere para uma indústria diferente e poderia incentivar novas perfurações.","Também houve tentativas de usar parques solares ou eólicos para abastecer a mineração inteiramente com energia renovável. A empresa de tecnologia Lancium, sediada em Houston, por exemplo, anunciou planos para investir US$ 150 milhões em usinas de mineração renováveis ​​em 2022. E embora isso seja louvável em teoria, pode não ser financeiramente possível construir usinas renováveis ​​para alimentar uma Criptomoeda que poderia despencar inesperadamente em valor . O valor do Bitcoin tende a permanecer alto mesmo quando oscila, mas outras criptomoedas podem não ser capazes de justificar o custo de usinas de energia inteiramente novas simplesmente para extraí-las.","Para resolver essas deficiências, os fabricantes de novos sistemas Cripto e blockchain estão buscando projetos mais eficientes em termos energéticos.","Algumas criptomoedas mais recentes incorporaram energia renovável em seu modelo operacional, combinando-a com métodos de validação alternativos para criar um token que utiliza muito menos energia do que seus antecessores.","Estas são apenas algumas das novas criptomoedas que estão sendo desenvolvidas tendo a sustentabilidade em mente.","Os avanços nos mecanismos de consenso e o foco na utilização de fontes de energia renováveis ​​reduziriam o custo ambiental geral das Criptomoeda e das redes blockchain com ampla adoção. Ainda há que resolver o problema do lixo eletrónico proveniente de operações mineiras antigas, mas as criptomoedas não-PoW reduziriam a procura de construção de plataformas mineiras mais novas e maiores no futuro, reduzindo potencialmente esse desperdício."],"entity":[{"type":"2025","content":"DATE"},{"type":"Cripto Climate Accord","content":"ORGANIZATION"},{"type":"quanta","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Leia Mais","content":"PERSON"},{"type":"mineração como Equinor e Crusoe Energy","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"Bitcoin na Tesla","content":"ORGANIZATION"},{"type":"Houston","content":"LOCATION"},{"type":"ESG","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"99,95%","content":"PERCENT"}],"hashtag":["industry","Intermediate","portuguese"],"authors":["John Bogna"]}