{"summary":"Un CV en chaîne fournit aux employeurs Web3 potentiels la preuve de votre expérience dans le Crypto en montrant votre participation et votre activité réelles dans le secteur.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fr\/learn\/what-is-an-on-chain-resume\/","publishDate":"2022-06-28T15:11:51","id":14633,"type":null,"title":"Qu'est-ce qu'un CV en chaîne ?","category":["Learn"],"content":["Si vous souhaitez travailler dans le Crypto, vous aurez peut-être besoin de plus qu'un CV traditionnel pour décrocher un poste. De nombreux emplois voudront que vous montriez votre expérience et vos compétences en matière de Cryptomonnaie , de jetons non fongibles ( NFT ) et d'autres actifs numériques, selon le poste. C'est là qu'intervient un CV en chaîne.","Bien qu'il existe des similitudes avec un CV traditionnel, un CV en chaîne présente votre parcours professionnel d'une manière différente.","Cette pièce fait partie de la série Future of Work de CoinDesk.","Un CV traditionnel est un document qui donne un aperçu de votre parcours professionnel, tel que vos antécédents professionnels, votre formation et vos compétences particulières.","Mais si vous souhaitez obtenir un emploi dans le Crypto, un CV en chaîne peut être plus important. Le problème avec la Crypto, c'est que les activités de chacun sont visibles sur les blockchains auxquelles vous participez, et donc si vous cherchez à travailler dans le secteur NFT, vous pouvez pointer vers les NFT que vous avez créés sur la place de marché NFT OpenSea, votre PFP (photo de profil) sur Twitter ou l'adresse du terrain que vous avez acheté dans un projet métaverse comme The Sandbox , par exemple.","Un CV en chaîne est un journal de vos activités historiques stocké dans un réseau blockchain tel Ethereum ( ETH ) qui met en valeur votre expérience, vos transactions et vos compétences. Il s'agit d'un contenu Web3 .","Votre CV en chaîne peut être aussi simple qu'un ou plusieurs portefeuilles contenant des transactions pour vérifier votre activité sur une blockchain. Ces activités démontrent que vous « faites de la Crypto» et votre expérience au fil du temps avec différents jetons et projets, qui peut être considérée comme plus précieuse qu'un CV traditionnel répertoriant vos qualifications.","Sur le même sujet : Ce que vous devez savoir et faire pour obtenir un emploi dans le Crypto","La création d'un CV en chaîne doit être adaptée à l'emploi que vous souhaitez obtenir. Votre CV en chaîne pour un emploi de développeur dans une plate-forme de jalonnement de Finance décentralisée ( DeFi ) serait très différent de ONE qui se concentre sur l'obtention d'un emploi dans un développeur de jeux pour gagner de l'argent .","Pensez à un créneau dans la Technologies blockchain dans lequel vous souhaitez exercer un emploi. Faites une liste des activités blockchain potentielles qui peuvent soutenir votre crédibilité pour ce créneau. Par exemple, si vous choisissez de devenir analyste du marché Bitcoin ( BTC ), vous pouvez vous concentrer sur l’achat et la vente de Bitcoin dans votre portefeuille.","Deux choses par lesquelles la plupart des gens devraient commencer lors de la création d'un CV en chaîne incluent :","Il existe de nombreuses options pour créer votre CV en chaîne, et les transactions ne sont T uniquement basées sur Ethereum. Voici quelques idées pour démarrer votre parcours vers le développement de compétences pour des rôles Crypto spécifiques.","Si vous souhaitez donner des conseils sur l’investissement Crypto , le trading sur une bourse décentralisée (DEX) est une excellente activité à faire. Vous pouvez échanger Solana ( SOL ) avec des Binance Coin ( BNB ), qui ne sont T des actifs natifs d'Ethereum.","Les DEX populaires incluent Sushiswap, PancakeSwap et Uniswap . En négociant sur un DEX, vous pouvez montrer votre participation active à DeFi.","Vous pouvez créer des médias numériques tels que des images, de la musique et d'autres formats numériques à transformer en NFT. De même, vous pouvez également démarrer une collection de NFT dans votre portefeuille.","Vous pouvez facilement créer ONEun de vos travaux sur OpenSea , le plus grand marché NFT du réseau Ethereum . Une autre bonne option est Solanart , une autre grande place de marché NFT sur le réseau Solana .","Avoir une connaissance approfondie d’un produit ou d’un service est essentiel pour être développeur dans ce secteur. Miser ou gagner des récompenses pour la détention de certaines crypto-monnaies peut vous aider à donner de la crédibilité en tant qu'ingénieur logiciel blockchain. Vous pouvez miser sur des crypto-monnaies populaires sur des plateformes telles que Binance, Crypto.com et Kraken.","Comprendre les formules mathématiques des récompenses et des intérêts démontre votre connaissance du jalonnement.","Les crypto-monnaies sont considérées comme des actifs à haut risque et à haut rendement. Placer vos crypto-monnaies dans un coffre-fort Maker montre aux employeurs potentiels votre expérience en matière d'exposition au risque. Les utilisateurs peuvent déposer un type de Cryptomonnaie comme garantie dans un coffre-fort Maker pour obtenir un prêt payé en Dai. Ces transactions aident à démontrer votre expérience bancaire DeFi.","En prêtant des crypto-monnaies sur des plateformes telles que AAVE et Compound , vous fournissez la preuve d'une autre forme de trading pour votre CV en chaîne. Si vous êtes curieux, vous pouvez expérimenter le prêt pour gagner des intérêts.","Ces types de transactions démontrent également une familiarité avec DeFi.","De plus, vous pouvez utiliser des services qui peuvent vous aider à créer un CV en chaîne et vous faire gagner du temps, tels que :","La Technologies Blockchain est en constante évolution et l'exploration de nouvelles activités à inclure dans votre CV en chaîne montre que vous apprenez et grandissez à mesure que le monde de la Crypto continue de se développer.","Sur le même sujet :Apprendre à gagner, passer à gagner : comment gagner de la Crypto de nouvelles manières","Étant donné qu'un CV en chaîne est public et immuable, il serait sage de séparer votre CV en chaîne de votre portefeuille de portefeuille. Vous ne voudriez T attirer les cybercriminels et compromettre la sécurité de vos actifs difficiles à gagner.","Enfin, un CV en chaîne ne doit T être considéré comme le seul format à envoyer pour postuler à un emploi dans le secteur de la blockchain. En fait, il peut (et devrait probablement) être utilisé conjointement avec un CV traditionnel, un profil LinkedIn et un portfolio pour renforcer votre profil.","Il s’agit peut-être d’un marché baissier, mais il reste encore de nombreux emplois à occuper dans les sociétés de Crypto .","La Crypto peut rendre le paiement des travailleurs plus rapide et moins coûteux. Cet article fait partie de la série Future of Work.","En adoptant un modèle plus ouvert et plus fluide, les entreprises traditionnelles auraient plus de facilité à attirer les talents et se retrouveraient avec une main-d’œuvre plus passionnée et plus engagée."],"entity":[{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"série Future of Work de CoinDesk","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"PancakeSwap et Uniswap","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Learn","industry","Beginner","Future of Work Week","French"],"authors":["Mike Antolin"]}