{"summary":"Two blockchain sleuths won the first ever bounty hunter reward on Arkham Intel Exchange for finding evidence of Do Kwon crypto wallets. \nThe payout for the approved bounty submission was 9,519.26 ARKHM, worth about $4,950.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241182\/arkham-intel-exchange-goes-after-do-kwon-crypto-wallets-with-first-bounty","publishDate":"2023-07-24T16:40:57","id":1464,"type":null,"title":"Arkham Intel Exchange goes after Do Kwon crypto wallets with first bounty","category":["Companies"],"content":["The controversial Arkham Intel Exchange approved its first ever bounty hunt on Monday, after two crypto sleuths found evidence of crypto wallets belonging to Do Kwon.","The platform had posted a bounty requesting more information on the former Terraform Labs CEO and now <a href=\"https:\/\/www.theblock.co\/post\/235448\/do-kwon-found-guilty-in-montenegro-fake-passport-case\" data-v-f87c67ca=\"\">international fugitive<\/a>. An anonymous blockchain sleuth and a pseudonymous one who goes by ErgoBTC won a payout of 9,519.26 ARKHM, worth about $4,950, for successfully completing the bounty and gaining approval from the platform.&nbsp;","Terraform Labs saw its stablecoin TerraUSD and cryptocurrency Luna <a href=\"https:\/\/www.theblock.co\/post\/146444\/terra-luna-and-ust-how-we-got-here\" data-v-f87c67ca=\"\">collapse<\/a> in May of 2022 in one of the largest collapses ever in the industry. The Securities and Exchange Commission <a href=\"https:\/\/www.theblock.co\/post\/212695\/sec-charges-terraform-and-do-kwon-post-terra-collapse\" data-v-f87c67ca=\"\">charged<\/a> Do Kwon with securities violations for allegedly selling unregistered transactions of crypto asset securities, failing to provide full and truthful disclosures and repeating misleading information to investors.","Launched on July 10, Arkham Intel Exchange <a href=\"https:\/\/www.arkhamintelligence.com\/announcements\/arkham-intel-exchange\" data-v-f87c67ca=\"\">incentivizes<\/a> users to find on-chain data via a bounty system. Anyone can seek information by posting a bounty, though the submissions must be approved by the platform.","If successful, bounty hunters earn the reward, and whoever posted the bounty keeps the information for 90 days before it's disseminated to the Arkham community.&nbsp;","The platform has stoked <a href=\"https:\/\/www.theblock.co\/post\/238929\/arkham-ceo-faces-pushback-over-new-platform-as-debate-over-anonymity-rages\" data-v-f87c67ca=\"\">controversy<\/a> in the crypto community, with some critics arguing that the platform could be used to dox innocent people."],"hashtag":["DATA PROVIDERS"]}