{"summary":"All 20 assets in the gauge posted declines over the past week, led by Solana, Cardano, and Aptos.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/30\/ether-holds-up-despite-correction-in-coindesk-20-coindesk-indices-market-update\/","publishDate":"2024-04-30T15:53:18","id":14646,"type":null,"title":"Ether Holds Up Despite Correction in CoinDesk 20: CoinDesk Indices Market Update","category":["Markets"],"content":["CoinDesk Indices (CDI) presents its bi-weekly market update, highlighting the performance of leaders and laggards in the benchmark CoinDesk 20 Index (CD20) and the broad CoinDesk Market Index (CMI).","The CoinDesk 20 slipped 6.8% over the past week, bringing its loss to 21% for the month of April. Each of the 20 assets in the index traded lower over the past seven days, with Tuesday's unexpectedly soft launch of spot bitcoin and ether ETFs in Hong Kong adding to the sour action.","Ether (ETH) has fared relatively well amidst the broader market downturn, lower by just 0.5% over the past week, the smallest decline in the CoinDesk 20.","Conversely, alternative Layer 1s experienced the most significant declines. Solana (SOL), Cardano (ADA), and Aptos (APT) all dropped by more than 10%, making them the weakest performers.","CoinDesk 20 tracks top digital assets and is investible on multiple platforms. The broader CMI comprises approximately 180 tokens and seven crypto sectors: currency, smart contract platforms, DeFi, culture & entertainment, computing, and digitization.","Edited by Stephen Alpher."],"entity":[{"type":"Aptos","content":"LOCATION"},{"type":"CDI","content":"ORGANIZATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"6.8%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"21%","content":"PERCENT"},{"type":"10%","content":"PERCENT"},{"type":"CMI","content":"ORGANIZATION"},{"type":"0.5%","content":"PERCENT"},{"type":"April","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Cardano (ADA","content":"ORGANIZATION"}],"hashtag":["CoinDesk 20"],"authors":["Tracy Stephens"]}