{"summary":"The race is on to build a dominant restaking protocol for Solana.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/01\/restaking-gold-rush-spreads-to-solana-from-ethereum-with-jito-and-others-joining-in\/","publishDate":"2024-05-01T12:01:00","id":14648,"type":null,"title":"Restaking 'Gold Rush' Spreads to Solana From Ethereum, With Jito and Others Joining In","category":["Finance"],"content":["The crypto restaking craze is spreading from Ethereum (ETH) to Solana (SOL), opening up money-making opportunities for investors and luring big players like Jito (JTO) and a handful of newcomer teams.","Ethereum and Solana are both proof-of-stake blockchains, meaning their networks are secured by a decentralized community of operators, often called validators, who pledge, or \"stake,\" ETH or SOL, respectively, for a financial reward.","Crypto's billion-dollar startup darling EigenLayer took this trust concept and literally leveraged it with restaking. Now, crypto investors could stake their idle ETH tokens to secure pretty much anything (and get some extra yield in the process). They did so with abandon: EigenLayer hoovered up $15 billion of ETH capital in less than a year.","Read more: Restaking 101: What Are Restaking, Liquid Restaking and EigenLayer?","The same game is poised to emerge in the Solana ecosystem in the coming weeks and months.","Solana infrastructure project Jito is building a restaking service, four people familiar with the matter told CoinDesk. The yet-to-be-announced program is set to compete against a growing stable of companies all trying to replicate EigenLayer's magic outside of the Ethereum ecosystem.","\"There's a lot of hype around it right now. It's kind of like a gold rush,\" said Jito Labs CEO Lucas Bruder, while declining to comment on his company's plans.","Read more: EigenLayer, After Touching Off Restaking Frenzy, Plans Own EIGEN token","Restaking on Solana is so nascent that major protocol developers and even insiders at the influential Solana Foundation said they have yet to delve into the companies trying to bring it to their realm.","Nevertheless, a CoinDesk investigation found over half a dozen teams quietly building out Solana restaking. Some are hewing closely to EigenLayer's core design: a mechanism for many different crypto protocols to share the economic security of the blockchain's native token.","Interviews with the teams building this infrastructure, investors evaluating it and startups who might utilize it showed how Ethereum's trickle-down tech is being reimagined for Solana. Nevertheless, doubters fear restaking brings little benefit to Solana and fret it could build a financial house of cards.","Solana's restaking scene has no big kahuna just yet. Jito contends with two hush-hush companies raising capital from venture capital firms (Solayer Labs and Cambrian), one Cosmos-centric team whose system is already live (Picasso) and at least two hackathon teams (DePHY and Repl). They're all eager to catch the Solana restaking wave – if it comes at all.","Restaking is the latest answer to the security question at the heart of everything in crypto: how to use economic games to protect decentralized computing systems.","Validators earn interest as a reward, and their stake acts like collateral: If a validator tries to lie to the blockchain, a portion of the stake gets revoked (or \"slashed\") by the network.","What it all boils down to: The cost of attacking the system is roughly the amount of money staked in its defense. That's why Ethereum is considered so safe: there's over $100 billion worth of ETH staked. Solana, too, is well-regarded in part because of its mammoth $42 billion stake.","Restaking promises to apply this economic game to pretty much anything, leveraging the big staking numbers on incumbent protocols to help secure upstart blockchain services. Rather than 100 projects being separately secured by, say, $1 billion each, via restaking they could all be protected by their collective $100 billion.","While EigenLayer's restaking systems mostly benefit Ethereum scaling solutions – the so-called layer-2 blockchains built atop Ethereum and designed to augment its abilities – the restaking schemes being built for Solana are generally focused on applications. That's partly because Solana isn't seen as fragmented as Ethereum; it isn't dependent upon, and subservient to, a vast array of layer-2 blockchains.","One builder, Nicholas Deng of hackathon contestant DePHY, which raised $2 million in January, said restaking could provide \"better security for applications.\"","Major venture capital firm Multicoin Capital – one of the most influential names in the Solana ecosystem with investments in many protocols, including the network itself – has its doubts. In an interview, Managing Partner Tushar Jain said he's yet to see the commercial problem that restaking solves.","\"Something that literally no developer has come to us and said is, 'You know why users aren't using my product? It's because there isn't enough economic security backing the consensus behind my protocol.'\"","Jito's plans for restaking remain cloudy. The company behind the massively popular client hasn't publicly committed to entering the restaking game. Bruder declined to comment on its plans beyond saying Jito is \"thinking a lot about it.\"","The revelation nonetheless puts Jito in a strong position for early dominance of the Solana restaking scene. Jito has a strong reputation among protocols and validators; over 73% of stake-weight, or the proportion of SOL tokens pledged to secure the Solana blockchain, run on validators that use Jito technology. Its distribution of JTO tokens in December kicked off the ongoing rush of Solana ecosystem airdrops. This made it a household name among airdrop farmers, a core contingency of stakers and restakers.","Jito's still-unannounced vision for restaking includes SPL assets (the Solana equivalent of Ethereum's ERC-20 tokens), one DeFi team familiar with the plans said.","\"I believe in the economic security of Solana. But I also believe that governance tokens from protocols can be used for economic security, as well,\" Bruder said.","Plenty of investors believe in Jito. Two venture capitalists who asked to remain anonymous said Jito \"has the best shot out there\" because its team is intimately familiar with Solana's architecture, and the Solana community with it. \"There's a lot of skepticism within the community about non-Solana native teams pulling this off,\" one of the VCs said.","Cambrian founder Gennady Evstratov told CoinDesk his seven-person team is finalizing a $2.5 million fundraise. The valuation is around $25 million, three investors said.","Cambrian seeks to be for Solana what EigenLayer is for Ethereum: a security layer that uses restaking to support all sorts of \"middleware\" that isn't happening on the main chain. Its pitch deck from February proposes use cases spanning off-chain computation and zero-knowledge proof processing.","\"I wouldn't deny that we are inspired heavily by the EigenLayer model, but we are more than that,\" including a computation layer, he said. He compared Cambrian to a \"decentralized\" Amazon Web Services. \"It can be used to create lots of services out of the box to serve as a computational and security layer for different parts of the ecosystem.\"","Within weeks, Cambrian will open up its testnet, he said. He's keeping a close eye on competitor Solayer Labs, whom he estimates is lagging behind Cambrian in its tech stack.","Whether that's the case is hard to tell. Like most of the teams interviewed for this article, Solayer Labs has not launched yet – let alone open-sourced its codebase.","Three venture investors familiar with the matter said the Delaware-incorporated, months-old company was looking to raise $8 million at an $80 million valuation in a seed round. Polychain Capital is leading the fundraise with a $4 million check, one investor said.","Solayer Labs' Rachel Chu would not share the final terms, but she told CoinDesk the startup is close to raising $10 million, with one check coming from Anatoly Yakovenko, one of Solana's founders and figureheads. (Yakovenko didn't respond to a request for comment.) His participation is a sign of embrace for a team that doesn't have deep Solana roots. Chu was previously a core developer at Ethereum-based decentralized exchange SushiSwap, while her business partner Jason Lee built Ethereum wallet service MPCvault.","\"Ultimately the problem we're trying to solve is scaling Solana,\" Chu said.","An April 8 blog post outlined Solayer Labs' plans to build \"a network of app-chains secured through Solana's economic security and execution\" whose users will be able to customize their environment: \"App builders at scale want more [transactions per second], less competition for blockspace, lower fees, and the aggregate economics that their business generates.\"","\"Solana has premium vertical stack features,\" she said in a Telegram message on April 29. \"At the same time, we will see different strategies toward creative scaling solutions to efficiently distribute the workloads.\"","Chu said Solayer's upcoming Shared Validator Network could include Actively Validated Services (AVS) that secure Solana infrastructure. \"The initial AVSs we're excited about are MEV strategies, distributed computing and oracle networks,\" she said.","A company blueprint calls for at least four experimental MEV-focused AVSs, including one that would auction \"the right to extract MEV\" and another that would police the MEV space. It also outlines a \"decentralized GPU cluster\" and an AVS that would task node operators with transaction sequencing, among other proposals.","Picasso started building a restaking mechanism half a year ago and opened Solana's only functioning product earlier this month. Executive Director Henry Love claimed Picasso is \"probably at least 12 to 18 months ahead\" of Cambrian and Solayer Labs.","Picasso's road to restaking came a little backward. Instead of setting out to build a generalized platform through which anyone could secure anything, it first sought a way to secure its own piece of tech: a bridge connecting Solana with the Cosmos (ATOM) family of blockchains.","EigenLayer told Picasso it was keeping its system limited to Ethereum, according to Love, so the company started building its own restaking hub and AVS. Restakers had deposited $8 million worth of SOL and a handful of liquid staking tokens by press time.","His plan is to open Picasso's staking hub to other teams and builders that want to secure their crypto contraptions on Solana, Love said.","Staking aside, crypto's most prominent economic game is its players' eternal search for gains. Traders are unyielding in their hunt for high-returning capital routes through which to jam their tokens. Airdrop hunters in the EigenLayer ecosystem believe the points they're accruing through restaking will one day grant them tokens – another source of yield. This paradigm is set to play out again on Solana.","\"The winner is decided not by anything but yield,\" Love said of the coming battle between Solana's restaking protocols. His team at Picasso is running a gamified rewards program through its Mantis interface that increases yields for winners.","Cambrian plans to run a points program and release a token after its restaking network launches late in the second quarter or early in the third quarter, Evstratov said.","Solayer Labs has its own multistage points program in the works. As described in its documentation, early birds will get a staggering leg up on latecomers. Depositors in Solayer's first phase (whitelisted for \"our earliest supporters\") will have two weeks to deposit as much as they wish for three times as many points as in later rounds. Those later rounds will have caps on total value locked, or TVL, and smaller points multipliers.","Jito doesn't stand to inspire the same airdrop hunter calculus as the others. It already airdropped its JTO token last year.","\"When that party's over – when inflationary emissions and tokens are given out as points or whatever – you need to look for places that have real revenue and real value-add. And the piece of that going back to the restakers will determine which platform is going to get the most restakers,\" Love said.","But deep skepticism remains across the Solana ecosystem. Ethereum's reliance on layer-2 networks to function and its hulking base of staked assets make restaking especially useful there, said Ryan Connor of Blockworks Research. He thinks of Ethereum as a \"modular\" blockchain; it performs one task while outsourcing other things to layer 2s – the kind of thing that makes it ripe for restaking, since a shared pool of assets might be the only way to secure such a sprawling expanse of interconnected infrastructure projects.","Solana, meanwhile, is an \"integrated\" blockchain that tries to do everything in one place. \"It isn't to say there is *no* need on Solana, just far less of a need than Ethereum and other modular systems\" that could use restaking, he said in a Telegram message.","Fearful naysayers fret that restaking is crypto's latest ticking time bomb – a rehypothecation of trust that will inevitably collapse.","They point to the specter of contagion risk: the idea that if an operator is slashed by an AVS, the impact could ripple across the entire staking ecosystem, depleting the value of the entire restaking pool and cutting down the security of every other AVS as a result.","There's added risk from \"liquid restaking\" services – intermediaries that take deposits from users, restake them into EigenLayer and equivalent platforms and offer receipts, called \"liquid restaking tokens\" (LRTs), that can be traded in decentralized finance to earn even larger yields.","With the rise of LRTs comes an even larger fear of a mass catastrophe: If protocols start leveraging people's trust by allowing them to stake SOL, its liquid staking tokens and also liquid restaking tokens, then the surface area for a rehypothecation crisis grows. One slashed AVS or depegged asset could topple many.","One prolific angel investor in Solana projects told CoinDesk he had not yet invested in any restaking teams. When asked why, he responded cheekily: \"Just debating when restaking blows up crypto.\"","CORRECTION (May 2, 00:12 UTC): An earlier version of this article misidentified the lead investor in Solayer's seed round. Hack VC was in the running, but Polychain's check ultimately claimed the crown, people familiar with the situation said.","Edited by Nick Baker, Sam Kessler and Marc Hochstein."],"entity":[{"type":"Bruder","content":"PERSON"},{"type":"Polychain","content":"LOCATION"},{"type":"Solana Foundation","content":"ORGANIZATION"},{"type":"Yakovenko","content":"PERSON"},{"type":"Solayer Labs","content":"ORGANIZATION"},{"type":"Shared Validator Network","content":"ORGANIZATION"},{"type":"Actively Validated Services","content":"ORGANIZATION"},{"type":"Jito","content":"LOCATION"},{"type":"\" Love","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"May 2","content":"DATE"},{"type":"Nicholas Deng","content":"PERSON"},{"type":"$2.5 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Amazon Web Services","content":"ORGANIZATION"},{"type":"$42 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"$8 million","content":"MONEY"},{"type":"73%","content":"PERCENT"},{"type":"Picasso","content":"ORGANIZATION"},{"type":"$15 billion","content":"MONEY"},{"type":"$100 billion","content":"MONEY"},{"type":"Tushar Jain","content":"PERSON"},{"type":"Ethereum","content":"PERSON"},{"type":"April 8","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Chu","content":"PERSON"},{"type":"Delaware","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"SOL","content":"ORGANIZATION"},{"type":"Gennady Evstratov","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"Evstratov","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"Rachel Chu","content":"PERSON"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"April 29","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"$25 million","content":"MONEY"},{"type":"Jason Lee","content":"PERSON"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"third quarter","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"Blockworks Research","content":"ORGANIZATION"},{"type":"Sam Kessler","content":"PERSON"},{"type":"Love","content":"PERSON"},{"type":"$80 million","content":"MONEY"},{"type":"$4 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"Multicoin Capital –","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Ryan Connor","content":"PERSON"},{"type":"Henry Love","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Solayer","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"GPU","content":"ORGANIZATION"},{"type":"Lucas Bruder","content":"PERSON"},{"type":"Cambrian","content":"ORGANIZATION"}],"hashtag":["Jito labs","Restaking","EigenLayer","Solana","Exclusive"],"authors":["Danny Nelson"]}