{"summary":"Um currículo na rede fornece aos potenciais empregadores da Web3 uma prova de sua experiência em Cripto , mostrando sua participação e atividade na vida real no setor.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/what-is-an-on-chain-resume\/","publishDate":"2022-06-28T15:11:51","id":14654,"type":null,"title":"O que é um currículo on-chain?","category":["Learn"],"content":["Se você deseja trabalhar com Cripto, pode precisar de mais do que um currículo tradicional para conseguir um emprego. Muitos empregos exigirão que você mostre sua experiência e habilidades com Criptomoeda , tokens não fungíveis ( NFTs ) e outros ativos digitais, dependendo da posição. É aí que entra um currículo on-chain.","Embora existam semelhanças com um currículo tradicional, um currículo on-line fornece sua experiência profissional de uma maneira diferente.","Esta peça faz parte da série Future of Work da CoinDesk.","Um currículo tradicional é um documento que fornece uma visão geral de sua experiência profissional, como histórico profissional, formação acadêmica e habilidades especiais.","Mas se você deseja conseguir um emprego na Cripto, um currículo na rede pode ser mais importante. O problema da Cripto é que as atividades de alguém são visíveis nos blockchains dos quais você participa e, portanto, se você deseja trabalhar no setor de NFT, pode apontar para os NFTs que cunhou no mercado de NFT OpenSea, seu PFP (foto de perfil) no Twitter ou o endereço do terreno que você comprou em um projeto de metaverso como The Sandbox , por exemplo.","Um currículo on-chain é um registro de suas atividades históricas armazenadas em uma rede blockchain como Ethereum ( ETH ) que destaca sua experiência, transações e habilidades. É considerado conteúdo Web3 .","Seu currículo na rede pode ser tão simples quanto uma carteira ou carteiras contendo transações para verificar sua atividade em uma blockchain. Essas atividades demonstram que você “faz Cripto” e sua experiência ao longo do tempo com diferentes tokens e projetos, o que pode ser visto como mais valioso do que um currículo tradicional que lista suas qualificações.","Leia Mais: O que você precisa saber e fazer para conseguir um emprego na Cripto","A criação de um currículo na rede deve ser adaptada ao emprego que você deseja conseguir. Seu currículo na rede para um emprego como desenvolvedor em uma plataforma de staking de Finanças descentralizadas ( DeFi ) seria muito diferente ONE que se concentra em conseguir um emprego em um desenvolvedor de jogos do tipo \"jogue para ganhar\" .","Pense em um nicho na Tecnologia blockchain no qual você deseja trabalhar. Faça uma lista de atividades potenciais de blockchain que podem apoiar sua credibilidade nesse nicho. Por exemplo, se você escolher ser um analista de mercado de Bitcoin ( BTC ), poderá se concentrar na compra e venda de Bitcoin em sua carteira.","Duas coisas com as quais a maioria das pessoas deve começar ao construir um currículo na rede incluem:","Existem muitas opções para construir seu currículo na rede, e as transações T são apenas baseadas em Ethereum. Aqui estão algumas ideias para iniciar sua jornada em direção ao desenvolvimento de habilidades para funções Cripto específicas.","Se você deseja aconselhar sobre investimentos em Cripto , negociar em uma bolsa descentralizada (DEX) é uma excelente atividade. Você pode trocar Solana ( SOL ) por Binance Coin ( BNB ), que T são ativos nativos do Ethereum.","DEXs populares incluem Sushiswap, PancakeSwap e Uniswap . Ao negociar em uma DEX, você pode mostrar sua participação ativa no DeFi.","Você pode criar mídia digital, como imagens, música e outros formatos digitais, para serem cunhados em um NFT. Da mesma forma, você também pode iniciar uma coleção de NFTs em sua carteira.","Você pode facilmente cunhar um de seus trabalhos no OpenSea , o maior mercado NFT da rede Ethereum . Outra boa opção é o Solanart , outro grande mercado NFT da rede Solana .","Ter conhecimento profundo de um produto ou serviço é essencial para ser um desenvolvedor nesse setor. Apostar ou ganhar recompensas por manter certas criptomoedas pode ajudar a lhe dar credibilidade como engenheiro de software blockchain. Você pode apostar criptomoedas populares em plataformas como Binance, Cripto.com e Kraken.","Compreender as fórmulas matemáticas de recompensas e juros demonstra o seu conhecimento de apostas.","As criptomoedas são consideradas ativos de alto risco e alta recompensa. Colocar suas criptomoedas em um cofre do Maker mostra aos empregadores em potencial sua experiência com exposição ao risco. Os usuários podem depositar um tipo de Criptomoeda como garantia em um cofre do Maker para obter um empréstimo pago em Dai. Essas transações ajudam a demonstrar sua experiência bancária DeFi.","Ao emprestar criptomoedas em plataformas como AAVE e Compound , você fornece prova de outra forma de negociação para seu currículo na rede. Se estiver curioso, você pode experimentar empréstimos para ganhar juros.","Esses tipos de transações também demonstram familiaridade com o DeFi.","Além disso, você pode utilizar serviços que podem auxiliá-lo na criação de um currículo on-line e economizar tempo, como:","A Tecnologia Blockchain está sempre evoluindo, e explorar novas atividades para incluir em seu currículo na rede mostra que você está aprendendo e crescendo à medida que o mundo Cripto continua a se expandir.","Leia Mais:Aprenda para Ganhar, Mova para Ganhar: Como Ganhar Cripto de Novas Maneiras","Como um currículo na rede é público e imutável, seria sensato separar o seu currículo na rede da carteira do seu portfólio. Você T gostaria de atrair cibercriminosos e comprometer a segurança de seus ativos difíceis de obter.","Finalmente, um currículo on-chain T deve ser visto como o único formato a ser enviado ao se candidatar a empregos na indústria de blockchain. Na verdade, ele pode (e provavelmente deve) ser usado em conjunto com um currículo tradicional, um perfil no LinkedIn e um portfólio para reforçar o seu perfil.","Pode ser um mercado baixista, mas ainda há muitos empregos disponíveis em empresas de Cripto .","A Cripto pode tornar mais rápido e barato o pagamento dos trabalhadores. Este artigo faz parte da série Futuro do Trabalho.","Ao adoptarem um modelo mais aberto e fluido, as empresas tradicionais teriam mais facilidade em atrair talentos e acabariam por ter uma força de trabalho mais apaixonada e empenhada."],"entity":[{"type":"Tecnologia Blockchain","content":"ORGANIZATION"},{"type":"faz parte da série Future of Work da CoinDesk","content":"ORGANIZATION"},{"type":"Leia Mais","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Como Ganhar Cripto de Novas Maneiras","content":"ORGANIZATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Aprenda para Ganhar","content":"ORGANIZATION"},{"type":"Mova","content":"LOCATION"},{"type":"PancakeSwap e Uniswap","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"}],"hashtag":["Learn","industry","Beginner","Future of Work Week","portuguese"],"authors":["Mike Antolin"]}