{"summary":"Thanks to 2021, most people have at least heard of crypto by now – not just Bitcoin and Ethereum, but altcoins like DOGE and SHIB, as well as terms like NFTs and the metaverse. In CoinDesk Research’s 2021 Annual Crypto Review, we aim to summarize some of the key themes and metrics that marked the past year’s progress in cryptocurrency markets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/reports\/coindesk-2021-annual-crypto-review\/","publishDate":"2022-01-06T13:58:00","id":14657,"type":null,"title":"CoinDesk 2021 Annual Crypto Review","category":["Research"],"content":["Overall, 2021 was an extraordinary year for the cryptocurrency and blockchain industry.","Bitcoin and Ethereum asset prices touched all-time highs while over $20 billion of venture capital and funding flowed into crypto companies. Coinbase went public, more bitcoin made its way onto MicroStrategy’s balance sheet, and a bitcoin ETF finally began trading in the United States.","Meanwhile, traditional businesses, professional athletes and celebrities were aping into NFTs, as DeFi took the virtual world by storm with promises to remake the legacy financial system.","Politicians routinely discussed crypto policy, China banned bitcoin mining and crypto trading, and a sovereign nation made bitcoin legal tender.","On the tech front, Bitcoin and Ethereum implemented protocol-wide improvements as legitimate layer 1 smart contract competitors to Ethereum began making waves.","All this and more are explored in the CoinDesk 2021 Annual Crypto Review."],"entity":[{"type":"2021","content":"DATE"},{"type":"$20 billion","content":"MONEY"},{"type":"CoinDesk 2021 Annual Crypto Review","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Reports","Research","Bitcoin","Ethereum","DeFi","Markets"],"authors":["George Kaloudis","Edward Oosterbaan"]}