{"summary":"EigenLayer et les protocoles de « restauration » similaires constituent actuellement l'investissement le plus important dans la blockchain, mais la Technologies n'est T sans risques.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fr\/learn\/restaking-101-what-are-restaking-and-liquid-restaking\/","publishDate":"2024-05-02T16:05:30","id":14651,"type":null,"title":"Qu’est-ce que la reprise ? Qu’est-ce que le retake liquide ? Qu’est-ce qu’EigenLayer ?","category":["Learn"],"content":["En moins d'un an, le géant Ethereum \"reprise\" EigenLayer a englouti plus de 16 milliards de dollars de dépôts d'éther (ETH) – des actifs numériques qui seront théoriquement utilisés pour aider à sécuriser les nouveaux protocoles de Cryptomonnaie .","Le resttaking – l'idée d'utiliser une blockchain pour sécuriser d'autres applications – est rapidement devenu la nouvelle tendance d'investissement la plus importante du secteur de la Crypto . De nouvelles startups de restauration semblent arriver chaque semaine, et des industries artisanales entières, des plates-formes de « services activement validés » et de « restauration liquide », ont profité du battage médiatique avec leur propre vision de la technologie.","Alors que certains considèrent la reprise comme une opportunité d’investissement prometteuse et un grand pas en avant pour la sécurité Crypto , d’autres y voient un pari beaucoup plus risqué – un système de réhypothèque qui promet des récompenses trop belles pour être vraies sur la base de fondamentaux fragiles.","Le resttaking est la dernière réponse à la question de sécurité au cœur de tout ce qui concerne la Crypto: comment utiliser les jeux économiques pour protéger les systèmes informatiques décentralisés","Au cœur de toutes les blockchains se trouve l'idée de « décentralisation » – où un réseau d'opérateurs largement distribué, plutôt qu'un ONE parti, prend les transactions des utilisateurs, les écrit dans le grand livre numérique de la chaîne et garantit que tous les autres opérateurs déclarent honnêtement les données. .","Contrairement aux blockchains de preuve de travail comme Bitcoin, où les « mineurs » dépensent de la puissance de calcul pour KEEP la sécurité d'une chaîne, les blockchains de preuve de participation comme Ethereum et Solana sont gérées par des « validateurs » qui « mettent en jeu » la monnaie pour aider à exécuter le système. réseau.","Sur le même sujet : Crypto Staking 101 : Qu'est-ce que le Staking ?","Les validateurs gagnent des intérêts en récompense de leur travail. Plus leur mise est importante, plus ils gagneront de récompenses. La participation agit également comme une garantie ; si un validateur tente de mentir à la blockchain ou est mal configuré, une partie de la mise est révoquée par le réseau.","Les mécanismes exacts derrière le jalonnement peuvent varier d'une chaîne à l'autre, mais le point important à retenir en matière de jalonnement est le suivant : le coût de l'attaque (lire : drainer de l'argent) d'un système de preuve de mise est à peu près le montant d'argent qui a été mis en jeu pour sa défense. C'est pourquoi Ethereum, en particulier, est considéré comme si sûr : il contient plus de 100 milliards de dollars d' ETH mis en jeu.","Restaking promet d’appliquer ce jeu économique à presque tout, en tirant parti des grands nombres de mises sur les protocoles en place pour aider à sécuriser les applications blockchain parvenues. En tant qu'opportunité d'investissement, elle est présentée comme un moyen de générer un BIT d'intérêt supplémentaire grâce au jalonnement conventionnel.","EigenLayer, le leader du réinvestissement d'Ethereum, permet aux utilisateurs de prendre ETH qu'ils ont mis en jeu avec Ethereum , puis de le réinvestir avec ce que l'on appelle les « services activement validés » ou AVS. Aujourd’hui, il s’agit principalement de protocoles blockchain qui prennent en charge les solutions de mise à l’échelle Ethereum .","Les partisans de la technologie affirment que la restauration contribue à améliorer la sécurité des petites applications blockchain, car elles pourraient avoir du mal à soutenir leurs propres systèmes de sécurité de preuve de participation, étant donné que cela nécessite un capital important et une communauté active.","Dans une interview avec CoinDesk le mois dernier, le fondateur d'EigenLayer, Sreeram Kannan, a expliqué comment cela fonctionne en utilisant l'exemple de 100 protocoles de blockchain chacun sécurisé par 1 milliard de dollars de mise : Imaginez que « au lieu que chacun des protocoles ait 1 milliard de dollars séparément, il y avait 100 milliards de dollars communément mis en jeu dans 100 protocoles\", a déclaré Kannan. \"Pour attaquer un protocole donné, il faut désormais 100 milliards de dollars au lieu d'un milliard de dollars.\"","Les détails peuvent sembler différents sur d’autres blockchains, mais l’essentiel est le même. Sur Solana, par exemple, les utilisateurs pourront réinvestir le SOL qu'ils ont misé sur ce réseau pour gagner des intérêts supplémentaires et contribuer à sécuriser d'autres applications.","La reprise via une plate-forme comme EigenLayer signifie généralement déposer son ETH (ou sélectionner des dérivés ETH ) dans le protocole, créer un opérateur, puis sélectionner les AVS à sécuriser en échange d'intérêts.","Un moyen plus simple de miser consiste à utiliser des services de reprise de liquidités tels que Puffer, Ether.Fi et Renzo. Il s'agit d'intermédiaires qui prennent les actifs des utilisateurs, les déposent sur EigenLayer et des plateformes équivalentes, et proposent des reçus, appelés « jetons de reprise liquide » (LRT), qui rapportent des intérêts et peuvent être échangés dans le cadre d' une Finance décentralisée pour obtenir des rendements encore plus élevés.","Les plates-formes de restauration des liquides effectuent tout le gros du travail de configuration du logiciel opérateur et de sélection des AVS avec lesquels travailler. Les LRT permettent aux utilisateurs d'entrer et de sortir facilement de positions de reprise, et offrent aux utilisateurs la possibilité d'augmenter leur effet de levier en réinvestissant dans des protocoles Finance décentralisés.","Les services reflètent des plates-formes comme Lido, le géant du jalonnement liquide sur Ethereum qui met en jeu des actifs au nom des investisseurs et propose un jeton de jalonnement liquide dérivé, \"Lido jalonné ETH\" (stETH), qui suit le prix de ETH. StETH est extrêmement populaire dans la Finance décentralisée, et les nouvelles plateformes de rachat de liquidités espèrent reproduire le succès du Lido avec leurs LRT pratiques.","Alors que les investisseurs, les développeurs et les sociétés de capital-risque ont adopté le réinvestissement, certains craignent que cette tendance ne soit la dernière bombe à retardement de la cryptographie, une réhypothécation de la confiance qui s'effondrera inévitablement.","Ils pointent le spectre du risque de contagion – l’idée selon laquelle si un opérateur est réduit par un AVS, l’impact pourrait se répercuter sur l’ensemble de l’écosystème de jalonnement, épuisant la valeur de l’ensemble du pool de remise en jeu et réduisant la sécurité de tous les autres AVS. par conséquent. (EigenLayer ajoute un programme d'assurance appelé « sécurité attribuable » pour répondre à ce problème, mais les détails n'ont T été finalisés.)","L’essor des TLR s’accompagne d’une crainte encore plus grande d’une catastrophe massive. Si les protocoles commencent à tirer parti de la confiance des gens en leur permettant de miser des jetons, des jetons de jalonnement liquide et également des jetons de re- jalonnement liquide, alors la surface d'une crise de réhypothèque augmente. Un événement brutal ou un actif désindexé pourrait en renverser plusieurs.","Bien que des versions de sécurité mutualisée existent depuis un certain temps – notamment dans l’écosystème blockchain Cosmos – la formulation moderne du « resttaking » reste plus une théorie qu’une réalité. EigenLayer était techniquement le premier protocole de reprise à être lancé sur le réseau principal d'Ethereum, mais il reste en version bêta limitée. EigenLayer accepte les dépôts, mais la plupart de ses fonctionnalités clés – y compris le slashing – n'existaient pas encore au moment de la publication, et les AVS sont uniquement autorisés à s'inscrire auprès du programme mais ne peuvent T encore être déployés.","Sur le même sujet : EigenLayer, le plus grand projet lancé par Crypto cette année, manque encore de fonctionnalités cruciales","Jusqu'à présent, la seule incitation au réinvestissement et au réinvestissement liquide a été les « points », qui sont des comptes de scores suivis par EigenLayer et des protocoles de réinvestissement liquide dont les déposants espèrent qu'ils seront liés aux futurs largages d'actifs numériques.","Les points ne sont T conçus pour avoir une quelconque valeur, mais les utilisateurs ont commencé à les acheter et à les vendre, déclenchant une frénésie spéculative autour de l'idée que certaines craintes ne sont T fondées sur la réalité économique et pourraient conduire à des déceptions et à de grosses ventes à long terme. . EigenLayer et le protocole de restockage liquide Renzo ont déjà montré comment les systèmes de points peuvent définir des attentes irréalistes : les deux projets ont déclenché la fureur le mois dernier lorsqu'ils ont révélé des plans de largage de jetons qui prévoyaient des allocations plus petites pour les gagnants de points que ce que certains déposants avaient prévu.","Un investisseur providentiel prolifique des projets Solana a déclaré à CoinDesk qu'il \"n'avait pas (encore)\" investi dans des équipes de reconversion pour cet écosystème. Lorsqu'on lui a demandé pourquoi, il a répondu avec insolence : \"Je débats juste quand la reprise fait exploser la Crypto.\"","Danny Nelson a contribué au reportage","Édité par Bradley Keoun and Nick Baker."],"entity":[{"type":"Puffer","content":"PERSON"},{"type":"technologie","content":"ORGANIZATION"},{"type":"LRT","content":"ORGANIZATION"},{"type":"Sreeram Kannan","content":"PERSON"},{"type":"Kannan","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"TLR","content":"ORGANIZATION"},{"type":"16 milliards de dollars","content":"MONEY"},{"type":"Lido","content":"LOCATION"},{"type":"Danny Nelson","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["EigenLayer","Staking","Restaking","Ethereum","Liquid staking","Lido","Eigenlabs","French"],"authors":["Sam Kessler"]}