{"summary":"Grayscale, which converted its flagship Grayscale Bitcoin Trust into an ETF in January, saw revenue stay flat as rising crypto prices balanced out heavy outflows and a lower management fee.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/09\/grayscale-parent-digital-currency-group-reports-229m-revenue-for-q1\/","publishDate":"2024-05-09T16:05:44","id":14667,"type":null,"title":"Grayscale Parent Digital Currency Group Reports $229M Revenue for Q1","category":["Finance"],"content":["Digital Currency Group (DCG), the parent company of asset manager Grayscale, reported a first quarter revenue up 11% from the previous quarter to $229 million.","In a letter to shareholders on Tuesday, the firm said Grayscale accounted for $156 million of its first quarter revenue. Thanks to sharp rises in the price of bitcoin (BTC) and ether (ETH), that amount was about flat from the previous quarter despite heavy redemptions and a reduced management fee following the conversion of the Grayscale Bitcoin Trust (GBTC) to an ETF.. “While Grayscale expected outflows alongside increased competition under the ETF wrapper, Q1 revenue attributable to GBTC nevertheless exceeded our expectations,” the company said.","Two other DCG notable ventures, crypto mining pool Foundry and investing platform Luno, saw revenue increases of 35% and 46%, respectively.","“The first quarter of 2024 was marked by several exciting developments for our industry, including the approval of Grayscale’s GBTC and spot Bitcoin ETFs in the U.S., and bitcoin prices reaching all-time highs in March. Against this backdrop, we are pleased to showcase a strong start to the year for DCG,” the company told shareholders.","On a yearly basis, DCG’s first quarter revenue was up 51% versus the same period last year while the price of bitcoin was up roughly 134%","In January, Grayscale converted GBTC, which had been in existence as a closed-end fund for over a decade, into a spot ETF, becoming one of ten issuers to bring such a fund to the market. While billions flowed into the new vehicles, GBTC, whose management fee of 1.50% was more than 100 basis points above its competitors, experienced billions in outflows.","While the company said that it would eventually lower its fee, it has yet to do so. In the meantime,, Grayscale in March filed for a new product called the Grayscale Bitcoin Mini Trust ETF, which would carry a much lower fee than GBTC. The fund has yet to be approved by the U.S. Securities and Exchange Commission (SEC) but it would allow investors to get the same exposure to bitcoin as they would through GBTC, just at a lower fee.","Edited by Stephen Alpher."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"first quarter of 2024","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"134%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"46%","content":"PERCENT"},{"type":"Grayscale Bitcoin Mini Trust ETF","content":"ORGANIZATION"},{"type":"1.50%","content":"PERCENT"},{"type":"$156 million","content":"MONEY"},{"type":"$229 million","content":"MONEY"}],"hashtag":["Digital Currency Group","Grayscale","GBTC","Spot bitcoin etf","Earnings"],"authors":["Helene Braun"]}