{"summary":"The announcement comes amid increased focus on custody.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/212607\/gate-io-integrates-with-coppers-clearloop-network-amid-fresh-focus-on-custody","publishDate":"2023-02-17T00:00:04","id":1466,"type":null,"title":"Gate.io integrates with Copper’s ClearLoop network amid fresh focus on custody","category":["COMPANIES"],"content":["Crypto exchange Gate.io is partnering with digital asset custody firm Copper.co to fully integrate with its ClearLoop solution in a move that will allow users to quickly execute trades while maintaining independent custody of their funds.","\"Joining Copper’s ClearLoop network is part of our broader effort to enhance customer asset safety and provide institutional clients the support they need to succeed in their trading endeavors,\" Gate.io founder and CEO Lin Han said in an emailed statement.&nbsp;","The announcement comes rising interest in custody issues, with U.S. Securities and Exchange Commission Chair Gary Gensler arguing this week that many crypto firms are not in compliance with current rules around safeguarding digital assets.","\"Copper is here to support the drive towards mitigation of counterparty risk and help institutions engage with crypto assets in a way that is secure, faster, and easier,\" Copper CEO Dmitry Tokarev said in the statement.","Gate.io currently has around 12 million users worldwide, with billions of dollars in daily trading volume and 3,000 spot pairs.&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"billions of dollars","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Dmitry Tokarev","content":"PERSON"},{"type":"Lin Han","content":"PERSON"}],"hashtag":[],"authors":["Nathan Crooks","The Block"]}