{"summary":"Cette mesure est essentielle pour empêcher de mauvais acteurs d’utiliser des actifs numériques pour blanchir de l’argent. Cela affecte tous ceux qui s’intéressent aux crypto-monnaies, des bourses aux investisseurs ordinaires.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/fr\/learn\/whats-the-crypto-travel-rule-and-what-does-it-mean-for-you\/","publishDate":"2022-05-26T21:00:46","id":14677,"type":null,"title":"Qu'est-ce que la « règle de voyage » Crypto et qu'est-ce que cela signifie Pour vous?","category":["Learn"],"content":["Près de trois ans après la publication des directives controversées sur les « règles de voyage » par le Groupe d'action financière ( GAFI ), les régulateurs et les fournisseurs de services d'actifs virtuels ( VASP ) sont toujours confrontés aux défis économiques et techniques liés à la mise en œuvre de ces règles. Bien que les VASP, qui incluent, sans toutefois s'y limiter, les échanges Crypto , les services de portefeuille et les solutions de conservation de Crypto , soient l'objectif principal de cette réglementation, sa mise en œuvre massive devrait avoir un impact lentement mais sûrement sur la façon dont vous interagissez avec la Crypto.","Dans ce guide, nous discuterons de tout ce que vous devez savoir sur la règle de voyage Crypto et comment elle affectera vos activités Crypto quotidiennes.","Sur le même sujet : Bitcoin est-il légal ?","En 2019, le Groupe d’action financière, un organisme intergouvernemental qui lance des politiques de lutte contre le blanchiment d’argent (AML) pour le G-7 et une trentaine d’autres pays développés, a recommandé une approche coordonnée pour lutter contre le blanchiment d’argent et le financement du terrorisme. La règle, officiellement connue sous le nom de Recommandation n°16 du GAFI , oblige les VASP à communiquer les informations sur les initiateurs et les bénéficiaires des transactions Crypto qui dépassent un certain seuil. Plus précisément, la réglementation exige que les VASP échangent des informations concernant l'identité de l'initiateur et du bénéficiaire chaque fois que le montant de la transaction est supérieur à 1 000 $.","Essentiellement, chaque fois qu'une Crypto d'une valeur supérieure à 1 000 $ est négociée entre deux parties, le fournisseur de services de Crypto de l'expéditeur est censé communiquer les informations personnelles identifiables ( PII ) de l'expéditeur au fournisseur de services de Crypto du destinataire et vice versa. Bien que cela soit une évidence, les États membres peuvent choisir d’interpréter ces orientations et de mettre en œuvre les versions qui conviennent le mieux à leurs industries locales de Crypto .","Par exemple, le seuil auquel la règle de voyage Crypto entre en vigueur aux États-Unis est de 3 000 $ (c'est-à-dire que les règles entrent en vigueur lorsque la valeur de la transaction Crypto dépasse 3 000 $). Dans de tels cas, les VASP sont tenus d’échanger des informations concernant le montant de la transaction, la date d’exécution et l’identité du fournisseur de services de Crypto .","La Suisse est connue pour avoir une version stricte de la règle de voyage, dans laquelle les régulateurs exigent l'identification des portefeuilles privés interagissant avec les VASP locaux.","En plus des informations supplémentaires requises par les différents régulateurs, le GAFI recommande que les données suivantes soient transmises dans les FORTH par les VASP :","La règle de voyage existait avant les recommandations de 2019 du GAFI. Initialement, la réglementation visait les banques et les institutions financières dans le cadre des initiatives visant à atténuer le blanchiment d'argent. Essentiellement, les actions du GAFI en 2019 n'ont fait qu'élargir cette règle de telle sorte que les réglementations AML existantes peuvent être reproduites dans le secteur de la Crypto . Il convient de mentionner qu'avant la publication de la règle de voyage Crypto en 2019, le Financial Crimes Enforcement Network ( FinCEN ), en vertu de la loi américaine sur le secret bancaire (BSA) , avait imposé une règle similaire aux VASP opérant dans sa juridiction.","Ainsi, contrairement à la plupart des pays, les États-Unis n’ont pas eu besoin de formuler de toutes pièces une nouvelle réglementation pour se conformer aux recommandations du GAFI. En vertu de cette règle, le FinCEN exige que les fournisseurs de services d’actifs Crypto confirment que les transactions Crypto ne proviennent pas ou ne sont pas envoyées vers des pays ou des entreprises sanctionnés.","Sur le même sujet : Qu'est-ce que KYC et pourquoi est-ce important pour la Crypto?","Comme mentionné précédemment, l’objectif Core de cette réglementation est de bloquer le financement du terrorisme et le blanchiment d’argent. Vous trouverez ci-dessous d’autres raisons pour lesquelles la règle de voyage est importante :","Le premier défi associé à la règle de voyage Crypto concerne l’approche non uniforme de la mise en œuvre de cette réglementation dans différentes régions. Comme mentionné précédemment, les exigences de la règle de voyage diffèrent d'un pays à l'autre. Par conséquent, les VASP ont la tâche d’incorporer des systèmes d’auto-conformité robustes qui prendraient en compte les différentes exigences des différents pays et les mettraient en œuvre en conséquence. La non-uniformité des règles de voyage Crypto est communément appelée le « problème du lever du soleil ».","Gardant à l’esprit que les VASP sont tenus d’ échanger les détails des transactions, il existe un besoin pour un système de communication interopérable tel que les VASP puissent facilement recevoir et envoyer des informations personnelles. Cela signifie que l’ensemble du secteur de la Crypto doit adopter une approche collaborative pour trouver les normes idéales en matière de données et de communication.","Naturellement, c’est un peu difficile car l’industrie de la Crypto privilégie historiquement un modèle de fonctionnement décentralisé. Cela dit, les fournisseurs de services de Crypto acceptent cette situation et nombre d’entre eux adoptent des protocoles spécialement conçus pour faciliter le transfert et la collecte de données cryptées. Des exemples de ces protocoles sont OpenVASP, Shyft, TRISA et TRP.","Plus important encore, l’industrie de la Crypto est parvenue à un consensus sur un format de messagerie de données unique pour tous les protocoles de règles de voyage. Ce format est appelé IVMS 101 .","Un autre sujet de discussion principal est l’effet perçu de l’afflux de réglementation des actifs numériques par une faction de la communauté Crypto . Certains pensent que des réglementations telles que les règles de voyage donnent aux régulateurs les outils et les données nécessaires pour surveiller et sanctionner les utilisateurs de Crypto .","Il convient également de mentionner les risques de sécurité apparents auxquels les VASP seront exposés lors de la transmission des informations des utilisateurs. Il est crucial de mettre en place des systèmes de sécurité supplémentaires qui protégeraient les données des utilisateurs contre de tels risques.","Enfin, il existe des risques de non-respect de la Politique de confidentialité des données auxquels la règle de voyage expose les VASP. Même si les VASP tentent de respecter la règle de voyage, ils doivent s'assurer que leurs actions sont conformes aux lois sur la Politique de confidentialité des données des juridictions dans lesquelles ils opèrent.","La première chose que vous devriez garder à l’esprit est que vous devrez peut-être renoncer à une partie de votre Politique de confidentialité pour continuer à interagir avec le marché de la Crypto .","Vous devrez également connaître au moins le nom de vos bénéficiaires et de ceux qui vous envoient les paiements. Et comme la règle de voyage pose encore des défis, on ne peut pas dire dans quelle mesure l’inefficacité de l’un des systèmes de conformité affecterait votre expérience utilisateur.","Au début de cette révolution réglementaire, vous pourriez ne pas être en mesure d'exécuter des transactions, en fonction du statut de conformité de votre VASP et de celui de votre contrepartie.","Sur le même sujet :Que sont les pièces de Politique de confidentialité et sont-elles légales ?","CORRECTION (27 mars, 10 h 46 UTC) : corrige le nom du chien de garde en tant que Groupe d'action financière. Une version antérieure l’appelait le Groupe d’action financière et fiscale."],"entity":[{"type":"Crypto quotidiennes","content":"ORGANIZATION"},{"type":"Shyft","content":"PERSON"},{"type":"$)","content":"MONEY"},{"type":"$ est","content":"MONEY"},{"type":"Crypto","content":"ORGANIZATION"},{"type":"VASP","content":"ORGANIZATION"},{"type":"$.","content":"MONEY"},{"type":"BSA","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"$ (","content":"MONEY"},{"type":"7","content":"DATE"},{"type":"TRP","content":"ORGANIZATION"},{"type":"quelle","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Crypto qui","content":"ORGANIZATION"},{"type":"Financial Crimes Enforcement Network ( FinCEN","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Crypto du destinataire","content":"ORGANIZATION"},{"type":"Crypto dépasse 3","content":"ORGANIZATION"}],"hashtag":["Learn","Intermediate","industry","FATF","Travel Rule","Anti-Money Laundering","French"],"authors":["Andrey Sergeenkov"]}