{"summary":"Se você é uma dos milhões de pessoas que compraram Cripto pela primeira vez em 2021, poderá ter uma surpresa ao pagar seus impostos.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/you-may-owe-crypto-taxes-on-these-surprising-things-in-2022\/","publishDate":"2022-02-17T18:13:45","id":14670,"type":null,"title":"Você pode dever impostos Cripto sobre essas coisas surpreendentes em 2022","category":["Learn"],"content":["A Cripto pode ter começado como uma economia descentralizada discreta, mas agora que o setor de quase US$ 2 trilhões se tornou popular o suficiente para ocupar o cobiçado espaço publicitário do Super Bowl , o Internal Revenue Service (IRS) está bem informado.","O IRS classifica a Criptomoeda como propriedade intangível para fins fiscais, o que significa que os lucros que você obtém com a venda de moeda virtual estão sujeitos a impostos sobre ganhos de capital. Isso vale se você comprou Bitcoin ou altcoins em uma bolsa de Cripto como a Coinbase, ou simplesmente usou um aplicativo como Venmo ou PayPal para comprar e usar Criptomoeda.","Está na vanguarda das mentes dos profissionais tributários este ano: o TurboTax agora pergunta antecipadamente, ao iniciar sua declaração de imposto de renda de 2021, se você negociou ou não Cripto no ano passado. E se você fizer seus impostos no papel com a ajuda de um contador público certificado (CPA), você deve pelo menos estar preparado para contar a eles seus ganhos Cripto em 2021. (Isso é mais fácil quando você conecta sua carteira a um aplicativo de rastreamento de portfólio Cripto que pode calcular seus ganhos e perdas de capital em minutos.)","Esta peça faz parte da Tax Week da CoinDesk .","Mas o que exatamente o IRS considera “ganhos” quando se trata de Cripto – e o que desencadeia um evento tributável? Vamos dar uma olhada em como o IRS classifica os seguintes cenários.","Você ganhou um NFT , comprou bens de uso diário com Cripto ou ganhou Cripto suficiente para empurrá-lo para uma nova faixa de impostos? Aqui estão alguns impostos Cripto “surpresa” comuns e como os especialistas sugerem que você se mantenha preparado.","A Cripto foi um presente popular no ano passado. De acordo com uma pesquisa da BlockFi , uma em cada 10 pessoas deu Cripto como presente de Natal.","Por mais emocionante que a Cripto possa ser, se você a deu de presente, deve estar ciente das regras do IRS sobre presentes. Há um limite de US$ 15.000 para presentes para 2021, o que significa que o doador T precisa pagar impostos sobre o presente, desde que valha US$ 14.999 ou menos. Se o valor da doação for superior a US$ 15.000, a carga tributária recai sobre o doador generoso, que deve preencher o formulário 709 do IRS .","“Se meus pais me derem US$ 10.000 em Bitcoin , isso não será renda tributável para mim”, disse David Kemmerer , CEO e cofundador do CoinLedger, um software de relatório de impostos Cripto .","Mas existem algumas nuances. Se você receber Cripto e ela ganhar valor e você obtiver um ganho de capital ao vendê-la (seja por dólares americanos ou por uma Criptomoeda diferente), você será obrigado a pagar impostos sobre ganhos de capital sobre o valor que lucrou – não o valor total você o vendeu.","Os impostos sobre ganhos de capital também são calculados com base em sua renda e por quanto tempo você manteve o ativo antes de vendê-lo. (Aprenda mais sobre como o IRS calcula os impostos sobre ganhos de capital .)","Qualquer pessoa nas redes sociais provavelmente já ouviu falar de tokens não fungíveis (NFTs) , mas poucos sabem como eles são tributados.","Leia Mais: 5 coisas para lembrar ao pagar seus impostos NFT","O IRS ainda não divulgou orientações definitivas sobre NFTs, mas é importante notar que as autoridades fiscais britânicas fizeram recentemente a primeira apreensão de NFTs do país durante uma investigação de fraude e repressão fiscal. É claro que os cidadãos dos EUA T podem recorrer a outros países para obter orientações fiscais precisas, mas está se tornando cada dia mais claro que os consumidores T devem tentar varrer as compras e negociações de NFT para debaixo do tapete.","Até que o IRS emita orientações mais detalhadas, os profissionais fiscais aconselham tratar os NFTs como ativos virtuais, como qualquer outra Cripto. Há três coisas a serem observadas aqui:","Uma última possibilidade é que o IRS classifique os NFTs como itens colecionáveis ​​– semelhantes a selos, antiguidades ou cartões colecionáveis. Se o fizessem, os impostos sobre ganhos de capital seriam ligeiramente superiores ao normal, a uma taxa de 28%. Por enquanto, a maioria dos CPAs sugere seguir as leis normais sobre ganhos de capital, embora isso sempre possa mudar.","Um número crescente de pessoas em todo o mundo está obtendo uma renda adicional por meio de videogames do tipo \"jogue para ganhar\", que recompensam os jogadores com tokens de Finanças descentralizadas ( DeFi ) que podem conter valor do mundo real e podem ser trocados por moedas Cripto ou fiduciárias (governamentais).","Leia Mais: Evite dores de cabeça fiscais com Cripto : o que você precisa saber se comprou ou vendeu Cripto em 2021","Embora esta nova fonte de dinheiro tenha beneficiado muitos, a Cripto obtida nestes jogos online não está isenta de impostos.","“Os tokens de recompensa cairão em um grupo tributável semelhante ao das recompensas de staking”, disse Kate Waltman , uma CPA que se concentra em Criptomoeda e ativos digitais. “ Staking ” é um processo DeFi avançado que permite que os traders obtenham renda passiva em suas Cripto em troca de permitir que o blockchain as bloqueie por um período de tempo (geralmente meses). Todos os jogadores T são necessariamente versados ​​em DeFi, por isso é importante que eles estejam cientes de como o IRS tributará seus ganhos Cripto .","“Essas recompensas serão tributáveis, em vez de jogar videogames tradicionais, onde você pode ganhar recompensas no jogo, mas elas só podem ser usadas dentro do jogo”, disse Waltman. “A questão complicada aqui T é saber que é tributável, mas sim saber como valorizamos esses tokens?”","De acordo com Waltman, o IRS ainda T ofereceu regulamentação concreta com relação a esses detalhes. “Acho que muitas pessoas estão jogando videogame e ganhando tokens de recompensa Cripto e podem não perceber que eles realmente têm valor”, disse ela.","Muitas pessoas ganharam dinheiro com Cripto no ano passado, de acordo com Waltman. Alguns, portanto, ultrapassaram o limite do rendimento bruto ajustado (AGI) de 200.000 dólares pela primeira vez – e podem ter impostos mais elevados do que o normal.","Nesse caso, os novos assalariados de alta renda precisarão pagar o Imposto sobre o Rendimento de Investimento Líquido (NIIT), um imposto de 3,8% que é adicionado aos seus ganhos de capital, dividendos e receitas de royalties.","“Se você é um indivíduo e sua renda bruta ajustada modificada excede US$ 200.000, então você aciona esse Imposto de Renda de Investimento Líquido além do imposto normal sobre ganhos de capital que você já está pagando”, disse Waltman.","O limite de renda sobe para US$ 250.000 para pessoas que são casadas e fazem o pedido em conjunto, e cai para US$ 125.000 para aqueles que são casados ​​e fazem o pedido separadamente.","Aprenda mais sobre o NIIT no site do IRS .","A compra de bens e serviços com Cripto – mesmo pequenas compras, como comprar um café – pode desencadear um evento tributável aos olhos do IRS.","Eis o porquê: pagar por itens de uso diário envolve a troca de uma moeda digital (por exemplo, Bitcoin, Ethereum, Dogecoin, ETC) por moeda fiduciária (por exemplo, o dólar americano). Cartões de débito Cripto pré-pagos e cartões de crédito Cripto tornam esse processo tão simples que pode não parecer que vale a pena informar o IRS. No entanto, pequenas transações ao longo do ano podem representar uma soma significativa. Aqueles que compram bens e serviços diários com Cripto devem, portanto, KEEP bons registros.","Isso nos leva ao nosso próximo ponto…","“Então, estes são realmente interessantes”, disse Waltman. “Do ponto de vista tributário, é meio complexo.”","Cartões Cripto de débito e crédito populares, como o Gemini Mastercard e o cartão de recompensas Bitcoin BlockFi, tornaram mais fácil a compra de itens na loja usando Cripto. Além disso, os usuários podem ganhar recompensas Cripto , como 3% de volta em Bitcoin em gastos.","Esses cartões podem simplificar os relatórios de Cripto do IRS ou, em outros casos, abri-los para Eventos ainda mais tributáveis ​​com sua Cripto.","Leia Mais: Os 7 tipos de pesadelos fiscais Cripto","As recompensas geralmente T são tributáveis, observou Waltman, e são tratadas como pontos de cartão de crédito e milhas aéreas que você ganha após atender a certas condições de gasto. Os consumidores que usam cartões de débito que lhes permitem gastar em dólares americanos, mas ganhar em Cripto, T precisam relatar suas recompensas até que as troquem por moeda fiduciária ou outra Criptomoeda por meio de uma compra ou troca.","“Essa é uma maneira realmente interessante de começar a acumular e adquirir Cripto sem que ela seja uma renda tributável para você imediatamente”, disse Waltman.","No entanto, se o seu cartão de recompensas Cripto for um cartão pré-pago e você estiver realmente pagando com um saldo de Cripto cada vez que passar o cartão, há uma troca acontecendo nos bastidores que exige relatórios do IRS.","“O Bitpay, por exemplo, permite que você pague com sua Cripto ”, disse Waltman. “Quando você passa o cartão , Bitcoin Para Você moeda fiduciária. Essa troca terá ganhos de capital.”","Leia Mais: Um guia completo para impostos Cripto dos EUA em 2022","CORREÇÃO (17 de fevereiro, 17h05 UTC): O artigo afirmava originalmente que o destinatário de um presente acima de US$ 15.000 pode precisar relatar isso como renda, mas foi corrigido para dizer que o único doador de um presente é responsável pelos custos associados. relatórios fiscais.","A Cripto T vai salvá-lo dos impostos, mas pode eventualmente torná-los mais fáceis de pagar, diz o futurista Dan Jeffries.","A orientação fiscal fica atrás da inovação. O mesmo acontece com o software fiscal. Enquanto isso, abundam os equívocos. Se não tomar cuidado, os investidores podem acabar devendo mais impostos do que o esperado e tendo que descarregar Cripto para pagar a conta","Os investidores na MicroStrategy, Tesla, Block e Coinbase precisam de considerar como as oscilações bruscas de preços afetarão os resultados, não apenas direta mas indiretamente devido a regras complexas de contabilidade fiscal."],"entity":[{"type":"observou Waltman","content":"PERSON"},{"type":"sobe","content":"ORGANIZATION"},{"type":"abri","content":"ORGANIZATION"},{"type":"3,8%","content":"PERCENT"},{"type":"Bitcoin BlockFi","content":"PERSON"},{"type":"Dan Jeffries","content":"PERSON"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"loja","content":"LOCATION"},{"type":"Evite","content":"ORGANIZATION"},{"type":"faz parte da Tax Week da CoinDesk","content":"ORGANIZATION"},{"type":"Cripto como presente de Natal","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"David Kemmerer","content":"PERSON"},{"type":"Gemini Mastercard","content":"ORGANIZATION"},{"type":"Kate Waltman","content":"PERSON"},{"type":"US$ 250.000","content":"MONEY"},{"type":"Bitcoin Para Você","content":"ORGANIZATION"},{"type":"Aprenda mais sobre como o IRS","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"US$ 15.000","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Leia Mais","content":"PERSON"},{"type":"Dogecoin","content":"LOCATION"},{"type":"TurboTax","content":"ORGANIZATION"},{"type":"EUA","content":"ORGANIZATION"},{"type":"Tesla","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"o Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"NIIT","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"Waltman","content":"PERSON"},{"type":"US$ 125.000","content":"MONEY"},{"type":"US$ 200.000","content":"MONEY"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"US$ 14.999","content":"MONEY"},{"type":"Imposto de Renda de Investimento Líquido","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["industry","Beginner","Learn","tax week","portuguese"],"authors":["Megan DeMatteo"]}