{"summary":"Infura will develop a decentralized protocol featuring open-source core components for Web3 APIs with help from infrastructure providers.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/170787\/infura-to-launch-open-source-decentralized-protocol-for-web3-apis","publishDate":"2022-09-16T13:56:05","id":1467,"type":null,"title":"Infura to launch open source decentralized protocol for Web3 APIs","category":["WEB3"],"content":["<span data-v-f87c67ca=\"\">Infura invites qualified infrastructure providers to participate in a new decentralized protocol slated for launch early next year.<\/span>","<span data-v-f87c67ca=\"\">The blockchain software company will continue to develop and provide its centralized Web3 API services.<\/span>","ConsenSys powered Web3 API provider Infura will look to deploy a decentralized protocol early next year in the interest of offering a more decentralized model for the management of Ethereum’s application layer, Coindesk <a href=\"https:\/\/www.coindesk.com\/business\/2022\/09\/16\/blockchain-tool-developer-infura-plans-to-launch-decentralized-protocol\/\" data-v-f87c67ca=\"\">reports<\/a>.","The progressive update will see Infura augment its Web3 API services by developing open-source repositories for the protocol’s core processes, and decentralizing the JSON RPC API responsible for connecting users to Ethereum. Infura’s first step will be to establish an open-source initiative to engage the wider DeFi community according to Infura co-founder Eleazar Galano, who today invited “early partners” to collaborate on the decentralized infrastructure.","Serving roughly 350,000 users and 430,000 developers, Infura’s software connects decentralized applications, or dApps, to Ethereum without setting up a full node. Infura facilitates many widely used dApps such as MetaMask, ENS, as well as many layer 2 scaling solutions. Those that wish to forgo the operational costs associated with running a full node can turn to Infura, and in exchange, Infura harvests available IP and wallet address data from users that a full node otherwise shields.","Infura will develop its decentralized infrastructure while continuing parallel development on its centralized products that use ConsenSys, and Amazon-hosted cloud services to power Web3 platforms.","“What we're focused on decentralizing is the lower level infrastructure layer beneath that so there's more interoperability between operators that serve this type of traffic,” Galano told CoinDesk, adding that certain things in the customer experience can’t be decentralized.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eleazar Galano","content":"PERSON"},{"type":"Galano","content":"PERSON"},{"type":"Infura","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Infura","content":"ORGANIZATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}