{"summary":"Mais pessoas estão pedindo que as empresas de Cripto e as que estão por trás de produtos como stablecoins provem que têm fundos suficientes para pagar seus clientes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/pt-br\/learn\/what-are-fully-backed-reserves\/","publishDate":"2022-11-22T23:04:02","id":14679,"type":null,"title":"O que são reservas “totalmente garantidas”?","category":["Learn"],"content":["Na verdade, os bancos normais não detêm todo o seu dinheiro. Eles emprestam a maior parte dos seus depósitos na tentativa de obter retornos dos Mercados financeiros. Isto funciona, na maior parte, porque o banco assegura depósitos junto do governo federal e porque o banco diversifica amplamente a sua exposição ao risco para garantir que T será apanhado a descoberto no caso de uma crise financeira.","Este sistema falha ocasionalmente nas Finanças tradicionais (ver: Lehman ), mas falha frequentemente nas Cripto. O governo não garante depósitos em plataformas Cripto e as plataformas muitas vezes não gerem o risco particularmente bem (ver: FTX , Voyager Digital , Celsius Network ), fazendo apostas de alto risco que terminam em catástrofe.","Leia Mais: Prova de reservas: poderia ter evitado o colapso da FTX?","Depois de tantas plataformas terem desperdiçado fundos de clientes, os traders de Cripto estão a pensar duas vezes antes de depositar fundos em bolsas de Cripto e instituições de crédito que “reaproveitam” depósitos não segurados – o que significa que reaproveitam o dinheiro dos clientes e emprestam os fundos nos Mercados. Uma aposta mais segura é negociar em plataformas que “apoiam totalmente” as suas reservas. Mas o que isso realmente significa, e tais afirmações devem ser encaradas com cautela?","Quando um produto financeiro, como uma moeda estável ou uma instituição depositária, afirma “garantir totalmente” as suas reservas, significa que armazenou dinheiro suficiente atrás de um produto, como uma moeda estável ou uma conta de negociação de um cliente, para sustentar o seu valor.","Portanto, uma bolsa de Cripto que “apoia totalmente” suas reservas deve sempre ser capaz de pagar as retiradas dos clientes, independentemente da situação do mercado. Um exemplo é a Coinbase , que não empresta fundos aos seus clientes sem a sua autorização expressa, o que significa que deve ter sempre dinheiro suficiente em mãos para evitar uma corrida aos bancos.","Uma stablecoin que “apoia totalmente” suas reservas é sempre capaz de realizar conversões para o ativo original, não importa o que aconteça. Um exemplo é WBTC, ou Wrapped Bitcoin , que mantém Bitcoin real (BTC) em uma carteira fria e, em seguida, emite uma quantidade igual de uma versão da moeda baseada em Ethereum que é negociada como um token ERC-20 .","Totalmente garantido, no entanto, não significa necessariamente que os ativos sejam ONE . Essa afirmação refere-se à ideia de que se você, digamos, me der um dólar, eu manterei esse dólar como um dólar e T o transformarei em outra coisa. Muitas stablecoins que afirmam ser totalmente garantidas, como a stablecoinUSDC , em dólar americano, não são garantidas ONE .","Isso ocorre porque as empresas que emitem USDC detêm os depósitos de dólares americanos reais em “dinheiro e equivalentes de caixa”. Os equivalentes de caixa referem-se a títulos do Tesouro dos EUA, que são dívidas emitidas pelo Departamento do Tesouro dos EUA. Estas obrigações, que pagam pequenos retornos aos detentores ao longo do tempo, estão suficientemente próximas do valor real dos dólares americanos para que o mercado aceite que as obrigações tenham essencialmente o mesmo valor.","Mas “totalmente garantido” nem sempre significa que o apoio pode resistir a choques financeiros. O stablecoin Tether do dólar americano (USDT) também afirma que suas reservas são totalmente garantidas, mas esse respaldo é garantido por “outros ativos e contas a receber de empréstimos feitos pela Tether [a empresa emissora] a terceiros”. Portanto, o USDT pode ser totalmente garantido, mas é parcialmente garantido por empréstimos a outras empresas de Cripto .","Até Outubro de 2022, o USDT também era garantido por papel comercial – dívida comercial de curto prazo a outras empresas – e transferia esses fundos para títulos do Tesouro dos EUA. A preocupação com o papel comercial era que ninguém sabia quais empresas o Tether estava usando para apoiar o USDT, então era impossível determinar o valor desse apoio. Além do mais, sua afirmação de “totalmente respaldado” acabou historicamente não sendo verdadeira depois que surgiu em 2019 que o USDT era, a ONE altura, apenas 74% respaldado . Tal como escreveu Dawn D. Stump, da Comissão de Negociação de Futuros de Commodities, a alegação de que estava apoiada no dólar americano “não era 100% verdadeira, 100% das vezes”.","Leia Mais: O que é Tether? Como funciona o USDT e o que sustenta seu valor","Algumas stablecoins não garantem totalmente as suas reservas, o que levou a resultados catastróficos em alguns casos. A popular stablecoin algorítmica UST, por exemplo, caiu de forma espetacular , eliminando bilhões do mercado.","No extremo oposto do espectro, a stablecoin Dai do dólar americano supercolateraliza suas reservas com Cripto, o que significa que tem Cripto mais do que suficiente em mãos para garantir sua moeda. O Dai sobreviveu a várias quedas de mercado.","\n"],"entity":[{"type":"100%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"da Comissão de Negociação de Futuros de Commodities","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"EUA","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"UST","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"74%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Dawn D. Stump","content":"PERSON"}],"hashtag":["Learn","industry","Beginner","portuguese"],"authors":["Robert Stevens"]}