{"summary":"The SEC’s incoherent approach to the market is having a chilling effect on compliant and regulated investors. But there are workarounds that give investors greater comfort, says Jason Hall, CEO of Methodic Capital.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/09\/27\/eth-staking-has-a-bright-future-despite-regulatory-uncertainty\/","publishDate":"2023-09-27T16:00:39","id":14682,"type":null,"title":"ETH Staking Has a Bright Future, Despite Regulatory Uncertainty","category":["Consensus Magazine"],"content":["Since Ethereum transitioned to a proof-of-stake consensus mechanism in 2022, the blockchain has been maintained and secured by users who stake ETH and run validators. The mechanism is simple. Validators deposit ETH in a smart contract, run software to validate and propose new blocks, and get paid for providing this service.","The Ethereum blockchain was designed so that staking can be accessible to any user that owns at least 32 ETH, with the hope that ETH owners around the world will choose to stake their assets, increasing the decentralization and security of the network.","This article is part of CoinDesk's \"Staking Week.\" Jason Hall is the CEO of Methodic Capital Management.","ETH staking allows users to provide a service to the network, contributing value to the asset they already own. Payment for this service is accrued in ETH, which has the added benefit of compounding any returns generated by the underlying asset.","Importantly, this payment is incurred without many risks. At time of writing, only 279 of 805,945 (0.03%) validators have lost any portion of the 32 ETH they deposited which can happen in a process called slashing, essentially a penalty for compromising network integrity.","Despite the volatility of the asset class, the major technical upgrades and many other risks associated with the technology, it is relatively safe to run a validator and receive staking rewards in return.","However, additional risk is incurred when intermediaries stake ETH on behalf of owners. Exchanges and staking providers offering this service have not always transparently reported staking returns, failing to link payments to the ETH staking rate and disclosing the risks associated with staking.","Additionally, to provide better user experiences (i.e. by removing staking lockups), some providers managed reserves of customer funds, financializing the staking service. As such, a number of staking service providers have been targeted by the SEC for offering staking services, which we believe has tarnished staking in the eyes of many observers.","Much of this confusion has been propagated by U.S. Securities and Exchange Commission (SEC) Chief Gary Gensler. Last year, Gensler stated that staking “looks very similar — with some changes of labeling — to lending.”","However, lending and staking are fundamentally different concepts, with different risks. Lending is an agreement between parties to exchange money today for money tomorrow, at the cost of an agreed-upon interest rate. Staking is a technical service that validators provide the Ethereum blockchain. The payment to validators is not fixed and is determined by network activity. Both activities need rules but the same ones shouldn’t apply.","Proper lending due diligence is a detailed, complex process. The investor (the “lender”) must first underwrite the credit quality of the entity they make a loan to (the “borrower”). Lenders assess the borrower’s credit by verifying the borrower’s ability to make interest payments and pay back the principal of the loan.","Given that borrowers have discretion on the use of funds once a loan is made, this process requires an analysis and assessment of a borrower's future performance. If this assessment is correct, lenders get their principal back plus interest. If wrong, lenders could lose part, or all, of the loan amount.","Staking Ethereum is a completely different arrangement and thus requires a completely different diligence process. Prospective validators must verify their understanding of the technical specifications of staking, answering questions like: are they running the correct software or will they be able to maintain internet uptime? Validators must also understand infrastructure security to ensure their signing keys are stored safely and not accessible to potential hacks.","Compensation for staking is not determined by validators but comes directly from the Ethereum network and consists of consensus rewards and transaction fees. Additionally, neither validators nor the Ethereum network have ability to move or rehypothecate (i.e. reinvest) staked assets. If validators make an honest mistake, like not maintaining internet uptime, the 32 ETH they deposited will most likely be returned without penalty. If they run malicious software to try to attack the network, their 32 ETH deposit will be penalized. Simply put, bad actors will be punished but less sophisticated or apathetic actors will not.","Despite these differences, regulators have recently been making the argument that staking should be regulated like lending. What this has functionally achieved is many investors are left without options. Ether has been flowing from regulated U.S. companies to decentralized finance (DeFi) projects like Lido or Rocketpool.","Over the past six months, centralized exchanges Coinbase and Kraken staking are down 4% and 36%, respectively, while Lido and Rocketpool are up 56% and 85%. Many more investors are simply holding ETH and not staking it, due to regulatory fears. As a result, they are not earning staking rewards (~4% over the past 12 months), or contributing to the security of the Ethereum network.","See also: Coinbase, SEC Spar Over Definition of Securities, Nature of Staking ","Currently, we believe one of the best available solutions in this regulatory environment is staking assets through private funds. The fund manager can conduct diligence on staking service providers on behalf of investors to identify the leading solutions. By pooling investor funds, managers can achieve economies of scale, driving down costs of staking, security, trading and so on.","A private fund structure also provides a layer of regulatory insulation when staking is run from under an investment advisor umbrella. Regulatory questions about, for example, whether staking services are a technology service or an investment activity become irrelevant if the manager is properly structured.","Additionally, private funds can be held in traditional balance sheet compatible fund shares, or crypto balance sheet friendly token form. A professional fund manager can continuously survey and assess partnerships in the industry to increase the efficacy, safety and liquidity available to investors.","The industry is building solutions to a myriad of problems caused by regulatory ambiguity. Service providers such as the Liquid Collective, in collaboration with the advocacy group Proof of Stake Alliance, address investors’ specific needs regarding liquidity and security with a deep focus on solving the questionable compliance practices of DeFi liquid staking providers. Traditional investors can access solutions like Liquid Collective and others through private fund structures.","See also: Staking Brings Decentralization Back to DeFi | Opinion","CoinDesk Indices in partnership with Coin Fund has created the Composite ETH Staking Rate (CESR), a benchmark for investors to hold managers, exchanges, and service providers accountable for their returns. Indices are the cornerstone of a robust derivatives market and institutional participation. There has been a dearth of professional index products for institutional investors. DeFi has mature indices, through products like staked ETH, but TradFi investors that want private fund exposure have to contend with deviations from NAV, high fees, no staking and sloppy compliance.","It is our sincere hope that the U.S. changes its approach to staking regulation. Increasing access to staking through thoughtful policy would be a boon for the users, the industry and also for the U.S. The most effective way to influence this technology is by regulating the control points. The current policy of regulation by enforcement is so extreme that it has pushed users away from regulated entities.","However, the window of opportunity has not closed, and by engaging with industry groups like the Proof of Stake Alliance, we are hopeful that regulators can craft policy promoting domestic capital formation. One day, we believe countries will be competing for influence over Ethereum validators. Instead of waiting until that day comes, let’s work together to create thoughtful regulation that promotes safety and stability.","Edited by Ben Schiller."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"0.03%","content":"PERCENT"},{"type":"Ben Schiller","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Methodic Capital Management","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"4%","content":"PERCENT"},{"type":"NAV","content":"ORGANIZATION"},{"type":"56%","content":"PERCENT"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"Proof of Stake Alliance","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Jason Hall","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"36%","content":"PERCENT"},{"type":"SEC Spar Over Definition of Securities","content":"ORGANIZATION"},{"type":"Nature of Staking","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Opinion","Staking week 2023"],"authors":["Jason Hall"]}