{"summary":"Coinbase is a popular crypto exchange based in the U.S. that offers high-level security as well as a wallet app for its users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/coinbase-101-what-you-need-to-know-about-the-crypto-exchange-and-wallet\/","publishDate":"2022-08-10T15:54:52","id":14688,"type":null,"title":"Coinbase 101: What You Need to Know About the Crypto Exchange and Wallet","category":["Learn"],"content":["Coinbase (COIN) is the largest crypto exchange by volume in the U.S., and is the world’s largest publicly traded crypto company. The exchange has made headlines with partnerships from the National Basketball Association to Meta (META) and most recently, BlackRock (BLK).","Coinbase is a centralized exchange, meaning it monitors transactions and secures assets on your behalf. As of writing, Coinbase offers support for buying, selling and storing over 200 cryptocurrencies including bitcoin (BTC), ether (ETH) and other digital assets.","Beyond the exchange, Coinbase also offers a wallet, a non-fungible token (NFT) marketplace and an institutional offering, Coinbase Prime.","There are certain features that make Coinbase stand out from other exchanges on the market. Here are some of them:","If you’re looking to open a Coinbase account, either download the app or go to coinbase.com in your browser and follow these steps:","In addition to being a popular crypto exchange, Coinbase offers a wallet for storing your cryptocurrencies.","The Coinbase Wallet is available for both iOS and Android devices, and it's one of the most popular cryptocurrency wallets, surpassing over 10 million downloads. The wallet is secure and easy to use.","The wallet is a non-custodial (also known as a self-custody) wallet in which you keep control over your crypto and security keys. It is a hot wallet, which means it is connected directly to the internet.","Read more: Hot vs. Cold Crypto Storage: What Are the Differences?","Coinbase launched its NFT marketplace on May 4, 2022, allowing users to buy, sell and collect NFTs on its Ethereum-based platform and aims to build an active community of buyers and sellers. Some of the NFT collectibles available are Bored Ape Yacht Club and CryptoPunks, as seen in Coinbase's Trending section.","The marketplace is compatible with both the Coinbase wallet and MetaMask wallets. There is a maximum of 10 addresses that can be connected to your marketplace account.","In regards to its fee structure, a buyer or seller needs to be mindful of gas (transaction) fees on the Ethereum network. As network congestion is determined by the number of transactions happening during a specific time period, gas fees will fluctuate. You generally will pay less in gas fees if you are willing to slow the transaction time.","Some of the creative works in the marketplace include:","It is important to note that the Coinbase NFT marketplace is currently in beta, which means it is still undergoing user and usability testing.","Read more: How to Make, Buy and Sell NFTs","Coinbase has made headlines, both good and bad, since it was founded in 2012. Here are some of the key milestones, announcements and newsworthy events in the company’s evolution:"],"entity":[{"type":"Coinbase","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"May 4, 2022","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"National Basketball Association","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Coinbase Prime","content":"ORGANIZATION"},{"type":"Coinbase NFT","content":"ORGANIZATION"}],"hashtag":["Learn","Cryptocurrency","Beginner","Coinbase"],"authors":["Mike Antolin"]}