{"summary":"The defunct crypto exchange will distribute 142,000 BTC and 143,000 BCH to creditors later this year, 10 years after its implosion due to a hack.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/23\/mt-goxs-looming-9b-payout-could-weigh-on-bitcoin-prices-k33-research-warns\/","publishDate":"2024-04-23T16:47:04","id":14690,"type":null,"title":"Mt. Gox's Looming $9B Payout Could Weigh on Bitcoin Prices, K33 Research Warns","category":["Markets"],"content":["The crypto market has mostly shrugged off last week's correction, but there's a possible catalyst ahead that could weigh on prices through the next few weeks, putting a rally higher in jeopardy.","Crypto firm K33 Research said in a Tuesday report that Mt. Gox, a crypto exchange that imploded due to a hack in 2014, is gearing toward distributing 142,000 bitcoin (BTC) worth roughly $9.5 billion and 143,000 bitcoin cash (BCH) worth $73 million to creditors, posing a substantial overhang on digital asset prices.","\"Mt. Gox coins could become a relevant negative price contributor in the next weeks,\" authors Anders Helseth and Vetle Lunde wrote.","The warning comes as creditors saw their BTC and BCH claims were being updated recently in the Mt. Gox claim filing system, a development that could foreshadow upcoming payments earlier than previously expected. The trustees of the defunct exchange last year set an Oct. 31, 2024 deadline to reimburse creditors.","Read more: Mt. Gox Moves Seemingly Closer to Bitcoin Repayments for 2014 Hack Victims","Creditors saw a similar update mid-March on their cash repayments with several users claiming that they have received the transfer, the K33 report noted.","If the crypto payout process mirrors fiat refunds, creditors could start receiving digital assets as soon as next month, the authors said.","While it's unlikely that creditors will sell their payouts en masse, the report explains, the anticipation could prompt market players to stay cautious and avoid taking risks ahead of the event.","\"Repayments do not necessarily equate to selling pressure, as creditors might opt to hold on to funds,\" but it's \"an overhang that might spook the market shortly,\" Helseth and Lunde said.","Edited by Kevin Reynolds.","\n","\n"],"entity":[{"type":"Gox","content":"PERSON"},{"type":"2014","content":"DATE"},{"type":"Anders Helseth","content":"PERSON"},{"type":"BCH","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Oct. 31, 2024","content":"DATE"},{"type":"K33 Research","content":"ORGANIZATION"},{"type":"Vetle Lunde","content":"PERSON"},{"type":"Lunde","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Kevin Reynolds","content":"PERSON"},{"type":"$73 million","content":"MONEY"},{"type":"$9.5 billion","content":"MONEY"}],"hashtag":["Markets","Mt. Gox","Bitcoin","K33 research"],"authors":["Krisztian Sandor"]}