{"summary":"Gulf Binance, the joint venture, has commenced full crypto exchange operations for the general public, the company said today.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/272754\/binances-joint-venture-with-gulf-energy-begins-exchange-operations-in-thailand","publishDate":"2024-01-16T01:00:04","id":147,"type":null,"title":"Binance&#x27;s joint venture with Gulf Energy begins exchange operations in Thailand","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Gulf Binance, a joint venture between Binance and Thailand’s Gulf Innova, has launched crypto exchange services to the general public in Thailand following an <\/span><a href=\"https:\/\/www.theblock.co\/post\/263249\/binance-to-start-crypto-exchange-in-thailand-through-joint-venture-with-gulf-energy\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">invite-only test<\/span><\/a><span data-v-f87c67ca=\"\"> in November.<\/span>","<span data-v-f87c67ca=\"\">In a statement shared with The Block today, Binance said that Gulf Binance — set up by Binance Capital Management and a unit of Gulf Energy Development — is commencing full operations of its crypto exchange and brokerage platform, named Binance TH.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Thai users can buy and sell crypto with local currency pairing with their Binance TH accounts, according to the statement.<\/span>","<span data-v-f87c67ca=\"\">The launch of the Thai exchange comes after the company <\/span><a href=\"https:\/\/www.theblock.co\/post\/232330\/binance-gulf-thailand\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">obtained crypto asset exchange and brokerage operator licenses<\/span><\/a><span data-v-f87c67ca=\"\"> from the country’s Ministry of Finance in May 2023. The exchange said in November that it would initially be available for users by invitation only before opening up to the public.<\/span>","<span data-v-f87c67ca=\"\">For its crypto brokerage service, Binance TH said it has integrated its orderbook with Binance Kazakhstan, an exchange in Kazakhstan regulated by the Astana Financial Services Authority.<\/span>","<span data-v-f87c67ca=\"\">“Over the past year, we have been working closely with Thai regulators, putting substantial effort into detailed planning,” Nirun Fuwattananukul, CEO of Gulf Binance, said in the statement. “As a result, Binance TH is now able to offer access to proven and secure technology, ensuring a reliable and intuitive platform for our Thai users.”<\/span>","<span data-v-f87c67ca=\"\">Richard Teng, chief executive officer of Binance, said that the launch of Binance TH is “a strategic step forward, setting the stage for Thailand’s impending role as a key player in the global digital finance landscape.”<\/span>","<span data-v-f87c67ca=\"\">Binance and Thailand billionaire Sarath Ratanavadi's Gulf Energy <\/span><a href=\"https:\/\/www.theblock.co\/linked\/130506\/binance-thailand-gulf-energy-crypto-exchange\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">first reached an agreement about the joint venture<\/span><\/a><span data-v-f87c67ca=\"\"> in early 2022.<\/span>","<span data-v-f87c67ca=\"\">Binance said in the statement today that Gulf’s vast network in Thailand could help the exchange to “offer a localized and compliant digital asset trading platform tailored to Thai users' needs.”<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Gulf Energy","content":"ORGANIZATION"},{"type":"November 2023","content":"DATE"},{"type":"Binance Kazakhstan","content":"PERSON"},{"type":"Binance Capital Management","content":"ORGANIZATION"},{"type":"Gulf Binance","content":"PERSON"},{"type":"May 2023","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Binance TH","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"Nirun Fuwattananukul","content":"PERSON"},{"type":"Gulf Energy Development —","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Gulf Innova","content":"ORGANIZATION"},{"type":"Thailand","content":"LOCATION"},{"type":"Kazakhstan","content":"LOCATION"},{"type":"Richard Teng","content":"PERSON"},{"type":"Sarath Ratanavadi","content":"PERSON"},{"type":"Astana Financial Services Authority","content":"ORGANIZATION"},{"type":"’s Ministry of Finance","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["ASIAN REGULATION","BINANCE"],"authors":["Timmy Shen","The Block"]}