{"summary":"FTX bankruptcy lawyers reveal major mismanagement of financial records in new court filings.\nThe firm’s new CEO said he’s never seen “such a complete failure of corporate controls.” And he was at Enron.","author":["Kollen Post","Stephanie Murray","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188187\/the-ftx-bankruptcy-filings-are-a-doozy-we-bring-you-the-highlights","publishDate":"2022-11-17T16:16:01","id":147,"type":null,"title":"The FTX bankruptcy filings are a doozy. We bring you the highlights.","category":["The Block"],"content":["Bankruptcy lawyers for crypto exchange FTX filed 41 pages of legal documents full of fresh details about how ex-CEO Sam Bankman-Fried ran — or didn’t run — the company and the myriad of flaws in the firm’s balance sheets.","Lawyers filed two sets of documents, one in which new CEO John J. Ray III laid out his scathing assessment of the company, and another in which the relocation of one of those cases from Manhattan to Delaware was made. The filings come six days after FTX filed for bankruptcy protection in Delaware.","Here are the can’t-miss bits from the filings:","“Never in my career have I seen such a complete failure of corporate controls and such a complete absence of trustworthy financial information as occurred here. From compromised systems integrity and faulty regulatory oversight abroad, to the concentration of control in the hands of a very small group of inexperienced, unsophisticated and potentially compromised individuals, this situation is unprecedented,” Ray said.","FTX.US, as the business entity West Realm Shire, was supposed to be the risk-averse branch of the FTX operation, abiding by more stringent U.S. regulations and customer protections. Bankman-Fried tweeted on Nov. 15 that “to the best of my knowledge […] FTX US had enough to repay all customers.”","The balance sheet in the filings shows FTX.US, as having $1,360,665 in assets and only $316,014 in liabilities. But:<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The WRS Silo Debtors are expected to have significant liabilities arising from crypto assets deposited by customers through the FTX US platform. However, such liabilities are not reflected in the financial statements prepared while these companies were under the control of Mr. Bankman-Fried.”","FTX had a secret exemption for Bankman-Fried’s Alameda trading firm, along with a whole lot of other book-keeping and private key security problems.","“Unacceptable management practices included the use of an unsecured group email account as the root user to access confidential private keys and critically sensitive data for the FTX Group companies around the world,” Ray said, suggesting that private keys holding billions in user deposits were held on the equivalent of a Google Sheet.","Other problems included “the absence of daily reconciliation of positions on the blockchain, the use of software to conceal the misuse of customer funds, the secret exemption of Alameda from certain aspects of FTX.com’s auto-liquidation protocol, and the absence of independent governance as between Alameda (owned 90% by Mr. Bankman-Fried and 10% by Mr. Wang) and the Dotcom Silo (in which third parties had invested),” according to Ray.","Bankman-Fried’s \"incessant and disruptive\" Twitter habit is unusual for an executive, and it could get him into trouble.&nbsp;","“In terms of the celebrity of Mr. Bankman-Fried, his unconventional leadership style, his incessant and disruptive tweeting since the Petition Date, and the almost complete lack of dependable corporate records, these Chapter 11 Cases are unprecedented.\"","It's not just Twitter. Bankman-Fried spilled his guts to Vox and the conversation has already shown up in court documents, less than 24 hours after it being published. In his defense, Bankman-Fried has said his comments were “not intended to be public.”","“Mr. Bankman-Fried just yesterday expressed profane disdain for regulators, his regrets at these Chapter 11 Cases having been filed, and disclosed his goal that ‘we win a jurisdictional battle vs. Delaware’ to have any proceedings occur in the Bahamas, as documented in the following exchange.”","Bankman-Fried resigned as CEO in the early morning hours last Friday.","“At approximately 4:30 a.m. EST on Friday, November 11, 2022, after further consultation with his legal counsel, Mr. Bankman-Fried ultimately agreed to resign.” That counsel included law firm Paul Weiss, as well as Bankman-Fried’s father, Joseph Bankman, a law professor at Stanford. Mom's also a lawyer, for the record.","FTX.US gave BlockFi a $250 million loan, in the form of the firm’s FTT utility token.","“The WRS Silo has made loans and investments, including a loan of FTT tokens to BlockFi Inc. in a principal amount of FTT tokens valued at $250 million as of September 30, 2022.”","FTX never had a functioning board of directors — until now. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n“The appointment of the Directors will provide the FTX Group with appropriate corporate governance for the first time.”","Many FTX employees did not know how dire the situation was at the company.","“It is my view based on the information obtained to date, that many of the employees of the FTX Group, including some of its senior executives, were not aware of the shortfalls or potential commingling of digital assets. Indeed, I believe some of the people most hurt by these events are current and former employees and executives, whose personal investments and reputations have suffered.”","Bankman-Fried often sent work messages that would auto-delete.","“One of the most pervasive failures of the FTX.com business in particular is the absence of lasting records of decision-making. Mr. Bankman-Fried often communicated by using applications that were set to auto-delete after a short period of time, and encouraged employees to do the same.”","FTX approved employee expenses with emojis.","“Employees of the FTX Group submitted payment requests through an on-line ‘chat’ platform where a disparate group of supervisors approved disbursements by responding with personalized emojis.”"],"hashtag":[]}