{"summary":"Under the plan, Gemini creditors would receive a “fraction” of the money they are owed, Gemini’s lawyers said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/09\/15\/gemini-blasts-dcg-and-genesis-bankruptcy-plan-calling-it-misleading-at-best\/","publishDate":"2023-09-15T17:22:11","id":14700,"type":null,"title":"Gemini Blasts DCG and Genesis Bankruptcy Plan, Calling It ‘Misleading at Best’","category":["Policy"],"content":["Crypto exchange Gemini has criticized a bankruptcy recovery plan related to Genesis, Gemini’s partner on a lending program that’s been frozen for months, saying the potential deal is “misleading at best,” according to a Friday court filing.","Earlier this week, Genesis and its parent company, Digital Currency Group, said more than 230,000 retail creditors who used Gemini’s Earn program stand to be made “nearly whole” under a proposed remuneration deal to be voted on later this year. Earn was offered to customers of the Gemini crypto exchange, but Genesis supplied the financial infrastructure that ran the program. (Genesis, like CoinDesk, is owned by DCG.)","Read more: Beleaguered Gemini Earn Customers Will Be Made ‘Nearly Whole,’ DCG and Genesis Say About Remuneration Plan","But Gemini said Friday that Gemini Earn users will not recover “anything close [to the] real value” of the money they’re owed under the proposal.","“DCG touts proposed recovery rates that are a total mirage – misleading at best and deceptive at worst,” Gemini’s lawyers said in the filing. “Make no mistake: Gemini Lenders will not actually receive anything close in real value terms to the proposed recovery rates under the current ‘agreement in principle.’”","DCG owes more than $1.65 billion to the beleaguered crypto lender Genesis, which, in turn, owes some $1.2 billion to Gemini. Genesis owes over $3 billion to its top 50 creditors overall.","That money, under DCG’s proposed repayment plan, would be paid across two tranches and seven years, and would eventually make Gemini Earn users \"nearly whole,\" according to DCG's lawyers.","Gemini’s lawyers, however, challenged that assertion, alleging DCG’s proposal would allow the firm to pay “par” recoveries through “inadequate” below-market loans.","“Receiving a fractional share of interest and principal payments over seven years from an incredibly risky counterparty … is not even remotely equivalent to receiving the actual cash and digital assets owed today by Genesis to the Gemini Lenders,” Gemini’s lawyers said in the filing.","They added: “DCG’s [proposal] is markedly parallel to … an attempt to satisfy its significant obligations through the issuance of ‘I.O.U.s’ instead of paying any real cash and digital assets.”","In addition, the lawyers complained more broadly about DCG’s efforts to \"wear … down\" Genesis' creditors \"in the hopes that they [would] become desperate enough to take a significant haircut just to move on.\"","Gemini and DCG have feuded for months over Genesis' debts to Gemini. Those public spats culminated in Gemini suing DCG and its CEO in July, one day after DCG missed a deadline to strike a restructuring deal for its beleaguered lending unit.","Edited by Nick Baker and Nikhilesh De."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Gemini","content":"PERSON"},{"type":"Gemini","content":"LOCATION"},{"type":"$1.65 billion","content":"MONEY"},{"type":"Gemini Lenders","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Gemini Earn Customers Will Be Made ‘Nearly Whole","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["Regulations","Digital Currency Group","Genesis","Gemini","Bankruptcy"],"authors":["Elizabeth Napolitano"]}