{"summary":"If you follow crypto on Twitter, Discord or another platform, you may see people saying that they have “FOMO” or that the market is driven by “FUD.” Here’s what you need to know to decode the conversation.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/from-btd-to-fud-to-wagmi-understanding-crypto-acronyms\/","publishDate":"2022-06-28T15:21:00","id":14708,"type":null,"title":"From BTD to FUD to WAGMI: Understanding Crypto Acronyms","category":["Learn"],"content":["Acronyms are common in the crypto world. They can look confusing at first, but once you know the meaning behind the alphabet soup, it is easy to understand and join the crypto conversation.","Let's break down some of the most important and common acronyms from the commonly used ones to those used as trading advice. Once you understand the meanings, you can talk like a pro.","Read more: Non-Fungible Terms: NFT Lingo Every Collector Should Know","\n","CEX: Centralized Exchange is an exchange like Binance or Coinbase that matches up buyers and sellers of cryptocurrencies and holds customer funds.","DAO: Decentralized Autonomous Organization is a member-governed organization with no central authority like a CEO or directors. It is an organizational structure whose rules and regulations are embedded in code and enforced through the use of smart contracts.","Dapp: Decentralized Application is an application that runs on a peer-to-peer network without any central authority or middlemen. It uses a blockchain as its base layer to store data and verify transactions.","DeFi: Decentralized Finance is a method in which financial transactions do not involve an intermediary such as an institution or agent.","DEX: Decentralized Exchange is an exchange where orders are matched via a peer-to-peer network without requiring an intermediary to hold all user funds or deposits in accounts","EVM: Ethereum Virtual Machine is a virtual environment that facilitates the execution of smart contracts and manages its internal state.","PoA: Proof of Authority is a consensus mechanism where a centralized authority controls who is allowed to verify transactions based on their track record of reliability within the blockchain network.","PoS: Proof-of-Stake is a consensus mechanism that requires participants to stake their crypto in order to be a validator of transactions within a blockchain network. In return for staking, these validators have the opportunity to verify transactions to earn more crypto as a reward.","PoW: Proof-of-Work is the consensus mechanism used by Bitcoin and is one of the most common consensus protocols used in blockchain networks. In PoW, miners compete to solve complex mathematical problems to add blocks to a blockchain ledger and receive rewards for their work from the network.","Read more: Proof-of-Work vs. Proof-of-Stake: What Is the Difference?","\n","2FA: Two Factor Authentication adds another layer of security by requiring a second method of verification in addition to a password before granting access. This could be a code sent via text message or generated by an app like Google Authenticator.","ICO: Initial Coin Offering is a way to raise money for a crypto project by minting a native digital token and selling it.","KYC: Know Your Customer refers to the procedures businesses must follow when verifying the identity of their customers.","P2P: Peer to Peer refers to any interaction that happens directly between two parties without an intermediary.","PnD: Pump and Dump occurs when a person or group of people artificially inflate the price of an asset and then sell it quickly for a profit.","ROI: Return on Investment is how much you earn from what you invested in an asset.","SATS: A Satoshi is the smallest unit of a bitcoin. There are 100 million satoshis (sats) in one bitcoin.","BTD: Buy the Dip is often used when the price of a coin falls dramatically. It is seen as an opportunity to buy at the lower price before it rises again.","DYOR: Do Your Own Research means that before investing in anything, including cryptocurrency, it's important to do your own research and not just rely on other people's advice or opinions.","FOMO: Fear of Missing Out is a common crypto refrain. Most often used in the context of worrying about missing out on an opportunity to make money, but can also be used generally for anxiety of missing out on being part of events or new projects.","FUD: Fear, Uncertainty and Doubt is used when people share negative information about cryptocurrencies online. The person sharing may be accused of spreading “FUD” or that people selling an asset are doing it out of FUD.","NGMI: Not Gonna Make It is used by the crypto community for projects that are going to fail, or if someone has made a bad decision as an investor while ignoring market data or advice, you’re “ngmi.”","WAGMI: We're All Gonna Make It is used as a rallying cry in the crypto community. It’s often used in the context of everyone sticking together and succeeding by investing in a crypto token or project."],"entity":[{"type":"Centralized Exchange","content":"ORGANIZATION"},{"type":"Doubt","content":"ORGANIZATION"},{"type":"Factor Authentication","content":"ORGANIZATION"},{"type":"Decentralized Autonomous Organization","content":"ORGANIZATION"},{"type":"Own Research","content":"ORGANIZATION"},{"type":"Decentralized Exchange","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Authority","content":"ORGANIZATION"},{"type":"Google Authenticator","content":"ORGANIZATION"},{"type":"NFT Lingo Every Collector Should Know","content":"ORGANIZATION"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Learn","Cryptocurrency","Beginner"],"authors":["Mike Antolin"]}