{"summary":"Senators Cynthia Lummis and Kirsten Gillibrand are proposing legislation to address the inadequacies in the stablecoin sector, and foster financial innovation in the United States. \"The possibilities for using stablecoins are numerous,\" they write.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/17\/the-solution-for-stablecoin-regulation\/","publishDate":"2024-04-17T09:00:00","id":14709,"type":null,"title":"The Solution for Stablecoin Regulation","category":["Consensus Magazine"],"content":["Recent advancements in financial innovation have laid bare shortcomings in current U.S. policy regarding stablecoins, which fails to strike the delicate balance of promoting financial innovation without sacrificing consumer protections or necessary regulation. As the global financial leader, the United States finds itself at a crossroads: we can either be the central player in managing a new generation of financial technology — promoting dollar dominance, protecting consumers and preventing illicit finance — or we can leave it to other countries to provide a framework for us. Leaving it up to other countries would be a grave mistake — the United States must have a seat at the table.","While some current proposals in Congress show promise, we have partnered to craft legislation that solves key policy challenges faced by previous proposals. Instead of drafting legislation in a vacuum, the Lummis-Gillibrand Payment Stablecoin Act of 2024 addresses the dual banking system as it exists today. It preserves states’ current authority over non-depository trust companies and ensures parity between federal and state bank charters, while acknowledging the Federal Reserve’s role as the guardian of monetary policy. The legislation creates a healthy balance of power by ensuring the Federal Reserve and states must act in concert with each other in supervising trust companies under $10 billion.","In drafting this legislation, we prioritized allowing innovation to prosper. Under this bill, stablecoins will create the ability to send a payment anywhere in the world instantly with a lower fee than the current options. Right now, financial transfer technology like wire transfers can take up to ten days, which is often too long if the money is being sent for an emergency. It will allow innovators to build new programs and apps that give consumers more control and flexibility. The possibilities for using stablecoins are numerous, and we are just starting to see how financial innovation will thrive once stablecoins become a common form of payment.","See also: Key Congressman McHenry Is Bullish U.S. Stablecoin Law Will Pass This Year","Part of our biggest challenge in crafting stablecoin legislation lies in assuaging public anxiety; far too many Americans are unfamiliar with stablecoins beyond splashy headlines of scandals. Where some of our colleagues shy away from the issue, we see these events as an opportunity to fortify our system from a repeat failure. Together, we have created robust custody practices for issuers that prevent the co-mingling of funds. We have also built in a detailed receivership regime under the Federal Deposit Insurance Corporation (FDIC) for all payment stablecoin issuers to ensure customers have the ability to get their money back quickly should a problem arise, instead of having to go to a bankruptcy court.","The U.S. has the opportunity to be a catalyst for positive advancement in this space without limiting financial innovation. Banning stablecoins or taking a backseat to other countries will not discourage the widespread use of stablecoins, it will merely limit our nation’s influence over innovation and consumer protection. Together we are delivering a comprehensive solution to current shortcomings in the stablecoin space, and our bipartisan legislation gives the U.S. the best chance to maintain safety, soundness and our position as the world leader in financial innovation.","Edited by Daniel Kuhn."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Federal Deposit Insurance Corporation (FDIC","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Gillibrand","content":"PERSON"},{"type":"Lummis","content":"LOCATION"},{"type":"McHenry","content":"PERSON"}],"hashtag":["Opinion","Stablecoins","stablecoin bill","Regulation","Federal Reserve","FDIC","Cynthia Lummis","Kirsten Gillibrand"],"authors":["Cynthia Lummis","Kirsten Gillibrand"]}