{"summary":"Tether’s USDT is the most popular stablecoin and is widely used by traders. It is not without controversy. Here’s what you need to know.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-tether-how-usdt-works-and-what-backs-its-value\/","publishDate":"2022-06-01T21:37:52","id":14711,"type":null,"title":"What Is Tether? How USDT Works and What Backs Its Value","category":["Learn"],"content":["Tether issues one of the most popular and widely used cryptocurrencies on the crypto market, a stablecoin called tether (USDT).","Tether the protocol is closely connected to the crypto exchange Bitfinex as it shares the same parent company, iFinex Inc., which was founded in 2012 in Hong Kong and is registered in the British Virgin Islands.","Tether’s history goes back to 2014, when it first issued a dollar-backed digital currency called realcoin on the Bitcoin network to help transfer fiat currencies on the blockchain. Later that year, realcoin was rebranded tether. (Tether refers to the issuer company, while tether, or USDT, is the token.)","Since then, Tether has expanded to numerous blockchains, launched various tokens and skyrocketed in popularity. As of the end of May 2022, all the USDT tokens outstanding were worth $73 billion, making it the third-largest cryptocurrency by market capitalization.","Tether’s cryptocurrencies belong to a special subset of digital assets called stablecoins, which means their prices are anchored, or pegged, to a less-volatile asset.","Stablecoins serve as an important link between the real world and cryptocurrencies. With their prices tied to a stable asset such as a central bank-issued (fiat) currency like the U.S. dollar, stablecoins promise to shield crypto holders from volatility and are well-suited for transactions and trades on and between blockchains.","Read more: What Is a Stablecoin?","Tether issues several fiat stablecoins and one that is pegged to gold. The most widespread among them is the U.S. dollar-pegged stablecoin USDT, with a circulating supply of about 73 billion tokens.","Other Tether-issued stablecoins are:","Tether doesn’t have its own blockchain. Instead, users can transact with USDT on and across some of the bigger blockchain platforms including:","USDT is not mined and it is not decentralized. It has a central entity, the company Tether, that issues (mints) and destroys (burns) USDT tokens to adjust the supply of coins to user demand.","Read More: What Does It Mean to Burn Crypto?","Tether claims its stablecoins' value is always 100% backed by assets in its reserve to ensure the one-to-one exchange ratio to the currency (or asset) to which their prices are anchored. Similar to how a casino has to have enough cash in its vault to cover every chip in play, the reserve serves as a guarantee that if everyone wanted to convert USDT into fiat, they could.","Tether publishes a quarterly attestation – which is not the same as an audit – breaking down its reserves by asset classes on its website, and updates total value of the assets every day.","According to its latest report, Tether’s reserve contains a diverse mix of:","The transparency and authenticity of the reserve has been called into question from time to time in the crypto world.","Tether only started to publish reports on their assets in early 2021, but still does not specify exactly what assets it holds. The attestation is not verified by an independent auditor.","The most scrutiny has been on the non-cash holdings including what they are, how they are valued and how easily Tether can convert them into cash if stablecoin holders want to redeem their initial investment at once.","In 2019, New York Attorney General’s office (NYAG) launched a probe into whether the cryptocurrency exchange Bitfinex sought to cover up the loss of $850 million in customer and corporate funds held by Tether, the payment processor.","After almost two years, Tether and Bitfinex reached a settlement with NYAG in February 2021 to pay $18.5 million in fines and to release a quarterly report describing the reserve’s composition for the next two years. (Note: CoinDesk has joined a legal proceeding involving the NYAG, Tether and its parent company iFinex as part of the effort to shed light on the reserves backing the stablecoins.)","Read more: CoinDesk Joins Court Case Seeking Access to NYAG Tether Documents","Once Tether’s USDT dominated the stablecoin market, but now there is a wide selection of stablecoins available. Some of the ways they differ depends on the issuer entity, the collateral that backs the value and how they keep their prices pegged to the fiat currency or other asset. Tether follows the IOU (I owe you) model. This means that a central entity backs the value of stablecoin with assets, and the issuer promises that you can redeem your investment anytime at a one-to-one exchange rate.","Algorithmic stablecoins such as Tron’s USDD or Waves's USDN keep the exchange rate with trading incentives and the automatic minting and burning of tokens with the help of a twin token to absorb volatility without an outside reserve asset. USDT does not operat that way because Tether, not an algorithm, decides when to burn or mint tokens according to demand.","DAI, the stablecoin of MakerDAO, is also backed by assets in a reserve but it is overcollateralized – meaning the reserve holds more assets in the reserve than DAI’s total value – and only holds cryptocurrencies such as ether and USDC. Additionally, MakerDAO does not have a central governing body – leadership is spread out among holders of the MakerDAO governance token – contrary to Tether’s centralized entity.","Both Tether’s USDT and Circle’s USDC are backed by real assets and issued by a centralized entity, but the key difference between them is in the composition of reserves. USDC only holds cash and short-term U.S. government bonds, according to its monthly report. Thus USDC is perceived as a safer and more transparent asset.","The easiest way for the average investor to buy and sell Tether’s stablecoins is through a cryptocurrency exchange. USDT is widely used by traders and is available on most crypto exchanges.","Stablecoins are digital currencies, so you can hold your USDT on any type of crypto wallet, hot or cold.","Large crypto holders such as institutional investors and crypto exchanges can access USDT and other Tether-issued stablecoins directly from Tether. They can buy stablecoins by depositing cash and may redeem their investments by returning the virtual coins at the 1:1 exchange rate Tether promises.","Average investors may see USDT's price on crypto exchanges change every so often. For example, when one of the most notable stablecoins, Terra’s UST, collapsed in May 2022, other stablecoin prices wobbled on exchanges and USDT fell to as low as 97 cents for a brief period as people panicked and pulled their money out. More recently the price is up to a shade under $1."],"entity":[{"type":"2014","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"iFinex Inc.","content":"ORGANIZATION"},{"type":"2012","content":"DATE"},{"type":"$18.5 million","content":"MONEY"},{"type":"$1","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"CoinDesk Joins Court Case Seeking Access","content":"ORGANIZATION"},{"type":"97 cents","content":"MONEY"},{"type":"100%","content":"PERCENT"},{"type":"February 2021","content":"DATE"},{"type":"Terra’s UST","content":"ORGANIZATION"},{"type":"British Virgin Islands","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"USDT","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"May 2022","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$73 billion","content":"MONEY"},{"type":"$850 million","content":"MONEY"},{"type":"USDC","content":"ORGANIZATION"},{"type":"NYAG Tether Documents","content":"ORGANIZATION"}],"hashtag":["Learn","Beginner","Cryptocurrency","Tether"],"authors":["Krisztian Sandor"]}