{"summary":"The trading platform also said it was speaking with depositors looking to help the business by “rolling some of their deposits into equity.”","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/07\/11\/coinflex-begins-arbitration-against-84m-delinquent-customer-flex-holders-in-focus\/","publishDate":"2022-07-11T12:13:39","id":14715,"type":null,"title":"CoinFLEX Begins Arbitration to Recover $84M in Delinquent Debt","category":["Finance"],"content":["Crypto trading platform CoinFLEX has begun arbitration for the recovery of over $84 million in debt owed by a “large individual customer” as part of a broader revival strategy.","“We have commenced arbitration in HKIAC (Hong Kong International Arbitration Centre) for the recovery of this $84 million as the individual had a legal obligation under the agreement to pay and has refused to do so,” CoinFLEX said in a post on Saturday. “His liability to pay is a personal liability, which means the individual is personally liable to pay the total amount, so our lawyers are very confident that we can enforce the award against him.”","CoinFLEX suspended withdrawals last month after a certain individual’s account went into negative equity during June’s market volatility, affecting its balances. The individual was revealed by CoinFLEX CEO Mark Lamb to be prominent crypto investor Roger Ver, a claim that Ver denied on social media.","In Saturday’s post, CoinFLEX said it holds more than 26 million FLEX tokens – valued at over $7 million at current rates – in its inventory. It added that resuming trades would cause market volatility in FLEX's price, which would inadvertently affect the collateral positions of platform users.","The company also said that it is looking to raise a significant amount of funds from investors, including by using customer deposits in exchange for equity.","“There are a number of investors in this group of large depositors who have indicated that they may be in a position to help the business move forward if we can all find a workable solution,” the firm said.","Recovering the delinquent debt, however, could help buffer FLEX prices and prevent a steep drop, CoinFLEX said. “We believe the recovery of the debt will help build confidence in and will help shore up the trading price of FLEX Coin,” it said.","FLEX fell from $4.20 to $1.60 in late June as CoinFLEX went public with its losses, CoinGecko data shows. The lack of a swift recovery plan has added to the losses, with the tokens now down 94% in the past 30 days.","Meanwhile, CoinFLEX said that it hopes to make 10% of customers’ balances available for withdrawal in the next week, adding that the arbitration process could “take up to 12 months.”"],"entity":[{"type":"June","content":"DATE"},{"type":"International Arbitration Centre","content":"ORGANIZATION"},{"type":"$7 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$1.60","content":"MONEY"},{"type":"$4.20","content":"MONEY"},{"type":"$84 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"94%","content":"PERCENT"},{"type":"Roger Ver","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"Mark Lamb","content":"PERSON"}],"hashtag":["CoinFLEX","Business","Debt"],"authors":["Shaurya Malwa"]}