{"summary":"CLabs officially proposed using Optimism’s OP Stack for the transition. The proposal will be discussed on a couple of community calls and then go to a vote among holders of the project's CELO tokens, under the chain's governance rules.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/22\/celo-chooses-optimism-concluding-bake-off-among-layer-2s\/","publishDate":"2024-04-22T13:00:00","id":14717,"type":null,"title":"Celo Chooses Optimism, Concluding Bake-Off Among Layer 2s","category":["Technology"],"content":["The primary developer behind the Celo blockchain has been on the hunt since last year for the technology for its planned layer-2 network atop Ethereum – and the selection process had turned into a surprisingly competitive bake-off between leading providers.","On Monday, the team officially proposed using Optimism’s OP Stack for the transition. The proposal will be discussed on a couple of community calls and then go to a vote among holders of the project's CELO tokens, under the chain's governance rules.","CLabs, Celo’s developer, has spent the past couple months evaluating technical proposals from various layer-2 teams on why they may be the best fit for their new blockchain. The big idea is that the Celo team sees a more prosperous future as a part of the broader Ethereum blockchain ecosystem, as a layer-2 chain, than in its current form as a standalone, or layer-1, chain.","When Celo originally announced it would migrate to a layer 2, cLabs had originally suggested choosing the OP Stack. That's where the team ended back at, eight months after its initial announcement, following extensive consideration of all of the competing layer-2 tech providers.","“We know a lot more than we knew back eight months ago when we first started really zooming in on this,” Rene Reinsberg, co-founder of Celo and president of Celo Foundation, said in an interview with CoinDesk. “I'm very happy we didn't just make a decision last year, but did all this due diligence.”","During the selection process, cLabs was considering whether to deploy on OP Stack, Arbitrum Orbit, zkSync’s ZK Stack or Polygon CDK.","In a blog post sent to CoinDesk, Celo mentions that ultimately OP Stack fit their needs, and that it could be compatible with components from other layer-2 teams, specifically including Polygon’s Type 1 prover.","“Even some of the stuff we learned on the other stacks, I think it's going to be helpful as the entire architecture kind of gets built and deployed over time,” Reinsberg told CoinDesk.","The OP Stack has become quite popular over the last few months among blockchain projects, with Coinbase tapping the technology last August to build out its own layer-2 chain, Base. Just last week, Worldcoin announced plans for a layer 2, World Chain, also built with OP Stack.","“It's super cool to actually see them [Celo] be keen on OP Stack, do deep due diligence and look at all these chains,” said Ryan Wyatt, chief growth officer at the Optimism Foundation, in an interview with CoinDesk. “I mean, there's a lot of opportunities around this build-a-blockchain out of the box. So I love that they did it and then ultimately concluded that we're going with OP Stack.”","Read more: Celo, Shopping for Blockchain Partner, Turns to the Delicate Issue of Money"],"entity":[{"type":"Blockchain Partner","content":"ORGANIZATION"},{"type":"last August","content":"DATE"},{"type":"Base","content":"LOCATION"},{"type":"Ryan Wyatt","content":"PERSON"},{"type":"Celo","content":"PERSON"},{"type":"Arbitrum Orbit","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Celo Foundation","content":"ORGANIZATION"},{"type":"Worldcoin","content":"PERSON"},{"type":"Polygon CDK","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Rene Reinsberg","content":"PERSON"},{"type":"Delicate Issue of Money","content":"ORGANIZATION"},{"type":"eight months ago","content":"DATE"},{"type":"1","content":"DATE"},{"type":"Optimism Foundation","content":"ORGANIZATION"},{"type":"OP Stack","content":"ORGANIZATION"}],"hashtag":["Optimism","Optimism foundation","Celo","celo-foundation","layer 2"],"authors":["Margaux Nijkerk"]}