{"summary":"Crypto prices have decoupled from prices for luxury watches, ending a prolonged positive correlation caused by unprecedented monetary stimulus.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/01\/30\/bitcoin-etf-has-broken-btcs-pandemic-era-price-correlation-with-luxury-watches\/","publishDate":"2024-01-30T05:53:15","id":14719,"type":null,"title":"Bitcoin ETF Has Broken BTC's Pandemic-Era Price Correlation With Luxury Watches","category":["Markets"],"content":["If there is one thing common between bitcoin (BTC) and luxury goods, it is scarcity. And prices for bitcoin and luxury watches were positive correlated before the spot ETF optimism gripped the crypto market in the second half of 2023.","Much has been written about the relationship between luxury watches and crypto. Prices for both rose during the Covid years as central banks and governments dumped record amount of easy, cheap money into the economy, and crypto traders needed something to buy with their riches.","According to data from WatchCharts.com, the absolute pricing peak came at the end of the bull market of 2021, and the start of the 2022 crypto recession. Many traders, as expected, were cashing out at the peak and moving on to other assets.","For most of 2023, prices for luxury watches and the CoinDesk 20, an index of the largest digital assets, moved in parallel. But then the two diverged in the third and fourth quarter of 2023 as excitement around a bitcoin exchange-traded fund (ETF) began to work its way through the crypto market, pushing CoinDesk 20 higher. The U.S. SEC green lighted 11 spot bitcoin ETFs early this month.","Greta Yuan, Head of Research at VDX, a Hong Kong digital assets platform, points to the institutional interest that bitcoin has, thanks to the ETF, – and watches lack – as another reason for the pricing bump.","\"Bitcoin is essentially known as digital gold so It’s no surprise that it has held up value better than luxury watches over the past year,\" she said in an email interview with CoinDesk. \"The market has recently bounced back to above 42K, showing strong demand from investors to buy the dip.\"","Meanwhile, global monetary tightening continued to weigh over prices for luxury watches.","\"The decline in prices is partly due to tightening monetary policy and a reduction in speculative trading in luxury assets,\" wrote Morgan Stanley analysts in a January report about luxury watch prices.","\"While prices were relatively stable in 4Q23 and December 2023 (likely influenced by holiday shopping trends), overall market health indicators such as the age of inventory and total supply remain historically elevated,\" said Watch Charts founder Charles Tian in a note to CoinDesk.","Although crypto naysayers will point at every decline of bitcoin's prices as an attestation of its lack of utility, ContentFi Labs' COO Nick Ruck questions the utility of watches.","\"Investors have finally caught on to the empty promises of watch utilities,\" he said in a note. \"Their unique selling point to inform wearers of the time has long been replaced by modern technology such as the smartphone.\"","There might be a point there. Not one watch on Watch Charts Luxury Index can measure your blood pressure or sleep cycles like a smartwatch can.","CORRECTION (March 26, 2024, 14:30 UTC): The description of VDX is adjusted to reflect that it is not a licensed exchange as initially represented.","Edited by Omkar Godbole.","\n","\n"],"entity":[{"type":"U.S. SEC","content":"ORGANIZATION"},{"type":"Greta Yuan","content":"PERSON"},{"type":"Charles Tian","content":"PERSON"},{"type":"Watch Charts Luxury Index","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Omkar Godbole","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"March 26, 2024","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Watch Charts","content":"ORGANIZATION"},{"type":"Nick Ruck","content":"PERSON"},{"type":"fourth quarter of 2023","content":"DATE"},{"type":"Head of Research","content":"ORGANIZATION"},{"type":"December 2023","content":"DATE"},{"type":"Morgan Stanley","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"second half of 2023","content":"DATE"}],"hashtag":["Watches","btc","ETF","Bitcoin ETF"],"authors":["Sam Reynolds"]}