{"summary":"U.S. regulatory crackdown is hampering their development","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/coindesk-indices\/2023\/08\/30\/why-good-indexes-are-vital-to-cryptos-future\/","publishDate":"2023-08-30T15:45:00","id":14739,"type":null,"title":"Why Good Indexes Are Vital to Crypto’s Future","category":["CoinDesk Indices"],"content":["Indexes are pivotal in asset markets as the cornerstone of financial market growth and an essential tool for investors. In crypto, however, the nascent state of index availability and adoption is a significant impediment for investors. Currently, the equivalent advice to “buy the index” is to purchase bitcoin (BTC) or Ethereum’s ether (ETH) in a centralized account, which is insufficient to attract new capital from sophisticated investors. Indexes allow for efficient asset allocation, risk management, product development and performance measurement. Without indexes, crypto cannot evolve into an institutional financial market.","Many of the required components for a successful index exist today: compliant institutional exchanges, robust data and sophisticated methodologists, among others. However, what is missing in the U.S. is regulatory support and index adoption that captures the more nuanced and differentiating aspects of crypto markets, such as proof-of-stake reward rates. Despite the absence of regulatory guidance, the industry must continue to push forward with the development of indexes.","You’re reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","We summarize the impact of index adoption in the following six sections:","Price discovery and credibility: Indexes facilitate price discovery by aggregating data from multiple sources and calculating a representative value. Investors struggle to determine fair values without reliable indexes, hindering market participation. Professionally managed indexes instill credibility, bolstering confidence in retail and institutional investors.","Benchmarking and investment products: Indexes provide benchmarks against which asset performance can be measured. Investors struggle to reliably compare different investment products or managers without established indexes. This lack of benchmarking impedes the creation of investment vehicles like derivatives (a key component to sophisticated portfolio management) and cryptocurrency ETFs (which could attract significant retail and institutional capital).","Risk management and transparency: Indexes help investors assess the risk and volatility associated with an asset. The absence of reliable risk metrics hampers investors' ability to manage their exposure and transfer risk effectively. Even more than their predecessors, Web3 indexes are fully transparent as all data is viewable on-chain. Fully transparent indexes enhance risk assessment by improving asset allocation models and contributing to market stability and a more informed investment process.","Market research and analysis: Indexes offer valuable data for academics and analysts to study market trends, correlations and behaviors. This research informs strategies and contributes to a deeper understanding of the asset class, ultimately aiding its development.","Standardization and language: Indexes promote standardization in measuring and evaluating market performance. A lack of established indexes in the crypto market hinders the creation of a common language and universal standard among market participants. Without indexes to establish reference rates, markets cannot reach the depth needed to attract significant capital.","Institutional participation: Professionally managed indexes attract institutional participation by providing a reliable foundation for investment decisions. Institutional involvement enhances market liquidity and stability, accelerating overall asset class growth.","Indexing is vital for the advancement of new asset classes like crypto. While currently hampered by the regulatory environment in the U.S., efficient and professionally managed indexes would improve the safety and stability of markets. As the cryptocurrency industry continues to evolve, the development and adoption of reputable indexes is instrumental in attracting institutional investors, increasing liquidity and advancing the overall maturity of the asset class.","Edited by Nick Baker."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Opinion","Crypto Long & Short","Index Funds","Indexes","Indices","Institutional Adoption","Institutional Investment"],"authors":["Jason Hall","John McNiff"]}