{"summary":"The company concealed the misuse of corporate funds, including buying property in the Bahamas for staff, John Ray said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/11\/17\/new-ftx-boss-condemns-management-of-the-crypto-exchange-during-sam-bankman-frieds-tenure\/","publishDate":"2022-11-17T13:04:15","id":14733,"type":null,"title":"New FTX Boss Condemns Management of the Crypto Exchange During Sam Bankman-Fried's Tenure","category":["Finance"],"content":["New FTX CEO John J. Ray III issued a scathing assessment of \"unprecedented\" poor management practices by his predecessor, Sam Bankman-Fried, in a series of filings in a Delaware court.","Ray, who has previously supervised financial scandals such as Enron, criticized poor record-keeping and a lack of experience among senior managers, as well as the use of company funds to purchase real estate in the Bahamas.","\"Never in my career have I seen such a complete failure of corporate controls and such a complete absence of trustworthy financial information as occurred here,\" Ray said in a court document filed on Thursday. \"From compromised systems integrity and faulty regulatory oversight abroad, to the concentration of control in the hands of a very small group of inexperienced, unsophisticated and potentially compromised individuals, this situation is unprecedented.\"","Ray is attempting to unravel a complex mess of dozens of companies which seem to have had scant regard for corporate norms.","FTX “did not keep appropriate books and records or security controls” for its digital assets, used unsecured shared email accounts to access private keys, and to this day cannot provide a list of those working for the company as at Nov. 11, he said.","Ray also criticized the use of software to conceal the “misuse of corporate funds,” a failure to reconcile blockchain positions daily, and the absence of independent governance between Alameda and the cluster of companies that includes FTX.com — an issue, first revealed by CoinDesk, which caused cracks in the company to deepen ahead of its collapse.","In the Bahamas, FTX Group corporate funds were “used to purchase homes and other personal items for employees and advisors,” and assets were assigned to staff personally with no record of them having to repay any loan, he said.","Those attempting to salvage something from the wreckage of the complex network of scores of companies are now caught up in a complex jurisdictional tussle.","Liquidators from the Bahamas have argued that the company was operated from there, in practice, and that the U.S. side of the affairs should be handled as a subsidiary issue in a New York court under Chapter 15, another section of the U.S. bankruptcy code which deals with cross-border failures.","“Having two bankruptcy courts consider related issues simply makes no sense,” said a separate filing on behalf of what remains of FTX Trading, the Antiguan company which filed for bankruptcy in the U.S. “It would result in potentially inconsistent opinions, duplication of efforts, and unnecessary expense.”","“In terms of the celebrity of Mr. Bankman-Fried, his unconventional leadership style, his incessant and disruptive tweeting since the Petition Date, and the almost complete lack of dependable corporate records, these Chapter 11 Cases are unprecedented.”","UPDATE (Nov. 17, 13:43 UTC): adds more details throughout article.","\n","\n"],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"Nov. 17","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Ray","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bahamas","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"FTX Group","content":"ORGANIZATION"},{"type":"Nov. 11","content":"DATE"}],"hashtag":["Regulations","FTX","Bankruptcy","FTX Collapse"],"authors":["Jack Schickler"]}