{"summary":"Bitcoin miners have been running down inventory in a rising market, moving away from the accumulation strategy seen before the prior halving in May 2020.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/10\/crypto-miners-run-down-bitcoin-inventory-to-3-year-low-in-a-strategic-pre-halving-move\/","publishDate":"2024-04-10T11:39:10","id":14730,"type":null,"title":"Crypto Miners Run Down Bitcoin Inventory to 3-Year Low in a Strategic Pre-Halving Move","category":["Markets"],"content":["Bitcoin miners are depleting their coin stashes, possibly to ensure the sustainability of operations in the face of the impending halving of per-block rewards from April 20.","The number of bitcoin held by miners, which receive the coins in return for validating transactions in the blockchain block, declined to 1.794 million BTC this week, the lowest since early 2021, according to data source CoinMetrics.","The so-called miner balance has fallen by 27,000 since November, implying steady selling in the months leading up to the quadrennial mining reward halving. The pivotal event is set to reduce the per-block BTC emission to 3.125 BTC from 6.25 BTC.","The drawdown in balance contrasts the steady accumulation of about 25,000 BTC in the five months leading up to the previous halving, which occurred on May 11, 2020.","The change in strategy stems from bitcoin's recent rally to record highs above $73,000. The cryptocurrency has surged 63% this year, surpassing the previous cycle peak of around $69,000 well before the halving. Historically, new highs have come months after the halving.","The rally has allowed miners to take profits at higher prices and fund equipment upgrades to prepare for the reduced rewards rate, according to algorithmic trading firm Wintermute.","\"With miners' holdings still near an all-time high in USD terms ($124 billion), this sell-off appears to be a strategic move for profit-taking and operational upgrades, marking a behavioral change from the last cycle,\" Wintermute said in a weekly newsletter.","The upgrades are evident from the rise in the hashrate, or the total computational power dedicated to mining and processing transactions, on the Bitcoin blockchain.","The hashrate has increased by 45% to over 600 exahashes per second over five months, registering a more significant growth than the 15% increase seen ahead of the previous halving.","\"The consistent rise in hashrate suggests that some of the miners are either adding or upgrading their equipment to mitigate the impact of the upcoming halving on revenues,\" Wintermute noted. \"This early investment reflects a positive future outlook and a strategic shift toward long-term operational resilience.\"","11:49 UTC: Corrects second para to say the balance has dropped to lowest since early 2021.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Wintermute","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"$73,000","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"45%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"May 11, 2020","content":"DATE"},{"type":"$69,000","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"$124 billion","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"63%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"15%","content":"PERCENT"}],"hashtag":["Bitcoin","Miners","Blockchain"],"authors":["Omkar Godbole"]}