{"summary":"Bitcoin traded at a fat premium on Bitfinex compared to the global average price over the weekend, hinting at bargain hunting by whales.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/01\/24\/crypto-whales-hunt-for-bargains-as-bitcoin-prices-slide-data-shows\/","publishDate":"2024-01-24T07:08:39","id":14748,"type":null,"title":"Crypto Whales Hunt for Bargains As Bitcoin Prices Slide, Data Shows","category":["Markets"],"content":["Crypto whales, entities with ample token holdings, appear to be snapping up bitcoin [BTC] at cheaper prices as the leading cryptocurrency continues to slide in the aftermath of the recent U.S. spot ETFs debut.","bitcoin has dropped nearly 19% to $39,770 since the spot ETFs began trading in the U.S. on Jan. 11, CoinDesk data show.","That has some crypto whales bargain-hunting bitcoin on digital assets exchange Bitfinex, one of the top 10 exchanges by trading volumes. Bitfinex whales are notorious for making waves in the market.","Data from TradingView shows that over the weekend, bitcoin traded at a premium of $100 on Bitfinex compared to the global average price. At the time of writing, the premium was near $70, notably higher than other exchanges, including Coinbase and Binance.","“Someone on Bitfinex has been nonstop TWAP buying $BTC for 3 days straight now, which is why Bitfinex has been trading at a fat premium. About $50m spot accumulated so far is my estimate,” pseudonymous market analyst and trader Byzantine General said on X Sunday.","TWAP, or trade-weighted average price, is an algorithmic strategy used for splitting up large orders over time, helping traders minimize slippage when buying or selling large orders. Slippage is the gap between the price at which a trading order is executed and the price at which it was requested.","The so-called TWAP buying continued Tuesday, as sales from the FTX bankruptcy estate and outflows from Grayscale Bitcoin Trust (GBTC) pushed prices below $39,000 for the first time since early December.","The dip demand is also evident from the renewed interest in bullish leveraged bets on Bifinex.","The chart shows the number of open BTC\/USD longs, or bullish leveraged bets, has increased nearly 8% to over 73,000 contracts in one week.","Edited by Parikshit Mishra."],"entity":[{"type":"Sunday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"8%","content":"PERCENT"},{"type":"TradingView","content":"ORGANIZATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"weekend","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$39,770","content":"MONEY"},{"type":"$39,000","content":"MONEY"},{"type":"Jan. 11","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"19%","content":"PERCENT"},{"type":"Tuesday","content":"DATE"},{"type":"$100","content":"MONEY"},{"type":"$BTC","content":"MONEY"},{"type":"$50m","content":"MONEY"},{"type":"$70","content":"MONEY"},{"type":"Byzantine General","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Markets","Bitfinex","CryptoCurious"],"authors":["Omkar Godbole"]}