{"summary":"Miners face uncertain times as the halving changes Bitcoin’s economics. Which groups are best positioned for the future? Dan Weiskopf, at Tidal Financial Group, gives a run-down.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/17\/bitcoin-miners-are-set-for-a-coiled-spring-rally\/","publishDate":"2024-04-17T16:00:00","id":14756,"type":null,"title":"Bitcoin Miners Are Set for a Coiled Spring Rally","category":["Markets"],"content":["Since around 2017, our team has been researching the infrastructure opportunities available to investors in the public markets. I am pleased to see close-to-record highs in daily revenues as we approach the fourth halving, predicted around April 19. Pleased because it reflects the business success of an industry that presently is running close to a $26.1 billion run rate (365 times daily revenues of $71.6 million). As one of the most substantial investors in the space, with almost $100 million allocated in our portfolio, the outcome of how this business is financed and valued is important to us.","Despite the optimism expressed by investors, we can understand why miners and investors are facing the halving with trepidation. We would also like to point out that 1st quarter profitable financials results expected by some of the miners seem more than discounted at current levels. Many mining stocks could be looking at forward-EV\/EBITDA multiples in the very low single digits versus 2024 and 2025.","Of course, any single digit multiple assumed on valuation metrics must assume a Bitcoin price of between $70,000 to $100,000 which we would argue is reasonable given the current momentum in the price of Bitcoin. Conversely, given that these are technology companies, we would have to admit that execution risk at scale has proven a high hurdle to achieve.","You're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","How we view the industry:","Bucket 1: Accelerators: CLSK, MARA and RIOT","A few companies like Cleanspark, Marathon Digital and RIOT Platforms have positioned themselves as large scale miners aggressively raising capital through At-The Market Offerings (ATMs). These companies are expected to show accelerating growth in revenues due from higher Bitcoin price and significant beta from exahash expansion.","As such, they have drawn a competitive advantage from an increase in trading activity, ample financial liquidity and or a war chest to capitalize on acquisition opportunities. People who are disappointed by the recent failure of the mining stocks to keep up with the price of bitcoin are missing the fact that this correlation is sustainable but frequently behaves like a coiled spring> The question is timing and the near term direction of bitcoin at $60K or $100K. All bets are off at $500K.","Bucket #2: HPC-AI Group (IREN, CORE, BTBT, HIVE, HUT)","Pragmatic oriented companies such as Core Scientific (CORZ), Iris Energy (IREN), Bit Digital (BTBT) or Hut8 (HUT) are led by managers who are executing under the pretext that traditional financial metrics matter in the context of measuring discipline. To be clear, these are definitely growth companies.","The issue is that their Bitcoin mining segment may not be their sole source of growth. HPC-AI is a compelling business model and in demand. AI computing, of course, is in high demand these days. AI compute centers are more predictable as a business than self-mining. But of course it also has less optionality than that $500,000 bitcoin price.","Bucket #3: Distressed\/Value Plays","For the record, you don’t want to be in this category since this presumes a company is boxed into raising capital and in a potentially distressed situation as a small-cap publicly traded company. We would rather not tag any company as a distressed situation, but note that there are some 15-20 companies that are micro-cap in size. Distressed, of course, does not mean that some of these companies won’t survive or even grow through acquisitions or consolidation to come out on top.","Edited by Benjamin Schiller."],"entity":[{"type":"RIOT Platforms","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"$100K","content":"MONEY"},{"type":"$500K","content":"MONEY"},{"type":"20","content":"DATE"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"$71.6 million","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"spring","content":"DATE"},{"type":"Iris Energy","content":"ORGANIZATION"},{"type":"2025","content":"DATE"},{"type":"Cleanspark","content":"PERSON"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"$26.1 billion","content":"MONEY"},{"type":"EBITDA","content":"ORGANIZATION"},{"type":"1st quarter","content":"DATE"},{"type":"$500,000","content":"MONEY"},{"type":"April 19","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"$70,000","content":"MONEY"},{"type":"AI Group","content":"ORGANIZATION"},{"type":"$60K","content":"MONEY"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Distressed\/Value Plays","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto Long & Short","Miners","crypto investing"],"authors":["Daniel Weiskopf"]}