{"summary":"It may be a bear market, but there are still plenty of jobs to be had at crypto companies. This article is part of CoinDesk's Future of Work Week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/27\/the-crypto-jobs-boom\/","publishDate":"2022-06-27T12:38:40","id":14752,"type":null,"title":"The Crypto Jobs Boom","category":["Consensus Magazine (layer2)"],"content":["Cryptocurrency prices are crashing. The markets are bleeding. Firms are laying off workers. Crypto exchange Coinbase even rescinded accepted job offers, blindsiding would-be employees. But the crypto job market is … still going strong?","Kind of.","Even three weeks ago, before the price of bitcoin tumbled below $30,000, Michael Shlayen, founder of BlockchainHeadhunter, said that “overall, there is a slowdown.” He found that “some companies are putting a freeze on hiring.” Then bitcoin crashed below $20,000. On June 23, Shlayen updated his assessment, saying that “hiring slowed down even further and the job market has continued to cool off.”","This interview is part of CoinDesk's Future of Work Week.","But that doesn’t mean it’s all doom and gloom. Even after the price crash, Shlayen said that “there are still some companies with healthy treasuries and lengthy runways who are continuing to hire ambitiously.”","Other crypto recruiters and headhunters are seeing the same thing – or are even more optimistic. Three weeks ago, Daniel Adler, founder of Cryptocurrency Jobs, acknowledged that he was seeing a bit of a slowdown, but even after bitcoin plunged below $18,000, he updated his take to say that not much has changed, noting that “if anything, it seems things are stabilizing.”","“Teams have had time to adjust to market conditions and the macro environment, and so are able to make more informed decisions,” he said June 21. He predicted that the Cryptocurrency Jobs will have more listings at the end of the month than it did at the beginning. (Are you reading this, Polymarket users?)","Emily Landon, another crypto recruiter, said she found that “a lot of our projects have put things on hold until they can see what’s going on in the bear market.” But even after the slump in prices, Landon said that “we are getting great new business,” meaning new clients and new job openings.","Adler said that while he’s seeing a slowdown, that could also be the result of macro forces outside the blockchain industry.","Read More: What You Need to Know and Do to Get a Job in Crypto","“Crypto is not immune from what’s happening in the world,” Adler said, citing the war in Ukraine, rising inflation and concerns about a global recession. “That’s affecting crypto as well.” He said that some companies have instituted hiring freezes. Plenty are “still building, and it’s business as usual.”","What counts as “business as usual?” To put the recent cooldown in perspective, it helps to look more broadly at the last 18 months of the crypto job market.","“The last year and a half has been completely crazy,” said Shlayen, who said he placed more candidates in the past 18 months than in the prior four years combined. For much of that time, he witnessed “a shift of professionals moving into the crypto space.”","Just a few of the high-profile jumps from the “old world” into crypto: Sherice Torres, the former chief marketing officer of Meta Platforms, Facebook’s parent company, is now the CMO of payments company Circle. Brian Roberts hopped from Lyft, where he was the chief financial officer, to NFT (non-fungible token) marketplace OpenSea, where he holds the same position. Andreessen Horowitz, a venture capital fund heavily investing in crypto, scooped up a glittering roster of all-star talent, including Bill Hinman (former director at the U.S. Securities and Exchange Commission), Brent McIntosh (former Under Secretary of the Treasury for International Affairs) and Tomicah Tillemann (a policy wonk who used to be an adviser to President Biden) – not exactly crypto bros.","Read More: How to Get a Job in Crypto","While it’s tough to quantify the precise size of the shift, a study from LinkedIn found that “crypto-related job postings skyrocketed last year” and “grew 395% in the U.S. from 2020 to 2021, outpacing the wider tech industry, which saw a 98% increase.”","Lawyers became crypto lawyers. Marketers became crypto marketers. And, um, writers have become crypto writers.","“It’s hiring across all roles, and it’s not just engineering.” Adler said, adding that it was the “strongest market I’ve ever seen.” He said that because so many crypto companies are well-funded and looking to expand, they had roles for “marketing, operations, legal, finance, treasury, content – you name it.”","So why are droves of workers making the jump to crypto? The first reason is obvious. Jenna Pilgrim, principal at Mayflower Strategic, another crypto headhunting firm, said that starting salaries are “pretty comparable” to jobs at Silicon Valley and “much higher” than jobs in financial services, with executives getting paid in the range of $250,000 to $400,000.","And that’s just the base salary. Crypto jobs often come with a trove of tokens, said Shlayen, and those can be lucrative. “If the project succeeds, [total compensation] can be much higher than the actual salary. I’ve seen some crazy packages.” For example, Shlayen said that some of the jobs he has booked for clients – and not even at the executive level – have included $10,000 worth of tokens, and then those tokens “100Xed.” So that twentysomething engineer became a millionaire. At least, until a few weeks ago.","But money is only part of the lure.","“When you look at the space, crypto is more optimistic and mission-driven,” Adler said. He has found that crypto job-seekers truly care about the community and the memes and the GMs and the WAGMIs.","Whether these good vibes survive the price meltdown, of course, remains an open question, although Landon said that as recently as June 22, some companies are “still growing and building.” Others are drawn to the transparency of Web3, with a wealth of data auditable by anyone on public ledgers.","By contrast, when you work at traditional Web2 companies, it can be frustrating to be kept in the dark on the actual metrics of a site’s performance. Are we really hitting our goals? Is senior leadership telling us the truth? “But in a Web3 space,” Adler said. “You can look at a dashboard to see how many users are using the protocol.”","Then there’s the fact that crypto jobs – even if the money is the same – just strike many as more interesting than traditional roles.","“You can’t disregard the intellectual curiosity,” Adler said. Many of the job seekers, he said, are genuinely drawn to the sector’s wide-ranging mix of economics, psychology, law, geopolitics, philosophy and the overall question of “how do you build systems that actually work?” In other words, they are drawn to the same things that get people to read (or write) about crypto.","For the bulk of this hiring frenzy, it has not just been the twentysomething crypto bros who are riveted by these questions.","“It’s a mix of all ages,” Landon said. At the job market’s peak, she was gaining 1,000 new LinkedIn followers each week and 50 new connection requests per day. A 72-year-old woman reached out to Landon for a crypto admin position, telling her that, “My son says it’s the future, and I believe him.”","At the other end of the spectrum, Landon works with 16-year-olds still in high school, and said that ‘they’re accepting job offers instead of going to college.”","And in many cases, no crypto experience is required. “A growing number of professionals are coming from other industries and looking to get into the Web3 world,” Shlayen said.","Adler’s inbox is often packed with direct messages from candidates with traditional jobs who are “crypto curious” and now want to work on it full time. He said this ranges from the chief of staff at a large bank to medical practitioners to blue-collar construction workers, and that is a point “I want to hammer home – it’s everyone,” he said.","Read More: Coinbase Lays Off Around 1,100 Employees","As for the recent crash in prices, and the looming fears of a crypto winter? Adler has been connecting crypto candidates with crypto companies since 2017, and he said that even now – after the Celsius Network meltdown, with the drop in prices – it doesn’t feel like the crypto winter of 2018 and 2019.","Adler said that from what he sees from a qualitative perspective, “Teams are building, talent still wants to make the transition into crypto, and there's plenty of funding,” he said.","Maybe the industry has matured. Maybe there’s just more funding. Maybe company and project treasuries have wisely diversified their assets into fiat, cushioning the crash and giving them more runway.","Maybe. Or maybe we’ll all soon be flipping burgers at McDonald’s.","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","Crypto can make it faster and cheaper to pay workers. This article is part of the Future of Work series.","By adopting a more open, fluid model, traditional firms would find it easier to attract talent and end up with a more passionate, engaged workforce."],"entity":[{"type":"Tomicah Tillemann","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"CMO","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission)","content":"ORGANIZATION"},{"type":"$400,000","content":"MONEY"},{"type":"Meta Platforms","content":"ORGANIZATION"},{"type":"Lyft","content":"LOCATION"},{"type":"Daniel Adler","content":"PERSON"},{"type":"98%","content":"PERCENT"},{"type":"$20,000","content":"MONEY"},{"type":"Brian Roberts","content":"PERSON"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Shlayen","content":"PERSON"},{"type":"Adler","content":"PERSON"},{"type":"Bill Hinman","content":"PERSON"},{"type":"June 22","content":"DATE"},{"type":"June 21","content":"DATE"},{"type":"Crypto","content":"LOCATION"},{"type":"June 23","content":"DATE"},{"type":"Michael Shlayen","content":"PERSON"},{"type":"Landon","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"Emily Landon","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"$30,000","content":"MONEY"},{"type":"Sherice Torres","content":"PERSON"},{"type":"end of the month","content":"DATE"},{"type":"Jenna Pilgrim","content":"PERSON"},{"type":"Brent McIntosh","content":"PERSON"},{"type":"395%","content":"PERCENT"},{"type":"$10,000","content":"MONEY"},{"type":"last year","content":"DATE"},{"type":"Treasury for International Affairs)","content":"ORGANIZATION"},{"type":"Mayflower Strategic","content":"ORGANIZATION"},{"type":"last 18 months","content":"DATE"},{"type":"winter of 2018","content":"DATE"},{"type":"$18,000","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"Biden","content":"PERSON"},{"type":"McDonald’s","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Jobs","Future of Work Week"],"authors":["Jeff Wilser"]}