{"summary":"As Congress mulls stablecoin legislation, Circle is laying out its wishlist. \nDante Disparte, the stablecoin issuer’s CSO, put out a set of 19 principles for coming policy. ","author":["Kollen Post","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/158264\/usdc-issuer-circle-lays-out-its-hopes-for-coming-stablecoin-policy","publishDate":"2022-07-18T16:30:54","id":1475,"type":null,"title":"USDC issuer Circle lays out its hopes for coming stablecoin policy","category":["Policy"],"content":["Dante Disparte, the leader of Circle's government work, on July 18 <a href=\"https:\/\/www.circle.com\/blog\/payment-stablecoin-policy-principles\" data-v-f87c67ca=\"\">published<\/a> a set of 19 principles for stablecoin regulation, as part of the company's efforts to shape US stablecoin policy.","The principles are fairly familiar to those following the debate over stablecoin issuance, particularly the requests that the industry has been making: privacy, continued issuance by non-banks, and co-existence alongside a potential central bank digital currency.&nbsp; Circle issues USDC, which has a <a href=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\" data-v-f87c67ca=\"\">total supply<\/a> of $45 billion, making it the second-largest stablecoin after Tether.&nbsp;","Regarding the non-bank issuance — a sticking point in policy discussions — Disparte wrote:&nbsp;","Disparte&nbsp;<a href=\"https:\/\/www.theblock.co\/post\/127515\/senate-hearing-on-stablecoins-forecasts-new-regulations-but-from-where\" data-v-f87c67ca=\"\">testified before the Senate<\/a> on the subject of stablecoins in December. At the time, he&nbsp; already was advocating for a similar multi-pronged approach to stablecoin regulation, which the industry has largely asked for. In contrast, the Treasury has pushed to limit issuance to \"insured depository institutions,\" which are generally banks. Circle CEO Jeremy Allaire <a href=\"https:\/\/www.theblock.co\/post\/126866\/what-we-learned-at-congress-much-anticipated-summit-of-crypto-execs\" data-v-f87c67ca=\"\">also has been a familiar figure<\/a> in Congressional hearings on crypto.","Circle recently joined Paxos as stablecoin issuers that <a href=\"https:\/\/www.theblock.co\/post\/157709\/circle-discloses-55-7-billion-worth-of-cash-treasury-reserves\" data-v-f87c67ca=\"\">disclose the specific Treasury securities<\/a> they hold in reserves. Alongside cash, short-term T-bills have become a standard acceptible reserve for fiat-backed stablecoins.&nbsp;&nbsp;","Disparte had been involved in the committee handling government affairs for Facebook's unsuccessful Diem, formerly known as Libra, stablecoin project.&nbsp;","A representative for Circle had not returned a request for comment as of publication time.&nbsp;"],"hashtag":["USDC"]}