{"summary":"OKX's comes as other major cryptocurrency exchanges, like Coinbase and Kraken, have also pursued their own layer 2 networks over the last year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/16\/crypto-exchange-okxs-new-layer-2-chain-x-layer-built-on-polygon-tech-hits-public-mainnet\/","publishDate":"2024-04-16T13:40:14","id":14767,"type":null,"title":"Crypto Exchange OKX's Polygon-Powered Layer 2, 'X Layer,' Hits Public Mainnet","category":["Technology"],"content":["OKX, the fourth-largest crypto exchange, said its new layer-2 blockchain, called X Layer, has gone live on its public mainnet, a continuation in the era of major crypto companies starting their own distributed networks.","X Layer, previously known as X1, makes use of Polygon's Chain Development Kit (CDK), a customizable toolkit that lets developers build their own chains by making use of zero-knowledge technology.","The news comes as other major cryptocurrency exchanges have pursued their own layer-2 networks over the past year. In August, Coinbase launched its “Base” blockchain, which is built with Optimism’s OP Stack. Kraken is reportedly also interested in creating its own layer-2 blockchain.","In a press release, OKX said its developers will be contributing to CDK’s codebase, and that X Layer will connect to Polygon’s wider ecosystem via the AggLayer. AggLayer is a Polygon offering that aims to unify liquidity across various chains spun up using the project's technology.","“OKX’s 50 million users now have an easy path to onboarding to X Layer and all the other chains connected to the AggLayer,” Polygon Labs Chief Executive Officer Mark Boiron said in the release.","X Layer, which launched on testnet in November, will allow users to access over 170 decentralized applications (dapps), with more slated to launch soon.","“We envision X Layer and other layer-2 chains as the highway infrastructure of the Web3 world, with dApps as the marketplaces and self-hosted wallets as the vehicles that take you there,” OKX Chief Marketing Officer Haider Rafique said in the press release.","Read more: Cryptocurrency Exchange OKX Coming Out With Layer 2 ‘X1’ Built on Polygon Technology","Edited by Bradley Keoun."],"entity":[{"type":"Polygon's Chain Development","content":"ORGANIZATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Polygon Technology","content":"ORGANIZATION"},{"type":"Boiron","content":"ORGANIZATION"},{"type":"Haider Rafique","content":"PERSON"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"November","content":"DATE"}],"hashtag":["OKX","Polygon","layer 2","Zero knowledge","Zero-Knowledge Proofs","rollup","Rollups","Polygon labs"],"authors":["Margaux Nijkerk"]}