{"summary":"The Block&#x27;s Frank Chaparro chats with Adam Goldberg, Co-Founder of Standard Crypto about their DeFi investment strategy.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/123318\/what-this-billion-dollar-crypto-vc-thinks-about-blockchain-gaming-and-the-metaverse","publishDate":"2021-11-05T10:02:29","id":1476,"type":null,"title":"What this billion-dollar crypto VC thinks about blockchain gaming and the Metaverse","category":["PODCASTS"],"content":["<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Episode <strong data-v-f87c67ca=\"\">73 <\/strong>of Season 3 of The Scoop was recorded remotely with The Block’s Frank Chaparro and Adam Goldberg, Co-Founder at Standard Crypto.<\/em><\/span>","<span data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Listen below, and subscribe to The Scoop on&nbsp;<\/i><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/the-scoop\/id1460134454\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Apple<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/open.spotify.com\/show\/7qwrgTJ5CYDXAaVILNZuEd\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Spotify<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vdGhlYmxvY2stdGhlc2Nvb3A?sa=X&amp;ved=0CAMQ4aUDahcKEwionbSO9fbxAhUAAAAAHQAAAAAQAg\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Google Podcasts<\/i><\/a><i data-v-f87c67ca=\"\">,&nbsp;<\/i><a href=\"https:\/\/www.stitcher.com\/podcast\/the-block-2\/the-scoop-4\" data-v-f87c67ca=\"\"><i data-v-f87c67ca=\"\">Stitcher<\/i><\/a><i data-v-f87c67ca=\"\">&nbsp;or wherever you listen to podcasts. Email feedback and revision requests to <a href=\"\/cdn-cgi\/l\/email-protection\" class=\"__cf_email__\" data-cfemail=\"d7a7b8b3b4b6a4a397a3bfb2b5bbb8b4bcb4a5aea7a3b8f9b4b8ba\">[email&nbsp;protected]<\/a>.<\/i><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">This episode is brought to you by our sponsors <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt<\/a>,&nbsp;<a href=\"http:\/\/kraken.com\/scoop\" data-v-f87c67ca=\"\">Kraken<\/a>&nbsp;and&nbsp;<a href=\"http:\/\/masterworks.io\/scoop\" data-v-f87c67ca=\"\">Masterworks<\/a><\/strong><\/span>","<span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bakkt® unlocks the $1.2+ trillion of digital assets that is currently held in cryptocurrencies, rewards and loyalty points, gaming assets and merchant stored value. We began in 2018 with the vision to bring trust and transparency to digital assets. Through the Bakkt Warehouse and Bakkt Bitcoin Futures and Options contracts, we serve institutional clients in an end-to-end regulated market with true price transparency. For consumers, Bakkt aggregates digital assets to enable instant liquidity and to empower users to trade, transfer and pay however they want. Visit <a href=\"http:\/\/Bakkt.com\" data-v-f87c67ca=\"\">Bakkt.com<\/a> for more information<\/span><\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Kraken<br data-v-f87c67ca=\"\">\n<\/strong><\/span><span data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Whether you’re an experienced crypto trader or just starting out, Kraken has the tools to help you achieve financial freedom. With 50+ cryptocurrencies to choose from, industry-leading security and a wide variety of features to suit any investing strategy, Kraken puts the power in your hands to buy, sell and trade digital assets. Visit&nbsp;<\/em><a href=\"http:\/\/kraken.com\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\"><em data-v-f87c67ca=\"\">Kraken.com<\/em><\/a><em data-v-f87c67ca=\"\">&nbsp;to get started today.<\/em><\/span>","<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">About Masterworks<br data-v-f87c67ca=\"\">\n<\/strong><\/span><em data-v-f87c67ca=\"\">Masterworks is democratizing the exclusive multi-trillion-dollar art world. Instead of needing to write a $10 million dollar check to buy one Picasso painting, you can buy shares of masterpiece paintings. Masterworks has securitized over $250 million worth of art for their 235,000 members and was recently valued at over $1 billion, making them the first and only unicorn in the alternative investing space. Invest like a billionaire today with a few easy clicks at&nbsp;<a class=\"c-link\" tabindex=\"-1\" href=\"http:\/\/masterworks.io\/scoop\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"http:\/\/masterworks.io\/scoop\" data-sk=\"tooltip_parent\" data-remove-tab-index=\"true\" data-v-f87c67ca=\"\">masterworks.io\/scoop<\/a><br data-v-f87c67ca=\"\">\n<iframe loading=\"lazy\" frameborder=\"0\" height=\"200\" src=\"https:\/\/playlist.megaphone.fm?e=BLOCK8575365368\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe><br data-v-f87c67ca=\"\">\n<\/em>","<span data-v-f87c67ca=\"\">“We're not art investors. We're investing in things that have communities”<\/span>","<span data-v-f87c67ca=\"\">On this episode of The Scoop, Adam Goldberg co-founder of Standard Crypto joined host Frank Chaparro to discuss his work as a crypto VC and how his company is looking at the DeFi market in an unconventional way.<\/span>","Standard Crypto is $1 billion in size, according to a source familiar with the fund.","<span data-v-f87c67ca=\"\">Today, their investment team is primarily focused on projects in three areas: infrastructure, networks and apps. Thus far, Standard Crypto has made investments in major companies like OpenSea, Axie Infinity, Matrixport, Aave and Telegram, among others. The firm also has stakes in projects such as Audius, BitClout\/Deso and Instadapp.<\/span>","Goldberg framed Standard Crypto's focus on the types of investments that have an ability to execute on and build a community.","\"When you have a network that's owned by its participants, the rules can't change without the community being on board. And that's what makes us feel like crypto networks are the hardest thing to disrupt that we've ever seen in humanity, in that they evolve with their communities as things change and shift over time,\" said Goldberg.","<b data-v-f87c67ca=\"\">Gaming and the Metaverse in focus<\/b>","<span data-v-f87c67ca=\"\">Goldberg told Chaparro that Standard Crypto is actively looking at companies advancing social and gaming projects in crypto. He sees the metaverse convergence of games and in-game economies as a new kind of development that's different from gameplay itself.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“I think with the metaverse, something that's really, really interesting is we've seen this trend where now game economies and in-game assets, and this is now extending beyond gaming, is quite separate from game mechanics. ” Said Goldberg. \"<\/span>You know, Axie is not just a game, it's a new movement. It's sort of like a new generation of Pokemon or of of Angry Birds. And it's possible that we'll see, you know, movies or other types of experiences built around that IP.\"","<strong data-v-f87c67ca=\"\">NFTs<\/strong>","<span data-v-f87c67ca=\"\">Standard Crypto is also looking closely at NFT’s, of which Goldberg said he sees a lot of opportunities to capture value as “new types of productive assets”. Standard Crypto are current investors in NFT marketplaces OpenSea and Foundation.<\/span>","<span data-v-f87c67ca=\"\">Goldberg likened the opportunities of the metaverse to how traditional holding companies hold businesses for cash flow. “We think there will be opportunities that look like holding companies, you know, a Berkshire Hathaway of the Metaverse, if you will, that are cash flow generating and hold a number of these productive assets. In the old world it used to be businesses, but now assets themselves can be productive. And I think when you sort of think about NFTs, they really can be so many things, right? It started as art and became art and culture and, you know, gaming economy assets. <\/span>And we're seeing that rapidly expand to even more things.<span data-v-f87c67ca=\"\">\"<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Foundation","content":"ORGANIZATION"},{"type":"Matrixport","content":"LOCATION"},{"type":"Bakkt Warehouse","content":"ORGANIZATION"},{"type":"$1.2+ trillion","content":"MONEY"},{"type":"$250 million","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"The Scoop","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Adam Goldberg","content":"PERSON"},{"type":"Spotify","content":"LOCATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Berkshire Hathaway","content":"PERSON"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Goldberg","content":"PERSON"},{"type":"Standard Crypto","content":"ORGANIZATION"},{"type":"$10 million dollar","content":"MONEY"},{"type":"Chaparro","content":"PERSON"},{"type":"Frank Chaparro","content":"PERSON"}],"hashtag":[],"authors":["Frank Chaparro","The Block"]}