{"summary":"The token has $75 million in trading volume in the hour after claims went live.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/30\/liquid-restaking-protocol-renzo-airdrops-rez-token-debuts-at-289m-market-cap\/","publishDate":"2024-04-30T12:41:20","id":14763,"type":null,"title":"Liquid Restaking Protocol Renzo Airdrops REZ Token, Debuts at $289M Market Cap","category":["Markets"],"content":["Liquid restaking protocol Renzo has opened airdrop claims for its native token (REZ), which has debuted at a $289 million market cap, according to CoinMarketCap.","The initial circulating supply of REZ is 1.15 billion, with the remaining 8.85 billion tokens remaining locked up until various criteria are met. 31% of the tokens have been allocated to investors, 32% to the community and 20% to core contributors, who are subject to a 1-year lock up and 2-year vesting period.","Renzo is a protocol that acts as a portal to EigenLayer by securing actively validated services (AVS). Users that stake ether (ETH) on the platform generate a yield and automatically receive ezETH, Renzo’s liquid restaking token, which can be used to generate a higher yield across various decentralized finance (DeFi) protocols.","Users holding more than 500,000 ezPoints, which were accumulated by staking on Renzo following its launch in January, are subject to a 50% lockup over a three-month vesting period.","Renzo said in a tweet that REZ was not available to trade on any decentralized exchange, although the official token contract posted on Renzo’s website had racked up $75 million in trading volume an hour after claims went live, Dextools data shows.","Edited by Parikshit Mishra."],"entity":[{"type":"$75 million","content":"MONEY"},{"type":"$289 million","content":"MONEY"},{"type":"32%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"8.85 billion","content":"MONEY"},{"type":"31%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"1.15 billion","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"CoinMarketCap","content":"ORGANIZATION"}],"hashtag":["Restaking","airdrop"],"authors":["Oliver Knight"]}