{"summary":"Crypto investment firm BlockTower Capital is hosting its first annual crypto-analyst competition\nWinners of the competition will share a prize of 3.5 bitcoin, equivalent to around $27,000 at the time of launch\nThe firm says the initiative is part of a global recruitment hunt\nElsewhere, Pantera Capital, Polychain, and Numerai are hiring","author":["Celia Wan","Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/26458\/crypto-fund-to-host-competition-in-search-of-top-bitcoin-analysts-as-investors-see-resurgence","publishDate":"2019-06-10T10:22:05","id":1476,"type":null,"title":"Crypto fund to host competition in search of top bitcoin analysts as investors see resurgence","category":["Investments"],"content":["Crypto pundits, investors, and analysts are not shy when it comes to publicly hailing their predictions.","<span data-v-f87c67ca=\"\">But now BlockTower Capital is ready to rank them,<a href=\"https:\/\/www.blocktower.com\/competition\" data-v-f87c67ca=\"\"> launching an analyst competition<\/a> with a total prize of 3.5 bitcoins, or $27,000, in a drive to recruit top talent to the digital assets investment firm.<\/span>","<span data-v-f87c67ca=\"\">Announced on Monday, participants will be asked to submit a written investment recommendation on a crypto asset, blockchain project, or idea, after conducting due diligence and analysis. <\/span><span data-v-f87c67ca=\"\">The first place winner of the competition will be awarded two bitcoins or the cash equivalent, while the second and third place will receive one and 0.5 bitcoins respectively. <\/span>","<span data-v-f87c67ca=\"\">Stamford, Conn.-based BlockTower Capital is hoping the competition creates a strong talent pipeline for the firm, which is looking to add a few analysts to its ranks. It's similar to competitions held in traditional finance such as hedge fund giant Citadel's <a href=\"https:\/\/www.businessinsider.com\/citadel-going-after-top-tech-talent-with-a-world-wide-competition-2018-1\" data-v-f87c67ca=\"\">Data Open competition<\/a>, which it hosts every year alongside <a href=\"https:\/\/www.correlation-one.com\/\" data-v-f87c67ca=\"\">Correlation One<\/a> to lure savvy data scientists.&nbsp;<\/span>","<strong data-v-f87c67ca=\"\">Recruiting stunt <\/strong>","<span data-v-f87c67ca=\"\">As for BlockTower, co-founder Matthew Goetz thinks the stunt will help the firm with its hiring efforts. While winners won't be guaranteed a job at the company, the firm expects the competition will give them strong leads with diverse skill-sets and backgrounds, spanning traditional finance, technology, and cryptocurrency firms.&nbsp;<\/span>","Goetz said the fast moving and changing crypto investing landscape requires firms to look at candidates with varying backgrounds. Indeed, investing in cryptocurrency markets has changed from the bull market in 2017, when most hedge funds deployed long\/short strategies. Now, <span data-v-f87c67ca=\"\">investors are exploring new strategies in staking, market making and venture capital investing.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Goetz himself has a background in portfolio management and trading through his previous posts at Goldman Sachs.<\/span>","<span data-v-f87c67ca=\"\">“The idea is that there is a lot of talent out there. We want to tap into it,” said Goetz. “This is a way to surface more of the top talent as we scale up and grow.”<\/span>","As part of the competition, winners will have the opportunity to present their investment theses directly to Goetz and CIO Ari Paul. Submissions are open until July 1.","The firm, which expanded into New York last year with a new office, recently parted ways with its VC head. Eric Friedman <a href=\"https:\/\/www.theblockcrypto.com\/2019\/02\/20\/blocktower-capitals-vc-head-has-left-the-firm\/\" data-v-f87c67ca=\"\">exited the firm earlier this year<\/a>. In total, the firm employees approximately 10 people, according to Goetz.&nbsp;","<strong data-v-f87c67ca=\"\">Crypto fund resurgence&nbsp;<\/strong>","Elsewhere, other hedge funds are looking to beef up their ranks as the market for digital currencies resurges from its 2018 lows. Pantera Capital has two investment analyst positions open, according to its website. Polychain Capital is searching for a full-time senior cryptocurrency engineer, whereas Numerai is searching for a blockchain engineer and head of growth &amp; marketing.&nbsp;","As per research from PwC and Elwood Asset management, the median assets under management for cryptocurrency funds has grown to $4.3 million at the end of Q1 2019, a threefold increase from January 2018.&nbsp;","<em data-v-f87c67ca=\"\">Due to an editing error, a previous version of this post incorrectly said Matthew Goetz was once employed by Susquehanna International Group.&nbsp;<\/em>"],"hashtag":[]}