{"summary":"Social media profile pics are one of the most popular ways to display NFT ownership.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-pfp-nfts\/","publishDate":"2022-04-27T21:16:10","id":14773,"type":null,"title":"What Are PFP NFTs?","category":["Learn"],"content":["If you’ve read or seen the term PFP NFTs, you might have thought someone’s cat walked across the keyboard. But no, that alphabet soup has a meaning: We are talking about profile picture (PFP) non-fungible tokens (NFT).","The abbreviation refers to the popular use of these NFTs as literal profile pictures on social media sites like Twitter. You may have seen celebrities showcase their Bored Ape Yacht Club NFT as their profile picture, for instance. But social media profile pics are just part of a larger ecosystem based on digital image-based NFTs.","The idea of NFTs representing digital avatars was inspired by a project called CryptoPunks, created by duo Matt Hall and John Watkinson in 2017. Their company, Larva Labs, created thousands of randomly generated pixel art images of stylized people (Punks) and marketed unique crypto tokens to denote their ownership. The Punks seemed to have fun personalities to which the owners could relate. The supply and the designs of the Punks are fixed forever; some designs are duplicates, others appear many times across the collection. The most valuable and rare are truly unique.","Hall and Watkinson created Ethereum tokens to denote ownership of the CryptoPunks. These were the early versions of NFTs. Initially, they were just standard ERC-20 tokens with some adjustments. For instance, the creators made it impossible to trade fractions of the tokens. CryptoPunks and similar projects have since helped pave the way for a standardized NFT token called ERC-721, suited to the functions that make NFTs different from other crypto tokens.","The success of CryptoPunks gave rise to a series of other projects inspired by it. Hall and Watkinson went on to create Meebits. These were 3D characters, varyingly unique and tradable just like the CryptoPunks.","The floor price of the CryptoPunks was around 62 ETH in April 2022 or over $180,000, according CoinGecko, meaning that’s the cheapest you can buy any individual NFT from the collection. Meebits prices pale by comparison, but you still can’t get your hands on one for less than around 6 ETH (around $18,000 as of writing).","Read More: CryptoPunks, CryptoCats and CryptoKitties: Then and Now","The connection between digital image NFTs and social media profile pictures was solidified when Twitter (TWTR) started offering to verify whether users owned the NFTs associated with their profile pictures.","As of January 2022, you could set your Twitter profile picture to your CryptoPunk or other NFT and get a special hexagonal border to show its authenticity. Someone else could copy-and-paste the image if they wanted, but they would not get the border. As of writing, this is still limited to subscribers to Twitter Blue and is powered by OpenSea.","Opinion: Why NFT Profile Pics Matter to Investors – and Regulators","The most successful PFP NFTs so far arrived in April 2021. It was the Bored Ape Yacht Club (BAYC) collection, created by Yuga Labs.","BAYC drew a lot from projects like CryptoPunks. There are 10,000, with each digital image containing unique qualities and elements of rarity. The images are humanoid apes that seem to have fun personalities.","The innovation that BAYC brought was to bundle various perks in with the ownership of the NFTs. For example, owners sometimes get rewarded with other NFTs for free. They each received a dog NFT at one point: the Bored Ape Kennel Club (BAKC). Then they got a \"serum,\" which they could use to mint their own Mutant Ape Yacht Club (MAYC) NFT with variable traits. To add to that, BAYC ownership confers access to an exclusive Discord server. Yuga describes this idea as “the ‘club’ model.” The perks are not just about owning a token. They mean membership of a community.","Read More: How NFT Social Clubs Work","Among the biggest perks BAYC owners get are the commercial rights over their images. They can do anything they want with them, including creating their own content with them and making money from that content or merchandise.","Venture capital firm and Yuga investor Samsung Next says that by handing over commercial rights in this way, Yuga has “disrupted traditional media content models.” Conventional media brands have worked hard to stop their customers from using their content for their own commercial ends. Yuga has taken a leap of faith in taking away all those restrictions in the interest of making their own brand that much more exciting and appealing.","At the time of writing, roughly a year after the project launched, the cheapest BAYC NFT could be yours for no less than 139 ether (ETH), according to CoinGecko. That’s more than $400,000. One of the reasons for the sky-high prices is the celebrity association. Eminem, Jimmy Fallon and Madonna hold BAYC NFTs, to name just a few.","Read More: What's the Story Behind Bored Ape Yacht Club Creator Yuga Labs?","The new kids on the block haven’t lost sight of their heritage. In March 2022, Yuga Labs bought the intellectual property of CryptoPunks and Meebits and announced that it would transfer the commercial rights to the owners of the tokens. That would bring the older collections closer in line with the new club model. “We’re excited to see what they do with IP rights,” Yuga said.","Hundreds of PFP NFT projects now exist, including female-driven projects like World of Women, utility-driven PFPs like Moonbirds and many more to choose from if you’re interested in finding just the right profile pic to express yourself online."],"entity":[{"type":"2017","content":"DATE"},{"type":"Yuga","content":"ORGANIZATION"},{"type":"April 2022","content":"DATE"},{"type":"January 2022","content":"DATE"},{"type":"$400,000","content":"MONEY"},{"type":"April 2021","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Watkinson","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"$180,000","content":"MONEY"},{"type":"PFP","content":"ORGANIZATION"},{"type":"Jimmy Fallon","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Moonbirds","content":"PERSON"},{"type":"Samsung Next","content":"ORGANIZATION"},{"type":"Bored Ape Kennel Club","content":"ORGANIZATION"},{"type":"Story Behind Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Madonna","content":"ORGANIZATION"},{"type":"Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"Yuga","content":"LOCATION"},{"type":"Yuga","content":"PERSON"},{"type":"Larva Labs","content":"ORGANIZATION"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"March 2022","content":"DATE"},{"type":"OpenSea","content":"ORGANIZATION"},{"type":"PFP NFT","content":"ORGANIZATION"},{"type":"$18,000","content":"MONEY"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Matt Hall","content":"PERSON"},{"type":"John Watkinson","content":"PERSON"}],"hashtag":["Learn","NFTs","Beginner","Bored Ape Yacht Club"],"authors":["Benedict George"]}