{"summary":"The change in scope also includes cross-border money transfers even when the money is not accepted or received in the city-state, and the facilitation of the transmission of crypto between accounts and exchanges,","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/02\/singapore-enacts-licencing-requirements-for-crypto-custody-services-and-others\/","publishDate":"2024-04-02T06:25:20","id":14783,"type":null,"title":"Singapore Enacts Licencing Requirements for Crypto Custody Services and Others","category":["Policy"],"content":["Singapore has expanded the scope of what cryptocurrency-related activities it regulates to include custodial services, the Monetary Authority of Singapore (MAS) announced on Tuesday.","The change in scope also includes cross-border money transfers even when the money is not accepted or received in the city-state, and the facilitation of the transmission of crypto between accounts and exchanges,","The legislation was passed in 2021 with amendments to the Payment Services Act (PS Act), the framework to regulate payment service providers. It was supposed to be enacted in the fourth quarter of 2021, but the MAS made the changes live only on Tuesday. Since 2021, the cryptocurrency sector has seen huge turmoil with the crash of FTX, leading to regulatory changes across the world.","“This is a long-awaited expansion that gives regulatory clarity to key parts of the crypto ecosystem, such as custody services,” said Angela Ang, a senior policy adviser for blockchain intelligence firm TRM Labs and a former MAS regulator.","The amendments would impose user protection and financial stability-related requirements on digital payment tokens (DPT) or cryptocurrency service providers.","The amendments include “segregating customers’ assets and placing them in a trust account for the benefit of customers, maintaining proper books and records, and ensuring that effective systems and controls are in place” and will take effect within six months from April 4, 2024.","Any entity that is already conducting crypto-related activities under the Payment Services Act will need to start a transition process within 30 days and submit a license application within six months from April 4, 2024, to continue activities temporarily till their application is reviewed.","The license application will require an attestation report of compliance with requirements around anti-money laundering and countering the financing of terrorism, qualified by an external auditor within nine months.","Entities that do not comply with these requirements would have to cease all activities, the MAS said.","Read More: Singapore Central Bank Rules to Discourage Crypto Speculation, Ease Investment Qualifications","Edited by Parikshit Mishra.","\n","\n"],"entity":[{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"DPT","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"April 4, 2024","content":"DATE"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"Ease Investment Qualifications","content":"ORGANIZATION"},{"type":"Singapore Central Bank Rules to Discourage Crypto Speculation","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Angela Ang","content":"PERSON"},{"type":"the fourth quarter of 2021","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"MAS","content":"ORGANIZATION"}],"hashtag":["Regulations","MAS","Singapore","Crypto","Custody Services","Monetary Authority of Singapore"],"authors":["Amitoj Singh"]}