{"summary":"The investment platform is merging with FinTech Acquisition Corp. V\nThe SPAC merger follows years of speculation about the fintech firm going public","author":["Ryan Weeks","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/98431\/etoro-public-merger-blank-check-company","publishDate":"2021-03-16T07:39:05","id":1478,"type":null,"title":"eToro to go public via merger with blank check company at $10.4bn valuation","category":["Cryptocurrency"],"content":["<span data-v-f87c67ca=\"\">London-based investment platform eToro is set to merge with a blank check company after years of speculation about the fintech firm going public.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company is merging with FinTech Acquisition Corp. V, a Special Purpose Acquisition Company (SPAC). Fintech Acquisition Corp. V is led by Betsy Z. Cohen, founder of The Bancorp, a banking technology firm with assets of $4.4 billion, according to its website.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The SPAC-listing will give eToro a valuation of around $10.4 billion.<\/span>","<span data-v-f87c67ca=\"\">The landmark transaction includes commitments for a $650 million private placement from investors including SoftBank Vision Fund 2, ION Investment Group, Third Point LLC, Fidelity Management &amp; Research Company LLC and Wellington Management.<\/span>","<span data-v-f87c67ca=\"\">“Today marks a momentous milestone for eToro as we embark on our journey to become a publicly traded company with Betsy Cohen and the team at FinTech V,” said Yoni Assia, CEO of eToro. “I want to express my gratitude for the passion, hard work, drive and determination of all of the eToro team members over the past 14 years who have helped make this a reality.”<\/span>","<span data-v-f87c67ca=\"\">Bloomberg<\/span><a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2021-03-15\/etoro-said-to-near-10-billion-merger-with-betsy-cohen-spac\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">first reported<\/span><\/a><span data-v-f87c67ca=\"\"> the news.&nbsp;<\/span><span data-v-f87c67ca=\"\">Israeli newspaper Calcalist reported in December that eToro was working with Goldman Sachs on<\/span><a href=\"https:\/\/www.calcalistech.com\/ctech\/articles\/0,7340,L-3884355,00.html\" data-v-f87c67ca=\"\"> <span data-v-f87c67ca=\"\">a $5bn Initial Public Offering<\/span><\/a><span data-v-f87c67ca=\"\"> on the Nasdaq exchange, but noted that the company was also examining a Special-Purpose Acquisition Company merger as an alternative route.<\/span>","<span data-v-f87c67ca=\"\">A source close to the discussions confirmed for The Block the existence of SPAC merger talks involving eToro towards the end of last year, albeit with a different SPAC.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">eToro was founded in Israel in 2007 by Assia, his brother Ronen and David Ring. The company pioneered a “copycat” trading system, allowing amateur equities investors to mirror the trades of more experienced traders on the platform.<\/span>","<span data-v-f87c67ca=\"\">The business then branched out into crypto trading via CFDs in 2013, but later <\/span><a href=\"https:\/\/www.theblockcrypto.com\/daily\/92448\/yoni-assia-etoro-bitcoin-rally-2020\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">phased out<\/span><\/a><span data-v-f87c67ca=\"\"> that structure in favour of offering direct crypto exposure to clients.<\/span>","<span data-v-f87c67ca=\"\">SPACs have exploded both in numbers and popularity over the past year, as managers rush to capitalize on a global tech market pregnant with later-stage players which appear to have limited appetite for taking on the administrative burden of a full public listing. SPACs are generally seen to offer a lighter-touch route to market.<\/span>","<span data-v-f87c67ca=\"\">Data site SPACinsider has <\/span><a href=\"https:\/\/spacinsider.com\/stats\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">already recorded<\/span><\/a><span data-v-f87c67ca=\"\"> 258 SPAC IPOs this year, up from 248 in the whole of 2020 and just 59 in 2019.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">eToro grew significantly in 2020, adding more than five million new registered users and generating gross revenues of $605 million, up 147% year-over year, according to a press release.&nbsp;<\/span>"],"hashtag":["SPACS"]}