{"summary":"The widespread use of public\/private key pairs will change how assets are held and funds are managed.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2020\/06\/20\/how-public-key-infrastructure-will-revolutionize-custody-and-fund-management\/","publishDate":"2020-06-20T12:22:47","id":14787,"type":null,"title":"How Public Key Infrastructure Will Revolutionize Custody and Fund Management","category":["Markets"],"content":["","Stefan Loesch is a director and board member of a tokenization firm. He used to serve as a consultant at McKinsey, and as a banker at JPMorgan. He is the author of a book on financial services regulation and a lecturer at the University of Nicosia. The views expressed here are his.","","","The widespread use of public\/private key pairs will greatly change the world of custody and, I will argue here, those changes will be passed through to the world of fund management. ","","","On the custody side, I have summarized the argument here. ","","","The essence is simple. In the traditional world, firms identify their customers with a shared secret, typically a username\/password combination. As the word “secret” implies, third parties need to take a firm’s word on trust as to whether it acts on behalf of the customer. There is no means for anyone to independently verify whether any given instruction has been given by the customer, or whether the firm or one of its employees went rogue. ","","","In the world of securities custody, there are typically at least two firms involved. This mirrors that financial services has two sets of customers, the issuers and the investors. So in custody there is the investor’s custodian, and the issuer’s depositary. For investors to put funds into an issuer’s asset, there must be a link of trust between their custodian and the issuer’s depositary. ","","","See also: Custody Battle Pits Institutional Boomers Against Crypto Upstarts","","","To see how this creates significant economies of scale, let’s consider that there are 150+ countries in the world. If we only have one custodian and one depositary per country, we need more than 10,000 bilateral links to be established. Every time two entities merge they can cut the number of external links in half, hence the strong push for large global depositories and custodians who can internalize many of their links.","","","A system built on public key cryptography is fundamentally different. Every customer is associated with a public\/private key pair. The identity of that customer and their linkage to the public key is appropriately attested, for example through the European Union’s eIDAS system or some privately run attestation scheme. In this system, every participant can independently verify whether or not instructions are genuine, simply by verifying whether instructions have been signed by the correct key. ","","","There is no need for trust forwarding between different parts of the custody chain. Instead, the depositary deals with all administrative issues, and the custodians’ only role is to keep their customers’ keys secure, and to provide a pleasant user experience. This, in turn, allows custodians of all shapes and sizes to appear, including self-custody and custody for friends and family.","","","Once we have a world with such a diverse range of custody options, the world of fund management will shift as well. Today, every fund retains its own custodian, and this custodian holds the entirety of the fund’s assets. The fund’s investors simply have a pro rata claim on the fund assets in custody. Because of this single-portfolio custody arrangement, every investor’s portfolio composition has to be exactly the same. In the brave new world of “artisanal” custody with a lot of small custodians with a differentiated offering, fund managers will become more like today’s CTAs. This means they will either advise their clients of what to buy and what to sell, or they will have discretion to transact on behalf of their clients within an agreed set of boundaries. ","","","Smart contracts assure that transactions they enter into are fair. Those contracts ensure the exchange of currency tokens (e.g. stablecoins for security tokens) happens atomically, meaning that either all legs of a transaction are settled or none are. They can also ensure that prices are reasonable, perhaps automatically blocking transactions that fall outside of market norms. ","","","In this world, an investor’s portfolio composition is no longer constrained by the shackles of common custody. Fund managers can tailor their investment strategy to their customers. For example, some customers might not want tobacco stocks or weapons producers or CO2 polluters. Others might have a specific blacklist of companies in which they do not want to invest. Fund managers can take those wishes into account. The simplest way to do this is to simply not enter into the offending investments. More sophisticated managers might run a more complex algorithm that rebalances the remainder of the portfolio as well to maintain the overall risk and reward characteristics for example by adding some other stocks instead.","","","In this world, investors will also be able to interact with more managers than before. For example, they can allocate some funds to niche investment managers. They can even allocate investments to a friend, safe in the knowledge that whatever investment boundaries have been agreed they will not be breached. Also, investing can become more fun. It can be gamified, or retail investors might earn more tangible benefits. For example, a football club could raise funds for a new stadium and provide token holders access to investor lounges, tiered by the investment amount. ","","","Also in this public\/private key driven world, a lot of the distinct roles in today’s custody world will collapse into one, or can be replaced by smart contracts. Payment and settlement, communications and voting can all be executed on-chain or near-chain. Data is by and large automatically consistent, and there is no need for bank account details and postal or email addresses. This dramatically reduces the cost of servicing investments, which in turn reduces the minimum viable investment size. ","","","This is the meaning of fractionalization: you can put a single asset onto the market, sell it to thousands of investors, and the administrative burden is still manageable. This allows investments into SMEs, or asset finance projects like for example single-object real estate or solar farms. Minimum viable sizes are small and it might even be possible to finance things like single-household solar installations individually, with payments automatically processed via the associated electricity company and production data being immutably recorded on-chain.","","","See also: Beyond Storage: How Custody Is Evolving to Meet Institutional Needs","","","Two great forces are set to re-shape the fund manager industry. ","","","On the one hand, we have the change in the custody model, which means single-investor custody and individual portfolio composition. Investors can bypass fund managers and directly invest into all kinds of investments that thus far have only been available to them via a fund investment. ","","","On the other hand, we have a multiplication of investment opportunities and choices. Retail investors have a heavy cognitive load to make sense of their options. Even for professional investors spending their working days on this task, it is hard to closely follow all stocks of the S&P 500. For retail investors, it is already impossible. If we multiply the number of possible investments by 1,000x – and fractionalization easily does this – we see that retail investors will still need professional help on the large majority of their portfolio, so the fund managers’ role will not disappear but it will change to account for the shifting realities. ","","","The exact changes remain to be seen, but it seems that robo advice – or more generally AI assisted advice – will be an important part of the picture. Sequoia’s recent investment into Vise is a testament to this trend. People will want to be more empowered to make their own individual investment decisions, in ticket sizes that suit them rather than being driven by the denominations of shares traded in the market. So we have seen Charles Schwab following Robinhood’s lead on fractionalization of shares.","","","I expect three things to happen as a result of these trends. First, fund managers will be more like commodity trading advisors who tell clients what to do, but don’t custody the portfolios. Two, they will take very specific client preferences into account, and will use AI or other automation tools to do that. And three, they will only manage a part of their customers’ investments, with another part being allocated to investments that bring additional benefits, for example being able to have a beer in the investors’ lounge of your favorite football club.","","","This, however, is a long-term vision, and it will take some time to get there. In particular we as an industry are facing a chicken-and-egg problem: To get retail investors we need to build a regulated market infrastructure, but to build this infrastructure, we need sufficient product that is hard to originate without the infrastructure in place. We need professional investors as anchor investors in our deals, and tokenization is for the time being still a hard sell in the professional investor space.",""],"entity":[{"type":"Charles Schwab","content":"PERSON"},{"type":"European Union","content":"LOCATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Stefan Loesch","content":"PERSON"},{"type":"McKinsey","content":"ORGANIZATION"},{"type":"Custody Battle Pits Institutional Boomers Against Crypto Upstarts","content":"ORGANIZATION"},{"type":"the University of Nicosia","content":"ORGANIZATION"}],"hashtag":["Opinion","Custody"],"authors":["Stefan Loesch"]}