{"summary":"Cardano prepares to enter the decentralized application space as smart contract functionality arrives.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/08\/23\/cardano-alonzo-hard-fork-what-you-need-to-know\/","publishDate":"2021-08-23T10:44:43","id":14791,"type":null,"title":"Cardano Alonzo Hard Fork: What You Need to Know","category":["Markets"],"content":["","Cardano’s Alonzo update brings the network much closer to its full capabilities.","","","The Alonzo hard fork is a major upgrade on the Cardano network that sees the much-anticipated implementation of smart contract functionality. Smart contracts are pieces of computer code that automatically execute when certain predefined conditions are met. After the Alonzo update, anyone will be able to create and deploy their own smart contracts on the Cardano blockchain, paving the way for native decentralized applications (dapps).","","","The system update, which is expected to roll out fully sometime in the third quarter, signifies the end of the Shelley era of Cardano and the beginning of the Goguen phase. Although there is no set date for the end of the Alonzo hard fork, developers all across the network have been working hard on testnets and have stuck to a defined road map with specific milestones in the form of “eras.”","","","Cardano’s development road map is divided into six main stages, or “eras,” each focused on expanding the functionality of the network.","","","Cardano is now in the final stages of the Shelley era. This development phase added a host of new features to Cardano such as a proof-of-stake protocol known as Ouroboros, an incentives and delegation scheme that rewards participants and better hard wallet support.","","","By offering rewards to those who run full nodes – network participants who download the entirety of the Cardano blockchain – Cardano incentivizes network participation and encourages the growth of the Cardano network.","","","Since its launch on July 29, 2020, Shelley has introduced two major hard forks: Allegra and Mary. Allegra introduced a token locking mechanism that allows users to lock up Cardano tokens in preparation for on-chain voting (which is expected to roll out in Voltaire, the final development stage). Mary, on the other hand, introduced token support for Cardano’s Native Tokens (CNT). These native tokens are similar to Ethereum’s ERC token standards and enable users to create and deploy their own tokens on the Cardano blockchain, including non-fungible tokens (NFTs).","","","Cardano operates using its own “hard fork combinator” – a system that combines two different protocols (such as Byron and Shelley) onto a single ledger to ensure a smooth transition between phases. One problem that Cardano developers saw with hard forks was that after a hard fork was agreed upon, there would still be a considerable segment of the community that did not switch over to the new version. That may have been because they disagreed with changes or just because they didn’t bother upgrading. Either way, the combinator allows nodes to run multiple versions at once, meaning transitions are seamless and updates are frictionless. Essentially, rather than be opt-in, the updates will be opt-out.","","","The Alonzo hard fork is split into three main color-coded phases.","","","There are also two smaller phases post-Alonzo Purple dubbed “Alonzo Red” and “Alonzo Black.” Each phase essentially adds more users to the testnet and identifies bugs that may need to be fixed.","","","Alonzo Blue introduced smart contracts with around 50 technical participants, mostly stake pool operators (SPOs). Invalidation errors and other simple fixes were found and tweaked during this phase. These standard bugs are expected to appear and be fixed as Alonzo goes through testing.","","","Alonzo White adds more features and a wider range of participants to Alonzo Blue. The hundreds of new users will be run through a sort of “exercise boot camp” that will test the capabilities of the network. This experiment is being done by IOG; the main development company behind Cardano led by former Ethereum co-founder Charles Hoskinson. The company expects this phase to last around two to four weeks.","","","Alonzo Purple will become a fully public testnet and on-board thousands of participants to the network. This particular stage is split into two distinct phases, “light purple” and “dark purple.” The first will allow for simple smart contracts, while the latter will allow for more complex smart contracts.","","","Then comes the final Alonzo Red\/Alonzo Black color phases, which are reserved for final bug fixes\/cleanup to prepare the final release of the hard fork. Any future tweaks to the hard fork will be very difficult to make past this point, and so it is important that these two phases are looked at very carefully.","","","Staging adds quality assurance, as code is frozen and exchanges are prepped for the Cardano hard fork. Alonzo Mainnet will officially launch the final code.","","","The Goguen Era, named after famed computer scientist Joseph Goguen, will allow for the development of dapps on the Cardano network for the first time due to Alonzo’s new smart contract capabilities. Smart contracts are the vital components of dapps that enable them to operate without intermediary entities. A smart contract building platform called The Plutus Platform is scheduled to be released during this phase and will allow both technical and non-technical users to build dapps.","","","Plutus uses the native Cardano programming language, Haskell. Plutus and Haskell use the same code base for off- and on-chain development. This means that at the core, the coding is identical so that there will be no complications with programming languages when developing smart contracts. That allows Plutus contracts to become even more straightforward and permits testing, which will allow developers to perfect their products for much more intensive loads such as hosting large institutions or governments.","","","Hoskinson, who's now the CEO of IOG, explained Haskell was chosen because it is a high- assurance code (capable of providing a higher degree of certainty the code works as intended).","","","Many times in the blockchain sector, code doesn’t fully match the intent of the developer and as a result, millions of dollars can be stolen or apps can break down, such as what happened when a Solidity smart contract wasn’t fully fledged out. As a result, the decentralized autonomous organization (DAO) project suffered a significant hack. ","","","With Haskell, intent can better match the code as the language, although complex, was designed to be precise.","","","Then there’s Plutus Core, which is the programming language that connects smart contracts to the Cardano final settlement layer: the Cardano blockchain. Once a developer is done creating their code with Plutus, it is compiled into Plutus Core where the code is simplified for the Cardano blockchain. This method allows Cardano to better deal with the data and to take up less disc space on the actual blockchain.","","","For the less-technical enthusiasts, there’s Marlowe, a new domain-specific language (DSL) that allows any user to create and test their own smart contracts without needing any advanced programming capabilities. Marlowe is built on top of Haskell and Plutus but can be thought of as building blocks for creating smart contracts.","","","With easier smart contract production and more development on Cardano, one can imagine the potential projects to be built. If you look at Ethereum, you can see hundreds of projects that can be redeployed, reiterated on and even improved upon on the Cardano network, including Uniswap, Aave and many more. Projects that demand faster transaction speeds will benefit greatly from the low transaction costs on Cardano. Already, more than 65 projects are pledged to be released alongside Alonzo, including Synthesis, Miniswap, Stasis and CardWallet.","","","The emergence of easier dapp building will bring with it more projects. In his Africa Vision video, Hoskinson mentioned these projects will eventually compete with many real-world financial institutions and aim to replace them with fairer systems, granting economic freedom to those in need.",""],"entity":[{"type":"Voltaire","content":"ORGANIZATION"},{"type":"Hoskinson","content":"PERSON"},{"type":"Marlowe","content":"PERSON"},{"type":"Alonzo Red\/Alonzo Black","content":"ORGANIZATION"},{"type":"Cardano’s Native Tokens (CNT","content":"ORGANIZATION"},{"type":"Haskell","content":"PERSON"},{"type":"Haskell","content":"LOCATION"},{"type":"Goguen Era","content":"ORGANIZATION"},{"type":"Cardano blockchain","content":"ORGANIZATION"},{"type":"Shelley)","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Africa Vision","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"third quarter","content":"DATE"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"Joseph Goguen","content":"PERSON"},{"type":"Cardano","content":"PERSON"},{"type":"Cardano blockchain","content":"PERSON"},{"type":"July 29, 2020","content":"DATE"},{"type":"Shelley","content":"PERSON"},{"type":"Miniswap","content":"LOCATION"},{"type":"Byron","content":"PERSON"},{"type":"Mary","content":"PERSON"},{"type":"Goguen","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Cardano","Learn","Evergreen","Explainer"],"authors":["Eli Tan","Myles Sherman"]}