{"summary":"The firm also completed the development of its three-nanometer mining chip, which it had been working on since April 2023.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/24\/jack-dorseys-block-is-building-a-bitcoin-mining-system\/","publishDate":"2024-04-24T14:12:12","id":14795,"type":null,"title":"Jack Dorsey’s Block Is Building a Bitcoin Mining System","category":["Finance"],"content":["Block, the payments company founded by former Twitter CEO Jack Dorsey, is building its own bitcoin (BTC) mining system as it deepens its footing in the challenging crypto mining space, the firm said on Tuesday.","The firm, formerly known as Square, said in a blog post that it completed the development of its three-nanometer mining chip, which it had been working on since April 2023. The full design is in process with a leading global semiconductor foundry, according to the post.","In addition to that, Block said that after speaking to community members about the pain points in the industry, it decided to also develop a full bitcoin mining system, which will include system design.","“We’ve spent a significant amount of time talking to a wide variety of bitcoin miners to identify the challenges faced by mining operators,” it said in the post. “Building on these insights and pursuant to our goal of supporting mining decentralization, we plan to offer both a standalone mining chip as well as a full mining system of our own design.","The bitcoin mining industry is dominated by only a few players, with Beijing-based miner Bitmain controlling roughly 60% of the market, according to estimates by CoinShares.","“There are few serious competitors, which indicates significant potential for disruption,” said James Butterfill, head of research at CoinShares.","Block announced the completion of a five-nanometer bitcoin mining chip prototype in May 2023, which is the same technology that Bitmain’s S21 mining machine uses. “This leads us to believe that 3nm chips could achieve even greater efficiencies,” he said.","Although chip efficiency has rapidly improved in recent years as demand for bitcoin has picked up, the latest halving event on April 20, which cut the issuance of new bitcoin by 50%, adds even more importance for faster mining speed, as well as lower costs and enhances reliability, Butterfill said.","Edited by Parikshit Mishra.","\n"],"entity":[{"type":"Beijing","content":"LOCATION"},{"type":"April 2023","content":"DATE"},{"type":"Square","content":"LOCATION"},{"type":"May 2023","content":"DATE"},{"type":"James Butterfill","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Block","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Butterfill","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"CoinShares","content":"ORGANIZATION"}],"hashtag":["Dorsey’s Block (SQ)","Jack Dorsey","Bitcoin","Bitcoin Mining"],"authors":["Helene Braun"]}