{"summary":"No one knows who Satoshi Nakamoto really was, but we do know he was the inventor of Bitcoin, ushering in the age of cryptocurrency.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/who-is-satoshi-nakamoto\/","publishDate":"2013-08-20T20:59:01","id":14792,"type":null,"title":"Who Is Satoshi Nakamoto?","category":["Learn"],"content":["While we may not know who Satoshi Nakamoto was, we know what he (or she) did. Nakamoto was the inventor of the Bitcoin protocol, publishing a paper via the Cryptography Mailing List in November 2008.","Nakamoto then released the first version of the Bitcoin software client in 2009, participating with others on the project via mailing lists,until he finally began to fade from the community toward the end of 2010.","Nakamoto worked with people on the open-source team but took care never to reveal anything personal about himself, and the last anyone heard from him was in the spring of 2011, when he said that he had \"moved on to other things.\"","Best not to judge a book by its cover. Or in fact, maybe we should.","\"Satoshi\" means \"clear thinking, quick witted; wise.\" \"Naka\" can mean \"medium, inside, or relationship.\" \"Moto\" can mean \"origin\" or \"foundation.\"","Those things would all apply to the person who founded a movement by designing a clever algorithm. The problem, of course, is that each word has multiple possible meanings.","We can’t know for sure whether Nakamoto was Japanese or not. In fact, it's presumptuous to assume that he was actually a \"he.\" Allowing for the fact that \"Satoshi Nakamoto\" could have been a pseudonym, \"he\" could have been a \"she,\" or even a \"they.\"","No, but the detective techniques that people use when guessing are sometimes even more intriguing than the answer. The New Yorker’s Joshua Davis believed that Satoshi Nakamoto was Michael Clear, a graduate cryptography student at Dublin's Trinity College.","He arrived at this conclusion by analyzing 80,000 words of Nakamoto’s online writings and searching for linguistic clues. He also suspected Finnish economic sociologist and former games developer Vili Lehdonvirta.","Both have denied being bitcoin’s inventor. Michael Clear publicly denied being Satoshi at the 2013 Web Summit.","Adam Penenberg at Fast Company disputed that claim, arguing instead that Nakamoto may actually have been three people: Neal King, Vladimir Oksman and Charles Bry. He figured this out by typing unique phrases from Nakamoto’s bitcoin paper into Google, to see if they were used anywhere else.","One of them, \"computationally impractical to reverse,\" turned up in a patent application made by these three for updating and distributing encryption keys. The bitcoin.org domain name originally used by Satoshi to publish the paper had been registered three days after the patent application was filed.","It was registered in Finland, and one of the patent authors had traveled there six months before the domain was registered. All of them deny it.","In any case, when bitcoin.org was registered on Aug. 18, 2008, the registrant actually used a Japanese anonymous registration service, and hosted it using a Japanese ISP. The registration for the site was only transferred to Finland on May 18, 2011, which weakens the Finland theory somewhat.","Others think Nakamoto was Martii Malmi, a developer living in Finland who has been involved with bitcoin since the beginning and developed its user interface.","Another possibility is Jed McCaleb, a lover of Japanese culture and resident of Japan, who created troubled bitcoin exchange Mt. Gox and cofounded decentralized payment systems Ripple and later Stellar.","Another theory suggests that computer scientists Donal O'Mahony and Michael Peirce are Satoshi, based on a paper that they authored concerning digital payments, along with Hitesh Tewari, based on a book that they published together. O’Mahony and Tewari also studied at Trinity College, where Michael Clear was a student.","Israeli scholars Dorit Ron and Adi Shamir of the Weizmann Institute retracted allegations made in a paper suggesting a link between Satoshi and Silk Road, the black market web site that was taken down by the FBI in October 2013. They had suggested a link between an address allegedly owned by Satoshi, and the site. Security researcher Dustin D. Trammell owned the address, and disputed claims that he was Satoshi.","In May 2013, internet pioneer Ted Nelson threw another hat into the ring: Japanese mathematician Professor Shinichi Mochizuki, although he admits that the evidence is circumstantial at best.","In February 2014, Newsweek’s Leah McGrath Goodman claimed to have tracked down the real Satoshi Nakamoto. Dorian S. Nakamoto has since denied he knows anything about bitcoin, eventually hiring a lawyer and releasing an official statement to that effect.","Hal Finney, Michael Weber, Wei Dai and several other developers were among those who are periodically named in media reports and online discussions as potential Satoshis. A group of forensic linguistics experts from Aston University believe the real creator of bitcoin is Nick Szabo, based upon analysis of the Bitcoin White Paper.","Dominic Frisby, a comedian and a writer, also suggests that BitGold creator Szabo was the most likely candidate to be Satoshi in his book, “Bitcoin: The Future of Money.” His detailed analysis involved the linguistics of Satoshi's writing, judging the level of technical skill in C++ and even Satoshi's likely birthday.","In Nathaniel Popper's book, \"Digitial Gold,\" released in May 2015, Popper reveals that in a rare encounter at an event Szabo again denied that he was Satoshi.","Then in early December 2015, reports by Wired and Gizmodo tentatively claimed to have identified Nakamoto as Australian entrepreneur Craig S Wright. WIRED cited \"an anonymous source close to Wright\" who provided a cache of emails, transcripts and other documents that point to Wright's role in the creation of bitcoin. Gizmodo cited a cache of documents sourced from someone claiming to have hacked Wright’s business email account, as well as efforts to interview individuals close to him. While most other individuals speculated to be Nakamoto have insisted they are not the inventor of Bitcoin, Wright is the exception, claiming to be Nakamoto. However, many believe the evidence so far presented to be insufficient to confirm this claim, and some even think the reports that made the initial connection were misled by Wright himself in an elaborate hoax.","One thing we know, based on interviews with people that were involved with him at an early stage in the development of bitcoin, is that he thought the system out very thoroughly.","His coding wasn’t conventional, according to core developer Jeff Garzik, in that he didn’t apply the same rigorous testing that you would expect from a classic software engineer.","An analysis by Sergio Lerner, an authority on bitcoin and cryptography, suggests Nakamoto mined many of the early blocks in the bitcoin network, and that he had built up a fortune of around 1 million unspent bitcoins. That hoard would be worth $18.4 billion U.S. dollars as of Nov. 23, 2020.","No one knows what Nakamoto is up to, but one of the last emails he sent to a software developer, dated Apr. 23, 2011, said, \"I’ve moved on to other things. It's in good hands with Gavin and everyone.\"","There are rumors, of course. People have interpreted his name as meaning \"central intelligence,\" but people will see whatever they want to see. Such is the nature of conspiracy theories.","The obvious question would be why one of the three-letter agencies would be interested in creating a cryptocurrency that would subsequently be used as an anonymous trading mechanism, causing senators and the FBI alike to wring their hands about potential terrorism and other criminal endeavors. No doubt conspiracy theorists will have their views on that, too.","Perhaps it doesn’t matter. Core developer Jeff Garzik puts it succinctly, \"Satoshi published an open-source system for the purpose that you didn’t have to know who he was, and trust who he was, or care about his knowledge,\" he points out. Open-source code makes it impossible to hide secrets. \"The source code spoke for itself.\"","Moreover, it was smart to use a pseudonym, he argues, because it forced people to focus on the technology itself rather than on the personality behind it. At the end of the day, bitcoin is now far bigger than Satoshi Nakamoto.","Having said that, if the real Satoshi Nakamoto is out there – get in touch!"],"entity":[{"type":"Adam Penenberg","content":"PERSON"},{"type":"Joshua Davis","content":"PERSON"},{"type":"Aug. 18, 2008","content":"DATE"},{"type":"May 2013","content":"DATE"},{"type":"December 2015","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Leah McGrath Goodman","content":"PERSON"},{"type":"Hal Finney","content":"PERSON"},{"type":"May 2015","content":"DATE"},{"type":"May 18, 2011","content":"DATE"},{"type":"Dorian S. Nakamoto","content":"PERSON"},{"type":"Neal King","content":"PERSON"},{"type":"Finland","content":"LOCATION"},{"type":"Gavin","content":"PERSON"},{"type":"Trinity College","content":"ORGANIZATION"},{"type":"Apr. 23, 2011","content":"DATE"},{"type":"Dublin","content":"LOCATION"},{"type":"February 2014","content":"DATE"},{"type":"Nov. 23, 2020","content":"DATE"},{"type":"Satoshi","content":"PERSON"},{"type":"Michael Clear","content":"PERSON"},{"type":"Martii Malmi","content":"PERSON"},{"type":"Nick Szabo","content":"PERSON"},{"type":"Dominic Frisby","content":"PERSON"},{"type":"Szabo","content":"PERSON"},{"type":"Jeff Garzik","content":"PERSON"},{"type":"Satoshi\"","content":"PERSON"},{"type":"Sergio Lerner","content":"PERSON"},{"type":"Craig S Wright","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2010","content":"DATE"},{"type":"Donal O'Mahony","content":"PERSON"},{"type":"Nakamoto","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"Charles Bry","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"Popper","content":"ORGANIZATION"},{"type":"Shinichi Mochizuki","content":"PERSON"},{"type":"Adi Shamir","content":"PERSON"},{"type":"Wei Dai","content":"PERSON"},{"type":"Ted Nelson","content":"PERSON"},{"type":"Gizmodo","content":"ORGANIZATION"},{"type":"Aston University","content":"ORGANIZATION"},{"type":"Weizmann Institute","content":"ORGANIZATION"},{"type":"Bitcoin White Paper","content":"ORGANIZATION"},{"type":"Nathaniel Popper","content":"PERSON"},{"type":"November 2008","content":"DATE"},{"type":"Tewari","content":"PERSON"},{"type":"Vili Lehdonvirta","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"October 2013","content":"DATE"},{"type":"Michael Peirce","content":"PERSON"},{"type":"2009","content":"DATE"},{"type":"Japan","content":"LOCATION"},{"type":"Vladimir Oksman","content":"PERSON"},{"type":"Fast Company","content":"ORGANIZATION"},{"type":"Dustin D. Trammell","content":"PERSON"},{"type":"Newsweek","content":"ORGANIZATION"},{"type":"spring of 2011","content":"DATE"},{"type":"Jed McCaleb","content":"PERSON"},{"type":"Michael Weber","content":"PERSON"},{"type":"Wright","content":"PERSON"},{"type":"$18.4 billion","content":"MONEY"},{"type":"Hitesh Tewari","content":"PERSON"},{"type":"Dorit Ron","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin","Beginner","Learn"],"authors":["CoinDesk Staff"]}