{"summary":"Restaking has grown into the second-largest DeFi sector on the Ethereum blockchain and is likely to become a core part of the network’s infrastructure, the report said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/02\/ethereum-could-face-hidden-risks-from-ballooning-restaking-market-coinbase\/","publishDate":"2024-04-02T15:40:00","id":14803,"type":null,"title":"Ethereum Could Face 'Hidden Risks' From Ballooning Restaking Market: Coinbase","category":["Finance"],"content":["Restaking has grown into the second largest decentralized finance (DeFi) sector on the Ethereum blockchain and promises to be a core part of the ecosystem’s infrastructure, but it could bring hidden risks, Coinbase (COIN) said in a research report on Tuesday.","“EigenLayer’s staking protocol is poised to become the bedrock for a wide range of new services and middleware on Ethereum, which, in turn, could generate a meaningful source of ether (ETH) rewards for validators in the future,” analysts David Han and David Duong wrote, noting that it is now the second largest DeFi protocol with $12.4 billion in total value locked.\n\nEigenLayer allows validators to earn extra rewards by securing actively validated services (AVS) by restaking their staked ether and “builds upon the foundation of the existing staking ecosystem by collateralizing a diverse pool of underlying liquid staked tokens (LSTs) or native staked ETH,” the report said.","Liquid restaking platforms park assets with EigenLayer and give their users tradable receipts called liquid restaking tokens (LRTs). Restaking and LRTs, however, could pose added risks compared to existing staking products, both from a financial and security perspective, Coinbase said.","Read more: Liquid Restaking Tokens: What Are They and Why Do They Matter?\n\n“The adoption of LRT wrappers around the underlying protocol could lead to hidden risks from nontransparent staking strategies or temporary dislocations from their underlying,” the authors wrote, adding that the “initial yield from AVSs may not live up to the extremely high expectations set by the market.”","The report also pointed out that stakers will go where the LRT providers offer the highest rewards. This could lead to additional risks as these providers will try to maximize rewards by restaking multiple times to attract more users. \"We believe what matters will be the risk-adjusted rewards and not absolute rewards, but it may be difficult to have transparency on that. This could lead to additional risks as LRT DAOs are incentivized to maximally restake multiple times to remain competitive.\"","However, Coinbase says despite these risks, “restaking champions the open innovation of Ethereum and will become a core part of the ecosystem’s infrastructure.”\n\nRead more: Ethereum’s Rising Validator Count is Causing Concerns, Fidelity Digital Assets Says","Edited by Aoyon Ashraf.","\n"],"entity":[{"type":"David Han","content":"PERSON"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"David Duong","content":"PERSON"},{"type":"$12.4 billion","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"LRT","content":"ORGANIZATION"},{"type":"Fidelity Digital","content":"ORGANIZATION"},{"type":"Ethereum’s Rising Validator Count","content":"ORGANIZATION"}],"hashtag":["Restaking","EigenLayer","ethererum","ETH"],"authors":["Will Canny"]}