{"summary":"A Binance team found that \"VIP\" clients – those trading more than $100 million per month – were engaging in pump-and-dump schemes and wash trading, the Wall Street Journal said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/05\/09\/binance-fired-investigator-who-uncovered-market-manipulation-at-client-dwf-labs-wsj\/","publishDate":"2024-05-09T10:51:31","id":14806,"type":null,"title":"Binance Fired Investigator Who Uncovered Market Manipulation at Client DWF Labs: WSJ","category":["Finance"],"content":["Binance fired a member of staff who uncovered evidence of market manipulation at crypto investment firm DWF Labs, one of cryptocurrency exchange's clients, the Wall Street Journal reported on Thursday, citing interviews with Binance employees past and present, documents, emails and other industry participants.","The former staffer and his colleagues on Binance's market-surveillance team had been hired to winkle out signs of market manipulation and other nefarious activities as part of the exchange's efforts to clean up its act in the face of scrutiny from financial regulators.","The team found that \"VIP\" clients – those trading more than $100 million per month – were engaging in pump-and-dump schemes and wash trading that were prohibited by Binance's terms and conditions, according to the WSJ article.","DWF Labs, which was making more than $4 billion in monthly trades, emerged as a prolific investor in crypto projects in early 2023 when it was at the center of a stream of funding rounds in an otherwise sedate market. Differing from the traditional venture capital model, the firm, whose founders made their money as crypto high-frequency traders, generally bought millions of dollars worth of a project's token at a discount and benefited when the price rose.","The Binance investigators submitted a report alleging DWF had manipulated the price of several tokens on the back of $300 million of wash trades in 2023, but Binance deemed there was insufficient evidence of market abuse, the WSJ said. A week after the report's submission, the head of the team was fired, according to the newspaper.","Binance told the WSJ it rejected claims it had permitted market manipulation, and the person was dismissed after an inquiry found the allegations against the client weren't \"fully substantiated.\"","After the article was published, DWF Labs said in a posting on X that the allegations about it were \"unfounded and distort the facts.\"","Binance also responded, without relating to the member of staff's dismissal. \"We do not tolerate market abuse,\" it said in an X post. \"Over the last three years, we have offboarded nearly 355,000 users with a transaction volume of more than $2.5 trillion for violating our terms of use.\" The company did not respond to CoinDesk's request for comment.","UPDATE (May 9, 11:15 UTC): Adds Binance response in final paragraph.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"WSJ","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$2.5 trillion","content":"MONEY"},{"type":"May 9","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"DWF Labs","content":"ORGANIZATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Binance","Dwf labs","Market Manipulation","Wash Trading"],"authors":["Jamie Crawley"]}