{"summary":"In a rare example of real-world business deployment, Breitling is registering watches on a blockchain to track their provenance from owner to owner.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/03\/29\/luxury-watchmaker-breitling-adds-its-first-timepieces-to-a-blockchain\/","publishDate":"2020-03-29T15:29:43","id":14809,"type":null,"title":"Luxury Watchmaker Breitling Adds Its First Timepieces to a Blockchain","category":["Finance"],"content":["","The Breitling Top Time, pictured above, was a hand-wound chronograph from the 1960s popular with the Jet Set of the era. James Bond wore it in \"Thunderball,\" although his featured a miniature Geiger counter.","","","The company has rereleased the watch, black and white \"panda\" face and all, to a new generation and it's doing something a bit different this time. Instead of offering a certificate of authenticity, the company is registering each watch on a private blockchain that will follow its provenance from owner to owner.","","","As such, it's a rare example of an enterprise blockchain project that made its way to real-world deployment; most corporate dabbling with distributed ledgers has resulted in little more than hype.","","","\"The Breitling Top Time Limited Edition will be the brand’s first watch offered with a blockchain-based digital passport, which confirms the authenticity and ownership of the watch with a single click,\" the company said in a press release.","","","Breitling is using a blockchain from valuables registrar Arianee, a French company whose aim is to build \"perpetual relationships between brands and owners.\" The solution ties the watch's warranty to the watch itself and not to any paper trail, allowing owners to have their pieces serviced by authorized dealers based on the watch's digital signature.","","","The Arianee blockchain combines permissioned and permissionless elements through its use of a consensus mechanism it’s calling “proof-of-authority.” It is permissionless in the sense that users who want to sell products to one another can interact with the blockchain, but the verifying of the ledger and issuance of tokens is controlled by the participating businesses.","","","Breitling, founded in 1884, is being a good sport about the project, saying the system allows users to \"engage with the brand anonymously\" and take part in \"new online services ranging from advanced clienteling to a revolutionary care program.\"","","","The watch nerd will note that the Top Time has a linear scale on its bezel instead of a tachymeter. This is called a decimal scale and was offered on some watches in the 1960s. It was, apparently, used for scientific timings, splitting each minute into 100 sections rather than the usual 60.","","","The watch costs $4,990, or about 80 percent of the current price of one bitcoin. Breitling, one of the first manufacturers to offer online sales, is shipping the Top Time this month.",""],"entity":[{"type":"Top Time","content":"ORGANIZATION"},{"type":"Geiger","content":"PERSON"},{"type":"1884","content":"DATE"},{"type":"80 percent","content":"PERCENT"},{"type":"Breitling Top Time","content":"ORGANIZATION"},{"type":"$4,990","content":"MONEY"},{"type":"this month","content":"DATE"},{"type":"1960s","content":"DATE"},{"type":"Breitling Top Time Limited Edition","content":"ORGANIZATION"}],"hashtag":["Luxury","Private Blockchains","Permissioned Blockchains","Enterprise Blockchain","Watches"],"authors":["John Biggs"]}