{"summary":"Some of the highest-profile and controversial bankruptcies in history, including Enron's and Lehman Brothers', have included the appointment of an independent examiner.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/08\/18\/crypto-lender-celsius-needs-independent-examiner-us-government-entity-says\/","publishDate":"2022-08-18T21:49:59","id":14808,"type":null,"title":"Crypto Lender Celsius' Collapse Into Bankruptcy Should Be Probed, US Says","category":["Policy"],"content":["U.S. government officials asked that an independent examiner be appointed to look into crypto lender Celsius Network's collapse into bankruptcy, seeking the sort of investigation previously deployed in the high-profile restructurings of Enron and Lehman Brothers.","The U.S. Trustee office, which oversees bankruptcy matters, said there are \"numerous questions\" about Celsius' operations and its financial health, as well as how its management allowed it to enter bankruptcy, according to a court filing Thursday.","An independent probe, which the judge overseeing the case would have to approve, would answer questions about the company's financials and address \"significant transparency issues\" in the bankruptcy case, according to the filing.","\"There is no real understanding among customers, parties in interest and the public as to the type or actual value of crypto held by the Debtors or where it is held,\" the U.S. Trustee said. \"An independent examiner is necessary here to investigate and report in a clear and understandable way on the Debtors’ business model, their operations, their investments, their lending transactions, and the nature of the customer accounts to ensure public confidence in the integrity of the bankruptcy system and to neutralize the inherent distrust creditors and parties in interest have in the Debtors.\"","In the controversial Enron and Lehman cases, an examiner dove into the causes of their spectacular falls. With Enron, the examiner concluded that senior officials at the Houston energy company were in \"a circle of responsibility for Enron's financial demise,\" according to a 2003 Associated Press article. As for the brokerage firm, \"Lehman Brothers used accounting sleight of hand to conceal the bad investments that led to its undoing,\" the New York Times said of a bankruptcy examiner's report in 2010.","Read more: Crypto Lender Celsius On Pace to Run Out of Cash by October","The U.S. Trustee noted that Celsius took out a third-party loan but did not identify who the lender was, what the collateral was or what kind of loan was issued. Moreover, this was even after the lender revealed it could not return the collateral.","\"No description of the types of claims the Debtors may have against this lender are made in the Mashinsky Declaration, nor is there an explanation for why legal recourse was not sought,\" the filing said, using the last name of Celsius CEO Alex Mashinsky. \"There is also no description of any investigation by the Debtors into its legal recourse.\"","Read more: Sky-High Yields and Bright Red Flags: How Alex Mashinsky Went From Bashing Banks to Bankrupting Celsius","Celsius' customers also do not trust the company, and have said so in filings published to the court docket, the Trustee's office said.","Appointing an independent examiner \"would be in the best interest\" of both Celsius, its creditors and equity holders, the filing said.","\"The Debtors’ professionals acknowledge many of these facts and circumstances and have provided information requested by the United States Trustee. Irrespective of such cooperation, however, the divergent interests of the various estates, the extreme financial irregularities that have taken place, and the extensive mistrust of the Debtors’ customers, all make the appointment of an independent and disinterested examiner in the best interests of creditors, equity security holders, and the bankruptcy estates,\" the filing said.","A Twitter account for Celsius' unsecured creditors tweeted that it objects to the request, saying an examiner will \"run up millions in costs when CEL should cut costs.\"","\n","UPDATE (Aug. 18, 2022, 22:35 UTC): Adds additional detail.","UPDATE (Aug. 18, 2022, 23:03 UTC): Adds comment from unsecured Celsius creditors."],"entity":[{"type":"Enron","content":"ORGANIZATION"},{"type":"2003","content":"DATE"},{"type":"Associated Press","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"2010","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Mashinsky Declaration","content":"LOCATION"},{"type":"United States Trustee","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"Aug. 18, 2022","content":"DATE"},{"type":"Celsius","content":"ORGANIZATION"},{"type":"Houston","content":"LOCATION"},{"type":"Trustee","content":"ORGANIZATION"},{"type":"Lehman Brothers","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"U.S. Trustee","content":"ORGANIZATION"}],"hashtag":["Celsius","Bankruptcy","US"],"authors":["Nikhilesh De"]}