{"summary":"Tether has launched a new stablecoin pegged 1:1 to the Mexican peso.\nIt will be initially available on Ethereum, Tron and Polygon.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/148910\/tether-launches-mexican-peso-stablecoin-mxnt","publishDate":"2022-05-26T07:00:59","id":1480,"type":null,"title":"Tether launches a new stablecoin pegged to the Mexican peso","category":["Stablecoins"],"content":["Tether has launched a new Mexican peso-pegged stablecoin, marking its entrance into Latin America.","Dubbed MXNT, the stablecoin will initially be available on the Ethereum, Tron and Polygon blockchains, Tether said today.","This is Tether's fourth fiat-pegged stablecoin, after US dollar-pegged USDT, Euro-pegged EURT and the offshore Chinese Yuan-pegged CNHT.","\"We have seen a rise in cryptocurrency usage in Latin America over the last year that has made it apparent that we need to expand our offerings,\" Paolo Ardoino, CTO of Tether, said in a statement. \"Introducing a Peso-pegged stablecoin will provide a store of value for those in the emerging markets and in particular Mexico.\"","Tether said the launch of MXNT will provide a testing ground for onboarding new users in Latin America and pave the way for more fiat-pegged stablecoins in the region.","While Tether has Euro and Yuan-pegged stablecoins, its USD-pegged stablecoin USDT remains more popular, although it has recently seen massive redemptions amid panic over the collapse of algorithmic stablecoin terraUSD (UST) earlier this month.","USDT remains the biggest stablecoin in the world, with its current total supply standing at over 77 billion, according to <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\" data-v-f87c67ca=\"\">The Block's Data Dashboard<\/a>.","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/decentralized-finance\/stablecoins\/total-stablecoin-supply-daily\/embed\" title=\"Total Stablecoin Supply\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","Over the past month, however, Tether's supply has declined by more than 15 billion.","But Tether remains optimistic. Ardoino recently told The Block: \"We should underline the fact that Tether did not lose its peg and the ease in which Tether allows traders to perform redemptions.\""],"hashtag":["TETHER"]}