{"summary":"The Ethereum Foundation may spend $15 million on a project implementing randomness tech called \"Verifiable Delay Functions.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/02\/07\/ethereum-foundation-and-others-weigh-15-million-bid-to-build-randomness-tech\/","publishDate":"2019-02-07T08:20:16","id":14800,"type":null,"title":"Ethereum Foundation and Others Weigh $15 Million Bid to Build 'Randomness' Tech","category":["Markets"],"content":["At the cutting edge of blockchain research is a potential $15 million dollar venture by the Ethereum Foundation centered around a technology called Verifiable Delay Functions (VDFs).","Acting as a source of computer-generated randomness that is unpredictable and unbias-able, VDFs are envisioned for use in a highly-anticipated “proof-of-stake”(PoS) system called Serenity which the ethereum network will migrate to in the next few years.","What's more, the ability to generate secure randomized numbers – if implemented in Serenity – would be a feature that can be leveraged by all decentralized applications (dapps) on the platform once integrated into the ethereum codebase.","Speaking to current viability studies on VDF technology, Ethereum Foundation researcher Justin Drake told CoinDesk:","And in terms of making the final decision on the technology, Drake stressed that the process of decision-making would be multi-layered.","“To an extent we need the buy-in from the wider ethereum community that this is a good idea and that the foundation should be spending this money,\" said Drake. \"This is something where we can reach rough consensus on public calls.\"","For now, Drake told CoinDesk that a number of essential tests will be carried out by ethereum developers before a final “go, no-go decision” is made on the incorporation of the technology into Serenity.","One of these tests, called the RSA ceremony, will require hundreds of randomized individuals spread out across the globe to participate in an experiment which tests the security of random number generation by a VDF.","Outside of the RSA ceremony, there will also be a worldwide circuit competition requiring participants to test and create specialized firmware also called ASICs to run VDF computations.","As Drake elaborated:","And it’s not just the Ethereum Foundation looking at hosting circuit competitions to build VDF technology.","To this end, the decentralized app network Chia completed their first-ever VDF open circuit competition, awarding a total of $100,000 to relevant participants. The company is said to be gearing up for a second round of competition by \"incorporating the solutions from this first round,\" as highlighted in a press release.","\"If we don't do a great job of optimizing performance ... there are likely to be sudden jumps in performance of the best VDF that anyone has out there post-launch, which could result in significant network instability,\" Bram Cohen, Chia's co-founder, told CoinDesk.","Outside of Chia, there are a total of 11 other blockchain companies exploring VDF technology – each with unique plans of their own.","As Revealed to CoinDesk in interview, the ethereum sidechain POA Network plans to host \"a public bounty\" for a VDF implementation using the ethereum open-source collaboration platform Gitcoin.","Other than Chia and POA Network, some of the notable crypto projects researching VDF include file storage system Filecoin, smart contract platform Tezos, decentralized app network NEAR protocol and ThunderCore.","The imperative for increased collaboration between all these companies, according to Drake, is all the more needed given that VDFs are “like a fundamental new primitive.”","“It’s quite generic in that sense … It would be nice if the industry standardizes around a single VDF, partly because that would make the various blockchain projects more compatible with each other but it also means that we [wouldn’t] have to reinvent the wheel and [would collectively] pay less,” said Drake.","And while at least one company was previously reported to be in collaboration with the Ethereum Foundation on VDFs, Drake highlights that for now, the foundation is working independently.","Unveiled last November, Filecoin had tentatively agreed to split costs for a VDF viability study and reevaluate at a later date whether or not to move forward with the necessary firmware development to bring VDF ideas to life.","A protocol researcher from Filecoin, who wished to remain unnamed, told CoinDesk:","The representative also affirmed that, at present, Filecoin is moving ahead \"separately\" from the Ethereum Foundation but may \"potentially co-fund third party proposals for exploratory VDF research with the Ethereum Foundation\" in the months ahead.","As such, Drake highlights that, for now, “the Ethereum Foundation has moved on its own ... [funding] various researchers, generally small grants to the order of 10 and 25 thousand dollars.”","But moving forward, Drake estimated that the foundation could come to a decision about whether or not to use the technology in as little as four months time.","“So the various studies that we’ve just kicked off should take four to six months but I think that in about four months we’ll be able to make an informed go, no-go decision,\" Drake said.","Ethereum image via Shutterstock"],"entity":[{"type":"$15 million dollar","content":"MONEY"},{"type":"POA Network","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"25 thousand dollars","content":"MONEY"},{"type":"Bram Cohen","content":"PERSON"},{"type":"Ethereum Foundation\"","content":"ORGANIZATION"},{"type":"Drake","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"Chia","content":"PERSON"},{"type":"Chia","content":"LOCATION"},{"type":"RSA","content":"ORGANIZATION"},{"type":"Drake","content":"LOCATION"},{"type":"Drake","content":"PERSON"},{"type":"Justin Drake","content":"PERSON"},{"type":"Filecoin","content":"PERSON"},{"type":"Chia","content":"ORGANIZATION"},{"type":"VDF","content":"ORGANIZATION"}],"hashtag":["ASICs","Ethereum","News","Filecoin","Technology News"],"authors":["Christine Kim"]}