{"summary":"Upbit said it is \"poised to expand [its] range of offerings,\" having acquired a MPI license.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/01\/08\/crypto-exchange-upbit-gets-full-licensing-in-singapore\/","publishDate":"2024-01-08T16:25:02","id":14816,"type":null,"title":"Crypto Exchange Upbit Gets Full Licensing in Singapore","category":["Policy"],"content":["South Korean cryptocurrency exchange Upbit has officially obtained a Major Payment Institution (MPI) license from the Monetary Authority of Singapore (MAS).","The MPI license enables Upbit to provide regulated digital payment token (DPT) services to its clients in the Southeast Asian city state. Upbit acquired in-principle approval from the MAS in October last year, which enabled it to continue operating while awaiting full licensing.","The crypto exchange is the latest to get the MPI license in the country alongside some of its peers, such as Coinbase and Crypto.com.","Upbit said in a blog post that the company is \"poised to expand [its] range of offerings,\" having acquired an MPI license.","Singapore regulates cryptocurrencies as digital payment tokens under its Payment Services Act (PSA) of 2019. The island country has won a reputation as a world-leading crypto hub by harnessing its legal and regulatory structure to provide clear guidelines on how cryptocurrency firms should operate.","Read More: Singapore Central Bank Rules to Discourage Crypto Speculation, Ease Investment Qualifications","Edited by Aoyon Ashraf."],"entity":[{"type":"DPT","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"MPI","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Monetary Authority of Singapore (MAS)","content":"ORGANIZATION"},{"type":"Ease Investment Qualifications","content":"ORGANIZATION"},{"type":"Singapore Central Bank Rules to Discourage Crypto Speculation","content":"ORGANIZATION"},{"type":"October last year","content":"DATE"},{"type":"2019","content":"DATE"}],"hashtag":["Upbit","Singapore","Monetary Authority of Singapore","Exchange"],"authors":["Jamie Crawley"]}