{"summary":"Recently, traders have sold $80,000 BTC call options expiring at the end of May to generate additional yield, one observer said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/05\/02\/bitcoin-call-writing-back-in-vogue-as-cash-and-carry-strategy-loses-shine\/","publishDate":"2024-05-02T09:36:18","id":14819,"type":null,"title":"Bitcoin 'Call Writing' Back in Vogue as Cash And Carry Strategy Loses Shine","category":["Markets"],"content":["Writing or selling bitcoin (BTC) call options, one of the most favored yield-generating strategies a year or so ago, is back in vogue as the recent market swoon has dented the appeal of the cash and carry arbitrage.","Selling a call option is a way of offering insurance to the buyer against bullish price moves in return for compensation, called a premium. The premium received is the maximum profit a call option seller stands to make.","In late 2022 and the first half of 2023, traders consistently sold bitcoin and ether call options at strikes well above the going market rate, generating additional yield on top of their spot market holdings. Now they are selling $80,000 BTC call options expiring at the end of May, according to algorithmic trading firm Wintermute. Bitcoin is currently trading around $58,000.","\"One popular strategy among traders is to sell out-of-the-money call options at higher strike prices, like the $80,000 mark set for the end of May. These strikes are beyond the current high range and are less likely to be exercised, allowing traders to collect premiums while reducing their risk exposure,\" Wintermute said in a note shared with CoinDesk.","If bitcoin ends May below $80,000, the sellers will walk away with the entire premium received. However, they stand to lose money if the price surges above $80,000 and they don't hedge or hold spot market longs.","Renewed demand for selling bitcoin options is evident from the slide in the leading crypto options exchange Deribit's implied volatility index (DVOL), an options-based measure of expected price volatility over the next 30 days.","The implied volatility is influenced by demand for options and increased preference for writing usually drives the metric lower.","The DVOL has collapsed from an annualized 72% to 59% in 10 days, according to charting platform TradingView. The ether (ETH) DVOL fell from 80% to 60% last week, only to bounce back to nearly 80% this week.","Singapore-based QCP Capital also noted a heavy selling of BTC call options last week.","\"This is the result of spot price being stuck in a tight range and the basis yields drying up. The desk has seen many customers pivot back to option selling strategies,\" QCP said in a market note last week.","Bitcoin fell as low as $56,600 Wednesday, diving out of a four-week consolidation between $60,000 and $70,000 due to several factors, including dwindling demand for spot exchange-traded funds and a resurgent dollar index.","The cash and carry arbitrage involves buying the underlying asset in the spot market while simultaneously selling futures contracts when the latter trades at a notable premium. It's a strategy that helps traders capture the premium, or the pricing discrepancy, while bypassing volatility associated with price moves.","The strategy, however, is now a lot less appealing than during the first quarter because the futures premium has declined sharply in recent weeks.","The annualized three-month futures premium in bitcoin futures listed on Binance, OKX and Deribit has dropped to nearly 5%, down significantly from the high of 28% at the end of March. The premium in the regulated futures listed on the Chicago Mercantile Exchange has seen a similar slide.","In other words, the so-called market-neutral bets no longer offer a significantly higher return than the much-safer U.S. Treasury notes. As of writing, the yield on the 10-year note, the so-called risk-free rate, was 4.61%.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Wintermute","content":"PERSON"},{"type":"80%","content":"PERCENT"},{"type":"QCP Capital","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$80,000","content":"MONEY"},{"type":"72%","content":"PERCENT"},{"type":"60%","content":"PERCENT"},{"type":"4.61%","content":"PERCENT"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"59%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"Binance","content":"LOCATION"},{"type":"the first quarter","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Wintermute","content":"ORGANIZATION"},{"type":"$58,000","content":"MONEY"},{"type":"$56,600","content":"MONEY"},{"type":"28%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"OKX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"$70,000","content":"MONEY"}],"hashtag":["Bitcoin","Cash and Carry","Futures","Options","Markets","Trading"],"authors":["Omkar Godbole"]}