{"summary":"Of all the tasks I have in this job, this one has to be the best.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/02\/20\/coindesks-major-award-is-a-huge-moment-for-us-and-crypto-media-generally\/","publishDate":"2023-02-20T15:15:43","id":14827,"type":null,"title":"CoinDesk's Major Award Is a Huge Moment for Us and Crypto Media Generally","category":["Consensus Magazine"],"content":["The news that Ian Allison and Tracy Wang are joint recipients of a Polk Award, one of the most prestigious in journalism, for three November scoops that led to the unraveling of FTX’s empire is a source of immense pride for all of us at CoinDesk.","This is a milestone, not only for CoinDesk, but for crypto media generally. It underscores the role that sound, professional journalism can play in bringing transparency to the too-often-opaque and, sadly, scam-ridden crypto industry.","As Deputy Editor-in-Chief Nick Baker and Executive Editor Marc Hochstein put it in their write-up of the three award-winning stories (Ian’s initial scoop on Alameda’s balance sheet, his followup on Binance being likely to withdraw its bailout and Tracy’s bombshell on CEO Sam Bankman-Fried’s “cabal of roommates” that ran FTX): “There is little precedent in journalism history for a story that made such an impact and did it so quickly.”","It’s painful to see so many FTX victims in the fallout from what Ian and Tracy uncovered. But the reality is it would have eventually been exposed. That it wasn’t earlier is, in fact, the problem. It’s why a professional, independent media is vital for an industry with trust issues.","But it takes a technical grounding to cover this complex topic properly. Just as bankers exploited miscomprehension of collateralized debt obligations pre-2008, crypto scammers hide behind techno-fog. That can be challenging for reporters unfamiliar with the tech. It’s why some mainstream coverage of Bankman-Fried left a lot to be desired.","Here, CoinDesk is unique. Sure, there are quality crypto reporters in mainstream media as well as in the crypto press, but no outlet has nearly as deep a bench as we do. We combine the best of mainstream and crypto journalism.","We are led by Editor-in-Chief Kevin Reynolds in editorial, who had a storied 23-year career at Bloomberg, and by Joanne Po, executive producer and head of multimedia, who led TV and digital multimedia teams at CNBC, The Wall Street Journal and Fox Digital. We have other senior editors with decades of newsroom experience. Just as importantly, we employ many scoop-hungry, crypto-native reporters – some of them straight out of school, others older – with deep, personal understanding of the technology and its opportunities and challenges.","This two-way approach is more important than ever. Contrary to its critics, crypto isn’t going anywhere. But, clearly, it needs to be improved, both on the technical side and in the regulatory framework. If it is to live up to its transformative potential, it’s vital that crypto’s problems be exposed, so that solutions can be iteratively developed and so that promising projects are given the attention they deserve.","It has become popular in some crypto circles to argue that this should be left to solo “citizen journalists” on Twitter. But while there’s definitely a place for the crowdsourcing of information that happens on social media, Ian and Tracy’s work is Exhibit A in the case for why independent, structured press organizations like CoinDesk remain vital.","Until someone comes up with something better – perhaps, one day, a workable, trusted decentralized system for uncovering facts and holding bad actors accountable – there’s no substitute for the training or the embedded principles of professional journalism with which reporters develop trust with sources, report accurately and work with integrity.","Do we occasionally get things wrong? Sure. But there’s a commitment, day in and day out, to endeavor to get it right, promptly correct and disclose our mistakes and strive for objectivity and transparency. The best way to address the conspiracy theorists who blindly claim we serve some puppet master’s interests is to point to the proof in our pudding.","Today is therefore not only a day to celebrate Ian and Tracy and their editor, Nick Baker, but every single person at CoinDesk. They have all contributed to a workplace that allows and encourages our journalists to pursue these high standards – one result of which is this highly deserved accolade. It’s a day, also, to recognize why it’s so important that the wider crypto industry supports media institutions like CoinDesk that live by these principles."],"entity":[{"type":"Tracy’s","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"Joanne Po","content":"PERSON"},{"type":"Tracy","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Fox Digital","content":"ORGANIZATION"},{"type":"Tracy Wang","content":"PERSON"},{"type":"Kevin Reynolds","content":"PERSON"},{"type":"Ian Allison","content":"PERSON"},{"type":"Ian","content":"PERSON"}],"hashtag":["CoinDesk","Journalism","Opinion"],"authors":["Michael J. Casey"]}