{"summary":"The Ethereum development company is seeking regulatory clarity on a number of questions, in a case that some experts see as potentially heading to the Supreme Court.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/26\/consensys-a-target-for-the-secs-assault-on-eth-is-fighting-back\/","publishDate":"2024-04-26T11:00:00","id":14829,"type":null,"title":"Consensys, a Target for the SEC’s Assault on ETH, Is Fighting Back","category":["Consensus Magazine"],"content":["Consensys, one of the main supporters of the Ethereum network, claims the U.S. Securities and Exchange Commission (SEC) is attempting a power grab over Ethereum (ETH), the second-largest blockchain by market capitalization. And so, as natural, the Ethereum development company is suing, citing regulatory overreach.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","“The U.S. Securities and Exchange Commission seeks to regulate ETH as a security, even though ETH bears none of the attributes of a security – and even though the SEC has previously told the world that ETH is not a security, and not within the SEC’s statutory jurisdiction,” according to the lawsuit filed in a Texas court on Thursday.","Over-and-above Consensys’ lawsuit is the growing trend of U.S. crypto companies and organizations willing to fight back against what they see as overzealous regulation. There are many unsettled questions regarding crypto law, and going on the offensive – possibly even bringing a case before the Supreme Court – would be one way to get answers.","See also: Consensys Sues SEC Over ‘Unlawful Seizure Of Authority’ Over Ethereum","Coinbase, for instance, is spending big to challenge a case brought by the SEC, and itself went to the courts to sue the agency seeking to get clarity on key questions of crypto law. Kraken and Uniswap, also facing SEC suits, vowed to fight back – and LBRY, now defunct, literally fought until the end.","Then there are the lobbyist organizations like the Blockchain Association, which this week sued the SEC over a narrow point of law, the definition of a “broker” that, if the agency had its way, would have broad impact over the crypto industry. In 2022, Coin Center sued the U.S. Treasury Department (and lost) for sanctioning crypto mixer Tornado Cash.","“Consensys is joining some of the leading companies in the space in a broad industry pushback against regulation by enforcement that is destructive to the future of the internet. This is the responsibility of every Web3 company that has the capital and expertise to navigate the U.S. power structures,” Lex Sokolin, founder of Generative Ventures and a former Consensys employee, told CoinDesk in an interview.","\"It's invigorating to witness top actors in our field engaging with regulators to seek clarity in our exponentially growing industry,” CEO of the dYdX Foundation and former Consensys lawyer Charles d'Haussy told CoinDesk.","A key argument of Consensys’ suit is that the SEC had already declared that ETH is not a security, all the way back in 2018 when then SEC Director William Hinman gave a speech stating as much. It confirmed this position in 2021, when the first ETH futures launched in the U.S., putting the asset under the purview of the Commodities Futures Trading Commission (CFTC).","There’s an argument to be made that the SEC had a fresh start to reevaluate Ethereum after it dropped mining for proof-of-stake. However, some experts note the SEC approved additional futures products after that happened, again dampening the argument that ETH is a security.","When news first dropped that the SEC was possibly investigating the non-profit Ethereum Foundation and subpoenaing firms for information related to Ethereum’s development, many experts interviewed by CoinDesk agreed that it would be illegal to reverse course after so much time. An entire multi-billion dollar industry has already been built on the understanding that ETH is a commodity.","It’s “the whole ‘you can't just arbitrarily change your mind and damage people for hundreds of billions of dollars after a decade’ and also by the way the CFTC will likely fight back” argument, Austin Campbell, a Columbia Business School assistant professor and former adviser to stablecoin issuer Paxos, told CoinDesk in an interview at the time.","See also: Why the SEC Shouldn't Classify ETH as a Security","\"The case we have filed today is intended to preserve access for the thousands of developers, market participants, and institutions who have a stake in the world's second largest blockchain,\" Joe Lubin, Ethereum co-founder and Consensys CEO, said in a statement. \"The SEC cannot be allowed to arbitrarily expand its jurisdiction.”","According to the complaint, Consensys is looking to clarify three particular points: first, that ETH is a commodity; second, that the most popular Ethereum wallet, developed by Consensys, is not a broker; and lastly to get an injunction to leave developers alone and preemptively prevent the SEC from suing the company.","In addition to receiving multiple subpoenas in 2023 and in recent weeks, Consensys’ court filing also disclosed that the company received a Wells Notice on April 10, or an indication that the SEC is working to build a case. According to Consensys Senior Counsel and Director of Global Regulatory Bill Hughes the company complied with the “voluntary” requests for information.","Notably, the SEC asked for information not only about Consensys itself – including questions about its ETH holdings and treasury sales, and whether it contributed to the Ethereum Improvement Proposals (EIP) that led to Ethereum’s switch to proof-of-stake – but also questions about open source developers.","“The fact that they're looking at open source protocol developers, certainly with an eye on building a case to enforce, really struck us as way out of bounds,” Hughes said, adding that Consensys was asked to provide lists of coders and their GitHub repositories. “To some degree, they are redefining their regulatory purview and becoming an internet regulator.","“This is not something we necessarily enjoy doing or want to do. But to a large extent it's necessary to defend the use of and building upon Ethereum and really all programmable blockchains in the United States,” he added.","While standing up for open source development may be motivating factor, Hughes suggested that the company was forced to move by what they saw as a “remarkable acceleration in their aggressiveness with respect to Ethereum” and their interactions with the agency that “made it clear that they viewed [Consensys] as the target for an Ethereum enforcement action.”","“Should they be left unopposed they could do meaningful harm to our company in particular and the broader ecosystem. It comes to a point where you just can't wait any longer,” he said.","In particular, the SEC appears to be building a case that MetaMask Swaps, a decentralized exchange aggregator for swapping tokens that charges a 0.875% transaction fee, and MetaMask Staking, a relatively recent product essentially limited to users with 32 ETH to spare to become an Ethereum validator that takes a 10% cut of staking rewards, are in violation of securities or brokerage laws. (Several state regulators have also challenged the legal ground of staking.)","“The end goal of the suit is to get the judge to agree and issue an order finding that Ethereum is a commodity, that the SEC has been acting beyond its statutory authority and in violation of procedures it's required to comply with, and that peer to peer software that people use to read and transact with themselves on the blockchain is not a broker,” Hughes said.","But other experts CoinDesk spoke to say the case may have an even loftier vision.","“This Consensys lawsuit is a really big deal. They’re positioning themselves to challenge the SEC’s authority to regulate crypto,” University of Kentucky law professor Brian Frye said in an interview, noting the case was filed it in the 5th Circuit — which is “notoriously anti-government and anti-regulatory.”","See also: ‘It Can Be Said With Confidence the SEC Is Investigating Ethereum’: Consensys’ Bill Hughes Talks Crypto Law","In other words, Consensys may be trying to build a case worthy of taking before the Supreme Court. Frye noted that this particular SCOTUS would likely be willing to “revisit and narrow” the scope of the Howey test, one of the ways the SEC determines whether something is a security, and the basis for the majority of its litigation against crypto firms.","“Consensys hired Wachtell, which is the most expensive law firm in the world. That means they are really, really serious,” Frye said. It’s worth noting that Consensys recently relocated to Texas (its new listed address is a WeWork) from New York, which would make establishing jurisdiction in the 5th Circuit easier. “If that happens, there’s just no way SCOTUS doesn’t take the case,” Frye added.","For his part, Hughes denied the claim, saying that Texas is business-friendly and home to a burgeoning crypto scene. (CoinDesk’s Consensus 2024 conference will be held in Austin in May, for instance.) “By contrast, New York was getting a little chillier,” he said.","In any case, Consensys’ legal maneuver certainly changes the dynamic between the firm and would-be regulator. Its lawsuit doesn’t necessarily preclude the SEC from filing its own case, or unilaterally declaring ETH a security (which it has been reluctant to do so far), which would essentially make it illegal to spend ETH in the U.S.","But the situation is “meaningfully different” now that Consensys is a plaintiff rather than just a target. At the very least it’s one way to show the world that the SEC’s Enforcement Division, and likely leadership, “considers Ethereum security” without having the gall to state it directly.","“We think our action is appropriate because we think that the right answer needs to be gotten to and we're happy to call the question,” Hughes said.","See also: Samourai Wallet Charges Raise Existential Questions About Crypto Privacy","Edited by Nikhilesh De."],"entity":[{"type":"William Hinman","content":"PERSON"},{"type":"Lex Sokolin","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Austin","content":"LOCATION"},{"type":"” University of Kentucky","content":"ORGANIZATION"},{"type":"Brian Frye","content":"PERSON"},{"type":"5th Circuit","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"CoinDesk’s Consensus 2024","content":"ORGANIZATION"},{"type":"Columbia Business School","content":"ORGANIZATION"},{"type":"Samourai Wallet Charges Raise Existential Questions About Crypto Privacy","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"dYdX Foundation","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"April 10","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"Commodities Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"MetaMask Staking","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"0.875%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"},{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Austin Campbell","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Generative Ventures","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Charles d'Haussy","content":"PERSON"},{"type":"Hughes","content":"PERSON"},{"type":"Consensys Senior Counsel and Director of Global Regulatory Bill Hughes","content":"ORGANIZATION"},{"type":"hundreds of billions of dollars","content":"MONEY"},{"type":"Joe Lubin","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Hughes Talks Crypto Law","content":"ORGANIZATION"},{"type":"Wachtell","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Howey","content":"PERSON"},{"type":"Frye","content":"PERSON"},{"type":"the Supreme Court","content":"ORGANIZATION"}],"hashtag":["Analysis","The Node","Newsletters","Ethereum","ETH","Staking","MetaMask","SEC","Regulation"],"authors":["Daniel Kuhn"]}