{"summary":"A single bitcoin is divisible, just like dollars, and the smallest unit is called a satoshi.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-satoshi-understanding-the-smallest-unit-of-bitcoin\/","publishDate":"2022-02-25T15:02:59","id":14820,"type":null,"title":"What Is a Satoshi? Understanding the Smallest Unit of Bitcoin","category":["Learn"],"content":["There are 100 million satoshis (sats) in one bitcoin, meaning each satoshi is worth 0.00000001 BTC. In order for one satoshi to be worth one cent, 1 BTC would need to be worth $1 million.","As of early 2022, a satoshi is worth less than a twentieth of a cent.","The satoshi is not the only subdivision of bitcoin. A millibitcoin is a term for one-thousandth of a bitcoin or 0.001 BTC. A microbitcoin is one-millionth of a bitcoin or 0.000001 BTC. On the Lightning network, it is possible to transact using a unit even smaller than the satoshi. Known as the millisatoshi, it represents one-thousandth of the size of a single satoshi, but this is not usable on the bitcoin network itself.","Using terms like satoshis, or other small units, means users avoid having to write out strings of zeros when very small volumes of the cryptocurrency are involved.","Dividing bitcoins into fractions is necessary to facilitate microtransactions, such as buying a coffee – though due to the asset’s high volatility it’s not regarded as a suitable medium of exchange. Satoshis have become indispensable since a single bitcoin rose to be worth tens of thousands of dollars. It also means prospective investors can purchase as little as $1 worth of BTC, rather than having to purchase a whole bitcoin.","As bitcoin’s block rewards halve roughly every four years, the new tokens being minted every 10 minutes will at some point be counted in satoshis rather than bitcoin. The minting of new bitcoin will eventually have to stop sometime in the next century because satoshis exist. It will not be possible to continue minting new bitcoin forever in smaller and smaller quantities.","The satoshi is named after bitcoin’s pseudonymous creator, Satoshi Nakamoto. He, she or they have stopped acting under that name since 2010 and left few clues as to who they might be."],"entity":[{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"$1 million","content":"MONEY"},{"type":"tens of thousands of dollars","content":"MONEY"},{"type":"2010","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"one cent","content":"MONEY"}],"hashtag":["Bitcoin","Beginner","Learn"],"authors":["Benedict George"]}