{"summary":"New liquid restaking platforms like Puffer and Ether.Fi have attracted billions of dollars in deposits, but they've birthed a speculative \"points\" frenzy that carries some risks.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/02\/20\/liquid-restaking-tokens-or-lrts-revived-ethereum-defi-can-the-hype-last\/","publishDate":"2024-02-20T12:00:00","id":14830,"type":null,"title":"Liquid Restaking Tokens or 'LRTs' Revived Ethereum DeFi. Can the Hype Last?","category":["Technology"],"content":["Decentralized finance on Ethereum is seeing a big resurgence, with the familiar promise of high yields returning thanks to a new breed of crypto asset: the \"liquid restaking token,\" or LRT.","In the past month alone, billions of dollars have flooded into new Ethereum-based liquid restaking projects like Ether.Fi and Puffer. The upstart platforms are in a heated turf battle to supplant Lido's staked ETH (stETH) token as the asset of choice for decentralized finance (DeFi) traders.","The entire trend pivots off the development of a new protocol named EigenLayer, which launched a first-of-its-kind \"restaking\" system to Ethereum last June. The platform is building a solution to let blockchain apps and networks borrow Ethereum's security system, and it drew more than $1 billion in new deposits in a single 24-hour period this month. Now, the total amount is over $7 billion, meaning the platform has singlehandedly amassed more than 1.5% of all ether (ETH) tokens in circulation, according to DefiLllama.","Restaking offers a way of securing blockchain protocols and networks using security borrowed from Ethereum's proof-of-stake network. ETH deposits in EigenLayer could be \"restaked\" to these other protocols, meaning they won't have to build their own proof-of-stake networks.","Investors have piled into EigenLayer because it promises higher interest on deposits than conventional ETH staking. Still, the platform owes much of its recent growth to a group of third parties – \"liquid restaking protocols\" like Ether.Fi, Puffer and Swell that purport to simplify the restaking process on behalf of users.","These liquid restaking platforms serve as middlemen between users and EigenLayer: The platforms \"restake\" user deposits with EigenLayer, and they hand out newly generated LRTs in exchange – so users can keep trading even if their deposits are being used for restaking.","The LRTs represent a user's EigenLayer deposit, meaning they can accrue staking interest and can be exchanged back for their underlying value. LRTs can also be used in DeFi, meaning people can lend and borrow them to earn even bigger rewards.","Besides the convenience of LRTs, the real draw for liquid restaking platforms recently has been \"points\" – a type of rewards that might entitle users to future token airdrops. While points have nebulous monetary value, they have given rise to an entirely new ecosystem of additional platforms, like Pendle, which let users maximize them through trading strategies that often involve high leverage.","The convoluted point systems, high yields and risky trading strategies all feel a bit reminiscent of 2021 – when \"yield farming\" and the chase for high returns led to a DeFi boom and bust that the sector has yet to recover from. While some experts are wary of liquid restaking's risks, the tech's boosters insist there's real substance beyond the hype.","Liquid restaking builds on two years of growth for Ethereum's staking industry.","Ethereum is operated by more than 900,000 validators – people around the world who lock-up ETH tokens in an address on the network to help keep the chain secure. Staked tokens accrue a steady stream of interest, but they can’t be used for anything else – think: loans or other kinds of investment – once they’re tied up running the network.","This limitation helped fuel the rise of “liquid staking.” Services like Lido, the biggest liquid staking service on Ethereum,” stake tokens on behalf of users and then give them “liquid staking tokens” (LSTs) representing their underlying deposit. LSTs like Lido’s staked ETH (stETH) tokens earn interest like regular staked ether (currently around 3%) but they can also be used in DeFi – meaning investors can lend and borrow the tokens to earn additional yields on top of their staking interest.","The liquid staking sector has boomed over the past couple of years. Lido, the biggest liquid staking protocol by far, boasts more than $25 billion in deposits. Its stETH token frequently sees higher trading volumes than regular ETH on the network’s biggest borrowing and lending protocols.","A similar liquid staking trend is now hitting EigenLayer, the buzzy new Ethereum protocol that introduced restaking to Ethereum.","\"EigenLayer is basically building a tool that allows other networks to bootstrap using Ethereum security,\" explained Omni Labs CEO Austin King, who is building a bridge protocol powered by restaking.","Investors have turned to EigenLayer to earn extra rewards on their ETH: interest for securing Ethereum, and additional restaking interest for securing so-called AVSs or “actively validated services” that use EigenLayer to borrow Ethereum's security.","According to EigenLayer, those AVSs will eventually include Celo, a layer 1 blockchain that's transitioning into an Ethereum-based layer 2 network; EigenDA, EigenLayer's own data availability service; and Omni, which is building bridge infrastructure to help disparate blockchain networks communicate with one another.","But the system also comes with downsides, and a key one is that tokens restaked via EigenLayer can’t be used in DeFi after they’re deposited. For investors looking to maximize their returns, this lock-up mechanic is a major bummer.","Enter liquid restaking, which is essentially just liquid staking but for Eigenlayer.","Liquid restaking protocols accept deposits (e.g. stETH), restake them with EigenLayer, and then hand out “liquid restaking tokens,” or LRTs, like pufETH, eETH and rswETH that can be used in DeFi to earn additional points and other rewards.","\"It's basically the value proposition of staked ETH, where you can get the yield of staking your ETH without having to go through the hassle of setting up a validator – It's that plus the compensation of whatever rewards come out of these AVS networks,\" explained King.","Puffer's pufETH, Ether.Fi's eETH, Swell's rswETH and other LRTs are jostling to compete with Lido's stETH to become the next big asset in DeFi. To do so, they've turned to DeFi's incentive model du jour: points.","Although EigenLayer has already accepted billions in deposits, none of its AVSs are live yet, meaning depositors aren't receiving any interest on their deposits. The main incentive for depositing tokens into EigenLayer today is restaking points, a nebulously-defined tally that investors hope will entitle them to a future, yet-to-be-confirmed EigenLayer airdrop.","\"EigenLayer is not live yet, it doesn't have any restaking.\" Puffer Finance CEO Amir Forouzani noted in an interview last month with CoinDesk. \"Their only incentive now is their points, essentially, and I guess speculation of what those points will become in the future.\" The leading liquid restaking protocols – including Puffer – have all begun offering their own points on top of EigenLayer's as a sweetener for early investors.","New services have also built up around the exchange of points, popularizing risky new trading strategies that involve staking the same tokens repeatedly – levering up one's exposure to a protocol in exchange for higher future rewards.","One such protocol is Pendle, which splits up liquid staking tokens into two separate tokens – yield tokens and principal tokens – to unlock leveraged trading. One of Pendle's products accepts deposits of Ether.Fi's eETH tokens and, according to the site's advertising, can net depositors 45x Ether.Fi points and 15x EigenLayer points.","While points remain highly speculative, they appear to have been a boon for liquid restaking deposits. Ether.Fi, the current market leader, has $1.2 billion in deposits, according to DeFiLlama, five times more than it had a month ago. Puffer Finance is nipping at Ether.Fi’s heels with $970 million in deposits, a ten-fold increase in the past three weeks alone.","As liquid restaking deposits have surged, so have the trend's risks.","On one hand, there’s the general risk with EigenLayer that comes any time money is poured into a Rube Goldberg system of layered protocols: As the web of interconnected AVS networks gets more complicated, bugs will inevitably become more likely.","The biggest risk with these bugs will be the prospect of “slashing,” where a staker is financially penalized for breaking a network's rules or for using faulty software to connect to the network. Liquid restaking protocols frequently feature \"anti-slashing\" features in their marketing, but their promises won't be tested in the wild until AVSs go live.","In the context of EigenLayer restaking, slashing happens on the AVS level: each AVS will set its own slashing rules, and liquid restaking providers will be able to hand-pick which AVS protocols they want to validate for their users. If a liquid restaking platform chooses to validate a network with malicious (or buggy) slashing parameters, it puts its users at risk of having their deposits slashed.","\"We're gonna have a similar reputation system for the broader restaking ecosystem,\" as there is in the conventional staking system, Riad Wahby, CEO of key management service Cubist predicted in an interview with CoinDesk. \"If I'm gonna put money into an operator, I'm presumably going to choose an operator that gives me the right balance between risk and reward.\"","The most obvious risk to liquid restaking is that despite billions of dollars in deposits, the practice is currently highly speculative.","There's a chance that AVSs might fail to reward as much interest to depositors as they expect, which could send investors fleeing the system for more lucrative bets. With all the excitement around points, there's also some possibility that their accompanying airdrops might flop or never happen, rendering the points and the new markets built on top of them all but worthless.","The risk of such an outcome is amplified by the fact that points are not typically issued on blockchains and are tracked instead directly by their issuers. This means it is difficult to know how many points of a given type are in circulation, making it even more difficult to discern their value.","The speculative appeal of liquid restaking points harkens back to the days of yield farming. In 2021-22, as the DeFi sector was in its heyday, deposits flooded into projects like Olympus and Terra, which promised market-leading yields to users in exchange for trust in their convoluted systems. Critics accused the projects of inventing worthless tokens and printing them willy-nilly in a scheme to artificially prop up yield numbers, and those critiques ultimately proved prescient after the platforms collapsed.","Whatever the surface-level similarities, EigenLayer has entered the Ethereum developer zeitgeist in a way yield farming's worst offenders never did, and liquid restaking's proponents say it has the potential to support the development of apps and infrastructure outside of the narrow realm of points and gamified speculation.","Margaux Nijkerk contributed reporting.","Edited by Bradley Keoun."],"entity":[{"type":"Olympus","content":"ORGANIZATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Austin King","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"22","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Amir Forouzani","content":"PERSON"},{"type":"Omni","content":"ORGANIZATION"},{"type":"Puffer","content":"PERSON"},{"type":"$25 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"Rube Goldberg","content":"PERSON"},{"type":"1.5%","content":"PERCENT"},{"type":"DefiLllama","content":"ORGANIZATION"},{"type":"Celo","content":"PERSON"},{"type":"LRT","content":"ORGANIZATION"},{"type":"last June","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"$7 billion","content":"MONEY"},{"type":"Pendle","content":"PERSON"},{"type":"Pendle","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"Margaux Nijkerk","content":"ORGANIZATION"},{"type":"AVS","content":"ORGANIZATION"},{"type":"Riad Wahby","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"},{"type":"Puffer Finance","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"$970 million","content":"MONEY"}],"hashtag":["Features","Staking","Restaking","Staking rewards","EigenLayer"],"authors":["Sam Kessler"]}