{"summary":"Crypto can make it faster and cheaper to pay workers. This article is part of the “Future of Work” series.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/27\/payroll-web3-and-the-62b-opportunity\/","publishDate":"2022-06-27T12:41:52","id":14834,"type":null,"title":"Payroll, Web3 and the $62B Opportunity","category":["Consensus Magazine (layer2)"],"content":["In 2012 when Superstorm Sandy hit New York City, I found myself walking from my apartment in Queens to my office building that had flooded in the Financial District. Even though the city was shut down, I spent the day trying to ensure everyone got paid. That meant typing up wire letters, printing them out, walking to the CFOs office for signatures, faxing them to the bank and then waiting for the bank to call and confirm the amounts.","Even back then, the system was obviously broken – a company should be able to pay its people without requiring its accounting staff to go to such extremes.","Megan Knab is the co-founder and CEO of Franklin, a new crypto-native payroll company. This article is part of \"Future of Work Week.\"","In the 10 years since, so much of our daily workplace technology has transformed, and yet the most basic pieces of payments infrastructure have not kept pace. Cloud computing has largely beat on-premises software. Zoom is now an essential tool for most businesses and workers. The Great Resignation means workers are empowered to dictate their daily habits, including remote work and time off.","The U.S. payroll industry is a $62 billion behemoth, according to IBISWorld, and fit to be disrupted by the emergent and powerful tools enabled by blockchain.","Payroll today is built on top of traditional banking rails, meaning it is rife with inefficiencies, barriers to entry and high cost. An entire ecosystem of payday lenders, overdraft fees and expensive check cashiers has emerged to “support” the payroll industry. These intermediaries cost Americans upwards of $15 billion annually.","See also: It Can't Be 'Decentralization or Bust' | Opinion","Unlike other areas of fintech, payroll innovation has been largely limited to risk shifting. Some payroll companies simply float cash to their corporate customers, facilitating the feeling of “instant” payroll while actually not addressing any of the underlying inefficiencies. While there has been experimentation with prepaid debit cards, mobile payments and digital wallets, there are additional ways companies ought to employ to ease the accessibility of workers’ paychecks.","One of the core building blocks of the future of work must be a digitally native, significantly cheaper payroll infrastructure. It should allow for the meshing of digitally native payment features and legacy medical benefits, retirement accounts and tax requirements.","The new payments stack of Web3 offers the ability to instantly settle transactions – potentially cutting lending costs down almost to zero. A crypto-native stack also has crypto-native innovations:","This oft-overlooked part of fintech, payroll, is one of the fundamental building blocks for the health and wealth of society. In the United States and Canada, we have payroll-based insurance models meaning that healthcare for many is dependent upon employment. Payroll infrastructure and data was an integral part of facilitating COVID stimulus payments.","See also: Not Everyone Can Afford to Be Satoshi | Opinion","It is the mechanism by which our government collects tax revenue, a part of how our justice system levies fines and one of the key motivating factors in workforces. Economists and analysts look to firms like ADP for early data on payroll trends in advance of jobs reports to gauge economic health.","The Web3 industry has been innovating for years on payments and other kinds of wealth creation products. All of that creativity and talent could be lost if the most basic and fundamental business operating activities are not reformed.","While the accounting office of today may not always be as bad as sending faxes during a natural disaster, technological innovation has been tepid. Web3 technologists have so much green space to innovate in and a responsibility to build the applications of tomorrow on solid ground."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Queens","content":"LOCATION"},{"type":"Canada","content":"LOCATION"},{"type":"Financial District","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$62 billion","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"today","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"ADP","content":"ORGANIZATION"},{"type":"Franklin","content":"PERSON"},{"type":"Superstorm Sandy","content":"PERSON"},{"type":"$15 billion","content":"MONEY"},{"type":"Megan Knab","content":"PERSON"},{"type":"United States","content":"LOCATION"}],"hashtag":["Web 3.0","Opinion","Future of Work Week","Jobs"],"authors":["Megan Knab"]}