{"summary":"DCG filed an objection in bankruptcy court to the deal its own subsidiary secured to end the New York attorney general's investigation of fraud and money laundering controls.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/02\/21\/dcg-calls-out-genesis-settlement-with-new-york-as-subversive\/","publishDate":"2024-02-21T22:48:33","id":14831,"type":null,"title":"DCG Calls Out Subsidiary Genesis' Settlement With New York as 'Subversive'","category":["Policy"],"content":["Digital Currency Group (DCG) is objecting to the settlement between the New York attorney general and Genesis – the failed crypto lender that was among DCG's array of digital assets businesses.","The bankrupt Genesis Global struck a deal with the attorney general's office earlier this month to resolve charges that it had defrauded investors, but its parent company contends that it wasn't a proper settlement.","Genesis \"cannot, under the guise of a 'settlement,' take value from lower classes and redistribute it to preferred creditors in violation of absolute priority,\" DCG argued in an objection filed Wednesday in U.S. Bankruptcy Court Southern District of New York – the court that must approve the New York arrangement.","In a further statement from DCG circulated on Wednesday, the company called the deal \"a back-door attempt to circumvent U.S. bankruptcy law,\" characterizing it as a \"subversive arrangement, put together last-minute and in secret.\"","Jason Brown, a former co-chief deputy of the attorney general's office and a former senior federal attorney in New York, backed DCG's objection to the Genesis settlement with the state, asserting in a court filing that the details of the settlement may not have been arrived at properly. \"In any case of this magnitude, I would expect the parties to have engaged in extensive merits-based assessments of the claims prior to finalization of a settlement,\" he argued. \"It is, in my opinion, not in the usual course to forgo such discussions.\"","The attorney general's office didn't immediately respond to a request for comment.","Last month, Genesis also settled a case from the state's Department of Financial Services (DFS), agreeing to pay $8 million and give up its New York BitLicense.","And earlier this month, the DFS amplified its case against DCG and Gemini, saying they were responsible for much more in investors losses – now at $3 billion – than the office first asserted in its fraud lawsuit tied to the defunct Gemini Earn program.","Read More: New York Expands Fraud Case Against Digital Currency Group to $3 Billion","Edited by Nikhilesh De."],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"New York Expands Fraud Case Against Digital Currency Group","content":"ORGANIZATION"},{"type":"DFS","content":"ORGANIZATION"},{"type":"$8 million","content":"MONEY"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Jason Brown","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"U.S. Bankruptcy Court Southern District of New York","content":"ORGANIZATION"},{"type":"$3 Billion","content":"MONEY"},{"type":"Department of Financial Services","content":"ORGANIZATION"},{"type":"Genesis","content":"ORGANIZATION"}],"hashtag":["Regulations","New York Attorney General","Settlement","Fraud","Digital Currency Group","Genesis","Bankruptcy"],"authors":["Jesse Hamilton"]}