{"summary":"U.S. monetary policy, combined with the use of economic sanctions, have forced some countries to look for alternatives to the dollar, while growth of stablecoins may have emphasized the need of the fiat currency, the bank said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/01\/16\/can-crypto-dethrone-us-dollar-dominance-here-is-morgan-stanleys-take\/","publishDate":"2024-01-16T18:25:46","id":14847,"type":null,"title":"Can Crypto Dethrone U.S. Dollar Dominance? Here Is Morgan Stanley's Take","category":["Finance"],"content":["The dominance of the U.S. dollar as the linchpin of the international financial system is being increasingly questioned due to shifting geopolitical currents and the country’s growing twin deficits, Wall Street giant Morgan Stanley (MS) said in a report last week.\n\nEnter cryptocurrencies, which, while still in their early stages, have the potential to both erode and reinforce the dollar’s dominance in global finance, the bank said.\n\n“The recent growth in interest of digital assets such as bitcoin (BTC), growth of stablecoin volumes and the promise of central bank digital currencies (CBDCs), have potential to significantly alter the currency landscape,” wrote Andrew Peel, Morgan Stanley's head of digital asset markets.\n\nU.S. monetary policy, combined with the use of economic sanctions, have forced some countries to look for alternatives to the dollar, Peel said, adding that a “clear shift towards reducing dollar-dependency is evident, simultaneously fueling interest in digital currencies such as bitcoin, stablecoins, and CBDCs.”","On the flip side, he noted that stablecoins pegged to the U.S. dollar are also important as they may actually emphasize the need for the fiat currency. “Their continued evolution and growing acceptance by mainstream financial entities underscore their potential to significantly alter the landscape of global finance and in fact reinforce the dollar as the dominant global currency,” Peel wrote.\n\nHowever, this growing adoption of stablecoins has triggered widespread interest in CBDCs. As these digital currencies become more widely embraced and technologically advanced, “they hold the potential to establish a unified standard for cross-border payments, which could diminish the reliance on intermediaries like SWIFT and the use of dominant currencies such as the dollar,” the report added.\n\nRead more: 2023 Was the Year That Crypto Markets Became Institutionalized: Goldman Sachs","Edited by Aoyon Ashraf.","\n"],"entity":[{"type":"Andrew Peel","content":"PERSON"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Peel","content":"PERSON"},{"type":"Morgan Stanley","content":"ORGANIZATION"}],"hashtag":["Stablecoin","Dollar","Morgan Stanley"],"authors":["Will Canny"]}