{"summary":"Echo, currently in beta, was able to score its users a 50% discount from Ethena&#x27;s last valuation in a private sale.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285807\/first-deal-closes-on-crypto-angel-investing-platform-echo-raising-300000-for-ethena","publishDate":"2024-03-31T16:46:42","id":1484,"type":null,"title":"First deal closes on crypto angel investing platform Echo, raising $300,000 for Ethena","category":["DEALS"],"content":["Echo, the new platform aiming to give aspiring angel investors access to the same deals as larger and more established venture capitalists, is currently operating in an invite-only beta mode.&nbsp;","However, it took only three hours for Echo's users to close its first deal: a $300,000 investment in \"synthetic dollar\" protocol Ethena, according to Ser Shokunin. Furthermore, while a recent private sale reportedly valued Ethena at $600 million in Fully Diluted Value (FDV), deal participants were able to buy in at Ethena's <a href=\"https:\/\/www.theblock.co\/post\/277565\/ethena-usde-stablecoin-funding-valuation-paypal-brevan-howard-others\" data-v-f87c67ca=\"\">previous $300 million valuation<\/a>, minus a 5% carry fee for the Echo platform, according to a source familiar with the matter.&nbsp;&nbsp;","The deal was offered by crypto trader Ser Shokunin, alongside BitMEX co-founder Arthur Hayes, his family office Maelstrom, and VC firm Dragonfly, the source said. As the platform's inaugural deal, the collective is taking no additional management or carry fee, though future Echo deals will likely experiment with different fee structures.&nbsp;","The offer was open to the around 580 investors in Shokunin's group; Echo users are able to create <a href=\"https:\/\/x.com\/TopoGigio_sol\/status\/1774083044175221232?s=20\" data-v-f87c67ca=\"\">invite-only groups<\/a>&nbsp;and restrict deal access to certain members. There are around twenty groups on the platform so far.&nbsp;","The deal's closure comes days ahead of Ethena's latest <a href=\"https:\/\/www.theblock.co\/post\/285212\/ethena-labs-to-airdrop-750-million-ena-tokens-on-april-2\" data-v-f87c67ca=\"\">planned airdrop<\/a> of 750 million ENA tokens, representing 5% of the token's total supply. The airdrop is scheduled to commence on April 2, reflecting activity from users through April 1.&nbsp;","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"April 1","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"April 2","content":"DATE"},{"type":"Ethena","content":"LOCATION"},{"type":"Ethena","content":"ORGANIZATION"},{"type":"Ser Shokunin","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Ser Shokunin","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"$600 million","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"Shokunin","content":"LOCATION"},{"type":"ENA","content":"ORGANIZATION"},{"type":"Dragonfly","content":"ORGANIZATION"},{"type":"$300,000","content":"MONEY"},{"type":"$300 million","content":"MONEY"}],"hashtag":[],"authors":["Zack Abrams","The Block"]}