{"summary":"Enterprise blockchain startup Bloq is launching a new line of services, BloqCloud, to help enterprises access blockchain networks more easily\nAt launch, BloqCloud will allow companies to run nodes and query transactions from BTC, BCH, ETH, and ETC through its platform","author":["Celia Wan","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/35583\/startup-launches-cloud-service-to-facilitate-on-boarding-of-enterprises-to-various-blockchains","publishDate":"2019-08-12T17:48:42","id":1485,"type":null,"title":"Startup launches cloud service to facilitate on-boarding of enterprises to various blockchains","category":["Cloud"],"content":["<span data-v-f87c67ca=\"\">As more companies are flirting with various blockchain solutions, Chicago-based startup Bloq wants to be the middleman between blockchain infrastructure and enterprises to <\/span><span data-v-f87c67ca=\"\">streamline the on-boarding process and push for wider enterprise adoption of blockchain.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The firm is launching a cloud-based blockchain management service, BloqCloud, to offer developers easy access to different blockchain networks. Enterprise customers can run blockchain nodes via the BloqCloud platform and query transaction data from various blockchains. The hope, according to Bloq COO Hadley Stern, is that a smooth, less costly on-boarding process to blockchain networks would encourage more enterprises to enter the space.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“The blockchain products are still being developed, importantly, the protocols these products are being developed under, is still forming right in front of our eyes,” said Stern. “We think bloqCloud is needed now to enable and accelerate blockchain development and adoption by enterprises.”&nbsp;<\/span>","<span data-v-f87c67ca=\"\">According to Stern, who <\/span><a href=\"https:\/\/medium.com\/@hadleystern\/the-tokenization-of-things-and-building-the-unimaginable-929d2b0ff662\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">spearheaded <\/span><\/a><span data-v-f87c67ca=\"\">the establishment of Fidelity’s digital asset arm prior to joining Bloq, multi-chain access is a necessary feature when a company is considering adopting blockchain, as currently \"its too early yet to say there is one protocol that is going to be the only protocol for everything,\" said Stern.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Therefore, BloqCloud provides a blockchain-agonistic solution so that users can access any blockchain through the BloqCloud platform. <\/span><span data-v-f87c67ca=\"\">At launch, BloqCloud will support BTC, BCH, and ETH blockchains, and it is considering adding more in the future, according to Stern. <\/span>","<span data-v-f87c67ca=\"\">As convenient as BloqCloud’s offering sounds, its design as a centralized port for companies to access supposedly decentralized blockchains might trigger further worries. For example, Infura provides a similar service to developers wanting to access Ethereum without having to run a full node, however, there are growing concerns that this centralized layer of access may become <a href=\"https:\/\/www.coindesk.com\/the-race-is-on-to-replace-ethereums-most-centralized-layer\" data-v-f87c67ca=\"\">a single point of failure<\/a> for the entire network.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bloq is betting that managing blockchain infrastructure independently would be more burdensome and less cost-effective for companies that, and as a result, a middleman service like BloqCloud is needed to connect the traditional industry with the new blockchain technology.&nbsp;<\/span>","\"Enterprises are already familiar with these tools: cloud computing, managed services, and so on. Enterprise teams should be able to take the skills they already have and deploy them in the service of new blockchain applications, gaining valuable insight and learning along the way,\" said Bloq CEO Jeff Garzik <a href=\"https:\/\/sync.bloq.com\/cloud-computing-a-step-function-towards-the-decentralized-future\/\" data-v-f87c67ca=\"\">in a blog post<\/a>.&nbsp;","Besides BloqCloud, Bloq also helps support other blockchain infrastructure projects through its BloqLabs division. The company <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2016-02-10\/want-your-own-version-of-bitcoin-hire-this-guy\" data-v-f87c67ca=\"\">debuted in 2016<\/a> by offering a coder-for-hire service to build blockchain software. Founded by early bitcoin developer Jeff Garzik and blockchain investor Matthew Roszak, the firm has raised a total of $4 million from CMT Digital Ventures, Digital Finance Group, Ozman Ventures, and SixThirty.&nbsp;"],"hashtag":[]}