{"summary":"Of the new spot funds, WisdomTree has so far attracted the lowest amount of AUM at roughly $12.8 million.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/05\/wisdomtree-bets-on-advisor-adoption-for-bitcoin-etf-success\/","publishDate":"2024-02-05T19:40:30","id":14854,"type":null,"title":"WisdomTree Bets on Adviser Adoption for Bitcoin ETF Success","category":["Finance"],"content":["WisdomTree, one of the ten issuers of spot bitcoin exchange-traded funds (ETFs), expects its product to be more successful towards the second half of the year thanks to adoption by financial adviser platforms.","Speaking during an interview with CoinDesk TV, WisdomTree’s (WETF) head of digital assets, Will Peck said that the fund manager’s WisdomTree Bitcoin Fund (BTCW) is built for adviser distribution and to this point many of those platforms haven’t yet been allowing the trading of the new products.","“We didn’t have any kind of balance sheet, we didn’t seed with a lot of money or anything like that like some of the other players did,” Peck said. Nevertheless, he said the fund has seen strong trading in the past few days and it’s performing “exactly like we expected it to.”","Out of the ten bitcoin ETFs, WisdomTree's BTCW has attracted the lowest amount of assets under management (AUM), roughly $12.8 million (296 bitcoin), according to Bloomberg Intelligence data. Asset management giant Franklin Templeton has the second lowest AUM with $64.5 million. Leading the way in asset gathering are BlackRock (more than $3B AUM) and Fidelity ($2.7B AUM). Grayscale, who converted its Grayscale Bitcoin Fund (GBTC) into an ETF and therefore came into the race with $30 billion in AUM, has bled about $10 billion of that since ETF trading began on Jan. 11.","Peck, however, is optimistic and encouraged that WisdomTree will be more competitive going forward, saying that it’s still early in the race and that in roughly six months, more advisory platforms will allow trading of the ETFs, giving WisdomTree a competitive advantage over the other issuers.","“I think the platforms are getting increasingly comfortable with bitcoin as an asset class … It's just a matter of time before these are more widely available on platforms where they'll be allowed.”","“We're having very good conversations in the pipeline with financial advisers and financial adviser platforms,” Peck added.","Edited by Stephen Alpher."],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"Peck","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$2.7","content":"MONEY"},{"type":"$10 billion","content":"MONEY"},{"type":"$64.5 million","content":"MONEY"},{"type":"second half of the year","content":"DATE"},{"type":"Jan. 11","content":"DATE"},{"type":"AUM","content":"ORGANIZATION"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"$3B","content":"MONEY"},{"type":"$12.8 million","content":"MONEY"},{"type":"Will Peck","content":"PERSON"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Bitcoin ETF","WisdomTree"],"authors":["Helene Braun"]}