{"summary":"Fourth quarter EBITDA was $99 million versus a loss of $7 million a year earlier.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/12\/digital-currency-group-reports-q4-revenue-of-210m-up-59-yy-full-text\/","publishDate":"2024-02-12T14:52:35","id":14853,"type":null,"title":"Digital Currency Group Reports Q4 Revenue of $210M, Up 59% Y\/Y (Full Text)","category":["Finance"],"content":["Digital Currency Group (DCG) in a letter to investors Monday morning reported results for the fourth quarter and fiscal 2023. Full text follows.","Dear Shareholders,","We are pleased to share our Q4 2023 Investor Report, which includes details regarding DCG’s financial performance and notable business developments. With a rally in crypto asset prices that kicked off this year alongside significant milestones reached, including DCG’s repayment of more than $1 billion of debt, and Grayscale’s GBTC beginning to trade as an ETF on NYSE Arca, we're looking ahead to this next chapter for DCG and the future growth of our industry.","As always, we ask that you please keep all contents of this email and Investor Report strictly confidential and do not share with your fund LPs or other unauthorized recipients.","Q4 2023 Financial Summary (excluding Genesis’ performance)","Crypto asset prices continued to rise and reached annual highs of ~$45K in the fourth quarter, with average BTC price of ~$37K in Q4 up 29% from ~$28K in Q3.","DCG Q4 2023 consolidated revenues were $210 million, up 12% quarter-over-quarter primarily due to higher asset prices, which drove $156 million of revenues at Grayscale (up 24% quarterover-quarter) and $38 million of revenues at Foundry (down 22% quarter-over-quarter given lower mining revenues). On a year-over-year basis, DCG Q4 2023 revenues were up ~59% vs. $132 million in Q4 2022. Q4 2023 average BTC price was up ~101% compared to ~$18K in Q4 2022.","Q4 2023 EBITDA was $99 million, up 41% quarter-over-quarter, and up from an EBITDA loss of $7 million in Q4 2022.","FY 2023 Financial Summary (excluding Genesis’ performance)","For the 2023 fiscal year, DCG’s consolidated revenues were $749 million with EBITDA of $275 million. Revenues finished slightly down compared to $813 million in FY 2022, while EBITDA improved from $261 million for the same period as less profitable businesses were sold or wound down, representing a year-over-year margin improvement of 463 basis points.","As of December 31, 2023, DCG’s investment portfolio (including tokens, Grayscale trust shares, venture \/ fund investments, and public equities) was marked at ~$975 million.","Annual 409A Independent Valuation","At the end of each year, we provide an annual 409A independent valuation of DCG’s stock. Consistent with previous years, DCG engaged Anvil Advisors for this purpose. The resulting valuation of DCG common equity as of December 31, 2023 is $4.4 billion, or a price per share of $55.87. This represents a 102% increase from the $2.2 billion valuation as of December 31, 2022.","Key Business Updates","Genesis Creditor Negotiations","On November 28, 2023, DCG & Genesis filed an amendment to the Partial Repayment Agreement (PRA), which was approved by the bankruptcy court on December 21, 2023. This agreement provided significant operating flexibility and the ability to transfer certain Grayscale trust shares held to pay down debt principal.","Further, as disclosed in early January, we made a final payment to complete the payoff of all short-term loans from Genesis. In total, DCG has paid off more than $1 billion of debt to its creditors in just over a year, including nearly $700 million to Genesis, satisfying all obligations currently due.","Last week, DCG filed its objection to the amended Genesis bankruptcy plan. For over a year, DCG has worked around the clock to propose a variety of options, including deal structures that would have allowed Genesis creditors to benefit from an increase in equity value at DCG and Genesis, that the creditor committees agreed to and then reneged on. We have stated that DCG would support a plan that pays creditors a 100% recovery; however the proposed plan – developed without input from DCG – violates United States bankruptcy law and favors a small controlling group of creditors over others. DCG cannot support a plan that is unlawful and deprives DCG of its corporate governance rights.","New York Attorney General Update","Last week, New York Attorney General Letitia James amended her civil lawsuit complaint against Gemini, Genesis, DCG and individuals, originally filed on October 19, 2023, which broadens the lawsuit to include all Genesis creditors as victims and seeks more than $3 billion in restitution. It is important to note that this figure represents the total claims pool in the Genesis bankruptcy and we expect creditors to be paid back in full on the value of their claims.","In addition, there is nothing new here. This is the same baseless complaint recirculated to generate another round of press headlines. DCG has always conducted its business lawfully and with integrity.","The updated complaint follows Genesis filing a proposed settlement with the NYAG that would effectively give the NYAG all residual value in the Genesis estate after creditors are paid. Similar to the amended bankruptcy plan, Genesis devised this proposed settlement without notice to DCG to circumvent bankruptcy law and allow creditors to get paid more than the legally-allowed value of their claims. We will continue to fight this attempt to undermine the law.","Grayscale Spot Bitcoin ETF Approval","In a historic moment for our industry, on January 10, 2024, Grayscale received approval from the U.S. Securities and Exchange Commission to uplist GBTC to NYSE Arca as a spot Bitcoin ETF. GBTC commenced trading on NYSE Arca the following day.","Since launching in 2013 as the first Bitcoin fund in the United States, GBTC has amassed nearly one million investors and more than $22 billion* in AUM, with hundreds of millions of dollars in daily trading volume. Following Grayscale’s landmark court victory last year, the approval of spot Bitcoin ETFs in the United States represents a monumental shift toward mainstream adoption of digital currencies.","CoinDesk Sale","On November 20, 2023, we announced the sale of CoinDesk to Bullish, the institutional digital assets exchange led by Tom Farley. DCG acquired CoinDesk in 2016 with the belief that the crypto industry needed a leading independent media company. We are proud to have supported its transformation into an award-winning media and events company and the most trusted information platform for digital assets.","Thank you for your ongoing support.","Best, DCG Investor Relations"],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"November 28, 2023","content":"DATE"},{"type":"22%","content":"PERCENT"},{"type":"New York Attorney General Update","content":"ORGANIZATION"},{"type":"102%","content":"PERCENT"},{"type":"$37K","content":"MONEY"},{"type":"$99 million","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"AUM","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$45K","content":"MONEY"},{"type":"DCG Investor Relations","content":"ORGANIZATION"},{"type":"59%","content":"PERCENT"},{"type":"December 31, 2023","content":"DATE"},{"type":"December 31, 2022","content":"DATE"},{"type":"$975 million","content":"MONEY"},{"type":"October 19, 2023","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$156 million","content":"MONEY"},{"type":"$275 million","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$261 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"41%","content":"PERCENT"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"$28K","content":"MONEY"},{"type":"$813 million","content":"MONEY"},{"type":"$132 million","content":"MONEY"},{"type":"DCG & Genesis","content":"ORGANIZATION"},{"type":"NYSE Arca","content":"ORGANIZATION"},{"type":"Gemini","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Tom Farley","content":"PERSON"},{"type":"January 10, 2024","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"$2.2 billion","content":"MONEY"},{"type":"2013","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"November 20, 2023","content":"DATE"},{"type":"29%","content":"PERCENT"},{"type":"100%","content":"PERCENT"},{"type":"$38 million","content":"MONEY"},{"type":"fourth quarter","content":"DATE"},{"type":"$700 million","content":"MONEY"},{"type":"United States","content":"LOCATION"},{"type":"$22 billion","content":"MONEY"},{"type":"$55.87","content":"MONEY"},{"type":"$749 million","content":"MONEY"},{"type":"December 21, 2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"101%","content":"PERCENT"},{"type":"$210 million","content":"MONEY"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"FY 2022","content":"DATE"},{"type":"morning","content":"TIME"},{"type":"24%","content":"PERCENT"},{"type":"$18K","content":"MONEY"},{"type":"PRA","content":"ORGANIZATION"},{"type":"$4.4 billion","content":"MONEY"}],"hashtag":["Digital Currency Group","DCG"],"authors":["Stephen Alpher"]}