{"summary":"By adopting a more open, fluid model, traditional firms would find it easier to attract talent and end up with a more passionate, engaged workforce.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/27\/youre-hiring-wrong-do-it-more-like-web3\/","publishDate":"2022-06-27T12:40:24","id":14856,"type":null,"title":"You’re Hiring Wrong: Do It More Like Web3","category":["Consensus Magazine (layer2)"],"content":["PSA to traditional hiring managers: You’re doing it wrong.","Over the last two years, a movement has emerged in Web3 that is turning the status quo talent acquisition process on its head – and creating a more constructive method for attracting and retaining talent.","Decentralized autonomous organizations (DAOs) have paved the way for this paradigm shift, offering an inverse approach to the current process that many professionals have experienced on their journey to employment.","Avi Meyers is the director of governance and partnerships at Flipside Crypto, a blockchain analytics firm. This article is part of CoinDesk’s Future of Work Week.","Most businesses hire by inclusion via exclusion. They interview a bunch of candidates in a formal setting, exclude most of them and include the winners.","DAOs actualize the opposite: exclusion via inclusion – create an open environment, incentivize behaviors, reward top contributors.","While simultaneously building teams for Flipside Crypto and MetricsDAO, I became aware of the stark differences between these two methods – but also the merits of each.","See also: Pussy Riot, Political Action and the Future of DAOs | Opinion","And by reflecting on my own experiences, I’ve been able to identify a few easy steps that hiring managers can take to blend the best of both worlds. To explain, let’s first travel back to 2009.","Like many college graduates looking for employment during the Great Recession, I began frequenting job fairs in the Boston area. On one fateful evening, I wandered into a dreary downtown hotel for a financial technology job fair.","Going in I had zero expectations, and maybe that’s why two weeks and 10 grueling interviews later, I got my first job offer.","My skill set definitely did not fit the role. The interview process was generic and the firm’s approach to hiring was narrowed to a few select schools with candidates of a certain pedigree. This meant the company was forcing a target persona onto candidates who were then forced to fit the mold. The recruiters weren’t much interested in exploring an individual’s diverse talents.","Unfortunately, my experience in the hiring process is quite common and causes a lot of young hopefuls to land jobs where they don’t belong. It’s not the people who are the problem, it’s the foundational process:","Inclusion via exclusion.","That is the way traditional companies find talent: exclude most, include the winners.","They evaluate on a finite set of criteria, assess abilities through a formal and confining process, and develop a set of assumptions about the candidate based on collective feedback from the hiring team.","Sure, it works, but could it be better? Of course it can.","So what does better look like? First, some perspective.","In 2018, I made the leap full time into what is now called Web3, joining Flipside Crypto. Our business model took off at the intersection of data analytics and Web3 community growth, and after fostering a community of over 12,000 data analysts, we began contributing to and incubating DAOs as part of our core objectives.","MetricsDAO was the first one we bootstrapped. Incubating it meant rolling up our sleeves, building teams (referred to as pods), and growing a brand new type of organization from zero to one. The amazing thing about DAOs is how porous and fluid they are. Contributors come and go as they please, following their passions and delivering meaningful work to the organization when they feel like it.","Read More: What Is Web 3 and Why Is Everyone Talking About It?","As DAOs scale, the team must produce incentives to keep core contributors involved. These incentives come in the form of compensation (monetary or otherwise), privileges (like gated access) and leadership opportunities. In other words, through a free-flowing, inclusive model, talent is identified and rises to the top.","In this sense, DAOs are creating a talent pipeline and selection process opposite that of traditional businesses. It is more open, exploratory, creative, and natural. It is:","Exclusion via inclusion.","And yet, DAOs are beginning to integrate certain aspects of the traditional hiring process. For example, infrastructure providers, such as Wonderverse, Drepute and GitPOAP, are competing to build tools that could be used as Web3 “resumes,” where DAO contributors can track their contributions and experiences. Unlike traditional resumes, which require the hiring manager to trust what’s written on the paper (or verify it themselves), the new versions will display non-fungible or proof-of-attendance protocol tokens (NFTs or POAPs) attesting to past work and verifiable on-chain. This model also consolidates inherently diffuse DAO work into a single attributable form, making it easier for DAO leaders to assess a contributor's relevant experience. New builders emerge in this field daily.","See also: DAOs and the Coming InDAOstrial Revolution | Opinion","On the other hand, traditional businesses have yet to adopt any strategies of the DAO talent acquisition funnel in a meaningful way – much to their own detriment. By integrating a more open, fluid model, traditional companies would find it easier to attract the right talent for open roles by allowing candidates to explore more freely, and ultimately end up with a more passionate and engaged workforce.","With that in mind, here are three easy steps that hiring managers can follow today to become more like Web3:","In the end, if you’re going to have to exclude people, at least do it by including them first.","There is a boom in crypto jobs, but do you need to be \"crypto-native\" to qualify? Here’s how to land a job in crypto."],"entity":[{"type":"Wonderverse","content":"LOCATION"},{"type":"Avi Meyers","content":"PERSON"},{"type":"Boston","content":"LOCATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"CoinDesk’s Future of Work Week","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"last two years","content":"DATE"},{"type":"Flipside Crypto","content":"ORGANIZATION"},{"type":"Pussy Riot","content":"ORGANIZATION"},{"type":"Political Action","content":"ORGANIZATION"},{"type":"2009","content":"DATE"}],"hashtag":["Web 3.0","DAO","Opinion","Future of Work Week","Jobs"],"authors":["Avi Meyers"]}