{"summary":"ARK sold $34.3 million of shares in the crypto exchange, which is due to report earnings after the U.S. market closes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/15\/cathie-woods-ark-invest-sells-coinbase-shares-for-first-time-in-a-month\/","publishDate":"2024-02-15T08:55:19","id":14859,"type":null,"title":"Cathie Wood's ARK Invest Sells Coinbase Shares for First Time in a Month","category":["Markets"],"content":["ARK Invest, the Cathie Wood-run investment vehicle, sold Coinbase (COIN) stock for the first time in a month on Wednesday, a day before the crypto exchange was due to report fourth-quarter earnings.","ARK sold $34.3 million worth of shares from three different funds, according to an emailed daily trading report. The last time it reported selling the stock was Jan. 11.","Coinbase, the only U.S.-listed crypto exchange, has climbed 19% since then, including a 14% jump yesterday that took the share price to $160.38 as bitcoin (BTC), the largest cryptocurrency by market cap, climbed through $52,000. The Nasdaq Composite stock index gained 5.9% in the same period.","The exchange is expected to post stronger earnings and revenue when it reports results after the market closes today, fueled by increased trading volume as the crypto market rallied. Robinhood, a trading platform that also covers crypto, reported a 10% increase in crypto revenue in the quarter.","The investment firm sold 30,009 shares from its Fintech Innovation ETF (ARKF), 152,600 from the Innovation ETF (ARKK) and 31,459 from the Next Generation Internet ETF (ARKW).","Edited by Parikshit Mishra."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"5.9%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$34.3 million","content":"MONEY"},{"type":"Jan. 11","content":"DATE"},{"type":"$52,000","content":"MONEY"},{"type":"Cathie Wood","content":"PERSON"},{"type":"19%","content":"PERCENT"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"Nasdaq Composite","content":"ORGANIZATION"},{"type":"$160.38","content":"MONEY"},{"type":"the quarter","content":"DATE"}],"hashtag":["Coinbase","ARK Invest"],"authors":["Sheldon Reback"]}