{"summary":"Decentralized finance (DeFi) applications aim to cut out the middlemen of our everyday finances.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-defi\/","publishDate":"2022-05-24T13:59:12","id":14850,"type":null,"title":"What Is DeFi?","category":["Learn"],"content":["DeFi is short for “decentralized finance,” an umbrella term for a variety of financial applications in cryptocurrency or blockchain geared toward disrupting financial intermediaries.","DeFi draws inspiration from blockchain, the technology behind the digital currency bitcoin, which allows several entities to hold a copy of a history of transactions, meaning it isn’t controlled by a single, central source. That’s important because centralized systems and human gatekeepers can limit the speed and sophistication of transactions while offering users less direct control over their money. DeFi is distinct because it expands the use of blockchain from simple value transfer to more complex financial use cases.","Read more: What Is a Decentralized Application?","Bitcoin and many other digital-native assets stand out from legacy digital payment methods, such as those run by Visa and PayPal, in that they remove all middlemen from transactions. When you pay with a credit card for coffee at a cafe, a financial institution sits between you and the business, with control over the transaction, retaining the authority to stop or pause it and record it in its private ledger. With cryptocurrency, those institutions are cut out of the picture.","Direct purchases aren’t the only type of transaction or contract overseen by big companies; financial applications such as loans, insurance, crowdfunding, derivatives, betting and more are also in their control. Cutting out middlemen from all kinds of transactions is one of the primary advantages of decentralized finance.","Before it was commonly known as decentralized finance, the idea of DeFi was often called \"open finance.\"","Most decentralized finance applications are built on top of Ethereum, the world’s second-largest cryptocurrency platform, which sets itself apart from the Bitcoin platform in that it’s easier to use to build other types of decentralized applications beyond simple transactions. These more complex financial use cases were even highlighted by Ethereum creator Vitalik Buterin back in 2013 in the original Ethereum white paper.","That’s because of Ethereum’s platform for smart contracts – which automatically execute transactions if certain conditions are met – offers much more flexibility. Ethereum programming languages, such as Solidity, are specifically designed for creating and deploying such smart contracts.","For example, say a user wants his or her money to be sent to a friend next Tuesday, but only if the temperature climbs above 90 degrees Fahrenheit according to weather.com. Such rules can be written in a smart contract.","With smart contracts at the core, dozens of DeFi applications are operating on Ethereum, some of which are explored below. Ethereum 2.0, a coming upgrade to Ethereum’s underlying network, could give these apps a boost by chipping away at Ethereum’s scalability issues.","The most popular types of DeFi applications include:","Read more: Centralized Exchange (CEX) vs. Decentralized Exchange (DEX): What’s the Difference?","In addition to these apps, new DeFi concepts have sprung up around them:","Lending markets are one popular form of decentralized finance, which connects borrowers to lenders of cryptocurrencies. One popular platform, Compound, allows users to borrow cryptocurrencies or offer their own loans. Users can make money off of interest for lending out their money. Compound sets the interest rates algorithmically, so if there's higher demand to borrow a cryptocurrency, the interest rates will be pushed higher.","DeFi lending is collateral-based, meaning in order to take out a loan, a user needs to put up collateral – often ether, the token that powers Ethereum. That means users don't give out their identity or associated credit score to take out a loan, which is how normal, non-DeFi loans operate.","Another form of DeFi is the stablecoin. Cryptocurrencies often experience sharper price fluctuations than fiat, which isn't a good quality for people who want to know how much their money will be worth a week from now. Stablecoins peg cryptocurrencies to non-cryptocurrencies, such as the U.S. dollar, in order to keep the price under control. As the name implies, stablecoins aim to bring price \"stability.\"","Notable stablecoins include:","One of the oldest DeFi applications living on Ethereum is a so-called \"prediction market,\" where users bet on the outcome of some event, such as \"Will Donald Trump win the 2020 presidential election?\"","The goal of the participants is, obviously, to make money, though prediction markets can sometimes better predict outcomes than conventional methods, like polling. Centralized prediction markets with good track records in this regard include Intrade and PredictIt. DeFi has the potential to boost interest in prediction markets, since they are traditionally frowned upon by governments and often shut down when run in a centralized manner.","The value locked up in Ethereum DeFi projects has been exploding, with many users reportedly making a lot of money.","Using Ethereum-based lending apps, as mentioned above, users can generate \"passive income\" by loaning out their money and generating interest from the loans. Yield farming, described above, has the potential for even larger returns, but with larger risk. It allows for users to leverage the lending aspect of DeFi to put their crypto assets to work generating the best possible returns. However, these systems tend to be complex and often lack transparency.","No, it's risky. Many believe DeFi is the future of finance and that investing in the disruptive technology early could lead to massive gains.","But it's difficult for newcomers to separate the good projects from the bad. And, there has been plenty of bad.","As decentralized finance has increased in activity and popularity through 2020, many DeFi applications, such as meme coin YAM, have crashed and burned, sending the market capitalization from $60 million to $0 in 35 minutes. Other DeFi projects, including Hotdog and Pizza, faced the same fate, and many investors lost a lot of money.","In addition, DeFi bugs are unfortunately still very common. Smart contracts are powerful, but they can't be changed once the rules are baked into the protocol, which often makes bugs permanent and thus increasing risk.","While more and more people are being drawn to these DeFi applications, it's hard to say where they’ll go. Much of that depends on who finds them useful and why. Many believe various DeFi projects have the potential to become the next Robinhood, drawing in hordes of new users by making financial applications more inclusive and open to those who don't traditionally have access to such platforms.","This financial technology is new, experimental and isn't without problems, especially with regard to security or scalability.","Developers hope to eventually rectify these problems. Ethereum 2.0 could tackle scalability concerns through a concept known as sharding, a way of splitting the underlying database into smaller pieces that are more manageable for individual users to run.","Ethereum 2.0 isn't a panacea for all of DeFi’s issues, but it's a start. Other protocols such as Raiden and TrueBit are also in the works to further tackle Ethereum's scalability issues.","If and when these solutions fall into place, Ethereum's DeFi experiments will have an even better chance of becoming real products, potentially even going mainstream.","While Ethereum is top dog in the decentralized finance world, many proponents of Bitcoin share the goal of cutting the middleman out of more complex financial transactions, and they’ve developed ways to do so using the Bitcoin protocol.","Companies such as DG Labs and Suredbits, for instance, are working on a Bitcoin DeFi technology called discreet log contracts (DLC). DLC offers a way to execute more complex financial contracts, such as derivatives, with the help of Bitcoin. One use case of DLC is to pay out bitcoin to someone only if certain future conditions are met, say, if the Chicago White Sox team win its next baseball game, the money will be dispensed to the winner.","Whenever navigating any unregulated space, it’s crucially important to be aware of the risks.","If the terms “yield farming,” “DeFi” and “liquidity mining” and are all Greek to you, fear not. We’re here to catch you up.","When it comes to DeFi investing, knowledge really is power. A big part of this comes from reliable data that can often be hard to find."],"entity":[{"type":"weather.com","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$0","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"DEX","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$60 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Intrade","content":"LOCATION"},{"type":"DG Labs","content":"ORGANIZATION"},{"type":"DLC","content":"ORGANIZATION"},{"type":"Chicago White Sox","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["DeFi","Beginner","Learn"],"authors":["Alyssa Hertig"]}