{"summary":"Aya Kantorovich, FalconX’s head of institutional coverage, announced her departure from the firm on Thursday.","author":["Frank Chaparro","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/175316\/falconxs-head-of-institutional-coverage-announces-departure","publishDate":"2022-10-06T12:09:58","id":1486,"type":null,"title":"FalconX&#x27;s head of institutional coverage announces departure","category":["Capital Markets"],"content":["The head of institutional coverage at crypto financial services firm FalconX announced Thursday her departure from the firm—the latest executive to leave their post in the digital asset market amidst the slump in price.&nbsp;","Aya Kantorovich in many ways served as FalconX's face to Wall Street and the <a href=\"https:\/\/www.theblock.co\/post\/107103\/falconx-aya-kantorovich-explains-bitcoin-volatility\" data-v-f87c67ca=\"\">media<\/a> as head of institutional coverage at the firm.","\"I have full confidence that FalconX is on a rocketship to drive institutional adoption into digital assets and will continue to cheer the team on evermore,\" she <a href=\"https:\/\/www.linkedin.com\/posts\/ayakantorovich_friendslast-friday-marked-my-final-day-activity-6983819513033039872-1e-P\/?utm_source=share&amp;utm_medium=member_desktop\" data-v-f87c67ca=\"\">wrote on LinkedIn<\/a>. \"What I will remember most fondly are the incredible people at FalconX and I am excited for what you all can achieve together.\"","\"It has been a blast so far, and we are only just beginning,\" she added.&nbsp;","She is part of a broader wave of early employees and senior executives that have parted ways with their firms in recent months, including president <a href=\"https:\/\/www.theblock.co\/post\/172744\/ftx-us-president-harrison-is-stepping-down\" data-v-f87c67ca=\"\">Brett Harrison<\/a> who led FTX.US as president and Genesis Global Trading's former CEO <a href=\"https:\/\/www.theblock.co\/post\/164014\/genesis-ceo-michael-moro-steps-down-from-role-effective-immediately\" data-v-f87c67ca=\"\">Michael Moro<\/a>.&nbsp;","Kantorovich, who joined FalconX in 2019, previously held roles at crypto investment firm Pantera Capital as well as Tegus, the buy-side investor research platform, according to her <a href=\"https:\/\/www.linkedin.com\/in\/ayakantorovich\/\" data-v-f87c67ca=\"\">LinkedIn<\/a>.&nbsp;","FalconX is among the various firms vying for market share in crypto trade execution and credit, offering institutional investors financing to make big bets.&nbsp;","In June, the firm raised $150 million in <a href=\"https:\/\/www.reuters.com\/business\/crypto-platform-falconx-valued-8-bln-new-funding-round-2022-06-22\/\" data-v-f87c67ca=\"\">new funding<\/a> in a round that valued the company at $8 billion, with backing from Singapore's sovereign wealth fund GIC and B Capital. At the time of the raise, the firm's CEO Raghu Yarlagadda told Reuters he expected to increase his workforce by 30% in the coming months.&nbsp;"],"hashtag":["CRYPTO"]}