{"summary":"The trend shows how some savvy crypto traders have pivoted to salvage or maintain returns even as bitcoin's price tumbled.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/06\/15\/hunt-for-yield-wrapped-btc-now-holds-more-than-1-of-bitcoins-circulating-supply\/","publishDate":"2021-06-15T16:45:17","id":14872,"type":null,"title":"Hunt for Yield: Wrapped BTC Now Holds More Than 1% of Bitcoin's Circulating Supply","category":["Markets"],"content":["","With bitcoin prices retreating over the past month, crypto traders have increasingly tokenized the cryptocurrency into synthetic versions compatible with the Ethereum blockchain, where they can be deposited for extra yield.","","","The number of bitcoins locked on the Ethereum blockchain via wrapped bitcoin, a decentralized finance (DeFi) protocol leveraged to convert BTC to ERC-20 tokens, has increased to a record 189,000 BTC, according to Arcane Research's weekly note published Tuesday. The tally has increased fourfold in the past 12 months to a record 1% of bitcoin's circulating supply of 18.73 million.","","","The trend shows how some savvy crypto traders have pivoted to salvage or maintain returns even as bitcoin's price tumbled by 35% last month.","","","\"Lackluster performance by bitcoin and growing interest in Ethereum-based exchange-traded products did little to derail the long-lasting trend of locking bitcoin on the Ethereum network,\" Denis Vinokourov, head of research at Synergia Capital, told CoinDesk. \"It shows the hunt-for-yield trade is nowhere near the exhaustion mark and also underlines the growing comfort, as well as a sense of security, that wrapping bitcoin is a safe method in earning yield on assets, be that by retail or more professional market participants.\"","","","Each wrapped bitcoin token is backed by one bitcoin, so theoretically prices for the tokens should be roughly equivalent. The protocol essentially allows bitcoin holders to tokenize (lock) their coins on Ethereum for an equivalent number of WBTC tokens, which can be put to work on the DeFi platforms.","","","\"The motivation of tokenizing bitcoin on Ethereum is to enable functionality that is not natively supported on the Bitcoin blockchain, such as compatibility with the Ethereum DeFi ecosystem,\" Arcane Research noted.","","","WBTC holders often lent these tokens to DeFi protocols in return for market-determined interest rates. For example, the DeFi giant Aave currently pays an APY of 1.21% on WBTC deposits. These WBTC tokens are also dedicated as collateral for securing crypto-backed loans, used to generate \"yield farming\" revenue or posted as margin on decentralized derivative exchanges.","","","Holders have also been tokenizing bitcoin through other venues like Huobi BTC (HBTC), renBTC. However, WBTC leads the pack by a big margin.","","","Also read: 3 Things to Watch for Before Calling a Bitcoin Bottom","","","\"In total, 240,000 BTC has now been tokenized into Ethereum protocols,\" Arcane Research said. \"WBTC remains the most popular option for tokenized BTC and accounts for 80% of all the BTC at work in Ethereum.\"",""],"entity":[{"type":"80%","content":"PERCENT"},{"type":"Denis Vinokourov","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Arcane Research","content":"ORGANIZATION"},{"type":"Synergia Capital","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bitcoin Bottom","content":"ORGANIZATION"},{"type":"Ethereum blockchain","content":"PERSON"},{"type":"Huobi BTC","content":"ORGANIZATION"},{"type":"Watch for Before Calling","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"35%","content":"PERCENT"},{"type":"1.21%","content":"PERCENT"},{"type":"1%","content":"PERCENT"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Bitcoin","Tokenized Bitcoin"],"authors":["Omkar Godbole"]}