{"summary":"If the SEC is serious about U.S. investor protection, it should want crypto to stay in the United States, says CoinDesk's Emily Parker.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/02\/lack-of-regulatory-clarity-puts-crypto-in-the-united-states-at-risk\/","publishDate":"2023-03-02T18:58:48","id":14873,"type":null,"title":"Keep Crypto in America","category":["Consensus Magazine"],"content":["The Securities and Exchange Commission has been cracking down on crypto, setting off warning bells in the U.S. One fear is that regulatory uncertainty will push crypto industry players to avoid doing business in the country. There are some signs that this isn't mere alarmism.","Crypto lender Nexo announced late last year that it was leaving the U.S. after more than 18 months of “good-faith dialogue with U.S. state and federal regulators” came to a “dead end.” Jeff Dorman, chief investment officer at Arca, told Bloomberg that the new companies that his firm is exploring are “not even bothering with the U.S..” Binance, which is the world's largest crypto exchange by trading volume, is reportedly looking to end some relationships with U.S. business partners and is taking another look at its U.S. venture-capital investments.","Emily Parker is CoinDesk's executive director of global content.","“I have been advising a number of projects to ‘bubble off’ the United States – don't sell tokens to U.S. users, don't allow U.S. users to access the site or take advantage of (all of) its functionality, don't market in the US, etc.,” Jason Gottlieb, partner and chairman of the digital-assets department at law firm Morrison Cohen LLP, told me.","“I can tell you from firsthand experience, as a crypto founder myself, every single lawyer we have met with has advised us against considering the U.S. due to the regulatory uncertainty,” Boyd Cohen, CEO and co-founder of video-game developer Iomob, recently wrote for CoinDesk.","“There is no jurisdiction in the U.S. that would make sense for us to consider,” concluded Cohen, who is an American himself.","It’s not clear if top regulators are concerned about this, but they should be. Because even if much of the crypto industry left the U.S., crypto won’t. According to a new survey of U.S. adults by crypto exchange Coinbase, 20% of Americans own crypto. Even if this number isn't completely accurate, it’s clear that crypto is something that U.S. regulators can’t ignore.","Read more: Jesse Hamilton - SEC’s Shadow Crypto Rule Taking Shape as Enforcement Cases Mount","As long as crypto continues to exist, ordinary Americans will find ways to buy and trade it, venture capitalists will invest in it, and entrepreneurs will build projects around it. If the U.S. can’t get its act together, domestic crypto projects will just operate in a gray area, and Americans will turn to offshore entities with potentially weaker safeguards. In other words, if the SEC is serious about U.S. investor protection, it would make more sense to keep crypto businesses at home.","The problem isn't that the SEC is too strict; it’s that it’s too confusing. Crypto advocates have long argued that the SEC punishes select projects through regulation by enforcement instead of laying out clear rules and guidelines. As a result, bad actors can slip through the cracks while those who want to play by the rules don’t have a clear path to do so. It’s not just the SEC. Industry insiders have described the situation in Washington as a “crackdown” or “Operation Choke Point 2.0.”","There has been too much regulatory activity to sum up briefly here, but among the more controversial moves were a pending SEC lawsuit against Paxos on its BUSD stablecoin and its shutting down of crypto exchange Kraken’s staking program. The case of BUSD left many wondering why that stablecoin was targeted instead of others, and how exactly a stablecoin would be deemed a security.","As for Kraken, a big part of the problem was the SEC’s approach. In her dissent, SEC Commissioner Hester Peirce wrote that it would have been better to have issued prior guidance on staking rather than communicating through an enforcement action. Pierce went as far as to suggest that the SEC was acting in the manner of “a paternalistic and lazy regulator.”","Given that the cryptocurrency industry is global in nature, projects have plenty of other options outside the United States. Countries that appear to be friendly or at least relatively clear on crypto are more likely to attract talent. Dubai has just unveiled a new crypto regulatory framework. Singapore’s relative clarity and crypto friendliness has long been a draw for Web3 projects. Now, we also have Hong Kong seeking to establish itself as a Web3 hub of Asia, if not the world. Japan is also embracing crypto.","Read more: David Z. Morris - Is the SEC Really the Bad Guy?","These developments give reason to believe that the next bull run might well come from Asia. At the same time, we are seeing crypto exchanges set up shop in Europe, which will soon have an extensive regulatory framework for crypto assets.","It’s worth noting that it isn't particularly easy to do crypto business in places like Hong Kong or Japan. Both have strict standards for crypto exchanges and the tokens listed on them. What these two jurisdictions offer are relative clarity on rules and expectations for projects that wish to operate there.","The problem with the U.S. is that even projects that want to play by the rules find it difficult to do so, because the U.S. hasn’t quite decided how to regulate crypto. Shortly after the Kraken decision, SEC Chairman Gary Gensler stoked the flames of crypto Twitter by saying the following on CNBC: “Kraken knew how to register. Others know how to register, it’s just a form on our website. They can come in, talk to our talented people and disclosure review teams.”","That comment was swiftly mocked by Kraken co-founder and CEO Jesse Powell, who tweeted, “Wish I'd seen this video before paying a $30m fine and agreeing to permanently shut down the service in the U.S..”","As my colleague Nik De reported, Gensler’s statement was undercut by another SEC official, who referred to a “whole process” in addition to the aforementioned website.","Others also took issue with Gensler’s comment, saying that crypto projects couldn’t register even if they wanted to. “Tons of projects (and their lawyers!) desperately *want* to come in and register. But when they do, they’re just told “no.’” Gottlieb of Morrison Cohen wrote on Twitter.","“There is simply no path to registration for many crypto products. The SEC says 'just register,' \" Gottlieb continued. “We say ‘cool but … as what?’ Because the regs just don’t fit. In response, we get blank stares, apologies, and mumbles that they’re not going to give us legal advice.”","Rebecca Rettig, chief policy officer of Polygon Labs, echoed that sentiment on Laura Shin’s \"Unchained\" podcast. If a company goes into the SEC to register, she said, the typical refrain is “we’re not sure what to register you as.” Even worse, “you may get a Wells Notice or a subpoena later from the enforcement arm of the SEC.”","This is a persistent problem. “I represented a crypto trading platform back in 2018 that wanted to get registered and in compliance, but the SEC and Finra (Financial Industry Regulatory Authority) were not the least bit interested in that process,” Lisa Braganca, a former SEC enforcement branch chief, told me. “If that attitude has changed, it has changed only a small amount.”","Some of the SEC’s actions are more controversial than others. There probably won’t be many tears shed over the lawsuit against Terraform Labs founder and CEO Do Kwon, for example. But that one is too late. Do’s UST “stablecoin” imploded last year, causing billions of dollars to evaporate. Do has already escaped to Serbia or wherever he is now.","Meanwhile, as places like Hong Kong and Japan move forward with stablecoin regulations, U.S. lawmakers are still debating various bills. The SEC went after a stablecoin issued by Paxos, which was registered with the New York Department of Financial Services in an attempt to play by the rules.","In the absence of any rules or guidelines on stablecoins, how are issuers to know what crosses the line? Paul Grewal, chief legal counsel at crypto exchange Coinbase, recently said on \"Unchained,\": “This breaks my heart to say this as an American, I think any stablecoin issuer ought to first ask, whether or not the United States in this current climate is necessarily the best place in which to develop the project in the first instance.”","And therein lies the problem. Because stablecoins aren’t going to just disappear, they will just go somewhere else. We have already seen how the actions against BUSD appeared to benefit tether, an offshore stablecoin whose reserves and general opacity have sparked much concern.","Read more: Omid Malekan - Dollar Stablecoins Are Great for Users and the US Government","That is just one example of how a domestic U.S. crackdown is fueling an offshore player that U.S. regulators can’t control, even though that player still has implications for U.S. investors and the U.S. dollar.","Tether says “they’ve not done business in the United States, but they’re getting US dollar clearing from somewhere, right?” Custodia Bank founder and CEO Caitlin Long told us on CoinDesk TV.","“It’s the so-called euro dollar market – dollars that circulate offshore outside of the United States, outside of, frankly, the reach of U.S. bank regulators.”","Let’s be clear: Some in Washington would probably be thrilled if crypto just took off and left. That would be one less problem to worry about. Some enthusiasts will counter this with arguments along the lines of: The U.S. can’t afford to miss out on the crypto revolution and the next wave of financial innovation! But such claims aren't likely to convince lawmakers who see crypto as little more than a traveling casino.","It would be better to make a more practical argument about U.S. investor protection. And that is: If the U.S. fumbles the ball, the ball will get farther out of its reach. Crypto businesses will just go offshore, where U.S. regulators have less influence. And offshore crypto business can still do great damage to Americans. There’s probably no better example than the Bahamas-based crypto exchange FTX, whose implosion sparked bankruptcies in U.S.-based companies and major losses in U.S.-based venture-capitalist firms. The Commodity Futures Trading Commission alleged that FTX's demise affected commodity prices in the U.S.","The collapse of Singapore-based Terraform Labs also had a disastrous effect on some U.S. investors, such as a surgeon in Massachusetts who lost his nest egg on the failed project.","“People living in the U.S. want crypto,” Braganca told me. “If they can’t buy it here, they will use technology to hide their residency to buy it on foreign exchanges.”","There is so much more to be done in terms of establishing clear rules and guidance. Japan, for example, has a rule that exchanges must segregate customer and corporate assets. The regulation played a big role in ensuring that FTX Japan customers get their money back. The SEC has taken a first step by proposing new rules for qualified custodians in crypto. But the rule is still in a public comment phase, which means it’s far from becoming a reality.","A larger problem is that there is no federal regulator for U.S. crypto exchanges. One advantage of a jurisdiction like Japan is that there is only one regulator for the crypto industry: the Financial Services Agency. In the U.S., crypto is regulated by the various parties including the SEC and the CFTC, and crypto exchanges are mostly regulated at the state level. Sorting out this confusion would have to come from Congress, which could help define who regulates what.","In the more immediate term, it would be good for the U.S. to establish stablecoins rules, rather than going after individual issuers on an ad hoc basis. The SEC could be doing much more to outline guidelines and expectations, especially for the companies that walk through their front doors looking for direction.","Of course, the U.S. could have the clearest regulatory system in the world, and there would still be companies that intentionally set up overseas in order to evade scrutiny. But there will also be also customers who prefer the investor protections that come with safe and regulated exchanges. U.S. regulators should at least be working toward the goal of giving customers that option.","“There are also projects who are trying to follow the laws as well as they can, but because of the regulatory scrutiny, take pains to put themselves abroad, or even stay anonymous or pseudonymous,” Gottlieb said. “This is arguably worse for retail, because the projects are harder to reach if something goes wrong, and U.S. regulators have less affirmative authority over them.”","A U.S. crypto ban is extremely unlikely. Which means that if the U.S. continues its current approach, it will likely end up with crypto projects either operating overseas, or within gray areas inside the United States. Some of those projects will eventually be targeted by SEC enforcement actions, but it may be after some Americans already lost their life savings. Other companies in the gray zone may never be punished at all. Wouldn’t it be better to at least give people a chance to play by clearly defined rules?","“Sunlight is the best disinfectant,” Gottlieb said. “If the regulators don't let in some sun, everything will grow in the shadows.”","\n"],"entity":[{"type":"SEC","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"Kwon","content":"PERSON"},{"type":"David Z. Morris","content":"PERSON"},{"type":"Shadow Crypto Rule Taking Shape as Enforcement Cases Mount","content":"ORGANIZATION"},{"type":"U.S","content":"LOCATION"},{"type":"Pierce","content":"PERSON"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"Braganca","content":"LOCATION"},{"type":"Caitlin Long","content":"PERSON"},{"type":"Cohen","content":"PERSON"},{"type":"Jesse Powell","content":"PERSON"},{"type":"Financial Services Agency","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Rebecca Rettig","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Laura Shin","content":"PERSON"},{"type":"Gottlieb of Morrison Cohen","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Custodia Bank","content":"ORGANIZATION"},{"type":"Serbia","content":"LOCATION"},{"type":"Gottlieb","content":"PERSON"},{"type":"Wells Notice","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Jeff Dorman","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"Massachusetts","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Finra (Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Dubai","content":"LOCATION"},{"type":"Emily Parker","content":"PERSON"},{"type":"$30m","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Hester Peirce","content":"PERSON"},{"type":"Omid Malekan","content":"PERSON"},{"type":"The U.S.","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Arca","content":"ORGANIZATION"},{"type":"Jason Gottlieb","content":"PERSON"},{"type":"Lisa Braganca","content":"PERSON"},{"type":"Japan","content":"LOCATION"},{"type":"Morrison Cohen LLP","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"Boyd Cohen","content":"PERSON"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"US Government","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Paul Grewal","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion","SEC","Gary Gensler","United States","Regulation"],"authors":["Emily Parker"]}