{"summary":"Wall Street will need bitcoin more than bitcoin needs Wall Street.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/19\/spot-bitcoin-etfs-are-just-the-beginning-for-wall-street\/","publishDate":"2024-03-19T16:57:19","id":14878,"type":null,"title":"Spot Bitcoin ETFs Are Just the Beginning for Wall Street","category":["Consensus Magazine"],"content":["For all the breathless coverage of spot bitcoin exchange-traded funds (ETFs) launching and the bitcoin futures ETFs before them, no one is talking about the elephant in the room.","This feature is part of CoinDesk’s “Future of Bitcoin” package published to coincide with the fourth Bitcoin “halving” in April 2024. Ryan Gorman is the principal of Gorman Strategies.","These funds help kick the can down the road while giving off the impression of being at the cutting edge of investing, when in reality they’re an easy way to charge fees while also making it harder for you and I to own bitcoin (BTC) than ever before while Wall Street figures out how to address the growing threat posed by decentralized finance (DeFi).","In fact, a research report out just before this recent bull run revealed that nearly one-third (32%) of all Americans have used DeFi platforms. Additionally, one-quarter of China’s (26%) and India’s (25%) populations have also used them. It would not be surprising if those numbers are even higher, given how much total value locked (TVL) and DeFi trading volumes have grown since the beginning of the year.","Crypto industry veterans and others have long questioned the necessity or sensibility of a spot bitcoin ETF, and have even argued that it goes against the very reason Satoshi Nakamoto (not Craig Wright) wrote the Bitcoin white paper and created the first cryptocurrency. That said, most people are overlooking a simple fact: Wall Street needs bitcoin more than bitcoin needs Wall Street.","Spot bitcoin ETFs are an acknowledgement by large financial firms that they fear the impact digital currencies could have on their business models similarly to how nation-states fear the loss of power and control that non-sovereign currencies could bring to a global economy, and are now rapidly adopting central bank digital currencies (CBDCs) in response to what they perceive to be a growing threat.","Financial firms previously “tried to kill crypto and failed.” JPMorgan CEO Jamie Dimon, for instance, recently compared bitcoin to smoking, saying it’s rife with fraud and he’d never buy it but that he would defend your right to do so — he even predicted bitcoin would reach $1 million. That’s a dramatic heel turn from earlier this year when he compared it to a pet rock, and also testified on Capitol Hill that he’d “close it down,” if he were in government.","It doesn’t take a rocket scientist to figure out what’s going on here.","The reason for all this posturing is two-fold: on one hand, Dimon and his contemporaries went through the initial digitization of stock markets back during the 1980s and understand the magnitude of the shift that is underway. They want to move the goalposts as far into the future as possible to keep their loyal (older) clientele on-board.","On the other hand, bank executives also know that there is a substantial amount of money to be made in the transition of replacing centralized companies with open protocols and want to profit for as long as possible.","Financial firms are doing everything they can to both delay the inevitable, and also to squeeze every last dollar out of their customers before younger generations pivot to better, less costly and more immediate platforms that better serve their needs.","See also: Welcome to the 'Bitcoin Era' on Wall Street | Opinion","A significant amount of fees disappear if individuals can self-custody their own assets, which also gives holders total control over how they are used. Increasingly through crypto, people have access to a wide variety of services that were up until now offered only by financial institutions.","The scale at which asset managers are buying up bitcoins and reducing on-exchange supply has outpaced even the wildest of projections, and ETF issuers have already set their sites on ETH. If you think they will stop there, keep in mind all the various trusts holding crypto assets out there structured similarly to Grayscale’s GBTC trust, before it converted into an ETF.","When Nasdaq launched in 1971, many overlooked the venue’s potential. By1991 it grew to account for nearly half of all equities trading volumes in the U.S. It is now the second-largest exchange in the world, trailing only the NYSE, and the vast majority of global exchanges have either closed their open-cry trading pits or kept them on life support.","Dimon started his finance career as a stockbroker in 1982, following in the footsteps of both his father and grandfather. He has previously spoken about the encroachment of fintech startups into Wall Street; he also likely remembers well the innovations — and resulting upheaval — caused by Nasdaq’s launch and NYSE’s subsequent digitization via the 1984 launch of SuperDOT (NYSE’s electronic routing overhaul) that kicked off the trend of brokers leaving the trading floor to sit behind a computer.","Only this time, the benefits of these advancements are available to the many rather than a select few.","Most floor traders 50 years ago likely never saw the end coming. This time, Dimon and the rest of the old guard see lower fees, more access and greater control, and surely remember what happened at the beginning of their careers.","They’re wise to the path we’re on, and no amount of doublespeak will change that."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"1971","content":"DATE"},{"type":"1982","content":"DATE"},{"type":"Gorman Strategies","content":"ORGANIZATION"},{"type":"1984","content":"DATE"},{"type":"Craig Wright","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"32%","content":"PERCENT"},{"type":"Ryan Gorman","content":"PERSON"},{"type":"Jamie Dimon","content":"PERSON"},{"type":"1980s","content":"DATE"},{"type":"quarter","content":"DATE"},{"type":"NYSE","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"25%","content":"PERCENT"},{"type":"$1 million","content":"MONEY"},{"type":"26%","content":"PERCENT"},{"type":"India","content":"LOCATION"},{"type":"Dimon","content":"PERSON"},{"type":"U.S","content":"LOCATION"},{"type":"China","content":"LOCATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Opinion","Bitcoin ETF","ETFs","Wall Street","Jamie Dimon"],"authors":["Ryan Gorman"]}