{"summary":"Miner reserves saw continued net outflows since bitcoin ETF debut, falling to their lowest level since June 2021.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/06\/bitcoin-miner-selling-ahead-of-halving-is-capping-prices-bitfinex\/","publishDate":"2024-02-06T20:17:48","id":14882,"type":null,"title":"Bitcoin Miner Selling Ahead of Halving Is Capping Prices: Bitfinex","category":["Markets"],"content":["Inflows into the new spot bitcoin ETFs are generating a lot of headlines, but it's likely miner selling of bitcoin (BTC) that's kept a lid on prices of late, Bitfinex analysts said in a Monday report.","Miner reserves – the amount of bitcoin held in miner treasuries – have seen net outflows since bitcoin exchange-traded funds (ETF) debuted in mid-January, and are now down to their lowest level since June 2021, CryptoQuant data shows.","The Bitfinex report took note of Glassnode data showing that miners transferred some $1 billion worth of BTC to crypto exchanges on January 12, the day after the ETF launch, perhaps capitalizing on bitcoin's price surge to two-year high levels.","\"This reduction in reserves suggests that miners are either selling off their bitcoin holdings or leveraging them to raise capital,\" Bitfinex analysts wrote. \"The primary use of this capital appears to be for upgrading machinery and mining facilities.\"","The increased selling happens as the next Bitcoin halving, a quadrennial event when the reward to miners for securing the Bitcoin blockchain is cut by half, is due in April. The halving will have an immense impact on miners' profitability, potentially pushing smaller, less efficient operations out of business or being forced to merge with larger companies to survive, the report explained.","Read more: Bitcoin Halving Is Poised to Unleash Darwinism on Miners","\"Selling [bitcoin] now provides the capital for miners to upgrade infrastructure and is a reminder of the significant influence on market liquidity and price discovery that miners have,\" Bitfinex analysts said.","Continuous selling pressure from the miners perhaps contributes to bitcoin's stalled momentum over the past weeks. BTC corrected as much as 20% following the $49,000 yearly high reached on ETF debut day. The price has since recovered and stabilized above the $40,000 level, but has been rebuffed at a number of attempts to climb above $44,000.","While overall outflows from miners have increased, Matthew Sigel, head of digital asset research at VanEck, pointed out that the degree of selling from each individual miner was dependent on their operational costs.","\"Low-cost miners like CleanSpark (CLSK), Riot (RIOT) and Cipher Mining (CIFR) are selling fewer coins due to their lower cost basis,\" he said in an X post Tuesday. \"In contrast, higher-cost operators such as Argo Blockchain (ARBK) and TeraWulf (WULF) are selling ~100% of their proceeds.\"","Edited by Stephen Alpher."],"entity":[{"type":"June 2021","content":"DATE"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Matthew Sigel","content":"PERSON"},{"type":"January 12","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"$49,000","content":"MONEY"},{"type":"$44,000","content":"MONEY"},{"type":"VanEck","content":"ORGANIZATION"},{"type":"mid-January","content":"DATE"},{"type":"April","content":"DATE"},{"type":"$40,000","content":"MONEY"}],"hashtag":["Bitcoin","Bitcoin Miners","Bitfinex","Halving","Matthew Sigel"],"authors":["Krisztian Sandor"]}