{"summary":"The SEC sent a Wells notice to Coinbase this week, but not before it charged Justin Sun and a who’s who of Hollywood celebrities with the unregistered offer and sale of two “crypto asset securities.”\nResearch from a Coinbase director revealed more than $1 billion in ether has been lost forever to bugs and human error. ","author":["Adam Morgan McCarthy","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/222774\/sec-charges-justin-sun-issues-coinbase-wells-notice","publishDate":"2023-03-25T09:25:03","id":1488,"type":null,"title":"Crypto week: SEC charges Justin Sun, issues Coinbase Wells notice and $1 billion ether has been lost","category":["Policy"],"content":["U.S. regulators are showing no signs of relenting as they continue to come down hard on crypto. Meanwhile, bugs and human errors prove costly.","The Securities and Exchange Commission (SEC) was busy this week, charging Justin Sun, Lindsay Lohan, and Jake Paul. The regulator then turned its ire on Coinbase, issuing the exchange a Wells notice for its staking service, Coinbase Earn and Coinbase Wallet products.&nbsp;","Elsewhere, research showed how costly human error and bugs can be. Here are the week's top stories.&nbsp;","Coinbase was <a href=\"https:\/\/www.theblock.co\/post\/222084\/sec-investigating-coinbase-for-its-earn-product-wallet-service-and-exchange-activity\" data-v-f87c67ca=\"\">issued<\/a> a Wells notice by the SEC on Wednesday. While this notice does not imply a conclusion or foregone action, it is issued to entities under investigation.&nbsp;","The notice was related to the firm's asset listings, staking service, Coinbase Earn and Coinbase Wallet. With regard to asset listings, this could have a significant impact on the exchange's business model — which revolves around offering a \"multitude of tradable pairs,\" Needham analyst John Todaro said.","If the exchange is forced to delist assets, it could lead to \"materially lower revenue,\" Todaro added. Coinbase shares sank following the news.&nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">Before it was revealed Gensler's SEC had issued Coinbase a Wells notice, the regulator charged Tron's Justin Sun — and a litany of Hollywood \"celebs.\"<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">The SEC charged Sun and three of his companies, including Tron Foundation, for the unregistered offer and sale of two \"crypto asset securities.\" <\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Sun's companies,&nbsp; Tron Foundation, BitTorrent Foundation and Rainberry, allegedly offered and sold Tronix and BitTorrent as investments \"through multiple unregistered 'bounty programs,'\" <a href=\"https:\/\/www.theblock.co\/post\/222077\/sec-charges-trons-justin-sun-and-celebrities-including-lindsay-lohan-jake-paul\" data-v-f87c67ca=\"\">according<\/a> to the regulator.&nbsp;<\/span>","The SEC also accused Sun of violating federal securities laws. The regulator alleges he conducted a scheme to artificially inflate the trading volume of TRX in the secondary market. &nbsp;","<span class=\"s1\" data-v-f87c67ca=\"\">The regulator also accused eight celebrities of violating securities laws in touting related tokens. The list included Lindsay Lohan, content creator Jake Paul, Austin Mahone, and rappers Soulja Boy and DeAndre Cortez Way. All except Cortez Way and Mahone agreed to pay $400,000 in disgorgement, interest and penalties to settle the charges without admitting or denying the SEC's findings.<\/span>","Research from a Coinbase director <a href=\"https:\/\/www.theblock.co\/post\/221453\/over-1-billion-of-ether-lost-forever-bugs-human-error\" data-v-f87c67ca=\"\">revealed<\/a> that more than $1 billion of ether has been lost forever to bugs and human error.&nbsp;","Coinbase Director of Product Strategy and Business Operations Conor Grogan said the company's research had categorized losses attributed to mistakes and bugs on the Ethereum blockchain. The losses don't include people who had lost access to wallets.&nbsp;","<span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">Grogan on Twitter categorized thousands of instances of Ethereum typos, user errors and contracts with bugs. The former Bridgewater Associates employee cataloged 636,000 ether (or $1.15 billion) that had been lost. <\/span><span class=\"css-901oao css-16my406 r-poiln3 r-bcqeeo r-qvutc0\" data-v-f87c67ca=\"\">This represented 0.5% of the total circulating supply of ether.<\/span>","About 514,000 ETH was linked to a 2017 bug in the Parity crypto wallet. Another 60,000 ETH was lost to failed exchange Quadriga and 11,500 ETH to a failed NFT mint.","Ethereum users have cumulatively sent 24,000 ETH to a burn address, where the coins can no longer be accessed.","Still, at the time of the losses, most of the ether wasn't worth nearly as much in dollar terms."],"hashtag":["COINBASE","FEDERAL RESERVE","SEC"]}