{"summary":"Miners must compete using their machines to solve a difficult mathematical problem.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2021\/02\/05\/what-does-hashrate-mean-and-why-does-it-matter\/","publishDate":"2021-02-05T19:01:24","id":14883,"type":null,"title":"What Does Hashrate Mean and Why Does It Matter?","category":["Tech"],"content":["","\"Hashrate\" refers to the total combined computational power that is being used to mine and process transactions on a Proof-of-Work blockchain, such as Bitcoin and Ethereum (prior to the 2.0 upgrade).\n\n","","","A “hash” is a fixed-length alphanumeric code that is used to represent words, messages and data of any length. Crypto projects use a variety of different hashing algorithms to create different types of hash code – think of them like random word generators where each algorithm is a different system for generating random words.\n\n","","","For instance, the hash for “coindesk” using the hashing algorithm that Bitcoin uses, SHA256, is f2429204b339475a3d94dd5450f5ebb3c80130a85fbb91d62768741a3b34a6b6","","","Before new transactional data can be added to the next block in the chain, miners must compete using their machines to guess a number. More specifically, miners are trying to produce a hash that is lower than or equal to the numeric value of the ‘target’ hash by changing a single value called a ‘nonce’. Each time the nonce is changed, an entirely new hash is created. This is effectively like a lottery ticket system, where each new hash is a unique ticket with its own set of numbers.\n\nFor example, if we take “coindesk” and change the first letter to make “foindesk,” we get this completely different hash = 5a12a9af1b5794bf6855c15944339d41ff713665e415b5434b8c9f081c61b66a\n\nBecause each hash created is random and impossible to predict, it can take millions of guesses – or hashes – before the target is met and a miner wins the right to fill the next block and add it to the blockchain. Each time that happens, a block reward of newly minted coins is given to the successful miner along with any fee payments attached to the transactions they store in the new block. ","","","Adding a block to blockchain “confirms” of all the transactions stored within that block  Every time a new block is added on top of earlier blocks, those earlier transactions are reconfirmed again and again, becoming more and more impossible to change.","","","For most Proof-of-Work (PoW) blockchains, the block reward – a predetermined amount of free coins given to a miner each time a new block is mined – undergoes a programmed halving in order to incrementally reduce the total supply over the course of a coin’s mining lifespan. For Bitcoin, block rewards are cut in half every 210,000 blocks or approximately every four years. As of 2021, miners receive 6.25 bitcoins each time they mine a new block. The next Bitcoin halving is expected to occur in 2024 and will see BTC block rewards drop to 3.125 bitcoins per block. Dash is another mineable cryptocurrency that reduces its block rewards by 7.14% every 210,240 blocks, while Litecoin halves its rewards every 840,000 blocks.","","","The hashrate is an important metric for assessing the strength of a blockchain network – more specifically, its security. The more machines dedicated by honest miners to discovering the next block, the higher the hashrate rises and the harder it becomes for malicious agents to disrupt the network.","","","A 51% attack, for example, is when a single individual or group of attackers purchases or rents enough mining equipment to control over 50% of a blockchain’s hashrate. Because blockchains are trustless and abide by a rule known as the “longest chain rule,” a person or group that controls a majority of the hashrate could, in theory, block or reorganize transactions and even reverse their own payments. This would create double spend issues which, in turn, would completely undermine the integrity of the underlying blockchain.","","","A fall in hashrate, therefore, means a reduction in the cost to perform a 51% attack, making the network more vulnerable.","","","89 EH\/s, which stands for exahashes per second, at the time this article was published. 1 exahash = 1 quintillion hashes.","","","That means that miners are currently computing 89 quintillion hashes every second. ","","","Find the most current estimate at Blockchain.com.","","","Mining \"difficulty\" is how difficult it is for miners to produce a hash that’s below the target hash. It’s achieved by reducing the numeric value of the hashed block header. ","","","Bitcoin’s difficulty, for example, is measured using an internal score that begins at 1 (the easiest level) and grows or shrinks exponentially depending on how many miners are competing on the network. That score automatically adjusts every 2, 016 blocks – approximately every two weeks. Right now, that number is around 13,912,524,048,946.","","","Blocks are targeted to be found by miners every 10 minutes. So if miners are solving blocks and finding bitcoins more often than every 10 minutes on average, the difficulty increases. If miners are finding bitcoins less often than every 10 minutes on average, the difficulty decreases. ","","","The more miners there are online, the more hashrate is produced, meaning that there are more “guesses” being generated. The more guesses there are, the more likely it is that the correct hash is going to be discovered quickly. Since blockchains are generally designed to add blocks (and release new coins) at a steady, predictable rate, the difficulty is programmed to adjust automatically after a set number of blocks to keep that rate consistent.","","","There's no way to know for sure the exact Bitcoin hashrate, though it can be estimated. Hashrate is traditionally estimated based on public data about Bitcoin, including the difficulty metric described above.","","","Though this traditional estimation method is in the right ballpark, this methodology has long been criticized as not precisely accurate. Cryptocurrency exchange Kraken proposed another way of estimating the hashrate, using statistics to show with 95% confidence that the hashrate lies in some range.","","","More and more miners have entered the fray in Bitcoin's short history, pushing the hashrate up. ","","","The most likely reason for new miners joining the highly competitive space is because of bitcoin’s extreme price potential. Increase in demand for bitcoin (which is a scarce asset) has pushed the price above $33,000 per coin, at press time, attracting more operators who see mining as an opportunity to make significant returns.","","","Any increase in the number of miners pushes Bitcoin's difficulty up, which then drives the hashrate up.","","","CORRECTION (June 28, 22:28 UTC): This article has been corrected to show that bitcoin's hashrate was 89 exahashes per second, not 89 million exahashes as previously reported.",""],"entity":[{"type":"7.14%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"$33,000","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"51%","content":"PERCENT"},{"type":"95%","content":"PERCENT"},{"type":"June 28","content":"DATE"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Ethereum","Bitcoin","Monero","Hashrate","Explainers","Learn","Evergreen","bitcoin hashrate"],"authors":["Alyssa Hertig","Ollie Leech"]}