{"summary":"Investing app Robinhood has expanded its cryptocurrency trading service to 8 more states\nThe firm has also brought on a former Credit Suisse associate to lead the crypto business","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/45482\/robinhood-crypto-expands-to-8-more-us-states-bringing-the-total-to-47-states","publishDate":"2019-11-01T04:00:36","id":1489,"type":null,"title":"Robinhood Crypto expands to 8 more US states: Reach 47 total","category":["Cryptocurrency"],"content":["Investing app Robinhood has brought its commission-free cryptocurrency trading service to 8 more U.S. states.","The added states are Delaware, Kentucky, Louisiana, Maine, Maryland, Minnesota, Nebraska, and Vermont, according to an <a href=\"https:\/\/blog.robinhood.com\/news\/2019\/10\/31\/robinhood-crypto-launches-in-eight-more-states\" data-v-f87c67ca=\"\">announcement<\/a> Thursday. The additions bring the total to <a href=\"https:\/\/robinhood.com\/support\/articles\/360001284423\/commission-free-cryptocurrency-investing\/\" data-v-f87c67ca=\"\">47 U.S. states<\/a>, where Robinhood Crypto now operates.","“We’ll continue expanding to more,” said the firm. Robinhood currently offers<a href=\"https:\/\/robinhood.com\/support\/articles\/360001284423\/commission-free-cryptocurrency-investing\/\" data-v-f87c67ca=\"\"> trading<\/a> in 7 cryptocurrencies, including bitcoin (BTC) and ether (ETH).<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nRobinhood has also hired a new head of crypto, Sina Nader, who will oversee the firm’s crypto business and focus on its “cold” storage custody system to keep the platform secure. Nader was previously a director of private investment cryptocurrency firm CryptoLux Capital, according to his <a href=\"https:\/\/www.linkedin.com\/in\/sinanader\/\" data-v-f87c67ca=\"\">LinkedIn profile<\/a>.","He has also worked with Credit Suisse and Morgan Stanley, per the profile. As an associate at Credit Suisse, Nader manager a $100 million portfolio of equities, derivatives and alternative investments, according to the profile.&nbsp;","\"We’re also thrilled to welcome Sina Nader as our Head of Crypto,\" Robinhood&nbsp; said, adding: \"With an extensive background working in both the crypto industry and at some of the world’s leading banks, Sina brings valuable experience from roles that span the financial system.\"","Robinhood initially <a href=\"https:\/\/blog.robinhood.com\/news\/2018\/2\/21\/robinhood-crypto-trading-is-here\" data-v-f87c67ca=\"\">launched<\/a> the cryptocurrency trading service in Feb. 2018. It also operates in New York, having received a <a href=\"https:\/\/blog.robinhood.com\/news\/2019\/1\/23\/robinhood-crypto-is-coming-to-new-york\" data-v-f87c67ca=\"\">BitLicense<\/a> earlier this year. The firm also recently <a href=\"https:\/\/www.theblockcrypto.com\/linked\/35182\/crypto-friendly-investment-app-robinhood-gets-fca-nod-to-operate-in-the-uk\" data-v-f87c67ca=\"\">won a nod<\/a> from the UK Financial Conduct Authority (FCA) to operate in the country. According to Thursday's announcement, Robinhood also offers insurance on its clients' cryptocurrency holding through a policy underwritten by \"certain underwriters at Lloyd's.\"","Robinhood, unlike retail cryptocurrency exchanges, doesn't charge a fee to trade cryptos. The firm routes orders to a number of exchanges, brokers, and over-the-counter trading desks, including Chicago-based Jump Trading, as per Bloomberg <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2019-05-29\/robinhood-s-free-crypto-trades-powered-by-chicago-s-jump-trading\" data-v-f87c67ca=\"\">reporting<\/a>.&nbsp;","The firm appears to be interested in further expanding its cryptocurrency unit as it is <a href=\"https:\/\/www.theblockcrypto.com\/linked\/45132\/investment-app-provider-robinhood-is-seeking-a-chief-compliance-officer-for-its-crypto-unit\" data-v-f87c67ca=\"\">hiring<\/a> a chief compliance officer to to manage day-to-day cryptocurrency compliance operations.","Robinhood is well-funded, having raised <a href=\"https:\/\/www.reuters.com\/article\/us-robinhood-funding\/trading-startup-robinhood-raises-323-million-achieving-7-6-billion-valuation-idUSKCN1UH1VX\" data-v-f87c67ca=\"\">$323 million<\/a> in a Series E round earlier this year. The firm, which is currently valued at $7.6 billion, has also been looking to list its shares on the public markets through an initial public offering or <a href=\"https:\/\/techcrunch.com\/2018\/09\/06\/robinhood-ipo\/\" data-v-f87c67ca=\"\">IPO<\/a>."],"hashtag":["ROBINHOOD"]}