{"summary":"Proof-of-work is the blockchain-based algorithm that secures many cryptocurrencies, including Bitcoin and Ethereum.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-proof-of-work\/#:~:text=Proof%2Dof%2Dwork%20is%20the,cryptocurrencies%2C%20including%20Bitcoin%20and%20Ethereum.","publishDate":"2020-12-16T22:57:25","id":14899,"type":null,"title":"What Is Proof-of-Work?","category":["Learn"],"content":["Proof-of-work is the algorithm that secures many cryptocurrencies, including Bitcoin and Ethereum. Most digital currencies have a central entity or leader keeping track of every user and how much money they have. But there’s no such leader in charge of cryptocurrencies like Bitcoin. Proof-of-work is needed to make the online currency work without a company or government running the show.","More specifically proof-of-work solves the \"double-spending problem,\" which is trickier to solve without a leader in charge. If users can double-spend their coins, this inflates the overall supply, debasing everyone else's coins and making the currency unpredictable and worthless.","Double-spending is an issue for online transactions because digital actions are very easy to replicate, which is what makes it trivial to copy and paste a file or send an email to more than one person.","Proof-of-work makes doubling digital money very, very hard. It's much what it sounds like: \"proof\" that someone has done a significant amount of computations.","Bitcoin is a blockchain, which is a shared ledger that contains a history of every Bitcoin transaction that ever took place. This blockchain, as the name suggests, is composed of blocks. Each block has the most recent transactions stored in it.","Proof-of-work is a necessary part of adding new blocks to the Bitcoin blockchain. Blocks are summoned to life by miners, the players in the ecosystem who execute proof-of-work. A new block is accepted by the network each time a miner comes up with a new winning proof-of-work, which happens roughly every 10 minutes.","Finding the winning proof-of-work is so difficult the only way to provide the work miners need to win bitcoin is with expensive, specialized computers. Miners will earn bitcoin if they guess a matching computation. The more computations they churn out, the more bitcoin they are likely to earn.","What computations are the miners making exactly? In Bitcoin, miners spit out so-called \"hash,\" which turns an input into a random-looking string of letters and numbers.","The goal of the miners is to create a hash matching Bitcoin's current \"target.\" They must create a hash with enough zeroes in front. The probability of getting several zeros in a row is very low. But miners across the world are making trillions of such computations a second, so it takes them about 10 minutes on average to hit this target.","Whoever reaches the goal first wins a batch of bitcoin cryptocurrency. Then the Bitcoin protocol creates a new value that miners must hash, and miners start the race for finding the winning proof-of-work all over again.","Miners earn bitcoin rewards for every block for which they find the solution. This is what drives them to mine in the first place.","This monetary reward also drives them to follow the rules – not double-spending their money, for instance. Say Alfred the Miner finds a winning hash for a block. If Alfred submits the solution with the block but breaks rules within the block – say, spends coins more than once – the rest of the Bitcoin network will reject Alfred's block. Alfred will lose all the bitcoin he should have won. The threat of losing the bitcoin rewards keeps miners honest.","The goal of proof-of-work is to prevent users from printing extra coins they didn't earn, or double-spending. If users were able to spend their coins more than once, it would effectively make the currency worthless.","In most digital currencies, this problem is easy to solve. The bank that is in charge of the system keeps track of how much money each person has. If Alice sends Bob $1, then the bank deducts $1 from Alice and gives $1 to Bob.","But in cryptocurrency there isn't such an entity. Proof-of-work provides a solution.","Bitcoin creator Satoshi Nakamoto invented proof-of-work to get Bitcoin off the ground. No one knows who Nakamoto is, or whether the name is an alias.","There are at least a few problems with proof-of-work:","The more computational power being poured into securing Bitcoin, the more resources a potential attacker needs to amass in order to successfully attack Bitcoin.","Most cryptocurrencies use proof-of-work, though some are experimenting with other ways of securing their networks. The most popular cryptocurrencies tapping proof-of-work include:"],"entity":[{"type":"Alice","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Nakamoto","content":"PERSON"},{"type":"Alfred","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Technology","Intermediate","Learn"],"authors":["Alyssa Hertig"]}