{"summary":"A Ukrainian indie game developer wanted to include optional NFTs into its forthcoming PC and Xbox shooter game called S.T.A.L.K.E.R. 2: Heart of Chernobyl.\nFans decried the inclusion of NFTs in the game, causing the developers to scrap their plan.","author":["MK Manoylov","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/127952\/backlash-leads-s-t-a-l-k-e-r-2-developers-to-pull-planned-nfts-from-forthcoming-game","publishDate":"2021-12-17T14:25:39","id":1490,"type":null,"title":"Backlash causes S.T.A.L.K.E.R. 2 developers to pull NFTs from game","category":["NFTs"],"content":["<span data-v-f87c67ca=\"\">GSC Game World, a Ukrainian game development company behind the S.T.A.L.K.E.R and Cossacks titles, had decided to implement optional non-fungible tokens (NFTs) in their forthcoming S.T.A.L.K.E.R. 2 release.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Within hours, fans took to Twitter to chastise GSC’s inclusion of NFTs, causing the small developer to pull NFTs from the game — suggesting that, while venture capitalists are still pouring funds into blockchain-based gaming endeavors, the general public isn’t so open to embracing the new technology application.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">In a statement emailed to The Block before GSC officially announced their inclusion of NFTs, GSC Game World CEO Evgeniy Grygorovych said:&nbsp;<\/span>","<span data-v-f87c67ca=\"\">As described in the prior emailed statement, the NFTS would have been a part of the “S.T.A.L.K.E.R. Metaverse” launch. Users could have registered for in-game item drops starting in December, with the drop auction occurring in January.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Included in the drop would be a new feature called “metahumans” in the game, or a non-player character that resembled the NFT’s owner would have been created by photogrammetry technology. A second drop of “high secretive genesis packs” would have occurred in February. A Los Angeles-based NFT trading platform called DMarket would have facilitated the NFT trades.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">GSC intended for the NFTs to be optional to players and offer no in-game benefits to those who didn’t want to purchase one.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">However, fans of the S.T.A.L.K.E.R. franchise did not like the game developers offering NFTs. Some of the responses to the official <\/span><a href=\"https:\/\/twitter.com\/stalker_thegame\/status\/1471148058708791308\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">S.T.A.L.K.E.R. Metaverse<\/span><\/a><span data-v-f87c67ca=\"\"> post include:&nbsp;<\/span>","","","","","","","&nbsp;","<span data-v-f87c67ca=\"\">GSC clarified in a later post its intention with NFTs, but then deleted it soon after.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">This is not the first time fan backlash caused project developers to scrap NFT inclusion. In October of 2021, five prominent young adult authors announced the creation of an NFT-based storytelling platform called Realm of Ruin, slated to launch on November 8. Users could create NFTs of their characters and write a backstory for them in what would have essentially been an MMORPG-esque story. However, <\/span><a href=\"https:\/\/www.coindesk.com\/tech\/2021\/11\/22\/how-book-twitter-misinformation-killed-a-literary-nft-project\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">intense backlash<\/span><\/a><span data-v-f87c67ca=\"\"> from fans caused the project developers to shut down the project altogether.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And yet, the fan backlash begs the question: as blockchain-based gaming startups like <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/123306\/gaming-startup-mythical-games-raises-150-million-in-series-c-round-led-by-a16z\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Mythical Games<\/span><\/a><span data-v-f87c67ca=\"\"> and <\/span><a href=\"https:\/\/www.theblockcrypto.com\/post\/124210\/blockchain-gaming-startup-forte-raises-725-million-series-b-funding\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Forte<\/span><\/a><span data-v-f87c67ca=\"\"> raise millions of dollars, who will embrace these games? And how can blockchain-based gaming companies sell to potentially resistant players?<\/span>","GSC decided that they will avoid using NFTs in its forthcoming game.&nbsp;","<span data-v-f87c67ca=\"\">When reached, GSC declined an interview request regarding the fan backlash toward NFTs.<\/span>"],"hashtag":[]}