{"summary":"When Satoshi Nakamoto launched the Bitcoin protocol in January 2009, the first globally viable cryptocurrency had arrived.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-cryptocurrency\/","publishDate":"2021-11-29T18:56:29","id":14903,"type":null,"title":"What Is Cryptocurrency?","category":["Learn"],"content":["Cryptocurrency is a relatively new type of money that operates in a completely different way than the traditional currency we all use every day. The most basic difference is that it’s exclusively a virtual currency, meaning there are no physical cryptocurrency coins or notes you can keep in your back pocket.","It’s also issued, or created, in a unique way. Instead of being produced by a central bank or government, like U.S. dollars, euros and other fiat currencies are, new cryptocurrency units typically enter circulation through a technological process that involves the participation of volunteers from all over the world using their computers.","That is why cryptocurrency is often described as “decentralized.” Cryptocurrencies are typically not controlled or operated by any single entity in any single country. It takes an entire network of volunteers from around the world to secure and validate transactions made with cryptocurrency.","But it isn’t just they’re digital nature and how they’re issued that sets cryptocurrencies apart from regular currencies; there are other differences:","The word “crypto” in cryptocurrency refers to the special system of encrypting and decrypting information – known as cryptography – which is used to secure all transactions sent between users. Cryptography plays a vitally important role in allowing users to freely transact tokens and coins between one another without the need for an intermediary like a bank to keep track of each person’s balance and ensure the network remains secure.","It also solves a problem that used to make middlemen like banks indispensable – the double-spend issue: when a person attempts to spend the same balance twice with two different parties.","Cryptocurrencies use cryptography to encrypt sensitive information, including the private keys – long alphanumeric strings of characters – of crypto holders. Think of private keys as the passwords that determine the ownership of cryptocurrencies. Keep in mind that cryptocurrencies cannot be stored outside of the blockchain. They are permanently based on the blockchain. Hence, when someone says they own X amount of coins, what they really mean is that their password can legitimately claim X amount of coins on the blockchain.","These private keys are what crypto holders store on their wallets, which, as you must have guessed, are special kinds of software or devices designed specifically for this purpose. In instances where a crypto holder loses access to his or her private key, the cryptocurrencies associated with such keys could be lost permanently.","With the help of a cryptographic technique, private keys are encrypted to create wallet addresses, which can be likened to bank account numbers. In essence, you need your private key to digitally sign transactions. This is essentially like broadcasting to everyone in the network, “I confirm I am sending this amount of X coin to this person.” In contrast, wallet addresses indicate the destination of transactions.","The encryptions are executed in only one direction, which makes it impossible to derive private keys from a person’s wallet addresses.","While the cryptocurrencies themselves act as a medium for exchanging or for storing value, they all rely on a special type of public ledger technology called “blockchain” to record data and to keep track of all of the transactions being sent across the network.","A blockchain is exactly what it sounds like – a virtual chain of blocks each containing a batch of transactions and other data. Once each block is added to the chain, it becomes immutable, meaning the data stored inside it cannot be changed or removed.","Because cryptocurrencies are managed by a network of volunteer contributors known as “nodes” and not by a single intermediary, a system must be in place that ensures everyone participates honestly when recording and adding new data to the blockchain ledger.","The nodes perform a variety of roles on the network, from storing a full archive of all historical transactions to validating new transaction data. By having a distributed group of people all maintaining their own copy of the ledger, blockchain technology has the following advantages over traditional finance where a master copy is maintained by a single institution:","The nodes collectively manage the database and confirm new entries are valid transactions.","Think of it as having a cluster of computers take up the roles of a bank by consistently updating the balance sheets of users. In the case of distributed ledgers, however, the balance sheets aren’t stored in a single server. Instead, there are multiple copies of the balance sheets distributed across several computers, with each node, or computer connected to the network, functioning as a separate server. Therefore, even if one of the computers go offline, it wouldn’t be as detrimental as having a single server-based database go offline as can be the case in traditional banking systems.","This infrastructural design makes it possible for cryptocurrencies to evade the security mishaps that often plague fiat. It is difficult to attack or manipulate this system because the attackers must gain control of over 50% of computers connected to the blockchain network. Depending on how big the network is, it can be prohibitively expensive to carry out a coordinated attack. If you compare the amount required to attack established cryptocurrencies like bitcoin and what the attacker stands to gain at the end of the day, pursuing such an endeavor wouldn’t be viable financially.","Also, it is worth mentioning that the distributed nature of these digital assets establishes their censorship-resistant attributes. Unlike the case with banks, which governments regulate, cryptocurrencies have their databases spread across the globe. Therefore, when a government shuts down one of these computers or all the computers within its jurisdiction, the network will continue to function because there are potentially thousands of other nodes in other countries beyond the reach of one government.","So far in this guide, we have explained why cryptocurrencies are secure and why they are censorship-resistant. Now, let us take a look at how crypto transactions are vetted.","Recall that blockchains are distributed databases where all the transactions executed on a crypto network are recorded permanently. Every block of transactions is linked together chronologically in the order the transactions were validated.","Because it is impossible to set up a central authority or bank to manage blockchains, crypto transactions are validated by nodes (computers connected to a blockchain). So the question is: How do these networks ensure that node operators are willing to partake in the validation process?","The only way to guarantee there will always be individuals willing to invest their time and computers in a blockchain’s validation system is to introduce incentives to do so.","With incentives, validators are encouraged to participate actively and honestly in the validation process to earn rewards in the form of newly minted (created) cryptocurrencies. This incentive system sets the rules that govern the process of picking validators who would, in turn, verify the next batch of transactions. It also ensures that the activities of the validators align with the goal of the network as a whole. Validator nodes found to be involved in actions that undermine the validity of the crypto network can be barred from taking part in subsequent validation processes or punished accordingly. These incentive infrastructures are also known as consensus protocols.","There is a wide range of consensus protocols being used by existing blockchain networks. The two most common ones are:","Tokens are digital assets issued by decentralized applications based on blockchains. These are applications similar to the ones you might find on your smartphone, but instead of being operated by a single company, they run completely autonomously. Think of it like a free Uber app where taxi drivers and customers can connect together without having to pay the middleman company a cut of profits.","Because these applications depend on the infrastructure of blockchains, transactions involving tokens come with an added fee settled in the native cryptocurrency of the blockchain in question.","The value of a cryptocurrency usually depends on the utility of its underlying blockchain – though there have been many instances where social media hype and other superficial factors have played a role in pumping up prices.","The cryptocurrencies of blockchains perceived to have a wide range of utilities are usually more valuable than those that don’t offer much. It all boils down, though, to the demand for the coin relative to its supply and whether the buyer is willing to pay more than the amount the seller initially acquired the coin for.","Notably, cryptocurrencies tend to favor a deflationary system, whereby the number of new coins introduced to the market is predictable and gradually reduces over time.","For many cryptocurrencies, another important element is the total number of coins that can ever exist is often fixed. For instance, there will be only 21 million bitcoins created, of which more than 18 million are already in circulation. This deflationary-based system is the complete opposite of what we have in traditional finance, where governments have the license to print an infinite number of fiat notes and inadvertently devalue their currencies.","Bitcoin was the first of the many cryptocurrencies that exist today. Following its introduction in 2009, developers began to create other variants of cryptocurrencies based on the technology powering the Bitcoin network. In most cases, the cryptocurrencies were designed to improve upon the standards set by Bitcoin. That is why other cryptocurrencies that came after bitcoin are collectively called “altcoins” from the phrase “alternatives to bitcoin.” Prominent examples are:","Initially, cryptocurrency was pushed as an alternative to fiat currency based on the premise that it is portable, censorship-resistant, available globally and an affordable means of executing cross-border transactions. But, other than the digital assets pinned to fiat currencies, the value of cryptocurrencies hasn’t been able to replicate the level of stability needed to function effectively as a medium of exchange.","As a result, most crypto holders have shifted their attention to the investment potential of cryptocurrencies, which has since birthed the speculative side of the crypto market. Investors seem to be more concerned about the possibility that the price of a cryptocurrency may rise sometime in the future than whether they can use cryptocurrencies to purchase goods and services, and so crypto is now predominantly viewed as an investment."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"50%","content":"PERCENT"},{"type":"2009","content":"DATE"}],"hashtag":["Cryptocurrency","Bitcoin","Altcoins","Explainer","Learn"],"authors":["Andrey Sergeenkov"]}