{"summary":"ECB Director General Ulrich Bindseil and advisor Jürgen Schaaf are definitely against bitcoin, but their reasons don’t make a lot of sense.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/02\/22\/the-european-central-bank-is-either-lying-about-bitcoin-or-lying-to-itself\/","publishDate":"2024-02-22T19:26:58","id":14906,"type":null,"title":"The European Central Bank Is Either Lying About Bitcoin or Lying to Itself","category":["Consensus Magazine"],"content":["On Thursday, the European Central Bank (ECB) published a blog repeating debunked claims about bitcoin (BTC). The world’s first and largest cryptocurrency, according to ECB Director General Ulrich Bindseil and advisor Jürgen Schaaf, has failed as a currency and investment. And therefore, it has a fair value of “zero dollars.”","In other words: the central bank for the world’s largest trading block cannot recommend bitcoin because it’s going to crash.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","“The latest approval of an ETF doesn’t change the fact that bitcoin is not suitable as means of payment or as an investment,” Bindseil and Schaaf wrote, referencing the fleet of spot bitcoin exchange-traded funds that went live in the U.S. in January, which have so far largely exceeded analyst predictions.","If it seems off that the ECB would comment at all on bitcoin, it’s likely because the authors too feel the Crypto Vibe Shift, and see a potential rally on the horizon following the successful launch of ETFs and the lifting of crypto winter. Bitcoin has more than doubled in price to above $51K in the last six months, according to CoinDesk Indices.","“For society, a renewed boom-bust cycle of Bitcoin is a dire perspective. And the collateral damage will be massive,\" they write, adding later “Bitcoin’s price level is not an indicator of its sustainability.\" Yet it is impossible for the authors not to acknowledge the recent gains, even if they predict the “speculative bubble” to someday pop.","“The rally in the autumn of 2023 was initiated by the prospect of an imminent turnaround in the U.S. Federal Reserve's interest rate policy, the halving of the BTC mining rewards in spring [2024] and later the approval of the bitcoin spot ETF by the SEC,\" Bindseil and Schaaf write. It’s an interesting move to reverse the clock to try to explain what “initiated” bitcoin’s rally considering all three of those factors — rate cuts, the halving and ETFs — are still in play.","See also: Bitcoin ETFs See Record $2.4B Weekly Inflows","Still despite those economic drivers, the authors say that bitcoin “is still not suitable as an investment” because it lacks cash flows, dividends, productive commercial uses or “social benefit” and that interest in the asset is mostly a matter of FOMO and “the effectiveness of the Bitcoin lobby.”","Why exactly have Bitcoin boosters been so effective over the years? Why are stablecoins seeing rapid adoption in countries beset by hyperinflation? Why is bitcoin attractive to people in the U.S. and E.U.? These are questions that go unasked, perhaps because over the past decade the euro has lost 99.5% of its value versus bitcoin, according to TradingView data.","This isn’t even the first time the ECB has predicted bitcoin’s demise. In 2022, Bindseil and Schaaf wrote that a move from $17,000 to $20,000 in the weeks after the collapse of FTX was a “dead cat bounce” and “an artificially induced last gasp before the road to irrelevance.” While it’s true it took a long time for bitcoin to regain ground, bitcoin now looks set to retest its all-time high around $69,000.","Not willing to contemplate at all why people are interested in cryptocurrencies (for instance, not once were the words inflation, savings or high fees brought up), Bindseil and Schaaf further argue that any rise could likely be explained by “price manipulation” and fraud. They cite a Forbes study from 2022 that found 51% of reported bitcoin exchange volumes were likely faked, a study I might add that does not make Bindseil and Schaaf's mistake of conflating price with volumes.","But the authors cannot help themselves as seeing bitcoin as a criminal enterprise — drawing connections between disparate events to suggest that misuse somewhere means abuse everywhere. At one point they discuss how the U.S. Securities and Exchange Commission’s Twitter\/X account was hacked to post fake news about bitcoin ETFs, for instance. (This may just be me, but I think that reflects more poorly on the SEC than on the Bitcoin network.)","It is to the point that the ECB is either willfully lying or genuinely misleading itself about the criminal use of bitcoin, a long running claim that has been debunked time and again. Without citing a source, the authors write “Despite the market downturn, the volume of illicit transactions has continued to rise.” All available evidence, including yearly crime reports from Chainalysis, suggest that crypto crime declines in market downturns.","See also: Crypto Money Laundering Dropped 30% Last Year: Chainalysis","Further, the claim that bitcoin “remains the top choice for money laundering in the digital world” is patently false. Perhaps it’s unfair to compare bitcoin to the world's reserve currency, the U.S. dollar, which dominates in global and online crime, but why again was the 500 euro note banned?","Later, the authors directly contradict themselves when discussing the precise reason why bitcoin is falling out of favor for criminal use: because it is run on an immutable, fully public and transparent ledger. “Therefore, Bitcoin has been a cursed tool for anonymity, facilitating illicit activities and leading to legal action against offenders by the tracing of transactions,” they write.","Perhaps the only thing the authors got right is when they said the “decentralised nature of Bitcoin presents challenges for authorities, sometimes leading to unnecessary regulatory fatalism.” True, Bitcoin exists for a reason — whether they want to examine that or not — but it doesn’t mean that the use of this network cannot be appropriately regulated.","The ECB would be better off doing just that, rather than predicting Bitcoin’s death for the thousandth time."],"entity":[{"type":"$2.4","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"ECB","content":"ORGANIZATION"},{"type":"E.U.","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"European Central Bank (ECB","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"$17,000","content":"MONEY"},{"type":"$51K","content":"MONEY"},{"type":"Crypto Money Laundering","content":"ORGANIZATION"},{"type":"spring","content":"DATE"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"euro","content":"ORGANIZATION"},{"type":"Bindseil","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Jürgen Schaaf","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Chainalysis","content":"LOCATION"},{"type":"autumn of 2023","content":"DATE"},{"type":"$69,000","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"Ulrich Bindseil","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Crypto Vibe Shift","content":"ORGANIZATION"},{"type":"Schaaf","content":"PERSON"},{"type":"99.5%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","ECB","Central Bank","Bitcoin","Crime"],"authors":["Daniel Kuhn"]}