{"summary":"Genesis requested a New York bankruptcy court to bar ownership changes to secure tax benefits on around $700 million worth of operating losses.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/19\/dcg-cant-sell-or-reduce-ownership-of-genesis-until-bankruptcy-proceedings-close-judge-rules\/","publishDate":"2023-12-19T10:17:42","id":14910,"type":null,"title":"DCG Can't Sell or Reduce Ownership of Genesis Until Bankruptcy Proceedings Close, Judge Rules","category":["Policy"],"content":["Bankrupt crypto lender Genesis has won a bid to block its parent Digital Currency Group (DCG) from selling or reducing ownership in the company until Chapter 11 proceedings come to a close.","By barring any changes to ownership, Genesis sought to secure certain tax benefits, a court order issued on Monday shows. The benefits are only applicable if Genesis remains part of the tax-consolidated group of which DCG is the common parent.","Should DCG’s ownership of the lender fall below 80%, Genesis stands to lose benefits on around $700 million worth of “federal net operating loss carryforwards,” a motion requesting the block from November shows.","The carryforwards can be used to decrease Genesis’ federal income tax liability in current and future years, the motion said, adding that could “translate into future tax savings that would enhance the Debtors’ cash position for the benefit of all parties in interest and contribute to a successful reorganization.”","Genesis’ carryforwards are directly linked to the failure of the crypto hedge fund Three Arrows Capital in 2022, according to the motion. The lender filed for bankruptcy in January, after what was a tumultuous year for crypto, which saw several high-profile firms collapse one after the other.","Edited by Parikshit Mishra.","\n","\n"],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"80%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"$700 million","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["Regulations","Genesis","Digital Currency Group","Bankruptcy"],"authors":["Sandali Handagama"]}