{"summary":"The presence of U.S. nationals on the platform has been a contentious issue for authorities as, officially, they are banned but continue to pop up.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/19\/binance-asks-prime-brokers-to-enhance-kyc-to-block-us-nationals-bloomberg\/","publishDate":"2024-03-19T08:08:05","id":14918,"type":null,"title":"Binance Asks Prime Brokers to Enhance KYC to Block U.S. Nationals: Bloomberg","category":["Policy"],"content":["Binance is asking its prime brokers to do enhanced Know Your Customer (KYC) work on clients to ensure that they aren’t serving U.S. nationals, according to a report from Bloomberg.","Prime Brokers act as intermediaries between institutional investors and the market, offering services such as custody, trade execution, risk management, and lending with the aim of attracting institutional investors by providing a comprehensive end-to-end service model similar to their counterparts in traditional finance.","After Binance pleaded guilty to breaking sanctions and money-transmitting laws, settling the case for $4.3 billion, it has required prime brokers like FalconX and Hidden Road to collect additional client information, including office addresses and the locations of employees and founders, along with signed attestations verifying the accuracy of the information, Bloomberg reported.","“Binance is fully committed to compliance and has made public how it assesses end users who can access the Binance platform,\" the exchange said in a statement published on Bloomberg. “By making its standard transparent, Binance gives clarity to enterprises who want to access its market-leading liquidity.”","In court documents unsealed in November, it was revealed that Binance’s rapid growth was significantly fueled by U.S. customers, a practice deemed illegal by U.S. authorities due to the exchange’s lack of registration as a U.S. business, CoinDesk previously reported.","Despite knowing the risks, Binance’s ex-CEO Changpeng \"CZ” Zhao and other officials encouraged high-value U.S. clients to conceal their connections to the U.S. through methods such as using VPNs to hide their IP addresses and an API to access the main exchange, court documents revealed at the time.","Edited by Parikshit Mishra."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"November","content":"DATE"}],"hashtag":["Binance","Changpeng \"CZ\" Zhao","Changpeng Zhao"],"authors":["Sam Reynolds"]}