{"summary":"Libre protocol’s fund tokenization infrastructure platform powered by Polygon technology has gone live.\nDeveloped by Nomura’s Laser Digital and WebN Group, institutional heavyweights Brevan Howard and Hamilton Lane are set to be the first to use the platform.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/283296\/polygon-libre-protocol-brevan-howard-hamilton-lane-funds","publishDate":"2024-03-19T06:00:02","id":1492,"type":null,"title":"Polygon-based tokenization platform Libre goes live for Brevan Howard, Hamilton Lane funds","category":["Infrastructure"],"content":["Libre, an institutional web3 infrastructure protocol for the issuance and distribution of tokenized alternative assets, has gone live for eligible investors today.","Developed by WebN Group and Laser Digital powered by Polygon technology, Libre was initially <a href=\"https:\/\/www.theblock.co\/post\/271230\/nomura-laser-digital-unveils-polygon-powered-libre-protocol-brevan-howard\" data-v-f87c67ca=\"\">unveiled<\/a> in January, with institutional heavyweights Brevan Howard and Hamilton Lane lined up to be the first to use the platform.","Laser Digital is the crypto arm of financial services firm Nomura. WebN Group is an incubation hub for fintech and web3 innovators, backed by Laser Digital and Brevan Howard co-founder Alan Howard. The companies have also worked closely with Polygon Labs in developing the protocol.","Libre is not the only project working on the tokenization of funds. In November, JPMorgan’s Onyx <a href=\"https:\/\/www.theblock.co\/post\/263109\/jpmorgan-apollo-axelar-oasis-pro-provenance-blockchain-interoperability\" data-v-f87c67ca=\"\">teamed up<\/a> with asset and wealth managers to tokenize, purchase and rebalance real-world asset positions across multiple blockchains. In the same month, ​​SC Ventures, the investment and innovation arm of Standard Chartered, <a href=\"https:\/\/www.theblock.co\/post\/263035\/standard-chartered-sc-ventures-tokenization-libeara\" data-v-f87c67ca=\"\">launched<\/a> a tokenization platform called Libeara.&nbsp;","Libre primarily concentrates on alternative investments but also offers access to money market funds from firms like BlackRock, allowing investors to securely place their funds with the flexibility to shift into alternative markets, according to a statement.","\"Libre’s objective is to provide unprecedented access to top-tier alternative investments complemented by provisioning scalable value-add services, such as the money market facility that we have launched, followed by our collateralised lending service targeted for later this year,” Libre founder Dr. Avtar Sehra said.","Utilizing asset tokenization and smart contracts, Libre is designed for the regulatory-compliant issuance and management of alternative investments. The protocol is built using the Polygon Chain Development Kit (<a href=\"https:\/\/www.theblock.co\/post\/247873\/polygon-labs-chain-development-kit\" data-v-f87c67ca=\"\">CDK<\/a>), which enables the development of purpose-built, zero knowledge-powered Layer 2 blockchains on Ethereum.","The project is also working toward integrating with other Layer 1 and Layer 2 networks via the Libre Gateway, enabling accredited, professional and institutional investors on other networks to access top-tier alternative investments and money market funds provisioned via Libre.","“As the foundation and infrastructure settle for the tokenization of institutional financial instruments, innovative use cases will become the next phase of development,” Polygon Labs Global Head of Institutional Capital Colin Butler, said. “We are thrilled to be able to foster this entry point for tier-1 funds on Libre, and see the Gateway as the foundation of a radically improved global financial system.”"],"hashtag":["INVESTMENT FIRMS","POLYGON"]}