{"summary":"Staking is a popular way to earn passive income with your crypto investments. Here’s how you can start.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/crypto-staking-101-what-is-staking\/","publishDate":"2022-09-16T21:09:50","id":14923,"type":null,"title":"Crypto Staking 101: What Is Staking?","category":["Learn"],"content":["Staking offers crypto holders a way of putting their digital assets to work and earning passive income without needing to sell them.","You can think of staking as the crypto equivalent of putting money in a high-yield savings account. When you deposit funds in a savings account, the bank takes that money and typically lends it out to others. In return for locking up that money with the bank, you receive a portion of the interest earned from lending – albeit a very very low portion.","Similarly, when you stake your digital assets, you lock up the coins in order to participate in running the blockchain and maintaining its security. In exchange for that, you earn rewards calculated in percentage yields. These returns are typically much higher than any interest rate offered by banks.","Staking has become a popular way to make a profit in crypto without trading coins.","Staking is only possible via the proof-of-stake consensus mechanism, which is a specific method used by certain blockchains to select honest participants and verify new blocks of data being added to the network.","By forcing these network participants – known as validators or “stakers” – to purchase and lock away a certain amount of tokens, it makes it unattractive to act dishonestly in the network. If the blockchain was corrupted in any way through malicious activity, the native token associated with it would likely plummet in price, and the perpetrator(s) would stand to lose money.","The stake, then, is the validator’s “skin in the game” to ensure they act honestly and for the good of the network. In exchange for their commitment, validators receive rewards denominated in the native cryptocurrency. The bigger their stake, the higher chance they have to propose a new block and collect the rewards. After all, the more skin in the game, the more likely you are to be an honest participant.","The stake does not have to consist exclusively of one person’s coins. Most of the time, validators run a staking pool and raise funds from a group of token holders through delegation (acting on behalf of others) – lowering the barrier to entry for more users to participate in staking. Any holder can participate in the staking process by delegating their coins to stake pool operators who do all the heavy lifting involved with validating transactions on the blockchain.","Read more: Top Cryptocurrencies You Can Stake: An In-Depth Guide","To keep validators in check, they can be penalized if they commit minor breaches such as going offline for extended periods of time and can even be suspended from the consensus process and have their funds removed. The latter is known as “slashing” and, while rare, has happened across a number of blockchains, including Polkadot and Ethereum.","Every blockchain has its own set of rules for validators. Ethereum’s blockchain, for example, requires each validator to stake at least 32 ether, which is worth around $45,000 as of Sept. 16, 2022.","As mentioned already, staking is only possible with cryptocurrencies linked to blockchains that use the proof-of-stake consensus mechanism.","The most notable cryptocurrencies you can stake include:","Read more: How Does Ethereum Staking Work?","To begin staking you first have to own digital assets that can be staked. If you’ve already bought some, you’ll need to transfer the coins from the exchange or app you bought them on to an account that allows staking.","Most of the bigger crypto exchanges, such as Coinbase, Binance and Kraken, offer staking opportunities in-house on their platform, which is a convenient way to put your coins to work.","If you are looking for a way to maximize rewards, there are platforms that specialize in finding the highest interest rates for your digital assets. Examples of these staking-as-a-service platforms include:","It’s worth noting that any coins you delegate to a staking pool are still in your possession. You can always withdraw your staked assets, but there’s usually a waiting time (days or weeks) specific to each blockchain to do so.","It is also possible to become a validator and run your own staking pool. However, this needs much more attention, expertise and investment to do successfully. Not to mention, to become a validator on certain blockchains you’ll need to source sufficient funds from delegate stakers before you can even start.","As with every type of investing, especially in crypto, there are risks you need to consider.","Staking is a good option for investors interested in generating yields on their long-term investments and aren’t bothered about short-term fluctuations in price.","According to data, the average staking reward rate of the top 261 staked assets surpasses 11% annual yield. It’s important to note, though, that rewards can change over time.","Fees also affect rewards. Staking pools deduct fees from the rewards for their work, which affects overall percentage yields. This varies greatly from pool to pool, and blockchain to blockchain.","You can maximize rewards by choosing a staking pool with low commission fees and a promising track record of validating lots of blocks. The latter also minimizes the risk of the pool getting penalized or suspended from the validation process.","Read More: Top Questions About Proof-of-Stake and Staking Answered"],"entity":[{"type":"$45,000","content":"MONEY"},{"type":"Depth Guide","content":"ORGANIZATION"},{"type":"Sept. 16, 2022","content":"DATE"},{"type":"11%","content":"PERCENT"},{"type":"Binance","content":"PERSON"}],"hashtag":["Technology","Beginner","Learn"],"authors":["Krisztian Sandor"]}