{"summary":"Web3 infrastructure provider Cubist raises $7 million to build tools that will help developers starting with an open-source SDK.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/218092\/polychain-capital-leads-web3-dev-tool-provider-cubists-7-million-raise","publishDate":"2023-03-09T07:34:40","id":1492,"type":null,"title":"Polychain Capital leads web3 dev tool provider Cubist&#x27;s $7 million raise","category":["DEALS"],"content":["Cubist secured $7 million in a seed round for its project which aims to help make web3 development easier.","The seed round is led by Polychain Capital and also sees participation from Dao5, Polygon, Axelar, Amplify Partners and Blizzard, the company said in a release.","The infrastructure startup is co-founded by Ann Stefan, a former fraud operations specialist, as well as Riad Wahby, Fraser Brown and Deian Stefan, who are computer security professors that have taught at institutions such as Carnegie Mellon University and UC San Diego.","\"The thing that really got us excited at first was playing around with existing tooling and realizing just how much it left you twisting in the wind,\" said Wahby, who is also the CEO of Cubist, in an interview. \"It's so risky to build these applications that have so much money sloshing around inside and yet the tooling doesn't help you get things right.\"","The idea for the startup formed from the co-founders recognition that a lot of their academic work exploring how to build secure systems applied to the web3 space.","\"Where we're coming from with a high level is we don't want web3 developers to have to think about the underlying technology that their applications are running on, which is what they have to do today,\" Stefan said.","The long-term goal is to offer a set of security focused tools that developers can use from start to finish when deploying a decentralized application, Stefan said. The first piece of that puzzle is an open-source software development kit (SDK), which will enable developers to think about writing applications as if it all runs on one chain, Wahby said.","\"There's a configuration file that you specify, 'Well, this contract is gonna run on this chain, this contract is going to run this chain [and] this is my bridging provider' and all of that glue code that makes that happen gets generated automatically,\" he added.","The configuration file also makes it easier for developers to add new chains or change bridging providers by abstracting away those complexities, Stefan said. The SDK currently supports popular Ethereum Virtual Machine(EVM) blockchains such as Polygon, Ethereum and Avalanche subnets, Stefan added.&nbsp;","\"Most of our code is written in Rust,\" Wahby said. \"One of the reasons it's possible is just because several&nbsp; people on the team are compiler experts and really understand program analysis and how to build this tooling that really looks at the developer code and extends it in a really systematic and nice way.\"","The startup is hoping to ride the wave of the web3 industry professionalizing and making a move toward adopt development best practices such as continuous integration and deployment as well as strong documentation. It will earn revenue from offering enterprise features to businesses.","\"Everyone's got a free GitHub account but a lot of companies also pay extra on top of that,\" Wahby said. \"I think value add on top of great tooling that is open and available and extensible is a model that's very familiar.\"","The seed round closed in July. The funds from the round will be put toward hiring as well as scaling and publicizing the SDK.","\"By positioning themselves at the union between security, efficiency and developer familiarity, Cubist is defining the next iteration of developer platforms to bring a better experience for all in web3,” said Luke Pearson, senior research cryptographer, at Polychain Capital in the release.","<em data-v-f87c67ca=\"\">This story has been updated to correct the spelling of Riad Wahby's name.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"Axelar","content":"LOCATION"},{"type":"Fraser Brown","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"SDK","content":"ORGANIZATION"},{"type":"Amplify Partners","content":"ORGANIZATION"},{"type":"UC San Diego","content":"ORGANIZATION"},{"type":"Wahby","content":"PERSON"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Stefan","content":"PERSON"},{"type":"Luke Pearson","content":"PERSON"},{"type":"Deian Stefan","content":"PERSON"},{"type":"Carnegie Mellon University","content":"ORGANIZATION"},{"type":"Riad Wahby","content":"PERSON"},{"type":"Ann Stefan","content":"PERSON"},{"type":"Riad Wahby","content":"ORGANIZATION"}],"hashtag":["SEED &AMP; PRE-SEED"],"authors":["Kari McMahon","The Block"]}