{"summary":"Mining operations are expected to start next week at Argo&#x27;s new facility in Texas.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/145257\/argos-texas-flagship-facility-has-been-energized","publishDate":"2022-05-05T11:30:43","id":1493,"type":null,"title":"Argo&#x27;s Texas &#x27;flagship&#x27; bitcoin mining facility has been energized","category":["MINING"],"content":["Bitcoin miner Argo announced its new \"flagship\" facility in Dickens County, Texas has been energized and will start mining bitcoin next week.","The company is holding an inauguration ceremony on Thursday.","Argo expects that by the end of the year the new mining center will use 200 megawatts of power and increase its total hashrate by 243% to 5.5 exahash per second (EH\/s).","\"We started construction on the facility in July 2021 and it is a tremendous achievement that the site will commence mining operations in less than 12 months,\" said CEO Peter Wall.","Delivery and installation of mining machines has started and will continue in the next few months. Argo bought 20,000 Bitmain S19J Pro machines in September of last year. Additionally, it <a href=\"https:\/\/www.theblockcrypto.com\/linked\/137672\/argo-blockchain-and-core-scientific-swap-bitcoin-mining-fleets\" data-v-f87c67ca=\"\">closed a swap deal with Core Scientific<\/a> to receive approximately 10,000 units already hosted by the latter.","The company secured several millions of dollars in the past few months in order to support the expansion to Texas. Most recently, it announced an agreement with crypto financial services firm NYDIG for <a href=\"https:\/\/www.theblockcrypto.com\/linked\/145064\/argo-secures-up-to-70-6-million-in-loans-for-texas-mining-facility\" data-v-f87c67ca=\"\">up to $70.6 million in financing<\/a>.","The Texas facility, dubbed Helios, has access to an extra 600 megawatts of energy, which the company plans on using in future development phases in years to come, per the announcement. If used to full capacity, it could put Argo's hashrate close to 20 EH\/s, the company said.","Argo is headquartered in London, UK and has two other facilities in Quebec. It is listed on the London Stock Exchange and launched an IPO in the United States last year.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"September of last year","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$70.6 million","content":"MONEY"},{"type":"Peter Wall","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"243%","content":"PERCENT"},{"type":"Stock Exchange","content":"ORGANIZATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"last year","content":"DATE"},{"type":"London","content":"LOCATION"},{"type":"several millions of dollars","content":"MONEY"},{"type":"July 2021","content":"DATE"},{"type":"Dickens County","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Quebec","content":"LOCATION"}],"hashtag":[],"authors":["Catarina Moura","The Block"]}