{"summary":"“All funds seem to be gone,” an admin originally posted on FTX’s official channel, claiming the crypto exchange had been hacked.\nThey also said its applications are malware and its website may download Trojan viruses.","author":["Mike Truppa","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/186289\/ftx-claims-it-has-been-hacked-of-all-of-its-funds-website-and-mobile-app-compromised","publishDate":"2022-11-12T00:52:14","id":1494,"type":null,"title":"FTX Telegram admin claims exchange hacked","category":["Security"],"content":["An admin in FTX's official Telegram channel claimed the embattled crypto exchange may have been hacked for all its funds.&nbsp;A message was sent on Friday that&nbsp;<a href=\"https:\/\/t.me\/FTX_Official\/696038\" data-v-f87c67ca=\"\">stated<\/a> \"FTX has been hacked. All funds seem to be gone.\" The message has since removed the latter statement while claiming that \"some funds were retrieved.\"","Additionally, the admin claimed the FTX mobile app and website were compromised and could download malware and Trojan viruses onto peoples' devices.","On Twitter, FTX's official account <a href=\"https:\/\/twitter.com\/_Ryne_Miller\/status\/1591281729125613570\" data-v-f87c67ca=\"\">retweeted<\/a>&nbsp;that there may be \"abnormalities with wallet movements related to the consolidation of FTX balances across exchanges — unclear facts as other movements not clear.\"","FTX US General Counsel Ryne Miller has since explained that both FTX and FTX.US moved all remaining customer funds to cold storage, <a href=\"https:\/\/twitter.com\/_Ryne_Miller\/status\/1591326796305530880?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1591326796305530880%7Ctwgr%5Ebaf56bbc007c43ccf8f9e90315a72a9cb96def5b%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.coindesk.com%2Fbusiness%2F2022%2F11%2F12%2Fftx-says-it-moved-remaining-funds-to-cold-wallets-to-mitigate-damage-after-unauthorized-withdrawals%2F\" data-v-f87c67ca=\"\">tweeting<\/a>: \"Following the Chapter 11 bankruptcy filings — FTX US and FTX [dot] com initiated precautionary steps to move all digital assets to cold storage.\" They added that the \"process was expedited this evening — to mitigate damage upon observing unauthorized transactions.\"","This follows news that more than $400 million was <a href=\"https:\/\/www.theblock.co\/post\/186279\/over-400m-worth-of-tokens-ftx-funds-drained-from-company-accounts\" data-v-f87c67ca=\"\">drained<\/a> from FTX accounts to a single wallet address.","FTX's collapse roiled the crypto world this week, culminating in the firm <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">filing<\/a> for Chapter 11 bankruptcy protection and with the ouster of CEO Sam Bankman-Fried.&nbsp;","This story is developing.","<em data-v-f87c67ca=\"\">Update: Added Ryne Miller's information regarding transfers to cold storage.<\/em>","<em data-v-f87c67ca=\"\">Update: Specified that the claims came from an admin in FTX's official Telegram channel. Reflected later changes in the Telegram message. Added a retweet from FTX's official Twitter account.<\/em>"],"hashtag":["FTX","HACKS"]}