{"summary":"The U.K.’s Financial Conduct Authority (FCA) has today officially banned the sale of cryptocurrency derivatives and exchange-traded notes to retail users, more than a year after first proposing such a ban.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/79911\/uk-regulator-fca-bans-crypto-derivatives-retail-users","publishDate":"2020-10-06T06:35:09","id":1494,"type":null,"title":"UK regulator bans sale of crypto derivatives to retail users","category":["CRYPTOCURRENCY"],"content":["The U.K.’s Financial Conduct Authority (FCA) has today officially banned the sale of cryptocurrency derivatives and exchange-traded notes to retail users, more than a year after <a href=\"https:\/\/www.theblockcrypto.com\/linked\/30017\/uks-financial-watchdog-proposes-to-ban-crypto-derivatives-for-retail-investors\" data-v-f87c67ca=\"\">first&nbsp;proposing<\/a> such a ban.","The FCA <a href=\"https:\/\/www.fca.org.uk\/news\/press-releases\/fca-bans-sale-crypto-derivatives-retail-consumers\" data-v-f87c67ca=\"\">said<\/a> these products are “ill-suited” for retail consumers due to various reasons, including “extreme volatility” of cryptocurrencies. There is no legitimate investment need for retail consumers to invest in these products, said the regulator. Hacks, inadequate understanding, and cryptocurrencies’ “no reliable basis for valuation” are some other listed reasons for the ban.","“This ban reflects how seriously we view the potential harm to retail consumers in these products,\" said Sheldon Mills, interim executive director of strategy and competition at the FCA. \"Consumer protection is paramount here.\"","The ban will come into effect on January 6, 2021. The FCA estimates that retail consumers will save around £53 million (~$68 million) from the ban on these products.","The FCA's action will not only impact crypto derivative exchanges, but also crypto brokers, investment platforms, and financial advisers.","\"If your firm carries out marketing, distribution or selling activities in, or from, the UK of the relevant products to retail clients, you are required to cease these activities by 6 January 2021,\" said the FCA in a separate <a href=\"https:\/\/www.fca.org.uk\/publication\/policy\/ps20-10.pdf\" data-v-f87c67ca=\"\">policy statement<\/a>. \"Retail consumers with existing holdings can remain invested following the prohibition, until they choose to disinvest. There is no time limit on this, and we do not require or expect firms to close out retail consumers’ positions unless consumers ask for this.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\n<span data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">'Extremely disappointed'<\/strong><\/span>","\"We are extremely disappointed by the FCA's decision to include <a href=\"https:\/\/en.wikipedia.org\/wiki\/Delta_one\" data-v-f87c67ca=\"\">delta 1<\/a> exchange-traded notes (ETNs) in its ban on distribution of crypto derivatives to retail investors in the U.K.,\" Townsend Lansing, head of product at CoinShares, told The Block. \"We (and many other industry participants) put forward a number of reasons why such a ban would be ill-advised and would not benefit retail investors. Unfortunately, the FCA ignored those reasons (or dismissed them with little additional information).\"","Lansing said the ban on these ETNs would not result in the proposed savings and benefits. \"Rather, it will simply drive U.K. retail investors to unregulated crypto exchanges, which, as the FCA itself admits, have far fewer protections than the regulated ETNs offered by CoinShares and other providers.\"","According to Lansing, the timing of the ban is also \"unfortunate.\" He said other jurisdictions are now opening up to the crypto sector, such as the European Commission recently proposed regulatory regime for digital assets. \"We find it difficult to see how the U.K. can be seen as welcoming of digital asset innovation when it is the only Western jurisdiction to ban them based on an erroneous belief that they have 'no intrinsic value,'\" said Lansing.","Danny Scott, co-founder and CEO of U.K.-based crypto exchange CoinCorner told The Block that the ban doesn't affect \"bitcoin exchanges like ourselves, but it will affect companies such as Revolut and eToro that offer a CFD [contract for differences] rather than the asset itself.\"<br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nA Revolut spokesperson told The Block that the ban does not impact the firm as it does not offer CFDs\/derivatives or ETNs. \"Our customers own the crypto and we buy on their behalf,\" the spokesperson said.&nbsp;&nbsp;","<em data-v-f87c67ca=\"\">This story has been updated to include comments from CoinShares, CoinCorner, and Revolut executives.&nbsp;<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Danny Scott","content":"PERSON"},{"type":"the FCA","content":"ORGANIZATION"},{"type":"FCA","content":"ORGANIZATION"},{"type":"Sheldon Mills","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"European Commission","content":"ORGANIZATION"},{"type":"January 6, 2021","content":"DATE"},{"type":"$68 million","content":"MONEY"},{"type":"Lansing","content":"LOCATION"},{"type":"Townsend Lansing","content":"PERSON"},{"type":"U.K.’s Financial Conduct Authority (FCA","content":"ORGANIZATION"},{"type":"CoinShares","content":"ORGANIZATION"}],"hashtag":["FCA"],"authors":["Yogita Khatri","The Block"]}