{"summary":"He did incalculable harm, but arguing for a sentence longer than 25 years is unfair to the man and the industry he once represented.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/28\/sam-bankman-fried-deserves-a-life-after-prison\/","publishDate":"2024-03-28T16:49:30","id":14945,"type":null,"title":"Sam Bankman-Fried Deserves a Life After Prison","category":["Consensus Magazine"],"content":["It is patently absurd that Sam Bankman-Fried asked to receive no more than 6.5 years for what could be appropriately described as the crime of the century. It is also laughable that, in arguing for a lighter sentence, his newly hired defense counsel made appeals to SBF’s autism and veganism, and made hay of the full restitution his victims are likely to receive. A man’s diet is not a basis for leniency, and moreso, the FTX estate was able recover some, but not all, of the billions of dollars worth of missing assets, not because of Bankman-Fried’s help, but in spite of it.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","\"There are plenty of things we did not get back, like the bribes to Chinese officials or the hundreds of millions of dollars he spent to buy access to or time with celebrities or politicians or investments for which he grossly overpaid having done zero diligence,\" FTX CEO John J. Ray III, who is overseeing the exchange’s bankruptcy process, wrote in a March 20 memo. \"The harm was vast. The remorse is nonexistent.\"","Yet, to serve Sam Bankman-Fried with what would amount to a virtual life sentence would also have been insane. According to U.S. sentencing guidelines, Bankman-Fried faced up to 110 years in prison. The Department of Justice prosecutors who tried the case sought a 40-50 year sentence for SBF’s guilt in two counts of fraud and five counts of conspiracy. As Judge Lewis Kaplan said, “that would be more than necessary,” as he handed down a 25-year sentence.","Public opinion on the matter (such as it is) appears split, with many saying the sentence is too lenient. SBF will need to serve at least 85% of the 25 years, meaning the 32-year-old could walk in his early 50s. SBF violated the trust of his investors, customers and own employees. Dozens of victim statements speak to the shock and financial distress he caused, and the countless lives he threw off course. Judge Kaplan also ruled SBF attempted to obstruct justice, and perjured himself three times.","And yet, as the verdict is handed down today, the crypto industry might do well to wish SBF well. Putting aside the grisly statistics and realities of life in federal penitentiaries — including that the United States incarcerates five times more people per capita than most other countries, and the racial disparity in criminal justice — robbing SBF of his entire life for a non-violent crime would have been unconscionable. This is likely an unpopular opinion, given the harm SBF has caused to many crypto holders and the industry at large.","There is no point in arguing SBF’s guilt; whether or not he intended to deceive the world is moot. Significant harm was done. There is also no reason to believe SBF’s arguments that he could help clients better than the highly-paid bankruptcy lawyers currently doing that job. It’s clear SBF made no attempt to protect or recover clients’ funds until after the fraud was exposed. Likewise, there is no point in trying to answer the question of whether SBF, motivated by utilitarian aims of doing the most good in the world, turned bad or started that way.","There is also almost no viable defense of SBF that could be made. The dozens of character witnesses in his favor who painted a picture of a smart kid who got in over his head, or who is too sweet for hard prison life, are largely unconvincing. Barbara Fried, SBF’s mother, wrote that Sam is an “angel of mercy” who carries the pain of the world in his depressed mind, without any reference to his victims. And his charitable works don't count for anything; it's easy to give away other peoples’ money.","But wishing for someone to be locked up for decades — to never again have the opportunity to redeem themselves or make an attempt to do right is odd. Incarceration serves a few purposes: retribution for harms done to society, deterrence for others to commit similar crimes and as a matter of public safety. The prosecutors tried to argue there was a “significant likelihood” Bankman-Fried would commit more crimes upon release, asking for him to be locked up into his 80s.","See also: Lyn Ulbricht — Put America's Geeks to Work, Don't Cage Them | Opinion","Prison can also serve another purpose: reform. Although SBF’s lawyer Marc Mukasey told the judge that the FTX founder wasn’t a “ruthless financial serial killer” who set out to rob his customers, only a mind-reader could say for certain what his intentions were. It’s clear enough that SBF began dipping from customer accounts within a year of spinning up the FTX futures exchange and has expressed little remorse for his crimes. But, as human rights lawyer Clive Stafford Smith said: “Never judge a person only by their worst action.”","Demonizing SBF, sometimes called the “face of crypto,” is in effect a demonization of crypto in general. Crypto fans should hope that SBF is reformed and feels remorse in time, in the same way the industry itself should work to rid itself of fraud. I cannot comment on whether SBF’s effective altruism was ever sincere, but I want to believe there is the possibility of goodness in him, in the same way that crypto supporters believe that crypto can affect good in the world, despite its detractors.","In short: SBF deserves a life after prison.","CORRECTION (MARCH 28, 2024): Fixes age at which Sam Bankman-Fried could exit prison.","Edited by Benjamin Schiller."],"entity":[{"type":"Marc Mukasey","content":"PERSON"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"today","content":"DATE"},{"type":"Kaplan","content":"PERSON"},{"type":"Barbara Fried","content":"PERSON"},{"type":"Clive Stafford Smith","content":"PERSON"},{"type":"85%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Put America","content":"LOCATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"March 20","content":"DATE"},{"type":"50","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"Lyn Ulbricht","content":"PERSON"},{"type":"MARCH 28, 2024","content":"DATE"},{"type":"SBF","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["Opinion","FTX","Sam Bankman-Fried","The Node","Newsletters","Crime","Fraud"],"authors":["Daniel Kuhn"]}