{"summary":"The former FTX CEO was convicted of seven counts of fraud and conspiracy in November, a year after the once-giant cryptocurrency exchange collapsed.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/28\/sam-bankman-fried-ftx-sentencing\/","publishDate":"2024-03-28T13:30:00","id":14947,"type":null,"title":"Sam Bankman-Fried Sentenced to 25 Years in Prison","category":["Policy"],"content":["NEW YORK — Sam Bankman-Fried must spend 25 years in prison for the fraud and conspiracy scheme that ultimately undid his once-giant cryptocurrency exchange FTX, a federal judge ruled on Thursday.","As he prepared to deliver the sentence, Judge Lewis Kaplan said Bankman-Fried never offered \"a word of remorse for commission of terrible crimes.\" Kaplan said Bankman-Fried's attempt to craft a positive and altruistic persona in the public eye was, at least in part, \"an act.\" He rejected the defense's argument that Bankman-Fried was not at risk of committing future crimes., \"Mr. Bankman-Fried's name is pretty much mud right now around the world,\" but he is \"persistent\" and \"a great marketing guy,\" said the judge while explaining why the FTX CEO deserved a lengthy sentence.","Kaplan judge announced his decision after a two-hour hearing in a Manhattan courtroom during which prosecutors, Bankman-Fried's attorney, a victim, a lawyer who spoke on behalf of other FTX victims and Bankman-Fried himself delivered comments. This followed Bankman-Fried's conviction on seven criminal counts in November, a year after FTX filed for Chapter 11 bankruptcy. The former FTX CEO will appeal his conviction, according to his lawyer Thursday, a process that couldn't begin until Kaplan's sentencing decision.","Bankman-Fried was also fined $11 billion, which includes forfeiture agreements to sell assets like a private jet.","\"Today's sentence will prevent the defendant from ever again committing fraud and is an important message to others who might be tempted to engage in financial crimes that justice will be swift, and the consequences will be severe,\" Damian Williams, U.S. Attorney for the Southern District of New York, said in a statement on social media platform X. \"The scale of his crimes is measured not just by the amount of money that was stolen, but by the extraordinary harm caused to victims, who in some cases had their life savings wiped out overnight.\"","Bankman-Fried’s attorney Mark Mukasey told Judge Kaplan that his client “doesn’t make decisions with malice in his heart – he makes them with math in his head,” adding “Anybody who really knows Sam, they’ll say he’s not a greedy, power hungry fiend…really, he’s an awkward math nerd.”","Mukasey repeatedly referenced Bankman-Fried’s autism and social awkwardness, and his commitment to altruism, calling him “a beautiful puzzle” with “a tireless work ethic and a completely, off the chart, mind-blowing intellect,” and asked the judge to not destroy the prime of his client’s life.","“Don’t deprive him of the opportunity to meet a partner and have a baby,” Mukasey told the court.","When it was his turn to speak, Bankman-Fried said he was more concerned with the FTX customers waiting for their money to be returned than his “emotional life” or “hypothetical future kids.”","\"My useful life is probably over. It's been over for a while now,\" said Bankman-Fried, who has spent the last six months in the notorious Metropolitan Detention Center (MDC) in Brooklyn.","As he walked into the courtroom on Thursday – his parents and a crowd of assorted onlookers watching on from the court's viewing gallery – Bankman-Fried was noticeably thinner than he had been during last year's trial. Bankman-Fried's signature curly mop of hair – which had been trimmed down for his October trial – looked fuller but more unkempt than it had previously.","Bankman-Fried, wearing a tan prison jumpsuit with short sleeves, spoke for several minutes as a U.S. Marshall stood directly behind him. Bankman-Fried repeated his long-standing claim that \"there were enough assets, there are enough assets\" for FTX's creditors to get paid back in full.","Bankman-Fried told the court that righting the ship after his company’s self-induced “liquidity crisis” – which he called “in part, my doing” – would have made for “an unpleasant few weeks,” but he insisted “FTX would have survived” even if Alameda, the trading shop he tried to rescue using FTX customer funds, was forced to shut down.","Even if creditors do receive their funds back now, they would be \"deprived of the gains\" seen by the broader crypto market over the past several months, he said, echoing a concern stated by FTX creditors in victim impact statements filed by the DOJ over the past few weeks.","Bankman-Fried extended compliments to three of his former friends – and key government witnesses – Nishad Singh, Gary Wang and Caroline Ellison, expressing regret for his lead role in FTX's collapse. “I’m sorry about what happened at every stage…at the end of the day, I failed everyone I cared about,” Bankman-Fried said, adding, \"I was responsible.\"","Bankman-Fried spoke after an FTX creditor and an attorney who represents a class action suit against the bankruptcy estate – both of whom used their time to claim that the FTX bankruptcy estate is mishandling customer funds. All three said the estate's proposed payouts to creditors are lower than they should be given current market prices.","Adam Moskowitz, the attorney who represents the class, offered a line of support for Bankman-Fried during his brief statement before the court, saying the former CEO – alongside other former FTX executives – had helped his team recover some of the funds FTX had lost.","\"Sam and his team have been helpful to us,\" he said. \"I would ask on behalf of the victims that you honorably and respectfully consider [that].\"","Bankman-Fried faced up to a century in prison, based on a report from a probation officer. Kaplan wasn't bound to this recommendation. Bankman-Fried's defense team – a different group of lawyers than the ones who represented him during the five-week trial – asked for no more than 6 1\/2 years, while U.S. Department of Justice prosecutors sought 40 to 50 years behind bars.","During his reading of the sentence, the judge virtually eviscerated Bankman-Fried and his testimony during last year's trial.","Bankman-Fried posed \"enormous harm\" to creditors, had demonstrated \"exceptional flexibility with the truth\" during his testimony and showed an \"apparent lack of remorse.\"","\"When he wasn't outright lying, he was evasive, hair-splitting [and] dodging questions,\" the judge said, adding that he was \"trying to get the prosecutor\" to rephrase questions.","Despite his apparent frustration with Bankman-Fried, Kaplan ultimately decided that 50 years in prison – let alone 100 – was \"substantially greater than is necessary\" and recommended that he serve out his sentence in a medium or low-security federal prison. He additionally recommended that the prison be as close to the San Francisco Bay Area, where Bankman-Fried is from, as possible, to facilitate family visitation.","Kaplan said that his recommendation was based on Bankman-Fried’s lack of violent history and the fact that his notoriety, autism diagnosis, and association with wealth would make him extra vulnerable in a maximum security prison.","Bankman-Fried will need to serve a minimum of 85% of his sentence, a requirement established by the Sentencing Reform Act of 1984, which allows for a maximum of 15% of a federal sentence allowed to be shaved off for good behavior. This is of course, dependent on what his appeal looks like and whether it is successful. His team has 14 days to file an appeal from the day the sentence is entered into the record, which Judge Kaplan said may happen as soon as later Thursday.","The DOJ said Bankman-Fried deserved a severe penalty, citing the fact that FTX, which was once valued at $32 billion, lost essentially all its money due to his malfeasance. During the trial, prosecutors said Bankman-Fried stole $8 billion of customer money to fund venture-capital investments, real-estate purchases, political donations and more. Prosecutors submitted dozens of victim impact statements from former FTX customers as evidence, saying the sheer scale of the fraud Bankman-Fried was convicted on supported a harsher penalty – though one that was half what he technically could face.","Defense lawyers argued, on the other hand, that Bankman-Fried didn't intend to defraud customers, had shown remorse and had attempted to resolve FTX's bankruptcy after it began, saying the DOJ's proposal was extreme. Their supporting letters spoke more to Bankman-Fried as a person than to FTX and its collapse, with writers pointing to his veganism and anecdotes from his youth. Several letters said Bankman-Fried appeared to be neurodivergent and thus might not have understood the severity of the situation. Former New York Police Department officer Carmine Simpson, his fellow inmate in a Brooklyn detention facility who pleaded guilty to soliciting a minor, wrote a letter saying Bankman-Fried, a vegan, has been forced to eat poorly in jail.","Read all of CoinDesk's SBF trial coverage here.","CORRECTION (March 28, 2024, 15:48 UTC): Corrects the story after Reuters changed their report on the length of SBF's sentence.","UPDATE (March 28, 2024, 15:59 UTC): Updates with quotes from the judge.","UPDATE (March 28, 2024, 16:08 UTC): Updates with quotes from Sam Bankman-Fried.","UPDATE (March 28, 2024, 16:11 UTC): Updates with quotes from Damian Williams.","UPDATE (March 28, 2024, 17:37 UTC): Adds additional details throughout from hearing.","Edited by Nick Baker."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"New York Police Department","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"1984","content":"DATE"},{"type":"Today","content":"DATE"},{"type":"Mukasey","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Kaplan","content":"PERSON"},{"type":"Damian Williams","content":"PERSON"},{"type":"Adam Moskowitz","content":"PERSON"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Nick Baker","content":"PERSON"},{"type":"NEW YORK","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Sam","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"Carmine Simpson","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"Marshall","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"March 28, 2024","content":"DATE"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Lewis Kaplan","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$11 billion","content":"MONEY"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Fried","content":"ORGANIZATION"},{"type":"MDC","content":"ORGANIZATION"},{"type":"85%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"San Francisco Bay Area","content":"LOCATION"},{"type":"the Southern District of New York","content":"ORGANIZATION"},{"type":"Brooklyn","content":"LOCATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"Mark Mukasey","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"$8 billion","content":"MONEY"}],"hashtag":["Sam Bankman-Fried","SBF Trial","FTX Collapse","top news"],"authors":["Nikhilesh De","Sam Kessler","Cheyenne Ligon"]}