{"summary":"The new BTC supply added to the market could drop to $30 million per day, according to Bitfinex.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/23\/bitcoins-post-halving-demand-to-be-5x-greater-than-supply-bitfinex-estimates\/","publishDate":"2024-04-23T07:22:36","id":14951,"type":null,"title":"Bitcoin's Post-Halving Demand to Be 5x Greater Than Supply, Bitfinex Estimates","category":["Markets"],"content":["Bitcoin's (BTC) recent mining reward halving has altered the market in such a way that it could potentially lead to cryptocurrency's demand being five times greater than that of supply, according to the latest projection by analysts at the crypto exchange Bitfinex.","On Saturday, the per-block reward paid to miners was cut in half to 3.125 BTC from 6.25 BTC. Per Bitfinex, the halving of rewards means the notional value of the total number of new coins added to the supply daily could drop to $30 million. That's a significant decrease, equating to five times less than the average daily demand for the U.S. spot ETFs.","\"With the daily issuance rate declining post-halving, we estimate that the new supply added to the market (new BTC mined) would amount to approximately $40-$50 million in USD-notional terms based on issuance trends. It is expected that this could possibly drop over time to $30 million per day, including active and dormant supply as well as miner selling, especially as smaller miner operations are forced to shut down shop,\" analysts at Bitfinex said in a report shared with CoinDesk.","\"The average daily net inflows from spot Bitcoin ETFs dwarf that number at over $150 million, even though flows have moderated and even turned net negative over recent weeks,\" analysts added.","The supply squeeze has already begun. Since halving, the total number of new coins added to the supply daily has dropped to 450 BTC (nearly $30 million) from the pre-halving four-year average of around 900 BTC, data from Glassnode show.","Nearly a dozen spot-based ETFs began trading in the U.S. on Jan. 11, allowing investors to take exposure to cryptocurrency without owning it. Bitfinex is assuming that the average daily inflows into ETFs since inception will remain constant in the coming months.","While it remains to be seen if they do, miner selling could slow. Miners or entities responsible for minting coins ran down their coin inventory in months leading up to the halving to fund equipment upgrades to ensure post-halving sustainability of operations. Data tracked by Glassnode show that in six months leading up to the halving, the number of coins held in wallets tied to miners fell by over 18,000 BTC to 1.82 million BTC.","Lastly, according to Bitfinex, investors are again increasingly taking direct custody of their coins, weakening the market's supply side.","\"Current on-chain data indicates that Bitcoin exchange outflows are reaching peaks not seen since January 2023, suggesting that many investors are moving their holdings to cold storage in anticipation of price increases,\" analysts at Bitfinex said.","\"Meanwhile, the active selling by long-term holders has not precipitated the typical pre-halving price drop yet, indicating a robust absorption of this selling pressure by new market entrants,\" analysts added.","Bitcoin changed hands at $66,660 at press time, up over 5% since halving, defying expectations of a price correction. The CoinDesk 20 Index, a broader market gauge, has risen nearly 7%, CoinDesk data show.","Edited by Parikshit Mishra."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"$40","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitfinex","content":"LOCATION"},{"type":"Bitfinex","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"USD","content":"LOCATION"},{"type":"Jan. 11","content":"DATE"},{"type":"$150 million","content":"MONEY"},{"type":"Glassnode","content":"ORGANIZATION"},{"type":"Saturday","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"$66,660","content":"MONEY"}],"hashtag":["Bitcoin","Markets","Bitfinex","Halving"],"authors":["Omkar Godbole"]}