{"summary":"While the floor price of Bored Ape Yacht Club is down, determining the value of an individual NFT in the collection requires a more nuanced understanding of floor price, rarity traits and cultural significance.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/07\/06\/is-justin-biebers-ape-really-worth-59000-the-nuances-of-valuing-nfts\/","publishDate":"2023-07-06T23:30:32","id":14955,"type":null,"title":"Is Justin Bieber’s Ape Really Worth $59,000? The Nuances of Valuing NFTs","category":["Web3"],"content":["Last week, the floor price of popular non-fungible token (NFT) collection Bored Ape Yacht Club fell below 30 ETH, sinking to a 20-month low. It’s hard to pinpoint exactly why the collection’s floor price has dropped so dramatically, though it’s likely due to a combination of factors – there’s been a broader cooldown in the NFT market that has impacted many of the top NFT collections and an extended crypto winter has affected the price of Ethereum, which powers most NFT collections.","The fact that BAYC – long ranked as one of the top collections across NFT marketplaces – has experienced such a steep decline in floor price has some critics knocking it as a fall from grace.","One popular tweet circulating on Twitter singled out a Bored Ape NFT acquired by Justin Beiber in January 2022 for $1.3 million. According to the tweet, the Ape is now only worth about $59,000. Media quickly picked it up and labeled it a loss for Bieber, who has not yet sold the NFT.","As it turns out, determining the value of an NFT is slightly more nuanced than that. While floor price is a helpful metric that indicates the lowest price a seller wants for an NFT in a given collection, it often does not reflect every NFT in a 10,000-edition collection.","There are many factors that go into determining how valuable an NFT is, according to industry experts. There’s the floor price, which best reflects the perceived value of the most basic NFTs in a collection. And then there’s the price of Ethereum, which can fluctuate greatly on a given day. But there are also individual factors that make one NFT more valuable than its neighbor, including its cultural significance, its rarity ranking and a collector’s personal affiliation to the asset.","Many generative art NFT collections have embedded rarity traits. This is why collections like Bored Ape Yacht Club or CryptoPunks have become so popular as profile pictures (PFPs) on social networks like Twitter – showing off a rare PFP carries the same social significance as owning an expensive handbag.","“Rarity traits refer to unique characteristics of an NFT, such as limited edition releases, exclusive features or special attributes,” Oliver Cohen, president of NFT analytics tool Inspect, told CoinDesk. “These traits contribute to the perceived scarcity and desirability of an NFT, which can affect its value.”","Deep NFT Value is a tool that uses machine learning to analyze high-value NFT collections based on previous sales, current market conditions and rarity traits. Founder and CEO Nikolai Yakovenko told CoinDesk that in the case of Bored Ape Yacht Club, NFTs with “gold fur,” “trippy fur” and “blue beams” have historically sold for the most money and continue to be the most valuable. In addition, Apes with a combination of traits are sometimes considered to be rare and are therefore more valuable.","“Generally speaking, these traits keep their \"premium\" on the floor, as that moves,” he explained, noting that as the floor price of a collection moves up or down, Apes with rare traits typically remain proportionately priced.","“If the floor price – or common Apes – goes up by 20%, then the premiums also go up by 20%,” said Yakovenko. “That changes over time, but day to day you look at the historical premium and the floor price movement, since rare pieces don't trade that often but the floor price trades all day long.”","Deep NFT Value’s algorithm “scores” an NFT in a collection based on its proportion to the floor price – for example, this Ape is estimated to be worth 4.4 times the floor price, according to its traits.","Still, Yakovenko noted that these can numbers can change due to supply and demand and depending on the market’s appetite for common versus rare Apes.","“Of course when the model sees market signals – sales, bids and listings – that contradict our estimates, then the model adjusts,” he said.","Despite dips, collectors who purchase rarer NFTs may fare better in the long term, according to Sara Gherghelas, an analyst at analytics platform DappRadar.","\"NFTs with certain rarity traits or cultural significance may retain or even increase their value despite the collection’s overall decrease,\" she told CoinDesk.","The cultural significance of a particular NFT can also factor into its price. For example, in Jack Butcher’s Checks VV, NFTs with notable edition numbers like #1 or #420 can sell for more than the floor price.","“NFTs associated with influential artists, iconic moments or significant cultural events may carry higher value due to their historical or artistic importance,” said Cohen, noting that a collection’s cultural significance can fluctuate over time. “If a collection has gained significant popularity and recognition, individual tokens within that collection may see an increase in value due to the overall reputation and demand.”","NFT collection Pudgy Penguins is an example of an NFT collection that recently experienced a major upswing thanks to a change in leadership.","Another example of a culturally significant NFT that sold well above its collection’s floor price was Dmitri Cherniak's Ringers #879, affectionately known as “The Goose” because of how closely the generative artwork resembles the bird.","The NFT, which was previously owned by liquidated hedge fund Three Arrows Capital, sold for $6.2 million at auction last month – far higher than the collection’s floor price of 44.5 ETH, or about $75,000 at the time, according to data from OpenSea.","The fact that the NFT was previously owned by a major hedge fund may have also boosted the hype around its sale, though Yakovenko said that prior ownership does not factor into Deep NFT Value's algorithm.","“We do not factor in the ownership history of an Ape – unless it's been stolen,” he said. “There's no evidence that users pay a premium for that, unlike, say, jewelry worn by celebrities.”","When looking at an NFT collection as a whole, floor price is helpful in conveying how popular a project is at a given point in time. OpenSea defines the floor price as “the lowest price for collection items, rather than the average item price,” meaning that if you just wanted to own any NFT from a particular collection, the floor price would be your best deal. Analyzing changes to a collection’s floor price over time can reflect public sentiment.","“When the floor price drops, it can indicate a decrease in demand or saturation of supply for the collection,” Cohen said. “This decrease in demand and lower perceived value of the collection as a whole can influence the value of individual tokens within the collection. Buyers may be less willing to pay a higher price for an individual token when the overall collection's value is declining.”","For Bored Ape Yacht Club, this correlation rings especially true. “Over time, as the floor price has gone down, so has the value of the top Apes,” said Yakovenko.","Knowing this information allows us to look back at Bieber’s NFT purchase with a new perspective. Deep NFT Value estimates that based on its rarity traits, cultural significance and public sentiment, Ape #3001 is most likely worth roughly what the collection’s floor price is.","“Our model sees him as a floor Ape – pretty clean – no bad features, but nothing extra valuable either,” Yakovenko said, positing that the Ape sold for four to five times more than it was worth in 2022.","Other celebrities that “aped” into the collection during the NFT bull run may have also overvalued their NFTs. After all, BAYC once reached a floor price of 153.7 ETH in April 2022 – when public sentiment toward NFTs was sky-high.","Former NFL quarterback Tom Brady paid 133 ETH – worth about $453,000 at the time – for BAYC #3667 in April 2022. Deep NFT Value estimates that today, the NFT is worth 30.7 ETH, or about $58,000. Rapper Eminem reportedly purchased BAYC #9055 in December 2021 for 123.45 ETH, worth about $453,000 at the time. The token is currently valued at 37.97 ETH, a little over $71,000, by Deep NFT Value.","“It's important to note that the impact on individual token value can vary depending on factors such as the uniqueness of the token, its rarity traits and the overall perception of the collection's long-term potential,” said Cohen.","\n"],"entity":[{"type":"$59,000","content":"MONEY"},{"type":"January 2022","content":"DATE"},{"type":"Dmitri Cherniak","content":"PERSON"},{"type":"April 2022","content":"DATE"},{"type":"$71,000","content":"MONEY"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$1.3 million","content":"MONEY"},{"type":"Yakovenko","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"Jack Butcher","content":"PERSON"},{"type":"Nikolai Yakovenko","content":"PERSON"},{"type":"Bored Ape NFT","content":"ORGANIZATION"},{"type":"Bieber’s NFT","content":"ORGANIZATION"},{"type":"Bieber","content":"PERSON"},{"type":"Tom Brady","content":"PERSON"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"NFL","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"PERSON"},{"type":"Yakovenko","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Oliver Cohen","content":"PERSON"},{"type":"NFT Value","content":"ORGANIZATION"},{"type":"$6.2 million","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Sara Gherghelas","content":"PERSON"},{"type":"Justin Beiber","content":"PERSON"},{"type":"Cohen","content":"PERSON"},{"type":"$58,000","content":"MONEY"},{"type":"December 2021","content":"DATE"},{"type":"$453,000","content":"MONEY"},{"type":"#3667","content":"DATE"},{"type":"$75,000","content":"MONEY"},{"type":"9055","content":"DATE"}],"hashtag":["Web3","NFT","Bored Ape","Justin bieber","Steve Aoki"],"authors":["Cam Thompson","Rosie Perper"]}