{"summary":"On-chain data indicates a rapid surge in redemptions of Coinbase&#x27;s staked ether token, called cbETH, according to 21 Shares.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/233775\/redemptions-surge-for-coinbases-staked-ether-following-sec-lawsuit","publishDate":"2023-06-08T09:36:56","id":1495,"type":null,"title":"Redemptions surge for Coinbase&#x27;s staked ether following SEC lawsuit","category":["CRYPTO ECOSYSTEMS"],"content":["There has been a surge in users unstaking their staked ether on crypto exchange Coinbase following the SEC's lawsuit against the exchange.","Since the <a href=\"https:\/\/www.theblock.co\/post\/233286\/sec-lawsuit-against-coinbase-raises-questions-about-cryptos-market-structure\" data-v-f87c67ca=\"\">lawsuit<\/a> came to light on June 6, a total of 39,550 Coinbase Staked Ether (cbETH) worth $75 million have been burned for redemption, according to on-chain data aggregated by blockchain firm 21. Meanwhile, about 9,600 cbETH have been minted during this time, which means the liquid staking token has witnessed a net outflow of approximately 29,900 cbETH ($56.8 million).","On June 6 alone, 27,280 cbETH tokens were redeemed. According to on-chain data aggregated by <a href=\"https:\/\/dune.com\/queries\/2393651\/3926738\" data-v-f87c67ca=\"\">21 Shares<\/a> and another crypto analyst Marcov on Dune Analytics platform, this marks one of largest single-day cbETH redemptions since the Shapella upgrade that enabled withdrawals.","<span data-v-f87c67ca=\"\"><a href=\"https:\/\/dune.com\/Marcov\/coinbase-wrapped-staked-eth\" data-v-f87c67ca=\"\">cbETH Net Minting<\/a> | Source: Dune Analytics (via @Marcov)<\/span>","Nevertheless, Coinbase remains the second-largest entity in terms of staked ether, having staked 2.3 million ether ($4.2 billion) on behalf of its customers. This ranks it second behind Lido Finance, which is responsible for 7 million ether ($12.9 billion).","Amid the unfolding legal battle, Coinbase’s chief, Brian Armstrong, <a href=\"https:\/\/www.bloomberg.com\/news\/audio\/2023-06-07\/coinbase-ceo-brian-armstrong-talks-crypto-regulation-podcast\" data-v-f87c67ca=\"\">reaffirmed<\/a> the exchange's commitment to continuing staking services, which include cbETH, while speaking at the Bloomberg Invest conference.","The regulatory landscape appears to be intensifying for centralized cryptocurrency exchanges. The SEC's lawsuit against Coinbase marks the second litigation against a major crypto exchange within two days, following a similar action against <a href=\"https:\/\/www.theblock.co\/post\/233206\/sec-binance-showdown-sends-shockwaves-through-crypto\" data-v-f87c67ca=\"\">Binance<\/a>. The federal complaint claimed that Coinbase allowed trading of crypto assets, including assets like Solana, Cardano, and Polygon, that should have been registered as securities.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$56.8 million","content":"MONEY"},{"type":"Cardano","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$4.2 billion","content":"MONEY"},{"type":"Lido Finance","content":"LOCATION"},{"type":"June 6","content":"DATE"},{"type":"7 million","content":"MONEY"},{"type":"$75 million","content":"MONEY"},{"type":"Dune Analytics","content":"ORGANIZATION"},{"type":"$12.9 billion","content":"MONEY"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Bloomberg Invest","content":"ORGANIZATION"}],"hashtag":[],"authors":["Vishal Chawla","The Block"]}