{"summary":"Telegram users can withdraw their ad revenues without fees or choose to reinvest them in promoting their public channels, the platform said.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/285815\/telegram-buy-ads-with-toncoin","publishDate":"2024-04-01T01:08:30","id":1496,"type":null,"title":"Telegram enables Toncoin payments for in-platform ad purchases","category":["COMPANIES"],"content":["Telegram now lets users purchase in-platform advertisements with Toncoin, according to an announcement made over the weekend. This update is part of the messaging app’s latest user monetization update that distributes 50% of the revenue from ads shown in public Telegram channels to their owners.","According to Telegram, users can now promote their channels by paying as little as “a handful” of Toncoins. Users will have the authority to choose the exact channels to place their TON-powered ads, the <a href=\"https:\/\/telegram.org\/blog\/monetization-for-channels?ln=r\" data-v-f87c67ca=\"\">announcement<\/a> stated.","Furthermore, channel owners will be able to withdraw their rewards without fees, while the withdrawal service will become available in the coming weeks on Telegram’s Fragment exchange, according to the announcement.","<span data-v-f87c67ca=\"\">“We chose the TON Blockchain because it has low fees, high transaction speeds – and holds a record for the number of transactions it can process per second,” Telegram wrote in the announcement. TON <\/span><a href=\"https:\/\/www.theblock.co\/post\/266622\/ton-blockchain-slows-down-to-halt\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reportedly<\/span><\/a><span data-v-f87c67ca=\"\"> recorded 100,000 transactions per second during a test last November.<\/span>","Telegram CEO Pavel Durov <a href=\"https:\/\/www.theblock.co\/post\/279566\/telegram-introduces-ad-revenue-sharing-with-5050-split-using-only-toncoin-in-nearly-100-countries\" data-v-f87c67ca=\"\">teased the update<\/a> on his personal channel last month. While Telegram channels generate over 1 trillion in monthly views, only 10% of channels have been monetized with Telegram ads so far, Durov said.","<span data-v-f87c67ca=\"\">“This will create a virtuous circle, in which content creators will be able to either cash out their Toncoins — or reinvest them in promoting and upgrading their channels,” Durov said in his previous message.<\/span>","The price of Toncoin rose 2.32% in the last 24 hours to $5.24 at the time of publication.","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"Durov","content":"PERSON"},{"type":"2.32%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"Telegram","content":"ORGANIZATION"},{"type":"$5.24","content":"MONEY"},{"type":"TON Blockchain","content":"ORGANIZATION"},{"type":"Pavel Durov","content":"PERSON"},{"type":"Toncoin","content":"PERSON"}],"hashtag":["CRYPTO","INTERNET","SOCIAL MEDIA"],"authors":["Danny Park","The Block"]}