{"summary":"As I look for a jurisdiction to incorporate our new token-generating venture, every lawyer we have consulted told us the U.S. should be off the table due to its lack of clear policy and regulations on crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/02\/21\/why-i-wont-build-in-the-us\/","publishDate":"2023-02-21T15:34:52","id":14965,"type":null,"title":"I’m American, but My Crypto Startup Won’t Be","category":["Consensus Magazine"],"content":["Yes, bear markets are for BUIDLing in crypto. Yes, I am bullish on 2023 being the year more builders start to impact the real world through the growing interest in bringing real world assets (RWA) on-chain and, importantly, the explosion of interest and projects in the regenerative finance (ReFi) space.","Yet, I am extremely bearish on the U.S. as a place for builders to launch crypto projects, especially if there is or could be a token tied to their business.","While jurisdictions such as Dubai are bringing regulatory clarity and direct support for builders to set up shop in this crypto oasis, the U.S. remains an outlier in embracing regulation through enforcement. This has been true for years when it comes to the never-ending question about whether and which tokens should be classified as a security or a commodity. Obviously, if the U.S. Securities and Exchange Commission Chairman Gary Gensler had his way, everything in crypto would be a security by default, and he would have the power to be judge, jury and executioner.","Read more: Boyd Cohen is CEO and co-founder of Iomob, the developers of WheelCoin, a Move2Earn game that rewards users for moving green. This piece is part of CoinDesk's Buidl Week.","Instead of regulatory certainty that creates predictability and the ability for the crypto ecosystem to move forward knowing it is operating within the bounds of legality, the U.S. for far too long has opted for scare tactics through threats and fines in the absence of well-defined regulation.","There are many in Congress – including Senator Cynthia Lummis and members of the Congressional Blockchain Caucus, such as Representatives Tom Emmer and Bill Foster – who actually understand the consequences of inaction. They see that this lack of regulatory clarity poses a fundamental risk of the U.S. being entirely left behind as crypto rails become more ubiquitous and adopted by every industry in the world.","Yet, the failure of Congress to act has left a regulatory vacuum that Gensler has managed to capitalize on. In the latest stunner, the SEC has forced Kraken to shut down its staking business in the U.S. – representing 10% of its annual revenue – and pay a $30 million fine because, apparently, the SEC, or at least Gensler, has decided to yet again place a heavy hand on a centralized and highly regulated U.S. exchange.","As countless industry experts have noted, it is ironic that companies like Kraken and Coinbase, which have been operating legally in the U.S. for years and are in compliance with every law that was knowingly applied to them, are so frequently the subject of the ire of the SEC. The result has been that fraudulent companies and actors like Sam Bankman-Fried and FTX succeed by moving offshore where they are out of reach of all U.S. regulators (and the SEC’s regulation by enforcement).","Let me ask you this. If you were a founder considering where to set up your legitimate crypto business, and you had the world to choose from, why would you even put the U.S. in your Top 10 places to consider?","I can tell you from firsthand experience, as a crypto founder myself, every single lawyer we have met with has advised us against considering the U.S. due to the regulatory uncertainty. And of course when crypto companies outside the U.S. decide to participate in token generation, they are always advised to leverage know-your-customer (KYC) processes to avoid directly selling tokens to the U.S. No one really knows what constitutes a security in the U.S. crypto space. So this creates difficulties for builders everywhere in the world as they deploy tokens but try to avoid the wrath of the SEC, not because the founders aim to be fraudulent or intentionally sell securities to U.S. retail investors, but because no one actually knows what the U.S. regulators or even the SEC actually consider a security, given the well-documented challenges of applying the Howey test to digital assets on crypto rails.","My own company is in the process of evaluating where to incorporate our token-generating entity and, yes, Dubai is now very high on our list, along with Singapore, Switzerland, the U.K. and other jurisdictions that have much clearer regulations for token issuers. Meanwhile, there is no jurisdiction in the U.S. that would make sense for us to consider, despite my being an American citizen, and our project already having ecosystem participants in the U.S.","The U.S., historically the birthplace of venture capital and global innovation, better get its act together soon and develop regulation by rules that all builders can transparently adhere to. If not the country, and its innovation ecosystem, is in great peril of losing the best and the brightest to emerging crypto hubs the world over who have recognized the need, and acted, to create regulatory certainty."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Tom Emmer","content":"PERSON"},{"type":"Switzerland","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Congressional Blockchain Caucus","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Iomob","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"Boyd Cohen","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Buidl Week 2023","startups","regulatory ambiguity","United States"],"authors":["Boyd Cohen"]}