{"summary":"Christopher Harborne and his aviation fuel broker AML Global were wrongly accused of \"committing fraud, laundering money, and financing terrorists,\" according to the lawsuit.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/01\/wall-street-journal-accused-of-defamation-over-2023-tether-bitfinex-article\/","publishDate":"2024-03-01T22:38:55","id":14966,"type":null,"title":"Wall Street Journal Accused of Defamation Over 2023 Tether-Bitfinex Article","category":["Policy"],"content":["The owner of a Thai-based aviation fuel broker has accused The Wall Street Journal of defamation for an article he says falsely accused him of abetting allegedly illegal activities at stablecoin issuer Tether and crypto exchange Bitfinex.","According to the lawsuit filed in a Delaware state court on Feb. 28, Christopher Harborne and his company, AML Global Ltd., were wrongly accused of \"committing fraud, laundering money, and financing terrorists – even though the Journal and its reporters knew and possessed documentation that conclusively showed that those accusations are false.\"","The March 2023 article, \"Crypto Companies Behind Tether Used Falsified Documents and Shell Companies to Get Bank Accounts,\" reported that Tether and corporate sibling Bitfinex were \"struggling to maintain their access to the global banking system.\" In response, \"some of their backers turned to shadowy intermediaries, falsified documents and shell companies to get back in, documents show,\" the Journal said.","\"The companies opened new accounts by using established business executives and tweaking company names,\" the newspaper continued. And some of those accounts, the Journal said, engaged in illegal behavior.","(After the story came out last year, Tether's Paolo Ardoino tweeted that it contained a \"ton of misinformation and inaccuracies,\" though he wasn't specific.)","When published, the story included several paragraphs on Harborne and AML. On Feb. 21, 2024, a week before the lawsuit was filed, an editor's note was added: \"A previous version of this article included a section regarding Christopher Harborne and AML Global, which applied for an account at Signature Bank. The section has been removed to avoid any potential implication that AML's attempt to open an account there was part of an effort by Tether, Bitfinex or related companies to mislead banks, or that Harborne or AML withheld or falsified information during the application process.\"","Asked about the lawsuit, a Wall Street Journal spokesperson said: \"More than nine months after the article was published, counsel for Mr. Harborne and AML Global contacted us to dispute the five paragraphs that included reporting about them. Following our review, we removed this section from the article and appended an Editor's Note in accordance with our editorial standards. The lawsuit they filed against Dow Jones is itself replete with inaccuracies and distortions. We take our journalistic responsibilities seriously, and we intend to mount a robust legal defense.\"","Harborne, in the lawsuit, said he does have a connection to Bitfinex: a roughly 12% ownership stake – the result of Bitfinex's reimbursement plan for customers stemming from a 2016 hack of the crypto exchange. \"Mr. Harborne is not now and never has been in any management or executive role at Bitfinex or Tether; he is merely a minority shareholder,\" according to the lawsuit.","Edited by Nick Baker and Nikhilesh De."],"entity":[{"type":"Harborne","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"Christopher Harborne","content":"PERSON"},{"type":"Crypto Companies Behind Tether Used Falsified Documents","content":"ORGANIZATION"},{"type":"Delaware","content":"LOCATION"},{"type":"Shell Companies","content":"ORGANIZATION"},{"type":"AML Global Ltd.","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Feb. 28","content":"DATE"},{"type":"March 2023","content":"DATE"},{"type":"Bitfinex","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Feb. 21, 2024","content":"DATE"},{"type":"Get Bank Accounts","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Dow Jones","content":"ORGANIZATION"}],"hashtag":["Wall Street Journal","USDT","Tether","Bitfinex"],"authors":["Sam Reynolds"]}