{"summary":"The funding will help NEAR accelerate its overall mission of helping “billions of people” use decentralized technologies, according to a company statement. \nMore VC investments in projects building on NEAR Protocol will be announced in the upcoming weeks.","author":["Anushree Dave","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/140751\/near-protocol-raises-350-million-in-new-funding-round-led-by-tiger-global","publishDate":"2022-04-06T08:24:41","id":1496,"type":null,"title":"NEAR Protocol raises $350 million in new funding round led by Tiger Global","category":["Layer 1s"],"content":["Blockchain project NEAR Protocol has raised $350 million in a funding round led by Tiger Global, with participation from Republic Capital, Hashed, FTX Ventures, Dragonfly Capital, and others.","The new funding will help NEAR increase \"the number of regional hubs in key community centers across the globe,” according to a company statement.","“<span class=\"il\" data-v-f87c67ca=\"\">NEAR<\/span> is poised to be a leading smart contract blockchain platform, combining first-rate technology with a fast-growing developer ecosystem. We're excited to support <span class=\"il\" data-v-f87c67ca=\"\">NEAR<\/span> as we ramp up our investments in the digital asset space,” John Curtius, a partner at Tiger Global, said in a statement.","NEAR Protocol was founded in 2018 as an open-source platform for decentralized applications. In January, the NEAR Foundation, which governs the development of the NEAR blockchain, raised $150 million in a round led by Three Arrows Capital, Alameda, and Jump, as The Block <a href=\"https:\/\/www.theblockcrypto.com\/linked\/130179\/near-raises-150-million-as-it-looks-to-become-a-hub-of-web3-development\" data-v-f87c67ca=\"\">reported<\/a> at the time. In a January <a href=\"https:\/\/www.theblockcrypto.com\/news+\/128741\/near-foundations-new-ceo-on-defining-web3-and-her-return-to-the-blockchain-space\" data-v-f87c67ca=\"\">interview<\/a> with The Block, the foundation’s CEO, Marieke Flament, said part of NEAR's overall mission is to be the go-to place to build web3 applications and make the ecosystem as a whole more inclusive.&nbsp;","This funding round follows a busy year for NEAR.","In April 2021, NEAR <a href=\"https:\/\/www.theblockcrypto.com\/linked\/100622\/near-protocol-launches-ethereum-bridge\" data-v-f87c67ca=\"\">launched<\/a> Rainbow Bridge to allow the transfer of ERC-20 tokens between the Ethereum and NEAR blockchains. In June, NEAR <a href=\"https:\/\/medium.com\/nearprotocol\/near-joins-icons-btp-ecosystem-97c3d8c2b1fc#:~:text=Interoperability%20With%20Polkadot%20Parachains%20Is,Blockchain%20Transmission%20Protocol%20(BTP).\" data-v-f87c67ca=\"\">joined<\/a> ICON's Blockchain Transmission Protocol (BTP) allowing data to be sent to partners like Polkadot and Harmony. In November, NEAR also <a href=\"https:\/\/medium.com\/nearprotocol\/ardana-partners-with-near-to-build-cardano-bridge-5097eedb1a8b\" data-v-f87c67ca=\"\">partnered<\/a> with Ardana, to build a bridge to allow assets to flow between Cardano and NEAR.","More venture investment in projects building on NEAR Protocol will be announced in the upcoming weeks with a focus on NEAR-and Aurora-based DeFi projects and applications, according to the company. At the moment, there are around 300 applications running and building on NEAR, with more than 200,000 community members worldwide.","“Republic Capital did an in-depth analysis into the <span class=\"il\" data-v-f87c67ca=\"\">NEAR<\/span> ecosystem and found that the builders in the space recognize the protocol as key to their deployment roadmap,” said Boris Revsin, managing director of Republic Capital, in a statement. “Community, tooling, documentation and support are critical to successful applications, and we believe <span class=\"il\" data-v-f87c67ca=\"\">NEAR<\/span> is best in class in these important areas.”"],"hashtag":["TIGER GLOBAL"]}