{"summary":"It took 12 hours and three different Apple devices, but this 30-something poet successfully minted her first NFT – and so can you. Here's a step-by-step guide to creating an NFT.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/minting-your-first-nft-a-beginners-guide-to-creating-an-nft\/","publishDate":"2022-01-24T21:19:00","id":14964,"type":null,"title":"Minting Your First NFT: A Beginner’s Guide to Creating an NFT","category":["Learn"],"content":["I’m no Emily Dickinson, but the latest developments in internet culture – excuse me, Web3 culture – has me thinking I can shill my grad school poems for 1 ETH (ether) a pop.","And on January 20, 2022, I did. After all, imposter syndrome doesn’t have a place in a burgeoning industry where even founders admit to being in the midst of a learning curve. If I were a creator during Gutenberg’s era, I like to think I wouldn’t have passed up the chance to play around with the printing press. Why should NFTs be different?","When I first heard about non-fungible tokens (NFTs) in April 2021, I was immediately thrilled by the high-level concept of them: Artists, seemingly overnight, now had a way to own their own work and determine their own royalties. I needed to hear more.","Being a journalist, I was fortunate that my first conversation about NFTs was with Whale Shark, a prominent collector and founder of the WHALE token who once spent 22 ETH on a one-of-a-kind pair of sneakers.","Ahead, I share what I’ve learned since that first NFT conversation and my chats with dozens of creators and founders in the blockchain world. As they say in crypto, time moves so fast. One month is basically a year, and it took me about seven months – essentially one whole dog year – to finally work up the nerve to put one of my poems on a blockchain. I’d like to make it easier for you.","Here’s a step-by-step guide on how to mint your first NFT using OpenSea, a popular NFT platform among first-time creators. (Great alternative platforms also exist, which we’ll touch on below.)","Outside of my financial journalistic work, I have a growing affinity for all things astrology-based. Looking at my recent astrology chart with astrologer Noah Frere, I noticed that Juno was very active. In light of this, I decided to base my first NFT collection on the tumultuous relationship between Juno and Jupiter – two gods from Roman mythology. And after a great conversation with my business coach, Lisa Fabrega, I knew I wanted to explore the tension between love and duty through the lens of devotion.","I therefore decided to name my poetry alter ego – every creator needs one, right? – “Juno Muse.”","With my concept nailed down, I had my marching orders: Resurrect my old poems and write several new ones. Then, learn how to mint them on a blockchain.","The tech skills required to mint NFTs on OpenSea are comparable to the ones I used to sign up for Myspace in 2006.","“There's a big misconception that you have to be technical in order to participate in crypto,” said Denise Schaefer, co-founder of the blockchain education platform Surge. “But I look at NFTs as a fun entryway into the space that doesn't require coding skills when minting in marketplaces like OpenSea or Rarible.”","Read More: OpenSea vs. Rarible: Which Is the Better NFT Marketplace?","Here are some beginner-friendly NFT platforms where first-time creators can mint:","OpenSea is popular and easy to use for all types of NFTs. While the Ethereum blockchain is notorious for charging high service fees, or “gas”, OpenSea now has a lazy mint option. The creator can upload their artwork, “mint” it to their profile and list it for sale without paying gas fees. When the collector buys it, they will pay the gas fees.","An ETH wallet (e.g. MetaMask, Coinbase or dozens of others)","2.5% of your sale","Visit the OpenSea resource page.","Creators can use Rarible to mint NFT creations, whether they are books, music albums, digital art or movies. There are some fun features, such as the ability to show a “sneak peek” of your creation to everybody who comes to Rarible but limit the full project to purchasers only.","Rarible considers itself a community-owned NFT marketplace. Using Rarible’s unique token (ERC-20 RARI) makes you an owner of the Rarible project. This is a cool feature, but it was a little over my head for my first mint. I hope to learn more about this.","A wallet compatible with your choice of blockchain.","Vary depending on the blockchain you use, but the option for free minting exists.","Read the Rarible FAQs","While Solana has mixed reviews from Ethereum loyalists, artists and creators report that the Solana blockchain is super fast, has high performance and is cost-effective with negligible fees. Solana’s speed and efficiency also cuts down on energy usage, therefore giving it a reputation as a new, less environmentally damaging, alternative to Ethereum.","Phantom wallet and Arconnect Wallet","Reportedly 0.000005 SOL ($0.00025) per transaction. Fees can fluctuate, but they are almost zero.","Check out this Artist’s Guide to Solana and Holaplex and visit the Holaplex.","Originally created as a secondary marketplace, objkt now allows artists and creators to mint directly on its platform. It’s also popular among literary NFT creators and used by theVerseVerse co-founders Sasha Stiles and Ana Maria Caballero.","Choose from these compatible wallets:","2.5% for all successful sales","Visit the objkt website and\/or discord server.","Get ready to tweet and DM. If you want to start making NFTs, you’ll need to dust off your Twitter account. You’ll also need to join Discord, a Slack-like chat platform for gamers and crypto lovers. Expect to get most of your information and build authentic relationships through these types of communication channels.","Read more: Crypto Discord: Where to Go, What to Know","When you’re ready to sell your NFTs, expect your community to be your number-one marketing resource. It sounds a little cliche, but you don’t need to spend a lot of money on sophisticated marketing tactics to create a successful project.","“Regardless of how low or high the market is, the community is so enthusiastic and constantly tagging our project in different things constantly talking about it,” said Maliha Abidi, whose Women Rise NFT collection launched in November 2021 and sold out in 50 days, generating 2,000 ETH of trading volume in the process.","“We have not put in even $1 in marketing so far, but we were literally just featured in Vanity Fair yesterday and today in Rolling Stone,” Abidi told CoinDesk on Jan. 19.","Even 1-of-1 creators – artists who mint unique, single pieces of art, compared to algorithmically generated avatars that people use as Twitter profile pictures – seemingly trust that making friendships can go a long way.","“We interact with each other every day. You're going to see your collectors in a Twitter space or if there’s good alpha information, we share it with each other,” said Thao Nguyen, an artist who pivoted from making Etsy creations to NFT artwork on OpenSea in 2021. “It's a very giving relationship, and I absolutely love it.”","To start turning my poems into art, I asked my mom to mail me an old iPad she wasn’t using and signed up for an online illustration class at the Baltimore Academy of Illustration. I bought an Apple Pencil, downloaded Photoshop for iPads, and plugged in my Yeti microphone (which I already had) to practice recording audio clips in iMovie and GarageBand. I dug out my old poems from grad school, walked around Manhattan thinking of ideas and bought a notebook to start scribbling.","Every creator has their own process, but no matter what, you need to think about how your art will translate digitally. Follow these guidelines to make your first NFT:","After some experimenting, I ended up scrapping the graphics I created in Photoshop and instead used Canva to make a simple title image and subtitles for my poem. I then recorded myself reading the poem along with the slides.","I’m not the most talented visual artist. But I gave myself permission to play around – and I don’t intend to stop experimenting. The advice I’ve gotten is this: Don’t pigeonhole yourself too soon or limit your notions of what’s possible. Unless you have a clear aesthetic like Abidi, an experienced painter, consider NFTs your opportunity to try new things. NFTs are a new art form, so let your message translate to the new medium.","In OpenSea, the minting process is so easy I kept waiting for a clown to jump out and tell me I’d been tricked.","It’s as simple as uploading your files, inputting your collection’s description and making your profile, determining your royalties (for later, when your art is sold in a secondary marketplace) and completing your listing.","Note the accepted file types:","I chose to mint my first NFT on Polygon, which had no fees.","Once you mint your NFT, you will see it on your profile. Blockchain data is public and accessible by anyone. Your NFT's buying and selling history will be available forever, helping you and prospective investors track its price.","“Etherscan is where you can see all the transactions that have happened in the Ethereum blockchain,” Schaefer told CoinDesk. “It is specific to all transactions that are occurring in the Ethereum network, and in and out of the network. Everybody having access to these public records is what allows for blockchains to operate without a central authority and without a bank.”","But you might not want the whole world to know how much money you have and how much money you're transacting, said Schaefer. This is where pseudonyms and having multiple wallets – totally legal in the blockchain world – come in.","After minting, it’s time to list your NFT for sale. I opted to keep things simple and list mine for 1 ETH, or $2,922.42 at the time of minting.","My 1 ETH price will remain on my Juno Muse OpenSea profile until Feb. 20, or whenever someone takes my NFT off the market.","In the meantime, I plan to keep experimenting with how I price my NFTs. I plan on releasing my old grad school poems, and, to make Juno proud, I plan to keep writing poems on Thursdays, which is ruled by Juno’s love, Jupiter. Maybe, just maybe, this new routine will help me fall in love with NFTs and – most important – my own art again.","Keep Learning: How to Create, Buy and Sell NFTs","Read More: What Are Music NFTs?"],"entity":[{"type":"Lisa Fabrega","content":"PERSON"},{"type":"$0.00025","content":"MONEY"},{"type":"Thao Nguyen","content":"PERSON"},{"type":"January 20, 2022","content":"DATE"},{"type":"Feb. 20","content":"DATE"},{"type":"Abidi","content":"PERSON"},{"type":"April 2021","content":"DATE"},{"type":"2.5%","content":"PERCENT"},{"type":"Noah Frere","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"$1","content":"MONEY"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"Arconnect Wallet","content":"ORGANIZATION"},{"type":"Holaplex","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Juno Muse OpenSea","content":"ORGANIZATION"},{"type":"Etsy","content":"ORGANIZATION"},{"type":"Gutenberg","content":"ORGANIZATION"},{"type":"Whale Shark","content":"ORGANIZATION"},{"type":"Ana Maria Caballero","content":"PERSON"},{"type":"Manhattan","content":"LOCATION"},{"type":"Baltimore Academy of Illustration","content":"ORGANIZATION"},{"type":"November 2021","content":"DATE"},{"type":"Thursdays","content":"DATE"},{"type":"GarageBand","content":"ORGANIZATION"},{"type":"2006","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Apple Pencil","content":"ORGANIZATION"},{"type":"Schaefer","content":"PERSON"},{"type":"Rarible FAQs","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Denise Schaefer","content":"PERSON"},{"type":"Maliha Abidi","content":"PERSON"},{"type":"Sasha Stiles","content":"PERSON"},{"type":"Jan. 19","content":"DATE"},{"type":"$2,922.42","content":"MONEY"},{"type":"Juno Muse","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"Emily Dickinson","content":"PERSON"}],"hashtag":["NFTs","Learn","Beginner"],"authors":["Megan DeMatteo"]}