{"summary":"The two crypto firms are attempting to improve cross-border payments via stablecoins for large corporations and institutions.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/14\/fireblocks-zodia-markets-partner-to-improve-cross-border-payments\/","publishDate":"2024-03-14T09:00:00","id":14979,"type":null,"title":"Fireblocks, Zodia Markets Partner to Improve Cross-Border Payments","category":["Finance"],"content":["Fireblocks, a platform offering infrastructure for moving, storing and issuing digital assets, has partnered with U.K.-based institutional crypto exchange Zodia Markets in a bid to improve corporate cross-border payments.","The collaboration will allow corporations to transfer funds faster through the use of stablecoins rather than through traditional fiat currency methods, according to the press release. The integration will use Zodia’s digital asset versus traditional foreign exchange execution (with a focus on emerging markets) and Fireblocks’ platform for peer-to-peer stablecoin transactions.","“For some time now, we’ve witnessed a growth in adoption amongst our network to use stablecoins as a near-instant and cost-effective way to transfer value,” said Richard Astle, vice president and business lead at Fireblocks.","“As a global enterprise, the expansion to non-USD on\/off ramps is also on the rise which makes this collaboration with Zodia Markets not just unique in its value proposition, but also marks the beginning of bringing FX on-chain,” he added.","Zodia Markets is backed by the venture capital unit of Standard Chartered and offers digital asset trading for corporations and large institutions.","Fireblocks recently hired a new chief marketing officer, Michal Ferguson, who came aboard after the recent addition of a new chief financial officer and chief customer officer.","Edited by Nick Baker."],"entity":[{"type":"Richard Astle","content":"PERSON"},{"type":"Fireblocks","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Michal Ferguson","content":"PERSON"},{"type":"Standard Chartered","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Fireblocks","Zodia Markets","Cross-Border Payments","Stablecoin"],"authors":["Lyllah Ledesma"]}