{"summary":"“What we failed to realize was that luna was capable of falling to effectively zero,” Three Arrows Capital co-founder Su Zhu said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/07\/22\/three-arrows-capital-founders-says-terra-gbtc-trades-led-to-fund-blowup-report\/","publishDate":"2022-07-22T11:44:17","id":14975,"type":null,"title":"Three Arrows Capital Founders Say Terra, GBTC Trades Led to Fund Blowup: Report","category":["Finance"],"content":["Trades involving the Grayscale Bitcoin Trust (GBTC), Terra’s luna (LUNA) and terraUSD (UST) tokens eventually led to the blowup of beleaguered crypto fund Three Arrows Capital, its founders told Bloomberg.","The fund's founders Kyle Davies and Su Zhu had previously confirmed they took on some $200 million in losses related to LUNA and the now-imploded algorithmic stablecoin UST. Prices of the two tokens entered a death spiral in mid-May and fell to nearly zero in the following weeks.","“What we failed to realize was that luna was capable of falling to effective zero in a matter of days and that this would catalyze a credit squeeze across the industry that would put significant pressure on all of our illiquid positions,” Zhu explained. He added that Three Arrows Capital, popularly referred to as 3AC, had failed to flag risks related to Terra.","LUNA lost nearly all of its value over the course of a week in mid-May, while ecosystem algorithmic stablecoin terraUSD (UST) fell to a few pennies after losing its intended peg with the U.S. dollar.","3AC was one of Terra’s most vocal bulls, and was additionally one of the largest holders of GBTC, an institutional bitcoin product.","Grayscale and CoinDesk are independent subsidiaries of the Digital Currency Group (DCG).","As a regulated product, GBTC allowed investors like 3AC to purchase shares directly by giving bitcoin to the trust. Holders could then sell the shares on over-the-counter markets for a premium – which netted a hefty profit for holders and became an attractive trade among investors.","GBTC shares were locked for six months, meaning falling prices led to holders taking on losses instead of profits. GBTC’s premium switched to a discount over the past year, reaching a record discount in June. This meant massive losses for investors like 3AC who piled on billions of dollars worth of exposure to the product. However, using leverage to juice up returns led to tears instead.","GBTC lost value in the past few months amid a market-wide decline. GBTC shares traded at over $34 at the start of this year, before sliding more than 50% to $12 earlier this week.","3AC continued to borrow from lenders expecting a market rebound. This was until bitcoin (BTC) fell to nearly $20,000 in late June, causing the firm’s positions to go awry and making it unable to repay any loans. The fund lost money on luna, its GBTC shares traded at a discount, and overall market declines meant all altcoin token holdings fell drastically in value.","“That was extremely painful for us,” Zhu said, referring to bitcoin’s fall. “That ended up being kind of the nail in the coffin.”","Investors are claiming that the defunct fund still owes them $2.8 billion. However, a 1,157-page court filing released on Monday shows individual claims worth over $1 billion.","Read more: Three Arrows Capital Founders Break Their Silence, Look to Move to Dubai: Report"],"entity":[{"type":"earlier this week","content":"DATE"},{"type":"fall","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"Kyle Davies","content":"PERSON"},{"type":"$34","content":"MONEY"},{"type":"$12","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Digital Currency Group (DCG","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Three Arrows Capital","content":"ORGANIZATION"},{"type":"mid-May","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"$2.8 billion","content":"MONEY"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["Three Arrows Capital","Bitcoin","Terra"],"authors":["Shaurya Malwa"]}