{"summary":"Bitcoin's annualized 30-day historical or realized volatility rose to nearly 60% late last week, surpassing ether's 30-day realized volatility by nearly 10 percentage points.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/01\/bitcoin-becomes-more-volatile-than-ether-as-halving-approaches\/","publishDate":"2024-04-01T06:22:43","id":14977,"type":null,"title":"Bitcoin Becomes More Volatile Than Ether as Halving Approaches","category":["Markets"],"content":["Bitcoin (BTC), the leading cryptocurrency by market value and trading volumes, is supposed to be relatively steady compared to other digital assets, protecting a trader’s portfolio from wild swings in the broader market.","However, bitcoin has been more volatile than ether (ETH) recently.","Bitcoin’s annualized 30-day historical or realized volatility rose to nearly 60% late last week, surpassing ether’s 30-day realized volatility by nearly 10 percentage points. That’s the highest spread in at least a year, according to data tracked by Paris-based Kaiko. Historical volatility indicates the degree of price turbulence observed over a specific period.","The bitcoin-ether volatility spread flipped positive weeks after the U.S. Securities and Exchange Commission (SEC) greenlighted nearly a dozen spot bitcoin exchange-traded funds (ETFs), allowing traders to take exposure to the cryptocurrency without owning it.","Since then, traders have been squarely focused on the activity in the spot ETFs, with net inflows breeding upside volatility in bitcoin and the broader crypto market. In the meantime, the dwindling probability of the SEC approving an ETH ETF by May seems to have demotivated ether traders.","Bitcoin blockchain’s upcoming reward halving, a quadrennial event that reduces the pace of per block BTC emission by 50%, could be another reason for relatively higher volatility in the cryptocurrency.","On April 21, the inbuilt code will reduce the per-block reward paid to miners to 3.125 BTC from 6.25 BTC, halving the miner’s revenue, which, as per ByteTree, is currently at $26 billion annually.","The consensus is that halving is bullish as it halves the pace of supply expansion, creating a demand-supply imbalance in favor of a price rise, assuming the demand side remains unchanged or strengthens. Bitcoin chalked out stellar rallies, setting new record highs over 12-18 months following the previous halvings, which occurred in November 2012, July 2016, and May 2020.","What’s different this time is that bitcoin has surpassed the previous bull market peak of around $69,000 weeks ahead of the halving, which makes the upcoming event all the more exciting for traders.","Per Greg Magadini, director of derivatives at Amberdata, the bullish positioning ahead of the halving means potential for a “sell-the-news\" pullback after the event.","“The current positioning being so extended is setting the market up for a VERY interesting 'sell-the-news’ halving cycle play,” Magadini said in the weekly newsletter. “Should there be a real pullback, we stand to see excessive ∆1 [futures] OI become liquidated, volatility RR-skew to favor puts and a collapsing basis.”","Magadini added that bitcoin’s options market has been pricing the halving event as well.","“If we look at the options market, we see an interesting structure. A steep [IV] Contango before 4\/26 and a high forward volatility kink for the 4\/26 expiration. The options market is pricing in the halving event as well,” Magadini noted.","The implied volatility, or IV, is the market’s guess of future realized volatility. Usually, plotting IVs for different durations or expiries produces an upward-sloping curve called a contango.","A steep contango ahead of the April 26 expiry means the market is expecting elevated BTC volatility as it heads into the halving. The forward volatility suggests the same.","Edited by Parikshit Mishra."],"entity":[{"type":"Magadini","content":"PERSON"},{"type":"November 2012","content":"DATE"},{"type":"May 2020","content":"DATE"},{"type":"Paris","content":"LOCATION"},{"type":"May","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"$26 billion","content":"MONEY"},{"type":"18","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Kaiko","content":"LOCATION"},{"type":"April 21","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"60%","content":"PERCENT"},{"type":"Greg Magadini","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"April 26","content":"DATE"},{"type":"Amberdata","content":"LOCATION"},{"type":"July 2016","content":"DATE"}],"hashtag":["Options","Volatility","Bitcoin","Ether","Halving"],"authors":["Omkar Godbole"]}