{"summary":"\"Even though their money generation mechanism is not as strong as Binance, they do have the users,\" CEO CZ tells CoinDesk. \"It's a very valuable platform.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/04\/02\/they-have-the-users-binance-ceo-explains-why-he-bought-coinmarketcap\/","publishDate":"2020-04-02T13:00:03","id":14984,"type":null,"title":"'They Have the Users': Binance CEO Explains Why He Bought CoinMarketCap","category":["Finance"],"content":["","Binance just bought the top of the funnel.","","","The largest cryptocurrency exchange by market volume has acquired popular data site CoinMarketCap (CMC) for an undisclosed price, the companies announced Thursday. Binance CEO Changpeng “CZ” Zhao told CoinDesk the deal closed March 31, although a verbal agreement had been reached “a few months ago.” ","","","With its extensive (although often questionable) data on prices, volumes and other metrics for 5,290 cryptocurrencies, CMC has served as a dragnet for retail investors since its launch in 2013. ","","","“It’s a really good website and I think we can help grow it further,” Zhao said in an interview with CoinDesk Thursday, adding he had no immediate plans for CMC. Zhao said the domain will remain independent from Binance under a holding company, perhaps staving off concerns over potential conflicts of interest.","","","Industry veterans told CoinDesk they see a future where CMC could serve as a marketing channel for Binance, steering prospective customers toward the exchange. Zhao, on the other hand, characterized it as a simple, albeit large, purchase of a cash-flow positive asset. ","","","“It’s by far the largest we have done so far,” he said of the deal.","","","The acquisition shows that while many firms looked to institutional players as crypto's messiah in 2019 and even today, Zhao is pinning his hopes on a mass audience of individual investors after buying the most heavily trafficked website in the space.","","","Amazon’s Alexa ranks CMC as the 570th most visited website globally in the last 90 days. That’s compared to Binance and rival exchange Coinbase at 1,688 and 1,562, respectively. The next closest data provider is CoinGecko at 7,350.","","","Zhao’s purchase also caps CMC’s journey, from a scrappy outfit run out of founder Brandon Chez’s apartment to a property coveted by an industry leader. In fact, Zhao said he had pursued Chez for years. With the sale, Chez is stepping down.","","","“CMC was not for sale,” CMC interim CEO Carylyne Chan said in an interview. “Opportunity came along.” (Chan now joins Binance.US CEO Catherine Coley as one of two female chief executives running firms connected to the exchange in a historically male-dominated industry.)","","","Earlier this week, The Block reported the acquisition was in the works, and put the price tag at $400 million in cash and stock options, citing unnamed sources. Founders and investors interviewed by CoinDesk gave differing opinions on the plausibility of the figure; some said it sounded too high, others thought it was too low. While both Chan and Zhao declined to give actual figures for the acquisition, citing non-disclosure agreements, Zhao confirmed it was Binance’s biggest acquisition to date.","","","“CoinMarketCap has more users than any other product in the crypto space,” Zhao said. “Even though their money generation mechanism is not as strong as Binance, they do have the users – it’s a very valuable platform.”","","","Read more: Crypto’s King Midas: Backstage With CZ, the CEO Who Can’t Be Stopped","","","Earnest conversations between CoinMarketCap and Binance date back to the data provider’s conference for investors in November 2019, said Chan.","","","Zhao hinted at the coming acquisition, along with one other unannounced purchase, in a New Year’s Day blog post. Binance bought nine separate entities last year alone and plans to onboard 180 fiat currencies by the end of 2020 in an aggressive push to sign up retail customers. The company’s tagline is “exchanging the world.”","","","It’s easy to see, then, why CoinMarketCap’s status as the first landing page for retail investors would be attractive to Zhao despite his past criticisms of CMC for its data quality.","","","If reports about the price are true, the deal stands as one of the top M&A deals in crypto history. Circle, now a shell of its former self, purchased Poloniex for $400 million in 2018 but has since spun off the exchange and pivoted to focusing on stablecoins.","","","For CMC, the acquisition follows a ride through choppy waters. The firm quickly became both the dominant data source and go-to platform for asset pricing in the nascent industry. ","","","It also became a lightning rod for controversy after a 2019 report to the U.S. Securities and Exchange Commission (SEC) by digital asset manager Bitwise found artificial trade volume from 95 percent of the crypto exchanges that provide data to CMC.","","","Startups such as Nomics, Messari and CoinGecko seized the Bitwise report to chip into CMC’s lead, particularly among institutional investors, which require robust data and can’t expose their clients to manipulation.","","","Read more: For $15K, He’ll Fake Your Exchange Volume – You’ll Get on CoinMarketCap","","","Rival exchanges reacted with mixed emotions at news of the deal, which could firmly outdistance Binance from the pack.","","","Lennix Lai, director of financial markets at OKEx, said it was good to see such large M&A deals in the context of a “bearish market in crypto.”","","","Big players investing back into key infrastructure is healthy for crypto, Lai said, even if warranting skepticism.","","","“People might have doubts about whether or not CMC could maintain its independence afterward. It’s fair. But I think we should give the team a chance,” he said. ","","","Andy Cheung, former chief operating officer at OKEx and founder of crypto derivative platform ACDX, was more critical in his assessment. ","","","The acquisition “is not very good for the industry” given the conflict of interest between the parties’ missions, he said, pointing to Binance’s exchange token, BNB, as an example.","","","“I can understand the business or potential profit,” Cheung said. “But honestly, how are you going to convince people that the rankings and volume are true when you’re operating an exchange and also probably the biggest holder of BNB?”","","","Cheung even saw it as a blow to Zhao’s cult of personality.","","","“CZ has been telling everyone, ‘We are not here for the money and building something bigger and meaningful for humanity.’ Now I’m disappointed, I hope I am wrong and he has a better reason behind” the purchase, he said.","","","One Silicon Valley crypto investor speaking on the condition of anonymity doubted the reported $400 million buyout figure and said the overall deal “feels like a favor” to CMC founder Chez. ","","","“The founder is very stealth and I think has the majority of the cap table. And he's struggled to monetize for years,” the investor said.","","","That’s not to say Binance doesn’t have loose change to throw around. Two sources said Binance is “flush” with cash, with one pointing toward futures trading customers departing BitMEX following a critical error on March 12 as a recent boon.","","","CMC sits in an awkward spot after its acquisition. ","","","Although it is typically the first port of call for small retail buyers, institutional investors spurned the website, particularly after Bitwise’s SEC report. At the same time, CMC has some of the best data in the industry because of its sheer volume: exchanges have always used CMC, so why change now?","","","Nomics founder and CEO Clay Collins told CoinDesk that a certain degree of trust is necessitated between an exchange and a data provider; trust that “is likely to be eroded here” with CMC under the same roof as Binance.","","","If rival exchanges feel threatened by the possibility of Binance harvesting data from CMC, those firms will be “much less willing to provide low-latency and high-granularity data,” Collins said.","","","“That data is now being given to a competitor with surveillance abilities. It’s unlikely that other exchanges will want to see Binance aggregating and monetizing their own data,” he said. ","","","Collins’ concerns were seconded by Alexei Andryunin, head of Gotbit, a Russian token and exchange promotion service. That’s a polite way to describe the business, which Andryunin has candidly admitted inflated volumes on CMC for small-cap coins via wash-trading bots.","","","In Andryunin’s view, the purchase will provide Binance with “data on all their competitors, plus some of the best expertise for traffic generation in the crypto industry.”","","","However, leveraging or altering data would be equivalent to sending the investment to a burner address, Andryunin said. “Binance is incentivized to keep this service transparent so that they don’t lose their investment. I think they’ll try to preserve CMC’s reputation.” ","","","He also said that CMC’s summer 2019 capitalization was estimated at $650 million, suggesting the reported $400 million offering was a bargain.","","","Read more: We Still Don’t Know Bitcoin’s Real Volume","","","Binance aside, CMC’s Chan said data concerns continue to be a key part of the firm’s focus. ","","","The firm is launching both “qualitative data as well as quantitative data” features in 2020, Chan said. “Stronger agreements” could be put in place to “protect [exchanges’] interest as well,” she acknowledged.","","","“In a sense, it’s in our interest to continue to be neutral and to be transparent and independent,” Chan said. ","","","Zhao acknowledged CMC’s shortcomings, saying the firm “needs to resolve” numerous issues and “make the product better over time.” That responsibility falls to Chan and her team, though, he said.","","","“I’m not dictating it,” Zhao said.","","","Meanwhile, the purchase frees up elbow room for other data aggregators, particularly on the institutional side of the market, said Messari co-founder and CEO Ryan Selkis. In an email to CoinDesk, and in his own newsletter and Twitter feed, Selkis described the buyout as a win for everyone, including data companies that won’t receive a check.","","","“It’s great news for other crypto data companies, and information businesses. Audience and influence matters. Quality data matters,” he said in a company newsletter.","","","Yan Liberman, principal at research and consulting firm Delphi Digital, said these larger acquisitions are good for the sector and show overall maturation. He added that it’s best to wait and see on Binance’s relationship with CMC rather than cast stones early.","","","“The initial reaction might be to look at other data providers\/platforms as comparables, but because of all the nuances\/differences among them, I don’t think it’s very useful to do that until we get a better understanding of what the plans are for CMC,” Liberman said.","","","Not much will change for CMC once the acquisition takes place, Chan said. All of the firm’s roughly 40 employees – minus Chez, who will stay on as an advisor – will join the 930-person Binance staff, Zhao said.","","","Chan said the firm will continue to alter its infamous advertisement structure, but will still host paid-marketing for other exchanges.","","","Since the firm will operate separately from Binance, Zhao will have to dish out more money if Binance wants to advertise on CMC, she said.","","","For his part, Chez – the sole shareholder of CMC – walks away from crypto with a big chunk of change in his pocket – fiat or otherwise. Chan said Chez’s focus remains on his family during the coronavirus crisis and subsequent quarantine he and his family currently live under. ","","","“We would love to keep him, but he wants to take a break and, given the size of the deal, it makes total sense,” Zhao said.","","","Zack Seward, David Pan and Anna Baydakova contributed reporting.",""],"entity":[{"type":"November 2019","content":"DATE"},{"type":"” Cheung","content":"ORGANIZATION"},{"type":"Chan","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"David Pan","content":"PERSON"},{"type":"Zhao","content":"PERSON"},{"type":"Carylyne Chan","content":"PERSON"},{"type":"CMC","content":"ORGANIZATION"},{"type":"Zack Seward","content":"PERSON"},{"type":"Andy Cheung","content":"PERSON"},{"type":"Messari","content":"ORGANIZATION"},{"type":"$400 million","content":"MONEY"},{"type":"Andryunin","content":"PERSON"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"95 percent","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"Anna Baydakova","content":"PERSON"},{"type":"last 90 days","content":"DATE"},{"type":"March 31","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"Clay Collins","content":"PERSON"},{"type":"$650 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"CoinMarketCap","content":"ORGANIZATION"},{"type":"Collins","content":"PERSON"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"2013","content":"DATE"},{"type":"Lennix Lai","content":"PERSON"},{"type":"Yan Liberman","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Alexa","content":"PERSON"},{"type":"$15K","content":"MONEY"},{"type":"Catherine Coley","content":"PERSON"},{"type":"Selkis","content":"PERSON"},{"type":"Nomics","content":"ORGANIZATION"},{"type":"Lai","content":"PERSON"},{"type":"Binance","content":"PERSON"},{"type":"Chez","content":"ORGANIZATION"},{"type":"Alexei Andryunin","content":"PERSON"},{"type":"Binance","content":"LOCATION"},{"type":"Bitwise’s SEC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March 12","content":"DATE"},{"type":"summer 2019","content":"DATE"},{"type":"Earnest","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Liberman","content":"PERSON"},{"type":"Brandon Chez","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Acquisitions","CoinMarketCap","Binance","M&amp;A"],"authors":["William Foxley"]}