{"summary":"Liquid restaking protocols are seeing ample demand from users as speculation mounts over potential applications for the Ethereum restaking juggernaut EigenLayer, and the prospects for rewards paid out to early users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/02\/20\/liquid-restaking-protocol-puffer-rakes-in-1b-in-deposits-in-just-3-weeks\/","publishDate":"2024-02-20T18:25:29","id":14982,"type":null,"title":"Liquid Restaking Protocol Puffer Rakes in $1B in Deposits in Just 3 Weeks","category":["Technology"],"content":["In a sign of just how hot \"liquid restaking protocols\" have become among crypto speculators, the new blockchain projects are hitting major money milestones within weeks of their launches.","Liquid restaking protocol Puffer passed the mark of $1 billion in deposits on Tuesday, according to DefiLlama, fewer than three weeks after opening to users on Feb. 1.","The project is one of a handful banking on the growing \"restaking\" trend that has driven a renaissance for decentralized finance (DeFi) on Ethereum.","Puffer and other liquid staking protocols like Ether.Fi take deposits from investors and funnel them into EigenLayer, a restaking protocol that lets ether (ETH) stakers earn interest for re-deploying their assets to help secure third-party networks in addition to Ethereum, called \"actively validated services,\" or AVSs.","The liquid staking platforms, with their liquid restaking tokens or \"LRTs,\" are competing to supplant Lido's staked ETH (stETH) as the asset of choice for DeFi traders.","Puffer hands out an LRT called pufETH to users representing their underlying deposit – allowing the users to profit from restaking while still getting a token they can trade or reuse elsewhere. PufETH will earn interest once EigenLayer's AVSs go live, and users may re-invest the token with DeFi protocols if they wish to earn higher rewards.","Read more: Liquid Restaking Tokens or 'LRTs' Revived Ethereum DeFi. Can the Hype Last?","Puffer and other liquid staking platforms have attracted investors by offering easier access to EigenLayer restaking as well as generous incentives known as \"points,\" which are scores that the platforms track internally as a way to measure user engagement. Investors hope that the points might eventually be redeemable for future token airdrops, but the lack of clarity on this makes them highly speculative.","Puffer says its tech is \"slash-resistant,\" meaning it has been designed to reduce one of the biggest risks with restaking: Relative to normal ETH staking, restakers are at heightened risk of having their deposits \"slashed,\" which is when they are penalized for breaking a network's rules (possibly due to software bugs).","\"I believe restaking, like anything else, comes with its own risks,\" Puffer Finance CEO Amir Forouzani told CoinDesk in an interview. \"It can be bad for the industry, or it can also play a really good role.\"","\"I think it is important to vet AVSs,\" he continued, \"to allow only AVSs that do not have exogenous risks.\"","Puffer is the second-largest liquid staking platform behind Ether.Fi, which crossed $1 billion in deposits earlier this month.","EigenLayer has accrued $7.7 billion in deposits since it launched in June and owes much of its growth to the investment incentives offered by liquid restaking providers.","Edited by Bradley Keoun."],"entity":[{"type":"Puffer","content":"PERSON"},{"type":"Feb. 1","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"LRT","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Lido","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"Amir Forouzani","content":"PERSON"},{"type":"Puffer Finance","content":"ORGANIZATION"},{"type":"$7.7 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Restaking","EigenLayer","Liquid staking","Ethereum"],"authors":["Sam Kessler"]}