{"summary":"Project Ensemble will \"seek to explore innovative financial market infrastructure (FMI) that will facilitate seamless interbank settlement of tokenized money,\" HKMA said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/07\/hong-kongs-central-bank-announces-new-wholesale-cbdc-to-support-tokenization-market\/","publishDate":"2024-03-07T11:27:17","id":14980,"type":null,"title":"Hong Kong’s Central Bank Announces New Wholesale CBDC Project to Support Tokenization Market","category":["Policy"],"content":["Hong Kong's central bank announced the start of a wholesale central bank digital currency (wCBDC) project to support the development of the tokenization market.","Project Ensemble will \"seek to explore innovative financial market infrastructure (FMI) that will facilitate seamless interbank settlement of tokenized money through wCBDC,\" with an initial focus on tokenized deposits, the Hong Kong Monetary Authority (HKMA) said Thursday.","Hong Kong has been exploring wholesale CBDCs since 2017 and \"officially\" began researching one for retail payments in 2021. The HKMA has already conducted two rounds of market consultations on issuing a digital Hong Kong dollar (e-HKD) but has not decided on whether or when to introduce an e-HKD despite stating in October 2023 that a retail CBDC could add unique value.","Project Ensemble is the latest addition to its portfolio of projects in the space, including Project mBridge, Project Dynamo and Project Genesis.","\"At the core of Project Ensemble is a wCBDC Sandbox that the HKMA will launch this year to further research and test tokenization use cases that include, among others, settlement of tokenized real-world assets (e.g. green bonds, carbon credits, aircraft, electric vehicle charging stations, electronic bills of lading and treasury management),\" the announcement said.","The project will see the creation of a \"wCBDC Architecture Community\" consisting of stakeholders from public and private entities to meet industry standards. It could also result in a new financial market infrastructure to bridge the gap \"between tokenized real-world assets and money in transactions.\"","If the wCBDC sandbox garners sufficient interest from the industry, a “live” issuance of the wCBDC at the appropriate time could be conducted, the HKMA said.","\"Project Ensemble will provide fresh impetus to our vibrant financial industry and reinforce our forefront position in tokenized money and assets,\" said Eddie Yue, Chief Executive of the HKMA.","Read More: Retail CBDC Could Add Unique Value, but Further Investigation Is Needed, Hong Kong Central Bank Says","UPDATE (March 7, 2024, 12:34 UTC): Updates headline and adds detail throughout.","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"Hong Kong Central Bank Says","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Eddie Yue","content":"PERSON"},{"type":"March 7, 2024","content":"DATE"},{"type":"October 2023","content":"DATE"},{"type":"Project Ensemble","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"HKMA","content":"ORGANIZATION"},{"type":"Project Dynamo and Project Genesis","content":"ORGANIZATION"}],"hashtag":["Regulations","Hong Kong Monetary Authority","Hong Kong","CBDC","HKMA"],"authors":["Amitoj Singh"]}