{"summary":"The firm will push toward &quot;OpenSea 2.0,&quot; which prioritizes product upgrades to technology, reliability, speed, quality and experience. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/261515\/opensea-cuts-half-of-employees-as-ceo-announces-new-direction","publishDate":"2023-11-03T15:50:23","id":1498,"type":null,"title":"OpenSea cuts half of employees as CEO announces new direction","category":["NFT MARKETPLACES"],"content":["NFT marketplace OpenSea is letting go of half of its employees as the firm plots a major redirection.&nbsp;","The firm is creating a new foundation to foster innovation, OpenSea co-founder and CEO Devin Finzer wrote in a social media <a href=\"https:\/\/twitter.com\/dfinzer\/status\/1720516605933756514\" data-v-f87c67ca=\"\">thread<\/a>. Doing so requires \"shifting to a smaller team with a direct connection to users.\"&nbsp;","\"So today, we’re saying goodbye to a number of OpenSea teammates,\" Finzer said. The move is a part of the firm's push toward the so-called \"OpenSea 2.0,\" which focuses on product upgrades to technology, reliability, speed, quality and experience.&nbsp;","Finzer noted that OpenSea's redirection comes after they've heard feedback from users that the company felt like more of \"a follower, not a leader.\"","\"And that’s not who we want to be. We want to move with speed, quality, and conviction to make more meaningful bets,\" Finzer wrote. \"We’re making these changes with our community in mind. As we rebuild, we'll continue supporting our existing products, and will be iteratively testing OpenSea 2.0 in public — remaining nimble, attentive, and focused.\"","A company spokesperson said affected employees will receive four months of severance, among other benefits. The new organization will be flatter, with fewer middle managers.&nbsp;","<a href=\"https:\/\/www.theblock.co\/post\/246095\/opensea-disables-royalty-enforcement-tool-makes-creator-fees-optional\" data-v-f87c67ca=\"\">OpenSea<\/a> has attempted to regain some of its market share that's been lost to other NFT platforms such as Blur.io. While OpenSea once held over 73% of the NFT marketplace volume as of October of 2022, its share has since fallen to 18% as of Nov. 3, The Block's Data Dashboard shows.&nbsp;","<iframe frameborder=\"0\" height=\"420\" src=\"https:\/\/www.theblock.co\/data\/nft-non-fungible-tokens\/marketplaces\/share-of-nft-marketplace-volume\/embed\" title=\"Share of Ethereum NFT Marketplace Volume\" width=\"100%\" data-v-f87c67ca=\"\"><\/iframe>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"18%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Finzer","content":"PERSON"},{"type":"October of 2022","content":"DATE"},{"type":"The Block's Data Dashboard","content":"ORGANIZATION"},{"type":"Devin Finzer","content":"PERSON"},{"type":"Nov. 3","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"73%","content":"PERCENT"}],"hashtag":[],"authors":["MK Manoylov","The Block"]}