{"summary":"Ethena has invited holders of USDe to claim their share of the airdrop of 750 million ENA tokens, equating to 5% of the total supply","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/02\/ethena-labs-ena-token-goes-live-start-trading-at-64-cents\/","publishDate":"2024-04-02T09:22:53","id":14986,"type":null,"title":"Ethena Labs' ENA Token Goes Live, Starts Trading at 64 Cents","category":["Markets"],"content":["Ethena Labs, the decentralized finance (DeFi) protocol that offers the $1.3 billion yield-earning USDe, has opened claims for its new governance token (ENA).","In a post on X on Tuesday, Ethena invited holders of USDe to claim their share of the airdrop of 750 million ENA tokens, equating to 5% of the total supply, which is set to list on centralized exchanges.","Following the commencement of the airdrop, ENA rose over 8% to trade at around 64 cents, with a market cap of close to $500 million, according to data by CoinGecko.","Ethena plans to start a campaign with new incentives for the next phase of the airdrop, according to a blog post last week.","The USDe token, which is referred to as a “synthetic dollar,” offers yields to investors by pairing ether liquid staking tokens with short ether (ETH) perpetual futures position in the derivatives market to maintain a “rough target” of $1 price.","Read More: Crypto Custodian Taurus Enlists Lido to Bring Liquid Ethereum Staking to Swiss Banks","Edited by Parikshit Mishra.","\n","\n"],"entity":[{"type":"8%","content":"PERCENT"},{"type":"$1.3 billion","content":"MONEY"},{"type":"Ethena","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"64 cents","content":"MONEY"},{"type":"ENA","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"Crypto Custodian Taurus Enlists Lido","content":"ORGANIZATION"},{"type":"CoinGecko","content":"ORGANIZATION"},{"type":"Swiss Banks","content":"LOCATION"}],"hashtag":["Ethena","Airdrops","Liquid staking","Governance token"],"authors":["Jamie Crawley"]}