{"summary":"The crypto lender’s financial woes are well known. Now we have a better sense of the severity.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/11\/29\/blockfi-joins-the-bankruptcy-parade\/","publishDate":"2022-11-29T19:00:00","id":14999,"type":null,"title":"BlockFi Joins the Bankruptcy Parade","category":["Policy"],"content":["Crypto lender BlockFi became the latest industry heavyweight to file for bankruptcy, joining Celsius Network, Voyager Digital and FTX. FTX’s collapse directly contributed to BlockFi’s filing, but the lender presented an optimistic view nevertheless in its first day pleadings.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","BlockFi announced it was filing for bankruptcy protection on Monday morning, announcing it has around $257 million in cash on hand but claiming between $1 billion and $10 billion in assets (as well as between $1 billion and $10 billion in liabilities).","BlockFi is only the latest major crypto lender to file for bankruptcy protection this year, joining Celsius Network and Voyager Digital. BlockFi followed a well-worn path – it suspended withdrawals earlier this month and (we know now) hired a consultant to sort through its processes.","Like (so far) every other crypto company, BlockFi has filed for Chapter 11 bankruptcy protection, indicating it believes it can continue onwards after a restructuring process. Like other companies, BlockFi claims it faced “a severe liquidity crunch,” directly citing the collapse of the FTX crypto exchange as a main cause. Despite this, BlockFi is in a better position than FTX due, at least in part, to governance and risk management processes, the filing claims.","“The Debtors’ planning has left them well positioned to move forward despite the fact that 2022 has been a uniquely terrible year for the cryptocurrency industry, given the collapse of the UST\/LUNA stablecoin ecosystem and the bankruptcies of Singapore-based cryptocurrency hedge fund Three Arrows Capital and several major cryptocurrency brokerages and exchanges such as Celsius Network Ltd. and Voyager Digital – all before the FTX debacle unfolded over a period of several days earlier this month,” the first-day filing said.","The filing also went through BlockFi’s history, its fundraises, what kind of shares it issued and how the market collapse of 2022 affected the lender.","Three Arrows Capital, which collapsed into ignominy earlier this year (despite its founders’ attempts at a comeback) “was one of BlockFi’s largest borrower clients,” Monday’s filing said. The Terra collapse likewise hurt the company.","BlockFi does hope to continue operating, although it reportedly plans to lay off staff.","Also, the company is suing Sam Bankman-Fried to secure control over Robinhood shares the former FTX CEO apparently pledged as collateral to the lender on Nov. 9.","There’s a number of events we’re watching this week tied to the general meltdown of the last month:","Key: (nom.) = nominee, (rum.) = rumored, (act.) = acting, (inc.) = incumbent (no replacement anticipated)","N\/A","If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!"],"entity":[{"type":"earlier this month","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"Nov. 9","content":"DATE"},{"type":"Celsius Network Ltd.","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"$257 million","content":"MONEY"},{"type":"Singapore","content":"LOCATION"},{"type":"morning","content":"TIME"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"several days earlier this month","content":"DATE"},{"type":"UST","content":"ORGANIZATION"}],"hashtag":["Regulations","Newsletters","State of Crypto","BlockFi","Bankruptcy"],"authors":["Nikhilesh De"]}