{"summary":"Ethereum Improvement Proposals (EIPs) are the central method around which updates and decisions are made on the Ethereum blockchain and are open to all.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-are-eip-and-erc-and-how-are-they-connected\/","publishDate":"2022-05-04T14:15:06","id":15014,"type":null,"title":"What Are EIP and ERC and How Are They Connected?","category":["Learn"],"content":["While tech giants like Apple (AAPL) and Microsoft (MSFT) regulate software updates behind closed doors, Ethereum takes the opposite approach. Anyone with enough technical proficiency can write, edit and submit Ethereum Improvement Proposals (EIPs) for new functionality or features that they would like to implement according to the guidelines in the EIP-1, which was published in 2015.","The EIP-1 is a highly recommended resource for prospective authors or contributors because it outlines all critical aspects related to EIPs, such as the process, definitions and types of EIPs, the EIP format and template, as well as a list editors and more.","If you do have an idea, know that authors of EIPs are also responsible for building engagement and gaining critical feedback in the Ethereum community.","Since Ethereum's inception in 2015, numerous proposals and ensuing contract standards have been approved.","As stated in EIP-1, Ethereum Request for Comment (ERC) relates to a specific category of Standards Track EIP. A Standards Track EIP describes any change that affects most or all Ethereum implementations and can be broken down into different subcategories such as core, networking, interface and ERC.","ERC: While the definition has grown over time, an Ethereum Request for Comment (ERC) was the original draft proposal developers wrote and later refined as an EIP for different application levels and conventions. These include token standards (ERC-20), URI schemes, library\/package formats (EIP-82) or wallet formats. If the specific EIP achieves consensus in the Ethereum community, it becomes a new standard that automates the rules outlined in the document through a related smart contract.","The main difference in these subcategories of Standards Track EIP is where it's deployed. For example, ERCs are deployed at the application level. They don't need to be adopted by all participants, unlike core which is deployed at the protocol level and requires a broader consensus in the community, as all core EIPs must be widely adopted (all nodes must upgrade to remain part of the network).","Along with a Standards Track EIP, other types of Ethereum Improvement Proposals include Meta EIP and an Informational EIP.","As a central and collaborative location that contains all of the project files and entire revision history, the Ethereum Improvement Proposals (EIPs) GitHub repository was created in 2015. It was also based on the Bitcoin Improvement Proposals (BIPs) process, which is modeled on the Python Enhancement Proposals (PEPs). However, before including a document in the repository, a rigorous and specific process needs to be followed as outlined in the EIP 1.","If the review period for drafts exceed six months or remain inactive, documents are labeled as \"stagnant.\" An ERC, however, can be revived if an author or editor moves it back to the draft stage. Proposals can also be withdrawn by authors but can be pursued later on, when they will be considered to be new proposals.","EIPs can also be categorized as \"living,\" which is a special status for EIPs that are continually updated and not meant to reach a final state, like the EIP-1","A list of EIP statuses and their definitions can be found here: https:\/\/eips.ethereum.org","The above diagram is the standard process for all EIPs in all tracks according to the EIP 1.","EIP Editors:","EIP editors are responsible for reviewing EIPs for technical soundness, spelling\/grammar and code style. The original EIP editors from 2015-2016 were Martin Becze, Vitalik Buterin and Gavin Wood, along with several others.","According to the EIP-1, the current EIP editors are:","Emeritus EIP editors are:","Along with EIP editors, community members of the Ethereum Cat Herders and Ethereum Magicians also help make decisions on which EIP gets implemented and help move EIPs to the final or withdrawn stages.","Once an ERC is ready for the repository, editors will also help to do the following:","Generally, proposals are created and reviewed by developers with write access to the Ethereum codebase. The editors don't pass judgment on these proposals, but rather handle housekeeping aspects like monitoring ERC changes, correcting structure, highlighting mistakes, etc.","Links to the various Ethereum GitHub repositories, EIP discussion boards and a list of all core Ethereum developer meetings can be found here: https:\/\/ethereum.org\/en\/developers\/docs\/standards\/.","EIPs (which include ERCs) are the central unit around which governance (decisions) happen and are documented on Ethereum. As part of a decentralized ecosystem, they are the way for anyone to propose, debate and adopt changes. Whether integrated as a standard or included in a broader network upgrade, EIPs also help people understand how certain tokens and aspects of Ethereum function relative to the specific smart contract. Every network upgrade also consists of a set of specific EIPs that each Ethereum client needs to implement to maintain consensus with each other.","A few examples of various ERC standards and their use cases include:","You can read the original proposal from Buterin and the related Reddit discussion for more detail, or dive into the mechanics in our ERC-20 token explainer.","Several well-known NFT collections that use the ERC-721 token standard include:","The original issues and discussions for ERC-721 can be found on the following links:","Further examples of ERC contract standards include:","Overall through concerted efforts between communities like Ethereum Cat Herders and Fellowship of Ethereum Magicians, the methods to integrate or make changes to Ethereum are increasingly streamlined as the network grows. Ethereum Cat Herders also encourage authors or potential implementers to speak on their PEEPanEIP series that provides an overview of EIPs considered for a network upgrade, ERC standards and other key concepts of the Ethereum blockchain. Further reading and information about the history of EIPs and the development of governance on Ethereum (including ERCs) can also be found on Hudson Jameson's blog.","Read More: What Is the ERC-20 Token Standard?","CORRECTION (May 4 , 14:14 UTC): Updated list of current and emeritus EIP editors per EIP-1."],"entity":[{"type":"2015","content":"DATE"},{"type":"Standards Track EIP","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Ethereum Cat Herders","content":"ORGANIZATION"},{"type":"Fellowship of Ethereum Magicians","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"EIP","content":"ORGANIZATION"},{"type":"Ethereum Magicians","content":"ORGANIZATION"},{"type":"Martin Becze","content":"PERSON"},{"type":"82","content":"DATE"},{"type":"Buterin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum GitHub","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"1","content":"DATE"},{"type":"Meta EIP","content":"ORGANIZATION"},{"type":"May 4","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Hudson Jameson","content":"PERSON"},{"type":"ERC","content":"ORGANIZATION"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Gavin Wood","content":"PERSON"}],"hashtag":["Learn","Ethereum","Intermediate"],"authors":["Mason Marcobello"]}