{"summary":"“We turn our scholars into investors,” says Philippines-based Spraky, tournament host for Yield Guild Games.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/30\/how-i-made-it-in-crypto-the-play-to-earn-guilder\/","publishDate":"2022-06-30T15:33:08","id":15016,"type":null,"title":"How I Made It in Crypto: The Play-to-Earn Guilder","category":["Consensus Magazine (layer2)"],"content":["Spraky practically lost his voice during a video chat with me from the Philippines in late June. It’s been spent talking with hordes of members from his play-to-earn gaming community, whom he’s met while traveling around the country from Baguio to Cebu City.","Still hours from his home in Nueva Ecija, Spraky (the name he goes by in Web3) has been hosting gaming tournaments and meetups for the locals in these areas who’ve joined Yield Guild Games (YGG). Their aim is to become part of a larger community that’s learning the ins and outs of crypto by playing video games.","This article is part of CoinDesk's Future of Work Week.","“We’re planning to do this every month in different major cities here in the Philippines,” he said. And even though it’s temporarily cost him his voice, it’s a part of his job he really loves. He’s one of those lucky guys who genuinely enjoys hanging out with the people he works with. “We’re staying in our community because we love our community. We love to hang out with everyone.”","Spraky, a former head of engineering at his local water utilities plant, quit that job for his many side hustles after he first discovered blockchain gaming around November 2020. He’s now a guild relations manager for the Philippines at YGG, a sprawling organization that owns non-fungible token (NFT) assets in games including Axie Infinity, CyBall and Fancy Birds.","YGG lends those assets out to players who can’t afford or don’t care to buy them – so they can still play-to-earn in the games – and takes a 20% cut for community managers and 10% for YGG overall. The remaining 70% goes to the players.","Spraky describes YGG as a “guild of guilds,” or a “DAO of DAOs.” In other words, it’s a large organization of play-to-earners (with about 30,000 current members in 28 countries around the world) that’s split up into numerous subguilds. Spraky manages “all of the subguilds inside YGG Philippines,” yet another larger subguild within the wider YGG universe. This means the bulk of his job entails him talking to and socializing with his community members, whether via Discord or IRL meetups, like those he’s been hosting this past week.","Like many others who’ve played-to-earn in the Philippines, Spraky first got into Web3 by playing Axie Infinity during the COVID-19 pandemic. Lockdowns across the country were especially strict, with many stuck at home or within a several-block radius – a particular problem for many in the Philippines who either work outside of the country for better financial opportunities or rely on family members who do. As of August 2020, unemployment in the country had reached a high of 17.7%.","Read more: ‘I Don't Follow Trends’: Multicoin’s Kyle Samani on How to Make It in Crypto","“A lot of people lost their jobs,” Spraky said. “So how they put food on the table was by playing [Axie Infinity].”","Spraky first encountered the Axies on Facebook – he came across a picture of someone playing the game, sparking his curiosity and an ensuing Google search. It led him to this very publication, where CoinDesk contributor Leah Callon-Butler had written an article about how people in Spraky’s very own Nueva Ecija were earning money by buying, breeding, battling and trading these little NFT-backed, blobby creatures that don’t quite resemble the amphibians (Axolotls) for which they’re named. Rather, they each have a set of unique, whimsical traits (like pumpkin-shaped fins and thorny caterpillar tails) that can make them more or less rare – which in the NFT world tends to translate directly to value. All kinds of people in Nueva Ecija had begun playing the game to both earn much-needed income and distract themselves during the economic devastation and isolation brought on by the pandemic, selling the assets they earned in the game in exchange for cryptocurrency, which they then turned into their local pesos.","This had been going on about 20 minutes from Spraky’s home in a more rural part of Nueva Ecija, but once Spraky learned about the game, he immediately “became really active within the Axie community,” he said. His playing-to-earn eventually translated to a full-time gig.","“I didn’t know anything about crypto back then,” Spraky admits, but he was welcomed into its sphere in part by the Filipino GameFi influencer Kookoo Crypto TV, who Spraky says invited him to join the YGG community. Spraky started spreading the word in his IRL community about the ability to earn via Axies – a somewhat tough sell, since a group of people in his area had been known to use crypto to scam others back during the initial coin offering (ICO) boom of 2017. But he and two friends cofounded Axie University (which YGG eventually helped scale due to the demand) to help communicate that this was different.","“As the community builders in our area, it's our job to introduce to [people] how to play Axie and how many opportunities can come [from that],” he said.","Today, Spraky does this by waking up and immediately hopping on Discord to check messages from his YGG community members. He uses the platform to chat with his team about how to support other managers in their network, checking in on YGG’s in-game NFT inventory and hosting events where play-to-earners can come to learn strategy and hang out virtually with one another.","At YGG, the lending of in-game blockchain assets is known as “scholarships,” and recipients are “scholars.” During the crypto bull market, when Spraky first got into his role, finding and retaining scholars was easy and enjoyable – Spraky did it for free on YGG’s behalf for months until he was officially hired this past December. There was plenty of buzz around the profitability of the play-to-earn grind, and it netted real profits for many, particularly in the Philippines. People would come to him, messaging him and his team members to figure out how they could get in on the windfall.","During the bear market, like most other crypto assets, the value of in-game NFTs like Axies has tanked, so joining a play-to-earn guild doesn’t have quite the same appeal. Instead of expanding the community, Spraky’s been working on keeping members “engaged” with events including bingo nights, singing contests and giveaways – it serves to keep up the community’s spirits and display how there are perks to being involved other than the earning potential. “It's not just about how much you earn,” Spraky says. “It's about how we have each other in our community.”","He also reminds scholars not to consider playing-to-earn as their primary source of income, and he walks the walk. Spraky’s many gigs span the virtual and physical worlds – he has a car paint shop with his family, buys NFTs, does crypto staking and participates in liquidity pools. (Though there was some reporting on people in places like the Philippines who were able to buy two houses during the earlier days of the pandemic purely from their play-to-earn income, Spraky notes that many of those people’s stories were more nuanced – they were also yield farming, staking and investing in tokens that ended up taking off.)","Instead, Spraky aims to emphasize the opportunities that learning about crypto through play-to-earn can bring. “We turn our scholars into investors,” he said, adding that some have even gotten jobs at other Web3 companies because of their experience playing blockchain-based games. Another strategy these days is to encourage players to buy up in-game assets while they’re cheap.","“At the end of the day, we're playing a game,” Spraky said. “Games were meant to be played to have fun, so we always tell our scholars that we’re playing this because we love the game.”","What Spraky really loves, though, is Web3 at large and the community of people he’s gotten to join because of it.","“We're staying here because the environment in Web3 is very different from a traditional corporate job,” he said. For example, he explains how YGG is helping MetaGoons, another Web3 gaming organization that’s essentially their competitor, because the Web3 ethos, as far as he’s experienced it, is about “promoting collaboration and healthy competition.”","“It's really like I'm not working,” Spraky added, “I didn't know crypto like, two years ago… [now] I really love being here in this space.”","The Crypto Jobs Boom","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","'We're Freaking DAOing It': The People Who Think DAOs Are the Future of Work","Meet the pioneers who work at decentralized autonomous organizations.","Chase Chapman on DAOs and Professional Polyamory","\"There's a lot of value in talent that doesn't want to be held down by one organization,” Orca Protocol’s Chase Chapman says.","Payroll, Web3 and the $62B Opportunity","Crypto can make it faster and cheaper to pay workers.","You’re Hiring Wrong: Do It More Like Web3","By adopting a more open, fluid model, traditional firms would find it easier to attract talent and end up with a more passionate, engaged workforce.","\n"],"entity":[{"type":"Leah Callon","content":"PERSON"},{"type":"70%","content":"PERCENT"},{"type":"2017","content":"DATE"},{"type":"August 2020","content":"DATE"},{"type":"Butler","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Google","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"Cebu City","content":"LOCATION"},{"type":"late June","content":"DATE"},{"type":"Spraky","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Chapman","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"November 2020","content":"DATE"},{"type":"Axie University","content":"ORGANIZATION"},{"type":"Yield Guild Games","content":"ORGANIZATION"},{"type":"17.7%","content":"PERCENT"},{"type":"19","content":"DATE"},{"type":"end of the day","content":"TIME"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Nueva Ecija","content":"LOCATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"$62B Opportunity","content":"MONEY"},{"type":"Spraky","content":"LOCATION"},{"type":"Kyle Samani","content":"PERSON"},{"type":"Spraky","content":"PERSON"},{"type":"Baguio","content":"LOCATION"},{"type":"YGG Philippines","content":"LOCATION"}],"hashtag":["Future of Work Week","Interview"],"authors":["Jessica Klein"]}