{"summary":"The bankrupt exchange wants to return funds to creditors in dollars without denting value.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/08\/24\/ftx-taps-galaxy-to-sell-stake-and-hedge-its-crypto-billions\/","publishDate":"2023-08-24T07:16:48","id":15013,"type":null,"title":"FTX Taps Galaxy to Sell, Stake and Hedge Its Crypto Billions","category":["Policy"],"content":["Bankrupt crypto exchange FTX wants to start selling, staking and hedging its sizable crypto holdings – and is seeking to hire Mike Novogratz’s Galaxy as an advisor to help, according to court filings made late Wednesday evening.","FTX, which collapsed in November last year, wants to return funds to creditors in fiat currency rather than bitcoin (BTC) or ether (ETH) – but hopes careful trading can avoid denting the value of over $3 billion in crypto holdings.","“Hedging bitcoin and ether will allow the Debtors [FTX] to limit potential downside risk prior to the sale of such bitcoin or ether,” the filing by FTX lawyers said. “Staking certain digital assets… will inure to the benefit of the estates — and, ultimately, creditors — by generating low risk returns on their otherwise idle digital assets.","FTX is hoping interest on its crypto pile will add to the stock it can distribute to customers who are still waiting for their money back. The company, now run by restructuring expert John J. Ray III, worries that selling all in one go would cause the price to plummet, to the benefit of short sellers and other market participants. It’s turning to market experts to figure out how best to avoid that, for example via weekly sales limits.","“Galaxy Asset Management has extensive experience in areas relevant to digital asset management and trading, including with respect to the types of transactions and investment objectives contemplated,” the document said, referring to the Security and Exchange Commission-approved investment advisor that forms part of Mike Novogratz’s crypto conglomerate.","Galaxy Digital (GLXY), another part of that empire, has previously declared it had tens of millions tied up in FTX at the time of its bankruptcy, and new filings detail the conflict-of-interest procedures that will ensure the asset managers act in FTX’s best interests.","In an April filing, FTX company said it had $3.4 billion worth of major, liquid crypto assets. In July, it said it expected to monetize crypto into cash before returning to customers, though international customers may be able to access a rebooted exchange. Other bankrupt crypto firms such as lender Celsius have opted to make distributions in liquid cryptocurrencies including BTC and ETH.","The requests must be approved by a Delaware bankruptcy court, which earlier on Wednesday heard that legal fees were costing the company $1.5 million per day as it seeks to wind up. On Tuesday, FTX founder Sam Bankman-Fried pleaded not guilty to a rejigged series of fraud charges relating to his management of the company.","Edited by Sandali Handagama."],"entity":[{"type":"$1.5 million","content":"MONEY"},{"type":"$3 billion","content":"MONEY"},{"type":"Delaware","content":"LOCATION"},{"type":"Galaxy Asset Management","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"evening","content":"TIME"},{"type":"Security and Exchange Commission","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"November last year","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$3.4 billion","content":"MONEY"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"John J. Ray III","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Sandali Handagama","content":"ORGANIZATION"}],"hashtag":["Regulations","FTX","Galaxy","Bankruptcy"],"authors":["Jack Schickler"]}