{"summary":"Binance is giving U.S. users 14 days to withdraw funds before their accounts are shuttered.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2020\/11\/24\/binance-ramps-up-crackdown-on-us-users-giving-them-14-days-to-withdraw-funds\/","publishDate":"2020-11-24T19:50:09","id":15021,"type":null,"title":"Binance Ramps Up Crackdown on US Users, Giving Them 14 Days to Withdraw Funds","category":["Markets"],"content":["","One of the crypto industry’s most popular exchanges is redoubling efforts to sweep U.S. users off its platform.","","","As reported by Decrypt, Binance is threatening a hard deadline to herd U.S. users off its original exchange platform (not to be confused with Binance US, which is legally open to U.S. residents). Email notices sent to U.S. users give them 14 days to withdraw funds before Binance shutters their accounts for good.","","","\"As we constantly perform periodic sweeps of our existing controls, we noted that you are trying to access Binance while having identified yourself as a U.S. person. Please note that as per our Terms of Use, we are unable to service U.S. persons. Please register for an account over at our partner, Binance US,” the notice reads.","","","“You have 14 days to close all active positions on your account and withdraw all your funds, failing which your account will be locked. Once your account is locked, you will have to raise a customer service ticket for us to assist you further,” it continues.","","","The Block noted the bans appear to be based on IP addresses. However, at least one U.S. user who never underwent know-your-customer (KYC) identity verification has not received a notice of account closure from Binance, CoinDesk has learned.","","","Upon registering for Binance, users have the option to defer KYC measures that would reveal their identities in exchange for lower daily deposit and withdrawal maximums. Additionally, it's not clear whether Binance cross-checked the physical location users claimed when signing up with their IP addresses.","","","Binance did not immediately respond to CoinDesk’s request for comment on whether it geoblocks based on IP or KYC information. ","","","Binance opened its U.S. exchange at the end of 2019 after U.S. regulators put pressure on the exchange to shut down access to U.S. denizens.  Its team has been attempting to geo-block U.S. users since July of last year, though it has ramped up efforts recently to make a final sweep.","","","UPDATE (Nov. 24, 23:05 UTC): Modified fifth paragraph to clarify the information came from a single U.S. user, and the sixth paragraph to clarify that Binance's practices for verifying user locations are unknown, not necessarily nonexistent.",""],"entity":[{"type":"Binance","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Binance US","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance US","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Nov. 24","content":"DATE"},{"type":"Binance","content":"ORGANIZATION"},{"type":"July of last year","content":"DATE"}],"hashtag":["Binance"],"authors":["Colin Harper"]}