{"summary":"The professionalization of crypto is here, whether it’s tokenized securities, crypto-forward financial products from the world’s largest asset managers or platforms that help financial advisors access this new market directly.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/25\/crypto-for-advisors-the-professionalization-of-crypto\/","publishDate":"2024-04-25T16:00:00","id":15029,"type":null,"title":"Crypto for Advisors: The Professionalization of Crypto","category":["Finance"],"content":["With so much to learn about in the crypto space and so little time, how do you create investment strategies for your clients? Eric Ervin, CEO of Onramp Invest, provides an overview of crypto investment models that advisors can consider as clients’ interest in crypto investments grows.","Leo Mindyuk, CEO of ML Tech, covers active vs passive bitcoin and crypto investment strategies in Ask an Expert.","–S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","My team and I have been talking a lot about the tangible shift in the crypto market. In contrast, a year ago, it felt like everyone was speaking directly to investors, pushing them towards numerous exchange applications and autonomous investing. Now, we’re seeing a focused attempt to empower professionals in the space. Whether it’s tokenized securities, crypto-forward financial products from the world’s largest asset managers, or platforms that help financial advisors access this new market directly, there’s no question that the professionalization of crypto is here.","This is great news for advisors. Not only does it mean broader access to an array of digital assets for clients, but it also means advisors can now build out a new offering in their business, serving clients by giving them what they’re looking for and capturing more assets under management (AUM) along the way. Firms that are equipped with access solutions are set up to thrive. As we’ve clearly seen with the bitcoin ETFs, investor demand for exposure to crypto is palpable, and it’s starting to open the door to the broader world of digital assets for advisors. However, there are a lot of digital assets out there to learn about, and cryptocurrencies are still only estimated at a recommended 1-6% allocation in a portfolio. When you’re managing a book of business that’s 95% traditional market funds, how are you supposed to learn about every coin or every top-mover in a market that moves 24\/7?","In the traditional market, there are expert asset managers to do this for you. So why not leverage the same tools for crypto?","Applying the tools you know to the market you don’t know (yet)","Just like in the traditional market, while SMAs are not meant to replace due diligence in practice; they allow advisors to leverage meticulously researched strategies built to cover the best parts of the digital asset market. Let’s break down how RIAs can apply this old tool to the new asset class:","5 ways crypto strategies from asset managers can be useful for advisors","Making the most of this asset class for clients","I know the saying “your money isn’t working hard enough for you” is cliche at this point, but the truth is that digital asset investing is no exception to the rules of portfolio diversification. Having all of your assets in bitcoin could be considered the same as having all of your funds in one stock. The digital asset market has seasons, meaning sometimes lesser-known cryptocurrencies or altcoins have higher performance than bitcoin or ether. When investors don’t consider a holistic crypto investment strategy, they are neglecting the potential to harness the market in a meaningful way. As a professional, you can now help them make the most of these opportunities by offering access to the larger ecosystem.","Meet demand and build expertise","It’s understandable to feel daunted by the amount of education needed to understand cryptocurrencies truly. Each one has a different purpose and a different value. Through asset manager strategies, you can tackle the market head-on and gain knowledge along the way while still meeting demand and keeping your firm relevant. This market is constantly growing, and leaders in the space, including all of us at Onramp Invest, a Securitize company, are committed to keeping you ahead of the curve.","- Eric Ervin, CEO, Onramp Invest","Q. What are the key differences between active and passive crypto investment strategies, and how do they impact risk and potential returns in the volatile cryptocurrency market?","Similar to the traditional markets, active and passive investment strategies in the cryptocurrency market offer contrasting approaches to building and managing a portfolio.","Passive crypto investment strategies involve selecting a portfolio of cryptocurrencies and holding them over a long period, regardless of short-term market fluctuations. Passive strategies can be implemented through buying an ETF or holding a diversified portfolio of cryptocurrencies, whether through the fund or an SMA structure. This approach typically requires minimal ongoing management, low transaction costs and simpler tax implications due to infrequent trading. In a successful passive strategy, the returns are generally close to the respective benchmark. For example, for a bitcoin ETF, the returns should be very close to the buy-and-hold strategy. In crypto markets, there are a lot of short-term price fluctuations, so passive strategies are typically associated with higher volatility and higher drawdowns.","Actively managed crypto strategies aim to generate attractive absolute returns or outperform the market by capitalizing on market inefficiencies and utilizing risk-management practices. Typically, an active approach is associated with constant monitoring and active risk management, higher transaction fees and higher performance and management fees paid to a professional asset manager. However, if implemented successfully, an active approach typically mitigates the volatility and drawdowns of the asset class and achieves higher risk-adjusted returns. There are various types of actively managed strategies which suit different investment objectives and risk-return targets.","In the volatile world of cryptocurrencies, the choice between an active and passive approach can significantly impact the results the investor can achieve.","Q. What types of active investment strategies are out there?","There are numerous actively managed strategies with different risk-return profiles for investors. Some actively managed strategies, such as funding rate arbitrage, basis arbitrage, statistical arbitrage, long-short, and short-term directional strategies, aim to achieve absolute returns. Typically, those are sophisticated strategies, involving various quantitative methods, complex and optimized execution as well as advanced risk-management techniques. These strategies are often not highly correlated with cryptocurrency prices and are able to achieve absolute returns with higher Sharpe ratios and lower drawdowns by monetizing the inefficiencies of the nascent asset class.","Another good example of actively managed strategies is strategies that aim to outperform the benchmark, e.g., bitcoin buy-and-hold strategy or market-cap weighted buy-and-hold strategy. Those strategies typically involve some sort of returns prediction, market-timing, and risk-management framework. If successful, an actively managed approach helps to achieve better risk-adjusted returns compared to the respective passive strategy. For example, a properly executed smart risk-managed exposure to bitcoin helps investors achieve higher returns with lower volatility than holding bitcoin ETFs.","Investors can typically get exposure to a variety of actively managed strategies through fund structures or separately managed accounts on spot or futures markets. Over time, I expect actively managed ETFs will be available for investors.","- Leo Mindyuk, CEO, ML Tech","Bitcoin’s fourth halving occurred Friday, April 20th, 2024, without a hiccup.","BlackRock’s spot bitcoin ETF continues to break records as it reached 70 days of inflows.","Paypal proposed an incentive program to incentivize low-carbon Bitcoin mining."],"entity":[{"type":"Eric Ervin","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"Sharpe","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"ML Tech","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Friday, April 20th, 2024","content":"DATE"},{"type":"Leo Mindyuk","content":"PERSON"},{"type":"S.M.","content":"LOCATION"},{"type":"95%","content":"PERCENT"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","Financial Advisers","sma","Portfolio management","Onramp Invest"],"authors":["Sarah Morton","Eric Ervin"]}