{"summary":"The defendants are said to have committed hundreds of acts of wire fraud, \"causing harm to Google and at least approximately 100,000 Google users.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/04\/google-takes-legal-action-against-alleged-crypto-scammers-for-uploading-fraudulent-apps\/","publishDate":"2024-04-04T12:07:19","id":15028,"type":null,"title":"Google Takes Legal Action Against Alleged Crypto Scammers for Uploading Fraudulent Apps","category":["Policy"],"content":["Google filed a lawsuit against alleged crypto scammers claiming they uploaded fraudulent investment apps to Google Play.","The lawsuit filed Thursday in the Southern District of New York alleges that Yunfeng Sun and Hongnam Cheung committed hundreds of acts of wire fraud, \"causing harm to Google and at least approximately 100,000 Google users.\"","The defendants made \"multiple misrepresentations to Google in order to upload their fraudulent apps to Google Play, including but not limited to, misrepresentations about their identity, location, and the type and nature of the application being uploaded,\" according to the filing.","Victims were lured to download the apps with promises of high returns from investing in crypto and other products, which the lawsuit described as \"illusory.\" When victims attempted to withdraw their balances, they would be asked to pay various fees to recover their investments and purported gains, according to the filing.","\"This is a unique opportunity for us to use our resources to actually combat bad actors who were running an extensive crypto scheme to defraud some of our users,\" Halimah DeLaine Prado, general counsel at Google, said in an interview with CNBC. \"This [lawsuit] allows us to not only use our resources to protect users, but to also serve as sort of a precedent to future bad actors that we don't tolerate this behavior.\"","Read More: Crypto Users Lost $2B to Hacks, Scams and Exploits in 2023, De.Fi Says","Edited by Sheldon Reback.","\n","\n","\n","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Southern District of New York","content":"ORGANIZATION"},{"type":"Halimah DeLaine Prado","content":"PERSON"},{"type":"Crypto Users Lost","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Hongnam Cheung","content":"PERSON"},{"type":"$2B","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"CNBC","content":"ORGANIZATION"}],"hashtag":["Google","Fraud","Court Cases","Scammers","US","SDNY"],"authors":["Jamie Crawley"]}