{"summary":"The prosecution brought plenty of evidence, from spreadsheets and audio recordings to witness testimony. SBF&#x27;s lawyer simply asked, &quot;But why?&quot;","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/260605\/sbfs-closing-argument-prosecutions-movie-villain-narrative-lacks-any-clear-motive","publishDate":"2023-11-01T22:11:52","id":1502,"type":null,"title":"SBF&#x27;s closing argument: Prosecution&#x27;s &#x27;movie villain&#x27; narrative lacks any clear motive","category":["COMPANIES"],"content":["<span data-v-f87c67ca=\"\">Assistant U.S. Attorney Nicolas Roos painted a dire picture in front of the jury when he described the collapse of FTX and the role of its CEO and founder, Sam Bankman-Fried. Not only did he knowingly misappropriate customers’ money, but he also lied about it under oath, the prosecutor told the jury on Wednesday.<\/span>","<span data-v-f87c67ca=\"\">\"He spent his customers’ money and he lied about it,\" Roos said, characterizing FTX as \"a pyramid of deceit built by the defendant on a foundation of lies and false promises.\" In Nov. 2022, as FTX users were trying to get their savings off the exchange amidst the collapse, Roos told the jury, \"With each additional click of the withdrawal button, their dread turned to despair. Their money was gone.\"<\/span>","<span data-v-f87c67ca=\"\">\"Who was responsible? This man, Sam Bankman-Fried,\" Roos said, stepping in Bankman-Fried’s direction and pointing at him.<\/span>","<span data-v-f87c67ca=\"\">The former FTX CEO had multiple chances to come clean and make things right, but instead, again and again, he chose to double down and take more of his customers’ funds for his own benefit, the prosecutor argued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The first such occasion Roos identified was when FTX bought back its own shares from Binance in 2021. Bankman-Fried was well aware that Alameda did not have enough money for the deal and would have to borrow from FTX but greenlighted it anyway, Roos said. A similar approach was applied the same year to venture investments in Genesis Digital Assets, Anthropic, K5 and others.<\/span>","<span data-v-f87c67ca=\"\">Another potential moment of truth came in June 2022, when FTX leadership discovered a bug in the accounting system and then realized how much Alameda had borrowed from FTX ($10 billion dollars). But instead of coming clean, Bankman-Fried again decided to double down and approved circulating misleading versions of Alameda’s balance sheet to investors, Roos said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Then in September 2022 came more spending, directed by Bankman-Fried, on investments, political donations, and other unnecessary expenses – even though Alameda CEO Caroline Ellison made it clear that Alameda’s debt went up to $14 billion and she didn’t see any way to repay it, Roos said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">And finally, in November 2022, as the final crisis was unfolding at FTX, Bankman-Fried chose to send a series of reassuring yet misleading tweets rather than acknowledge the deep problems he was well aware of, Roos said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried’s argument that he was not aware of the state of things in his two companies, FTX and Alameda Research, is false, Roos insisted, and the intricacies of blockchain technology or leveraged trading have nothing to do with it.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"He took the customers’ money, he knew it was wrong. But he thought he was smart, that he could make it back,\" the prosecutor said, adding to the jury: \"And it ends with you today.\"<\/span>","<span data-v-f87c67ca=\"\">Roos pointed to contradictions between Bankman-Fried's testimony and those of his former employees, Gary Wang, Caroline Ellison, Nishad Singh and Adam Yedidia. While the former FTX CEO has portrayed himself as maintaining distance with Alameda Research and the billions of dollars it borrowed from the FTX treasury, \"the defendant is Alameda,\" Roos said.<\/span>","<span data-v-f87c67ca=\"\">FTX, the prosecutor continued, from the start was regarded by Bankman-Fried as a funding source for Alameda, and it was he who set up a system essentially allowing Alameda to dig endlessly into FTX customers’ deposits. Other customers never had similar privileges and neither were they told Alameda had them.<\/span>","<span data-v-f87c67ca=\"\">As both the 90% owner of Alameda and CEO of FTX, Bankman-Fried was the only person who had both a motive and means of control to allow Alameda to take advantage of customers’ funds, Roos told the jury. And while he knew FTX users’ funds weren’t safe and intact, Bankman-Fried \"was lying to the public and said the same lies on the witness stand.\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Bankman-Fried’s argument that he didn’t know how bad things were at Alameda and FTX right before the crash is also false, Roos said. \"I mean, give me a break, this is a lie!\"<\/span>","<span data-v-f87c67ca=\"\">Rather than rebut each and every one of the prosecution's assertions, Bankman-Fried's lead attorney Mark Cohen, after thanking the jury for their time, attention, and service, chose instead to attack the heart of the government's narrative.<\/span>","<span data-v-f87c67ca=\"\">\"The government's core case is…based on a false premise, which their own witnesses have rejected, that from the very beginning…FTX was a fraudulent enterprise established by Sam and Gary, Caroline and Nishad, to intentionally steal customer funds from the very earliest days, and that the events of June through November of 2022 were simply a continuation of that fraud,\" Cohen said. \"That's not what the evidence showed here.\"<\/span>","<span data-v-f87c67ca=\"\">Instead, Cohen argued that Bankman-Fried built two billion-dollar \"legitimate, valid, innovative businesses in a new and changing world —&nbsp;the crypto world.\" Cohen repeatedly insisted that Bankman-Fried made reasonable business decisions as CEO, both good and bad, though the lack of a risk management team or Chief Risk Officer at FTX was ultimately a critical mistake. Yet, \"poor risk management is not a crime,\" Cohen said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The lawyer appealed to the jurors' common sense and repeatedly implored them to \"ask themselves\" whether the government’s interpretation of Bankman-Fried’s acts made sense. \"In the real world, things can get messy, people can make mistakes.\" If Sam took too much risk, it doesn’t mean he did it with criminal intent, Cohen said.<\/span>","<span data-v-f87c67ca=\"\">Cohen argued that the government's story of a willful conspiracy fell flat in certain circumstances. For instance, the infamous $65 billion line of credit for Alameda, as well as its unique ability to have a negative balance on FTX without getting liquidated, were created \"in response to business issues\" and aimed \"to help customers, not hurt them,\" Cohen said. And if the conspirators were trying to hide those features, they wouldn't have published commits to the codebase that openly explained the purpose of the code changes, he pointed out.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Nobody seemed to mind what Alameda and FTX did before June 2022, Cohen said, including the former executives who testified against Bankman-Fried in court. \"Everyone thought they were operating one of the most successful crypto exchanges in the world,\" Cohen said, with \"excellent products…hundreds of employees, licenses in many countries throughout the world, and millions in daily revenue.\"<\/span>","<span data-v-f87c67ca=\"\">And when Bankman-Fried attempted to sell FTX to Binance, his archrival, it was nothing but proof that \"he is, and always was, willing to give everything he had\" to save the company, Cohen argued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Cohen and Bankman-Fried are hoping their narrative-based argument pays off for one key reason: as Cohen repeatedly stressed in his closing, if the jury finds that Bankman-Fried acted in good faith with respect to each of the charges, he must be fully acquitted.<\/span>","<span data-v-f87c67ca=\"\">Furthermore, Cohen explained, it's not up to the defense to prove that Bankman-Fried was acting in good faith, but rather the burden of proof fell on the prosecutors to \"prove fraudulent intent and the consequent lack of good faith beyond a reasonable doubt.\" Bankman-Fried's mistakes, bad business decisions or errors did not constitute a lack of good faith, Cohen argued.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The government portrayed Bankman-Fried as a movie villain, Cohen argued, replete with awkward photographs and testimony about his sex life. \"What the government kept leaving out of its movie is the 'why,'\" Cohen said.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">If he was the criminal mastermind the government insisted he was, would Bankman-Fried speak on the TV show \"Good Morning America\" after FTX filed for bankruptcy? Would he suggest closing down Alameda in the middle of 2022? Pay back Alameda’s lenders instead of running with the money? Voluntarily testify in Congress? The answer to each of these questions is no, Cohen told the jury.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While Cohen took care to not blame Bankman-Fried's subordinates more than absolutely necessary — the failure to notice the fiat@ liability and hedge Alameda's assets weren't anyone's fault, Cohen argued — he did ask the jury to carefully consider the circumstances of their testimony.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">\"But then Gary slipped…and he said: 'You know, ideally, I don't want any jail time.' That's what this was about,\" Cohen argued. \"They are not going to get the kind of cooperation agreement they want, the kind of sentence reduction motion by saying, 'You know, at the time we really didn't think anything was wrong.'\"&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Tomorrow, the prosecution will present a rebuttal closing and the jury will receive its lengthy charging instructions. Then, deliberation will begin. The Block will be back in the courtroom reporting on the final moments of Bankman-Fried's trial.&nbsp;<\/span>","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Sam and Gary","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"$10 billion dollars","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"The Block","content":"ORGANIZATION"},{"type":"$65 billion","content":"MONEY"},{"type":"Roos","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Sam","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"Binance","content":"PERSON"},{"type":"June 2022","content":"DATE"},{"type":"Binance","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Caroline","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Nicolas Roos","content":"PERSON"},{"type":"Nov. 2022","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Nishad Singh","content":"PERSON"},{"type":"Cohen","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Nishad","content":"ORGANIZATION"},{"type":"Gary","content":"PERSON"},{"type":"Alameda","content":"LOCATION"},{"type":"Alameda","content":"PERSON"},{"type":"$14 billion","content":"MONEY"},{"type":"Bankman","content":"LOCATION"},{"type":"Bankman","content":"PERSON"},{"type":"September 2022","content":"DATE"},{"type":"Adam Yedidia","content":"PERSON"},{"type":"Gary Wang","content":"PERSON"},{"type":"June through November of 2022","content":"DATE"},{"type":"Mark Cohen","content":"PERSON"}],"hashtag":["FTX","SAM BANKMAN-FRIED","SBF TRIAL"],"authors":["Anna Baydakova","Zack Abrams","The Block"]}