{"summary":"The latest in blockchain tech upgrades, funding announcements and deals. For the period of April 11-17.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/11\/protocol-village\/","publishDate":"2024-04-17T17:03:23","id":15033,"type":null,"title":"Protocol Village: Lido Launches 'Simple DVT Module' With Distributed Validator Technology","category":["Technology"],"content":["April 17: Lido, the staking protocol for Ethereum, launched the Simple DVT Module, enabling solo stakers to participate in Lido protocol by leveraging distributed validator technology (DVT) solutions from Obol and SSV Network, according to the team: \"Approved by Lido DAO in October, DVT diversifies node operators, welcoming participation from solo and community stakers. An anticipated influx of 250 net-new node operators are expected to join the Lido protocol, a 600% increase. Simple DVT strengthens Lido Node Operators’s infrastructure resilience by diversifying hardware, client implementations and geographic distribution, fostering a decentralized ecosystem.\" (Read our Sam Kessler's story about the project from December, when it was in testing.)","April 17: OpenAI founder Sam Altman's retina-scanning crypto startup, Worldcoin, is getting its own blockchain. World Chain, a layer-2 network on Ethereum slated for a release this summer, will grant special treatment to users who scan their eyeballs in exchange for a \"World ID\" digital passport.","April 17: Kraken, the second-biggest U.S.-based crypto exchange, has developed its own wallet, catching up to its rival Coinbase in the product arena and joining a saturated field that also includes major players like MetaMask, Ledger and Trezor. The new self-custodial “Kraken Wallet\" is being releasing Wednesday and will be available to both Kraken users and non-users, CoinDesk is first to report. The wallet will initially support eight blockchains including Bitcoin, Ethereum, Solana, Optimism, Base, Arbitrum, Polygon and Dogecoin.","April 17: Nebra, a research and development organization dedicated to the privacy and scaling of blockchain technology through zero-knowledge proofs (ZKPs), has raised $4.5 million in a combined pre-seed\/seed round led by Nascent and Bankless Ventures, with the participation of many notable angels such as Tim Beiko from Ethereum Foundation, Kartik Talwar from ETHGlobal, Nick White from Celestia, Sandy Peng and Haichen Shen from Scroll, according to the team: \"Nebra has also received funding from a16z Crypto Startup Accelerator (CSX), as a participant in the CSX Spring 2024 cohort in London.\" According to Nebra's project documentation, its \"universal proof aggregation\" (UPA) protocol \"scales and composes zero-knowledge proof verification on Ethereum\/EVM chains.\"","April 17: Polyhedra Network and Google Cloud have partnered \"to bring ZK proofs to developers,\" according to the team: \"With Blockchain Node Engine, they are streamlining ZK workloads for blockchain. The development of efficient ZK proofs could revolutionize privacy-preserving machine learning and with platforms like Google Cloud's Vertex AI to offer advanced features and capabilities in zk Machine Learning apps. Polyhedra's Proof Cloud has already completed over 40M ZK proof tasks for zkBridge.\"","April 17: Mysten Labs, announced a partnership with BytePlus, ByteDance’s enterprise technology arm, to explore collaboration on data warehousing, AI recommendation algorithms and AI visual algorithms in Web3 game platforms and socialFi projects on Sui. According to the team \"The partnership between the two organizations will allow Sui to utilize ByteHouse, a cloud-native data warehouse for batched and real-time analysis, in combination with Sui’s full nodes data, to elevate performance and ensure accelerated delivery for users.\" (SUI)","April 17: Zeko Labs has raised $3 million in a pre-seed funding round from a consortium of early-stage investors, acccording to the team: \"Funding will accelerate the development and deployment of the Zeko Protocol, a cross-chain zk scaling protocol built in collaboration with the Mina Foundation and o1Labs and designed for the next generation of applications shaping the future of finance, AI, gaming and the internet.\"","April 17: Matera, a Web3 foundation, secured $3.6 million in a strategic token round from investors including Sidedoor Ventures, The Sandbox, Enjinstarter, Gemini, and Kingsway Capital, according to the team: Matera, a Landvault spinoff, \"supports X, and plans to integrate more social platforms soon. Users on X can attract stakers, raise capital, and monetize superfans. Over time, Matera aims to build the entire infrastructure to support 100 million creators on-chain, including a DeFi platform, the protocol layer, and its own layer 2.\"","April 17: Core Chain, a layer-1 blockchain built around a consensus mechanism called \"Satoshi Plus,\" has introduces non-custodial BTC staking, according to the team: \"For the first time ever, BTC can function as a yield-bearing asset, without the need to leave existing Bitcoin architecture.\" A FAQ is here.","April 17: LimeChain and Polkadot Prodigy are \"joining forces to bring an incredible opportunity for the Polkadot dev community, the Polkadot Prodigy Hackathon,\" with registration starting April 15, according to the team. \"Backed by a grant from the Web3 Foundation, the Polkadot Prodigy Hackathon is aimed at both aspiring and experienced Web3 engineers who are eager to learn more about Polkadot development and increase their expertise in the field while competing for a large prize pool of $58,000.\" (DOT)","April 17: Decentralized social-investing marketplace Zignaly announced the ZIGChain layer-1 blockchain on Cosmos and a $100 million ecosystem development fund. The fund will focus on developing wealth-generation infrastructure that is effortless from the user's perspective, the team said at Token2049 in Dubai.","Protocol Village is a regular feature of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Project teams can submit updates here. For previous versions of Protocol Village, please go here. Also please check out our weekly The Protocol podcast.","April 16: The team behind Internet Computer Protocol (ICP) said that the implementation of threshold-Schnorr will allow to etch Runes, trade BRC-20 tokens and \"unleash the full potential of Bitcoin-based DeFi and Web3,\" with ICP \"primed to become Bitcoin layer zero,\" according to a message. The implementation of threshold-Schnorr will allow ICP smart contracts to directly sign Schnorr signatures to:","- Inscribe ordinals in a decentralized way","- Send and receive BRC-20 tokens directly on Bitcoin L1","- Easily bridge BRC-20s","- Sign Taproot transactions","- Re-inscribe ordinals, unlocking dynamic ordinal NFTs that change based on user behavior or other data on Bitcoin","April 16: Crypto Valley Exchange (CVEX), a DeFi protocol set to offer crypto futures and options trading, announced it has raised $7 million across pre-seed and seed fundraising rounds. According to the team: \"The $7 million fundraise is co-led by Fabric Ventures and Kyber Capital Crypto Fund, a SALT Family fund, with significant contributions from AMDAX, Wave Digital, Funfair Ventures, Seier Capital Family Office, Five T Group, and Saxon. CVEX natively supports futures and options trading by users with wallets across Ethereum, Optimism, BASE and Solana alongside Arbitrum. The CVEX mainnet is expected to launch this summer.\"","April 16: Northstake, a regulated custodial virtual asset service provider, announced the launch of a \"tokenized ETH staking pilot\" on the Ethereum test network Holesky. According to a press release: \"The pilot is conducted in collaboration with leading digital asset manager 3iQ, a Canadian investment fund manager, alongside CoinFund and CoinDesk Indices, contributing CESR, the composite ether staking rate. Industry-leading liquidity providers are currently onboarding with Northstake and will be announced shortly.\" The project \"demonstrates the capability of tokenized staking to allow regulated institutions to liquidate their Ethereum validator nodes within hours instead of days, while satisfying regulators' requirements.\" Regarding the role of CoinDesk Indices: \"Northstake intends to leverage CoinDesk’s standardized USD-denominated reference rate for spot ether (ETH) and CESR to ensure transparent settlement prices between buyers and sellers.\"","April 16: Suku, a provider of Web3 tools, in collaboration with Alchemy and Privy, has launched SukuPay, \"a simple, free and fully non-custodial global money transfer solution,\" according to the team: \"Leveraging account abstraction, SukuPay removes the need for initial setup like creating a wallet or remembering a seed phrase, while still providing a non-custodial experience. With just a phone number, users can effortlessly send and receive funds without any fees. It's built on the efficient Polygon PoS network and utilizes the USDC stablecoin.\" SukuPay is poised to transform payment transfers worldwide. Learn more at sukupay.world.","April 16: MetaMask and Mesh have unveiled a global partnership that \"enables MetaMask portfolio users to seamlessly aggregate and track their crypto assets on exchanges directly within the MetaMask interface for the very first time,\" according to the team: The goal is \"to power the more comprehensive user experience, complete with account aggregation, transaction histories and an extensive integration catalog. The Mesh and MetaMask partnership will eventually include transfers and deposits from hundreds of exchanges and platforms thanks to Mesh’s APIs.\"","April 16: Contango Digital Assets, a crypto-focused venture capital firm, \"reached its first close on their $10 million seed fund, bringing in $5 million to support seed round companies building at the intersection of blockchain and AI,\" according to the team: \"Investors in the Contango Blockchain x AI Fund include XVentures, the CEO of Quantstamp, CFO at SingularityNet, CEO at WonderFi, early LPs in Digital Currency Group and Polychain Capital and investors from Vanta DAO. With strong backing, the fund is poised to help drive forward the convergence of blockchain and AI technologies.\"","April 16: Mantra is launching an incubation program at the Dubai World Trade Center, backed by an $11 million funding round, according to the team: \"In partnership with Virtuzone, the program aims to nurture projects in the Real World Asset tokenization sector, providing financial support, mentorship and access to a global network of investors. Selected projects will receive a $100,000 seed investment and undergo a comprehensive incubation journey across Hong Kong, San Francisco, and Dubai. This initiative reflects MANTRAs commitment to fostering innovation in the Web3 space and empowering startups to scale in the MENA region.\"","April 16: Amid a rekindling of Bitcoin development fervor, layer-2 network Stacks is looking to reinvent itself. As early as April 16, the major player in the Bitcoin L2 sector will kick off the release of its so-called Nakamoto upgrade, in the works for years – designed to dramatically increase the project's speed. It’s a defining moment for the blockchain project that has been in development for nearly half a decade, but officially launched its mainnet in 2021.","April 16: OKX, the fourth-largest crypto exchange, said its new layer-2 blockchain, called X Layer, has gone live on its public mainnet, a continuation in the era of major crypto companies starting their own distributed networks. X Layer, previously known as X1, makes use of Polygon's Chain Development Kit (CDK), a customizable toolkit that lets developers build their own chains by making use of zero-knowledge technology. The news comes as other major cryptocurrency exchanges have pursued their own layer-2 networks over the past year. In August, Coinbase launched its “Base” blockchain, which is built with Optimism’s OP Stack. Kraken is reportedly also interested in creating its own layer-2 blockchain.","April 16: Liquid restaking protocol Puffer has raised $18 million in a Series A funding round, the company said Tuesday. The round was led by Brevan Howard Digital and Electric Capital, with investments from Coinbase Ventures, Kraken Ventures, Lemniscap, Franklin Templeton, Fidelity, Mechanism, Lightspeed Faction, Consensys, Animoca and GSR, the company said in a press release.","April 14: Mayan Finance, a cross-chain swap auction protocol on Solana, has raised $3 million in a seed round, led by 6MV and Borderless, according to the team: \"The innovative auction protocol attracts support from Anatoly Yakovenko, co-founder of Solana, and Saeed Badreg, co-founder of Wormhole. Mayan has already achieved impressive growth since its mid-2023 launch, surpassing $470 million in volume and becoming a core connector for Solana, Ethereum, and major Web3 ecosystems. Mayan is powering inter-chain swaps on Drift and MarginFi, while other projects like Backpack use Mayan's open-source SDK with custom UI for in-wallet cross-chain swaps.\"","April 12: Blockchain platform Berachain closed oversubscribed Series B funding round, securing $100 million, according to the team: \"Framework Ventures, one of the earliest VC firms to enter the DeFi space, and Brevan Howard Digital’s Abu Dhabi branch co-led the round. With 200+ applications committed to building on the chain at launch, Berachain’s goal is to develop the first blockchain ecosystem that aligns incentives for security and liquidity at the network level, allowing the liquidity present on the network to also serve as a source of security. The blockchain’s novel 'Proof of Liquidity' consensus mechanism gives application developers a unique incentive to build and grow on Berachain.\"","April 12: Eoracle, a decentralized oracle network that recently launched staking on EigenLayer, aims to enhance Ethereum's security and data reliability through a trust marketplace – an incentive for accurate data, as founder and CEO Matan Sibon put it in an interview with CoinDesk. Creating a credible, neutral marketplace through eoracle allows for the matching of supply and demand with free market pricing, thereby fostering a more diverse and unbiased oracle ecosystem that significantly reduces operational costs, Sibon said. \"We think that a marketplace, an open market, a free market, is the best way of finding and allowing price discovery to any asset or service,\" he said. Through EigenLayer, eoracle can use a decentralized network of Ethereum validators, enhancing the trust, diversity and security of the oracle system without requiring validators to provide additional, separate stakes. Sibon said that the next step for eoracle is the launch of a mainnet to enhance integration with Ethereum rollups and expand functionalities. – By Sam Reynolds in Taipei.","April 12: Data provider Chainlink unveiled Thursday its blockchain bridge application called \"Transporter,\" which allows users to move crypto assets and data across multiple networks. Chainlink's bridge is available for both individual users and institutions and aims to allow \"a cost-efficient way to make high-value token transfers across blockchains with peace of mind,\" a Chainlink spokesperson explained in an interview on Telegram. The first available blockchains for Transporter are Arbitrum, Avalanche, Base, BNB Chain, Ethereum, Optimism, Polygon, and WEMIX, the press release said. CoinDesk 20 asset: (LINK)","April 11: Tate Berenbaum, who reportedly raised $30 million while still a teenager for crypto startup Community Labs, has launched of AO Ventures, a 10-week incubator program dedicated to fostering development on Arweave and AO, according to a message from Berenbaum. \"Over $35 million in capital has already been committed to the investment pool. The program will start in April and culminate in a Demo Day in June.\" AO is described on the Community Labs website as a \"hyper parallel computer\" with a core objective of \"merging the benefits of trust minimization with the speed and traditional computing environments.\" The Arweave network is for \"permanent information storage,\" according to its website. (AR)","April 11: QED Protocol, the world's first zk-native blockchain protocol, together with StarkWare, zkLink, Mina Protocol, O(1) Labs, announced the launch of the L2O Consortium, a group of projects and protocols committed to bringing Bitcoin’s native security, internet scale, and interoperability to applications and Layer 2 solutions. According to a press release: \"The consortium is developing reference implementations, tools, and resources for developers looking to build DApps or deploy Layer 2s on top of Bitcoin and enable trustless interoperability between applications by coordinating standards across solutions, leveraging ordinals and zero-knowledge proofs to bridge the technical gaps that previously hampered smart contract-like functionality on Bitcoin.\" The reference implementations are here in the project documentation.","April 11: DLC.Link, describing itself as the \"self-wrapping trustless bridge to DeFi,\" announced the release of dlcBTC, \"a safer wrapped Bitcoin alternative, built utilizing discreet log contracts (DLCs).\" According to the team: \"DLC.Link created a trustless bridge between Bitcoin and Ethereum, transforming Bitcoin’s role in DeFi. DlcBTC represents a significant advancement in this transformation, allowing users to seamlessly utilize bitcoin across the Ethereum ecosystem while retaining full ownership of their assets. The newly launched dlcBTC enables depositors to engage in trading, lending and hedging while maintaining self-sovereignty.\"","April 11: Auradine, a maker of Bitcoin mining rigs, announced its Series B round of over $80 million. According to the team: \"The Series B follows Auradine’s $81 million Series A, which was led by Celesta Capital and Mayfield in 2022.\"","April 11: The Galxe Identity Protocol has launched its mainnet, utilizing zero-knowledge proofs to grant users \"autonomy over their digital identity and private data.\" According to the team: \"The protocol's privacy-first design safeguards user identities, even in scenarios requiring public verification, and enables cross-domain pseudonymous identities, allowing users to maintain consistent identities across different platforms.\"","April 11: Masa Network has launched its AI Data Network and Marketplace mainnet, allowing users to control and monetize their digital data while contributing to AI model training. The network ensures privacy and encryption of user data through \"Zero-Knowledge Soulbound Tokens.\"","April 11: Zest Protocol has opened its first public lending markets on the Stacks L2 platform, allowing Bitcoin holders to participate in on-chain lending. The initiative is part of the broader Nakamoto upgrade, which aims to expand Bitcoin's utility in decentralized finance (DeFi).","April 11: Omni Network, an interoperability protocol powered by EigenLayer restaking, announced details for its OMNI Genesis airdrop program. This event will be instrumental in rewarding the Omni community and its partners across the Ethereum ecosystem. Omni has allocated 3% of its total token supply to its airdrop, which will be distributed amongst testnet users, dedicated Ethereum NFT collections and developers, investors, and others.","April 10: Diva Staking, the liquid staking protocol on Ethereum, has introduced the Nektar Network, a \"restaking\" protocol that will compete with EigenLayer to let upstart networks borrow Ethereum's security.","April 10: Ledger, the crypto wallet maker, and Stader Labs, a liquid staking platform, have released a feature on the Ledger Live app allowing for \"one-click ETH staking,\" with extra rewards offered for early adopters. The product will be live at 8 a.m. UTC on April 15.","April 10: Layer N, a layer-2 network on Ethereum, has launched its testnet, following a $5 million funding round supported by Peter Thiel’s Founders Fund. Designed as a network of rollups with a unified communication and liquidity layer, Layer N aims to optimize the execution layer for numerous applications while maintaining user-friendly experiences.","Edited by Bradley Keoun.","\n"],"entity":[{"type":"Sam Reynolds","content":"PERSON"},{"type":"Polygon's Chain Development","content":"ORGANIZATION"},{"type":"$11 million","content":"MONEY"},{"type":"MENA","content":"ORGANIZATION"},{"type":"Peter Thiel","content":"PERSON"},{"type":"Lido DAO","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"AO","content":"ORGANIZATION"},{"type":"Mysten Labs","content":"ORGANIZATION"},{"type":"SDK","content":"ORGANIZATION"},{"type":"20s","content":"DATE"},{"type":"Web3 Foundation","content":"ORGANIZATION"},{"type":"Mina Foundation","content":"ORGANIZATION"},{"type":"Schnorr","content":"PERSON"},{"type":"Northstake","content":"ORGANIZATION"},{"type":"Mayan Finance","content":"ORGANIZATION"},{"type":"Saeed Badreg","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"Funfair Ventures","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"600%","content":"PERCENT"},{"type":"$18 million","content":"MONEY"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"AO Ventures","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Vertex","content":"ORGANIZATION"},{"type":"Tim Beiko","content":"PERSON"},{"type":"$58,000","content":"MONEY"},{"type":"Brevan Howard Digital’s Abu Dhabi","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"$100,000","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"summer","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"Omni Network","content":"ORGANIZATION"},{"type":"$81 million","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Celesta Capital","content":"ORGANIZATION"},{"type":"Ethereum NFT","content":"ORGANIZATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"Nektar Network","content":"ORGANIZATION"},{"type":"Satoshi Plus","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Crypto Valley Exchange","content":"ORGANIZATION"},{"type":"London","content":"LOCATION"},{"type":"Nebra","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Vanta DAO","content":"ORGANIZATION"},{"type":"Dubai World Trade Center","content":"ORGANIZATION"},{"type":"Taipei","content":"LOCATION"},{"type":"Puffer","content":"PERSON"},{"type":"L2O Consortium","content":"ORGANIZATION"},{"type":"Spring 2024","content":"DATE"},{"type":"$7 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Contango Digital Assets","content":"ORGANIZATION"},{"type":"Sam Altman","content":"PERSON"},{"type":"Matera","content":"PERSON"},{"type":"Sui","content":"LOCATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Sui","content":"PERSON"},{"type":"Celestia","content":"LOCATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"Lido","content":"LOCATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"Community Labs","content":"ORGANIZATION"},{"type":"Mina Protocol","content":"PERSON"},{"type":"Kraken Ventures","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"Masa Network","content":"ORGANIZATION"},{"type":"Five T Group","content":"ORGANIZATION"},{"type":"Bankless Ventures","content":"ORGANIZATION"},{"type":"$3.6 million","content":"MONEY"},{"type":"Sibon","content":"PERSON"},{"type":"Berenbaum","content":"PERSON"},{"type":"Nick White","content":"PERSON"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Kingsway Capital","content":"ORGANIZATION"},{"type":"Lido Node Operators","content":"ORGANIZATION"},{"type":"Mayfield","content":"ORGANIZATION"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"April","content":"DATE"},{"type":"Enjinstarter","content":"PERSON"},{"type":"Scroll","content":"LOCATION"},{"type":"Kartik Talwar","content":"PERSON"},{"type":"ICP","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"3%","content":"PERCENT"},{"type":"$35 million","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Gemini","content":"LOCATION"},{"type":"Fabric Ventures","content":"ORGANIZATION"},{"type":"April 11","content":"DATE"},{"type":"Sandy Peng","content":"PERSON"},{"type":"April 10","content":"DATE"},{"type":"$3 million","content":"MONEY"},{"type":"April 12","content":"DATE"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Zeko Labs","content":"ORGANIZATION"},{"type":"Saxon","content":"LOCATION"},{"type":"Virtuzone","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"\"Framework Ventures","content":"ORGANIZATION"},{"type":"April 15","content":"DATE"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"April 14","content":"DATE"},{"type":"April 17","content":"DATE"},{"type":"April 16","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"$470 million","content":"MONEY"},{"type":"Matan Sibon","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Polyhedra Network","content":"ORGANIZATION"},{"type":"CSX","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"Lemniscap","content":"LOCATION"},{"type":"8 a.m.","content":"TIME"},{"type":"Proof Cloud","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"Nascent","content":"ORGANIZATION"},{"type":"Dubai","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"The Galxe Identity Protocol","content":"ORGANIZATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"Tate Berenbaum","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"Sam Kessler","content":"PERSON"},{"type":"Brevan Howard Digital and Electric Capital","content":"ORGANIZATION"},{"type":"$80 million","content":"MONEY"},{"type":"Zest Protocol","content":"ORGANIZATION"},{"type":"$4.5 million","content":"MONEY"},{"type":"Lightspeed Faction","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"UPA","content":"ORGANIZATION"},{"type":"Blockchain Node Engine","content":"ORGANIZATION"},{"type":"$30 million","content":"MONEY"},{"type":"Stader Labs","content":"ORGANIZATION"},{"type":"Haichen Shen","content":"PERSON"},{"type":"Ethereum\/EVM","content":"ORGANIZATION"},{"type":"BRC","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"Seier Capital Family Office","content":"ORGANIZATION"}],"hashtag":["The Protocol","Blockchain","Ethereum","Bitcoin","Tech","Blockchain Technology","EVM","Protocol Village"],"authors":["Bradley Keoun"]}