{"summary":"The Securities and Exchange Commission approved a final rule Tuesday that DeFi interests call \"hostile\" to that sector, potentially requiring projects to register as dealers.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/02\/06\/us-sec-clears-dealer-rule-expansion-that-could-rope-in-defi\/","publishDate":"2024-02-06T20:53:40","id":15043,"type":null,"title":"U.S. SEC Clears 'Dealer' Rule Expansion That Could Rope in DeFi","category":["Policy"],"content":["The U.S. Securities and Exchange Commission (SEC) widened its definition of a dealer today to pull many more financial operations into its jurisdiction – including, as it warned in a footnote of its original proposal – those dealing in crypto securities.","\"The commission is not excluding any particular type of securities, including crypto asset securities, from the application of the final rules,\" according to the SEC's description. \"The dealer framework is a functional analysis based on the securities trading activities undertaken by a person, not the type of security being traded.\"","The dealer rule is among several crypto-tied regulatory efforts that had been pending at the SEC and other agencies, including the Internal Revenue Service. While it drew less attention than IRS tax measures and the SEC proposals weighing expansion of the exchange definition and restricting crypto custody, the move could have serious consequences in the digital assets industry – particularly in decentralized finance (DeFi).","\"Absent an exemption or exception, if anyone trades in a manner consistent with de facto market making, it must register with us as a dealer – consistent with Congress’s intent,” SEC Chair Gary Gensler said in a statement.","The text of the rule noted the extensive objections and stated confusions of crypto industry insiders, including those in DeFi.","\"While some commenters stated that the proposed rules should not apply to so called DeFi, whether there is a dealer involved in any particular transaction or structure (whether or not referred to as so-called DeFi) is a facts and circumstances analysis,\" the agency noted. \"There is nothing about the technology used, including distributed ledger technology based protocols using smart contracts, that would preclude crypto asset securities activities from falling within the scope of dealer activity.\"","The commission did consider a crypto carve-out, according to the document, but decided that would have \"negative competitive effects\" by giving crypto firms an advantage over those who have to register.","While this effort – which goes into full effect in April of next year – was largely targeted at electronic participants in the U.S. Treasuries market, the requirements will be the same for any business roped into the expanded definition. A dealer must register with the SEC, comply with securities laws and join an industry-backed self-regulatory organization.","As the crypto industry has often argued, many DeFi operations could find it impossible to register or maintain compliance with SEC demands.","SEC Commissioners Mark Uyeda and Hester Peirce opposed the rule on Tuesday.","\"Under the Commission’s approach, any person can be a 'dealer' if they buy and sell securities as part of a regular business,\" Uyeda said, arguing that the change is \"creating additional regulatory confusion for other markets, including crypto asset securities.\"","\"Not surprisingly, the rule reflects little thought regarding its practical application in the crypto markets,\" noted Peirce, who has for years called for the agency to establish tailored regulations for crypto.","The DeFi Education Fund was among crypto groups that objected to the original proposal. The group called Tuesday's final version \"misguided and unworkable.\"","\"The SEC not only failed to confront the substance of our concerns but also failed altogether to articulate any discernible path to compliance for DeFi market participants,\" the organization said in a statement. \"Imposing obligations on entities in the DeFi ecosystem that cannot be complied with is wrong, impractical, and hostile to innovation.\"","The crypto industry has been fighting with the regulator in federal courts over which cryptocurrencies meet the definition of a security that the SEC would have authority over. The outcome of that legal battle could have major implications in the debate over which firms count as dealers under this latest regulatory demand.","Read More: The SEC's New Proposal to Redefine 'Dealer' Could Spell Bad News for DeFi"],"entity":[{"type":"Hester Peirce","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"SEC Commissioners Mark Uyeda","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Uyeda","content":"PERSON"},{"type":"IRS","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Peirce","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"April","content":"DATE"}],"hashtag":["Regulations","Securities and Exchange Commission","DeFi","DeFi Education Fund","Rulemaking"],"authors":["Jesse Hamilton"]}