{"summary":"The upgrade may in time attract a new group of investors, Brian Mosoff, said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/04\/10\/ether-capital-ceo-shanghai-upgrade-likely-to-be-a-non-event-on-eths-price\/","publishDate":"2023-04-10T16:23:50","id":15046,"type":null,"title":"Ether Capital CEO: Shanghai Upgrade Likely to Be 'Nonevent' on ETH's Price","category":["Technology"],"content":["Ethereum’s upcoming Shanghai hard fork likely won’t drastically affect the price of ether (ETH), said Brian Mosoff, CEO of technology company Ether Capital.","“My suspicion is that this is going to be a non-event in terms of price,” Mosoff told CoinDesk TV’s “First Mover” on Monday regarding the network’s “Shapella” upgrade (a portamento of “Shanghai” and “Capella”) scheduled to take place on April 12.","With the upgrade, users will be able to withdraw the ether they \"staked\" in order to participate in the Ethereum blockchain's consensus system. However, the lingering fear in the market is the impending unlocking of that ETH, deposited to boost network security in return for rewards, will lead to a rush to liquidate and lead to pressure on ETH's price.","Read more: Ethereum's Shanghai Upgrade Could Bring $2.4B Selling Pressure to Ether: Observers","But Mosoff said that “a few months down the line,” trading may look different for the second-largest cryptocurrency by market capitalization.","“I expect you will see more ETH get locked into staking, either from solo stakers or, again, you’ll see more structured products come to market,” Mosoff said.","The Shapella upgrade is considered to be the network’s final shift towards fully implementing its proof-of-stake consensus mechanism. Besides giving users the ability to make withdrawals from the ETH they have staked, the upgrade will lower fees and create more room on the blockchain to handle transactions.","According to Mosoff, the network’s upgrade could also attract a new group of investors.","By giving new investors the ability to earn some yield on the ETH they’ve staked, “you’re going to start to see traditional finance begin to move into the space with more confidence,” Mosoff said.","See also: Ethereum's Shanghai Is Nearing, but When Can I Withdraw My Staked ETH?"],"entity":[{"type":"$2.4","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Mosoff","content":"PERSON"},{"type":"Brian Mosoff","content":"PERSON"},{"type":"First Mover”","content":"ORGANIZATION"},{"type":"April 12","content":"DATE"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["ETH","Shanghai upgrade","Shapella","CoinDesk TV","Brian Mosoff","Ether Capital"],"authors":["Fran Velasquez"]}