{"summary":"MicroStrategy’s Michael Saylor allegedly cheated the system. This doesn’t mean his bitcoin will be liquidated.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/09\/01\/just-pay-your-taxes\/","publishDate":"2022-09-01T17:40:02","id":15040,"type":null,"title":"Just Pay Your Taxes","category":["Consensus Magazine"],"content":["On Wednesday the first lawsuit using a new whistleblower rule was unsealed, showing that Michael Saylor, the founder and executive chairman of software intelligence firm MicroStrategy (MSTR), is being sued by the District of Columbia attorney general for allegedly trying to evade paying more than $25 million in taxes. The lawsuit, covered on network television news, has stirred concerns that MicroStrategy and\/or Saylor may be forced to liquidate some of their bitcoin, putting downward pressure on the crypto’s price.","“As MicroStrategy is one of the biggest Bitcoin holders, crypto investors began to panic about whether Michael Saylor would have to liquidate some Bitcoin to pay for the consequential fines,\" Marcus Sotiriou, an analyst at digital asset broker GlobalBlock, wrote in a note.","The fears seem overdone, for now, for a few reasons. But the action should serve as a reminder to crypto boosters that – even though they may hold non-confiscatable assets – they ought to pay their taxes in full. Tax avoidance schemes are legal loopholes, but require significant planning and commitment. (CoinDesk published a comprehensive guide to crypto taxes earlier this year.)","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","Further, now that the U.S. government is both signaling increased interest in overseeing the crypto industry and is revamping the Internal Revenue Service – it’s reasonable to assume you’re being watched.","The lawsuit alleges that Saylor perpetrated a scheme for the past decade to avoid taxes to Washington, D.C., claiming he was a resident of Virginia and Florida, two lower-tax jurisdictions. The investigators came to the opposite conclusion, after being tipped off, by tracking Saylor’s private jet flight records, social media posts and from unattributed conversations with Saylor’s peers, in which he supposedly said people were “fools” for paying their income taxes.","The court document doesn’t provide a full amount Saylor, if found guilty, may have to cough up. But he’d owe all unpaid Washington, D.C., taxes for eight years, compounded annual 10% interest payments, a separate civil penalty of $11,000 for each violation and other fines for fraud. That could total upwards of a $100 million, according to the Office of the Attorney General.","The fear that this action could somehow lead to a liquidation crisis in bitcoin (BTC) are a bit unfounded, and tend to confuse the former MicroStrategy CEO (he stepped down last month) with his company. First, the government has to win its case, which might involve unfairly applying the recently passed False Claims Act, one expert cited by the Wall Street Journal said.","It also assumes Saylor couldn’t cover a multimillion-dollar liability, that he’d liquidate his BTC rather than any of the mansions or yachts he owns, and also dump it on the market rather than selling in tranches to avoid slippage. The government must also prove MicroStrategy is implicated in Saylor’s scheme.","Apparently, in 2014, the attorney general claims, MicroStrategy’s then-chief financial officer was “uneasy with this chicanery” and confronted Saylor about the potential corporate liability for his personal tax evasion. In a response, MicroStrategy called the lawsuit Saylor’s “personal tax matter” and said it had no responsibility for “his day-to-day affairs.”","See also: Crypto Startup Salaries: Here’s How Much Devs and Others Get Paid","Saylor also denied the claims, and reiterated he lives in Florida, not in a historic Georgetown mansion or on a yacht docked on the Potomac River, as claimed.","The fears, similar to rumors that forthcoming payouts for Mt. Gox depositors will crater bitcoin’s price, stem from MicroStrategy’s systemic importance in bitcoin. The company spent about $4 billion acquiring BTC, which turned its stock into a bona fide bitcoin exchange-trade fund (ETF). But the company is still well-capitalized and has been generating cash for years. The liquidation price for its bitcoin is around $3,000, company reps said.","Is any of this out of the question for a former CEO that was convicted of accounting fraud? That recommended people sell their homes to buy bitcoin? That leveraged up on his company’s bitcoin stockpile? I mean, let the courts, not social media, decide. In typical Saylor fashion, he apparently once called the District of Columbia “the most powerful city on Earth.” The man has a penchant for overstatement.","The worst case scenario is that bitcoin sees greater than average selling pressure, but that seems unlikely given Saylor's known commitment to the network. This fear, not exactly widespread, seems like the type of pessimism seen during bear markets – where investors are on edge and begin assuming some other crisis is sure to happen.","One thing is certain, for anyone else who isn’t bordering on megalomania is to… just pay your taxes. Or look into flag theory."],"entity":[{"type":"2014","content":"DATE"},{"type":"$3,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Virginia","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"District of Columbia","content":"ORGANIZATION"},{"type":"$11,000","content":"MONEY"},{"type":"Potomac River","content":"LOCATION"},{"type":"Marcus Sotiriou","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"$25 million","content":"MONEY"},{"type":"the District of Columbia","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Earth","content":"LOCATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"Washington","content":"LOCATION"},{"type":"MicroStrategy (MSTR","content":"ORGANIZATION"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Saylor","content":"PERSON"},{"type":"D.C.","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Saylor","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Michael Saylor","MicroStrategy","Tax","Tax Evasion"],"authors":["Daniel Kuhn"]}