{"summary":"Depositors will receive an airdrop that can be redeemed in May 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/12\/28\/blast-hits-11b-in-deposits-more-than-a-month-before-its-due-to-go-live\/","publishDate":"2023-12-28T10:18:27","id":15048,"type":null,"title":"Blast Hits $1.1B in Deposits More Than a Month Before It's Due to Go Live","category":["Finance"],"content":["Blast, the recently announced layer 2 blockchain set up by the developers of non-fungible token (NFT) platform Blur, has surpassed $1.1 billion in deposits, attracted by an airdrop promised for May even though the platform is not due to go live until February.","Speculators, unperturbed by the controversial one-way bridge to Blast, have deposited $1 billion worth of staked ether (stETH) and $103 million worth of the dai (DAI) stablecoin since the website went live last month, according to DefiLlama.","In return, depositors receive a yield of around 5% on their staked assets as well as \"Blast Points,\" which can be redeemed for an airdrop that will be distributed in May.","Users can also accrue points by referring others to the platform. Blur ran a similar airdrop after setting up an NFT marketplace in February. The BLUR token now has a market cap of $500 million, having risen by 23% over the past month.","The idea of allowing deposits to a platform that is not yet live has attracted criticism from sections of the crypto industry, with some suggesting that the project has the hallmarks of a pyramid scheme where early depositors and affiliate marketers will receive a lion's share of the eventual airdrop.","Some of that criticism even came from Blast's backers, venture capitalist firm Paradigm. Paradigm Head of Research and General Partner Dan Robinson said Blast's marketing campaign \"crossed lines\" and that Paradigm doesn't agree with rolling out deposits before the blockchain or withdrawals are live. Robinson did, however, say that he is excited about several components of Blur.","It's worth noting that crypto asset prices have surged across this board this year. Bitcoin (BTC) has risen more than 150% to around $43,000 while ether (ETH) has doubled to $2,400. The increase has spurred a wave of optimism across investors, which is highlighted by the rapid rise of projects like Blast.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"\"Blast Points","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"Paradigm","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"23%","content":"PERCENT"},{"type":"$43,000","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Robinson","content":"PERSON"},{"type":"$2,400","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"150%","content":"PERCENT"},{"type":"$103 million","content":"MONEY"},{"type":"last month","content":"DATE"},{"type":"DefiLlama","content":"ORGANIZATION"},{"type":"Paradigm Head of Research","content":"ORGANIZATION"},{"type":"Dan Robinson","content":"PERSON"},{"type":"$1.1 billion","content":"MONEY"}],"hashtag":["layer 2","DeFi","Deposit Contract","TVL"],"authors":["Oliver Knight"]}