{"summary":"A new Law Commission report doesn’t address legal concerns beyond token ownership, lawyers told CoinDesk.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/07\/20\/proposed-legal-reforms-aid-uk-crypto-dreams-but-offer-scant-hope-for-bitcoin-developers-sued-by-craig-wright\/","publishDate":"2023-07-20T09:01:57","id":15050,"type":null,"title":"Proposed Legal Reforms Aid UK Crypto Dreams – but Offer Scant Hope for Bitcoin Developers Sued by Craig Wright","category":["Policy"],"content":["A recent paper on crypto ownership rights from the Law Commission of England and Wales has gained plaudits from politicians and the legal sector – but alone won’t resolve other legal uncertainties like developer liability, as some in the industry are hoping.","Proponents of decentralization believe the underlying code in digital asset transactions enforces applicable laws and regulations. In practice, as the beleaguered victims of crypto hacks, frauds and bankruptcy have found, sometimes the courts are the only way to get your assets back – and the Law Commission’s proposals for new legislation could be offering them an extra way to do so, lawyers told CoinDesk.","Some parties to crypto litigation are also finding comfort in the Commission’s report, convinced it could tip the scales in favor of a group of Bitcoin developers targeted by Craig Wright, the infamous crypto scientist who says he is the real author of the Bitcoin white paper attributed to pseudonymous Satoshi Nakamoto.","But lawyers say the proposal doesn’t address other legal concerns beyond token ownership, and that there is plenty of work left to do to ensure legal certainty and make the U.K. a crypto hub.","Politicians certainly see the Commission’s proposals as welcome – including in a key cross-party parliamentary group known as the APPG on Crypto and Digital Assets, which considered legal classification issues in a recent inquiry.","“The APPG welcomes the work of the Law Commission in this important area,” Lisa Cameron, the group’s chair, told CoinDesk in a statement, urging the government to “move quickly on the legal classification of these assets where this may provide further clarity for the sector, regulators and the legal system.”","Legal reforms “could help achieve the Government’s goal for the U.K. to become a global hub for cryptocurrency and digital assets,” added Cameron, a Westminster lawmaker for the opposition Scottish National Party, citing the ambitions first voiced by Prime Minister Rishi Sunak last April when he was finance minister.","But, even before the government and lawmakers get their teeth into that, just having a clear position from the Law Commission helps offer greater certainty to those in the sector, Etay Katz, partner and head of digital assets at Ashurst law firm, told CoinDesk in an interview.","“We've got a pretty categorical statement of what the law is and should be like,” Katz said. “It’s as good as a statute.”","There’s precedent for believing the Commission’s dream will become reality. Its draft bill on using blockchain for trade documents has now passed through Parliament and could have a global impact.","Likewise, the Commission’s new report “paves the way for more developments, and for English law and the English courts being seminal in matters of digital assets moving forward,” Katz said – but warned there are still plenty of issues that need to be addressed.","Read more: UK Trade Groups See Opportunity in Document Bill Under Debate in Parliament","At the heart of the Commission’s paper is the recommendation that – with some minor exceptions – the treatment of crypto should be left to the common law, rather than hoping lawmakers can predict every possibility in all-encompassing legislation.","Common law, determined and developed by courts, in theory allows a less rigid approach as judges can respond case by case. The Commission cites cases where judges allowed legal documents to be served via non-fungible tokens (NFT), for example, adapting legal procedures to a new reality.","Yet the legal status of digital assets still isn’t completely resolved. The Commission has at best set the legal position on a particular track, but the final destination isn’t set yet and the process will inevitably take time, Lizzie Williams, a managing associate at law firm Harbottle & Lewis, told CoinDesk.","But the Bitcoin Legal Defense Fund, a nonprofit set up by former Twitter chief Jack Dorsey to assist developers facing lawsuits, insisted in a July 4 blog that the Commission’s report had far-reaching implications in Wright’s U.K. case against a dozen Bitcoin Core developers and “undermines the central claims” of the suit.","Tulip Trading’s Craig Wright sued the developers, arguing they must rewrite code to give him access to 111,000 bitcoin (BTC) whose private keys were allegedly stolen.","The U.K. Court of Appeal agrees there’s a serious issue to be tried, but hasn’t yet given any substantive judgment on the case. The Law Commission’s report refers to the case, and even suggests a rule of thumb for when developers are liable – implying there’s no case to answer if they don’t retain control over tokens – but the implications may not be as wide as defendants say.","“The conclusions of our report do not directly affect the question of developers’ claimed fiduciary duties,” though a related project underway on decentralized autonomous organizations (DAOs) may bear on the subject, a Law Commission spokesperson told CoinDesk in an emailed statement.","While the report may constitute helpful guidance, the Law Commission is more concerned about ownership of assets than their underlying networks, Louise Abbott, partner at Keystone Law said.","Read more: Craig Wright's UK Case Against 16 Bitcoin Developers to Go to Full Trial","Some of the details still need to be nailed down in legislation. The Commission wants lawmakers in Parliament to pass a new law to clarify that people can own digital assets, even if they don’t fit into the same legal category as other things you can own like cars or debts.","It also suggested reviewing the laws about the tokenization of equity and securities to see if they need to be extended to cover permissionless ledgers – a topic lobbyists such as UK Finance have also shown interest in.","One is how you treat crypto that’s posted as surety for a loan – where Katz favors simply adding digital assets alongside cash and securities to an existing legislative list of permitted collateral. Another is having more consistency on the obligations of crypto custodians. Jurisdictions like the European Union have legislated on that issue – and Katz worries the U.K. is getting left behind by leaving it to individual contracts.","“So far, the U.K. is talking big words but doing very little in terms of pushing itself and positioning itself as a leader on policy,” he said. While the EU’s MiCA law is already finalized and set to take effect in 2024, a U.K. Treasury consultation on proposals for regulating the crypto sector has not yet been followed up with detailed provisions.","Read more: Crypto Industry Asks UK to Think Globally as Government Closes Consultation on Proposed Rules","“As a result, the bulk of the activity that is happening now in traditional finance using DLT is happening in Europe, and in Singapore and Hong Kong… I say that with an element of pain,” Katz said.","Though the Law Commission findings are welcome, he believes they’re not enough. “We need to move, in short order, to companies legislation, to regulation, to tax, and to any other area which is fundamentally important to the ecosystem,” Katz said.","Cameron also said in May that there is more actual “scope in terms of getting comprehensive policies around innovative technology, blockchain and Web3.”","Read more: How Crypto Might Shake Up England’s Ancient Property Laws","Edited by Sandali Handagama."],"entity":[{"type":"Crypto Industry Asks UK to Think Globally as Government","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"England","content":"LOCATION"},{"type":"U.K.","content":"LOCATION"},{"type":"Lizzie Williams","content":"PERSON"},{"type":"Harbottle & Lewis","content":"ORGANIZATION"},{"type":"Bitcoin Legal Defense Fund","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Cameron","content":"PERSON"},{"type":"UK Case Against 16 Bitcoin Developers","content":"ORGANIZATION"},{"type":"Law Commission","content":"ORGANIZATION"},{"type":"Parliament","content":"LOCATION"},{"type":"Louise Abbott","content":"PERSON"},{"type":"UK Finance","content":"ORGANIZATION"},{"type":"Keystone Law","content":"ORGANIZATION"},{"type":"July 4","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"European Union","content":"LOCATION"},{"type":"Commission","content":"ORGANIZATION"},{"type":"Law Commission of England","content":"ORGANIZATION"},{"type":"Craig Wright","content":"PERSON"},{"type":"U.K. Court of Appeal","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Wales","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"DLT","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Crypto and Digital Assets","content":"ORGANIZATION"},{"type":"Etay Katz","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Katz","content":"PERSON"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Wright","content":"LOCATION"},{"type":"Parliament","content":"ORGANIZATION"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"Ashurst","content":"ORGANIZATION"},{"type":"Lisa Cameron","content":"PERSON"},{"type":"Scottish National Party","content":"ORGANIZATION"},{"type":"Sandali Handagama","content":"ORGANIZATION"}],"hashtag":["Analysis","UK","Law","Crypto"],"authors":["Jack Schickler","Camomile Shumba"]}