{"summary":"The crypto exchange faced charges of offering U.S. investors access to unregistered securities.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/08\/10\/bittrex-reaches-settlement-with-sec-agrees-to-pay-24m-fine\/","publishDate":"2023-08-10T20:53:16","id":15058,"type":null,"title":"Bittrex Reaches Settlement With SEC; Agrees to Pay $24M Fine","category":["Policy"],"content":["Crypto exchange Bittrex settled charges of offering U.S. investors access to unregistered securities on Thursday, agreeing to pay a $24 million fine within two months of filing a liquidation plan for the exchange.","The SEC sued Bittrex, which filed for bankruptcy in May, earlier this year, saying it simultaneously operated a securities exchange, broker and clearinghouse without registering as any of these things with the regulator.","The SEC has brought similar charges against fellow crypto exchanges Coinbase and Binance.US. The SEC further alleged that Bittrex directed crypto issuers to delete public statements that could suggest their tokens might violate securities law.","According to Thursday's court filing, Bittrex will neither admit nor deny the allegations, and cannot make any public statement that might suggest the SEC didn't have a factual basis for its allegations. Of the total $24 million fine, $14.4 million consists of disgorgement, $4 million in prejudgment interest on that disgorgement and $5.6 million in civil money penalties.","Bittrex's bankrupt U.S. arm has until 90 days after its liquidation plan is effective to pay the SEC, though the regulator may seek court judgement if it hasn't paid its fees and penalties by March 1 of next year.","\"Defendants agree that, as to Bittrex, the terms of the settlement reflected in this Consent and in the Judgment are subject to approval by the Bankruptcy Court in the Bankruptcy Case and shall be treated as an allowed, unsecured claim under the terms of any Plan filed by Bittrex in the Bankruptcy Case,\" the filing said.","\"Today’s settlement makes clear that you cannot escape liability by simply changing labels or altering descriptions because what matters is the economic realities of those offerings,\" SEC Enforcement Director Gurbir Grewal said in a statement. \"I am grateful to the SEC staff for aggressively pursuing non-compliance in the crypto industry, resolving this matter, and bringing additional relief to harmed investors.\"","Edited by Nelson Wang.","UPDATE (Aug. 10 21:20 UTC): Added breakdown of the fine.","UPDATE (Aug. 11 12:16 UTC): Clarifies only Bittrex's U.S. unit and not Bittrex Global is undergoing bankruptcy proceedings."],"entity":[{"type":"$14.4 million","content":"MONEY"},{"type":"Aug. 11","content":"DATE"},{"type":"Bankruptcy Court","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"May","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Bittrex Global","content":"ORGANIZATION"},{"type":"Nelson Wang","content":"ORGANIZATION"},{"type":"Aug. 10","content":"DATE"},{"type":"March 1","content":"DATE"},{"type":"$5.6 million","content":"MONEY"},{"type":"Bittrex","content":"ORGANIZATION"},{"type":"Bittrex","content":"LOCATION"},{"type":"Gurbir Grewal","content":"PERSON"},{"type":"$24 million","content":"MONEY"}],"hashtag":["Bittrex","Crypto Exchange","SEC","Settlement"],"authors":["Nikhilesh De"]}