{"summary":"Legacy and estate planning is crucial for cryptocurrency holders because, unlike traditional assets, cryptocurrencies are not regulated by centralized authorities, making it difficult for heirs to access them after the owner's death. Proper planning can ensure that digital assets are successfully transferred to loved ones and beneficiaries.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/05\/04\/estate-and-legacy-planning-for-crypto-assets\/","publishDate":"2023-05-04T12:45:00","id":15053,"type":null,"title":"Estate and Legacy Planning for Crypto Assets","category":["Finance"],"content":["Despite the uncertain regulatory environment in the U.S., investment and adoption of crypto assets is not slowing down.","The U.K., European Union, UAE and Southeast Asia have all enacted legislation concerning crypto assets and decentralized finance participation. U.S. investors, both individuals and businesses, remain interested in and continue to invest in and use blockchain-based systems.","This continued movement toward crypto opens up opportunities for financial advisors to guide clients, even if those advisors cannot or choose not to recommend or manage crypto assets.","You're reading Crypto for Advisors, a weekly look at digital assets and the future of finance for financial advisors. Subscribe here to receive the mailing every Thursday.","More clients than you think own crypto assets in some form. Some may use a custodian, such as Coinbase or Kraken, and have accounts with four to five figures of bitcoin. Some may have been spooked by the failures of several custodians and decided to move their assets onto hard wallets or into cold storage, adhering to the “not your keys, not your crypto” mantra.","As we continue to witness the creation of new accounts and new wallets every day, it’s apparent that more investors are moving some fiat into crypto. These investors now require some guidance in establishing an estate and legacy plan for their crypto assets, even if they believe they have the custody portion all figured out.","Younger investors are often the ones diving deeper into crypto without informing their spouse or family members or educating them on the nature of crypto custody. They may not consider themselves wealthy enough to warrant typical estate planning since crypto assets can be so volatile. However, proper planning is crucial to ensure their assets are passed on to their heirs according to their wishes.","Legacy planning in digital assets is different from the planning we see with traditional assets. In crypto, the technical plan is often more important than the legal plan, especially for typical investment amounts. For instance, I can create the legal conditions to ensure my daughter receives my bitcoin after I pass, but if I haven’t provided her the technical ability to control the bitcoin, the legal planning won’t matter.","Legacy planning for digital assets poses additional unique challenges, including regulatory uncertainty, cost basis considerations and rapid innovation.","Many crypto investors have yet to consider these unique aspects of legacy planning, whether their assets are held in centralized exchanges or self-custodied wallets. As we move from simply buying crypto assets to participating in on-chain protocols and holding tokenized securities, the need for proper legacy planning will only increase, creating opportunities for financial advisors to add value.","Crypto legacy planning is also important due to the potential for crypto assets to significantly increase in value in a very short amount of time. A small investment, even as speculation, can become a material value overnight.","To provide value to clients in legacy planning, financial advisors can begin by asking the following typical questions: “Do you own crypto assets?” “How are you holding those assets?” “Have you thought about what happens to your crypto when you’re not here?”","The next step would be to create an up-to-date inventory of client assets.","Centralized custodians provide application programming interfaces (API) that can feed into some reporting tools. There are also new reporting and management tools like Kubera that already have the ability to provide traditional and crypto assets in one package.","If the client hasn’t prepared to pass their crypto on, that is usually the next step. Most custodial accounts do not provide the transfer-on-death abilities, so the advisor will need to help the client make those arrangements.","If the client is holding assets in hard or soft wallets, multi-sig wallets or vaults, the advisor now has even more value to provide. Access is often more critical than legal ownership in this case, so advisors should help clients make arrangements for transferring seed phrases or private key material to their heirs. We’ve all heard the horror stories of people dying without leaving the keys to heirs.","Read more: What Happens to Your Crypto When You Die?","Education is a crucial part of the crypto legacy plan, which differs from traditional asset planning. In my case, I need to make sure my daughter understands how to use the keys I leave her and some investment philosophy behind my decisions. I don’t want her having to go to the internet and ask how to use the 24 words Daddy left behind, as that is a sure way to get scammed. I also want her to know I have a five- to 10-year time horizon and understand my plan for hodling vs. selling.","Advisors can add so much value by helping clients prepare the inventory, the technology-focused legacy plan, and the education plan for those heirs.","The Ultra High Net Worth (UHNW) in crypto also face unique challenges when addressing their estate planning needs. They have tax issues, which are further complicated by basis considerations and jurisdiction questions. They may have received their tokens en masse before a project launches or participated in a mining or staking program.","In addition to the typical planning needs, these clients have security issues – both personal security and wallet\/funds security.","They will probably have to employ the services of a crypto-literate advisor, attorney and likely a multifamily office to provide some structure to their newfound wealth. This would involve employing some of the same structures used by the wealthy for decades but adding the custodial element. The aim will be to protect assets, engage in proactive tax planning, and preserve wealth while still allowing them and their families to enjoy it.","To maintain the tax efficiency and asset protection, they may need to do something they never thought they would utilize a centralized custodian. Except it can be in a jurisdiction like Switzerland or Liechtenstein, where they offer true custody of assets, with a structure that still allows for security of the funds and the ability to manage the assets.","Financial advisors will have a crucial role in guiding clients through estate and legacy planning for crypto assets, regardless whether their client is the typical investor or the ultra high net worth individual.","As cryptocurrencies and digital assets continue to gain prominence, it’s imperative that clients' estate plans account for these unique assets in a tax-efficient and legally compliant manner.","Financial advisors will help navigate the complex landscape of digital assets, develop tech-native strategies for wealth transfer and protection, and collaborate with legal and tax professionals to ensure the successful implementation of estate plans that accommodate both traditional and digital assets.","Edited by Henry Bond."],"entity":[{"type":"Southeast Asia","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Henry Bond","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"},{"type":"European Union","content":"ORGANIZATION"},{"type":"Liechtenstein","content":"LOCATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["Opinion","Newsletters","Crypto for Advisors","Legal","crypto investing","Crypto Investment","Custody","Custody Services","Whales"],"authors":["Adam Blumberg"]}