{"summary":"HKUST is imagining a future of students attending lectures in VR headsets and attending classes in campuses hundreds of miles apart as it reveals plans for MetaHKUST.\nThe university will scan its two campuses and use the images to build metaverse replicas. \nWhile China has banned cryptocurrencies, it is supporting metaverse and blockchain projects and companies.","author":["Callan Quinn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/160357\/top-hk-university-to-launch-virtual-campus-in-the-metaverse","publishDate":"2022-07-30T09:01:23","id":1506,"type":null,"title":"Top HK university to launch virtual campus in the metaverse","category":["Gaming and Metaverse"],"content":["Students at the Hong Kong University of Science and Technology will soon be able to take classes and interact with classmates in the metaverse after the university announced it is building digital copies of its two campuses.","The campuses will be part of MetaHKUST, a project spearheaded by two of the university's professors, MetaHKUST project lead Wang Yang and the director of the Center for Metaverse and Computational Creativity Pan Hui.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","Laying out the roadmap at a <a href=\"https:\/\/hkust.edu.hk\/news\/research-and-innovation\/hkust-launch-worlds-first-twin-campuses-metaverse\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">news conference<\/a> on Thursday, the university explained that the project aims to ultimately consolidate all physical and virtual experiences at the university under one roof — think students wearing VR headsets in lectures showing them data and information superimposed on real objects, or being able to join classroom lectures in different campuses.<span class=\"Apple-converted-space\" data-v-f87c67ca=\"\">&nbsp;<\/span>","To start with, the first stage will see the installation of physical infrastructure including XR classrooms, sensors, cameras and visualization tools. The university will then scan the physical campuses — HKUST has one in Hong Kong and another in the southern Chinese city Guangzhou about 100 miles away — to collect the images and build metaverse replicas.","Students and faculty will later be able to generate their own avatars, NFTs, tokens and art works for use in the metaverse. They will also be able to receive their diplomas and transcripts as NFTs.","The university will also be leaning into AR technology, which Hui described as being currently mostly single-user and as presenting significant constraints in terms of time and location.","“What we are striving to achieve here is the scaling up of technology to handle large-sized environments and massive multi-user experiences, which not only represents a primary challenge of our physical-digital vision, but also a key factor that differentiates MetaHKUST from other campuses’ metaverse initiatives,” he said.","Still, there is a second aspect to the project, that of bringing the two campuses closer together. Traveling between China and Hong Kong is still heavily restricted due to Covid. Through MetaHKUST's initiatives, students will be able to join lectures and events happening at both campuses. The Chinese government is pushing for institutions such as universities to establish greater ties between Hong Kong and the mainland, particularly following the widespread protests in Hong Kong over Chinese rule.","With much of MetaHKUST’s work playing out on the new Guangzhou campus, it’s also part of growing interest in China around blockchain and metaverse technology. Despite a ban on cryptocurrencies, the metaverse has garnered interest and support at both the provincial and national level.","Even China’s beleaguered tech giants —which have been under fire from regulators for the last couple years — are cautiously getting involved in metaverse projects. Pony Ma, the CEO of Tencent, China’s social media and gaming giant, said in a November earnings call that he considered the metaverse to be an opportunity. TikTok owners ByteDance, Alibaba, NetEase and Baidu have also signaled interest in the metaverse. The latter already launched an early version of its own metaverse app, XiRang, in December."],"hashtag":[]}