{"summary":"The Solana-based game is booming despite its cost to participate.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/04\/12\/stepn-runners-undeterred-by-move-to-earn-games-pricey-nft\/","publishDate":"2022-04-12T20:24:13","id":15062,"type":null,"title":"Stepn Runners Undeterred by ‘Move-to-Earn’ Game’s Pricey NFT","category":["Finance"],"content":["While the play-to-earn (P2E) industry has been under scrutiny after the $620 million Ronin hack, another type GameFi is gaining momentum.","Solana-based move-to-earn project Stepn by Find Satoshi Lab earned $26 million in the first quarter. Move-to-earn, similar to play-to-earn, is a model where users are rewarded in cryptocurrency for their step count.","“As of mid-March, we had 100,000 daily active users, and that number has doubled since,” Chief Business Officer Shiti Manghani, who touted the site’s 1 million downloads, told CoinDesk in an interview.","While other P2E games incentivize online gaming, Stepn is emerging as an early example of GameFi that empowers users to pursue fitness and wellness. Users who buy the game’s non-fungible token (NFT) can earn rewards for every step they take.","That’s creating spillover effects as Stepn grows in strength. One such example is the upcoming Stepn 5K planned for the AthensDAO conference of Solana-based decentralized autonomous organizations (DAO) in late May. Dean Pappas, leader at the social networking project Grape who is helping organize the conference, said many Grape members already use Stepn.","“We’re excited to show people the in-real-life crypto applications, and Stepn is one of the best examples. Stepn succeeds in making the entire experience simple and seamless: Exercise for 10 minutes a day and earn,” he said in a Telegram message.","The app rewards users for their steps in its native cryptocurrency. GST increased in price by 50% in the last 30 days, according to CoinGecko. It was trading at $4.80 at press time.","But getting the rewards requires NFT ownership, much as with P2E giant Axie Infinity. Stepn users can trade their SOL for NFT sneakers in the game’s mobile app – and then they start running.","Those shoes are flying. According to Manghani, STEPN sees over $12 million in daily NFT trading volume on Solana. The former CEO of home-fitness enterprise Breathe Happy said the project is attractive for users because “you don’t have to buy a £1,000 [$1,300] bike or Peloton.”","At time of writing, the cheapest NFT sneakers are 11.5 SOL (around $1,100). Players must own the pricey NFT to begin running for money.","Stepn is planning a rental feature, where shoeless users can effectively lease other players’ sneakers for free and share the earnings from running.","Pappas, the Grape lead, said the feature is badly needed.","“Stepn sneakers are getting really expensive,” he said.","Leasing digital assets in P2E games has been criticized for creating “digital serfdom” in which players who cannot afford the NFTs necessary to play these games rent from third-party lenders, who subject players to long hours of gameplay with little compensation.","But there are, in fact, games with no price on participation.","Move-to-earn game Genopets, where players are similarly rewarded in crypto for their real-life steps, combines free-to-play and play-to-earn because it costs nothing to mint the NFTs necessary to play and earn tokens.","Still in beta mode, Genopets has rather modest statistics. It’s especially popular on Fridays when fresh challenges drive 30,000 players on the platform, co-founder Jay Chang told CoinDesk over Telegram.","These numbers pale against Stepn, suggesting that people are more than willing to pay for move-to-earn experiences."],"entity":[{"type":"Jay Chang","content":"PERSON"},{"type":"$4.80","content":"MONEY"},{"type":"$26 million","content":"MONEY"},{"type":"$12 million","content":"MONEY"},{"type":"Pappas","content":"PERSON"},{"type":"May","content":"DATE"},{"type":"Manghani","content":"LOCATION"},{"type":"Peloton","content":"LOCATION"},{"type":"Satoshi","content":"PERSON"},{"type":"$1,100","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"Stepn","content":"PERSON"},{"type":"$1,300","content":"MONEY"},{"type":"first quarter","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Telegram","content":"LOCATION"},{"type":"Shiti Manghani","content":"PERSON"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"last 30 days","content":"DATE"},{"type":"Fridays","content":"DATE"},{"type":"$620 million","content":"MONEY"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"}],"hashtag":["move-to-earn","Play-to-Earn","Games","Axie Infinity","StepN","P2E","GameFi"],"authors":["Cam Thompson"]}