{"summary":"Two aspects of the crypto world, blockchain tech companies and exchanges and crypto miners, reveal that M&A activity is strong and that crypto-related companies have converged with the rest of tech, a sign that the digital-asset industry is maturing.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/04\/19\/valuations-and-ma-show-things-arent-so-bad-for-crypto\/","publishDate":"2023-04-19T17:21:48","id":15066,"type":null,"title":"Valuations and M&A Show Things Aren’t So Bad for Crypto","category":["Finance"],"content":["Recent troubles in crypto (the collapse of FTX in November, runs on crypto-friendly banks in March, etc.) have brought into question the viability of the entire asset class. However, a closer look at the long-term performance of blockchain companies and crypto miners mitigates those doubts. Financial investors have remained active and M&A activity is still strong.","You’re reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","This article will focus on two engines of the crypto world:","Both sectors have performed dismally over the past 12 months relative to the Nasdaq Composite Index – which has also done terribly. The chart below shows the plunge in all their market caps (with a starting value of 100 for each in April 2022).","However, this observation must be put into perspective.","First, despite the pain, investors are now assigning a similar revenue multiple to those two crypto-related sectors and the Nasdaq. (We track that using enterprise value, or EV, divided by revenue.) The mining group especially has seen a massive rebound in that metric since the beginning of the year, coinciding with bitcoin’s (BTC) large rally.","Second, if we look at a wider time horizon (as illustrated below), the mining group still outperforms the Nasdaq between April 2020 and April 2023., winning 90% to 63%. The blockchain group is down 12%. Crypto miners benefitted from a huge bubble in the first half of 2021 (traded between 30x and 70 EV\/revenue). From early 2022 to mid-2022, those extreme valuations normalized and converged around 3.5x EV\/revenue. The Blockchain group, meanwhile, pretty closely tracks the Nasdaq, though with less volatility.","There are still a number of very active financial investors in the crypto space. In 2022, there were 2,541 venture capital (VC) investments totalling $26.2 billion in crypto or blockchain companies. Some highlights: Celestia raised $53 million in a Series B round, Matter Labs raised $200 million in a Series B and Fenix Games completed early-stage rounds and raised $150 million.","As of the fourth quarter of 2022, the top 10 VC-backed companies have raised approximately $8.45 billion during their lifespan. Coinbase topped the ranking of the most active financial investors in crypto in the first quarter 2023 with 340 investments (including Amber, CoinDCX and CoinTracker), while NGC Ventures was in second position with 258 investments (Parami Control, Resource Finance, etc.). The top 10 financial investors are based in the U.S. (six of them), China (three), and Singapore (one).","Despite the shockwaves from the FTX bankruptcy filing in November, the ecosystem is still quite dynamic. Notable M&A deals closed in the fourth quarter include Gleec BTC Exchange acquiring Blocktane for $1.5 billion, Binance buying TokyoCrypto for $225 million and Bankless purchasing Earnifi for $150 million.","The valuation of crypto-related companies has converged with the rest of tech, a sign that the digital-asset industry is maturing. The recent crisis has pruned out non-viable players and investors are adopting a less speculative stance on this asset class. As crypto mining exemplifies, there may be room for certain subsectors of crypto to deliver superior performance compared with peers. Of particular interest are the blockchain security platforms – such as Fireblocks, Taurus or Copper – that offer solutions to protect digital assets like crypto. Valuations will be supported by specialized private investors and M&A activity driven by consolidation plays at the international level, either by geographic or technology consolidation.","Edited by Nick Baker."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"NGC","content":"ORGANIZATION"},{"type":"April 2023","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"April 2020","content":"DATE"},{"type":"April 2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Gleec BTC Exchange","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"$8.45 billion","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"$53 million","content":"MONEY"},{"type":"Nick Baker","content":"PERSON"},{"type":"fourth quarter of 2022","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Nasdaq Composite Index","content":"ORGANIZATION"},{"type":"Fireblocks","content":"LOCATION"},{"type":"$200 million","content":"MONEY"},{"type":"Parami Control","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$26.2 billion","content":"MONEY"},{"type":"the first quarter 2023","content":"DATE"},{"type":"$1.5 billion","content":"MONEY"},{"type":"63%","content":"PERCENT"},{"type":"the first half of 2021","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"$225 million","content":"MONEY"},{"type":"Resource Finance","content":"ORGANIZATION"},{"type":"$150 million","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"the fourth quarter","content":"DATE"}],"hashtag":["Opinion","Crypto Long & Short","Newsletters","mergers and acquisitions","Mergers","Acquisitions","Miners","Bitcoin Mining","Nasdaq","VCs","crypto investing"],"authors":["Christophe Morvan","Julian Ostertag","Sam Levy"]}