{"summary":"Filament, a blockchain-based tech provider for the Internet of Things, has raised $5m from Samsung Ventures and Verizon Ventures, among others.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2015\/08\/18\/filament-nets-5-million-for-blockchain-based-internet-of-things-hardware\/","publishDate":"2015-08-18T11:30:46","id":15060,"type":null,"title":"Filament Nets $5 Million for Blockchain-Based Internet of Things Hardware","category":["Markets"],"content":["Filament has raised $5m in Series A funding led by Bullpen Capital and including contributions from Verizon Ventures and Samsung Ventures.","The decision by Samsung Ventures, the capital arm of consumer electronics giant Samsung, marks its first public investment in a blockchain industry firm and notably follows its participation in IBM's blockchain proof of concept ADEPT.","Announced in January, ADEPT used the bitcoin and Ethereum networks to enable devices to communicate as part of a wider transition toward connected consumer devices known as the Internet of Things (IoT).","Co-founder and CEO Eric Jennings framed Filament as a decentralized IoT software stack that uses the bitcoin blockchain to enable devices to hold unique identities on a public ledger. By creating a smart device directory, he said, Filament's IoT devices will be able to securely communicate, execute smart contracts and send microtransactions.","Given this vision, Jennings sees his project as similar in ethos to ADEPT, even though it will target the industrial market, enabling large firms in industries such as oil, gas, manufacturing and agriculture to unlock new efficiencies.","Jennings told CoinDesk:","Filament will seek to market two hardware units: the Filament Tap, a sensor device that allows devices to communicate with phones, tablets and computers at distances of 10 miles, and the Filament Patch which extends the capabilities of the technology to custom hardware projects.","By leveraging its blockchain-based technology stack, Filament said enterprise companies can better manage physical mining operations or water flows over agricultural fields without relying on centralized cloud alternatives or pen-and-paper methods that result in human inefficiencies.","Founded in 2012, Filament was originally conceived as Scout, a wireless home security system built on mesh networking, before rebranding as Pinocc.io. After being accepted into the Techstars incubator last October, the company reemerged as Filament with a new focus on industrial use cases for connected devices.","Crosslink Capital",", Digital Currency Group, Haystack, Working Lab Capital and Techstars were also part of the Series A fundraising. With the funds, Jennings said Filament aims to scale its team from 15 to 30 employees, as it moves toward rolling out its hardware devices in Q4 2015.","Behind this technology, Filament boasts the inventor of the communications protocol Jabber\/XMPP Jeremie Miller as its CTO. Launched in 1999, Jabber was an open standard alternative to chat applications such as AOL Instant Messenger.","Support for the protocol was eventually adopted to varying degrees by Facebook, Google and Microsoft, a success Filament aims to replicate with its platform.","\"The lesson is that decentralized systems are more valuable to the company and the people that use them,\" Jennings explained. \"That’s the ethos we’ve learned, that decentralized systems with more equal footing between the users tend to be more valuable.\"","Filament's thesis is based on seeking to unlock how a similar platform can be used to enable decentralized communications between connected devices, a vision Jennings argues is based in business logic rather than any ideological support.","\"Decentralized isn't a tinfoil hat position,\" Jennings argued. \"Decentralized systems are more valuable to people that interact with them... It's a good reminder. 'Why it does it matter using the blockchain?' because it can make systems more powerful and more valuable.\"","Filament's technology stack will use five layers – blockname, telehash, smart contracts, pennybank and BitTorrent. Filament's sensors rely on the first three in order to operate, while the final two protocols are optional for clients.","The Filament Tap is the smallest unit offered by the company, which it aims to sell in units of 10 to those interested in testing the product's capabilities.","Among the products benefits, according to Jennings is ease of use. \"Taps have sensors so they can be attached to devices in an office space and be up and running in 20 minutes. They can start monitoring infrastructure immediately,\" he said.","Each device will be equipped with the ability to handle communications on all five of the company's protocols. Using blockname, devices are able to create a unique identifiers which are stored in a part of the device's embedded chip and recorded on the blockchain. Telehash, in turn, provides end-to-end encrypted communications and BitTorrent enables file sharing.","\"In the blockchain, when the devices are manufactured, we store the unique hash of a network address. When we manufacture our devices, we create a unique global IP address and in blockname, we store where those hashes can be resolved,\" Jennings said. \"If device A wants to talk to device B, blockname will tell them how.\"","Payment for the devices' use is handled by smart contracts, which allows the terms of payment and access to the device to be controlled programmatically.","Jennings sought to stress that Filament's products and technology are blockchain agnostic, but they currently use the bitcoin blockchain. Jennings said data for contracts is stored using the 40 bytes of extra data added to bitcoin transactions.","Jennings described Filament's PATCH product as the \"brain of the Tap\", which would be integrated into other hardware devices and stacks but use the company's technology.","Of the five planned parts of the company's stack, Jennings acknowledges that IoT micropayments, or the ability of devices to transact, remains in the earliest stages.","Filament will use a bitcoin-based protocol that it has developed called Pennybank for microtransactions on its platform, in part because of its unique needs. \"Our devices are not high power and they aren’t always online, so in order to allow these devices to transact, they can’t be a lightweight wallet,\" Jennings said.","Effectively, Jennings said Pennybank creates an escrow service between two devices, allowing them to settle transactions when they are connected online.","Jennings suggested early talks with clients lead him to believe enterprise firms want to pay on an ongoing, real-time basis. Here again, he suggested the only way to satisfy this market demand was by using blockchain technology.","The ability for Filament devices to transact, he said, is also crucial to ensuring the network remains viable even if the company closes. Further, he suggested it would open up new opportunities for clients, who could sell their device data to others in a similar way.","\"That’s the beauty of bitcoin and the blockchain in a lot of ways, you can’t go and change things, it’s established and locked in. If clients ask 'Are you going to be around in a year or two?', having the ability to answer that is a big sales benefit,\" he said.","Still, Jennings sees Filament's role in the IoT ecosystem as connecting devices and parties but owning the smart contracts by which they interact.","He concluded:","Internet of Things image via Shutterstock"],"entity":[{"type":"BitTorrent","content":"ORGANIZATION"},{"type":"2015","content":"DATE"},{"type":"Jennings","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"Filament","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Verizon Ventures","content":"ORGANIZATION"},{"type":"Scout","content":"ORGANIZATION"},{"type":"AOL","content":"ORGANIZATION"},{"type":"Crosslink Capital","content":"ORGANIZATION"},{"type":"Filament's IoT","content":"ORGANIZATION"},{"type":"last October","content":"DATE"},{"type":"Pennybank","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Jeremie Miller","content":"PERSON"},{"type":"Bullpen Capital","content":"ORGANIZATION"},{"type":"IoT","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"1999","content":"DATE"},{"type":"Samsung","content":"ORGANIZATION"},{"type":"Filament Tap","content":"ORGANIZATION"},{"type":"Eric Jennings","content":"PERSON"},{"type":"CTO","content":"ORGANIZATION"},{"type":"Samsung Ventures","content":"ORGANIZATION"},{"type":"$5m","content":"MONEY"}],"hashtag":["investment","Venture Capital","Blockchain Technology","startups","Technology","Internet of Things","Samsung","Funding","News","Digital Currency Group","Companies","investors","Technology News"],"authors":["Pete Rizzo"]}