{"summary":"The \"Big Four\" auditing firm has launched a mobile plug-and-play product aimed to help enterprises demo blockchain solutions.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2019\/08\/20\/deloitte-blockchain-in-a-box-to-help-enterprises-showcase-tech\/","publishDate":"2019-08-20T10:10:19","id":15064,"type":null,"title":"Deloitte 'Blockchain in a Box' to Help Enterprises Showcase Tech","category":["Markets"],"content":["Deloitte, one of the \"Big Four\" professional services firms, has officially launched a plug-and-play product aimed to help enterprises showcase their blockchain solutions to clients.","The firm's new \"Blockchain in a Box\" (BIAB) is designed as a mobile unit packed with four built-in nodes and several monitors that can be linked to external services such as cloud-based systems.","Firms wanting to demo their blockchain solutions can simply plug in SD media cards and load up their products into the system. Deloitte says BIAB \"facilitates rapid selection and exchange of demo solutions tailored to specific client needs.\"","Linda Pawczuk, principal at Deloitte Consulting and U.S. blockchain lead, explained in an announcement on Monday:","Deloitte said the product has already been demoed to \"several\" clients and more widely at conferences, including CoinDesk's Consensus 2019.","Chih-Wei Yi, principal at Deloitte & Touche, commented that BIAB \"helps to demystify blockchain and is a refreshing and well-grounded approach versus traditional slideware-based demonstrations.\"","Linda Pawczuk, Principal at Deloitte, via CoinDesk archives"],"entity":[{"type":"Wei Yi","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Linda Pawczuk","content":"PERSON"},{"type":"Deloitte","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Deloitte & Touche","content":"ORGANIZATION"},{"type":"Deloitte Consulting","content":"ORGANIZATION"}],"hashtag":["Technology","News","Deloitte","business news","Technology News"],"authors":["Daniel Palmer"]}