{"summary":"Some 100 million PYTH ($47 million) will be distributed to the dapps, following the 255 million tokens allocated to DeFi users in November.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/276447\/pyth-network-token-airdrop-second-phase","publishDate":"2024-02-07T10:00:06","id":1507,"type":null,"title":"Pyth Network unveils second phase of token airdrop for over 160 dapps","category":["CRYPTO ECOSYSTEMS"],"content":["<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Pyth Network <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/264488\/pyth-network-pyth-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><!----> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">PYTH<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +1.16%\n    <\/span><\/a> <!----><\/span><\/span> has unveiled the second phase of its retrospective token airdrop program for 167 decentralized applications that have used the oracle network.<\/span>","Eligible dapps are those that rely on Pyth’s price data for protocol operations, including transactions, asset valuation and on-chain settlement. Some 100 million PYTH governance tokens — worth around $47 million — will be distributed to the dapps.","“It is an honor to work closely with so many passionate developers pushing the boundaries of decentralized finance and the web3 capital markets,” Pyth Network said in a <a href=\"https:\/\/pyth-network.notion.site\/BLOG-Retrospective-Airdrop-Part-2-Allocations-to-PoweredByPyth-Users-466633c717a84366b9153ec9f571d07e\" data-v-f87c67ca=\"\">blog post<\/a>.","Dapps receiving allocations include Synthetix, Mango Markets, Bonfida, Helium and PancakeSwap, spanning DeFi use cases such as DEXs, borrowing and lending, structured products, stablecoins and data analytics. Eligible dapps will announce their own individual allocations and plans for the tokens separately, Pyth explained in the post. However, a date for when the projects will receive their tokens is yet to be announced.","Some dapps have already completed the claims process and may have begun to receive the tokens or will do shortly, with distribution pending legal review as each dapp needs to complete a KYC procedure, according to a source.","<span data-v-f87c67ca=\"\">Eligible airdrop dapps. Image: <a href=\"https:\/\/pyth-network.notion.site\/BLOG-Retrospective-Airdrop-Part-2-Allocations-to-PoweredByPyth-Users-466633c717a84366b9153ec9f571d07e\" data-v-f87c67ca=\"\">Pyth Network<\/a>.<\/span>","“This is a significant moment for the community of decentralized applications that rely on Pyth’s low-latency data,” Michael Cahill, CEO of Douro Labs — a core contributor to Pyth — told The Block. “More than 160 applications are eligible to receive PYTH governance tokens based, among other criteria, on the depth of their integration with the Pyth oracle.”","In November, Pyth Network <a href=\"https:\/\/www.theblock.co\/post\/260421\/pyth-network-token-airdrop\" data-v-f87c67ca=\"\">unveiled<\/a> phase one of its retrospective token airdrop, targeting over 75,000 wallets based on their on-chain activity across 27 blockchains and more than 200 dapps.","Those blockchain ecosystems include Ethereum, Avalanche, Arbitrum, Base, Optimism, Polygon, zkSync, Aptos, Sui, Cosmos and Solana. Community members with official Discord roles for the project are also eligible, as are holders of official Pyth Network NFTs.","The snapshot for the phase one airdrop was later revised for “greater inclusivity,” adding a further 55 million PYTH tokens to the allocation, bringing the total to approximately 255 million PYTH, and expanding eligibility to over 90,000 wallets.","The claims process opened on Nov. 20, with 163 million PYTH — 64% of the airdrop — claimed by more than 51,000 users so far, according to Pyth. Claims will remain open to eligible participants until Feb. 18.","The purpose of the airdrop is to stimulate participation in on-chain governance and transition the Pyth Network toward a permissionless, decentralized and self-sustainable mainnet, according to the team.&nbsp;","PYTH tokens are native to the Solana blockchain, and both phases of airdropped tokens are from Pyth's \"Community and Launch\" category, with up to 6% of the total supply — 600 million PYTH — available to eligible participants. This includes the 100 million PYTH allocated to dapps, 255 million PYTH for on-chain activity by DeFi participants and 10 million PYTH for active community members.","PYTH has gained over 45% since the token launched on Nov. 20 last year, according to The Block’s <a href=\"https:\/\/www.theblock.co\/price\/264488\/pyth-network-pyth-usd\" data-v-f87c67ca=\"\">price page<\/a>. PYTH is currently trading at $0.47.","<span data-v-f87c67ca=\"\">PYTH\/USD price chart. Image: <a href=\"https:\/\/www.theblock.co\/price\/264488\/pyth-network-pyth-usd\" data-v-f87c67ca=\"\">The Block\/TradingView<\/a>.<\/span>","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Solana blockchain","content":"PERSON"},{"type":"6%","content":"PERCENT"},{"type":"Synthetix","content":"LOCATION"},{"type":"Polygon","content":"LOCATION"},{"type":"+1.16%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"64%","content":"PERCENT"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"November","content":"DATE"},{"type":"Aptos","content":"LOCATION"},{"type":"Nov. 20 last year","content":"DATE"},{"type":"November 2023","content":"DATE"},{"type":"Michael Cahill","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Pyth Network NFTs","content":"ORGANIZATION"},{"type":"Pyth oracle","content":"ORGANIZATION"},{"type":"Feb. 18","content":"DATE"},{"type":"45%","content":"PERCENT"},{"type":"Sui","content":"PERSON"},{"type":"The Block\/TradingView","content":"ORGANIZATION"},{"type":"Bonfida","content":"LOCATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"$0.47","content":"MONEY"},{"type":"Mango Markets","content":"ORGANIZATION"},{"type":"Pyth","content":"ORGANIZATION"},{"type":"Nov. 20","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$47 million","content":"MONEY"},{"type":"Pyth Network","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["SOLANA"],"authors":["James Hunt","The Block"]}