{"summary":"If you have the money printer – as is the case for many of the blockchain projects with the power to create their own digital tokens – why wouldn't you use it? PLUS: Vitalik Buterin riffs on meme coin and Ethereum's new \"blob market.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/03\/the-protocol-using-the-money-printer\/","publishDate":"2024-04-03T19:29:43","id":15071,"type":null,"title":"The Protocol: Using the Money Printer","category":["Technology"],"content":["One thing blockchain teams succeeded in long ago: coopting the money printer, from the initial coin offerings, or ICOs, in the late 2010s, to the current-vintage \"token generation events,\" or TGEs. In the old days, stocks were sold by investment banks to clients lucky enough to get an allocation. Nowadays, hot projects just airdrop the newly manufactured tokens to users as rewards, and they start to trade. This week saw airdrops from the cross-chain bridge team Wormhole and the \"synthetic dollar\" project Ethena, whose tokens suddenly have a combined circulating market capitalization of more than $3 billion.","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Also please check out our weekly The Protocol podcast.","We're also covering:","SYNTHESIZING DOLLARS: Back in February, The Protocol wrote about the perceived risks around the crypto project Ethena, with its new USDe token – termed a \"synthetic dollar\" with eye-catching yields (currently 35%) from funding perpetual futures positions on derivatives exchanges. There are plenty of believers in the project, apparently, or at least plenty of speculators. On Tuesday, Ethena airdropped some 750 million ENA tokens, or roughly 5% of the overall supply – for a first-day circulating market capitalization of about $1.2 billion. (The fully diluted valuation, based on the overall supply, works out to about $12 billion.) The success of the airdrop might reflect the current appetite for risk-taking among crypto traders, and the unbowed willingness of crypto structured-finance alchemists to test the waters for products with ever-increasing complexity. Earlier this week, a separate project, the derivatives protocol Cega, unveiled \"Gold Rush, a basket options strategy involving the Ethereum blockchain's ether (ETH) token and Tether's gold-backed XAUT tokens as underlying assets, alongside a safety component that protects users' capital from a 30% drop in the assets' prices,\" as reported by CoinDesk's Omkar Godbole. \"The product offers an annualized percentage yield of up to 83% to investors who stake ETH, Lido's staked ether (stETH), wrapped bitcoin (wBTC), or stablecoin USDC in the option strategy vault, Cega said. The yield is paid out in the form of the coins staked, so ETH stakers receive ETH in yield, providing an asymmetric upside in a bullish market.\" The hope, of course, is to avoid any asymmetric downside.","BLOBS, BLOBS, BLOBS. The Ethereum blockchain just a couple weeks ago completed its landmark Dencun upgrade, including the highly anticipated EIP-4844 proposal that created a dedicated space for storing data – known as \"blobs,\" under a plan to reduce fees while also relieving congestion. But it didn't take long for a new project to come along and jam up the so-called blob space, sending fees soaring and providing the nascent blob market with its first big stress test. As reported last week by our Margaux Nijkerk, Ethereum gas fees for blobs spiked \"after a project called Ethscriptions created a new way of inscribing data, or minting inscriptions, on the data blobs, called 'blobscriptions.'\" In a blog post on Thursday, Ethereum co-founder Vitalik Buterin acknowledged that the Blobscriptions episode had pushed the new blob-fee market into \"price discovery mode,\" but he added that the data fees still remained far cheaper than they would have been under the old system of parking data as \"calldata\" in a regular Ethereum transaction.","Speaking of Buterin, he also riffed on meme coins. \"One answer to this conundrum is to shake our heads and virtue-signal about how much we are utterly abhorred by and stand against this stupidity. And to some extent, this is the correct thing to do,\" he wrote. \"But at the same time, we can also ask another question: If people value having fun, and financialized games seem to at least sometimes provide that, then could there be a more positive-sum version of this whole concept?\" Spoiler alert: His answer was not yes\/no. (Fwiw go here for our own riff last week on the meme coin frenzy on Coinbase's Ethereum layer-2 chain, Base.)","ALSO:","Top picks of the past week from our Protocol Village column, highlighting key blockchain tech upgrades and news.","Schematic showing how Celestia's Blobstream works. (Celestia)","1. Celestia, a blockchain data-availability project, said its Blobstream product – for relaying commitments of Celestia's data root using an on-chain light client, has deployed to Arbitrum One. According to the team: \"Developers can soon deploy Orbits with Celestia underneath on Arbitrum One and Base, the first modular DA integration with working Nitro fraud proofs.\"","2. Degen, a community token in the Farcaster ecosystem, and Syndicate, a Web3 infrastructure provider, launched Degen Chain, an ultra-low-cost L3 for the $DEGEN community built with Arbitrum Orbit, Base for settlement, and AnyTrust for data availability. According to the team: \"The chain’s native gas token is $DEGEN, making it one of the first community tokens with its own L3.\"","3. Picasso Network, a Cosmos-rooted interoperability network, announced an integration between the IBC (Inter-Blockchain Communication Protocol) and Ethereum, \"enabling seamless asset and data transfers between Ethereum and Cosmos\" for the first time, according to the team: \"Picasso selected Osmosis, the DeFi Hub, to serve as the primary destination for Ethereum assets and liquidity within the Cosmos. This integration is a step forward in bringing 'IBC everywhere,' and serves to connect some of the deepest liquidity reserves and most promising projects in the Ethereum and Cosmos ecosystems.\" The team plans a Solana-IBC connection later this month.","4. Avail, a modular blockchain solution designed to unify Web3 and optimize data availability (DA), has partnered with dWallet Network, \"a pioneering non-collusive, decentralized multi-chain layer, to bring programmable native Bitcoin to rollups in the Avail ecosystem,\" according to the team: \"Leveraging the newly unveiled dWallet primitive, smart contracts using rollups built on Avail DA will be able to programmatically manage native BTC for the first time while preserving user ownership.\"","5. PROTOCOL VILLAGE EXCLUSIVE: The Virtual Society Foundation (VSF) is introducing the Somnia Project, consisting of an L1 and omnichain protocols tailored for the metaverse, \"aiming to unite disparate virtual realms into a cohesive society capable of onboarding millions of users,\" according to the team. \"Developed in collaboration with Improbable, Somnia's blockchain boasts transaction speeds >100K TPS, with sub-second finality, and affordability, addressing the fragmentation plaguing the metaverse landscape and ensuring equitable value distribution among creators. Details of the project were released Wednesday along with a litepaper. The VSF, unveiled last week, was initiated by Improbable, a British metaverse-focused startup that raised $150 million in 2022 from investors including a16z and SoftBank.","IoTeX Team (IoTeX)","We were writing about various meme coin trading frenzies for all of March – first on Solana, and then on Base. Or maybe it was really just one big meme coin trading frenzy? Whatever the case, it would be pretty hard for us to feign surprise at this point that the doggy-themed SHIB and DOGE ended up as the month's two top-performing tokens of the month in the benchmark CoinDesk 20 index. Ethereum's ETH was a bit more muted, gaining just 3.9% as the blockchain's big Dencun upgrade went as smoothly as possibly could have been expected. Solana's SOL was a big winner, gaining 43%:","Bitcoin, the oldest and largest cryptocurrency, rose 14%, extending its winning streak to seven straight months and handily beating the Standard & Poor's 500 Index of U.S. stocks as well as the gold price:","April 8-12: Paris Blockchain Week.","April 18-19: Token2049, Dubai.","April 19 (estimate): Next Bitcoin halving.","May 9-10: Bitcoin Asia, Hong Kong.","May 29-31: Consensus, Austin Texas.","June 11-13: Apex, the XRP Ledger Developer Summit, Amsterdam.","July 8-11: EthCC, Brussels.","July 25-27: Bitcoin 2024, Nashville.","Aug. 19-21: Web3 Summit, Berlin.","Sept. 19-21: Solana Breakpoint, Singapore.","Sept. 1-7: Korea Blockchain Week, Seoul.","Sept. 30-Oct. 2: Messari Mainnet, New York.","Oct. 9-11: Permissionless, Salt Lake City.","Oct. 21-22: Cosmoverse, Dubai.","Oct. 23-24: Cardano Summit, Dubai.","Oct. 30-31: Chainlink SmartCon, Hong Kong","Nov 12-14: Devcon 7, Bangkok.","Nov. 20-21: North American Blockchain Summit, Dallas.","Feb. 19-20, 2025: ConsensusHK, Hong Kong","Dec. 5-6: Emergence, Prague","Edited by Bradley Keoun."],"entity":[{"type":"May 29","content":"DATE"},{"type":"Bangkok","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Somnia Project","content":"ORGANIZATION"},{"type":"Austin Texas","content":"LOCATION"},{"type":"New York","content":"LOCATION"},{"type":"Sept. 30","content":"DATE"},{"type":"Picasso Network","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"Oct. 21","content":"DATE"},{"type":"Oct. 23","content":"DATE"},{"type":"4844","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"19","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"13","content":"DATE"},{"type":"12","content":"DATE"},{"type":"11","content":"DATE"},{"type":"IBC","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Oct. 30","content":"DATE"},{"type":"Dallas","content":"LOCATION"},{"type":"Margaux Nijkerk","content":"ORGANIZATION"},{"type":"April 8","content":"DATE"},{"type":"June 11","content":"DATE"},{"type":"Seoul","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"},{"type":"Paris Blockchain Week","content":"ORGANIZATION"},{"type":"$3 billion","content":"MONEY"},{"type":"Base","content":"LOCATION"},{"type":"Cardano Summit","content":"ORGANIZATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Degen","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Standard & Poor","content":"ORGANIZATION"},{"type":"Ethena","content":"LOCATION"},{"type":"February","content":"DATE"},{"type":"Sept. 19","content":"DATE"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Celestia","content":"LOCATION"},{"type":"Lido","content":"LOCATION"},{"type":"Nitro","content":"ORGANIZATION"},{"type":"Nov. 20","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"},{"type":"$150 million","content":"MONEY"},{"type":"Degen Chain","content":"PERSON"},{"type":"Omkar Godbole","content":"PERSON"},{"type":"Devcon 7","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Brussels","content":"LOCATION"},{"type":"Cega","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"3.9%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"April 19","content":"DATE"},{"type":"Prague","content":"LOCATION"},{"type":"ENA","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"April 18","content":"DATE"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"ICOs","content":"ORGANIZATION"},{"type":"Feb. 19","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"May 9","content":"DATE"},{"type":"$DEGEN","content":"MONEY"},{"type":"2010s","content":"DATE"},{"type":"Solana","content":"LOCATION"},{"type":"Avail DA","content":"ORGANIZATION"},{"type":"Amsterdam","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitcoin Asia","content":"LOCATION"},{"type":"July 25","content":"DATE"},{"type":"North American Blockchain Summit","content":"ORGANIZATION"},{"type":"27","content":"DATE"},{"type":"Korea Blockchain Week","content":"LOCATION"},{"type":"Oct. 2","content":"DATE"},{"type":"24","content":"DATE"},{"type":"Celestia","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Oct. 9","content":"DATE"},{"type":"22","content":"DATE"},{"type":"21","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Dubai","content":"LOCATION"},{"type":"Dec. 5","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"July 8","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Sept. 1","content":"DATE"},{"type":"SoftBank","content":"ORGANIZATION"},{"type":"43%","content":"PERCENT"},{"type":"Somnia","content":"ORGANIZATION"},{"type":"Nashville","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"83%","content":"PERCENT"},{"type":"31","content":"DATE"},{"type":"20, 2025","content":"DATE"},{"type":"$12 billion","content":"MONEY"},{"type":"XRP Ledger Developer Summit","content":"ORGANIZATION"},{"type":"Aug. 19","content":"DATE"},{"type":"Salt Lake City","content":"LOCATION"},{"type":"Avail","content":"LOCATION"}],"hashtag":["The Protocol","Protocols","Money Printing","Wormhole","Ethena","Airdrops"],"authors":["Bradley Keoun"]}