{"summary":"As crypto tumbles, Vitalik Buterin says Ethereum’s shift to proof-of-stake will happen in August.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/05\/25\/what-impact-will-a-bear-market-merge-have-on-ethereum\/","publishDate":"2022-05-25T11:30:00","id":15074,"type":null,"title":"What Impact Will a Bear-Market Merge Have on Ethereum?","category":["Technology"],"content":["The past couple of weeks have been some of the most tumultuous in the history of crypto. As the broader cryptocurrency and equity markets have plunged into bear market territory, the price of ether (ETH) has collapsed to numbers we haven’t seen since 2021. Meanwhile, Terra’s hugely popular stablecoin ecosystem collapsed spectacularly, wiping out over $40 billion in value and sending ripple effects across decentralized finance (DeFi).","And as if all this wasn’t enough, one of the largest non-fungible token (NFT) collections has recently become embroiled in a controversy that places its creator at the center of a racist online cult.","This article originally appeared in Valid Points, CoinDesk’s weekly newsletter breaking down Ethereum 2.0 and its sweeping impact on crypto markets. Subscribe to Valid Points here.","But, hey, it’s not all doom and gloom in cryptoland. As markets fall and reputations crater, Ethereum’s community is still hard at work preparing for the Merge – its long-anticipated transition to a proof-of-stake (PoS) network. After signs the network upgrade would be delayed – yet again – past the summer, Ethereum co-founder Vitalik Buterin said at an event in Shanghai last week that the Merge may finally be ready in August.","Read more: How Ethereum Will Be Transformed in 2022","The PoS Merge has been envisioned as a way to improve Ethereum security and decrease energy consumption, all while setting the stage for broader network capacity and fee improvements. But with the recent market downturn comes an important question – will a bear-market Merge blunt the upgrade’s impact?","First, a quick caveat: I am not a markets reporter. While there are some great journalists at CoinDesk and elsewhere who analyze prices and report on market trends, this newsletter is not going to contain any deeply informed insight into how the price of ether might move as a result of the Merge.","But I’ll hazard a guess anyway. For years, speculators have pointed to the Merge as an event certain to boost Ethereum's token price to sky-high levels, perhaps even surpassing that of bitcoin (BTC). Why this should occur has always been vague: It’s difficult to point to many ether price “fundamentals.” While PoS will change some of Ethereum’s tokenomics, ether’s price – like that of most other cryptocurrencies – is mainly a reflection of general market sentiment. With this bear market seemingly poised to last through to August, market sentiment once the Merge hits is likely to be a resounding “meh.”","While the nitty-gritty of the Merge has not changed, this new context in which it will occur still feels relevant. The fact that Ethereum has entered a down market will have important implications for how the upcoming Merge is received by its community and by investors.","Read more: How a Post-Merge Ethereum Could Attract Institutional Investment","Price shouldn’t be the only focus of crypto’s recent market downturn, and it’s not too difficult to predict what sour market conditions might mean for the crypto industry writ large.","With less money flowing into crypto (and other speculative asset classes, one presumes), fewer folks will enter crypto in search of short-term gains. Moreover, one expects many of the investors and developers who entered the space at the highs of crypto’s bull market will flee the space in search of greener, more stable pastures.","I imagine many of those who find jobs in crypto in the coming months (or years) are likely to head toward bigger-name companies like Coinbase (COIN) rather than comparatively risky DeFi bets and newer blockchains. With VC funding drying up, the nascent projects that do survive will do so on account of their talent and technology rather than their ability to garner crypto-crazed valuations and short-term mercenary capital.","Of course, there’s also a potential scenario where scammy NFT projects and Ponzi-esque DeFi protocols continue to see interest from retail investors looking for a quick buck – especially when the stock market can’t be relied upon to deliver high returns. While I’m sure there will be some degeneracy mixed in with everything else, it’s hard to imagine big-name investors will invest hundreds of millions of dollars into unproven experiments like Terra again anytime soon.","Amid all the bad news, the past couple of years have been extremely positive for the cryptocurrency space in a number of respects. With VCs frothing at the mouth to fund anything and everything “crypto,” we’ve probably seen some solid, albeit risky bets get funding that would have been dismissed in more conservative times.","Moreover, even as the NFT market and many DeFi protocols have been crushed under the weight of the wider market downturn, a boom in these sectors has introduced a much larger audience to crypto.","A telling, if unoriginal, comparison with respect to this period in crypto could be made to the dot-com boom and bust of the early millennium. While many of the companies funded before the bubble burst ultimately came to naught, the initial boom still paved the way for much of what emerged in the years that followed.","As Silicon Valley sage Ben Thompson put it in one of his 2021 newsletters:","In the earliest days of the internet, “websites proliferated rapidly, as did dreams about what this new technology might make possible. This mania led to the dot-com bubble, which, critically, fueled massive investments in telecoms infrastructure. Yes, the companies like Worldcom, NorthPoint and Global Crossing making these investments went bankrupt, but the foundation had been laid for widespread high-speed connectivity.”","After the dot-com bubble burst, eventual Big Tech titans including Google (GOOG), Amazon (AMZN) and eBay (EBAY), which were funded alongside shallower bets like Pets.com, went into heads-down mode. These companies wouldn’t have succeeded if not for the infrastructure funded during the internet era’s initial ill-fated funding craze.","In my eyes, this is where work on the Ethereum Merge sits. Rain or shine, the Merge does seem like it’ll happen. Even if it doesn’t wind up being a huge boon to ether’s price, it will, if developers are to be believed, have lasting implications for the future of the network.","The news that the Merge might be due in August came on the heels of two more successful Ethereum mainnet shadow forks; one on May 12 and another on May 20. If you’ve read previous issues of this newsletter, you may recall that a shadow fork is like a test run of Ethereum’s transition to proof-of-stake. Mainnet shadow forks – which simulate the PoS transition using the most intense, real-word conditions – are one of the final steps of testing developers will need to take before they deem the network ready to upgrade. Aside from a couple of very minor hiccups, both of the most recent forks appeared to go well.","The Twitter discourse in the Ethereum developer community these past few weeks, while certainly cognizant of wider market conditions, has been pretty cheery with the news that the Merge is nearing completion. Ether’s price might not reflect this same level of enthusiasm come the Merge, but these past few weeks have added to a consistent string of reminders that prices are among the least interesting parts of this space.","The following is an overview of network activity on the Ethereum Beacon Chain over the past week. For more information about the metrics featured in this section, check out our 101 explainer on Eth 2.0 metrics.","Disclaimer: All profits made from CoinDesk’s Eth 2.0 staking venture will be donated to a charity of the company’s choosing once transfers are enabled on the network.","Conversations about digital money have proliferated at the World Economic Forum’s annual meeting in Davos, Switzerland.","Coinbase (COIN) is now included in the Fortune 500.","Filecoin Foundation and Lockheed Martin (LMT) are exploring hosting blockchain nodes in outer space.","Data shows some bitcoin mining activity in China has resumed.","GameStop (GME) has made available a beta version of its self-custodial Ethereum wallet for users to download.","Valid Points incorporates information and data about CoinDesk’s own Ethereum validator in weekly analysis. All profits made from this staking venture will be donated to a charity of our choosing once transfers are enabled on the network. For a full overview of the project, check out our announcement post.","You can verify the activity of the CoinDesk Eth 2.0 validator in real time through our public validator key, which is:","0xad7fef3b2350d220de3ae360c70d7f488926b6117e5f785a8995487c46d323ddad0f574fdcc50eeefec34ed9d2039ecb.","Search for it on any Eth 2.0 block explorer site.","\n"],"entity":[{"type":"Ethereum Beacon Chain","content":"LOCATION"},{"type":"Amazon","content":"LOCATION"},{"type":"Switzerland","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"GameStop (GME","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Post-Merge Ethereum Could Attract Institutional Investment","content":"ORGANIZATION"},{"type":"NorthPoint","content":"ORGANIZATION"},{"type":"Lockheed Martin (LMT","content":"ORGANIZATION"},{"type":"May 20","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"Valid Points","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"Davos","content":"LOCATION"},{"type":"the World Economic Forum","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Big Tech","content":"ORGANIZATION"},{"type":"Filecoin Foundation","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$40 billion","content":"MONEY"},{"type":"Worldcom","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Valid Points","content":"ORGANIZATION"},{"type":"Ethereum Merge","content":"ORGANIZATION"},{"type":"last week","content":"DATE"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Silicon Valley","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"Ben Thompson","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"May 12","content":"DATE"}],"hashtag":["Ethereum","Ethereum 2.0","Beacon Chain","Markets","Valid Points","The Protocol"],"authors":["Sam Kessler","Sage D. Young"]}