{"summary":"Coinbase announced it would rescind offers, surprising recruits who told CoinDesk they believed their new roles would be safe.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/04\/coinbases-abrupt-hiring-reversal-blindsided-would-be-employees\/","publishDate":"2022-06-04T00:42:58","id":15076,"type":null,"title":"Coinbase’s Abrupt Hiring Reversal Blindsided Would-Be Employees","category":["Finance"],"content":["Would-be Coinbase employees have been left in the lurch after the crypto exchange announced it would rescind job offers as part of a swathe of cost-cutting measures in a bear market.","CoinDesk spoke to three such recruits who said they felt blindsided by the sudden reversal from the company they’d assumed was the most stable brand in crypto – a place worth picking over Snap, Meta, Roblox or other tech giants. One software engineer, a recent college graduate, said they passed up offers from all three to work instead of at Coinbase.","Another software engineer who said he signed his Coinbase Cloud offer in mid-May was days away from leaving his job on Wall Street: He was at a going-away happy hour with work friends when the rescission email hit. Now, he’s staying put.","Many of the potentially hundreds of downturned prospects weren’t so lucky. The college grad was planning on starting in September.","“Now I’m scrambling to get something, and most companies are either filled up or frozen hiring,” the grad said.","Coinbase announced earlier this year it intended to triple its headcount through the end of 2022. One of the recruits CoinDesk spoke to said he believed a few hundred people may have been in the recruitment and onboarding process this week.","On Thursday, Coinbase Chief People Officer L.J. Brock announced that the company would “rescind a number of accepted offers.” And it appears to have wasted no time in doing so.","Several almost-hires posted to the Blind jobs posting forum noting that they left their old roles, or turned down other offers, to take on roles at Coinbase, which announced two weeks ago it would slow its hiring process. One individual said they were a new graduate who interviewed in November.","According to a copy of an email sent to this person from Brock, they will receive one month’s salary as severance.","Other users said their start date was meant to be June 6, just four days after Brock’s blog post.","Coinbase’s stock price traded around $67 Friday, down 9% over the day amid a broader fall in tech stocks."],"entity":[{"type":"Brock","content":"PERSON"},{"type":"9%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"$67","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"Coinbase Chief People Officer L.J. Brock","content":"ORGANIZATION"},{"type":"June 6","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Meta","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"mid-May","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Coinbase Cloud","content":"ORGANIZATION"}],"hashtag":["Coinbase","Layoffs"],"authors":["Nikhilesh De","Danny Nelson"]}