{"summary":"The agreement comes after CoinDesk had reported last month that Binance was preparing a bid for Voyager's assets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/12\/19\/binanceus-agrees-to-buy-bankrupt-crypto-lender-voyagers-assets-for-over-1b\/","publishDate":"2022-12-19T13:17:27","id":15072,"type":null,"title":"Binance.US Agrees to Buy Voyager's Assets for $1.02B","category":["Finance"],"content":["Voyager Digital, the bankrupt crypto lender, said Binance.US has agreed to buy its assets for $1.022 billion, the firm said on Monday.","The bid represents the fair market value of Voyager's cryptocurrency portfolio, which has a current market value of around $1.002 billion, and an additional consideration of $20 million in incremental value.","\"The Binance.US bid aims to return crypto to customers in kind, in accordance with court-approved disbursements and platform capabilities,\" Voyager said in the statement.","Binance CEO Changpeng \"CZ\" Zhao had said last month that exchange's U.S. wing would be making a fresh bid for Voyager Digital. CoinDesk had earlier reported that Binance was preparing a bid for the bankrupt crypto lender's assets.","Binance.US will make a good faith deposit of $10 million and will reimburse Voyager for certain expenses up to $15 million. Voyager will also seek the approval of the bankruptcy court at a hearing on Jan. 5, 2023.","Voyager, which went into bankruptcy earlier this year, had agreed to sell its assets to the now-defunct crypto exchange FTX, with FTX beating out rivals Wave Financial and Binance for the assets.","VGX, the native token of Voyager Digital, skyrocketed over 32% after Binance won the bid. VGX was trading at about 38 U.S. cents at the time of writing. Binance's BNB token also rose over 1% on the news, trading at $250.","The news come as Binance itself is being scrutinized. Last week, Binance lost its auditor, Mazars Group, and the recently published proof of reserves report that was requested by the exchange's community. This added to previously circulating concerns that the financial stability of the exchange is unhealthy.","“Binance is making a bold move buying Voyager,” said Shaban Shaame, founder and CEO at EverDreamSoft. “They are sending a signal showing the market that they have a strong resilience on the current bear market. The time will tell if they are bluffing, or they are not only solvent but also strong in their balance sheet.”","UPDATE (Dec. 19, 13:30 UTC): Adds background, token movements.","UPDATE (Dec. 20, 16:03 UTC): Adds Binance under scrutiny, quote in last two paragraphs.","\n"],"entity":[{"type":"$1.002 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Dec. 20","content":"DATE"},{"type":"32%","content":"PERCENT"},{"type":"Dec. 19","content":"DATE"},{"type":"Jan. 5, 2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Voyager","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Mazars Group","content":"ORGANIZATION"},{"type":"Shaban Shaame","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"EverDreamSoft","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$1.022 billion","content":"MONEY"},{"type":"$15 million","content":"MONEY"},{"type":"$20 million","content":"MONEY"},{"type":"last month","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"$10 million","content":"MONEY"},{"type":"$250","content":"MONEY"}],"hashtag":["Binance","Voyager","acquisition","Bankruptcy"],"authors":["Parikshit Mishra"]}