{"summary":"The price of bitcoin has declined nearly 10% in the last 24 hours.\nIt fell below $59,000 but has since rebounded slightly.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124439\/bitcoin-price-drops-nearly-10-in-24-hours-dips-below-60000","publishDate":"2021-11-16T06:07:28","id":1507,"type":null,"title":"Bitcoin price drops nearly 10% in the last 24 hours, dips below $60,000","category":["Bitcoin"],"content":["The price of bitcoin has declined nearly 10% in the last 24 hours, dipping significantly below $60,000 before bouncing back.","The drop seems to be triggered by <a href=\"https:\/\/www.theblockcrypto.com\/linked\/124387\/biden-signs-infrastructure-bill-handing-crypto-broker-definitions-to-the-us-treasury\" data-v-f87c67ca=\"\">the infrastructure bill<\/a> signed by U.S. President Joe Biden yesterday, Darius Sit, co-founder of crypto trading firm QCP Capital told The Block. The bill includes tax reporting provisions that require crypto exchanges to report information to both the Internal Revenue Service (IRS) and to their customers, including capital gains.","Sit said the market is using the infrastructure bill news \"as an excuse to take profit after trading all-time highs across the board.\" The action wasn't unexpected, Sit added, because \"leverage levels were pretty high as well.\"","Bitcoin is currently trading at around $60,400, according to TradingView. It hit a high of over $66,000 yesterday. The price of ether (ETH), the second-largest cryptocurrency, has also dropped over 7% in the last 24 hours and is currently trading at around $4,200.","","","Overall, the market cap of the entire crypto market has fallen around 10% in the last 24 hours to around $2.72 trillion, according to CoinGecko.","The macro-environment also looks \"a little shakey\" with high levels of inflation, according to Sit. U.S. inflation hit a three-decade high last month as prices surged to 6.2%.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to follow The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/twitter.com\/TheBlock__\" target=\"_blank\" rel=\"noopener noreferrer\" data-stringify-link=\"https:\/\/twitter.com\/TheBlock__\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Twitter<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>"],"hashtag":["BITCOIN"]}