{"summary":"The Ethereum-focused developer firm attributes the layoffs to working more effectively, rather than financial reasons.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/02\/01\/polygon-labs-cuts-19-of-staff-60-roles-for-enhanced-performance\/","publishDate":"2024-02-01T14:35:39","id":15075,"type":null,"title":"Polygon Labs Cuts 19% of Staff, 60 Roles, for 'Enhanced Performance'","category":["Technology"],"content":["Polygon Labs, the developer firm behind the layer-2 rollup network Polygon, has cut 60 roles, accounting for roughly 19% of its staff, the company said in a blog post on Thursday.","According to the release, the downsizing comes “for the sake of enhanced performance, rather than for financial reasons.” The company also shared that the team behind Polygon ID will be spinning out of the firm in the coming months.","For those that were not impacted by the layoffs, Polygon said that they will receive at least a 15% increase in their total compensation, and that they would also be eliminating geo-pay models.","The fresh round of reductions come less than a year after a downsizing in February 2023, when Polygon previously laid off 20% of its staff amid a restructuring.","“The reality is that achieving our mission often demands challenging decisions, and while difficult, the founders and I agree that we must move forward in a thoughtful way that gives us the greatest chance to execute successfully,” Marc Boiron, CEO of Polygon Labs, wrote in a post on X.","Read more: Polygon Labs Cuts 20% Workforce, Almost 100 Jobs","Edited by Bradley Keoun."],"entity":[{"type":"19%","content":"PERCENT"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"Marc Boiron","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"February 2023","content":"DATE"},{"type":"Bradley Keoun","content":"PERSON"}],"hashtag":["Polygon","Polygon labs","layer 2","Jobs"],"authors":["Margaux Nijkerk"]}