{"summary":"Self-custody, transparency and immediate settlement are just a few ways that crypto could prevent loss of funds.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/03\/23\/crypto-is-the-solution-to-bank-runs-not-the-cause\/","publishDate":"2023-03-23T12:45:00","id":15082,"type":null,"title":"Crypto Is the Solution to Bank Runs, Not the Cause","category":["Finance"],"content":["Over the last few weeks, we saw Silicon Valley Bank close and get taken over by the Federal Deposit Insurance Corporation, which guaranteed deposits and put it up for auction.","We saw runs and failures at more banks, including Silvergate Bank and Signature Bank, spurring fear of runs at others like First Republic Bank. And we’ve seen the bank contagion move across the pond to Europe – specifically Credit Suisse, to which the Swiss central bank recently granted a loan of 50 billion Swiss francs.","But the closure of Silvergate Bank and Signature in particular, the top two banks that worked with crypto companies, gave the impression that the U.S. government wants to push crypto out of the country.","You're reading Crypto for Advisors, a weekly look at digital assets and the future of finance for financial advisors. Subscribe here to receive the mailing every Thursday.","For financial professionals, this may seem like a good time to turn away from crypto and avoid devoting energy to it. However, this could actually be the best time to embrace it and learn more. Fallouts in traditional banking is the situation the Bitcoin blockchain was created for, and this is why crypto should continue to gain adoption.","So many crypto and blockchain technology characteristics could provide solutions to the issues we’re seeing. Self-custody, transparency and immediate settlement are inherent to crypto and could bring more adoption.","Banks and financial institutions are the custodians of most of our financial assets – including cash and securities. They hold the assets for us and make accounting notations regarding our “ownership.”","This scenario has arisen from necessity because for decades it has been impractical for us to take custody of our own assets. We have depended on custodians to facilitate the entire financial system, including trading, lending and borrowing.","The result: 1) extreme government regulation of custodians and 2) blind trust in those custodians, mainly due to that regulation.","In essence, most Americans and westerners have the general impression their money is safe at chartered banks because these banks cannot take too many risks with the money.","But what we’ve seen in the last few weeks is that our money might not be safe at the bank, even with all that regulation. Crypto, on the other hand, is built on the idea of self-custody.","I anticipate that more people and businesses will start viewing crypto self-custody as an option for some of their assets – not necessarily because they’re investors in crypto assets, but because they want to use the crypto rails as a way to circumvent the reliance on custodians regulated by the government.","The system is really only efficient when we all control our own assets.","Read more: Self-Custodial Onboarding Will Be the Norm in Web3's 2023","Many current issues and regulations involve transparency, or lack thereof. One of the purposes of registering with the state, Federal Reserve and Securities and Exchange Commission is to make the books public and visible to us all, so we can feel comfortable making risk-based decisions. However, that transparency is usually quarterly, not up to the second.","The recent bank runs didn’t come from a worry about solvency, but of liquidity. Depositors start pulling deposits because no one wants to be the last one out and not have any cash.","If the asset pools were transparent up to the second, as we see in crypto, all depositors would know exactly how much liquidity the pools contained and could determine their relative need to withdraw in an efficient manner, rather than just out of fear.","In an attempt to grow their value and provide services to depositors and other customers, banks and other custodians need to either lend the money from deposit pools or invest in low-risk assets to try to earn some yield.","Of course, there is a time mismatch between loans and securities. While the securities are usually in very liquid markets, they don’t settle immediately and are still subject to certain market hours.","We recently saw bank runs where the panic extended to night and weekend hours, a difficult time for the bank to sell any securities and free capital.","Contrast this to the crypto system, which is always on and where we see instant or near-instant settlement. When I send you bitcoin, ether or USDC, those crypto assets move from my wallet to yours right away, and the transaction is settled. No need to wait for markets to open and money to transfer from my account to yours. Blockchain-based transactions are settled and final.","Over the last few years, with the rise and fall in price of crypto assets and the increased media coverage and conversations about crypto, we have heard so many naysayers argue that we don’t “need” crypto and that there is no way to justify its value. Even as an educator to financial professionals, I have said we don’t really need crypto in the U.S. or even in western democracies.","Over and over again, however, we’ve seen a need for one or more of the characteristics inherent to blockchains, crypto and decentralized finance. We are starting to observe realizations by individuals and businesses that a better financial system exists – one that they can use for financial transactions without government intervention, policy making and money printing.","As the realization occurs, and as crypto custody becomes safer, we should see a natural migration toward crypto and blockchain. But this will require a need for assistance from financial professionals, including advisors, CPAs and lawyers. Current financial professionals can look at the recent happenings as a sign that the U.S. government is anti-crypto, or they can view them as a sign that we need the crypto ecosystem.","Now might be the best time to start learning crypto and determining how to best incorporate it into a portfolio. The next bull run in crypto won’t be based on speculation. It will be based on increased adoption and use by ordinary individuals and businesses who view crypto as a viable and necessary alternative to the current financial system."],"entity":[{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Federal Deposit Insurance Corporation","content":"ORGANIZATION"},{"type":"First Republic Bank","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"Europe","content":"LOCATION"},{"type":"USDC","content":"ORGANIZATION"},{"type":"50 billion Swiss francs","content":"MONEY"},{"type":"Credit Suisse","content":"ORGANIZATION"},{"type":"Federal Reserve and Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Silicon Valley Bank","content":"ORGANIZATION"}],"hashtag":["Opinion","Newsletters","Crypto for Advisors","Silicon Valley Bank","Signature Bank","Silvergate Bank","Self custody","Transparency","Settlement"],"authors":["Adam Blumberg"]}