{"summary":"The price of bitcoin dipped below $22,000 early Wednesday after authorities moved some of the bitcoin to Coinbase-controlled wallets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/03\/09\/us-governments-1b-bitcoin-transfer-spooks-investors-bitcoin-dips\/","publishDate":"2023-03-09T01:27:39","id":15081,"type":null,"title":"U.S. Government's $1B Bitcoin Transfer Spooks Investors; Bitcoin Dips","category":["Markets"],"content":["U.S. authorities transferred $1 billion worth of bitcoin (BTC) recovered from a dark web hack to new wallet addresses, including one owned by Coinbase, on Wednesday, stoking investor fears that intense sell pressures could drive down the token's price.","Authorities moved the bitcoin in three transactions, according to data from blockchain security firm PeckShield. Nearly 10,000 bitcoin were sent to Coinbase-controlled wallets, while roughly $41,000 tokens were directed to government-controlled wallets.","PeckShield published its findings on Twitter early Wednesday, and investors were quick to notice. In the hours after the report's release, investors expressed their fears that authorities would sell the recovered bitcoin on the open market, potentially tanking the price of bitcoin, which has recovered from its two-year low of roughly $15,500 in November. The concerns caused bitcoin's price to dip roughly 2%, pushing it below $22,000.","An open market sale would be a departure from authorities' past handlings of seized digital assets. The government usually sells seized assets at auction. In 2014 and 2015, the government auctioned off bitcoin seized from the owner of virtual black market platform Silk Road.","Although concerns about the tokens' sale on the open market may be overblown, fears that bitcoin prices could take a hit are not entirely unjustified, said Conor Ryder, a researcher at crypto markets analysis firm Kaiko.","\"The movement of Silk Road bitcoin to Coinbase is almost definitely being done with the intention to sell [the recovered tokens], so one has to wonder if bitcoin is due for some short-term headwinds,\" Ryder told CoinDesk.","Whether the market will absorb those pressures will likely boil down to the market's composition, says Mark Connors, head of research at 3iq, a digital asset manager. In other words, who the token holders are and how many tokens they hold will largely influence the extent to which the market reacts to a potential market-moving event.","The current composition of the bitcoin market may help bitcoin stand up to sell pressures better than it did in the wake of last spring's Terra crash, according to Connors. That's because the market has less leverage than it did last year. It's also because the market today is composed of more investors owning wallets holding more than $1,000 worth of tokens than it was last year, when the market was flooded with a large amount of crypto-curious investors who held much smaller amounts of bitcoin.","\"There should be a quicker bounce back if there's sell pressure, given the larger amount of push [in] the market today compared with the weaker hands and greater leverage [that characterized the market] a year ago.\"","Bitcoin's price may still move as the government reveals its plans for the recently transferred bitcoin, however. Many things about the government's plans for the tokens remain unknown. It remains unclear if authorities will auction off the bitcoin. It is also unclear if the government will consolidate the assets at some point.","Read More: Dark Markets Grow Bigger and Bolder in Year Since Silk Road Bust"],"entity":[{"type":"$41,000","content":"MONEY"},{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"$22,000","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"$1 billion","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Kaiko","content":"LOCATION"},{"type":"$1,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Conor Ryder","content":"PERSON"},{"type":"Mark Connors","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"PeckShield","content":"ORGANIZATION"},{"type":"$15,500","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Connors","content":"PERSON"},{"type":"last spring","content":"DATE"}],"hashtag":["Bitcoin","U.S. Government","Coinbase","Markets"],"authors":["Elizabeth Napolitano"]}