{"summary":"The blockchain developer gave the coffee giant a $4 million grant as part of their 2022 deal to build an NFT-powered loyalty program that is now being shuttered.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/19\/polygon-labs-paid-4m-to-host-starbucks-doomed-foray-into-crypto\/","publishDate":"2024-03-19T17:54:56","id":15088,"type":null,"title":"Polygon Labs Paid $4M to Host Starbucks' Failed Foray Into Crypto: Sources","category":["Finance"],"content":["Companies usually pay their tech vendors for services rendered. For Starbucks' soon-to-be-defunct foray into crypto on the Polygon network, it was the other way around.","Polygon Labs paid $4 million to the coffee giant in 2022 as part of their deal to build and host a blockchain-based loyalty program, Starbucks Odyssey, on the Polygon network, according to two people familiar with the matter. The payout ended a competitive hunt by proponents of at least three blockchain ecosystems who wanted to partner with Starbucks, a third person said.","The previously unreported figure adds context to the origins of one of crypto's flashiest crossovers into American consumer culture (and subsequent flops). Last week, Starbucks pulled the plug on Odyssey, its 18-month experiment in using collectible non-fungible tokens as the anchor of a loyalty program.","The figure speaks to the cost of doing business development in crypto. In 2022 Polygon Labs pursued headline-grabbing partnerships with the likes of Nike and Starbucks, the kind of companies that might elevate Polygon's name recognition. If big brands were using Polygon as their launchpad for crypto, then perhaps their massive customer bases would follow suit.","They did not.","\"These types of big flashy deals are a remnant of the past and the previous leadership’s strategy,\" said a person familiar with Polygon Labs' current thinking. The company, the main developer of the Polygon blockchain, is now more focused on building innovative tech than inking partnerships, the person said.","The deal with Polygon likely wasn't only a money play. Starbucks appears to have been genuinely interested in finding a Web3 partner that would host Odyssey. Its search was being led by Forum3, a marketing consulting shop whose co-CEO Adam Brotman was once Starbucks' chief digital officer.","Brotman had conversations with representatives from Polygon as well as Solana in early 2022, two people privy to the discussions said. Samson Mow, a longtime bitcoin booster, told CoinDesk he lobbied Starbucks to choose Liquid Network, a bitcoin layer-2.","Forum3 chose Polygon for its tech, one former Polygon employee said. But the deal also came with the grant as well as extensive technical and marketing support to help Forum3 set up the Starbucks loyalty program, that person said.","Starbucks Odyssey sought to reimagine the coffee company's popular loyalty program with a crypto tint, according to a case study published by Forum3 in January. Members would get \"stamps\" (collectible NFTs) for completing tasks. They could use those stamps to qualify for rewards like invitations to coffee-themed experiences or exclusive branded swag.","The loyalty program promised to be a moneymaker for Starbucks. It sold these stamps for as much as $100 apiece. It likely made over a quarter of a million dollars by taxing secondary sales of the stamps, according to on-chain data.","But Odyssey also had upside for its members, the stamp buyers. They could resell the stamps to others via a digital storefront set up by Starbucks and Nifty Gateway, an NFT marketplace.","Forum3's case study hailed the \"measurable monetary value\" Odyssey could create for Starbucks and its fans. The first monetized Odyssey NFT series (the Siren Collection) sold out in 18 minutes and quickly traded at a 4x premium, according to Forum3.","As happens with many NFTs, Odyssey found a collector community that believed in its value potential and bet big. One such collector was Dan Elitzer, co-founder of the venture capital firm Nascent.","\"We've not invested a huge amount compared to what we typically do,\" Elitzer said in a January interview. Even so, Nascent believed that Odyssey NFTs could have long-term value if Starbucks Odyssey endured as the first big NFT loyalty program, he said.","Even before Starbucks said it would shutter Odyssey, its NFTs value proposition was under stress. The last Siren NFT to sell before Starbucks' March 15 announcement was priced at $215. On Tuesday prospective buyers were offering a maximum of $86 per Siren NFT, while sellers wanted no less than $165.","Representatives for Forum3, which once billed itself as a Web3 company but has since pivoted to AI, according to its website, did not respond to a request for comment.","Starbucks Odyssey succeeded in fostering a niche following during its 18-month run as an invite-only \"beta\" program. Along with a vibrant Discord server, it inspired a cult following whose proponents traded the NFTs, boosted the program on social media and even created a \"Tips\" website to help people strategize their points-earning.","That community was in a sense of shock last week when Starbucks abruptly announced the Odyssey was ending. Members traded messages of grief, anger, sadness and wistful memories in its private Discord server, according to screenshots of messages reviewed by CoinDesk.","\"It’s definitely a little upsetting as someone who has put some time and $$ in but overall I understand the pivots of big business and I’m happy that Starbucks tested the concept,\" Bryan Kayne, a crypto consultant and Odyssey member, said in a Telegram message to CoinDesk.","In an email to CoinDesk, a representative for Starbucks said: \"We’re looking forward to applying our learnings to the future of this program.\" She would not detail what that future holds, nor whether it will continue working in Web3.","\"We value our relationship with Polygon and the contributions it has made to Starbucks Odyssey,\" the representative said. She would not discuss the financials of its business partnership with Polygon.","The Starbucks deal was an exemplar of the high-flying, big-name-forward dealmaking style Polygon pursued under the leadership of Ryan Wyatt. The former online gaming executive was Polygon Labs' president from early 2022 until mid-2023, when, according to two people familiar with Polygon, he was ousted.","\"If you look at Polygon Labs now, over the last nine months they’ve shifted their focus to become a tech powerhouse focused on ZK tech and deals that have more of an immediate impact on-chain rather than marketing value,\" one source said.","The switch also reflects the challenges of building crossover Web3 products for a non-crypto audience, paid deal or no. Multiple users and proponents of Odyssey told CoinDesk the feature was built to accommodate those who didn't have a crypto wallet or an understanding of blockchains – in other words, most human beings (and by extension most Starbucks customers).","A former Polygon employee who worked on the Starbucks deal said it was no surprise Odyssey is shutting down.","\"Chasing Web2 is a fool's errand, in my opinion,\" the person said, referring to established tech giants. \"The crypto native narrative is big enough if you play it right.\"","Wyatt, who declined to comment through a spokesperson at his current employer, Optimism Unlimited, highlighted his emphasis on the marketing value of dealmaking in recorded talks he gave after leaving Polygon.","\"We were in a really good position where people were looking for positive stories and so a lot of the efforts were amplified,\" Wyatt said in an interview with crypto investing firm Variant in September 2023, months after leaving Polygon. Partnerships with \"household brand names\" helped Polygon \"establish credibility,\" he said.","It was common for Polygon to pair grants with their partnerships, a former employee said, calling the practice commonplace across crypto. Wyatt said the same in an appearance on CoinDesk TV in December 2022.","\"All the protocols are doing paid deals,\" he said at the time.","Edited by Marc Hochstein."],"entity":[{"type":"Odyssey","content":"ORGANIZATION"},{"type":"Dan Elitzer","content":"PERSON"},{"type":"$$","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"Ryan Wyatt","content":"PERSON"},{"type":"million dollars","content":"MONEY"},{"type":"Nascent","content":"ORGANIZATION"},{"type":"Siren NFT","content":"ORGANIZATION"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Nifty Gateway","content":"ORGANIZATION"},{"type":"Nike","content":"ORGANIZATION"},{"type":"$165","content":"MONEY"},{"type":"$100","content":"MONEY"},{"type":"Bryan Kayne","content":"PERSON"},{"type":"Adam Brotman","content":"PERSON"},{"type":"Brotman","content":"PERSON"},{"type":"$86","content":"MONEY"},{"type":"2022","content":"DATE"},{"type":"$4 million","content":"MONEY"},{"type":"$215","content":"MONEY"},{"type":"January","content":"DATE"},{"type":"March 15","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Elitzer","content":"PERSON"},{"type":"Starbucks Odyssey","content":"ORGANIZATION"},{"type":"Wyatt","content":"PERSON"},{"type":"December 2022","content":"DATE"},{"type":"September 2023","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"Odyssey NFT","content":"ORGANIZATION"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Starbucks","Starbucks odyssey","Polygon","NFT"],"authors":["Danny Nelson"]}