{"summary":"It's still not yet time to lay this much plagued stablecoin project to rest.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/02\/01\/diem-may-be-gone-but-its-legacy-lives-on\/","publishDate":"2022-02-01T18:04:24","id":15083,"type":null,"title":"Diem May Be Gone, but Its Legacy Lives On","category":["Policy"],"content":["The Diem Association will wind down its operations in the coming weeks after selling its assets to Silvergate Bank. It's time to revisit the chief legacy it leaves behind: A more involved regulatory framework than it may have intended.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","The Facebook-backed Diem Association is shutting down operations, just two and a half years after it was revealed to the world as Libra.","We’re talking about Diem again, not because it is interesting – I'm not saying it isn't, that's just not the point of today's newsletter – but because the regulations that will potentially be implemented as a result of this project are fascinating to think about.","Where do I even start?","Diem, formerly known as Libra, has reached an untimely end. It announced last night that it will begin unwinding its businesses days after various news outlets reported that it was in talks with Silvergate Bank to sell off its assets and technology to repay investors. Silvergate confirmed the deal last night.","Under the terms of the deal, Silvergate paid $50 million in cash and gave another $132 million in Class A shares, which Diem will use to repay investors. In turn, Silvergate will get all of Diem's intellectual property and technology tooling, which it will use to help launch a stablecoin by the end of the year.","I wrote a complete timeline documenting Diem’s history back in April 2020, and it’s updated through this week’s news. You can read it here.","For a project that never got off the ground, Libra has a remarkable legacy. Arguably, every major piece of stablecoin regulation or legislation proposed over the past two and a half years has been tinged with the idea that a company, somewhere, might decide to create its own stable value currency based on blockchain technology. We’ve seen this in recommendations from the Bank for International Settlements to China’s central bank digital currency to the U.S. President’s Working Group for Financial Markets report on stablecoin regulation.","The House Financial Services Committee and Senate Banking Committee both plan to hold hearings on the PWG report this month. While we don’t have a lot of details yet, it’s safe to say the hearings will be a prelude to legislation on stablecoins. Elsewhere in the world, we’re seeing regulators start to implement rules on stablecoins.","Diem engaged with regulators throughout its life.","\"As we undertook this effort, we actively sought feedback from governments and regulators around the world, and the project evolved substantially and improved as a result,\" Diem CEO Stuart Levey said in a statement announcing the shutdown. \"In the United States, a senior regulator informed us that Diem was the best-designed stablecoin project the U.S. government had seen.\"","Levey also mentioned the PWG report, saying it validated the project's \"code design features,\" including how it addresses stablecoin transfer risks.","The thing is, the original Libra vision of a basket-backed stablecoin was dead long before the association rebranded to Diem. Today, one could draw a comparison to tether (USDT) or US dollar coin (USDC) in that they are now backed by baskets of assets, though not baskets of currencies. They aren’t quite the same, but they are probably similar enough. The chief concerns were how the libra stablecoin might affect financial stability, how it might be used and whether users were protected. The same questions apply to stablecoins backed by baskets containing securities or other cryptocurrencies.","The big difference – and I want to revisit this more in depth in a future issue – is that Facebook was involved. Lawmakers and regulators were aware of stablecoins, but didn’t really care about them as an imminent threat.","Facebook announced Libra in a carefully managed press event. Reporters flew to San Francisco for embargoed briefings, press releases and technical documents were shared under prearranged agreements not to publish before a specific time, and swarms of reporters spent time trying to unpack what was being announced.","Libra, and later Diem, was never able to overcome Facebook's shadow, however much everyone involved with the project tried to draw a clear distinction.","For a parting thought, imagine how much regulatory brain power has been dedicated to this project over the past 30 months. It's a lot! Surreal to imagine almost.","The infamous unhosted wallet rule is once again on the Treasury Department’s radar. The department published its semiannual agenda over the weekend, detailing its priorities over the next six months.","The unhosted wallet rule first proposed in December 2020 was on the document, implying that Treasury (or the Financial Crimes Enforcement Network, the ostensible sponsor) is looking at the rule.","At first blush, this would seem to be another attempt at bringing forth know-your-customer rules for self-hosted\/user-hosted\/what-have-you wallets. Treasury, however, may just be keeping the rule alive just in case it does want to eventually get back to wallet rules.","The rule appears in previous semiannual agendas as well, but Treasury didn't make any move on the rule last year.","The important details: Treasury bifurcated the rule in early 2021. The rule received enough comments the last time that a whole new comment process may need to kick off before Treasury can finalize or adopt the counterparty data collection provision or the overall rule as originally proposed. If Treasury just wants to adopt the currency transaction report provision (which would bring crypto reporting rules in line with current cash rules), there may not be much opposition.","What's more, I'm told FinCEN may still not want the counterparty provision in its current form.","Long story short, this rule has made a reappearance, but there's no real sign it will move forward just yet.","The Senate Banking Committee will hold a nomination hearing for Federal Reserve Board nominees Sarah Bloom Raskin, Lisa DeNell Cook and Philip Nathan Jefferson on Thursday.","It’s also the last week for Jelena McWilliams, chairwoman of the Federal Deposit Insurance Corp. (FDIC), who announced on New Year’s Eve that her resignation would be effective on Feb. 4.","If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Twitter @nikhileshde.","You can also join the group conversation on Telegram.","See ya’ll next week!"],"entity":[{"type":"Silvergate","content":"ORGANIZATION"},{"type":"San Francisco","content":"LOCATION"},{"type":"Silvergate Bank","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"April 2020","content":"DATE"},{"type":"Financial Crimes Enforcement Network","content":"ORGANIZATION"},{"type":"weekend","content":"DATE"},{"type":"Philip Nathan Jefferson","content":"PERSON"},{"type":"Stuart Levey","content":"PERSON"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"Bank for International Settlements","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Sarah Bloom Raskin","content":"PERSON"},{"type":"PWG","content":"ORGANIZATION"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Libra","content":"PERSON"},{"type":"Libra","content":"LOCATION"},{"type":"Jelena McWilliams","content":"PERSON"},{"type":"United States","content":"LOCATION"},{"type":"Feb. 4","content":"DATE"},{"type":"last night","content":"TIME"},{"type":"past two and a half years","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"House Financial Services Committee and Senate Banking Committee","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Federal Reserve Board","content":"ORGANIZATION"},{"type":"December 2020","content":"DATE"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"last week","content":"DATE"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"$132 million","content":"MONEY"},{"type":"Diem Association","content":"ORGANIZATION"},{"type":"U.S. President’s Working Group for Financial Markets","content":"ORGANIZATION"},{"type":"Lisa DeNell Cook","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Regulations","Newsletters","State of Crypto","Libra","Diem","Libra Association","Unhosted Wallets","FinCEN","Treasury Department"],"authors":["Nikhilesh De"]}