{"summary":"The much-debated crypto broker says it's poised to start its SEC-compliant custody with ETH, then will soon add other names and begin a trading operation within months.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/02\/07\/prometheum-the-only-us-registered-crypto-platform-picks-ether-as-its-first-product\/","publishDate":"2024-02-07T13:35:00","id":15085,"type":null,"title":"Prometheum, the Only U.S.-Registered Crypto Platform, Picks Ether as Its First Product","category":["Policy"],"content":["Prometheum Inc. – still standing alone as the only U.S.-registered crypto securities platform – has disclosed that the first digital asset it'll handle for clients will be Ethereum's ether (ETH).","The company, which has been a target of industry criticism and debate, hasn't yet taken in any revenue after having only very recently cleared the final regulatory hurdle to open its custody operation. But co-CEOs Aaron and Benjamin Kaplan said they'll take on custody of customers' ETH by the end of next month.","\"We want to be able to service the largest market cap and most liquid token,\" said Aaron Kaplan in an interview with CoinDesk. \"Ethereum is first, and there should be many more thereafter.\"","Prometheum represents a high-stakes test case in U.S. crypto. It's the first firm to attempt to go through all the U.S. Securities and Exchange Commission's compliance hurdles to set itself up as a special-purpose broker-dealer and crypto custodian through the Financial Industry Regulatory Authority. And next quarter, Prometheum's executives said they intend to open the doors of their alternative trading system – a kind of U.S. trading venue that is similar to a full-fledged exchange but with fewer compliance requirements.","At that point, the company will either be proving the claims of its executives that crypto can be handled in the U.S. in a way that appeases the securities watchdog, or proving the naysayers who argue that it's impossible to meet the SEC's expectations. The stakes aren't just high for Prometheum and the rest of the industry, but also for the government agency that has claimed for years that there's a proper way for crypto firms to \"come in and register\" to do business in the U.S.; Prometheum came in and registered but what happens next is unclear. And while it tests these murky waters, it may also help establish whether the SEC intends to view ETH as a security.","Prometheum's choice of ETH as its opening asset could come with its own complications. Unlike bitcoin (BTC), which the SEC has openly declared isn't a security and is therefore none of the agency's business, the commission has been more coy about whether ETH is among the digital tokens that should be considered securities that fall under its jurisdiction. Its sister agency, the Commodity Futures Trading Commission, hasn't been so shy about declaring that ETH is definitely a commodity.","Prometheum is registered to custody crypto securities and isn't in the commodities business. Ben Kaplan said the firm will go with whatever the SEC's word is on ETH.","\"The CFTC is not our regulator,\" he said. \"When the SEC says to us, 'It's not a security,' then we'll be troubled.\"","The startup, which Aaron Kaplan has said has about 50 employees, is seeing \"immense interest\" in its service as a so-called \"qualified custodian,\" though it hasn't yet confirmed any institutional names that may do business there. It intends to service asset managers, hedge funds, investment advisers, banks and other financial institutions.","\"A lot of people got burned in 2022,\" he said, referring to the turmoil involving the under-regulated U.S. industry.","Prometheum may get a tremendous shot in the arm if the SEC follows through with a rule it proposed to require registered investment advisers only be allowed to park their customers' crypto assets with qualified custodians. That list typically includes registered broker-dealers and banks, but SEC Chair Gary Gensler has argued it probably doesn't include today's major crypto exchanges. The rule is on the agency's public agenda to be finalized by April, though such agendas often prove overly ambitious.","Whether the SEC finishes the rule or not, Aaron Kaplan contended that traditional financial firms will want to deal with a service that's properly registered and \"speaking the same compliance language.\"","He argued that the company could also benefit from the trend toward asset tokenization, because that practice needs a firm that can trade, clear and settle in one place.","The outcome of Prometheum's business plan and whether the SEC stays silent or attempts to intervene isn't the only uncertainty facing the firm. As with the rest of the sector, its future could be steered by ongoing court cases that promise answers on how crypto securities will be defined.","If courts side with the recent Coinbase arguments in its case with the SEC that cryptocurrencies traded on a secondary market don't carry explicit contracts and aren't securities, such a decision could affect the universe of securities Prometheum can host on its platform.","Read More: Prometheum Earns Final Regulatory Nod to Try Hand at Fully-Compliant Crypto","Edited by Nick Baker."],"entity":[{"type":"Aaron","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Financial Industry Regulatory Authority","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"next quarter","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Prometheum","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Prometheum Earns Final Regulatory Nod","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Benjamin Kaplan","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Compliant Crypto","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Aaron Kaplan","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Prometheum Inc.","content":"ORGANIZATION"},{"type":"Ben Kaplan","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"the U.S.","content":"LOCATION"}],"hashtag":["Regulations","Prometheum","ETH","Ethereum","broker-dealer","Securities and Exchange Commission","Custody"],"authors":["Jesse Hamilton"]}