{"summary":"Freeman is facing eight counts related to tax evasion and operating an unlicensed money transmitting business.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/12\/07\/early-bitcoin-pioneer-ian-freeman-goes-to-trial-in-new-hampshire\/","publishDate":"2022-12-07T03:10:07","id":15094,"type":null,"title":"Early Bitcoin Pioneer Ian Freeman Goes to Trial in New Hampshire","category":["Policy"],"content":["CONCORD, New Hampshire — Federal prosecutors say early bitcoin pioneer and Libertarian activist Ian Freeman and a group of his associates helped scammers and other criminals launder more than $10 million using bitcoin through a network of bitcoin vending machines and in-person and virtual cash-for-bitcoin trades from 2016 until their arrests in 2021.","Freeman is standing trial in New Hampshire this week to face federal charges related to tax evasion and the operation of an unlicensed money transmitting business.","Freeman and a group of his associates – who have collectively been dubbed the “Crypto 6” – were arrested in a raid in March 2021.","Four of the Crypto 6, including Freeman’s fellow radio host Aria DiMezzo, his former girlfriend Renee Spinella and her husband Andrew Spinella, and Nobody (formerly Richard Paul) have taken plea deals. Though DiMezzo is not set to be sentenced until later this month, the other three defendants escaped with relatively lenient sentences, avoiding jail time. Another, Colleen Fordham, had all charges against her dropped.","But Freeman – the host of the \"Free Talk Live\" radio show and a one-time member of the Libertarian migration movement, the Free State Project – has maintained his innocence and has described the charges against him as politically motivated and the trial as a “sham.”","Freeman’s trial comes approximately a year and a half after his residence was raided in the middle of the night by the Federal Bureau of Investigation (FBI).","In March 2021, gun-wielding agents surrounded the Keene, New Hampshire, home, crashing through a first-floor window with an armored car. They seized property from the residence, including $180,000 in cash, coins and bars made of precious metals, and two physical Casascius bitcoins worth a combined 101 bitcoins. Agents also seized several bitcoin kiosks owned by Freeman from restaurants and other local businesses.","During their opening statements on Tuesday, prosecutors told the New Hampshire jury that Freeman was the ringleader of the illegal crypto selling business.","They said that Freeman began by installing several bitcoin kiosks (which have been described as distinct from bitcoin ATMs due to their local wallets) throughout the state of New Hampshire, and then eventually branched out into advertising for in-person and virtual cash-for-bitcoins trades on websites like localbitcoins.com.","Freeman didn’t ask a lot of questions of his customers, prosecutors told the jury, but charged his customers a premium (usually between 10% and 15%) for their privacy.","Assistant U.S. Attorney Georgiana MacDonald described Freeman’s “golden rule” of telling his customers that “what you do with your bitcoin is your business” and not to give him more information.","MacDonald said that Freeman’s bank accounts were often shut down, which is why he enlisted the help of his friends and colleagues, whom he asked to help him by opening bank accounts – sometimes in their own names, but also by forming religious entities.","Prosecutors say that DiMezzo (who described herself as a “transsexual Satanist anarchist” while running as the Republican candidate for Cheshire County sheriff in 2020) opened an account for the Reformed Satanic Church, and Nobody opened another for the so-called Church of the Invisible Hand.","MacDonald described the churches (of which a multitude are involved in Freeman’s operation, including the Shire Free Church, the entity that owns \"Free Talk Radio\") as “little more than letterhead” for Freeman’s operation.","Customers of Freeman’s virtual cash-for-bitcoins business (whom prosecutors say include scammers preying on the elderly with romance scams or “Nigerian prince” scams) were allegedly directed to send money to one of the bank accounts associated with the Crypto 6, using descriptions like “purchase of rare coins” or to avoid flagging the attention of the banks.","When Freeman’s lawyer, Mark Sisti, addressed the jury during his opening statements on Tuesday, he told them that what they’d heard from MacDonald was “absolute nonsense” and accused the government of intentionally leaving out details that did not benefit their case against Freeman.","“Just because it's the federal government, and just because it is an Assistant U.S. Attorney saying it, doesn’t make it true,” Sisti told the jury. “Just because it’s an FBI investigation doesn’t make it credible.”","Sisti described Freeman as a gentle, non-violent man who helped victims of scams rather than perpetrating them, and had even helped with crypto-related investigations. The churches implicated in his operation were real institutions, Sisti argued, which had done things like set up an orphanage in Uganda and helped local businesses in New Hampshire set up bitcoin payment systems.","Freeman, Sisti said, operated his business in the open and kept records of his transactions (including pictures of his customers’ drivers licenses) on his computer.","“Why would you hold onto [licenses and pictures] if you’re scamming? You’d ditch that junk as quick as you could,” Sisti told the jury. “It makes no sense.”","Sisti said Freeman often declined to do business with suspicious customers, including an undercover agent who claimed to be a heroin dealer. Sisti said the agent put $20,000 in one of Freeman’s bitcoin kiosks even after Freeman told him he wouldn’t do business with him in person as he’d requested.","“[MacDonald] told you he said no before this clown went to a vending machine – without Freeman’s permission by the way – and dumped $20,000,” Sisti said. “What’s he supposed to do, put an armed guard in front of his vending machine?”","Sisti also pushed back against MacDonald’s assertions that Freeman ignored “red flags” in his customers and looked the other way when dealing with scammers. He referenced the case of one potential witness, a 76-year-old woman who, over six days, transferred her entire life savings – $755,000 – to a romance scammer who then allegedly traded the cash for bitcoins via Freeman, who charged a 10% fee.","What bank did the “little old lady” use, Sisti wondered aloud to the jury, that was “so highly regulated” yet missed the classic red flags of her pulling out enormous sums of money in less than a week?","“Show me that bank president,” Sisti said. “Because that guy should be sitting next to me [instead of Freeman].”","In addition to the unlicensed money transmitting business charges and two counts of money laundering (one that applies to his entire operation and one for allegedly selling bitcoin to an undercover FBI agent posing as a drug dealer), Freeman also faces four counts of tax evasion.","“Ian Freeman just doesn’t like to pay taxes,” MacDonald said.","Freeman would probably agree with her statement. Though he’s only being charged for attempting to evade taxes from 2016 to 2019, Freeman told New York Magazine last year that he hasn’t paid federal income tax since 2004.","He’s not alone. Libertarians, as a general rule, oppose federal taxes, and the phrase “taxation is theft” has become something of a political meme for many.","One trial attendee, who introduced himself pseudonymously as “Bear” (“You know, like the right to bear arms?” he explained), told CoinDesk outside the Concord courthouse that he does not pay federal income taxes and, based on the wording of the U.S. Constitution, does not believe anyone besides government employees are subject to taxes.","The question of how to get around taxes is a common one in libertarian circles, and bitcoin – at least in its salad days, before the development of sophisticated blockchain analytics and high-profile arrests of crypto criminals – was touted as a potential solution.","Read more: How Tax Protesters Set Off the Bitcoin Revolution","Many major figures in crypto, from ShapeShift founder Erik Voorhees to Ethereum creator Vitalik Buterin, were inspired by the libertarian use-case for cryptocurrency – but times are changing.","As the industry has matured and grown it has attracted the attention of both mainstream investors and regulators, and has subsequently undergone a makeover. “New” crypto is (at least in appearance) regulated and polished, and many industry leaders like Coinbase CEO Brian Armstrong work hand in glove with the U.S. government.","Bitcoin-as-currency is increasingly uncommon, as is intentionally picking fights with regulators, making Freeman and those like him feel like relics of bitcoin’s crypto-anarchist past.","Though they have been largely sidelined by the current iteration of the industry, crypto libertarians like Freeman are still active, especially in libertarian strongholds such as Keene, where \"Free Talk Radio\" is headquartered.","Many came out to Concord to show support for Freeman on the first day of his trial. Observers in bitcoin T-shirts peppered the courtroom benches, and an overflow room had to be set up for attendees after lunch.","“I’ve never seen the courtroom like that,” one security officer told CoinDesk, referencing the number of attendees.","Protesters also gathered in front of the courthouse. One man, wearing a custom-made bitcoin mascot costume, told CoinDesk he’d paid a quarter of a bitcoin to have a seamstress make it for the inevitable trial when the Crypto 6 were arrested in 2021. He said he and his husband had made the 29-hour drive from Denver, Colorado, to attend the trial.","Freeman’s trial, which began Tuesday, is slated to last approximately three weeks, with both sides listing dozens of potential witnesses.","Renee Spinella, Freeman’s former girlfriend and alleged accomplice, is expected to testify against him.","Though prosecutors dropped 17 of the initial 25 felony charges against Freeman ahead of the trial, the eight remaining counts carry a weighty 70-year maximum penalty if Freeman is found guilty."],"entity":[{"type":"New York Magazine","content":"ORGANIZATION"},{"type":"2016","content":"DATE"},{"type":"Georgiana MacDonald","content":"PERSON"},{"type":"Keene","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Invisible Hand","content":"ORGANIZATION"},{"type":"Shire Free Church","content":"ORGANIZATION"},{"type":"Aria DiMezzo","content":"PERSON"},{"type":"Keene","content":"PERSON"},{"type":"Free State Project –","content":"ORGANIZATION"},{"type":"Andrew Spinella","content":"PERSON"},{"type":"Colleen Fordham","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"Concord","content":"LOCATION"},{"type":"$20,000","content":"MONEY"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"Denver","content":"LOCATION"},{"type":"Freeman","content":"PERSON"},{"type":"$180,000","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Richard Paul)","content":"PERSON"},{"type":"New Hampshire","content":"LOCATION"},{"type":"MacDonald","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"CONCORD","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Ian Freeman","content":"PERSON"},{"type":"Sisti","content":"PERSON"},{"type":"2004","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Cheshire County","content":"LOCATION"},{"type":"Federal Bureau of Investigation (FBI","content":"ORGANIZATION"},{"type":"Uganda","content":"LOCATION"},{"type":"Reformed Satanic Church","content":"ORGANIZATION"},{"type":"Erik Voorhees","content":"PERSON"},{"type":"FBI","content":"ORGANIZATION"},{"type":"$755,000","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March 2021","content":"DATE"},{"type":"Freeman","content":"ORGANIZATION"},{"type":"Colorado","content":"LOCATION"},{"type":"Mark Sisti","content":"PERSON"},{"type":"MacDonald","content":"PERSON"},{"type":"Renee Spinella","content":"PERSON"},{"type":"2020","content":"DATE"}],"hashtag":["Regulations","New Hampshire","Libertarian","Tax Evasion"],"authors":["Cheyenne Ligon"]}