{"summary":"Some professional traders have termed SLERF a \"blue-chip meme” – a nod to blue-chip stocks – for reasons ranging from its fair distribution among holders to perceived future demand.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/19\/solana-meme-coin-slerf-clocks-higher-trading-volume-than-all-of-ethereum\/","publishDate":"2024-03-19T11:23:22","id":15098,"type":null,"title":"Solana Meme Coin Slerf Clocks Higher Trading Volume Than All of Ethereum","category":["Markets"],"content":["A Solana-based token that’s been live for little more than a day has clocked up more trading volume than all decentralized exchanges on the Ethereum blockchain in a sign of how frenzied the demand is for meme coins.","Slerf, a sloth-themed token issued in Asian morning hours on Monday, posted trading volume of more than $2.7 billion in the past 24 hours, data from DEXScreener shows. These volume encompasses 800,000 trades from 130,000 individual traders, additional metrics for the SLERF\/USD pair show.","More than $1.7 billion in trades were routed through the Solana-based exchange Raydium, CoinGecko data shows.","In contrast, exchange applications on Ethereum processed $2.3 billion in cumulative volume, DefiLlama data shows. This is the total count of any transaction settled on the blockchain, such as those from trading, lending, and borrowing applications.","SLERF came into existence following a token presale, during which it raised $10 million from users. It quickly went viral on social platform X after its developer said they accidentally sent all the money raised to a burn address, a crypto wallet address that’s not controlled by anyone, thus losing access to the funds.","That did nothing to stop a frenzied market from purchasing and trading the tokens. SLERF was eventually floated on Solana-based exchanges including Jupiter and Orca and the price surged to as high as $1.4 within a few hours from an initial value near 3 cents.","Some professional traders have termed SLERF a “blue-chip meme” – a nod to blue-chip stocks – for reasons ranging from its fair distribution among holders to perceived future demand. A blue-chip stock is a sign of stability and quality at the corporate level and usually relates to a company that has a long history.","Meanwhile, SLERF developers are trying to make their presale participants whole by requesting donations from the Solana community. Crypto exchanges such as HTX and Bitget have already committed to the effort by pledging SLERF trading fees to a donation address.","Over $450,000 in donations had been raised as of European morning hours on Tuesday, address trackers show.","Edited by Sheldon Reback."],"entity":[{"type":"$1.4 within","content":"MONEY"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"3 cents","content":"MONEY"},{"type":"$2.3 billion","content":"MONEY"},{"type":"$450,000","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"Jupiter","content":"ORGANIZATION"},{"type":"HTX","content":"ORGANIZATION"},{"type":"$2.7 billion","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$1.7 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"}],"hashtag":["meme coin","Trading Volume"],"authors":["Shaurya Malwa"]}