{"summary":"Robin Vince said the lender won't be as aggressive as other banks have been in trying to gain crypto deposits.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/04\/18\/bny-mellon-ceo-says-bank-is-going-incredibly-slow-on-crypto-products\/","publishDate":"2023-04-18T17:11:59","id":15097,"type":null,"title":"BNY Mellon CEO Says the Bank Is Going 'Incredibly Slow' on Crypto","category":["Finance"],"content":["Bank of New York Mellon (BK) doesn’t consider itself a crypto bank and will continue to move slowly investing in the sector, management said during the company's first-quarter earnings call on Tuesday.","“We’ve said all along, we’re going to be incredibly slow accrual before we run on digital assets broadly and crypto,” CEO Robin Vince said.","When asked about BNY Mellon being an attractive place for crypto deposits, Vince disagreed. He noted that other firms that previously made crypto part of their business model have generated “a ton of cash” with that business but that BNY Mellon has no plans to follow suit.","“We have a variety of clients,” he said. “We have some clients who touch the digital-assets ecosystem, but that's not been a business strategy of ours to grow that aggressively.”","In February, BNY Mellon promoted Caroline Butler to CEO of the digital-assets unit it started last October.","Earlier Tuesday, BNY Mellon reported that its earnings and revenue rose in the first quarter thanks to higher revenue from interest. Its shares were recently trading at $10.33, down 6 cents.","Edited by Stephen Alpher and Mark Nacinovich."],"entity":[{"type":"Vince","content":"PERSON"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"the first quarter","content":"DATE"},{"type":"Bank of New York Mellon","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Robin Vince","content":"PERSON"},{"type":"Caroline Butler","content":"PERSON"},{"type":"BNY Mellon","content":"ORGANIZATION"},{"type":"6 cents","content":"MONEY"},{"type":"Tuesday","content":"DATE"},{"type":"$10.33","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"Mark Nacinovich","content":"PERSON"}],"hashtag":["BNY Mellon","Wall Street","Banking","Earnings","Crypto"],"authors":["Helene Braun"]}