{"summary":"Ronit Ghose says increasing use blockchain technology will be driven by digital financial instruments.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/04\/05\/citi-analyst-cbdcs-will-be-a-trojan-horse-for-blockchain-adoption\/","publishDate":"2023-04-05T16:29:27","id":15095,"type":null,"title":"Citi Analyst: CBDCs Will Be a ‘Trojan Horse’ for Blockchain Adoption","category":["Technology"],"content":["Central bank digital currencies (CBDC) will be the driving force behind getting more people to use blockchain, Ronit Ghose, future of finance global head at Citi, told CoinDesk TV.","In Citi's latest “Money, Tokens, and Games” report, the banking giant said the crypto industry is reaching an inflection point where blockchain's potential will be seen and measured in “billions of users” coupled with “trillions of dollars in value.”","That, however, could hinge on whether the use of CBDCs globally becomes a reality. By 2030, according to the Citi report, up to $5 trillion worth of CBDCs could be circulating in major economies across the world, half of which would be tied to distributed ledger technology.","“CBDCs will be a Trojan horse,” Ghose told CoinDesk TV’s “First Mover” on Wednesday, referring to how using the digital currency will get more people comfortable using blockchain. The original, wooden Trojan horse was used by the Greeks to breach the defenses of the city of Troy during the Trojan War.","Ghose said CBDCs will push “the adoption in financial services of tokenized assets [and] tokenized money.”","The use of CBDCs is likely to vary by region and use cases, said Ghose. China, for instance, is a country likely to take a more centralized approach in its use of a CBDC.","Still, Ghose said, blockchain technology “has a real value when you’re looking at fragmented systems” and some countries, such as India, could benefit from cross-border CBDCs.","Ghose predicts the three drivers for blockchain technology will be CBDCs, securities and tokenized assets in gaming.","“That's what's going to drive the growth of blockchain adoption in the next three to five years,” he said.","Adoption of blockchain will be helped greatly by what users already know – digital wallets, such as Apple Pay, according to Ghose.","Gaming will also be a serious catalyst for the technology, Ghose said. He expects blockchain-based gaming tokens will “take off in the next two or three years.”","Read more: UAE Unveils CBDC Strategy, First Phase to Be Completed by Mid-2024","Edited by Lawrence Lewitinn."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"$5 trillion","content":"MONEY"},{"type":"CoinDesk TV","content":"ORGANIZATION"},{"type":"Ronit Ghose","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"Ghose","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"First Phase","content":"ORGANIZATION"},{"type":"Lawrence Lewitinn","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Citi","content":"ORGANIZATION"},{"type":"UAE","content":"ORGANIZATION"}],"hashtag":["Citibank","ronit ghose","CoinDesk TV","CBDCs","Securities","Tokens"],"authors":["Fran Velasquez"]}