{"summary":"Banks and credit unions are raising concerns over part of the stablecoin legislation due for consideration in a U.S. House of Representatives committee this week.","author":["Colin Wilhelm","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/241353\/bank-objections-over-state-provision-could-complicate-stablecoin-bill","publishDate":"2023-07-25T14:19:09","id":1509,"type":null,"title":"Bank objections over state provision could complicate stablecoin bill","category":["Policy"],"content":["A portion of the <a href=\"https:\/\/www.theblock.co\/post\/240077\/senior-house-republican-democrat-talk-up-need-for-stablecoins-law\" data-v-f87c67ca=\"\">stablecoin bill<\/a> due for consideration in the U.S. House of Representatives later this week has drawn concern from major trade associations representing the vast majority of U.S. financial institutions.","In two letters sent last week, both co-signed by the American Bankers Association, industry associations representing banks and credit unions took issue with part of the comprehensive regulatory framework for stablecoins that the House Financial Services Committee will debate and vote on Thursday.","Part of the bill, as currently written, would allow for state financial regulators to approve stablecoin issuance, an outcome that's sparked concern from the ABA, the Consumer Bankers Association and Credit Union National Association. In a separate letter organized by the ABA, 49 state banking associations, as well as bankers from the U.S. territory of Puerto Rico, also raised similar concerns.","“To ensure effective consumer protection and financial stability, it is critical that the stablecoin ecosystem, like the banking ecosystem, is subject to strong regulatory oversight,” the ABA and state bankers associations <a href=\"https:\/\/www.aba.com\/-\/media\/documents\/letters-to-congress-and-regulators\/072123-joint-aba-state-association-stablecoin-letter.pdf?rev=0d4c86ba7a8c47c8b7fe7ad8e171a4c8\" data-v-f87c67ca=\"\">wrote<\/a>. The associations added that they want “the same level of Federal oversight to state-licensed stablecoin issuers as is currently applied to state-chartered banks.”","Likewise, the ABA, CBA, and CUNA raised concerns over increased “arbitrage” and “systemic risk” about the state regulatory approval approach within the bill, and called for stablecoin issuers to be subject to the same federal oversight that banks and credit unions receive.","“Given these entities' intent to create new money, we believe they should be subject to at least the same form of supervision from a federal regulator as are state-chartered banks and credit unions,” the trio of national associations <a href=\"https:\/\/www.aba.com\/-\/media\/documents\/letters-to-congress-and-regulators\/07192023-joint-trade-stablecoin-letter.pdf?rev=f7b2a0cf71ca4e9798281983c0570b7c\" data-v-f87c67ca=\"\">wrote<\/a>. “The draft legislation, however, imposes critical limits on the role of a federal regulator to approve and supervise state-licensed payment stablecoin issuers and creates a regulatory arbitrage opportunity for nonbank entities to shop for the ‘best’ regulatory regime by state. Further, it is unlikely that states are prepared to regulate stablecoins on their own, especially given stablecoin issuers’ capacity to quickly scale into global stablecoins that facilitate international payments.”","The national trade associations asserted that stablecoins have “clear monetary policy implications” and call for “federal oversight that ensures financial stability and consumer protection.”","The groups also called on the stablecoin bill to include language mandating examinations by regulators and third-party audits of reserves that go beyond current asset reporting requirements within the bill, to ensure that stablecoin issuers have the assets they claim they do to fully back the fiat-denominated tokens they issue.","The national associations letter also called for an explicit ban, or at least limitations, on the ability of a commercial company to own or control a payment stablecoin issuer, similar to existing separations between commercial and banking companies in the U.S.","“These restrictions are critical to protect consumers from potential self-dealing or conflicts of interest,” the groups wrote.","Industry opposition could sway Democrats, and possibly Republicans, from supporting the House Republican-drafted bill, which is the product of bipartisan negotiations stretching back to last summer.","Several Democrats on the Financial Services Committee, including the panel’s most senior Democrat, Rep. Maxine Waters, D-Calif., have raised concerns over allowing too much leeway around the state approval of stablecoins. But the stablecoins bill is currently seen as having a greater chance of bipartisan support, and as a result passage into law, than a separate bill co-drafted by the Financial Services and Agriculture Committees that would create new, crypto-specific market regulation.","Early Tuesday morning, House Financial Services Committee Chair Patrick McHenry, R-N.C., pushed back scheduled committee debate over the stablecoins bill to Thursday, while the committee will still consider the market structure legislation on Wednesday."],"hashtag":["BUSD","CONGRESS","FDIC","FEDERAL RESERVE","HOUSE FINANCIAL SERVICES COMMITTEE","OCC","TETHER","USDC","USDP"]}