{"summary":"The FIX Protocol has added support for the Digital Token Identifier (DTI) to simplify and standardize communication for trading digital assets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/04\/24\/cryptos-path-to-wall-street-could-get-easier-with-new-plumbing\/","publishDate":"2023-04-24T06:30:00","id":15092,"type":null,"title":"Crypto’s Path to Wall Street Could Get Easier With New Plumbing","category":["Markets"],"content":["A key piece of plumbing in conventional markets is getting enhanced in a way that could make it easier for stalwarts of traditional finance (TradFi) to trade crypto.","The Financial Information eXchange Protocol (FIX) – a common language that modern trading systems (investors’ machines, exchange computers and the like) use to speak with each other – has added greater support for cryptocurrencies and other digital assets. It’s done so by adopting the Digital Token Identifier (DTI) ISO standard, according to a Monday press release.","Stocks, bonds and other older financial instruments around the globe already use various standardized ID codes – a way to make it simpler to find and trade them and one of the trappings Wall Street types expect when navigating markets. So the emergence of DTI is a way to make crypto more palatable for TradFi. Meanwhile, FIX is what conveys trades throughout TradFi.","“Adding the DTI standard to the FIX Protocol was an easy decision as the DTI extends the existing functionality to the world of digital assets, which helps the market evolve to work with this asset class,” Jim Kaye, executive director at FIX, said in the press release. “We can see many benefits of adding the DTI, including making it easier for the industry to audit their transactions and increase transparency, thereby bringing more efficiencies to the market.”","The press release noted that DTI can be used by regulators to monitor digital trades for anti-money laundering and monitoring risk in trading, too.","Over 1,300 DTIs have been issued already, according to the press release. This includes private ledgers and tokenized assets.","Edited by Nick Baker."],"entity":[{"type":"DTI","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Digital Token Identifier (DTI","content":"ORGANIZATION"},{"type":"ISO","content":"ORGANIZATION"},{"type":"Jim Kaye","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Wall Street","Trading","TradFi","Protocols"],"authors":["Lyllah Ledesma"]}