{"summary":"Zhu is expected to be released from jail this month for good behavior, Bloomberg reported.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/12\/13\/three-arrows-co-founder-su-zhu-faces-questioning-in-singapore-court-in-hunt-for-assets-bloomberg\/","publishDate":"2023-12-13T11:29:24","id":15108,"type":null,"title":"Three Arrows Co-Founder Su Zhu Faces Questioning in Singapore Court in Hunt for Assets: Bloomberg","category":["Policy"],"content":["Su Zhu, a co-founder of failed crypto hedge fund Three Arrows Capital (3AC), faced questions in a Singapore court for the first time as liquidators sought information to help retrieve assets, Bloomberg reported on Wednesday.","The two-day court hearing required Zhu to respond to lawyers for liquidator Teneo with details on how the fund failed and the whereabouts of the assets, people familiar with the matter told Bloomberg. The people wished to remain anonymous because the proceedings were private, the report said.","The questioning was approved after Zhu was arrested in September after failing to help wind up 3AC. Zhu, jailed for four months, is expected to be released this month for good behavior, Bloomberg reported.","Three Arrows Capital filed for Chapter 15 bankruptcy in July last year after suffering losses following the collapse of stablecoin issuer Terra. In June, it was reported that liquidators had been seeking $1.3 billion from the bankrupt fund's co-founders.","Teneo did not respond to CoinDesk's request for comment. Su Zhu declined to comment via Telegram.","Ian Allison contributed to reporting.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"Teneo","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"$1.3 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Ian Allison","content":"PERSON"},{"type":"July last year","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Zhu","content":"PERSON"}],"hashtag":["Regulations","Crypto","Three Arrows Capital","Su Zhu","Liquidations","Singapore"],"authors":["Camomile Shumba"]}