{"summary":"The company said Monday it plans to register its controversial high-yield interest account.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/02\/14\/blockfi-moves-to-register-securities-product-with-sec\/","publishDate":"2022-02-14T16:11:21","id":15104,"type":null,"title":"BlockFi Moves to Register Lending Product With SEC","category":["Finance"],"content":["BlockFi will register its high-yield crypto lending product with the U.S. Securities and Exchange Commission (SEC) as part of a $100 million settlement over the controversial offering.","The crypto lender said Monday it intends to confidentially file a draft registration statement with the SEC for a new crypto lending product called BlockFi Yield. Doing so would be the first formal step in a bureaucratic slog toward offering a registered securities product to the public.","The S-1 announcement came in tandem with official confirmation of BlockFi’s $100 million fine. BlockFi will pay the SEC $50 million and an additional $50 million to 32 states to settle allegations that its flagship BlockFi Interest Account (BIA) was an unregistered security.","Read more: BlockFi Will Pay $100M in Settlement With SEC, State Regulators Over High-Yield Accounts: Report","BlockFi cooperated with the government’s investigation and implemented remediation actions, according to an SEC press release. Both the SEC and state-level agreements contain no admission or denial of wrongdoing or liability.","“This is the first case of its kind with respect to crypto lending platforms,” SEC Chair Gary Gensler said in a statement. “Today’s settlement makes clear that crypto markets must comply with time-tested securities laws.”","Existing BIA clients in the U.S. will continue to receive interest payments but cannot add more crypto to their accounts as of today, the company said in a statement. Those accounts will automatically roll over into BlockFi Yield once the registration process is complete.","CORRECTION (Feb. 14, 16:20 UTC): Removes mention of public listing. The S-1 filing is specific to BlockFi Yield, not plans for a stock offering.","UPDATE (Feb. 14, 16:28 UTC): Adds Gensler comment."],"entity":[{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$100M","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Feb. 14","content":"DATE"},{"type":"$50 million","content":"MONEY"},{"type":"BIA","content":"ORGANIZATION"}],"hashtag":["BlockFi"],"authors":["Danny Nelson"]}