{"summary":"Maybe the Securities and Exchange Commission can finally convince Hex and PulseChain devotees that they’ve been cheated.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/08\/02\/why-i-dont-feel-bad-for-hex-founder-richard-hearts-victims\/","publishDate":"2023-08-02T17:36:23","id":15109,"type":null,"title":"Why I Don’t Feel Bad for HEX Founder Richard Heart’s Victims","category":["Consensus Magazine"],"content":["On Monday, July 31, the U.S. Securities and Exchange Commission (SEC) filed a series of civil charges against Richard Heart, born Richard Scheuler, the founder and relentless promoter of the related Hex, PulseChain and PulseX projects. The associated tokens, which have already been disemboweled by the continued dump after the disappointing launch of Pulsechain, dropped another 50% or more on the news.","The charges come after nearly five years of warnings from crypto watchers that these projects were scams – and the SEC agrees, including fraud amongst the allegations against Scheuler. Notably, that makes this a dramatically different situation than Ripple Labs’ legal battle with the SEC. That case is limited to the question of securities violations, which is why it has been seen as an important bellwether for the broader crypto industry.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","But the SEC claims that Richard Heart and his projects are simply frauds. While we haven’t yet seen any criminal charges from the U.S. Department of Justice, those might come later, as they did in the case of Terra founder Do Kwon. Because Richard Heart has clearly been up to no good.","The most scandalous new claim made by the SEC is that Heart and his allies “recycled” investor funds during the initial presale of HEX, the earliest of the three projects, between 2019 and 2020. This recycling was done via the so-called “Hex Flush Address,” which receives various fees from Hex users, and also acted as a holding address for investor funds during the initial HEX sale.","The SEC alleges that Heart and associates moved funds from the Flush Address to a centralized exchange through a series of obscuring transactions. Heart then allegedly sent that money back to the Hex “Contract Address,” disguised as money from new investors.","This means, first, that actual investment in the Hex project was far lower than it appeared. The SEC claims that recycling constituted 94%-97% of supposed investments sent to the contract address. So instead of the equivalent of $678 million worth of ETH, the HEX presale actually attracted roughly $34 million worth of real investor funds.","As the SEC observes, this fund recycling helped Heart lie about the success of the sale, attracting more victims. It also left him in control of an overwhelming majority of HEX tokens.","(Some may note I’m talking about the HEX offering as a “presale.” Another of Heart’s manipulative rhetorical tactics was to describe it instead as a “sacrifice” somehow tied to freedom of speech. He specifically pitched this distinction-without-a-difference to victims as a way to avoid SEC scrutiny. But as the SEC says in the charges, it was simply a misdirection from the fact that the sale likely violated securities law.)","The recycling allegation is revelatory for a second reason. Who controlled the Flush Address has been hotly debated among Richard Heart’s critics, with Heart continually denying that he was the keyholder. But the SEC claims that this was indeed the case, and is what allowed him to fraudulently manipulate the initial offering.","The SEC has understandably attracted the ire of crypto advocates this year, but it’s still worth celebrating when somebody over there shows genuine understanding of how crypto works. The Richard Heart charges show this understanding when the SEC calls out Hex for what amounted to an entirely fake HEX “staking” program.","This is another way that Heart seemingly targeted the naïve. In a real proof-of-stake blockchain, staking an amount of tokens is required to become a block validator, or to delegate to a validator. A validator has responsibilities that can include building and confirming blocks. In many cases, this involves real technical skill and substantial work. But Hex’s “staking” program, the SEC makes clear, was not that.","Instead, staking offered high returns (also paid in HEX) simply for locking up a holders’ HEX for a long period of time. After all, for the first years of its existence, HEX didn’t even have its own chain to secure, so “staking” was a non-sequitur. Instead, as the SEC spells out, “staking” incentives were primarily intended to keep HEX tokens off the market. That is, like most purported “features” of HEX, it was meant to manipulate the token’s price higher – something Heart publicly discussed – rather than to actually accomplish anything technically useful or necessary.","See also: The PulseChain Sideshow Tent Is Collapsing | Opinioin","In short, Hex stakers got ripped off twice. Richard Heart sold them worthless tokens for real money – then convinced them to give the worthless tokens back in exchange for a smaller amount of worthless tokens, distributed over time.","Some stakers were even shaken down by yet a third gleefully exploitative design choice. Hex stakers could actually be penalized for not withdrawing their stake on time, and those penalty fees were among those that went to the Flush Address – that is, secretly, back into Richard Heart’s pocket.","The SEC also notes that the Potemkin staking program’s advertised returns were not derived from fee revenue being generated on the chain. Notably, this was also the fundamental problem with Do Kwon’s Terra chain, which ultimately rested on subsidized and inflated returns through the Anchor Protocol.","That shared penchant for subsidies and money printing point to a broader parallel between Hex and Terra. They both had wildly flawed financial models that were reliant on leverage, lockups and cults of personality – and both were later credibly accused of being explicit frauds. This was one of the points made by the hosts of the “Crypto Critics Corner” podcast during our interview at Consensus: When something seems fishy on the surface, there’s probably even worse stuff going on under the hood.","Richard Heart also repeatedly said that the main goal of the project was to design an asset that only went up in price. Of course, what’s left unsaid here is that it’s not being designed for anything else. One former Hex investor, posting as @scottcbusiness on the Read.Cash platform, summed up the problem better than I possibly could:","“HEX uses a certificate of deposit in the form of staking to achieve a high interest return. This is considered to be the use case and utility of HEX. Considering staking is really a consensus model, I wouldn't really consider it a utility or use case … I don't consider staking itself as a product. For example, I can stake on Hive, but that's not a use case for Hive, the use case is blockchain integrated social media.”","In other words, no matter how much financial engineering you do, a token with no utility will have no actual organic demand and will eventually go to zero.","See also: 6 Kinds of Crypto Scams and How to Avoid Them","This is part of why it’s particularly hard to feel bad for Richard Heart’s victims. While all scams leverage victims’ greed, Heart targeted it like a sniper. His Gucci-draped image and unabashed focus on price meant he collected people who envisioned becoming rich, rather than people who thought critically about the technology or financial models they were buying into.","They’re getting the returns that mindset deserves: investors who bought in after the initial HEX presale have currently lost as much as 99% of their money."],"entity":[{"type":"$34 million","content":"MONEY"},{"type":"Flush Address","content":"ORGANIZATION"},{"type":"Richard Scheuler","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Monday, July 31","content":"DATE"},{"type":"Hex Flush Address","content":"ORGANIZATION"},{"type":"97%","content":"PERCENT"},{"type":"Pulsechain","content":"LOCATION"},{"type":"99%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"94%","content":"PERCENT"},{"type":"6 Kinds of Crypto Scams","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"Richard Heart","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"$678 million","content":"MONEY"},{"type":"2020","content":"DATE"},{"type":"Richard Heart","content":"ORGANIZATION"},{"type":"Crypto Critics Corner","content":"ORGANIZATION"},{"type":"HEX","content":"ORGANIZATION"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":["Opinion","Richard Heart","PulseChain","Hex","Fraud","Securities and Exchange Commission"],"authors":["David Z. Morris"]}