{"summary":"Cryptocurrency is an incredibly broad and diverse field, with a huge array of wholly different assets, making the industry an intimidating one to enter.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/02\/08\/crypto-classification-seeks-to-make-industry-more-welcoming-to-tradfi-participants\/","publishDate":"2023-02-08T13:00:00","id":15106,"type":null,"title":"Crypto Classification Seeks to Make Industry More Welcoming to TradFi Participants","category":["Finance"],"content":["Cryptocurrency data provider CoinGecko and 21.co, the parent firm of investment product provider 21Shares, are rolling out a classification system for crypto assets, the latest in a growing number of efforts to map the taxonomy of the industry and make it more accessible for participants in traditional finance (TradFi).","The Global Crypto Classification Standard, announced Wednesday, categorizes digital assets according to three levels. It joins a classification system called datonomy, constructed by financial services behemoths Goldman Sachs (GS) and MSCI (MSCI) with data provider Coin Metrics, and the Digital Assets Classification Standard (DACS) from CoinDesk Indices that classifies the top 500 digital assets by market capitalization into use case and technology and then into industry and sector.","The core of this trend is an attempt to impose structure on apparent chaos, and help guide conventional investors as they consider stashing money into crypto. There is a huge array of crypto assets, many of which have virtually nothing in common with each other, making the industry an intimidating one to enter.","“It is crucial as there are still many misconceptions regarding crypto from traditional finance institutions,” a 21.co spokesperson told CoinDesk. “The term ‘cryptocurrency,’ widely used, is a misnomer as crypto assets can vary dramatically in nature, both as it relates to the asset (token) itself and the protocol behind it.”","The Global Crypto Classification Standard, for example, categorizes assets on three levels. The first deals with networks and protocols, be they cryptocurrencies (bitcoin, monero, etc), smart contract platforms (for example, Ethereum or Solana), decentralized apps (such as Aave, Uniswap) and so on. The second groups assets by industry and sector, including centralized finance, decentralized finance (DeFi), metaverse, identity and infrastructure. The third level deals identifies the nature of the assets: a cryptocurrency, a native currency of a particular network, a stablecoin, a derivative token, or a governance or utility token, and so on.","In short, the aim is to help companies and investors answer some basic questions about a network or protocol: What does it do? What type of token is associated with it? To what asset class does it belong?","Having the answers helps TradFi firms know what to expect when they enter a new asset class. It allows them to create index-linked products such as exchange-traded funds (ETF), which helps to attract investors who prefer passive rather than active exposure to an asset or basket of assets.","On Tuesday, for example, digital asset management platform HeightZero used CoinDesk Indices’ Large Cap Select Index, which provides a weighted performance of the largest digital assets, to offer crypto exposure to its clients in the financial advisory and wealth management spheres.","Read more: Digital Asset Management Platform HeightZero Taps CoinDesk Indices to Offer Crypto Basket to Financial Advisers","The value such products offer is illustrated by last year’s collapse of crypto exchange FTX and lenders Celsius Network and Voyager Digital. All of those operated as centralized platforms. In contrast, many DeFi lending protocols continued with business as normal, offering an alternative investment opportunity if only it can be identified.","That’s what products such as these are looking to provide.","Read more: How Digital Assets Get Into Investable Indices"],"entity":[{"type":"Global Crypto Classification Standard","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Goldman Sachs (GS","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Digital Assets Classification Standard (DACS","content":"ORGANIZATION"},{"type":"Digital Asset Management Platform HeightZero Taps CoinDesk Indices to Offer Crypto Basket to Financial Advisers","content":"ORGANIZATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Indices","Standards","CoinDesk Indices"],"authors":["Jamie Crawley"]}