{"summary":"The Nakamoto update will decouple block production from Bitcoin itself, solving the problem of network congestion Stacks has had since it launched its mainnet in 2021.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/16\/og-bitcoin-l2-stacks-is-getting-a-major-overhaul\/","publishDate":"2024-04-16T13:34:03","id":15113,"type":null,"title":"OG Bitcoin L2 Stacks Is Getting a Major Overhaul","category":["Technology"],"content":["Amid a rekindling of Bitcoin development fervor, layer-2 network Stacks is looking to reinvent itself. As early as April 16, the major player in the Bitcoin L2 sector will kick off the release of its so-called Nakamoto upgrade, in the works for years – designed to dramatically increase the project's speed.","This article is part of CoinDesk’s “Future of Bitcoin” package published to coincide with the fourth Bitcoin “halving” in April 2024.","It’s a defining moment for the blockchain project that has been in development for nearly half a decade, but officially launched its mainnet in 2021. In short: Stacks is an attempt to scale Bitcoin by creating a dedicated chain for cheaper and faster transactions and Ethereum-like smart contract programmability, but maintains Bitcoin’s strong finality and security powered by miners.","“In a way, [Nakamoto is] sort of fulfilling the original intent of Stacks,” Stacks creator Muneeb Ali said in an interview with CoinDesk, referring to a message Stacks developers encoded into the network’s Genesis block that cited an idea Satoshi Nakamoto had about a universe of blockchain’s that “share” computational power with Bitcoin. “Now that will be possible.”","The upgrade comes at a time of exploding interest in Bitcoin L2s, largely driven by the “Ordinals revolution” that began last year that made it possible to launch a number of never-before-seen tokens – from meme coins to NFT-like “inscriptions” – on a blockchain once thought to be in development hell.","See also: Casey Rodarmor: The Bitcoin Artist","Alongside BTC’s dramatic 50% rise since the launch of spot bitcoin exchange-traded funds (ETFs) in the U.S. in January, Stack’s native token, STX, has risen over 70%. The token has gained over 250% since the launch of the Ordinals Protocol, pushing it into the ranking of the top 30 largest tokens.","The Nakamoto upgrade is a way to decouple Stacks from Bitcoin in one sense while also bringing the two networks closer together.","Like many L2s, Stacks ultimately settles transactions run on its own network directly on the Bitcoin blockchain, meaning that while Stacks transactions were technically faster and cheaper than Bitcoin transactions, they could only be considered irreversible when Bitcoin miners finally add a block to the blockchain (i.e. every 10 minutes).","Nakamoto, which will kick off at Bitcoin block height 840,360, will address this problem of slow settlement speed essentially by introducing a form of parallel processing that allows Stacks miners to produce multiple blocks in between Bitcoin blocks.","This will work due to a modification in Stack’s consensus mechanism, which is a blend of proof-of-stake and mining called “proof-of-transfer.” In essence, instead of burning energy like bitcoin miners, Stacks induces an economic cost to maintaining the blockchain by having Stacks miners buy bitcoin and send it to a predetermined address, which is then distributed to Stacks validators; in return, miners get STX.","After Nakamoto, the network’s validators (called stackers) will still receive BTC for validating blocks and Stacks miners will still receive STX, but the process speeds up. What’s changed is the introduction of “tenures,” or a period of time that individual miners are assigned to produce multiple blocks that then ultimately resolve down to the Bitcoin.","Read More: Bitcoin Halving Has Crypto Miners Racing for 'Epic Sat' Potentially Worth Millions","Nakamoto has more or less been under development since Stacks released its mainnet, after which the network was running at capacity in a matter of months. “Users were complaining that they want to use this thing but the block times are just extremely slow,” Ali, who has a Ph.D. in computer science from Princeton University. “It made it crystal clear.”","By December 2022, Stacks developers had released two white papers proposing network changes: one for Nakamoto and one for a separate upgrade planned for later this year, the “trust minimized” bridge called sBTC to make it easier to port over BTC into the Stacks economy.","See also: Bitcoin First, Not Only | Opinion","In the spirit of decentralization, Ali said, no author names were added to the papers. Upwards of 30 engineers from a number of Stacks related entities contributed to the effort.","The rollout of sBTC will trail Nakamoto by two to three months, according to the current roadmap estimations. And while not as big of a technical overhaul of the Stacks network itself, the ability to bridge over BTC onto Stacks may be an even bigger deal for the network’s economy.","Although smaller both in terms of total value locked and the number of available applications than on chains like Ethereum and Solana, Stack’s decentralized finance (DeFi) economy is arguably the most mature pertaining to Bitcoin. But apart from yield games or decentralized exchanges, Ali said he’s particularly interested in seeing a Stripe-like payments system launch to finally make commercial Bitcoin applications realistically possible, now that people won’t have to wait 10 minutes to know whether their $5 coffee order went through.","“What I'm feeling the most proud of is this may be a massive improvement to Bitcoin UX for normal people,” Ali said. “People want a way to use their BTC.”","See also: Props Shutdown Throws Reg A+ Funding Model Into Limbo","Edited by Bradley Keoun."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Bitcoin First","content":"ORGANIZATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"Bitcoin Halving Has Crypto Miners Racing","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"[Nakamoto","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"$5","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Ali","content":"PERSON"},{"type":"Princeton University","content":"ORGANIZATION"},{"type":"Muneeb Ali","content":"PERSON"},{"type":"STX","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"” Ali","content":"PERSON"},{"type":"250%","content":"PERCENT"},{"type":"December 2022","content":"DATE"},{"type":"April 16","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Stacks","STX","Bitcoin","Bridge","Layer 2s","Scaling Bitcoin","Muneeb Ali"],"authors":["Daniel Kuhn"]}