{"summary":"Literally clipart of rocks, the NFTs are a popular joke on digital art. Now the storied auction house is selling them, they may become even more collectible, says Daniel Kuhn.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/02\/13\/as-etherrocks-hit-sothebys-who-is-laughing-hardest\/","publishDate":"2024-02-13T21:14:26","id":15118,"type":null,"title":"As EtherRocks Hit Sotheby’s, Who Is Laughing Hardest?","category":["Consensus Magazine"],"content":["This Valentines Day, buy your lover a rock. That may just be the marketing angle legendary auction house Sotheby’s is hoping to play up for tomorrow, Feb. 14, when it will begin a sealed auction of EtherRock NFTs.","According to the auction page, the EtherRock collection is a “pivotal” part of NFT history. There’s certainly a case to be made: Launched in 2017 shortly after CryptoPunks, but before the ERC-1155 and ERC-721 token standards (which today support most Ethereum-based NFTs) were around, EtherRocks have remained part of the digital art conversation since they became popular during the last bull market.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","This may be a little surprising given exactly what EtherRocks are: Clipart of a rock. There are only 100 tokens in the series, each tied to a nearly-identical cartoon JPEG image — the only variances being in color and hue from gray to brown (and a few ultra rare in blue). The series is divisive among NFT collectors, some of whom love the absurdity of “Pet Rocks on the blockchain,” as project founders call them, and others who see the concept as a mockery.","To me, EtherRocks represent one of the truest expressions of NFT art, or at least what NFTs have become. When launched, the founders didn’t pretend that EtherRocks were anything more than an early experiment with a new type of blockchain feature. The fact that they were useless was sort of the point: “These virtual rocks serve NO PURPOSE beyond being able to be brought [sic] and sold, and giving you a strong sense of pride in being an owner of 1 of the only 100 collectible rocks :),” the EtherRock website reads.","But today, the conversation around EtherRocks takes on a different tone. Many in the NFT community were extremely annoyed that Sotheby’s decided to shine the spotlight on the series, under the company’s new-ish digital art-focused vertical, Sotheby’s Metaverse. Part of the debate is just around how historic the historic series is — apparently at launch, few people noticed or cared about EtherRocks, unlike CryptoPunks or CryptoKitties which immediately found an audience.","“My take on Sotheby’s EtherRock auction: 1. EtherRocks are old & scarce. Strong narrative. 2. Let people buy & sell what they want if they like the meme. But: 3. Don’t push false narratives like “EtherRocks shaped NFTs.” EtherRocks are a 2021 meme, happened to mint in 2017,” ChainLeftist, a pseudonymous crypto artist and historian, said on social media. It was a point echoed by artist Rob Ness: “I WAS THERE DURING THAT TIME..NOBODY KNEW OR CARED ABOUT THEM ROCKS YO”","After initially saying EtherRocks “played a crucial role in shaping the NFT movement,” Sotheby’s actually changed the language on its site in response to the criticism. While CryptoPunks created the form and format for all 10,000 token cartoon series to follow (from Bored Ape Yacht Club to Pudgy Penguins), it’s hard to say that others have tried to emulate EtherRocks’ model.","From an outsider’s perspective, it seems like a lot of this controversy is simply self-loathing redirected onto a project that exemplifies the worst attributes of NFTs. EtherRocks, for better or worse, are the platonic ideal of contemporary NFTs. Stripped of all the hype around community-building and the future of art, they are what they are — a cartoon image downloaded from the online clipart database goodfreephotos.com, sold to the highest bidder.","In 2021, at peak NFT madness, someone shelled out the equivalent of $1.3 million in ether (ETH) for the reddish-brown EtherRock #42. At the time, the “price floor” for the series was above $1 million, according to @etherrockprice on Twiter\/X, which stopped tracking sales data in 2022, after things fell off. And now that the attention is back on the series due to the auction, prices are seemingly rising again.","On Feb. 12, EtherRock #46 sold for $496,658, though there’s some suspicion it wasn’t a legit sale, given the average sale price beforehand was around $500. It’s not uncommon for inside-parties to collude on NFT sales to bring attention to a project. The record-breaking sale of digital artist Beeple’s “100 Days” mosaic, which put NFTs on the map, was made to a business partner, for instance. Last year, a group of art investors sued Sotheby’s for allegedly colluding with Yuga Labs to inflate the price of Bored Ape NFTs.","I’m not alleging the same game is being played here, but, if it were, it’d be all to fitting.","See also: Why NFT Artists Shouldn't Expect 'Royalties' | Opinion","To be fair, it isn’t just raw greed that drives interest and investment in EtherRocks. Like the Pet Rocks it draws inspiration from, there’s something refreshingly self-aware about the project. Gary Dahl, the advertising pro who had the million-dollar idea to sell stones to Americans, used to joke that pet rocks “required little to no care.” The novelty toys came with a booklet that taught buyers how to get your rock to sit, stay and, with a little help, roll over.","You can't do much more than that with EtherRocks, either — other than speculate. And in that sense, having the imprimatur of Sotheby’s saying “these rocks are important” is a huge boon to collectors. A famed art collector and author told CoinDesk in an email the series is \"legendary.\" Why exactly did the curators choose the project? Because of its vintage? Its artistic statement about capitalism? Because they have a sense of humor?","\n","\n"],"entity":[{"type":"Gary Dahl","content":"PERSON"},{"type":"Sotheby’s","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Valentines Day","content":"ORGANIZATION"},{"type":"$500","content":"MONEY"},{"type":"1155","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"$1.3 million","content":"MONEY"},{"type":"#42","content":"DATE"},{"type":"Rob Ness","content":"PERSON"},{"type":"Feb. 12","content":"DATE"},{"type":"Feb. 14","content":"DATE"},{"type":"Sotheby’s EtherRock","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"EtherRock NFTs","content":"ORGANIZATION"},{"type":"$496,658","content":"MONEY"},{"type":"EtherRock","content":"ORGANIZATION"},{"type":"Bored Ape NFTs","content":"ORGANIZATION"},{"type":"Sotheby’s Metaverse","content":"ORGANIZATION"}],"hashtag":["Opinion","NFTs","The Node","Newsletters","Art","Culture","digital art","Sotheby’s"],"authors":["Daniel Kuhn"]}