{"summary":"Is the halving priced in or not? Will it disrupt the bitcoin mining industry? Or accelerate adoption? Here's what experts and community members are saying about the fourth — and perhaps most anticipated — halving.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/16\/what-bitcoiners-are-saying-about-the-upcoming-bitcoin-halving\/","publishDate":"2024-04-16T17:57:49","id":15110,"type":null,"title":"What Bitcoiners Are Saying About the Upcoming Bitcoin Halving","category":["Consensus Magazine"],"content":["On April 19, or whenever a bitcoin miner mines block number 840,000, the amount of bitcoin (BTC) entering into circulation will halve from about 900 a day to 450. This event, colloquially known as the halving (sometimes halvening), looms large in the Bitcoin mindshare, one of those things that makes Bitcoin Bitcoin. Perhaps because it only comes around on Leap Years (so far), bitcoiners tend to look forward to the halving more than most crypto holidays like Bitcoin Pizza Day or the anniversary of Satoshi Nakamoto publishing the white paper. But it won't be around forever.","This roundup is part of CoinDesk’s “Future of Bitcoin” package.","Once all 21 million bitcoins are mined, the halving will have served its purpose and cease (likely in 2140). Why did Nakamoto make it this way? No one knows. Just like there's no real insight into why he chose a 21 million cap or Jan. 9 as launch day. There are many, many guesstimates that try to make sense of these seemingly arbitrary elements of Bitcoin's design. Because if there's one thing certain about Bitcoin, it's that it tends to split opinions.","And so, with an event as anticipated as the halving there are certainly things to argue over. Is it \"priced in\" (meaning will the reduction in supply of bitcoins entering the market cause a rally)? Will the reduced revenues drive bitcoin miners bankrupt? Will this time be any different?","CoinDesk turned to the crypto community to get their say:","Haseeb Qureshi, managing partner at Dragonfly Capital:","I am a longtime halving nihilist. The halving is *what it means* for bitcoin to be deflationary. It's been priced in since the first time someone bought bitcoin because it has a fixed supply. The timing of the halving has been baked in since Bitcoin was first launched six years ago.","People drawing charts and rainbows and all this nonsense over an event that has deterministically happened four times (on an asset that already goes up almost every single year) is pseudoscientific nonsense. But whatever, it's a good story.","Austin Campbell, assistant professor at Columbia Business School:","As bitcoin gains more of a foothold in traditional finance, events that were drivers of past cycles like the halving will cease to have as much of an impact, if any. Portfolio allocators think in multi-year and multi-decade terms, and the impact of events like the halving will be muted as this market segment grows, just like any market growing from new to mainstream sees volatility due to small idiosyncratic events decrease as liquidity and scale increase.","Azeem Khan, co-founder of Morph:","My personal opinion is the halving is likely priced in. We’ve seen institutional capital inflows for months now since the bitcoin spot ETF was approved. And even before that we were seeing a lot of liquidity enter the market without seeing traditional signs that retail was buying with things like Coinbase being the number one app in the App Store. To me, that indicated it was already institutional money coming in. They’re not dumb and have likely been buying ahead of this. Larry Fink didn’t get to where he is by accident.","My personal philosophy in this space has tended to be that when everyone agrees something is going to happen, it generally doesn’t. Similar to when we had Elon being a clown on SNL pumping $DOGE in 2021 and everyone had agreed it was going to $1, it dumped.","The investing approach I abide by has always been to dollar cost average. Pick an amount you’re willing to lose, set an auto buy for that amount of whichever assets you’ve done your research on, continue to buy over the long term every X period, and never look at the price. If you’re investing with a long term approach in mind, this will help you beat out 99% of the noise you see from gambling addicts, some of which turned out to be the lottery winners of Crypto Twitter when zooming out through the years.","Edan Yago, founder of Sovryn:","Definitely not priced in. Not even close. This is the most important halving since the first. This halving will bring new assets to Bitcoin in the form of Runes and the coming cycle will see Bitcoin Rollups add scalability and programmability to Bitcoin. Bitcoin block space will go from cheap to the scarcest computing resource in the world.","Ogle, founder of Glue:","I think this halving is distinct from prior ones because of the significant increase in capital coming into the market because of the ETF approvals. So you have a reduction of supply because of the halving itself, combined with increased demand from the ETFs — basic economic principles say this should result in a higher price. My guess is the halving has partially been priced in, but I don't think people quite realize the magnitude of buy pressure that is coming in via the ETFs — and that buy pressure is in my view going to significantly impact the price of BTC upward.","Uncle Rockstar Developer, core contributor to BTCPay:","Given the historical data — 9,575% increase post-2012, 3,233% post-2016, and 667% post-2020 — it's not a question of if the BTC\/USD price will rise after this halving, but rather by how much. Feel free to quote me on that.","Ed Hindi, chief investment officer at Tyr Capital:","Bitcoin remains a viable doomsday asset in 2024, as its correlation to gold recently increased, and investors continue to diversify away from traditional financial assets. The ETF is currently spearheading this doomsday rally and we should expect $120,000 to be hit in the coming months as global geopolitics continues to deteriorate and the middle classes continue to find ways to protect their wealth.","We believe that price action ahead and post-halving is going to be different from past events as there are new variables affecting bitcoin. The combination of an uncertain geopolitical situation, choppy U.S. spot ETF flows, record leverage and recalibration of the U.S. Federal Reserve monetary policy is going to create an explosive combo and lead to extremely volatile market conditions. We would not be surprised to see BTC trade as low as $55,000 and as high as $75,000 in the coming couple of weeks. We remain very bullish into year-end though and consider $120,000 to be a realistic target.","Roger Ver, creator of Bitcoin Cash:","Nothing special happened for the last three halvings. I don’t expect this time to be any different.","See also: The Bitcoin Halving Really Is Different This Time","Kadan Stadelmann, chief technology officer of Komodo Platform:","The biggest difference between the 2020 halving and the 2024 halving is skyrocketing institutional demand. Prior to the previous halving, institutions were on the sidelines. The market was dominated by retail investors. Since then, the market dynamic has drastically shifted. As one example, MicroStrategy didn’t make its first BTC purchase until August 2020. As of April 2024, the company reportedly holds 214, 246 BTC (roughly $13.625 billion). Of the 21 million bitcoins that will ever exist, around 12.27% currently belong to publicly traded and private companies, ETFs and countries.","Adam Blumberg, co-founder of Interaxis:","The halving will have likely an impact on the price, as we have greater demand than ever from ETF investors, bitcoin hodlers and even corporations, and we're coupling that with decreasing new supply. We'll also see impact on miners who have tremendous capital and electricity outlays, and will get their production cut in half.","Colin Harper, researcher and writer for Luxor Technology’s Hashrate Index:","This halving could be unprecedented with regards to how it affects Bitcoin's total network hashrate. It's plausible that we see no hashrate come offline after the halving, or that we will see the smallest decrease in network hashrate after any other halving event in Bitcoin's history. Mining margins won't be as good after the halving as they are now, obviously, but they won't be horrendous. And if the new Runes fungible token protocol makes a significant impact on transaction fees, then margins will be healthy enough to keep miners with higher costs online for longer than not.","For comparison, Bitcoin's hash rate declined 15% after the 2020 halving, 5% after 2016's halving, and 13% after 2012.","See also: Why Bitcoin Halving Calculators Are Out of Sync","Joe Downie, chief marketing officer at NiceHash:","This halving is different, we will likely see less volatility than previous ones, for a few reasons: one is that Bitcoin mining is far stronger than it has ever been before in terms of hashrate, another is the level of legitimacy Bitcoin has gotten recently due to institutional funds and ETFs, plus the fact that a lot of people are in “wait and see” mode. This makes for a far more stable basis for BTC to hold its current value and gradually increase over the course of this year. There may be some short term volatility during the following week or two after the halving, but I expect things to stabilize quickly after that.","Troy Cross, professor of philosophy at Reed College:","There are two sides of the halving story: price impact and mining impact. On the price side, I don't have anything to say. The \"supply shock *should* be priced in, but every time I have thought that and every time I've been wrong. I won't pretend to read the collective psyche. With everyone anticipating that everyone else is irrational and *not* pricing it in, who knows what will happen?","I tweeted recently about the U.S. government’s holdings of bitcoin, over 200,000 bitcoins, and much of it Silk Road seizure. In terms of the impact on supply, that's at least as important as the halving event.","But on the mining side, the halving does get me excited.","The halving will force miners to seek out even cheaper power than they already have. Some miners will go under, selling off their equipment to those with more efficient operations.","The breakeven point for profitably running an ASIC will nearly drop in half. Miners will start curtailing more often, particularly their older machines.","What happens next depends on bitcoin's price action, but if prices do not rise dramatically, we will see a dip in hashrate while ASICs find cheaper homes, and then mining will settle into its \"dung beetle\" role, consuming only wasted, stranded energy.","The differences between a cost-sensitive consumer of energy like bitcoin and traditional data centers or AI data centers--or really any other electricity consumer--are already clear, but after the halving, bitcoin's flexibility — shutting down whenever electricity prices rise — and its opportunism, finding pockets of currently-stranded energy, bottlenecked by transmission constraints, will be even more dramatic.","Maria Bustillos, founder of Flaming Hydra, a part of the Brick House co-op:","I just hope this finally, FINALLY gets people reckoning the gigantic difference in environmental costs between PoW and PoS blockchains.","Peter Todd, founder of OpenTimestamps and Bitcoin Core developer:","The halving is one of the dumbest parts of how Bitcoin was designed. If you're going to reduce subsidy over time, the right way to do it is gradually, rather than shocking the system every four years. Fortunately fees are getting higher, so the risk of havings is reducing. Hopefully this one goes alright.","Fortunately fees are getting higher, so the risk of havings is reducing. Hopefully this one goes alright.","Zooko Wilcox, founder of Zcash:","I’m interested in the Bitcoin halving because of supply effects. I have come to frankly detest that part of the markets which is independent of fundamentals. You know what I mean: hype, narrative, people buying when they see something go up and selling when they see something go down. The Keynesian Beauty Contest, the Greater Fool Theory. Memecoins. Memestocks. Pump and dumps. Insider trading. Misinformation\/disinformation\/FUD. I was always naturally against such stuff, but my long painful experience in the crypto world has made me hate it.","Bitcoin’s and Zcash’s assured supply limits is the very opposite of that — the thing that no amount of hype or misinformation or mass mania can touch. And it’s interesting to think about the difference between talking about the supply of Bitcoin and Zcash being 21 million, versus talking about it being the ongoing addition to the supply from mining.","Alex Thorn, head of research at Galaxy Digital:","The Bitcoin halving is the programmatic mechanism that creates and enforces bitcoin’s most famous quality: its scarcity. While this fourth halving reduction in new daily issuance from ~900 BTC to ~450 BTC is small in absolute terms and relative to BTC’s daily float of $10-$25 billion, nonetheless prices are set on the margin. But beyond any supply impact – which I believe is marginal – this is the first halving in which major U.S. asset managers are educating on Bitcoin, and there’s no better Bitcoin education than learning about the halving. It’s a narrative event first – a quadrennial market moment – and a supply event second, though I think both aspects will be impactful.","Tatiana Koffman, general partner at Moonwalker Capital and author of the Myth of Money newsletter:","The most significant impact of the Bitcoin halving is its influence on the energy input and mining difficulty of Bitcoin, which inherently supports a higher baseline price for the cryptocurrency.","This phenomenon can be closely likened to gold mining, where the principle of scarcity plays a crucial role. As more gold is extracted, the remaining reserves become increasingly scarce, making it more challenging and costly to find and extract new deposits. This requires more investment in exploration and advanced machinery for mining and processing the gold.","See also: Will the Next Bitcoin Halving Be Another Hype Cycle?","Similarly, Bitcoin's scarcity is engineered through a difficulty adjustment algorithm that halves the mining rewards roughly every four years. This not only reduces the rate at which new Bitcoins are introduced but also adjusts the mining difficulty to maintain a steady rate of block creation, regardless of the total computational power on the network. This mechanism ensures that as Bitcoin becomes scarcer, the effort and cost to mine it increase, supporting its price over time.","The halving mechanism is fundamental to preserving Bitcoin's integrity as a store of value. It underscores the cryptocurrency's deflationary nature, which is critical for its long-term valuation and the security of its network. By intentionally reducing the influx of new Bitcoins, the halving events reinforce Bitcoin's status as a digital equivalent of gold, making it a potentially attractive option for future generations looking for reliable value preservation in the face of inflationary fiat currencies.","Bradley Rettler, philosophy professor at the University of Wyoming:","The bitcoin halving has two purposes. The first is to attract attention, thereby drawing ever more people into the network. The second is to reassure people that the rules are still in charge.","Anil Lulla, co-founder of Delphi Digital:","I think the halving is always just a great marketing event built into Bitcoin every four years. It obviously has an impact on its supply, but more than that it gets everyone to pay attention to the asset and how it works. I think this halving is extra special because of two things (1) The ETF and (2) the Bitcoin Renaissance happening right now. The ETF is straightforward and widely covered, so I’ll focus on (2). Ordinals, Runes and BRC-20s. I don’t think the Bitcoin ecosystem has had this much excitement around it in years. It’s driving a lot of attention, experimentation and innovation to Bitcoin at a time when it’s much needed.","Burak Tamac, adjunct professor at Montclair State University:","The Bitcoin halving reduces barriers to adoption in three key ways:","1. The concept is not only easy to understand, but we need something to contrast when learning new concepts.","2. Comparing the halving to fiat money supply highlights the direct contrast between the two. However, these two factors alone won't drive rapid mass adoption. This is where the third point becomes crucial:","3. It is also very easy to explain. New bitcoiners can quickly understand and convincingly share the concept with others.","What distinguishes this halving is that not only bitcoiners but also major financial institutions have been educating their clients about its importance.","David Zane Morris, editor of the Dark Markets newsletter:","I expect a price rise after the halving, largely thanks to the new ETFs. There are a lot of new investors who are still learning the nuances of Bitcoin, and there is now a very easy way for them to buy into sentiment or narratives. That lack of friction is the truly new factor here, and I expect it to matter.","James Wester, a tech analyst at Javelin Strategy:","This halving is definitely coming at an interesting time as we are still figuring out the effects of the bitcoin ETFs on demand. That makes it harder to determine how much of the halving is effectively priced in. That said, all of the issues that have gotten us here still remain--the ETFs, institutional interest--so it is reasonable to believe that demand will continue to drive the price up in the longer term.","Aubrey Strobel, advisor to Trust Machines, Lolli and Pubkey:","Consider this — in just a span of three or four months, we've witnessed the launch of 11 bitcoin ETFs, with four of them marking the most successful debuts in history. The combined capital in these ETFs has already exceeded 50% of the assets under management (AUM) in gold, a milestone achieved in a fraction of the time it took for gold to reach its current status over 20 years. Now, with only 450 new bitcoins entering the market daily, coupled with significant investments from major asset managers like Fidelity, Blackrock and also Michael Saylor, the demand-supply dynamics are evident. It's simple math to anticipate the trajectory ahead.","Molly White, author the Citation Needed newsletter:","Although responsible investment advisers will often warn that \"past performance is no guarantee of future results\", that's largely the kind of thought process that goes into predictions for the halving. \"Number went up last time, so number go up again\". More sophisticated explainers might delve into supply and demand, suggesting that the gradual closing of the bitcoin faucet amid roughly steady demand is what drives prices higher. Either way, some people are piling into bitcoin in belief of guaranteed double-your-money returns, if not better.","These folks might do well to be a bit more cautious.","See also: How the Bitcoin Halving Could Affect Network Security","Gwern, polymath: Bitcoin has been boring for a long time. I can't think of a single thing about Bitcoin in the past four years I'd actually feel excited to write about. even stuff like Lightning slowly whimpering out should've been old news in 2020.","Bennett Tomlin, head of research at Protos:","The Bitcoin halving serves the important function of reducing the incentives to waste energy on Bitcoin and ensuring that many poorly run bitcoin miners will once again be forced to confront the challenging economics of their businesses.","Bitfinex'ed, Tether critic:","It’s not events that dictate price in crypto, prices in this market are determined by the heads of the market, notably Tether and their co-conspirators.","If you want a quote from an influential person, Giancarlo Devasini, the CFO of Tether.","“Illiquid markets such as bitcoin are easy prey for manipulation”, being as the primary trading pair is Tether and not the U.S. dollar, the prices are whatever he wants them to be.","UPDATE (APRIL 16, 2024): Adds quotes from Maria Bustillos, Aubrey Strobel, James Wester, David Zane Morris and Zooko Wilcox."],"entity":[{"type":"April 2024","content":"DATE"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Myth of Money","content":"ORGANIZATION"},{"type":"Peter Todd","content":"PERSON"},{"type":"Moonwalker Capital","content":"ORGANIZATION"},{"type":"August 2020","content":"DATE"},{"type":"$10","content":"MONEY"},{"type":"BTC","content":"ORGANIZATION"},{"type":"667%","content":"PERCENT"},{"type":"Colin Harper","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"Bitcoin Bitcoin","content":"PERSON"},{"type":"Alex Thorn","content":"PERSON"},{"type":"James Wester","content":"PERSON"},{"type":"$DOGE","content":"MONEY"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Adam Blumberg","content":"PERSON"},{"type":"APRIL 16, 2024","content":"DATE"},{"type":"Bitcoin mindshare","content":"LOCATION"},{"type":"Reed College","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Columbia Business School","content":"ORGANIZATION"},{"type":"Tyr Capital","content":"ORGANIZATION"},{"type":"$120,000","content":"MONEY"},{"type":"University of Wyoming","content":"ORGANIZATION"},{"type":"Luxor","content":"LOCATION"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"Greater Fool Theory","content":"ORGANIZATION"},{"type":"$25 billion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"Zooko Wilcox","content":"PERSON"},{"type":"Montclair State University","content":"ORGANIZATION"},{"type":"SNL","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Maria Bustillos","content":"PERSON"},{"type":"Kadan Stadelmann","content":"PERSON"},{"type":"April 19","content":"DATE"},{"type":"Edan Yago","content":"PERSON"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"Crypto Twitter","content":"ORGANIZATION"},{"type":"2140","content":"DATE"},{"type":"$75,000","content":"MONEY"},{"type":"David Zane Morris","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Hindi","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Giancarlo Devasini","content":"PERSON"},{"type":"Austin Campbell","content":"PERSON"},{"type":"Tatiana Koffman","content":"PERSON"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Nakamoto","content":"PERSON"},{"type":"2012","content":"DATE"},{"type":"Burak Tamac","content":"PERSON"},{"type":"Brick House","content":"ORGANIZATION"},{"type":"Larry Fink","content":"PERSON"},{"type":"Trust Machines","content":"ORGANIZATION"},{"type":"$1","content":"MONEY"},{"type":"USD","content":"ORGANIZATION"},{"type":"Lolli","content":"PERSON"},{"type":"Blackrock","content":"ORGANIZATION"},{"type":"Why Bitcoin Halving Calculators Are Out of Sync","content":"ORGANIZATION"},{"type":"Anil Lulla","content":"PERSON"},{"type":"FUD","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Joe Downie","content":"PERSON"},{"type":"$55,000","content":"MONEY"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"3,233%","content":"PERCENT"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Javelin Strategy","content":"ORGANIZATION"},{"type":"Aubrey Strobel","content":"PERSON"},{"type":"Haseeb Qureshi","content":"PERSON"},{"type":"$13.625 billion","content":"MONEY"},{"type":"Elon","content":"ORGANIZATION"},{"type":"Time","content":"ORGANIZATION"},{"type":"5%","content":"PERCENT"},{"type":"Bitcoin Renaissance","content":"ORGANIZATION"},{"type":"99%","content":"PERCENT"},{"type":"Jan. 9","content":"DATE"},{"type":"Molly White","content":"PERSON"},{"type":"Bitcoin Halving Could Affect Network Security","content":"ORGANIZATION"},{"type":"Bennett Tomlin","content":"PERSON"},{"type":"Azeem Khan","content":"PERSON"},{"type":"9,575%","content":"PERCENT"},{"type":"12.27%","content":"PERCENT"},{"type":"BRC","content":"ORGANIZATION"},{"type":"Troy Cross","content":"PERSON"},{"type":"Roger Ver","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Bitcoin","Bitcoin Mining","Proof-of-Work","Halvings","Halving","Bitcoin Price"],"authors":["Daniel Kuhn"]}