{"summary":"Crypto exchange Coinbase is attempting to add the memecoin Shiba Inu to its Pro exchange for the second time.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/117079\/coinbase-pro-adds-memecoin-shiba-inu-following-on-from-dogecoin","publishDate":"2021-09-09T07:22:19","id":1511,"type":null,"title":"Coinbase Pro adds memecoin Shiba Inu, following on from Dogecoin","category":["EXCHANGES"],"content":["Crypto exchange Coinbase has added shiba inu (SHIB) to its Pro exchange, according to an <a href=\"https:\/\/twitter.com\/CoinbasePro\/status\/1435633218326253578\" data-v-f87c67ca=\"\">announcement<\/a> yesterday. Assuming there’s enough liquidity, trading will go live today at 9AM PT.","Shiba inu is a memecoin based on another memecoin — and one of crypto’s oldest — named dogecoin. It is also themed around the Shiba Inu breed of dog, with a similarly fanatic community.","In 2013, dogecoin was created as a joke — despite Tesla CEO Elon Musk and Shark Tank's Mark Cuban later taking it seriously — with a much higher supply than bitcoin, soon hitting 100 billion coins. Shiba inu took this one step further, with a current supply of 394 trillion tokens and a max supply of 1 quadrillion tokens.","Both coins have been the target of viral campaigns on TikTok and other platforms, with the idea being to <a href=\"https:\/\/twitter.com\/mcuban\/status\/1368276718860046339\" data-v-f87c67ca=\"\">get the coins to $1<\/a>. These videos tend to ignore the large token supplies that make this a much more challenging feat, particularly in the case of shiba inu, which would have a market cap of $1 quadrillion were it to achieve that mark. TikTok <a href=\"https:\/\/cryptoslate.com\/no-mo-dogecoin-or-shiba-inu-how-tiktoks-crypto-ban-helps-the-space\/\" data-v-f87c67ca=\"\">banned<\/a> crypto promotional videos earlier this year for reasons like this.","The other wild aspect about shiba inu is the way in which half of its supply was distributed. Half of the tokens were sent to Ethereum co-founder Vitalik Buterin’s cryptocurrency address, something that the shiba inu website described as “burning” the tokens.&nbsp;","Typically, when it comes to burning a token, the token is sent to an address that nobody controls (known as a burn address). In this case, the thought process was that Buterin wouldn’t move or sell the tokens. An assumption that turned out to be mistaken.","On May 12, Buterin elected to sell half of the shiba inu tokens he was given — along with tokens from other projects that had also sent him half of their supplies — for a total of $60 million. He then <a href=\"https:\/\/www.theblockcrypto.com\/post\/104676\/vitalik-buterin-donates-more-than-60m-to-charity-after-selling-meme-tokens-including-shiba-inu\" data-v-f87c67ca=\"\">sent the proceeds<\/a> to charities around the world and contributed to Ethereum-focused grants program Gitcoin, along with some more of the tokens he was given.","Buterin’s sale crashed the shiba inu token’s price, as it fell from a high of $0.000035 to $0.000009 a few days later. The token’s price has since slid slowly downwards, to its current price of $0.000006.","But this hasn’t deterred Coinbase. Having announced plans to list the token on Coinbase Pro on June 15 — before running into technical difficulties — the exchange is now trying for the second time. A move that's part of the exchange’s bold plan to list <a href=\"https:\/\/www.theblockcrypto.com\/post\/109889\/coinbase-ceo-we-plan-to-list-every-crypto-asset-where-legally-viable\" data-v-f87c67ca=\"\">every crypto token out there<\/a>.","<i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">For more breaking stories like this, make sure to subscribe to The Block on&nbsp;<\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\"><a class=\"c-link\" href=\"https:\/\/t.me\/the_block_crypto\" target=\"_blank\" rel=\"noopener noreferrer\" data-sk=\"tooltip_parent\" data-v-f87c67ca=\"\">Telegram<\/a><\/i><i data-stringify-type=\"italic\" data-v-f87c67ca=\"\">.<\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$1 quadrillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"$1","content":"MONEY"},{"type":"Buterin","content":"PERSON"},{"type":"$0.000009","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"$0.000006","content":"MONEY"},{"type":"$60 million","content":"MONEY"},{"type":"$0.000035","content":"MONEY"},{"type":"June 15","content":"DATE"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Tesla CEO Elon Musk","content":"ORGANIZATION"},{"type":"Shark Tank","content":"ORGANIZATION"},{"type":"May 12","content":"DATE"}],"hashtag":["CRYPTO","DOGECOIN","SHIBA INU"],"authors":["Tim Copeland","The Block"]}