{"summary":"Options implied volatility is overpricing the event, Amberdata's Greg Magadini said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/08\/bitcoin-halving-is-not-a-volatility-event-analyst-says-as-implied-volatility-rises\/","publishDate":"2024-04-08T09:55:00","id":15121,"type":null,"title":"Bitcoin Halving Is Not a Volatility Event, Analyst Says as Implied Volatility Rises","category":["Markets"],"content":["Bitcoin's fourth mining-reward halving is due on April 20, when the blockchain's code will reduce the per-block bitcoin (BTC) issuance to 3.125 BTC from 6.25 BTC.","In the run-up, implied volatility (IV) on the largest cryptocurrency by market value has ticked higher, suggesting increased price turbulence in the days surrounding the quadrennial event. Still, one observer does not favor placing bullish bets on volatility.","\"From a qualitative perspective, I continue to believe paying a volatility premium for a highly predictable outcome (the BTC halving) isn't worth a volatility event premium,\" Greg Magadini, director of derivatives at Amberdata, said in a newsletter on Monday.","Traders typically place bullish bets on volatility ahead of binary events, for which the market outcome is uncertain. Moreover, uncertainty opens the door to pre- and post-event price turbulence and has traders buying both call and put options or volatility futures to profit from any price swings.","But the impact of Bitcoin's reward halving on its native cryptocurrency and miners has been well documented. The cryptocurrency has historically produced stellar rallies in the 12-18 months following the halving.","Read more: Bitcoin Halving, Explained","It's important to note that major crypto events like Ethereum's Dencun upgrade, Shanghai upgrade, and spot BTC listings turned out to have little market impact, disappointing traders positioned for an event-led surge in price volatility.","\"Not to mention that nearly all the big volatility events in crypto (ETH PoS merge, ETH Shanghai upgrade, BTC spot ETF decision) had disappointed IV [implied volatility], buyers when RV [realized volatility] failed to materialize by very large margins,\" Magadini noted.","Bitcoin's 30-day implied volatility, which gauges the expected price turbulence over four weeks, has increased to an annualized 75% from 68% in a week, according to Amberdata.","Meanwhile, the 30-day volatility risk premium (VRP), or the gap between 30-day implied and realized volatilities, has surpassed 10% for the first time since early March. The VRP tends to rise ahead of and following extraordinary market events and can drop to low levels during extended periods of calm markets.","\"Options implied volatility is overpricing the event,\" Magadini said, noting the uptick in VRP.","Bitcoin changed hands at $71,800 at press time, representing a 3.5% gain on the day. The cryptocurrency has risen over 11% since hitting lows near $64,500 on April 2, CoinDesk data show. The CoinDesk 20 Index, a measure of the broader crypto market, had added 3.8% over 24 hours.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Magadini","content":"PERSON"},{"type":"April 2","content":"DATE"},{"type":"3.8%","content":"PERCENT"},{"type":"3.5%","content":"PERCENT"},{"type":"18","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"75%","content":"PERCENT"},{"type":"11%","content":"PERCENT"},{"type":"April 20","content":"DATE"},{"type":"$71,800","content":"MONEY"},{"type":"Greg Magadini","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Amberdata","content":"ORGANIZATION"},{"type":"68%","content":"PERCENT"},{"type":"$64,500","content":"MONEY"},{"type":"Amberdata","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"VRP","content":"ORGANIZATION"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Shanghai","content":"LOCATION"}],"hashtag":["Bitcoin","Markets","Trading","Volatility","Halving"],"authors":["Omkar Godbole"]}