{"summary":"Goldfinch has built a decentralized lending protocol for loans without collateral.\nThe startup was founded by ex-Coinbase employees Mike Sall and Blake West. ","author":["Michael McSweeney","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/93494\/two-former-coinbase-employees-are-building-a-defi-lending-protocol-for-emerging-markets","publishDate":"2021-02-02T13:00:38","id":1512,"type":null,"title":"Two ex-Coinbase employees aim to bring DeFi to emerging markets","category":["DeFi"],"content":["A pair of former Coinbase employees are launching a new protocol that aims to advance one of the DeFi space’s primary use cases — decentralized lending — in the world’s emerging markets.","Goldfinch, which has raised $1 million from a group of industry stakeholders that includes Kindred Ventures, Coinbase Ventures, IDEO CoLab Ventures and Dragonfly Capital co-founder Alex Pack, is the brainchild of Mike Sall and Blake West. Sall previously worked as Coinbase’s head of product analytics and West was a senior backend engineer for the crypto exchange. The two departed Coinbase last summer to begin building out Goldfinch.","At the heart of Goldfinch’s design is the concept of no-collateral loans. The argument is that a lending system based on collateralization favors those who possess such resources while locking out those who don’t have funds to begin with. “DeFi has a massive opportunity to transform access to capital, but it will only be possible once it can make loans without collateral. That’s what will finally open crypto lending to most people in the world,” the two wrote in a blog post published Tuesday.","The protocol has been running on Ethereum’s mainnet since December, with Goldfinch serving as its first loan underwriter. To date, Goldfinch has underwritten $1 million in loans to about 10,000 end-borrowers, with a focus on emerging markets, according to Sall and West.","Thus far, Goldfinch says it has clinched deals with three companies: Aspire, a small-business finance startup backed by a MassMutual venture arm; PayJoy, a Mexico-based company that finances smartphones; and QuickCheck, a Nigeria-based startup that provides personal loans.","Goldfinch’s protocol is currently built around the USDC stablecoin. At its center is a USDC liquidity pool, which lenders — such as those mentioned above — can draw from. The USDC is then exchanged for local currencies and lent out to borrowers. The lenders repay the pool in the form of USDC, which is put in the pool by way of liquidity providers who earn a yield on their deposits. “As the lending businesses make their interest payments back to the protocol, they’re immediately disbursed to all investors,” West and Sall explain in their post.","Over time, the goal is for Goldfinch to serve as a basis for a decentralized underwriting system, which in itself will provide a means for earning yield from the protocol. “This will allow the protocol to scale the underwriting process and onboard new lending businesses entirely through the community, the team wrote.","The project’s emergence comes as the DeFi lending space continues to grow. The Block’s <a href=\"https:\/\/www.theblockresearch.com\/defi-lending-continues-to-grow-86140\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Lars Hoffmann<\/a> wrote in December that DeFi’s <a href=\"https:\/\/www.theblockcrypto.com\/data\/decentralized-finance\/cryptocurrency-lending\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">biggest lending protocols<\/a> had originated nearly $30 billion up to that point in 2020.","Pack told The Block that Goldfinch aims to address “how exactly DeFi will integrate into the real-world.”","“Goldfinch is a lending platform that harnesses the massive energy of DeFi yield-chasers for good, connecting them to under-financed small businesses and individuals all over the world,” he said.","&nbsp;"],"hashtag":["COINBASE","LENDING"]}