{"summary":"Swell developed the rollup alongside Ethereum scaler AltLayer and a16z-backed crypto-staking project EigenLayer.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/13\/ethereum-staking-protocol-swell-unveils-layer-2-rollup-with-1b-total-value-locked\/","publishDate":"2024-03-13T15:16:56","id":15124,"type":null,"title":"Ethereum Staking Protocol Swell Unveils Layer-2 Rollup With $1B Total Value Locked","category":["Technology"],"content":["Ethereum staking protocol Swell has introduced a layer-2 rollup with $1 billion in total value locked (TVL) using Polygon's chain development kit (CDK).","Swell developed the rollup alongside Ethereum scaler AltLayer and a16z-backed crypto staking project EigenLayer. A layer 2 is a protocol designed to scale a blockchain's capacity by executing transactions off-chain and packaging them together for submission to the main network.","The rollup will take the form of a \"restaked rollup\", which comes with a range of services such as decentralized sequencing, verification and faster finality, Swell said on Wednesday.","Restaking refers to a process on the Ethereum blockchain where ether (ETH) tokens that are deposited as security for the network, a process known as staking, can be repurposed to secure additional blockchains and protocols.","Swell founder Daniel Dizon described expanding Swell's liquid-staking offering to layer 2 as \"the next logical step,\" for the project.","\"Restaked rollups combine the ease of spinning up rollups using rollup stacks such as Polygon CDK with the power of EigenLayer's restaking mechanism to bootstrap network security and build a decentralised network for core rollup services,\" AltLayer CEO Yaoqi Jia said in the statement.","Read More: Liquid Restaking Tokens: What Are They and Why Do They Matter?","Edited by Sheldon Reback.","\n","\n","\n","\n","\n","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"Wednesday","content":"DATE"},{"type":"Daniel Dizon","content":"PERSON"},{"type":"Yaoqi Jia","content":"PERSON"},{"type":"Swell","content":"ORGANIZATION"}],"hashtag":["Restaking","Staking","Swell","EigenLayer","layer 2","Rollups"],"authors":["Jamie Crawley"]}