{"summary":"Blockchain and AI could be the 21st century's most culturally significant pairing that could change the way we think about creativity, identity and verification.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/4-actual-use-cases-for-blockchain-and-ai-that-are-more-than-just-hype\/","publishDate":"2023-08-10T13:00:00","id":15137,"type":null,"title":"4 Actual Use Cases for Blockchain and AI That Are More Than Just Hype","category":["Learn"],"content":["Blockchain and artificial intelligence (AI) are little more than bundles of computer networks and code, but they sure are becoming important players in nearly all aspects of online life.","An estimated 66% of the world’s population uses the internet for everyday activities like shopping, social connection, healthcare, business and entertainment. Additionally, at least 7 billion devices are connected to the internet through sensors and custom-designed software, comprising a growing cadre of gadgets referred to as the internet of things (IoT).","All this activity means one thing: data. Lots of data. As WIRED put it in 2014, data today is as valuable of a commodity as oil was in the 18th century. As of 2023, more than 11,000 marketing solutions exist simply to capture, track, analyze and report on consumer data to yield profitable insights.","Blockchain, an open-source globally distributed ledger, offers us a new place to store all that data where it might finally be independent of third-party companies that place profit incentives over consumer privacy. Yet, data on blockchain is publicly available by default – which is not ideal for most of our information. This transparency is causing many of us to think critically – perhaps for the first time – about what types of personal data we want to exist on the internet and how we should renegotiate Web2’s social contracts that have allowed centralized platforms like Facebook and Twitter to own our data in exchange for services.","That’s where artificial intelligence (AI) could come in. In an ideal future, third-party companies don’t track and analyze our data – AI does. Let’s imagine, in this ideal scenario, that we understand well enough how AI learning models work and therefore trust them to develop insights about who we are while tracking digital provenance and verifying the credibility of our information.","Sounds great, right? But unfortunately, most new AI use cases are still experimental and nobody can predict success. As happens with new technologies, the true capacities of AI and blockchain are currently getting lost in hyperbole, misunderstandings and FUD (fear, uncertainty and doubt). We spoke to several data experts and Web3 insiders to better understand where AI and Web3 might successfully converge to create consumer-friendly solutions for verification, ownership and creativity.","With the upcoming U.S. presidential elections, the issue of deep fakes and misinformation has become a grave concern. But what if we could publicly track the origin of information?","According to Lisa DeLuca, senior director of engineering at Web3 domain company Unstoppable Domains, not only does the source-tracking technology exist, but there’s also a way to link news quotes to the public key of the person who said it.","“We've got a pending patent for this idea that you can use blockchains to add trust to content,” DeLuca said. Similar to a Google Search Alert, a person could employ an AI bot to crawl the web for mentions of their name in the media. Any time that person is quoted by a journalist or news outlet, they would receive a request to verify the quote on the blockchain using their decentralized domain name linked to a crypto wallet.","“You'd see a request that says, ‘Is this really you – yes or no?’ And then the experience could be updated to show that that person verified it, and then the news outlet could develop their reputation over time on how much of their content is actually verified versus rejected,” explained DeLuca. The process could also be incentivized with crypto tokens so that the verifying person receives a reward for confirming their quotes.","According to DeLuca, Unstoppable Domains has already developed this tool and is ready to begin testing it with a media partner. “If someone wants to partner with us, we're ready to talk about it,” she said. “This is not that far off.”","The digital world has long grappled with copyright infringement and intellectual property (IP) challenges. The convergence of Web3 and AI might be ushering in a new era of copyright protection.","Recently, comedian Sarah Silverman sued OpenAI and Meta over their AI models that were trained using her book, which is copyrighted material. While copyrighted materials often end up online and publically available, there ought to be ways for owners to regain control over their materials and dictate if, how and when they are used.","According to Don Gossen, CEO of data tokenization company Nevermined, the convergence of AI and blockchain could empower creators of all kinds to monetize their IP in terms they control. Smart contracts on the blockchain could automatically enforce copyright terms, while AI algorithms could scan content for potential infringements. This combined approach would create an immutable record of ownership and usage on the blockchain, simplifying disputes and incentivizing creators to share their work in a secure environment.","At present, Nevermined is testing this concept with scientific research, in a growing initiative known as decentralized science (DeSci). Using an AI learning model to compile data from lengthy research papers, programmers can create short-form abstracts for clinicians to quickly look up information in real-time healthcare settings. To maintain the integrity of the data, as well as compensate scientific authors, Gossen says that participating contributors could choose whether to include their copyrighted academic papers and research materials, thereby contributing to a well-curated dataset that produces high-quality outputs as a result.","Nevermined is currently working on a blockchain-based marketplace, in which AI developers would need to subscribe to get access to these materials and train their models. This approach gives the power to the original authors and owners of the content, who ultimately get to decide if they would like to grant others access to their materials.","Additionally, because blockchain can provide proof of reference, Gossen explained that a doctor could also deep dive into the original research to understand more, and possibly even reach out to the researchers.","“Commercially, this is useful because hospitals and clinics will pay for the abstracts for their medical professionals to access,” Gossen said. “A doctor can excuse themselves from the patient meeting, go to the back office and query the symptoms, receive a bunch of research, and then have five minutes to synthesize the information and go back to the patient with an assessment.”","If you’ve ever wanted to create your own version of Clippy, the Windows paperclip that popped up inside Microsoft Word, now you can. When coupled with AI, the blockchain-based artworks known as non-fungible tokens (NFTs) can become more interactive and dynamic, unlocking a world of imagination and fun for creators, brands and consumers.","Alethea AI, the company behind intelligent NFTs (iNFTs), developed generative NFTs powered by large language models (LLMs), or deep learning algorithms that distill large data sets. It’s sort of like taking a version of ChatGPT, OpenAI’s popular chatbot, and combining it with your favorite digital artwork, thereby teaching the art to converse through text and verbal cues. That’s how Alethea AI’s generative NFTs work, and they can feature a holder’s favorite NFTs as avatars.","“Basically, how an iNFT is created is you take your NFT and combine it with what we call intelligence pods,” explained Komalika Neyol, Alethea AI content manager. “These pods are AI assets that can be trained. It can have a personality and perform AI services for you.\"","According to Neyol, iNFTs are customizable to a user’s unique dataset, allowing holders to showcase their personalities, knowledge and skill sets through their NFT. For instance, a philosophy professor could upload their PhD dissertation to their LLM and create an animated chatbot that greets website visitors by quoting famous philosophers.","Interested users can create customized NFTs with their own unique dataset by minting an Alethea Intelligence Pod NFT. The company created a short tutorial video for holders on how to imbue an ERC-721 NFT with AI.","In a future where smart contracts automatically divvy up and disperse payment to the appropriate crypto wallets as the experts we spoke to describe, auditing the security of smart contracts is going to be essential.","According to Ron Bodkin, co-founder and CEO of generative AI company ChainML, AI can be highly instrumental in detecting the anomalies of smart contracts. Chain ML is currently working with the Web3 security company Cube3 to more efficiently block malicious crypto transactions.","Similar to the safeguards implemented by a bank, programmers can train an AI to interpret factors that might be red flags, such as a suspicious origin of a transaction, the age of a wallet, the sequence of events (e.g. a prompt to drain a wallet right after interacting with a new address) and more.","“There's so many different factors that can come together to say, ‘Hey, this is risky, this is something that you want to deal with,’” said Bodkin.","However, Bodkin acknowledges that while AI can enhance the efficiency of blockchain security audits, humans are still necessary to conduct a thorough evaluation. His advice is to use AI technology in a way that improves human error, but don’t expect AI auditors to replace humans entirely.","“I wouldn't suggest anyone fire your auditor and just rely on AI audits,” Bodkin cautioned. He says ChainML and its partners are beginning to see success from performing AI audits earlier in the building process, thereby helping human auditors address problems quicker, but the process would not be possible with robots alone.","“AI auditors could run all the time and very quickly give responses,” Bodkin said. “There's a number of layers where AI can enhance security.”","The convergence of blockchain and AI presents a brave new world, one full of exciting possibilities that have the potential to reshape various sectors. News verification, copyright protection, interactive NFTs and smart contract audits are burgeoning areas that demonstrate the tangible benefits of this Web3-AI synergy.","However, while the possibilities are vast, experts advise businesses and creators to be careful and consider AI’s technological limitations. Presently, AI is about supplementing human productivity, improving error and expanding the imagination — and they’re unlikely to fully replace humans anytime soon.","\n"],"entity":[{"type":"2014","content":"DATE"},{"type":"Nevermined","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Bodkin","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"18th century","content":"DATE"},{"type":"Gossen","content":"PERSON"},{"type":"7 billion","content":"MONEY"},{"type":"66%","content":"PERCENT"},{"type":"DeLuca","content":"PERSON"},{"type":"Sarah Silverman","content":"PERSON"},{"type":"Alethea Intelligence Pod NFT","content":"ORGANIZATION"},{"type":"Clippy","content":"LOCATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Ron Bodkin","content":"PERSON"},{"type":"Don Gossen","content":"PERSON"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Alethea","content":"PERSON"},{"type":"Google Search Alert","content":"ORGANIZATION"},{"type":"Komalika Neyol","content":"PERSON"},{"type":"DeLuca, Unstoppable Domains","content":"ORGANIZATION"},{"type":"Neyol","content":"LOCATION"},{"type":"Lisa DeLuca","content":"PERSON"}],"hashtag":["NFTs","Web3","Beginner","AI","Blockchain"],"authors":["Megan DeMatteo"]}