{"summary":"Post-Merge, the Surge, the Verge, the Purge and the Splurge will continue to make Ethereum's proof-of-stake blockchain more scalable and secure.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/08\/01\/ethereum-after-the-merge-what-comes-next\/","publishDate":"2022-08-01T20:27:15","id":15133,"type":null,"title":"Ethereum After the Merge: What Comes Next?","category":["Technology"],"content":["At the Ethereum Community Conference in Paris, the Ethereum blockchain’s co-founder, Vitalik Buterin, shared what he expects for Ethereum in a post-Merge era. Buterin closed the conference by sharing that after the Merge, Ethereum will only be about 55% complete.","The Merge refers to when the current proof-of-work (PoW) Ethereum mainnet protocol will \"merge\" with the Beacon Chain proof-of-stake (PoS) blockchain system and continue as PoS.","So where does that leave Ethereum in a post-Merge world? Many have looked at the Merge as the grand finale for the network. But now, according to Buterin, Ethereum will be tackling “the Surge, the Verge, the Purge and the Splurge.”","Read More: What Is the Ethereum Merge?","The anniversary of Ethereum’s mainnet, or live version, launch was July 30. So it seems like a good time to look at what to expect for Ethereum after the Merge.","The \"Surge\" refers to Ethereum introducing systems that will make the network more expandable (scalable) by enabling the creation of layer 2, or companion, products, including sharding and rollups, and therefore making it easier for users to operate on the Ethereum network.","During this phase, the introduction of sharding is expected on Ethereum. Sharding would split Ethereum's entire network into smaller pieces, known as “shards,” which is intended to increase the network’s scalability. It does this by breaking up data within the same blockchain, in essence creating multiple mini-blockchains. This becomes a lot easier to do once the protocol moves to proof-of-stake. Ethereum then will aim to create a physically sharded system of 64 linked databases.","Read more: The Risks and Rewards of Sharding","Sharding is a concept in computer science that scales applications so they can support more data. If sharding can be implemented on Ethereum, each user could store part of the change to the database, instead of the entire thing.","Danksharding has also seen increasing interest in a post-Merge world. While Buterin didn’t specifically mention the concept in Paris, Ethereum aficionados have turned to this prototype as a way of making Ethereum more scalable. Danksharding applies the same concept of splitting the network into shards, but instead of using the shards to increase transactions it uses them to increase space for groups of data. This allows for Ethereum to process larger quantities of data.","While the press coming out of Paris has started to draw attention to Ethereum exploring sharding, sharding has been an idea since Ethereum emerged in 2013. The implementation is expected to begin sometime in 2023.","Read more: Scaling Ethereum Beyond the Merge: Danksharding","Ethereum developers are also looking to expand its scaling potential with the introduction of rollups. Rollups perform transactions outside of Ethereum’s base layer (layer 1) and then post the transaction data onto the layer 1 blockchain, allowing it to take advantage of the main Ethereum security chain. Many have said that rollups are still a while away but the introduction of some newer projects, including zkSync and Polygon zkEVM, shows that the next phase of Ethereum is closer than expected.","There are currently two types of rollups: Optimistic rollups, which assume transactions are valid for a default period and run on layer 2 networks before being passed back to the base layer, and Zero-Knowledge rollups (ZK rollups), which run the transactions off-chain and submit the proof of validity to the layer 1 network. Overall, ZK rollups hold some computational advantages over Optimistic rollups, given that they will have to provide proof that the transaction is valid instead of having a time period to accept or reject the transaction.","For a while, Optimistic rollups seemed like the ideal solution to scaling the Ethereum network, but with ZK rollups on the way and the sharding process starting sometime in 2023, there is a lot of room to make Ethereum more scalable.","Read more: Sell the Ethereum Merge","The next phase will introduce Verkle trees, which will also tackle the issue of scalability. Verkle trees are a “powerful upgrade to Merkle proofs that allow for much smaller proof sizes,” according to Buterin. The so-called Verge will optimize storage and reduce node sizes. Ultimately, this will make Ethereum more scalable.","For context, Merkle trees aim at creating reliable encryption by converting blocks of information into long strands of code. The newest blocks of information, or leaves, are grouped together to form branches. This then traces a string of numbers, known as the Merkle root, that contains all the previous information. This method was first explored on the Bitcoin blockchain and later adapted for Ethereum.","So essentially, Verkle trees will allow for you to store a large amount of data by showing a short proof of any piece of that data, which in turn will be verified by someone who only has a root of the tree. This process will then make proofs much more efficient.","Verkle trees are still a new idea and are still not as widely known or used as other cryptographic solutions. So while the Surge will deal with sharding and rollups, that phase will then affect how the network deals with scalability and proofs for Ethereum.","The Purge aims at reducing, or “purging,” spare historical data. Reducing the amount of historical data will make the process of validating the blockchain more efficient for validators under the new proof-of-stake consensus mechanism. This should minimize network congestion and allow many more transactions to be processed on the blockchain. Buterin said that by the end of this phase, Ethereum should be able to process 100,000 transactions per second.","Once all these previous parts come together, Buterin has described the next part, the Splurge, as “the fun stuff.” It aims at making sure that the network continues to run smoothly and that the updates to the protocol in the previous sections do not cause any issues. The tough work of making Ethereum more scalable will have been completed.","This ultimate stage is still in the distant future; as in all tech development, there are bound to be hiccups along the way. Given that the Merge has taken much longer than expected, the Splurge – when it finally arrives – will mark a much deserved celebratory phase for the Ethereum network.","\n"],"entity":[{"type":"Buterin","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"July 30","content":"DATE"},{"type":"Merkle","content":"PERSON"},{"type":"Paris","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"Ethereum Community Conference","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"55%","content":"PERCENT"},{"type":"Buterin, Ethereum","content":"ORGANIZATION"}],"hashtag":["Ethereum","The Merge","Ethereum 2.0","Technology","Vitalik Buterin"],"authors":["Margaux Nijkerk"]}