{"summary":"In a letter sent to Judge Lewis Kaplan on Friday, U.S. Attorney Damian Williams said the government was submitting a “proposed stipulation and order” in connection to two jets tied to Sam Bankman-Fried.\nThe planes were never used since the upgrades were still being worked on when FTX collapsed in November, according to past court documents. ","author":["Sarah Wynn","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/284174\/government-looks-to-sell-luxury-jets-connected-to-former-ftx-ceo-sam-bankman-fried","publishDate":"2024-03-22T11:17:41","id":1514,"type":null,"title":"Government looks to sell luxury jets connected to former FTX CEO Sam Bankman-Fried","category":["Companies"],"content":["<span class=\"s1\" data-v-f87c67ca=\"\">U.S. prosecutors want a court to allow them to sell two multi-million dollar jets connected to former FTX CEO Sam Bankman-Fried.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">In a <a href=\"https:\/\/storage.courtlistener.com\/recap\/gov.uscourts.nysd.590939\/gov.uscourts.nysd.590939.416.0.pdf\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">letter<\/span><\/a> sent to Judge Lewis Kaplan on Friday, U.S. Attorney Damian Williams said the government was submitting a \"proposed stipulation and order\" in connection to <\/span><span class=\"s3\" data-v-f87c67ca=\"\">a Bombardier Global 5000 BD-700-1A11 and an Embraer Legacy EMB-135BJ — both of which have been tied to Bankman-Fried. <\/span><span class=\"s4\" data-v-f87c67ca=\"\">The Bombardier was bought for $15.9 million and the Embraer for $12.5 million, according to previous <a href=\"https:\/\/www.theblock.co\/post\/254971\/sbf-flew-too-high-and-now-ftxs-luxury-jets-could-be-forfeited\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">court<\/span><\/a> documents.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">The order involves an agreement between multiple parties, including the FTX debtors, former FTX executive Ryan Salame and Paul Aranha — the founder of a Bahamian charter flight company that operated Bankman-Fried's planes to and from the Bahamas, according to the letter. In a footnote, prosecutors said they also sent a copy of the order to Bankman-Fried and said he and his lawyers did not object to it.&nbsp;<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">\"The Government also seeks authorization from the Court to approve interlocutory sale of the airplanes pursuant to Rule 32.2 of the Federal Rules of Criminal Procedure and Rule G(7) of the Supplemental Rules for Admiralty or Maritime Claims and Asset Forfeiture Actions,\" Williams said in the letter.<\/span>","<span class=\"s3\" data-v-f87c67ca=\"\">FTX had asked the planes to be upgraded with \"state-of-the-art wifi and entirely new interiors,\" according to previous court documents filed by Aranha. <\/span><span class=\"s4\" data-v-f87c67ca=\"\">Ultimately the planes were never used since the upgrades were still being worked on when FTX collapsed in November, Aranha said.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried was found guilty in November 2024 by a jury in New York of all seven criminal counts of defrauding FTX's customers, lenders, and investors. FTX filed for bankruptcy protection in November 2022.&nbsp;<\/span>","<span class=\"s1\" data-v-f87c67ca=\"\">Bankman-Fried is set to be sentenced on March 28. Prosecutors have said he should be in <a href=\"https:\/\/www.theblock.co\/post\/282916\/prosecutors-lock-up-sbf-for-up-to-50-years\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">prison<\/span><\/a> for 40 to 50 years, while his lawyers have previously <a href=\"https:\/\/www.theblock.co\/post\/279487\/sbf-lawyers-prison-sentence\" data-v-f87c67ca=\"\"><span class=\"s2\" data-v-f87c67ca=\"\">asked<\/span><\/a> for a prison sentence of 63 to 78 months.&nbsp;<\/span>"],"hashtag":["FTX","SBF TRIAL"]}