{"summary":"The \"historic\" settlement with the DOJ, CFTC and U.S. Treasury many finally allow the firm to come into compliance. But if it does, can the world's largest crypto exchange still grow?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/11\/22\/is-binance-big-enough-to-survive-a-43b-fine-and-founder-czs-ousting\/","publishDate":"2023-11-22T01:42:50","id":15149,"type":null,"title":"Is Binance Big Enough to Survive a $4.3B Fine and Founder CZ’s Ousting?","category":["Consensus Magazine"],"content":["In August, before it was fully clear the U.S. Department of Justice (DOJ) would bring charges against Binance, news leaked that the federal prosecutors building the case were worried an indictment could cause customers to panic and withdraw their funds en masse, potentially creating panic in the crypto markets, wider industry contagion or even a liquidity shortfall.","On Tuesday, the DOJ reached a “historic” settlement with the world’s largest exchange. The stated crimes are sweeping, and the penalty is massive. Binance will pay a $4.3 billion fine for violating money transmission laws and U.S. sanctions, and its CEO, Changpeng “CZ” Zhao, who founded the firm in 2017 and built it into a behemoth, was forced to resign.","Withdrawals over the past day have ticked up to $566.8 million, according to DefiLlama’s centralized exchange dashboard.","Customers rushing to yank their money out of FTX ruined that exchange because its operators fraudulently embezzled the money. On the other hand, at this point, Binance appears to be sound. Its latest “proof of reserves” report, an imperfect but voluntary attestation of an exchange’s holdings, shows the exchange holds $65 billion worth of crypto assets alone. DefiLlama counts it at $68.4 billion.","Further, Binance appears to be overcollateralized for many of the largest assets on its books, like bitcoin (BTC), ether (ETH), tether (USDT) and others, meaning Binance’s net balances are more than it owes customers. In other words, if every Binance customer withdrew every bitcoin they owned, the exchange would have bitcoins to spare.","The loss of Zhao will be felt. He was not the firm’s figurehead, but its leader. He communicated to his fans, supporters and users in figurative language – often being able to blow off bad news with a tweet. Many times this year, when the bad news kept coming, he’d tweet out a single number: “4.” That stood for his four principles, to ignore the “FUD” — or fear, uncertainty and doubt” — and remain positive.","See also Binance Needs to Get Off Twitter | Opinion","“Admittedly, it was not easy to let go emotionally. But I know it is the right thing to do. I made mistakes, and I must take responsibility. This is best for our community, for Binance, and for myself,” Zhao wrote Tuesday on X\/Twitter.","Zhao is personally on the hook for $200 million in civil and criminal penalties, which for an early crypto adopter whose net worth ranges from $17 million on the low end deca-billions is a small price to pay to settle charges from a coordinated investigation involving the DOJ, CFTC and two enforcement departments under the Treasury Departments, FinCEN and OFAC.","Binance, no stranger to regulatory action, appears to have had a contingency plan in the works for a while, and reacted quickly to its decapitation. Binance’s head of regional markets, Richard Teng, who was hired in 2021 and was a rumored CZ successor, will step up as CEO. This quick promotion, which was already in the public consciousness, has done a lot to stymie disorder – especially considering Zhao might spend the next 18 months to 10 years in a U.S. federal prison.","While Yi He, Zhao’s co-founder, rumored romantic partner and “chief customer service officer” (a self-defined role that encapsulates the firm’s “business, marketing and branding strategy,” according to her company bio), appears to be staying on. Although Zhao won’t be allowed any involvement with Binance for at least three years, according to the government’s terms, He could potentially act as an informal conduit between the company and its largest shareholder, Zhao.","In many ways, Binance got off easy. It has to pay a massive penalty, yes, but it looks like it has money on the books to survive. Binance will also need to appoint an independent monitor and send compliance reports to the U.S. government. ConsenSys senior counsel and director of global regulatory matters Bill Hughes said this will be a huge boon to U.S. criminal investigators:","“All Binance transaction records that exist today, which may very well go back to the beginning of the exchange, are there for the taking by law enforcement. They will show how illicit payments flowed through the exchange. Law enforcement will have full access to an ocean of intelligence about illicit flows inside the blackbox of that exchange to match against the immutable record of transactions you find on-chain.”","Perhaps Binance will never end up in regulatory good graces, but paying restitution, coming into compliance and ending a multi-year criminal investigation that held like a sword of Damocles over the exchange could allow it to turn a new leaf. (And Zhao, who has essentially lived an itinerant lifestyle since his exchange was kicked out of China the same year it was founded, 2017, can finally take a breath.)","See also: Binance Got Huge Due to U.S. Customers. That Was Illegal, U.S. Says","Perhaps now the European countries including France, the Netherlands and even the tax shelter Cyprus, which either declined granting Binance a license to operate or opened up their own regulatory investigations, will give the exchange a second chance. Binance, at the same time it was required to pull out of several jurisdictions, has in some ways grown over the past year while the rest of the industry retracted.","Binance could be said to be the one of the few firms that benefited from the collapse of rival FTX, absorbing a global crypto-trading customer base. In his first public announcement as CEO, Teng said the exchange boasts over 150 million users, and thousands of employees. The exchange also runs divisions in nearly every crypto vertical, maintains one of the most used DeFi chains and made moves into AI.","Nothing is total insurance, but the exchange still has momentum. It also has other roadblocks ahead, including a civil lawsuit brought by the U.S. Securities and Exchange Commission (SEC), alleging a number of financial violations. The company has also been hemorrhaging executives, and in July after a round of layoffs it was reported the exchange could ultimately cull a third of its global workforce.","In October, the company's U.S. division, Binance.US, modified its terms of use, making it so users can no longer withdraw dollars directly from the platform — except through stablecoins. That same month, Binance onboarded \"a number of new regulated and authorized fiat partners\" to enable users to deposit and withdraw euros, after its former partner Paysafe halted services for the exchange.","If these inconveniences affect customer experiences, it may be the only thing capable of killing the exchange. Binance, in some sense, was beloved because it embodied the cowboy, outlaw mentality of crypto. It’s unclear what sort of psychological affect the denouement of the DOJ’s investigation, the unprecedented fine or the possible imprisonment of the exchange’s former CEO will have on such an audience.","See also: Binance's CZ and the End of the 'Borderless' Crypto Company | Opinion","It’s also unclear whether the magnitude of the exchange’s crimes will taint its reputation, even among the staunchest crypto-anarchists. “The Binance platform was facilitating some truly horrible stuff – everything from terrorist financing to ransomware actions, child pornography and various scams and frauds,” a senior Treasury official told reporters.","Binance, to its credit, has copped to its mistakes. The official company statement repeated what it has said before, that the company “grew at an extremely fast pace” and “made misguided decisions along the way.”","For almost its entire existence – barring the last couple of months, when Binance’s PR and legal teams seemed to make a show of the exchange prioritizing compliance – the exchange acted with extreme disregard to U.S. and global regulations. Zhao once boasted the exchange had no headquarters because Bitcoin doesn’t. It opened and closed subsidiaries in known tax havens like Bermuda (in 2018, planning to develop a regulatory framework that didn’t pan out), Jersey (shuttered in 2020) and Malta (ousted in 2021).","“Today, Binance takes responsibility for this past chapter,” the company’s statement continued. Perhaps its the only thing it can say, to remain a going concern. Many questions remain: will a compliant Binance be able to grow?","Will Binance finally find a home? And if so, will it then lose its place in its customer’s hearts?","UPDATE (NOV. 22, 2023): Updates ConsenSys' Bill Hughes title.","Edited by Nick Baker."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2017","content":"DATE"},{"type":"France","content":"LOCATION"},{"type":"Today","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$65 billion","content":"MONEY"},{"type":"FinCEN","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"$68.4 billion","content":"MONEY"},{"type":"Cyprus","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"Zhao","content":"LOCATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"next 18 months","content":"DATE"},{"type":"Twitter","content":"DATE"},{"type":"Binance Got Huge Due","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Richard Teng","content":"PERSON"},{"type":"Teng","content":"PERSON"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"$566.8 million","content":"MONEY"},{"type":"OFAC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"August","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"Treasury Departments","content":"ORGANIZATION"},{"type":"the Netherlands","content":"LOCATION"},{"type":"Bermuda","content":"LOCATION"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"U.S. Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"Bill Hughes","content":"PERSON"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Malta","content":"LOCATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Binance Needs","content":"ORGANIZATION"},{"type":"$17 million","content":"MONEY"},{"type":"Jersey","content":"LOCATION"},{"type":"2020","content":"DATE"},{"type":"October","content":"DATE"},{"type":"NOV. 22, 2023","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["Opinion","Binance","CZ","Changpeng Zhao","DOJ","SEC","Treasury","Crime","Exchanges","Culture"],"authors":["Daniel Kuhn"]}