{"summary":"“It hasn't always been easy, but I'm very happy that I stood my ground,” says Hodlonaut of his long legal fight with Craig Wright, who claimed, falsely, to be Satoshi Nakamoto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/14\/craig-wright-was-finally-called-out-in-court-and-hodlonaut-is-celebrating\/","publishDate":"2024-03-14T20:43:23","id":15144,"type":null,"title":"Craig Wright Was Finally Called Out in Court and Hodlonaut Is Celebrating","category":["Consensus Magazine"],"content":["Craig S. Wright is a fraud. That is not just my opinion, but that of Mr Justice Mellor of the U.K. High Court, who ruled today that the self-declared inventor of Bitcoin is not as he claims. Over the past five years, Wright, an Australian national, has wasted hundreds of hours of court time and millions of dollars suing a number of people who challenged his assertions.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","This Thursday, that ends. Following a two month-long trial brought by a consortium of cryptocurrency companies called the Crypto Open Patent Alliance (COPA) on behalf of the Bitcoin community, presiding Judge Mellor has stated in no uncertain terms that “the evidence is overwhelming” that Wright has been lying for years.","Wright’s strategy was “definitely a perversion of the course of justice and fraud on the legal system,” said Hodlonaut, a pseudonymous Bitcoiner with a serious reason to celebrate today’s verdict. Hodlonaut, known for his cartoon cat avatar on Twitter, was sued by Wright five years ago for libel, after tweeting that the 53-year-old computer scientist was a fraud and a scammer.","See also: Stupid Things Craig Wright Said in His Latest Stupid Trial | Opinion","That’s exactly what COPA was trying to prove by filing the first offensive case against the 53-year-old computer scientist seeking a “negative declaration” from the U.K. justice system that Wright is not Nakamoto. And they got it: Justice Mellor, in a highly unusual move, issued this verdict directly from the bench within seconds of the case ending.","It’s conceivable that Mellor will now refer Wright for criminal proceedings under the Crown Prosecution Service given the enormous amounts of money and time the Satoshi Nakamoto pretender has cost the U.K. justice system. “This is not the only case Craig has going in the U.K.,” Hodlonaut said, mentioning the suits against himself, podcaster Peter McCormack and a group of Bitcoin developers.","Including the other proceedings involving Wright’s claims over the Bitcoin white paper, codebase, database rights and “Tulip Trust,” said to hold 110,000 bitcoins (BTC), Hodlonaut estimated Wright has racked up upwards of 50 days of court time in the U.K. “They have to set an example on this because it's so, so extremely blatant,” Hodlonaut said.","COPA, for its part, said it would refer Craig for criminal proceedings, which might involve the numerous times he perjured himself. Justice Mellor said he would issue a “fairly lengthy written judgment” of the trial which saw Wright submit forged evidence and lie incessantly. Hodlonaut, who appeared in court during Wright’s cross-examination, expects the document to be “brutal.”","“It hasn't always been easy, but I'm very happy that I stood my ground,” Hodlonaut said, adding that he feels vindicated though not surprised by the verdict. “Instead of breaking me they ended up handing me a chance to prove myself a better person. I’m a stronger person now than I was five years ago.”","In fact, Hodlonaut’s defamation case in Norway contributed to COPA’s winning argument — it was mentioned at least 41 times in COPA’s closing argument and was used as evidence throughout the trial to show Wright’s story has changed over the years. The case, which Hodlonaut won, is being appealed but, after today’s verdict, may now be thrown out.","“We’ll see,” Hodlonaut said. He estimated he has spent on the order of $3 million in legal fees fighting off Wright’s libel suits in the U.K. and his native Norway, some out of pocket but most funded by the Bitcoin community. “It’s been going on for five years now — that's five years where I've spent basically a full-time job defending myself,” he added. That’s on top of his actual job at The Bitcoin Advisor custody and security firm.","In many regards, these cases should never have been allowed. The judge overseeing Hodlonaut’s trial noted “The prevailing opinion … has been, and is, that Wright is unlikely to be Satoshi Nakamoto,” and that Hodlonaut “had sufficient factual grounds” to criticize Wright. While McCormack’s judge said Wright had given “deliberately false evidence” — though still awarded him “nominal damages” of £1.","Hodlonaut suggested Wright’s legal campaign was an attempt to “a precedent in the legal system” he could rely on, alongside patent filings, to show he was Satoshi because he didn’t have any actual evidence. “I mean, the only ‘out’ they gave me was for me to apologize and agree that he is definitely Satoshi Nakamoto — the problem for them was that people didn't fold,” he said.","Wright has his supporters — including investors in his fork of Bitcoin, known as Bitcoin SV (for “Satoshi’s Vision), and billionaire benefactor Calvin Ayre. But it’s long been apparent to everyone else that Wright was lying since he burst on the scene with circumstantial or fraudulent evidence trying to pass himself off as Satoshi Nakamoto, the still unknown inventor of Bitcoin.","Despite promising to give \"extraordinary proof to an extraordinary claim,” Wright has been unable to provide any evidence he authored the Bitcoin white paper or holds Satoshi’s keys. Instead, over the years his lies have compounded, which allowed COPA to arm itself with countless examples of his “forgery on an industrial scale” with which to ensnare him.","To list just a few examples that came up at trial: the original white paper was produced using OpenOffice while Wright’s version submitted to evidence used LaTeX software; a pre-white paper document contained references to then-unpublished scholarly articles because, as Wright claims, “researchers share” pre-publication; another document showed hallmarks of being made with ChatGPT.","See also: Time to End Craig Wright's Harassment Campaign","“If I had forged that document, then it would be perfect,” Wright said at one point on cross-examination, addressing concerns of another forgery. If anything, this single statement encapsulates exactly how deranged Wright’s perspective is — not only is he a habitual liar, but he thinks himself god’s gift to man.","It could almost be funny hearing someone perjure themselves in court just to pretend that they spend their lunch breaks writing patents and studying for two PhDs. But, given the untold damage he has caused, it’s hard to have any sympathy for Wright.","Despite it all, Hodlonaut said he doesn’t hate Wright, though he does find “some satisfaction in seeing karma” coming full circle. “What brought me through all of this was being able to focus on what's in my control, not what other people are scheming,” he said. The support he got from the Bitcoin community also helped.","That said, if his appeals case is dismissed, in addition to spending more time with his family and working more as an advisor for his firm, Hodlonaut said there may be an “opportunity to go on the offensive.”","“There are some people connected to Craig’s 'lawfare' based on lies that may have some consequences coming to them,” Hodlonaut said."],"entity":[{"type":"Nakamoto","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Justice Mellor","content":"PERSON"},{"type":"U.K.","content":"LOCATION"},{"type":"Tulip Trust","content":"ORGANIZATION"},{"type":"McCormack","content":"PERSON"},{"type":"Satoshi’s","content":"PERSON"},{"type":"Crypto Open Patent Alliance (COPA","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Calvin Ayre","content":"PERSON"},{"type":"U.K. High Court","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Craig","content":"PERSON"},{"type":"Norway","content":"LOCATION"},{"type":"Mellor","content":"PERSON"},{"type":"Craig Wright","content":"PERSON"},{"type":"OpenOffice","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Craig’s","content":"PERSON"},{"type":"Crown Prosecution Service","content":"ORGANIZATION"},{"type":"Satoshi","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"Peter McCormack","content":"PERSON"},{"type":"five years ago","content":"DATE"},{"type":"Wright","content":"PERSON"},{"type":"Hodlonaut","content":"PERSON"},{"type":"Craig S. Wright","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Craig Wright","Hodlonaut","Law","Fraud"],"authors":["Daniel Kuhn"]}