{"summary":"A primer on the CoinDesk DACS Computing sector.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/08\/22\/how-to-build-the-infrastructure-of-web3-with-decentralized-data-and-services\/","publishDate":"2022-08-22T22:07:15","id":15147,"type":null,"title":"How to Build the Infrastructure of Web3 With Decentralized Data and Services","category":["Markets"],"content":["Max Good, senior index research analyst at CoinDesk Indices, contributed writing for this report.","Acknowledgement:","We thank our former intern, Zad Mahana, for his expertise and assistance in all aspects of our work on Digital Asset Classification Standard (DACS) and for his help in writing this paper.","Introduction","In December 2021, CoinDesk Indices launched its Digital Asset Classification Standard (DACS) to set the standard for defining the industries of digital assets. Every one of the top 500 digital assets by market capitalization is assigned to an industry, defined by DACS, then at least one industry is assigned to an industry group, and finally, at least one industry group is assigned to a sector.","Currently, there are six sectors defined by DACS including Currency, Computing, DeFi (Decentralized Finance), Digitization, Culture & Entertainment, and Smart Contract Platform. The Computing sector is the fifth-largest sector in DACS with 68 assets representing 1.7% of the digital asset market worth approximately $29.9 billion in market capitalization as of April 30,2022.","\n","Exhibit 1: CoinDesk Indices DACS","\n","Defining the Computing sector","The CoinDesk DACS Computing sector contains protocols that aim to build and support the infrastructure of Web3 and distributed computing. The decentralization of Web2 services like cloud computing, storage, networking and databases has the ability to increase security and privacy measures by removing the centralized points of failure that exist in Web2 providers. In addition, these systems return ownership of data and information to the network participants in a way that users can earn revenue by contributing to their operation.","The DACS Glossary defines the Computing sector as follows:","The Computing sector consists of projects that aim to decentralize the sharing, storing, and transmission of data by removing intermediaries and ensuring privacy for all users. All projects that aim to gather, transmit, store and share data and web services in a decentralized manner play a key role in building the infrastructure of Web3. This includes on-chain and off-chain data transmission, social data platforms, peer-to-peer secure data transactions, open networks, free market private computation, and decentralized file storage and file sharing.","Industry groups inside the Computing sector","The industry groups in the Computing sector depend on the services the protocol offers. Each project serves a different function in decentralized computing and has varying tokenomics and incentive structures. The industries in the Computing sector include Shared Storage, Oracle, IoT, Private Computing and Shared Network. The CoinDesk DACS Glossary definitions for each of the above industries is as follows:","Shared Storage refers to the decentralization of storage servers that are traditionally owned and operated by a central organization. Shared storage protocols such as Filecoin (FIL) 1 decentralizes the storage responsibilities across an open-source network of miners with a system of economic incentives. This allows for pseudonymous, private file sharing on a decentralized network. The centralization of cloud data storage offers high risks that expose the cloud network to potential hacks. Malicious actors have the potential to access sensitive information of millions of users, through a singular data breach due to the inherent centralization. Shared storage platforms increase security of data storage by running on a blockchain network that allows for privacy and pseudonymity of data transmitters.","Oracle refers to any project with the primary ability to gather, organize and transmit either on-chain to on-chain data or off-chain to on-chain data in real time. Blockchain oracles typically operate with a native token to cover transaction costs and governance rights. Oracles can enable real time off-chain data to be used in decentralized applications. The largest asset in the Computing sector, Chainlink (LINK) 2, is widely used by many DeFi applications as a source of off-chain market data.","IoT includes protocols that contribute to the development of the Internet of Things and Web3 that combine blockchain with real world, off-chain connections. IoT platforms such as Helium (HNT) 3 allow for application interoperability between IoT networks and blockchains. They allow interconnectivity on a trustless network with no reliance on any central entity or centralized database of user info that can be subject to manipulation. IoT can allow the execution of smart contracts using oracles and real-world data.","Private Computing refers to the free market buying and selling of cloud computing power, surplus bandwidth, security as a service, and other computational services for one-off instances on demand. Private computing markets are decentralized, global, and pseudonymous with no barriers to entry. In Private Computing, providers can list their own individual computation or security capabilities which users can purchase based on the listed market prices set by the provider.","Shared Network refers to an open network of distributed cloud computing that allows participants (miners) to offer energy and computation resources at a variable cost to pseudonymous buyers. A Shared Network also includes open networks that provide miners with a low cost, decentralized alternative to the existing web service providers. The decentralized upholding of the network and its growth aligns with Metcalfe’s law of networks and relinquishes the need for large, centralized cloud service providers.","Within the Computing sector, Shared Storage Oracle and IoT are the three largest industry groups, representing 30.1%, 27.4%, and 27.2% of the sector market cap, respectively. Private Computing and Shared Network are smaller, representing 7.9% and 7.6% of the sector market cap, respectively.","\n","Exhibit 2: Computing Sector Breakdown by Industry Group","\n","Exhibit 3: Industry Groups Under Computing Sector","(CoinDesk Indices, May 13, 2022. Market capitalization data is based on 4\/30\/2022.)","Industries inside the Computing sector","Within the Computing sector, each industry group currently consists of a single industry to which a digital asset is assigned. Therefore, the industry composition of the sector is the same as the industry group composition. However, as the sector grows, it is possible for additional industries to emerge.","Major assets inside the Computing sector","There are 68 digital assets inside the Computing sector, with top assets Chainlink (LINK) 2, representing 17.2% of the Computing Sector, and the top 10 assets representing 63.4% of the total market cap. There are 19 assets in the Shared Storage Industry Group, totaling around $9 billion in market cap, with Filecoin (FIL) 1 being the largest. In the Oracle industry group, there are 11 assets totaling around $8 billion in market cap, with Chainlink (LINK) 2 being the largest. There are currently 11 assets in the IoT industry group, totaling $8 billion in market cap, with Internet Computer (ICP) being the largest. There are 12 assets in Private Computing Industry Group with $2 billion market cap and Threshold (T) as its largest token. Finally, there are 15 assets in the Shared Network Industry group, with $2 billion market cap and Ankr (ANKR) as its largest token.","Exhibit 4: Top 10 Assets Inside the DACS Computing Sector","(CoinDesk Indices, May 13, 2022. Market capitalization data is based on 4\/30\/2022.)","Conclusion","The Computing Sector includes assets that serve as platforms to decentralize the traditional web services; web services that have been prominent throughout Web 2.0. While many assets in this sector are still in the early adoption stage, their technology has strong foundations with decentralization as a key principle. By creating web services that are decentralized, more users can partake in and benefit from the application whilst giving providers economic incentives to sustain network growth. Decentralized distributed computing, storage and other services hold the potential to disrupt today’s web service providers and address the security issues associated with centralized databases as a central point of attack for malicious actors.","Read more: How to Add Value to Real-World Documents With Authentication","References","1. Filecoin (FIL): Filecoin is a distributed file storage protocols built on Ethereum. It enables secure and private transaction of encrypted files on an immutable and censorship resistant blockchain. Transaction costs are paid to both Ethereum miners and the Filecoin miners. This creates an ecosystem in which miners can benefit from supporting the network and running the protocol, and users can benefit from the increased security and privacy achieved by distributed computing.","2. Chainlink (LINK) is a decentralized, open-source oracle service built on Ethereum. Chainlink oracles have the ability to connect both on-chain to on-chain data as well as on-chain to off-chain data. It allows smart contracts to access off-chain data feeds securely.","3. Helium (HNT): Helium is a blockchain based network for IoT devices. It allows low-powered wireless devices to communicate with each other and send data across the network nodes operated by users who mine and earn rewards in Helium’s native token HNT. Helium offers a decentralized solution to improve the communication capabilities of wireless IoT devices.",".","Disclaimer:","CoinDesk Indices, Inc. (“CDI”) does not sponsor, endorse, sell, promote or manage any investment offered by any third party that seeks to provide an investment return based on the performance of any index.","CDI is neither an investment adviser nor a commodity trading adviser and makes no representation regarding the advisability of making an investment linked to any CDI index. CDI does not act as a fiduciary. A decision to invest in any asset linked to a CDI index should not be made in reliance on any of the statements set forth in this document or elsewhere by CDI.","All content contained or used in any CDI index (the “Content”) is owned by CDI and\/or its third-party data providers and licensors, unless stated otherwise by CDI. CDI does not guarantee the accuracy, completeness, timeliness, adequacy, validity or availability of any of the Content. CDI is not responsible for any errors or omissions, regardless of the cause, in the results obtained from the use of any of the Content. CDI does not assume any obligation to update the Content following publication in any form or format.","© 2022 CoinDesk Indices, Inc. All rights reserved."],"entity":[{"type":"7.6%","content":"PERCENT"},{"type":"17.2%","content":"PERCENT"},{"type":"63.4%","content":"PERCENT"},{"type":"Digitization, Culture & Entertainment","content":"ORGANIZATION"},{"type":"Decentralized Finance)","content":"ORGANIZATION"},{"type":"Private Computing Industry Group","content":"ORGANIZATION"},{"type":"30.1%","content":"PERCENT"},{"type":"Shared Storage Industry Group","content":"ORGANIZATION"},{"type":"Shared Network Industry","content":"ORGANIZATION"},{"type":"Oracle","content":"ORGANIZATION"},{"type":"Digital Asset Classification Standard (DACS","content":"ORGANIZATION"},{"type":"Computing Sector Breakdown by Industry Group","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"7.9%","content":"PERCENT"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"$2 billion","content":"MONEY"},{"type":"ICP","content":"LOCATION"},{"type":"CDI","content":"ORGANIZATION"},{"type":"Private Computing and Shared Network","content":"ORGANIZATION"},{"type":"Industry Groups Under Computing Sector","content":"ORGANIZATION"},{"type":"Metcalfe","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"1.7%","content":"PERCENT"},{"type":"Zad Mahana","content":"PERSON"},{"type":"IoT","content":"ORGANIZATION"},{"type":"Smart Contract Platform","content":"ORGANIZATION"},{"type":"DACS","content":"ORGANIZATION"},{"type":"$29.9 billion","content":"MONEY"},{"type":"Shared Storage Oracle","content":"ORGANIZATION"},{"type":"CoinDesk Indices DACS","content":"ORGANIZATION"},{"type":"December 2021","content":"DATE"},{"type":"27.4%","content":"PERCENT"},{"type":"CoinDesk Indices, Inc.","content":"ORGANIZATION"},{"type":"CoinDesk Indices, Inc","content":"ORGANIZATION"},{"type":"$9 billion","content":"MONEY"},{"type":"27.2%","content":"PERCENT"},{"type":"May 13, 2022","content":"DATE"},{"type":"$8 billion","content":"MONEY"},{"type":"CoinDesk DACS","content":"ORGANIZATION"},{"type":"DACS Glossary","content":"ORGANIZATION"}],"hashtag":["no-livewire","Data","CoinDesk Indices"],"authors":["Jodie Gunzberg"]}