{"summary":"And are bad men made or molded by circumstance?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/10\/12\/is-sam-bankman-fried-a-sociopath\/","publishDate":"2023-10-12T18:59:29","id":15145,"type":null,"title":"Is Sam Bankman-Fried a Sociopath?","category":["Consensus Magazine"],"content":["This week, as the criminal trial of Sam Bankman-Fried continues to unfold, there has been an emerging chorus of people willing to state, quite bluntly, that the founder of crypto exchange FTX and hedge fund Alameda Research is psychopathic. The former “golden boy” of crypto, aka SBF, is accused of multiple counts of fraud related to siphoning billions of dollars worth of his exchange customers’ money to fund a litany of investments.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","Convicted fraudster Martin Shkreli, for instance, wrote that “SBF practiced smiling so people wouldn't think he was a sociopath,” an insight apparently gleaned from Michael Lewis’ recently published biography of the FTX founder, “Going Infinite.” Shkreli has become a semi-notable commentator on SBF’s trial and jail conditions, given his own experience with the federal criminal justice system.","See also: Could Sam Bankman-Fried's Saga Happen Without Crypto? | Opinion","He also appeared on SBF confidant Tiffany Fong’s vlog series about the trial, in an episode titled “IS SBF A SOCIOPATH? Caroline Ellison, Love & Remorse.” Fong, who gained notoriety as a critical former user of failed lending company Celsius, has had multiple private conversations with SBF, including when visiting him while still under house arrest, and has leaked portions of SBF’s personal writings that SBF provided her.","If I were a psychiatrist (I’m not), I’d try not to violate the Goldwater Rule, but it is notable how often this armchair diagnosis of SBF's deeply immoral behavior comes up. It’s a reasonable reaction, to some extent. There’s a lot of evidence already in the public record about SBF’s conduct and demeanor over the years that suggest ill-intent or indifference to possible results over his increasingly risk-prone behavior.","Just yesterday, his former girlfriend and employee Caroline Ellison — whose diary SBF released, detailing their rocky relationship — testified that Bankman-Fried was willing to make strange bedfellows when it suited him. While searching for capital to cover the money he allegedly misappropriated, SBF reached out to Saudi Prince Mohammad Bin Salman and directed FTX staff to pay a bribe to state party members in China.","There have been reports alleging SBF was a bad actor stretching back to at least 2019, when he was still a rising star (with just over 6,000 followers on Twitter). Dave Mastrianni, a retired graphic designer and crypto trader, was part of a little-noticed lawsuit against Alameda, alleging the supposedly “market neutral” hedge fund ran pump-and-dumps and traded against FTX clients.","A lot of people were seemingly willing to paper over inconsistencies and rumors in SBF’s record, while others assumed blissful ignorance. Hasseb Qureshi, a founder of Dragonfly Capital, who kept a wide berth away from all things SBF after reviewing documents when presented with the opportunity to invest in FTX, thought the founder was just “flying too close to the sun.” Coinbase CEO Brian Armstrong has also stated FTX’s growth and pace of investments didn’t add up, and like others assumed Alameda must have been printing money.","Little did people know. To some extent, SBF did print money — in the form of exchange token FTT, the now-worthless asset that SBF used to cover up the fact that Alameda was functionally insolvent after taking funds “loans” it could never pay back from unknowing FTX users. FTT was collateralized to take out even more loans from companies like Genesis Capital, which Department of Justice prosecutors are arguing was securities fraud.","Tarun Chitra, who knew SBF socially, said FTT was the beginning of the end for FTX, and the turning point at which the self-proclaimed effective altruist Sam Bankman-Fried went bad. After selling FTT at a steep discount to market makers in 2018, SBF was put in a position of having to increase the “inflation” of the token that made what could have been a profitable exchange a “Ponzi.”","Lying, manipulating and indifference to the harm of others are common characteristics of sociopaths. But it’s an open question whether Sam Bankman-Fried became the alleged criminal now facing over 100 years in prison, or was born that way. Lewis’ book details the life of a man with anhedonia, the inability to feel happiness. In a lover’s note to Ellison, SBF writes “there’s a pretty decent argument that my empathy is fake, my feelings are fake, my facial reactions are fake.”","In an infamous VOX interview, which SBF claimed was off-the-record, SBF said his persona as a charitable billionaire was a front that made it easier to attract financing and gain users’ trust. Indeed, FTX’s flows to effective altruism causes pale in comparison to investments SBF allegedly directed, or signed off on, into luxury real estate startups and buy political favor.","The best defense here is that he was poisoned by an ideology that says capitalistic growth now does the most good later. But even the most calculating utilitarians would be hard pressed to say lying and theft pay for the harm caused along the way. SBF’s mom, a philosopher of consequence, also has atypical views on “blame,” preconceived notions of “right and wrong” and the extent people can choose to choose badly.","SBF’s formative years were also spent in a milieu influenced by the era of “cheap money” and “blitzscaling,” which incentivized ambitious people to cut corners for the sake of market dominance. Eight years his senior, SBF once argued Theranos founder Elizabeth Holmes’ major flaw was that “she lied.” Ironic now that Ellison, speaking on the stand, said baseline edicts like “don’t lie, don’t steal” weren’t part of SBF’s operating system.","See also: Sam Bankman-Fried's Altruism Wasn't Very Effective | Opinion","Ellison also said on the stand this week that she grew more and more comfortable with lying while working for SBF, who allegedly “directed” her to commit crimes. But where did that impulse from SBF come from?","Personally, I think it is often misleading to try to reframe a person’s entire life story to fit the context of crimes committed later. One of the imponderables of this trial is whether SBF is truly a sick man, or whether he was molded by circumstance.","His defense attorney’s argue a failed business is not necessarily fraudulent, and the mistakes are explained by “building a plane while flying on it.” SBF further claims his former lawyers constructed a narrative that he was a villain, in part to excuse the fact they often signed off on decisions — like using Signal, and excessive exec compensation — that failed the exchange.","Much of SBF’s most contemptible behavior isn’t even part of his trial. And whether his deceit has cause doesn’t mean it’s not sociopathic. But there’s a risk in saying SBF is uniquely unfeeling, uniquely evil in that it erases all of the reasons people like SBF keep popping up."],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Goldwater Rule","content":"PERSON"},{"type":"Elizabeth Holmes","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"Tiffany Fong","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Saga Happen Without Crypto","content":"ORGANIZATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Brian Armstrong","content":"PERSON"},{"type":"Martin Shkreli","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Michael Lewis","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"Dragonfly Capital","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"FTT","content":"ORGANIZATION"},{"type":"Genesis Capital","content":"ORGANIZATION"},{"type":"Fried","content":"ORGANIZATION"},{"type":"Hasseb Qureshi","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Dave Mastrianni","content":"PERSON"},{"type":"Love & Remorse","content":"ORGANIZATION"},{"type":"Alameda","content":"LOCATION"},{"type":"Saudi Prince Mohammad Bin Salman","content":"ORGANIZATION"},{"type":"VOX","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"siphoning billions of dollars","content":"MONEY"},{"type":"Tarun Chitra","content":"PERSON"},{"type":"China","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Sam Bankman-Fried","SBF Trial","Caroline ellison","Alameda Research","Fraud","Philosophy"],"authors":["Daniel Kuhn"]}