{"summary":"The company has released a quarter-end snapshot of a number of operating statistics.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/07\/22\/crypto-lender-blockfi-had-18b-in-open-loans-at-end-of-june-and-600m-of-exposure\/","publishDate":"2022-07-22T16:08:00","id":15141,"type":null,"title":"Crypto Lender BlockFi Had $1.8B in Open Loans at End of June and $600M of Exposure","category":["Finance"],"content":["BlockFi's loan portfolio stood at $1.8 billion at the end of the second quarter, the company said in a report released on Friday, with $1.2 billion of collateral posted at that time, thus leaving the company with exposure of $600 million.","At $1.5 billion, the overwhelming majority of loans were to institutional clients, with just $300 million made to retail borrowers, according to the report.","Defining \"exposure\" as the difference between the loan amount and the fair value of posted collateral, BlockFi said its exposure at the end of June was $600 million. Collateral may be digital assets, cash or other assets, the company said.","\"We require many, but not all, borrowers to post varying levels of collateral depending on the borrower's credit profile,\" BlockFi said.","Borrowers, of course, are subject to margin calls, and this snapshot from June 30 comes after BlockFi liquidated the collateral posted by failed crypto hedge fund Three Arrows Capital.","Exposure to Three Arrows and the crypto downturn in general threatened BlockFi, which in late June turned to crypto exchange FTX for a $250 million credit facility. On July 1, BlockFi CEO Zac Prince said his company had not drawn on the credit line and that operations were continuing as normal."],"entity":[{"type":"June 30","content":"DATE"},{"type":"$250 million","content":"MONEY"},{"type":"$600 million","content":"MONEY"},{"type":"Zac Prince","content":"PERSON"},{"type":"$1.5 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"BlockFi","content":"PERSON"},{"type":"$1.8 billion","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"end of the second quarter","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"$300 million","content":"MONEY"},{"type":"July 1","content":"DATE"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["BlockFi","FTX","Lending","Crypto Lending"],"authors":["Oliver Knight"]}