{"summary":"The Bitcoin \"halving\" was supposed to dramatically chop revenue of bitcoin mining companies. Instead, the simultaneous launch of Casey Rodarmor's Runes protocol has ignited a flurry activity on the oldest and largest blockchain, driving up fees.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/21\/bitcoin-miners-reap-windfall-as-runes-debut-sends-transaction-fees-to-record-highs\/","publishDate":"2024-04-21T20:18:43","id":15140,"type":null,"title":"Bitcoin Miners Reap Windfall as 'Runes' Debut Sends Transaction Fees to Record Highs","category":["Technology"],"content":["Bitcoin's once-every-four-years \"halving,\" which took place late last week, was supposed to bring a steep cut in revenue for crypto miners, since their rewards for new data blocks would drop by 50%.","Instead, the simultaneous launch of Casey Rodarmor's new Runes protocol – for minting digital tokens on top of the oldest and largest blockchain – has proven so popular that it's caused massive network congestion, sending transaction fees to record levels and showering Bitcoin miners with a windfall like never before.","Bitcoin transaction fees averaged a record $127.97 on April 20, when the halving took place and Runes launched, based on coordinated universal time. That's more than seven times the average fee rate on the day before, and roughly double the previous record set three years ago.","Total revenue for bitcoin miners, which includes the block rewards as well as transaction fees, soared to a record $107.8 million for the single day, according to YCharts.","The development could be bullish for big bitcoin mining firms including Marathon Digital Holdings ($MARA), Riot Blockchain ($RIOT), Hut 8 Mining (HUT) and Core Scientific (CORZ). (Marathon announced separately on Friday that it was rebranding to \"MARA,\" which happens to be its stock ticker.)","The quadrennial halvings were part of Bitcoin creator Satoshi Nakamoto's original design when it was launched in 2009, an effort to harden the original cryptocurrency's resistance to inflation with an ever-decreasing pace of new issuance. But with the rewards shrinking for miners, the question has been whether they would see adequate incentives to continue mining on the blockchain – crucial since their efforts are essential to the blockchain network's security.","\"We expect the particular frenzy pushing fees to these levels to die down in the relatively near term, but this episode is the latest indication that concerns about bitcoin’s long-term 'security budget' are misplaced,\" the Bitcoin-focused investment firm Ten31 wrote in a newsletter on Saturday.","Rodarmor's new Runes protocol can be used to spin up new digital tokens like those common on the Ethereum blockchain but thus far mostly absent from the Bitcoin ecosystem.","The launch was highly anticipated because Rodarmor was the primary developer behind Ordinals, which became extremely popular after it debuted last year as a novel way to mint NFTs on Bitcoin, previously unthinkable.","Rodarmor himself worried aloud on a recent episode of his Hell Money podcast whether Runes might be a flop; if the main use of Runes was to spin up \"meme coins\" for fickle traders whose speculative interests can shift quickly, why would these traders instinctively gravitate toward a blockchain optimized for security rather than for speed or low costs?","Come, they did, however, and Runes may have outstripped even some of the most ambitious expectations.","According to the website RuneAlpha, as of April 21 some 4,923 runes had already been etched, with 801,124 runes transactions and 68,548 holders.","\"The overall Runes ecosystem will likely be worth many billions of dollars,\" the blockchain researcher Saurabh Deshpande wrote in a post on Decentralised.co.","Several crypto exchanges, including OKX and Gate.io, have already listed some of the newly minted runes, such as SATOSHI•NAKAMOTO, for trading.","Jimmy Song, an independent Bitcoin developer and commentator, wrote in a blog post on Saturday that the Runes frenzy has made it nearly impossible to get a transaction included into certain blocks without paying an exorbitantly high transaction fee.","\"The Runes asset issuance has overridden almost every other use case at the moment,\" Song wrote.","The Bitcoin Layer substack wrote that Runes appears to be a \"game of greater fools in which essentially everybody loses,\" but it does take up block space and may \"accentuate the need for hastening the development of and further expansion of liquidity on layer-2 scaling solutions like the Lightning Network.\"","Transaction fees as a percentage of the total miner revenue per block jumped to their highest level ever of 75%, according to the authors Joe Consorti and Nik Bhatia.","It's \"a preview of what’s to come in Bitcoin mining economics decades from now, as Bitcoin monetizes into a $10 trillion+ asset, demand for the network is orders of magnitude larger than today, and we’ve had a few more halvings,\" they wrote.","Grayscale, the money manager behind the Grayscale Bitcoin Trust (GBTC), remarked on the potentially dramatic change in outlook for miners in an emailed newsletter on Saturday.","\"If transaction fees normalize at a level higher than in the past, the impact of the halving on miner revenue will be dampened,\" Grayscale wrote."],"entity":[{"type":"Bitcoin monetizes","content":"ORGANIZATION"},{"type":"Rodarmor","content":"PERSON"},{"type":"April 21","content":"DATE"},{"type":"$107.8 million","content":"MONEY"},{"type":"$MARA","content":"MONEY"},{"type":"MARA","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"$10 trillion","content":"MONEY"},{"type":"April 20","content":"DATE"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Joe Consorti","content":"PERSON"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Nik Bhatia","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"Saturday","content":"DATE"},{"type":"$127.97","content":"MONEY"},{"type":"SATOSHI•NAKAMOTO","content":"PERSON"},{"type":"$RIOT","content":"MONEY"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"75%","content":"PERCENT"},{"type":"Saurabh Deshpande","content":"PERSON"},{"type":"Marathon Digital Holdings","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Bitcoin Mining","Bitcoin Miners","Halving","Runes","Ordinals","Hut 8 Mining","marathon digital holdings","Riot Blockchain","Core Scientific"],"authors":["Bradley Keoun"]}