{"summary":"The company already faces a suit from the Commodity Futures Trading Commission.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/06\/05\/sec-sues-crypto-exchange-binance-ceo-changpeng-zhao\/","publishDate":"2023-06-05T15:15:10","id":15156,"type":null,"title":"SEC Sues Crypto Exchange Binance and CEO Changpeng Zhao, Alleging Multiple Securities Violations","category":["Policy"],"content":["The U.S. Securities and Exchange Commission sued crypto exchange Binance, the operating company for Binance.US and Binance founder and CEO Changpeng \"CZ\" Zhao on allegations of violating federal securities laws on Monday.","Binance, Binance.US and CZ offered unregistered securities to the general public in the form of the BNB token and Binance-linked BUSD stablecoin, said the suit, which also alleges that Binance's staking service violated securities law. There are similar charges against BAM Trading – the operating company for Binance.US – and Binance itself, including failure to register as a clearing agency, failure to register as a broker and failure to register as an exchange. The SEC also alleged that Binance allowed for commingling of customer funds, that CZ was \"secretly\" controlling Binance.US and that a CZ-owned and operated entity was inflating Binance.US's trading volume.","Read More: Binance Endures $69M in Net Outflows Within an Hour, Amid SEC Charge: Nansen","The suit also alleged multiple times that Binance allowed U.S. persons (meaning U.S. citizens or people living in the U.S.) to trade on its platform, despite saying it wasn't.","\"As a second part of Zhao’s and Binance’s plan to shield themselves from U.S. regulation, they consistently claimed to the public that the Binance.com Platform did not serve U.S. persons, while simultaneously concealing their efforts to ensure that the most valuable U.S. customers continued trading on the platform,\" the suit said. \"When the Binance.US Platform launched in 2019, Binance announced that it was implementing controls to block U.S. customers from the Binance.com Platform. In reality, Binance did the opposite. Zhao directed Binance to assist certain high-value U.S. customers in circumventing those controls and to do so surreptitiously because – as Zhao himself acknowledged – Binance did not want to 'be held accountable' for these actions.\"","The SEC also alleged that a number of other tokens, including the native coins for the Solana (SOL), Cardano (ADA), Polygon (MATIC), Coti (COTI) and Algorand blockchains (ALGO), Filecoin network (FIL), Cosmos hub (ATOM), Sandbox platform (SAND), Axie infinity (AXS) and Decentraland (MANA) are securities.","Binance's own Chief Compliance Officer told another employee in 2018 that \"we are operating as a fking unlicensed securities exchange in the USA,\" the suit said.","Binance and its poor financial controls meant that customer funds were diverted, including potentially for personal uses, the suit said. Merit Peak Limited, a market maker previously tied to Zhao, had access to \"billions of U.S. dollars of customer funds,\" while Sigma Chain, another CZ-controlled entity, received nearly $200 million from BAM Trading and a BAM Trading custody account, the SEC alleged. CZ himself allegedly \"personally received $62.5 million from one of the Binance bank accounts\" between October 2022 and January 2023.","\"Lacking regulatory oversight, Defendants were free to and did transfer investors’ crypto and fiat assets as Defendants pleased, at times commingling and diverting them in ways that properly registered brokers, dealers, exchanges and clearing agencies would not have been able to do,\" the suit said.","Sigma Chain also bought a yacht for $11 million from the account that had access to customer funds, the SEC said.","According to the suit, CZ owned 100% of an entity called \"CPZ Holdings Limited,\" which in turn owned 100% of \"BAM Management Company Limited,\" which for its part owned 81% of \"BAM Management US Holdings Inc.,\" with the remaining equity going to seed investors and former employees. BAM Management US was the parent company to BAM Trading Services, which in turn operates Binance.US.","The SEC revealed internal struggles U.S. CEOs had with CZ and top Binance officials controlling the U.S. operations despite assurances of independence. The U.S. operations complained of \"shackles\" that demanded its managers get approval from the global company for basic functions.","Read More: Coinbase Shares Drop 10% Following SEC’s Suit Against Binance","\"I realized, huh, I'm not actually the one running this company, and the mission that I believe I signed up for isn't the mission. And as soon as I realized that, I left,\" former U.S. CEO Brian Brooks – who took over after running the U.S. Office of the Comptroller of the Currency – is quoted as saying, though he's identified only as \"CEO B\" in the suit. Brooks resigned after just three months at the helm of Binance's U.S. arm.","Brooks had particular worries about what Merit Peak and Sigma Chain were doing on the Binance.US platform.","\"Our customers couldn't, you know, clear orders without the presence of those makers on our platform, I thought that was a real problem,\" Brooks is quoted as saying. \"It suggested that the company was, in fact, heavily dependent on CZ, not just as a control person but also as an economic counterparty.\"","Catherine Coley, who was the U.S. operations' first CEO, complained internally at one point that her \"entire team is at their breaking point,\" according to the suit, which identified her as \"CEO A.\"","At one point, Coley tried to pursue what she called \"Project 1776\" – a reference to the American Revolution. She told a fellow employee it was \"for our independence,” according to the suit.","Part of the SEC suit references the so-called \"Tai Chi\" documents, which Forbes originally reported on in 2020, which appeared to be a plan for Binance to officially exit the U.S. while still maintaining a presence through an affiliate.","The suit quotes Binance employees discussing ways to allow U.S. customers to trade on binance.com.","Also of concern: Binance had access to Binance.US's wallets and assets, and had access to the U.S. entity's custody tools and private keys, the SEC alleged.","The company also tapped market makers – specifically Merit Peak and Sigma Chain – to boost trading volume on Binance.US. This created conflicts of interest between CZ and Binance.US's customers, the SEC alleged.","\"To create and maintain liquidity on the Binance.US Platform, BAM Trading recruited market making firms and other institutions, often offering low fees as incentives. Zhao and Binance were intimately involved in these efforts, which placed Zhao’s financial interests at odds with those of the customers trading on the platform he controlled,\" the SEC said.","The suit also noted that Binance.US operates its own OTC desk, and over a two-year period, its only counterparty was Alameda Research, which was founded by FTX creator Sam Bankman-Fried. Alameda, alongside the rest of the FTX empire, collapsed last November.","In a long tweet, Binance.US called the suit \"the latest example of regulation by enforcement,\" and said it believed the suit was \"baseless.\"","Binance shared a statement on its blog, saying the company had \"actively cooperated with the SEC's investigations and have worked hard to answer their questions and address their concerns,\" as well as work toward a settlement.","\"To be clear: any allegations that user assets on the Binance.US platform have ever been at risk are simply wrong, and there is zero justification for the Staff’s action in light of the ample time the Staff has had to conduct their investigation. All user assets on Binance and Binance affiliate platforms, including Binance.US, are safe and secure, and we will vigorously defend against any allegations to the contrary,\" the statement said.","Read More: Binance Hands Rising Star Teng Key Role to Replace CEO Zhao at Largest Crypto Exchange","In a press release, SEC Chair Gary Gensler said, \"Through thirteen charges, we allege that Zhao and Binance entities engaged in an extensive web of deception, conflicts of interest, lack of disclosure, and calculated evasion of the law.\"","An SEC spokesperson referred CoinDesk to a press release shared by the agency. A Binance spokesperson sent CoinDesk a similar statement to its blog post, saying the tokens named by the SEC are not securities.","The SEC lawsuit adds to allegations brought in March of this year by the U.S. regulator Commodity Futures Trading Commission (CFTC) that Binance and its founder Changpeng Zhao knowingly offered unregistered crypto derivatives products in the U.S. against federal law. Many of the allegations in the SEC's lawsuit also resembles the CFTC's complaint.","In a tweet, CZ tweeted \"4,\" essentially calling the news \"fud,\" (for fear, uncertainty and doubt).","The SEC is seeking to halt Binance, Binance.US and \"each of their respective agents,\" etc. from continuing to violate federal laws, disgorge any \"ill-gotten gains\" with prejudgement interest and pay civil penalties.","The SEC also wants to bar CZ from being an officer or director of any securities issuer, and block Binance, Binance.US and CZ from participating or trading any securities, \"including crypto asset securities.\"","This would also include blocking the defendants from acting as an unregistered broker, clearing agency or exchange with any crypto asset securities, the suit said.","Read the full suit at this link.","Jesse Hamilton, Ian Allison, Jack Schickler and Helene Braun contributed reporting.","UPDATE (June 5, 2023, 15:23 UTC): Adds CZ tweet.","UPDATE (June 5, 15:35 UTC): Adds details from suit.","UPDATE (June 5, 16:00 UTC): Adds additional allegations and details.","UPDATE (June 5, 16:20 UTC): Adds Binance, Binance.US responses.","UPDATE (June 5, 17:20 UTC): Adds additional detail.","UPDATE (June 5, 17:25 UTC): Adds additional Binance statement.","UPDATE (June 5, 18:15 UTC): Adds SEC tweet."],"entity":[{"type":"$11 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"January 2023","content":"DATE"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"June 5","content":"DATE"},{"type":"Brian Brooks","content":"PERSON"},{"type":"Binance Hands Rising Star Teng","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Helene Braun","content":"PERSON"},{"type":"$69M","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Coley","content":"PERSON"},{"type":"81%","content":"PERCENT"},{"type":"\" Brooks","content":"PERSON"},{"type":"Zhao","content":"ORGANIZATION"},{"type":"BAM Management US Holdings Inc.","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Brooks","content":"PERSON"},{"type":"Tai Chi","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Jesse Hamilton","content":"PERSON"},{"type":"Jack Schickler","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"CPZ Holdings Limited","content":"ORGANIZATION"},{"type":"USA","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"October 2022","content":"DATE"},{"type":"November","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"Largest Crypto Exchange","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Catherine Coley","content":"PERSON"},{"type":"BAM Trading Services","content":"ORGANIZATION"},{"type":"$200 million","content":"MONEY"},{"type":"$62.5 million","content":"MONEY"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Cardano (ADA","content":"ORGANIZATION"},{"type":"BAM Management Company Limited","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"American Revolution","content":"ORGANIZATION"},{"type":"Forbes","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"June 5, 2023","content":"DATE"},{"type":"March of this year","content":"DATE"},{"type":"Ian Allison","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Regulations","SEC","Binance","lawsuits","Binance.US","CZ"],"authors":["Nikhilesh De"]}