{"summary":"\"Wherever I sit, is going to be the Binance office,\" says Changpeng \"CZ\" Zhao.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2020\/05\/08\/binance-doesnt-have-a-headquarters-because-bitcoin-doesnt-says-ceo\/","publishDate":"2020-05-08T16:45:21","id":15153,"type":null,"title":"Binance Doesn’t Have a Headquarters Because Bitcoin Doesn’t, Says CEO","category":["Markets"],"content":["","Binance CEO Changpeng \"CZ\" Zhao really doesn't want to tell you where his firm's headquarters is located.","","","To kick off ConsenSys' Ethereal Summit on Thursday, Unchained Podcast host Laura Shin held a cozy fireside chat with Zhao who, to mark the occasion, was wearing a personalized football shirt emblazoned with the Binance brand.","","","Scheduled for 45 minutes, Zhao spent most of it explaining how libra and China's digital yuan were unlikely to be competitors to existing stablecoin providers; how Binance's smart chain wouldn't tread on Ethereum's toes – \"that depends on the definition of competing,\" he said – and how Binance had an incentive to keep its newly acquired CoinMarketCap independent from the exchange.","","","There were only five minutes left on the clock. Zhao was looking confident; he had just batted away a thorny question about an ongoing lawsuit. It was looking like the home stretch.","","","Then it hit. Shin asked the one question Zhao really didn't want to have to answer, but many want to know: Where is Binance's headquarters?","","","This seemingly simple question is actually more complex. Until February, Binance was considered to be based in Malta. That changed when the island European nation announced that, no, Binance is not under its jurisdiction. Since then Binance has not said just where, exactly, it is now headquartered.","","","Little wonder that when asked Zhao reddened; he stammered. He looked off-camera, possibly to an aide. \"Well, I think what this is is the beauty of the blockchain, right, so you don't have to ... like where's the Bitcoin office, because Bitcoin doesn't have an office,\" he said.","","","The line trailed off, then inspiration hit. \"What kind of horse is a car?\" Zhao asked. Binance has loads of offices, he continued, with staff in 50 countries. It was a new type of organization that doesn't need registered bank accounts and postal addresses.","","","\"Wherever I sit, is going to be the Binance office. Wherever I need somebody, is going to be the Binance office,\" he said.","","","See also: Binance Is Not Under Our Jurisdiction, Says Malta Regulator","","","Zhao may have been hoping the host would move onto something easier. But Shin wasn't finished: \"But even to do things like to handle, you know, taxes for your employees, like, I think you need a registered business entity, so like why are you obfuscating it, why not just be open about it like, you know, the headquarters is registered in this place, why not just say that?\"","","","Zhao glanced away again, possibly at the person behind the camera. Their program had less than two minutes remaining. \"It's not that we don't want to admit it, it's not that we want to obfuscate it or we want to kind of hide it. We're not hiding, we're in the open,\" he said.","","","Shin interjected: \"What are you saying that you're already some kind of DAO [decentralized autonomous organization]? I mean what are you saying? Because it's not the old way [having a headquarters], it's actually the current way ... I actually don't know what you are or what you're claiming to be.\"","","","Zhao said Binance isn't a traditional company, more a large team of people \"that works together for a common goal.\" He added: \"To be honest, if we classified as a DAO, then there's going to be a lot of debate about why we're not a DAO. So I don't want to go there, either.\"","","","\"I mean nobody would call you guys a DAO,\" Shin said, likely disappointed that this wasn't the interview where Zhao made his big reveal.","","","See also: Binance CEO Says Crypto Exchange Has Applied for a Singapore License","","","Time was up. For an easy question to close, Shin asked where Zhao was working from during the coronavirus pandemic.","","","\"I'm in Asia,\" Zhao said. The blank white wall behind him didn't provide any clues about where in Asia he might be. Shin asked if he could say which country – after all, it's the Earth's largest continent.","","","\"I prefer not to disclose that. I think that's my own privacy,\" he cut in, ending the interview.",""],"entity":[{"type":"Laura Shin","content":"PERSON"},{"type":"Earth","content":"LOCATION"},{"type":"Binance","content":"LOCATION"},{"type":"Shin","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"February","content":"DATE"},{"type":"Zhao","content":"PERSON"},{"type":"Asia","content":"LOCATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Unchained Podcast","content":"ORGANIZATION"},{"type":"Malta","content":"LOCATION"},{"type":"Says Malta Regulator","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Crypto Exchange","content":"ORGANIZATION"},{"type":"Singapore License","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"China","content":"LOCATION"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Exchanges","Changpeng Zhao","Binance"],"authors":["Paddy Baker"]}