{"summary":"The company is backed by Shalom Meckenzie, the largest individual shareholder in sports betting company DraftKings.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/09\/21\/draftkings-billionaire-backed-crypto-analytics-firm-coinscan-raises-63m\/","publishDate":"2023-09-21T07:00:00","id":15160,"type":null,"title":"DraftKings' Billionaire-Backed Crypto Analytics Firm CoinScan Raises $6.3M","category":["Finance"],"content":["CoinScan, an analytics platform aiming to provide crypto users with data that could help reduce losses from exploits, hacks and scams, said it has raised $6.3 million in funding.","The company is backed by Shalom Meckenzie, the largest individual shareholder in sports-betting company DraftKings (DKNG), Mor Weizer, the CEO of gambling software development firm Playtech (PTEC) and Tectona (TECT), a Tel Aviv Stock Exchange-listed digital asset trading firm.","CoinScan, which has been under development for two years, is emerging from stealth to develop products that help assess a token's susceptibility to rug pulls or its distribution, wallet holdings and buying and selling activities in real time.","Losses from hacks, exploits and scams across the crypto sector this year topped $1 billion by early September, according to blockchain security firm Certik, shining a light on the scale of the problem CoinScan is seeking to help address.","Read More: Coinbase Earned $1M Amid Hack, but Hasn't Reimbursed Victims","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"$1M","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"September","content":"DATE"},{"type":"Certik","content":"PERSON"},{"type":"Tel Aviv Stock Exchange","content":"ORGANIZATION"},{"type":"$6.3 million","content":"MONEY"},{"type":"Shalom Meckenzie","content":"PERSON"},{"type":"Mor Weizer","content":"PERSON"}],"hashtag":["Hacks","Exploits","Scams","Funding","Fundraising","DraftKings"],"authors":["Jamie Crawley"]}