{"summary":"In 2022, “DeFi performed exceedingly well while CeFi and some traditional methodologies for transacting had some challenges,” Jason Urban, Galaxy’s global head of trading, told CoinDesk TV.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/05\/18\/galaxy-executed-its-first-otc-options-trade-as-demand-for-on-chain-options-ramps-up\/","publishDate":"2023-05-18T15:49:29","id":15164,"type":null,"title":"Galaxy Executed Its First OTC Options Trade as Demand for On-Chain Options Ramps Up","category":["Markets"],"content":["Galaxy Digital’s first over-the-counter (OTC) option trade, executed earlier this week, marks a tangible step toward bringing the conventional financial system onto decentralized finance (DeFi) infrastructure.","FTX’s blowup and the collapse of several crypto lenders brought attention to the risks of centralized finance (CeFi) – AKA trusting one’s money with a company, rather than a protocol – providing a tailwind for DeFi. Galaxy said in a statement that recent market events have highlighted the vulnerabilities of traditional bilateral options trading.","“One thing that 2022 has told us is that DeFi performed exceedingly well while CeFi and some traditional methodologies for transacting had some challenges,” Jason Urban, Galaxy’s global head of trading, said in an interview this week with CoinDesk TV.","Ribbon Finance’s options trading platform, Aevo, executed the Galaxy trade with crypto investment company CoinFund.","These options are a form of derivative that trade in the over-the-counter market rather than on an exchange. They tend to be a private transaction between the buyer and the seller. Derivatives are becoming a more important part of the crypto market, with its share of overall volume hitting an all-time high last month compared with spot trading.","The ability to trade bilateral options tied to cryptocurrencies with Galaxy removes credit risk, which is normally associated with traditional OTC options trades, Galaxy said in a statement. This is because users send their collateral to a smart contract rather than to a counterparty, making the user less exposed to the counterparty and what they might be doing with one’s collateral.","This is a big step forward in bootstrapping the liquidity needed to help DeFi derivatives continue to grow, according to Christopher Newhouse, an independent crypto derivatives trader. He added that Aevo OTC is a unique offering as it focuses on some of the popular altcoin options which are not traded on screens and are all OTC.","“As a more liquid options and derivatives market for altcoins continue to grow, we may start to see lower volatility in these tokens as well – which may drive further institutional interest in things outside of just BTC\/ETH,” said Newhouse.","He noted that the market is still a long way off from traditional finance firms getting comfortable getting their crypto exposure through altcoins rather than the larger cap tokens like bitcoin (BTC) and ether (ETH).","Edited by Nick Baker."],"entity":[{"type":"Aevo","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"CoinDesk TV","content":"ORGANIZATION"},{"type":"Galaxy","content":"ORGANIZATION"},{"type":"Newhouse","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Aevo OTC","content":"ORGANIZATION"},{"type":"Christopher Newhouse","content":"PERSON"},{"type":"Jason Urban","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Trading","OTC","Galaxy"],"authors":["Lyllah Ledesma"]}