{"summary":"Crypto allows brands to give customers a voice, leading to stronger communities and products.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/07\/01\/why-brands-should-adopt-a-hybrid-dao-model\/","publishDate":"2022-07-01T13:44:51","id":15169,"type":null,"title":"Why Brands Should Adopt a ‘Hybrid DAO’ Model","category":["Consensus Magazine (layer2)"],"content":["The decentralized autonomous organization (DAO) is emerging as Web3’s answer to the traditional LLC or C-corp.","According to one report, the number of new DAO governance proposals, which codify a company's organizational and operational structure, has risen eightfold in the past year. In May 2021, only 700 DAOs were operational. Today there are more than 6,000.","Simon Yu the CEO and co-founder of StormX. This article is part of “Future of Work Week.”","Bringing DAOs into the mainstream is complicated, especially in a nascent crypto environment where people are often more committed to making a buck than building sustainable companies. Consequently, many brands and companies aren't in a position to fully decentralize their corporate structure, eliminate titles and put all decisions in the hands of a decentralized community of pseudonymous members.","Every company, however, can implement a hybrid DAO model that gives customers a greater voice, increasing engagement and putting brands in a position to thrive in a decentralized future.","DAOs offer a unique learning experience for brands preparing for the inevitable rise of the metaverse and other blockchain-based business elements. The main goal as always is to find realistic and durable ways to increase engagement from their consumer base.","For starters, customer engagement is critical to bottom-line outcomes. According to one customer engagement report, brands that invest in and elevate customer engagement saw increased revenue by 70%, a staggering sum that underscores the importance of developing communities and relationships.","Read more: What It’s Like to Work as a DAO Bounty Hunter","Meanwhile, customers with positive brand experiences are 50% more likely to try new products or pay premium prices. That’s why customer engagement is central to operational sustainability and revenue growth for successful companies.","A hybrid DAO model – where projects deploy a community-owned token – can enhance customer engagement by offering all stakeholders an opportunity to have a voice in a variety of decisions that enhance buy-in, inform better products and cultivate community.","This is all theoretically possible for brands without those brands having to completely overhaul their existing structures.","A hybrid DAO can take many forms. Ultimately, it’s about allowing customers to propose and vote on various product or service features.","For instance, brands can distribute a product road map poll, letting stakeholders weigh in on the most important feature enhancements and new capabilities. This delivers the voice of the customer directly to product development teams, which can simultaneously enhance customer sentiment and brand maturation.","Similarly, brands can embrace a DAO ethos by engaging stakeholders on:","When brands give customers more of a voice, they foster an avid following of loyal customers who are highly invested in the future of the brand\/product because they are contributing to elements of decision making.","Simply put, insights into customer demands and desires help brands to be more successful in delivering what people actually want. Crowdsourcing ideas can lead to even stronger end results when it comes to changes to products, branding, design and more.","In other words, brands can benefit from the wisdom of the crowd.","Read more: How I Made It: From Pro Baller to Master of DAOs","Brands and companies that adopt a hybrid DAO model will create a shift from thinking of buyers as \"customers\" to thinking of them as team members and part of their community. This shift in brand mindset could have greater repercussions for business culture and structure than can be fully anticipated.","Ultimately, the rise of the metaverse and Web3 will favor brands that adopt this type of model over those that do not, making a hybrid DAO model a multifaceted competitive differentiator that can set brands apart from the competition both now and in the years ahead.","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","Meet the pioneers who work at decentralized autonomous organizations.","It may be a bear market, but there are still plenty of jobs to be had at crypto companies."],"entity":[{"type":"70%","content":"PERCENT"},{"type":"May 2021","content":"DATE"},{"type":"50%","content":"PERCENT"},{"type":"corp","content":"ORGANIZATION"}],"hashtag":["Future of Work Week","Opinion","DAO","Governance"],"authors":["Simon Yu"]}