{"summary":"Also: Fun and games in DeFi and the metaverse","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2021\/10\/20\/ethereums-difficulty-bomb-timing-hints-at-an-early-summer-merge\/","publishDate":"2021-10-20T11:30:00","id":15161,"type":null,"title":"Ethereum’s ‘Difficulty Bomb’ Timing Hints at an Early Summer Merge","category":["Technology"],"content":["This article originally appeared in Valid Points, CoinDesk’s weekly newsletter breaking down Ethereum 2.0 and its sweeping impact on crypto markets. Subscribe to Valid Points here.","During Ethereum Core Devs Meeting #124 on Oct. 15, a proposal to push December’s “difficulty bomb” was discussed. According to ETH Hub, the “Difficulty Bomb refers to a mechanism that, at a predefined block number, increases the difficulty level of puzzles in the proof-of-work mining algorithm resulting in longer than normal block times (and thus less ETH rewards for miners).”","In other words, it increases mining difficulty exponentially over time, eventually leading to an “Ice Age,” which would force the chain to stop producing blocks, essentially “freezing out” proof-of-work mining as Ethereum shifts to its proof-of-stake consensus mechanism.","Read more: What to Expect When Ethereum 2.0 Undergoes Its First ‘Hard Fork’","Most importantly, the date of the difficulty bomb gives insight into when the Merge is expected to occur, since it will disincentivize miners from continuing to mine Ethereum’s proof-of-work chain at that point.","Following the discussion on Friday, developers are now considering setting the effects of the difficulty bomb to take place in June 2022. That means the delay targets the Merge to take place before that date.","Since the code for the difficulty bomb was first introduced in 2015, it has been delayed four times.","Ethereum Project Manager Tim Beiko tweeted, “We think ~4 months is a generous timeframe from having the code done to seeing the Merge on mainnet.”","Once again, the difficulty bomb does not set the Merge’s date in stone. Beacon Chain developers and the client teams use the difficulty bomb to keep them on track. If they have to delay the bomb again it will eat at time they could be spending on the transition to proof-of-stake. However, if the bomb is set too far away it loses its utility of disincentivizing the proof-of-work chain. Thus, the projected date represents the best data point we can use to estimate when the developers feel they will be ready to deploy the necessary code for the Merge.","Follow @TimBeiko on Twitter for weekly summaries of the Core Devs Call or listen in on Friday mornings to hear more about the progress of Ethereum!","Welcome to another edition of Valid Points.","The following is an overview of network activity on the Ethereum 2.0 Beacon Chain over the past week. For more information about the metrics featured in this section, check out our 101 explainer on Eth 2.0 metrics.","Disclaimer: All profits made from CoinDesk’s Eth 2.0 staking venture will be donated to a charity of the company’s choosing once transfers are enabled on the network.","Valid Points incorporates information and data about CoinDesk’s own Eth 2.0 validator in weekly analysis. All profits made from this staking venture will be donated to a charity of our choosing once transfers are enabled on the network. For a full overview of the project, check out our announcement post.","You can verify the activity of the CoinDesk Eth 2.0 validator in real time through our public validator key, which is:","0xad7fef3b2350d220de3ae360c70d7f488926b6117e5f785a8995487c46d323ddad0f574fdcc50eeefec34ed9d2039ecb.","Search for it on any Eth 2.0 block explorer site."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"Tim Beiko","content":"PERSON"},{"type":"Valid Points","content":"ORGANIZATION"},{"type":"Ethereum Core Devs Meeting","content":"ORGANIZATION"},{"type":"Oct. 15","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"December","content":"DATE"},{"type":"Valid Points","content":"LOCATION"},{"type":"ETH Hub","content":"ORGANIZATION"},{"type":"mornings","content":"TIME"}],"hashtag":["Ethereum 2.0","Validators","Valid Points","Difficulty Bomb","The Protocol"],"authors":["Edward Oosterbaan"]}