{"summary":"Volatility following the Grayscale's court victory over the SEC failed to translate into trading volumes on centralized exchanges, CCData said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/09\/07\/crypto-spot-market-august-trading-volume-hits-45-year-low-as-volatility-fails-to-spur-activity\/","publishDate":"2023-09-07T10:35:12","id":15178,"type":null,"title":"Crypto Spot Market August Trading Volume Hits 4.5-Year Low as Volatility Fails to Spur Activity","category":["Markets"],"content":["Activity in the crypto spot market fell to the lowest level in more than four years last month, extending a lull at digital asset trading desks, as volatility sparked by Grayscale Investments' court victory over the U.S. Securities and Exchange Commission failed to stir traders from their torpor.","Spot trading volume on centralized exchanges cooled for a second straight month, falling 7.78% to $475 billion, the least since March 2019, according to digital assets data and index provider CCData. Trading volume refers to the total number of tokens that changed hands during a specific period.","Volume in derivatives fell over 12% to $1.62 trillion, the second-lowest since 2021, and derivatives' share of total market activity contracted for a third consecutive month to 77.3%. The dollar value locked in open derivatives contracts tanked 19.5% to $17.1 billion, wiping out $4.13 billion in open interest on selected exchanges. That's the largest decline in open interest this year.","The continuing decline is creating a challenging environment for exchanges and market makers, who have been facing a tough time since Sam Bankman-Fried's FTX exchange went bust last November. The collapse dented investor confidence in centralized exchanges and cratered market depth. According to Bloomberg, the profit margin of market makers has declined by 30% since the collapse of FTX.","\"The combined trading volume of spots and derivatives on centralized exchanges fell 11.5% to $2.09 trillion as the volatility following the Grayscale's victory over SEC failed to translate into trading volumes on centralized exchanges,\" CCData said in a report shared with CoinDesk. \"The low spot trading volume and the fluctuations in the open interest data suggest that the market is currently driven by speculation.\"","Grayscale is a subsidiary of Digital Currency Group, CoinDesk's parent company.","Volume figures might have been worse had it not been for the brief volatility spike on Aug. 17 and at the end of the month. Bitcoin, the leading cryptocurrency by market value, fell over 10% to $25,000 on Aug. 17, tracking risk aversion in traditional markets. The price briefly rose to $28,000 Aug. 29, cheering Grayscale's legal victory over the SEC.","Among exchanges, Binance's spot market share contracted for the sixth straight month to 38.5%, the lowest since August 2022. Its share in derivatives dropped to 53.5%, the weakest since June 2022. Still, the exchange retained the top spot, recording $183 billion in spot trading volume and $865 billion in derivatives. In June, the U.S. SEC charged Binance for violating securities law.","In contrast, Huobi's share in the global spot market activity rose 2.26% and accounted for 6.09% of the total spot market volume. That made it the second-largest centralized spot exchange by volume.","In derivatives, Bitget and Bybit saw their shares in the total activity increase to 8.66% and 12.7%, respectively.","Total crypto derivatives volume on the Chicago Mercantile Exchange, considered a proxy for institutional activity, rose 4.51% to $41.9 billion, with volumes in ether options hitting an all-time high of $365 million.","Edited by Sheldon Reback."],"entity":[{"type":"U.S. SEC","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"12.7%","content":"PERCENT"},{"type":"Grayscale","content":"ORGANIZATION"},{"type":"August 2022","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Aug. 17","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"four years last month","content":"DATE"},{"type":"Grayscale Investments","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"$475 billion","content":"MONEY"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"Chicago Mercantile Exchange","content":"ORGANIZATION"},{"type":"$865 billion","content":"MONEY"},{"type":"Huobi","content":"ORGANIZATION"},{"type":"March 2019","content":"DATE"},{"type":"77.3%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"4.51%","content":"PERCENT"},{"type":"$25,000","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$183 billion","content":"MONEY"},{"type":"June 2022","content":"DATE"},{"type":"2.26%","content":"PERCENT"},{"type":"2021","content":"DATE"},{"type":"19.5%","content":"PERCENT"},{"type":"Aug. 29","content":"DATE"},{"type":"38.5%","content":"PERCENT"},{"type":"11.5%","content":"PERCENT"},{"type":"$4.13 billion","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"7.78%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"$365 million","content":"MONEY"},{"type":"$28,000","content":"MONEY"},{"type":"53.5%","content":"PERCENT"},{"type":"$2.09 trillion","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$1.62 trillion","content":"MONEY"},{"type":"$17.1 billion","content":"MONEY"},{"type":"6.09%","content":"PERCENT"},{"type":"$41.9 billion","content":"MONEY"},{"type":"Binance","content":"ORGANIZATION"},{"type":"8.66%","content":"PERCENT"}],"hashtag":["Cryptocurrency","Spot market","Derivatives market","Trading Volume","Markets"],"authors":["Omkar Godbole"]}