{"summary":"As investigations loomed, the board of directors of Binance.US voted on whether to liquidate the company but could not come to a unanimous decision, The Information reported.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/08\/02\/binance-nearly-shuttered-us-exchange-to-protect-global-operations-the-information\/","publishDate":"2023-08-02T00:19:03","id":15179,"type":null,"title":"Binance Nearly Shuttered U.S. Exchange to Protect Global Operations: The Information","category":["Finance"],"content":["Binance CEO and founder Changpeng \"CZ\" Zhao came close to shuttering the crypto exchange's U.S. arm earlier this year in order to protect the wider company, The Information reported on Tuesday.","A person familiar with the matter told the outlet that the board of directors of Binance.US, the U.S. affiliate of the massive exchange, voted on whether to liquidate the company but could not come to a unanimous decision, with Binance.US CEO Brian Shroder blocking the decision. Zhao serves as chair for the Binance.US board of directors.","A spokesperson for Binance.US did not have a comment when reached by CoinDesk.","Binance has been under heightened regulatory scrutiny in recent months over the handling of its global operations. Earlier this month, the Securities and Exchange Commission (SEC) sued Binance, Binance.US and CZ, alleging that the companies operated as an unregistered securities exchange. And in March, U.S. regulator Commodity Futures Trading Commission (CFTC) sued Binance and Zhao over allegations that the company knowingly offered unregistered crypto derivatives products in the U.S.","According to reports, Binance has conducted massive cuts to its staff as it mounts a response to the ongoing lawsuits.","Nick Baker contributed reporting."],"entity":[{"type":"March","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Brian Shroder","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"}],"hashtag":["Binance","CZ","Changpeng Zhao","News","Binance US"],"authors":["Rosie Perper"]}