{"summary":"The crypto and blockchain sector continues to show signs of maturity, despite global and ecosystem challenges, audit, tax and professional services firm","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/168211\/kpmg-report-indicates-crypto-market-maturity","publishDate":"2022-09-06T20:41:15","id":1517,"type":null,"title":"Crypto market maturing, KPMG says","category":["BLOCKCHAIN"],"content":["The crypto and blockchain sector continues to show signs of maturity, despite global and ecosystem challenges, audit, tax and professional services firm KPMG said in its September Pulse of Fintech H1'22 report.","Although falling from 2021, the pace of continuous crypto growth “highlights the growing maturity of the space and the breadth of technologies and solutions attracting investment,\" KPMG said.","With global instability around the conflict in Ukraine, and echoes of the recent TerraUSD stablecoin collapse still resonating, the blockchain ecosystem has seen its fair share of obstacles this year. However, in spite of these events, KPMG said investor sentiment remains strong, with the average mid-year investment level well above that of years prior to 2021, despite a decline from $32.1 billion in 2021 to $14.2 billion in 2022.","Source: Pulse of Fintech H1'22, Global Analysis of Investment in Fintech, KPMG International (data provided by PitchBook), *as of 30 June 2022.","However, waters may still be uncertain for some blockchain startups, which KPMG France Director of Blockchain and Crypto Assets Alexandre Stachtchenko said may need to cut valuations to raise money because it’s the only option. “Of course, some cryptos will die out — particularly those that don’t have clear and strong value propositions. That could actually be quite healthy from an ecosystem point of view because it’ll clear away some of the mess that was created in the euphoria of a bull market. The best companies will be the ones that survive,” he said.","The companies that are surviving continue to drive interest into the blockchain space and rake in venture capital with big raises by Germany-based Trade Republic at $1.1 billion, Bahamas-based FTX at $500 million, and ConsenSys at $450 million.","The face of crypto investors is changing dynamically from retailer investors to institutional and corporate players who constitute a growing share of&nbsp; the capital influx. As such, from an investment risk perspective crypto assets are beginning to exhibit similarities to traditional assets, KPMG said in its report.","Since both El Salvador and the Central African Republic have adopted bitcoin as legal tender, the report said there is an increasing interest in the sovereign applications of cryptocurrencies among developing nations as opposed to that of existing currencies such as the U.S. dollar. <br data-v-f87c67ca=\"\">\n<br data-v-f87c67ca=\"\">\nAlthough a crypto trading ban stands in China, and there are indications that India may follow suit, regulators in other jurisdictions are more interested in fostering competition, evolution, and growth in crypto markets while protecting consumers, KPMG said. In addition the EU will adopt new regulations for the cryptocurrency industry at the end of 2022.","Expect increased interest in stablecoins. Corporations are looking at stablecoins to better leverage the operational advantages of crypto, including such as reductions in costs and delays, increased visibility, more rapid liquidity, and greater ease of use, KPMG said.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$450 million","content":"MONEY"},{"type":"$14.2 billion","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"KPMG France Director of Blockchain","content":"ORGANIZATION"},{"type":"EU","content":"ORGANIZATION"},{"type":"Alexandre Stachtchenko","content":"PERSON"},{"type":"Fintech","content":"ORGANIZATION"},{"type":"September","content":"DATE"},{"type":"Germany","content":"LOCATION"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"El Salvador","content":"ORGANIZATION"},{"type":"June 2022","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"'22","content":"DATE"},{"type":"$32.1 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$500 million","content":"MONEY"},{"type":"PitchBook)","content":"ORGANIZATION"},{"type":"Bahamas","content":"LOCATION"},{"type":"India","content":"LOCATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"China","content":"LOCATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":[],"authors":["Jeremy Nation","The Block"]}