{"summary":"The past year has been a rollercoaster for crypto, but FAs and RIAs shouldn’t run from the category.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/06\/22\/how-financial-advisors-can-navigate-cryptos-turbulent-waters\/","publishDate":"2023-06-22T16:55:06","id":15177,"type":null,"title":"How Financial Advisors Can Navigate Crypto’s Turbulent Waters","category":["Finance"],"content":["We continue to live through crypto history. Regulators recently moved aggressively forward with some major initiatives in the cryptocurrency space. There’s a lot to unpack there, and I won’t get into the specifics, but overall, the developments give the industry a chance to have meaningful discussions with the SEC about the future of crypto. A courtroom is a type of forum, and it might be the platform the industry needs to move forward.","In some ways, it’s expected. Crypto investors had a rough 2022: Faced with the inevitable growing pains of early-stage innovation and the shameless opportunists that always appear in emerging industries, many felt the effects of mismanaged funds and elite fraud. Bankruptcy hearings echoed with voices of investors who’d kept all of their metaphorical eggs in one basket, revealing to the courts that millions of dollars were lost in yield-bearing cryptos that they’d left sitting in one failed exchange. While it appears the industry has found its footing, the SEC may feel once bitten, twice shy.","You're reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","But the question remains: How do we guide clients through these turbulent times? The most recent lawsuits served by the SEC don’t seem to have cooled interest from investors in digital assets. Far from it: we see on-chain traffic flocking to DeFi protocols that support staking and decentralized trading.","Unlike past disruptions where centralized exchanges were challenged, outflows from institutions like Coinbase appear to have stabilized quickly, demonstrating that investors might be staying put and, therefore, need more guidance than ever before.","While it’s important to keep an eye on the evolving regulatory landscape for guidance, there are some ways advisors can exert more caution when addressing or investing in cryptocurrencies with interested clients.","One of the major benefits of blockchain is the autonomy it provides investors. The freedom to trade whenever and wherever is a powerful tool for the democratization of investing, and while there are trade-offs that come with the inherent responsibility it requires, it’s overall a positive step in the direction of financial equality.","FAs and RIAs know that responsibility well, and even though you can manage digital assets directly with the right tools, you don’t want to completely squash this new-found independence (and it’s unlikely that anyone could). As investors learned last year, the new freedom of completely limitless, do-it-yourself mobile trading apps made the need for outside advising feel superfluous until, under regrettable circumstances, it became very clear that it wasn’t.","This is where held-away comes in. You can support this new hybrid style of managed investing — where custody remains with a third party — with tools that let you view your clients’ held-away investing accounts (through Coinbase or Gemini) to provide insights when your clients want to take the reins.","Another big takeaway from the past year and the many exchange failures is the importance of diversification. Stories abound of investors who put entire college funds in one application to gain interest and fell victim to poor lending practices. It’s important to invest intelligently and mitigate risk by diversifying holdings and leveraging tools that let you invest for clients across a variety of trusted exchange platforms.","It’s also important to know how custodians are holding your funds. Qualified custodians allow investors to leverage different forms of custody for client funds that are secured, vetted, and can utilize hot and cold wallet technology. While we closely vet our custodian partners to be sure they can offer qualified investing solutions, it’s always important when investing on behalf of clients to understand the methods used by the exchanges you’re using.","Modern Portfolio Theory still applies to digital asset management. Investors that experienced major losses weren’t just all-in on specific apps — they were also all-in on specific cryptocurrencies. The potential for high returns on exchange-offered, yield-bearing assets led many investors to put large sums of capital into one vehicle (think: Terra Luna). Similar to the early days of tech, it’s easy for clients to get caught up in the hype and potentially buy into inflated assets with high-risk profiles.","This makes DYOR (doing your own research) incredibly important in a space that evolves fast. Leveraging indices and models from experts in the digital asset space can be incredibly helpful in these scenarios. That way, you can spread investment capital across various digital asset allocations guided by market research and analysts in the field.","Also, diversification doesn’t just have to be within the realm of crypto. We say “digital assets” for a reason, and it’s because there are several ways to engage blockchain outside of cryptocurrencies to diversify. Tokenized assets (a.k.a. real-world assets or RWAs) like private equity, real estate, and art, among other alternatives, are giving investors the ability to broaden their digital asset exposure through access to otherwise restricted investment vehicles.","As the regulatory landscape evolves, so must you. Although the wheels of legislation turn slowly, and these court cases may take years to resolve, the opportunity for real discourse can lead to collective problem-solving and, ultimately, clarity in the space. Keep a close eye on asset designations and key findings to be sure you’re investing in the most compliant, intelligent way possible.","Today’s investor knows the benefits of digital assets, and 50 million of them are already invested in crypto. Advisors have the ability to offer them your knowledge, financial education, and experience to help guide them when they need it most. I firmly believe that RIAs will pave the way for digital assets because you have the power to bring out the best in this emerging space and enable it to do what it was invented to do – make the financial system work for everyone.","Edited by Pete Pachal."],"entity":[{"type":"Pete Pachal","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"millions of dollars","content":"MONEY"},{"type":"Terra Luna)","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","crypto investing","Newsletter"],"authors":["Eric Ervin"]}