{"summary":"The largest of the claims includes a $20.4 billion claim against Alameda Research LLC, which details nearly $20 billion in unpaid partnership taxes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/05\/10\/us-internal-revenue-service-files-claims-worth-44-billion-against-ftx-bankruptcy\/","publishDate":"2023-05-10T19:05:42","id":15171,"type":null,"title":"U.S. Internal Revenue Service Files Claims Worth $44 Billion Against FTX Bankruptcy","category":["Finance"],"content":["The United States Internal Revenue Service (IRS) has filed claims worth nearly $44 billion against the estate of bankrupt crypto exchange FTX and its affiliated entities.","According to bankruptcy filings dated April 27 and 28, the IRS put forth 45 claims against FTX companies, which include West Realm Shires (the legal entity of FTX.US), Ledger Holdings (the parent company of LedgerX and LedgerPrime) and Blockfolio, among others.","The largest of the claims includes a $20.4 billion and a $7.9 billion claim against Alameda Research LLC and two claims totaling $9.5 billion against Alameda Research Holdings Inc.","The claims are filed under the classification “Admin Priority”, which could allow the IRS’ claims to take precedence over the claims of other creditors in a bankruptcy case.","Bankruptcy documents detailing the $20.4 billion claim against Alameda Research LLC reveal the IRS is claiming about $20 billion in partnership taxes. The remaining amount of the claim includes millions in withheld income taxes and payroll taxes.","“Federal law prevents the IRS from confirming or denying any correspondence with regard to any taxpayer case,” said a spokesperson for the IRS.","FTX’s bankruptcy attorneys said they had located more than $5 billion in various assets during a hearing in January 2023, and in initial bankruptcy filings the company said it estimated it had somewhere between $1 billion and $10 billion in assets overall. These figures have changed as the company’s management has located additional funds through the last few months."],"entity":[{"type":"$1 billion","content":"MONEY"},{"type":"United States Internal Revenue Service (IRS","content":"ORGANIZATION"},{"type":"Alameda Research LLC","content":"ORGANIZATION"},{"type":"$5 billion","content":"MONEY"},{"type":"$7.9 billion","content":"MONEY"},{"type":"January 2023","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"IRS","content":"ORGANIZATION"},{"type":"$44 billion","content":"MONEY"},{"type":"Ledger Holdings","content":"ORGANIZATION"},{"type":"Blockfolio","content":"PERSON"},{"type":"Alameda Research Holdings Inc","content":"ORGANIZATION"},{"type":"$20 billion","content":"MONEY"},{"type":"April 27","content":"DATE"},{"type":"$20.4 billion","content":"MONEY"},{"type":"$9.5 billion","content":"MONEY"}],"hashtag":["FTX","FTX Collapse","Bankruptcy","IRS"],"authors":["Tracy Wang"]}