{"summary":"How does bitcoin fit in your portfolio? Zach Pandl from Grayscale takes us through the investment thesis.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/11\/23\/crypto-for-advisors-is-bitcoin-for-you\/","publishDate":"2023-11-23T16:45:00","id":15176,"type":null,"title":"Crypto for Advisors: Is Bitcoin for You?","category":["Finance"],"content":["It's been an active week in the U.S. regulatory space for such a short week. The CEO of Binance steps down as CEO along with a $4 billion settlement with the Department of Justice, the SEC is suing Kraken for operating as an unregistered exchange, and Bittrex Global announced they are shutting down.","The battle for regulatory clarity seems well underway. As bitcoin reached status as the 11th largest market cap for a global financial asset, Zach Pandl from Grayscale takes us through bitcoin in your portfolio.","Happy reading.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","● Bitcoin is a high-risk and high-return-potential asset with a low correlation to stocks. Therefore, Grayscale Research believes an optimal portfolio for many investors should include a moderate allocation to Bitcoin.","Bitcoin is both a technological marvel and a large, liquid investable asset. And while public blockchain technology can be difficult to understand due to its highly technical nature, the role that bitcoin and other crypto assets can play in a portfolio is fairly straightforward. Crypto markets offer high-risk\/high-return-potential assets that haven't been tightly correlated with stocks over a five-year time horizon., and can therefore be useful ingredients for risk-tolerant investors when constructing an optimal portfolio.","Building a diversified portfolio with compelling returns has gotten harder. The classic 60\/40 portfolio of stocks and bonds will struggle to produce returns comparable to the last 40 years. We believe there is simply no room for valuations to expand: equity multiples are already high and the secular bull market in bonds is over (attributable to a bottoming in consumer price inflation). Stocks and bonds are also now more correlated, so investors get fewer diversification benefits from pairing them together. Opportunities in public markets are shrinking, too: compared to the 1990s, there are fewer IPOs and the number of listed firms has declined by around 30%.","To address these challenges, investors face a standard menu of options (Exhibit 1). To improve the tradeoff between risk and return in portfolios, they can reallocate to asset classes providing better risk-adjusted returns, lower correlations, or a bit of both. In recent years, for example, certain investors have increased their allocations to alternatives, including illiquid private assets like private equity and real estate. Although this has been a successful approach, these types of vehicles are not available to many individual investors.","Exhibit 1: Traditional assets offer a standard risk\/return tradeoff …","Exhibit 2: …. And crypto greatly expands the available options","Crypto assets provide something truly differentiated. From an asset allocation perspective, bitcoin and other digital assets greatly expand the risk\/return profile available to public market investors (Exhibit 2). Bitcoin and other crypto assets like Ethereum have high volatilities and should be considered high risk. However, they have produced returns over time commensurate with their risk profile. In other words, while bitcoin has a high volatility; the ratio of its returns to its volatility is broadly similar to other asset classes. Adding crypto assets to a portfolio can therefore be thought of as taking additional investment risk in exchange for higher potential returns. Investors can consider substituting crypto assets for other high risk\/high return assets like technology shares, non-U.S. equities, and\/or certain illiquid private investments, in order to improve portfolio performance.","Although the crypto asset class has produced high historical returns, it has not been very correlated with other risky assets. For example, over the last five years the correlation between bitcoin and the S&P 500 has been just 40%, compared to a 90% correlation between for the Nasdaq 100 and the S&P 500. A lower correlation to stocks means that crypto allocations in a portfolio should provide greater diversification benefits than certain other pro-risk assets.","Crypto is a nascent young asset class and should be considered relatively high risk. Bitcoin and other crypto assets may not be suitable for investors with defined capital needs in the relatively near future (e.g., within the next three to five years). Savings allocated for upcoming expenses related to college tuition or home purchases, for example, should probably not include crypto allocations. Lastly, investors prioritizing asset income should consider alternative options.","However, for investors with relatively high risk tolerance, crypto greatly expands the risk\/return opportunities available in public markets. Because of these assets’ high return potential and low correlation with other risky assets, an optimal portfolio for many investors should include a moderate allocation to crypto.","– Zach Pandl, Managing Director, Research, Grayscale","Q: What Impact will a Spot BTC ETF have on the price of Bitcoin?","Bitcoin is one of the few assets that could directly impact the price of an ETF. Since we know there is a limited supply of bitcoin - 21 million total available ever with 19.5 million mined - the demand for a spot ETF will take up some of that supply and have to hold it as long as there is still interest in the ETF. Its a supply and demand situation.","Q: The demand for the ETF might go down, so will the overall price of bitcoin drop?","There could be follow-on effects from a spot BTC ETF approval as it could symbolize a thawing of the regulatory resistance to bitcoin, and possibly to crypto overall. Approval by the SEC for the spot ETF would make investments in bitcoin more palatable for institutions. We may also see more 401k providers allowing bitcoin as an investment option. Overall, the demand for bitcoin could be exponentially larger than the demand for the spot ETF after approval.","Q: I can’t put my clients into bitcoin right now. How can I get them some exposure before the spot ETFapprovals?","There are ways to get exposure to bitcoin before an approval, and still keep the clients in regulated investments within your custodian and AUM. Remember, we’re not giving investment advice, so DYOR.","Some examples include:","GBTC - The Grayscale Bitcoin Trust is trading at a small discount, and will likely be converted to an ETF with the approval of other ETFs. This means clients invested in this trust will get the discount taken up, in addition to any price appreciation in bitcoin.","Bitcoin mining stocks such as - Riot Blockchain and Marathon Digital are publicly traded companies that do nothing but mine bitcoin. If the value of their product increases significantly, logic tells us their stock prices should appreciate as well.","Coinbase - COIN is the publicly traded company that is an exchange and a custodian, and stands to benefit from more interest in crypto overall. They have a diversified revenue model, and the thawing of regulatory stance helps them tremendously.","– Adam Blumberg, Interaxis","South Korea’s National Pension Fund invested close to $20 million in Coinbase.","Inflows Into Digital Asset Investment Products Cross the $1 Billion Mark — Study","This week Coindesk was acquired by Bullish and the message is “business as usual.","Edited by Bradley Keoun."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$4 billion","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"Bittrex Global","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"40%","content":"PERCENT"},{"type":"The Grayscale Bitcoin Trust","content":"ORGANIZATION"},{"type":"Into Digital Asset Investment Products Cross","content":"ORGANIZATION"},{"type":"Adam Blumberg","content":"PERSON"},{"type":"last five years","content":"DATE"},{"type":"Riot Blockchain","content":"PERSON"},{"type":"National Pension Fund","content":"ORGANIZATION"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Grayscale","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Interaxis","content":"LOCATION"},{"type":"$1 Billion","content":"MONEY"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"last 40 years","content":"DATE"},{"type":"Research","content":"ORGANIZATION"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$20 million","content":"MONEY"},{"type":"Grayscale Research","content":"ORGANIZATION"},{"type":"Zach Pandl","content":"PERSON"},{"type":"Coindesk","content":"ORGANIZATION"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Institutional Adoption","Greyscale","Portfolio management","bitcoin investing","risk assessment"],"authors":["Sarah Morton","Zach Pandl"]}