{"summary":"Dating app Bumble is exploring how to integrate the metaverse and Web 3.0 into a relaunch of its platform for finding friends, executives said this week. ","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/124094\/bumble-is-swiping-right-on-web-3-0-and-the-metaverse","publishDate":"2021-11-11T15:03:32","id":1518,"type":null,"title":"Bumble is swiping right on Web 3.0 and the metaverse","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Dating and friendship app Bumble is exploring how to integrate the metaverse and Web 3.0 into a relaunch of its platform for finding friends, executives said this week.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">While many details about Bumble’s blockchain strategy remain unclear, the Austin, Texas-based tech company appears to be taking the metaverse -- a term that refers to virtual worlds and integrated digital experiences and assets -- into consideration as it embarks on revamping its Bumble BFF platform for finding platonic friendships.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">“Bumble BFF gives us a platform for Bumble to become a leader in the Web 3.0 world,” Bumble founder and CEO Whitney Wolfe Herd <a href=\"https:\/\/www.fool.com\/earnings\/call-transcripts\/2021\/11\/11\/bumble-inc-bmbl-q3-2021-earnings-call-transcript\/\" target=\"_blank\" rel=\"noopener\" data-v-f87c67ca=\"\">said during<\/a> the company’s third-quarter earnings call on November 10. She emphasized that Web 3.0 is focused on community and the participants who build it, which squares with its mission of healthy relationships and women’s empowerment.<\/span>","<span data-v-f87c67ca=\"\">“In the near term, this means new engagement, participation and creator models,” Wolfe Herd said. “But longer-term, it becomes a way for members to own their experience on Bumble. This could happen through the communities they build, the virtual goods and experiences they acquire, or through new ways of owning their identity as they navigate the metaverse.”<\/span>","<span data-v-f87c67ca=\"\">Bumble’s app is probably best known for its focus on allowing women to make the first move when searching for potential romantic partners, but it also has modes for finding platonic friends (Bumble BFF) and business networking opportunities (Bumble Bizz).&nbsp;<\/span>","<span data-v-f87c67ca=\"\">The company is starting its exploration of the metaverse by weighing how it fits into the next version of Bumble BFF, which Wolfe Herd said will help people find “a broader community for shared joys and shared struggles.”<\/span>","<span data-v-f87c67ca=\"\">Bumble is “taking a Web 3.0 lens,\" Bumble, Inc. President Tariq Shaukat told an analyst during the earnings call. In the near term, the company is interested in how it can apply blockchain and crypto in the realm of community experience.<\/span>","<span data-v-f87c67ca=\"\">“We've got a couple of tests that we're very excited about that we will be rolling out in the upcoming months around this, but we think that's the first toehold there,” Shaukat said. “This is something that is going to evolve. We want to make sure we're setting the technical and engineering foundation for whatever emerges in the metaverse and in the Web 3.0 world.”<\/span>","<span data-v-f87c67ca=\"\">Twitter users also <\/span><a href=\"https:\/\/twitter.com\/i_woodford\/status\/1458383250968256512\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">noted<\/span><\/a><span data-v-f87c67ca=\"\"> that Bumble posted a job offer for “Head of Crypto and Web3” on LinkedIn, with the firm seeking a candidate with more than 10 years of experience “designing and engineering large scale systems” as well as a “keen understanding of the challenges and rewards of mobile app development.” <\/span>","<span data-v-f87c67ca=\"\">However, the post now says the company is no longer accepting applications.<\/span>","<span data-v-f87c67ca=\"\">Mainstream interest in the metaverse has grown since <\/span><a href=\"https:\/\/www.theblockcrypto.com\/linked\/122468\/facebook-teases-nft-support-in-keynote-on-its-ambitious-plans-for-a-digital-metaverse\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Facebook revealed<\/span><\/a><span data-v-f87c67ca=\"\"> a broad pivot toward virtual worlds and experiences on Oct. 28 and changed its overarching corporate name to Meta. <\/span>","<span data-v-f87c67ca=\"\">Bumble, Inc., the parent company of Bumble and another dating app called Badoo, grew paying users between the two apps to 2.9 million in the third quarter. The company went public in February <\/span><a href=\"https:\/\/ir.bumble.com\/news-releases\/news-release-details\/bumble-inc-prices-2.2-billion-ipo\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">after raising $2.2 billion<\/span><\/a><span data-v-f87c67ca=\"\"> for its IPO, and <\/span><a href=\"https:\/\/news.crunchbase.com\/news\/bumble-files-for-ipo\/\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">reported<\/span><\/a><span data-v-f87c67ca=\"\"> having 42 million monthly, active users in the third quarter of 2020.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Elsewhere in the connections app world, Tinder parent company Match Group <a href=\"https:\/\/seekingalpha.com\/article\/4464942-match-group-inc-s-mtch-ceo-shar-dubey-on-q3-2021-results-earnings-call-transcript\" data-v-f87c67ca=\"\">also discussed<\/a> a pilot project in South Korea called Single Town that has metaverse elements.<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"Bumble, Inc.","content":"ORGANIZATION"},{"type":"third quarter of 2020","content":"DATE"},{"type":"$2.2 billion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Shaukat","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"Bumble BFF","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"November 10","content":"DATE"},{"type":"Tariq Shaukat","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Bumble Bizz)","content":"ORGANIZATION"},{"type":"Bumble","content":"ORGANIZATION"},{"type":"“Head of Crypto","content":"ORGANIZATION"},{"type":"Whitney Wolfe Herd","content":"PERSON"},{"type":"Oct. 28","content":"DATE"},{"type":"Wolfe Herd","content":"ORGANIZATION"},{"type":"third quarter","content":"DATE"},{"type":"Bumble, Inc","content":"ORGANIZATION"},{"type":"Match Group","content":"ORGANIZATION"}],"hashtag":[],"authors":["Kristin Majcher","The Block"]}