{"summary":"The crypto exchange is conducting a \"risk management initiative\" targeting some crypto projects with a relatively small market capitalization or whose tokens form lower-liquidity trading pairs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/08\/25\/binance-is-contacting-low-cap-crypto-projects-in-bid-to-boost-trading\/","publishDate":"2023-08-25T08:48:24","id":15184,"type":null,"title":"Binance Is Contacting Low-Cap Crypto Projects in Bid to Boost Trading","category":["Finance"],"content":["Binance, the world's largest crypto exchange by trading volume, has contacted some crypto projects with low-liquidity tokens in what it said was a move to \"enhance their liquidity protection.\"","\"Over the past week, our team reached out to a small number of projects that issue digital assets listed on our platform as part of our ongoing risk management initiative,\" a spokesperson told CoinDesk by email. \"These projects have relatively lower market liquidity trading pairs and\/or a smaller market capitalization, which potentially exposes users to risk, including potential market manipulation.\"","The exchange has asked for details about the projects' market makers and whether they would consider contributing up to 5% of their circulating tokens to Binance saving pools in return for interest, according to The Block, which reported the news earlier. Similar requests are shown in unverified screenshots posted on X, the social medium platform formerly known as Twitter.","“The main purpose of our risk management outreach is to encourage project teams to take the recommended steps required to enhance their liquidity protection,\" the spokesperson said. \"Engaging market maker support is one way to enhance such protection.”","Read More: Binance's Ether Futures See Lowest Open Interest Since July 2022","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"July 2022","content":"DATE"}],"hashtag":["Binance","Liquidity","Market Manipulation","Market Makers"],"authors":["Jamie Crawley"]}