{"summary":"Cut through the memes, celebrity endorsements and weed-themed marketing campaigns and you’ll find a coin with unlimited supply and sparse technical development.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/want-to-buy-dogecoin-read-this-first\/","publishDate":"2021-10-24T18:55:00","id":15187,"type":null,"title":"Want to Buy Dogecoin? Read This First","category":["Learn"],"content":["With so much social media hype, mainstream attention and celebrity support it’s easy to think that dogecoin is a solid investment. But is the dog-themed cryptocurrency really as innocent as it looks?","Dogecoin has come a long way since its modest beginnings as a parody cryptocurrency based on a viral internet meme of a Shiba Inu “doge.” Back when it was just a pup in December 2013 the price of doge was $0.00055878 per coin, worlds away from its all-time high in May 2021 of $0.69 (123,383.30%).","A big part of the Dogecoin project's success can be attributed to its die-hard community of followers who, in the early days, helped the project take on an entirely new life of its own. This included expanding dogecoin's utility to a tipping cryptocurrency via third-party applications and using doge to support a range of charitable causes – some of which attracted mainstream media attention.","More recently, however, the reason dogecoin's popularity has skyrocketed is not because of any new utility or function, but because memes and irony have resonance in internet tribes. That goes double for the world of cryptocurrency, which lends itself to insider language and jokes. This culture has grown significantly and become more influential over the last year (see wallstreetbets). which naturally benefits dogecoin. It has even managed to attract high-profile celebrities who have amplified the spread and effects of this social phenomenon, including Snoop Dogg, Gene Simmons and the person who has arguably has the strongest pull on dogecoin's leash, Tesla co-founder Elon Musk (aka the \"dogefather\").","But while all the meme-fueled hype and extravagant price activity are exciting, it's important to know that there are a number of underlying risks associated with owning dogecoin that every new investor should know before diving into this digital asset.","In February 2014, Dogecoin co-founder Jackson Palmer decided to completely remove the cryptocurrency’s supply cap, which previously stood at 100 billion coins, in a bid to encourage the use of the coin for tipping and dissuade people from holding it.","This means dogecoin has an inflationary supply and new coins are continuously pouring into the market. By contrast, bitcoin (BTC), the original and most valuable cryptocurrency, has a hard cap of 21 million units.","Why is dogecoin’s infinite supply an issue? Supply and demand are the two fundamental drivers for determining the fair market value of goods, services and assets. It’s generally accepted that assets in high demand and scarce supply are likely to rise in price, whereas assets in poor demand and high supply are likely to fall in value.","Dogecoin, however, is a bit of an anomaly. The demand for the coin is currently higher than the number of coins entering the market so the price is rising. Even with an infinite supply, if buyers continue to purchase coins at an equal to or higher rate than they’re entering the market, the price will continue to rise or reach an equilibrium level.","Big If. In order to sustain price levels, dogecoin buyers will need to continually purchase all coins being created because there is no scarcity to support the price.","Think of it as shoveling snow off your driveway in a never-ending blizzard. Yes, you could argue, if everyone on the street helped out you could keep it clear but it’s likely the snow will eventually win.","At the current mining rate, 10,000 new dogecoins are released in block rewards every minute. That works out to roughly 14.4 million new dogecoins entering circulation every single day, or 5.2 billion per year.","These block rewards are fixed, meaning no more or no less than 10,000 dogecoins will be awarded to miners every minute. The only thing that will change over time is mining difficulty, which for dogecoin adjusts after every block. Difficulty rises and falls depending on how many miners are competing to discover new blocks at any given time.","Right now, dogecoin mining difficulty is climbing toward a two-year high as a result of increasing prices, which, in turn, is pushing DOGE mining profitability to record highs and attracting more miners to the network.","In 2015, Palmer walked away from Dogecoin, frustrated by the “toxic” crypto industry at the time, which he felt was becoming increasingly “like a bunch of white libertarian bros sitting around hoping to get rich and coming up with half-baked, buzzword-filled business ideas which often fail in an effort to try and do so.”","The meme-based cryptocurrency was left in the hands of a few community developers to continue where Palmer left off. However, little has been done with the code over the last six years. Prior to the recent Dogecoin Core 1.14.3 release on Feb. 28, the last major development was posted on Nov. 8, 2019. There was also a notable gap between Nov. 10, 2015, and Feb. 4, 2018, where no updates were published at all. For perspective, the Bitcoin network’s code is updated almost every day.","Dogecoin developers argue there’s little reason to post regular releases. “It has been running stable, and the rules of the network have not changed since in a way that would put it at risk,” said Maximilian Keller, one of the community developers. “The Dogecoin network does not necessarily have the same challenges as Bitcoin, so it’s less of a pressing issue for us\" to update regularly.","Nevertheless, one might expect a project that now has a market cap exceeding $50 billion (bigger than Ford’s) and a community fund that currently holds 23,532,879 coins ($9.1 million at current prices) to begin issuing more frequent code updates, even if it is still a joke cryptocurrency.","According to data, almost half of all dogecoins in circulation are held in a handful of crypto wallet addresses, with the largest wallet accounting for 28% of the supply. Why is this a problem? Well, it means that at any given time one of these whales could exit out the market and send doge prices tanking. Not to mention, they could easily use their huge positions to manipulate the market via stop-loss hunting, creating buy and sell walls or employing other trading strategies to artificially raise or lower the price. This leaves every other dogecoin investor at the mercy of their trading activities.","Despite these clear downsides, dogecoin may well continue to ride high for a time on social media hype, celebrity endorsement and rapidly breeding meme culture. (Bloomberg’s Joe Weisenthal gleefully noted recently that, if you factor in the recent rally, doge has outperformed BTC over seven years.) What remains to be seen is how long those things alone can sustain price increases."],"entity":[{"type":"2015","content":"DATE"},{"type":"Nov. 10, 2015","content":"DATE"},{"type":"123,383.30%","content":"PERCENT"},{"type":"Feb. 4, 2018","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Feb. 28","content":"DATE"},{"type":"Elon","content":"PERSON"},{"type":"$50 billion","content":"MONEY"},{"type":"100 billion","content":"MONEY"},{"type":"December 2013","content":"DATE"},{"type":"$9.1 million","content":"MONEY"},{"type":"Shiba Inu","content":"ORGANIZATION"},{"type":"$0.00055878","content":"MONEY"},{"type":"Nov. 8, 2019","content":"DATE"},{"type":"May 2021","content":"DATE"},{"type":"Palmer","content":"PERSON"},{"type":"Joe Weisenthal","content":"PERSON"},{"type":"Dogecoin","content":"LOCATION"},{"type":"Tesla","content":"LOCATION"},{"type":"Snoop Dogg","content":"PERSON"},{"type":"February 2014","content":"DATE"},{"type":"Gene Simmons","content":"PERSON"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"Ford","content":"ORGANIZATION"},{"type":"28%","content":"PERCENT"},{"type":"$0.69","content":"MONEY"},{"type":"Dogecoin","content":"ORGANIZATION"},{"type":"Maximilian Keller","content":"PERSON"},{"type":"Jackson Palmer","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Dogecoin","Explainers","Learn","Evergreen"],"authors":["Ollie Leech"]}