{"summary":"CoinFLEX CEO Mark Lamb breached his fiduciary duty when he created a new company, OPNX, with the founders of failed crypto hedge fund Three Arrows Capital, creditors argue. They are also critical of a deal Lamb struck with early BTC evangelist Roger Ver.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/10\/25\/hobbled-crypto-exchanges-creditors-are-suing-its-ceo-and-want-to-claw-back-money-from-bitcoin-jesus\/","publishDate":"2023-10-25T22:31:59","id":15183,"type":null,"title":"Hobbled Crypto Exchange's Creditors Are Suing Its CEO and Want to Claw Back Money From 'Bitcoin Jesus'","category":["Finance"],"content":["In early 2023, CoinFLEX CEO Mark Lamb was in search of a life rope.","His Seychelles-based crypto exchange had just filed for restructuring, and a last-ditch attempt to save the company yielded help from an unlikely duo: Su Zhu and Kyle Davies, founders of the fallen crypto hedge fund Three Arrows Capital (aka 3AC).","In January 2023, a pitch deck leaked for GTX, billed as a first-of-its-kind exchange for trading bankruptcy claims. The company was backed by Zhu, Davies, Lamb and CoinFLEX co-founder Sudhu Arumugam. It would be helmed by Leslie Lamb, the CoinFLEX CEO's wife.","The GTX deck immediately raised eyebrows. 3AC's Zhu and Davies were considered rare luminaries of the cryptocurrency space in the early days of decentralized finance and NFTs, but their reputations had been challenged by the time of their partnership with CoinFLEX, by which point 3AC had collapsed and helped trigger a broader crypto market downturn.","In a memo addressing the controversy around GTX and its team, CoinFLEX said the new venture would mark an \"evolution of CoinFLEX's commitment to building open and transparent financial markets\" and would \"increase value for CoinFLEX creditors.\"","But now, creditors of CoinFLEX say that Mark Lamb was in breach of his fiduciary duties at CoinFLEX when he started the claims platform, which has since rebranded to \"OPNX.\" In a Hong Kong civil court filing from CoinFLEX's creditors dated Oct. 12, OPNX is referred to as a \"competing business\" to CoinFLEX, and it's named as a co-defendant alongside Lamb and CoinFLEX investor Roger Ver.","The creditors frame the newer platform as a kind of cynical off-ramp for Lamb and his closest associates, and they say he should be barred from acting or speaking on CoinFLEX's behalf moving forward.","Mark Lamb did not respond to requests for comment sent by CoinDesk to his Telegram and X (formerly Twitter) accounts – though Telegram shows he read the message and he followed one of the authors of this piece on X after the direct message was sent. Leslie Lamb also did not respond to a request for comment sent via Telegram.","3AC was forced into liquidation in June 2022, when it became clear that Zhu and Davies had built the bulk of their empire on massive unsecured loans from a who's who of the biggest lenders in crypto. They spent the borrowed money on a series of failed crypto bets, and a $3 billion shortfall in 3AC creditor funds dealt a blow to the entire sector that it has yet to fully recover from.","When the GTX deck leaked, the idea of Zhu and Davies starting a new venture – one focused on crypto bankruptcies, at that – was viewed by some as deeply ironic, and maybe even a joke. A company name resembling the biggest crypto crash in history, \"FTX,\" didn't dispel that impression.","While CoinFLEX and so many other crypto platforms are now defunct, however, GTX isn't. Renamed OPNX, the platform launched publicly in April 2023 and has been live since then – albeit with minimal traction or fanfare.","OPNX was officially marketed as a direct rebrand of the CoinFLEX exchange. The CoinFLEX website was still online at press time, but a notice warned users to withdraw all of their funds from the platform by Oct. 31, 2023, at which point the firm would be \"officially ceasing operations and shutting down.\"","The site also pitched users on its new platform: \"CoinFLEX is moving to OPNX (Open Exchange) in the coming months. We encourage you to migrate your account balances over.\"","But the birth of OPNX was not authorized by CoinFLEX's board or creditors, the creditors allege in their October filing. They accuse Mark Lamb of going rogue and appropriating the company's intellectual property, technology, customer base and employees to build the claims exchange.","OPNX is incorporated in Seychelles yet maintains an office in Hong Kong. A copy of a writ of summons was served to the Hong Kong office on Oct. 12, a spokesperson for the creditors committee told CoinDesk. This document is used to initiate a civil proceeding, and CoinDesk obtained a copy of it from the spokesperson.","CoinFLEX's creditors say that Lamb, who was the CEO and co-founder of CoinFLEX, entered into a licensing and purchase agreement with OPNX's parent companies — Open Technologies Holding LTD and Open Technology Markets LTD — that was \"manifestly uncommercial and detrimental to [CoinFlex's] interests [...] and\/or plainly for the benefit of\" Lamb and OPNX.","CoinFLEX's creditors are seeking to have these license and purchase agreements rendered null and void. They also want to have all assets and profits from OPNX placed into a trust for now.","Crypto news site Protos reported earlier this month that OPNX has struggled to find its footing after opening. So far, the only bankruptcy claims that can be traded on the platform are from FTX. The price of OPNX's \"OX\" token has also dropped 83% from its August peak.","In August, OPNX was fined $2.7 million by Dubai’s crypto regulator for non-compliance, and the claims exchange is not listed as a licensed virtual assets exchange by Hong Kong's securities regulator.","Zhu was apprehended in Singapore last month in connection to his alleged non-compliance in 3AC's bankruptcy proceedings. Davies' location was not publicly known at press time, but 3AC's liquidators said in a statement last month that he was also wanted by Singaporean authorities for his alleged failure to cooperate with the bankruptcy.","The OPNX writ of summons also accuses Lamb of acting without authorization when he entered CoinFLEX into a settlement agreement with Ver, a well-known crypto entrepreneur and early evangelist sometimes called \"Bitcoin Jesus.\"","Ver was one of CoinFLEX's initial investors in 2019. His relationship with the exchange eventually turned sour, however, and in mid-2022 the pair made headlines when CoinFLEX entered into an arbitration process against Ver to recover what the exchange described as an $84 million debt he'd incurred on the platform.","Ver's margin trading account went deep into the red during the extreme market volatility that occurred after the Terra-Luna crypto crash in the first half of 2022 – the same crash that wiped out 3AC. CoinFLEX failed to liquidate Ver's mammoth position in time and was ultimately forced to file for restructuring – kicking off an ongoing feud between Ver and Lamb over who was to blame for the platform's collapse.","Publicly, Lamb offered Ver a deal where he could trade for free for two years on OPNX. Lamb also offered Peter Smith, co-founder of blockchain.com and a Ver associate, an equity stake in OPNX in exchange for acting as a market maker.","The new suit from CoinFLEX's creditors seeks to recoup any \"benefits and\/or traceable proceeds\" Ver received as part of a settlement deal he ultimately made with Lamb.","But Ver told CoinDesk in an email on Monday that the public record of his dispute – and settlement – with CoinFLEX doesn't tell the full story.","According to Ver, who says he has not yet been served in connection to the Hong Kong summons, the truth of what he called his \"bogus arbitration\" with CoinFLEX was distorted by Lamb in public statements and press releases, as well as in communications with CoinFLEX's creditors.","Ver said he began an arbitration case against CoinFLEX in June 2022, seeking $200 million in damages he says he sustained as a result of trading on the platform. Ver alleged he had \"evidence that certain third parties were provided with knowledge of my sizable positions on CoinFLEX and traded against them to my detriment.\"","\"I was the plaintiff, not CoinFLEX,\" Ver insisted, adding that the suit was kept confidential in accordance with Hong Kong law. CoinFLEX \"later filed a counterclaim for $84 million\" and, he claimed, Lamb \"broke confidentiality to intentionally misrepresent to the entire world that CoinFLEX was the plaintiff.\"","Ver said that he eventually settled out of court with CoinFLEX and Lamb. As a part of his settlement deal, Ver said he would be entitled to the first $100 million from \"responsible third parties in further legal proceedings that are now being contemplated.\"","In Ver's telling, his earnings from this purported settlement – which CoinFLEX's creditors seem intent on clawing back – should be his to keep. The story \"told by Mark Lamb was bogus,\" and \"I was, in fact, the largest victim of CoinFLEX,\" Ver insisted.","Oliver Knight contributed reporting.","Edited by Nick Baker and Marc Hochstein."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Open Technology Markets LTD","content":"ORGANIZATION"},{"type":"$100 million","content":"MONEY"},{"type":"January 2023","content":"DATE"},{"type":"Protos","content":"ORGANIZATION"},{"type":"$84 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"— Open Technologies Holding LTD","content":"ORGANIZATION"},{"type":"Mark Lamb","content":"PERSON"},{"type":"Nick Baker","content":"PERSON"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Ver","content":"PERSON"},{"type":"Dubai","content":"LOCATION"},{"type":"Terra","content":"LOCATION"},{"type":"last month","content":"DATE"},{"type":"$200 million","content":"MONEY"},{"type":"Hong Kong","content":"LOCATION"},{"type":"August","content":"DATE"},{"type":"June 2022","content":"DATE"},{"type":"OPNX","content":"ORGANIZATION"},{"type":"Lamb","content":"ORGANIZATION"},{"type":"Kyle Davies","content":"PERSON"},{"type":"earlier this month","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sudhu Arumugam","content":"PERSON"},{"type":"Luna","content":"LOCATION"},{"type":"$2.7 million","content":"MONEY"},{"type":"the first half of 2022","content":"DATE"},{"type":"Oct. 31, 2023","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"83%","content":"PERCENT"},{"type":"Leslie Lamb","content":"PERSON"},{"type":"Seychelles","content":"LOCATION"},{"type":"GTX","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Oct. 12","content":"DATE"},{"type":"Peter Smith","content":"PERSON"},{"type":"Davies","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Roger Ver","content":"PERSON"}],"hashtag":["Opnx","Kyle davies","Su Zhu","Mark lamb","Three Arrows Capital","3AC","Bitcoin Jesus","Roger Ver"],"authors":["Sam Reynolds","Sam Kessler"]}