{"summary":"The approval of a wave of bitcoin exchange-traded funds will lead to a more mature market structure, say Vivek Chauhan and David Lawant, of FalconX.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/01\/31\/how-the-launch-of-spot-etfs-could-dampen-bitcoins-volatility\/","publishDate":"2024-01-31T16:45:17","id":15181,"type":null,"title":"How the Launch of Spot ETFs Could Dampen Bitcoin’s Volatility","category":["Markets"],"content":["One of the critical ingredients for Bitcoin’s success has been the emergence of new trading infrastructure and investment wrappers that open access to new investors. This trend is now in overdrive with the recent launch of spot BTC ETFs.","Beyond the circles of liquidity providers and trading desks, we haven’t quite appreciated how these monumental changes will change the Bitcoin market structure.","We can expect reduced inherent volatility as this market structure matures. Here, we will explore how a couple of important shifts associated with the launching spot ETFs are poised to facilitate this change.","You're reading Crypto Long & Short, our weekly newsletter featuring insights, news and analysis for the professional investor. Sign up here to get it in your inbox every Wednesday.","ETF Fix as a Market Price Reference?","It is no secret that the recent ETF launches have yielded a meaningful uptick in the underlying spot BTC trading volumes. Notably, a disproportionate share of this volume increase has happened mostly between 3 p.m. and 4 p.m. ET, or close to the ETF price fix.","The chart below shows the daily BTC trading volume percentage in the 30-minute buckets starting at 3:00 p.m. and 3:30 p.m. ET for the leading trading pairs. Activity from these two buckets, which regularly accounted for less than 5% of the total daily volume in aggregate, now represents 10-13%.","By providing a transparent and consistent reference point recognized by increasing market participants, the ETF fix allows investors to aggregate large trades around a common time, reducing their market impact and overall market volatility.","A New Options Market Around ETFs?","All three exchanges that currently list spot BTC ETFs have already asked the SEC to allow them to list options on such ETFs. It could take anything between one and eight months for those applications to be evaluated by the SEC, and there are wrinkles related to their clearing and settlement processes.","The Bitcoin options market will likely get a significant boost if this new class of options is given the green light. The Bitcoin options market is currently split between investors who trade in offshore exchanges inaccessible to U.S. persons or on platforms accessible only to large institutions, such as the CME. Allowing options based on spot BTC ETFs could significantly expand the options market beyond these two markets.","Overall, the BTC options market should continue to increase in importance in 2024, even after the massive growth it posted last year. A more developed options market can yield lower volatility because it allows investors to express a broader range of investment strategies and make the most liquid ETFs even more liquid. It also expands the importance of events such as expirations and dealer positioning as price action drivers.","20-Year ETF Legacy Meets the Bitcoin Revolution","It’s exciting to see the ETF revolution now benefit the bitcoin market. The launch of spot BTC ETFs has brought, and will likely continue to bring, an increase in investor participation, perhaps similar to the gold ETF launch in the early 2000s.","More than two weeks into launch, the spot bitcoin ETFs are already clocking in at over $1.5 billion daily trading volume. For context, this volume is about 20% of what bitcoin trades in the spot market on a good day.","As the innovation in crypto ETFs continues, we expect trading activity related to ETFs to continue, which should dampen Bitcoin’s volatility and contribute to the maturation of this emerging asset class.","Edited by Benjamin Schiller."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"4 p.m. ET","content":"TIME"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"SEC","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"3:30 p.m.","content":"TIME"},{"type":"$1.5 billion","content":"MONEY"},{"type":"Crypto Long & Short","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Wednesday","content":"DATE"},{"type":"2000s","content":"DATE"},{"type":"3:00 p.m.","content":"TIME"},{"type":"CME","content":"ORGANIZATION"},{"type":"3 p.m.","content":"TIME"}],"hashtag":["Opinion","Crypto Long & Short","Bitcoin","ETF","ETFs","Volatility"],"authors":["David Lawant","Vivek Chauhan"]}