{"summary":"The U.S. government also recommended an $11 billion fine and forfeiture.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/15\/sam-bankman-fried-should-spend-40-50-years-in-prison-doj-says\/","publishDate":"2024-03-15T18:32:42","id":15199,"type":null,"title":"Sam Bankman-Fried Should Spend 40-50 Years in Prison, DOJ Says","category":["Policy"],"content":["U.S. prosecutors recommended that a federal judge sentence FTX founder and former CEO Sam Bankman-Fried to 40-50 years in prison for his conviction on fraud and conspiracy charges tied to the collapse of what was once one of the world's largest crypto exchanges.","Bankman-Fried \"lied to investors,\" shared fake documents and \"pumped millions of dollars in illegal donations into our political system,\" adding that a sentence of 40 to 50 years is \"necessary,\" alongside a recommended penalty north of $11 billion and forfeiture, the Department of Justice's Southern District of New York office wrote in a sentencing memo filed Friday.","\"Bankman-Fried is deserving of a severe sanction, proportionate to his role in this historic fraud,\" the prosecutors said. \"The government urges the court to impose a sentence that underscores the remarkably serious nature of the harm to thousands of victims; prevents the defendant from ever again committing fraud; and sends a powerful signal to others who might be tempted to engage in financial misconduct that the consequences will be severe.\"","Read all of CoinDesk's coverage on the Sam Bankman-Fried trial here.","Prosecutors called their request for a $11 billion judgment \"a particularly conservative sum\" and noted that more than a billion dollars had already been seized. Government efforts to claw back some of Bankman-Fried's money targeted the political contributions he and other FTX executives made in the U.S. elections two years ago – which prosecutors said they believed to be “the largest-ever campaign finance offense.” The document noted 251 candidates had so far returned more than $3 million.","The prosecutors included a list of sentences for defendants who'd cost victims more than $100 million in a Ponzi scheme or other kinds of misappropriation, leading off with Bernie Madoff, who was tied to $13 billion in losses and was given a 150-year sentence.","A proposed forfeiture order details where the funds would come from, including deposits in U.S. bank accounts that the government has seized, funds in a number of Binance and Binance.US accounts and proceeds from the sale of Robinhood shares.","A repeated theme throughout the memo is the idea that Bankman-Fried knew he was committing illegal actions, but acted as if he was not bound by the law, the DOJ charged, walking through the evidence produced during his trial.","To support this, the memo referenced testimony and allegations made by witnesses at the trial, including Bankman-Fried's former inner circle. He bribed foreign government officials, the filing said, referencing former Alameda Research CEO Caroline Ellison's testimony, and directed Alameda to take out a massive line of credit on FTX, referencing testimony from former Chief Technology Officer Gary Wang.","Bankman-Fried was convicted on seven different counts of fraud and conspiracy last November after a month-long trial tied to the operation and collapse of FTX and Alameda Research, two companies he founded. He's scheduled to be sentenced on March 28.","His defense team urged a 6-year sentence in a memo last month, which the prosecution called \"woefully inadequate\" in Friday's filing.","In Friday's memo, prosecutors took aim at the defense team's argument that FTX creditors are likely to recover a majority of their funds, saying Bankman-Fried did not assist with these recoveries and his efforts \"in many respects have been counterproductive.\"","Like the defense team, prosecutors included a number of exhibits to support their argument. Unlike the defense team, which mainly provided character references, the DOJ published direct messages sent to Bankman-Fried by FTX customers and selected Google documents.","One of them, which appears to have been written after FTX filed for bankruptcy, includes a list of options for how Bankman-Fried could address the bankruptcy situation. The options ranged from blaming the attorneys, appearing on former Fox News host Tucker Carlson's show and \"coming out as a Republican\" or being interviewed by Michael Lewis (who published a book about him a year later) to sharing a letter with employees and tweeting a thread about his depression medication.","Another document appears to detail options for FTX before and through its bankruptcy process. Yet another document seems to be more focused on how he might garner sympathy and share more information about FTX's situation.","\"He knew what society deemed illegal and unethical, but disregarded that based on a pernicious megalomania guided by the defendant’s own values and sense of superiority,\" prosecutors wrote in their sentencing memo.","Cheyenne Ligon contributed reporting.","UPDATE (March 15, 2024, 19:05 UTC): Adds additional detail throughout."],"entity":[{"type":"a billion dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"Cheyenne Ligon","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"March 15, 2024","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"millions of dollars","content":"MONEY"},{"type":"Fox News","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Tucker Carlson","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Michael Lewis","content":"PERSON"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"Robinhood","content":"ORGANIZATION"},{"type":"Bernie Madoff","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$11 billion","content":"MONEY"},{"type":"$3 million","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Bankman","content":"PERSON"},{"type":"Southern District of New York","content":"LOCATION"},{"type":"Gary Wang","content":"PERSON"},{"type":"two years ago","content":"DATE"},{"type":"$13 billion","content":"MONEY"}],"hashtag":["Regulations","Sam Bankman-Fried","SBF Trial"],"authors":["Nikhilesh De","Jesse Hamilton"]}