{"summary":"What does Bitcoin’s fourth halving mean, and why does it matter?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/18\/crypto-for-advisors-bitcoins-supply-reduction\/","publishDate":"2024-04-18T16:00:00","id":15191,"type":null,"title":"Crypto for Advisors: Bitcoin’s Supply Reduction","category":["Finance"],"content":["Today’s newsletter centers around Bitcoin’s fourth halving is set to occur tomorrow. There has been plenty of coverage and price predictions. Mick Roche from Zodia Markets provides a straightforward explanation of how the Bitcoin halving works, why it matters, and how it could potentially impact bitcoin’s price. Then, Bryan Courchesne from DAIM answers questions he receives on the topic in Ask an Expert.","SPECIAL ANNOUNCEMENT: Hear directly from industry thought leaders and advisors on the front lines of incorporating digital assets into their wealth management practices at CoinDesk’s Financial Advisor & RIA Day. Join us in Austin, TX, on May 30. Your registration includes a complimentary 3-day Pro Pass to Consensus valued at $1,799. Exclusive to qualified advisors. Secure your seat today: https:\/\/consensus2024.coindesk.com\/fa-ria-day\/. Not an advisor? Use code JOINC24NOW to receive 15% off a Pro Pass to the event.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","Bitcoin miners are rewarded for verifying new blocks on the Bitcoin network and securing it. For this effort, they are paid in bitcoin (BTC) at a current rate of 6.25 BTC per block verified, along with transaction fees. It takes about 10 minutes to verify a new block, and there are roughly 144 blocks verified every day, which equates to rewards of 900 BTC each day. Thus, the supply of BTC increases by this amount daily.","For every 210,000 blocks mined, the mining rewards available are reduced or halved. This occurs approximately every four years. After this upcoming halving, the fourth in the blockchain's 15-year history, a miner will receive 3.125 BTC for verifying a block, instead of 6.25 BTC. This will reduce the new BTC daily supply to about 450 BTC.","What is the current market status?","The daily exchange-traded volume of BTC varies depending on the source, but looking at the Messari volumes, we see a daily volume range of around $30 billion. At current prices (BTC = $64,000), the reduced new supply will equal $29 million or roughly 1% of the average daily exchange traded volume, down from 2%.","Miners, however, may not sell all their new coins. Research from CoinShares suggests that the average cost of mining a bitcoin after the halving will be around $40,000, depending on many variables. So, miners whose operational costs are less than the current market rate may choose to hold their coin and not bring it to market. However, this was always the case. You have some miners that sell all the rewarded BTC when they get it (either to take profit, cover operational costs or for capital investment) and others who hold excess Bitcoin in the expectation of price appreciation.","Another consideration is the \"free float\" (coins actively trading) in BTC. Currently, circa 93.5% or 19.635 million of all BTC have been mined. Of that, about 75% are considered to be held long-term (where BTC has been sitting in a wallet for longer than 155 days). This would leave a free float of ~5 million BTC, increasing the supply by 0.01% daily.","Also to consider are the new spot bitcoin ETFs. The average daily inflow volume into the new ETFs (including grayscale outflows) is $202 million. This is far more influential on prices than the reduction in supply.","What could this mean for the price of bitcoin?","Whilst it is obvious that a decrease in the supply should be net positive for the price of any commodity, this should also be true for bitcoin. The question is, how much should it increase and has the increase in price already been built into the current price? As we have seen with the ETF announcements, most pre-determined headlines become \"Buy the rumour, sell the fact\" events, and we see a risk of that here too.","We don’t find value in looking back on previous halvings, as there are not enough data points to be statistically meaningful. Additionally, trying to extrapolate correlations to halvings in an instrument that has gone up from $0 to $70,000 in a short period of time is difficult.","A much larger influence on the price of bitcoin will be the ETF flows, as these have the potential to change depending on sentiment dramatically. These flows can easily outstrip the reduction in supply from the halving.","In Summary:","We see the halving making a much larger impact on miners than the bitcoin price. Miners will have to adjust their operations to accommodate the smaller rewards they will get, whether that is by capital expenditure on more efficient equipment, cutting operational costs, or, indeed, selling more of their mined bitcoin.","One of the goals for participants in the digital asset space is to increase institutional adoption. Reducing the daily new supply by $29 million daily in a market that already transacts approximately $30 billion is relatively trivial. If the market cannot handle a reduction of $29 million daily supply, then it is not ready for institutions.","Look out for the ETF flows; they will dictate the price more so than a small decrease in supply growth.","- Mick Roche, senior trader, Zodia Markets","Q. How does the bitcoin halving affect the supply of bitcoin, and what impact does this have on its price?","The supply of bitcoin in the secondary market depends on holders looking to sell existing bitcoin and miners looking to sell the newly minted bitcoin they are awarded. Generally, in between halvings, the release of these new bitcoins creates a kind of equilibrium in the supply\/demand dynamic of the secondary market where the reward can support the demand. When the halving occurs it creates a supply shock as the equilibrium is disturbed and no longer meets demand. Historically this has been a catalyst for the price to increase dramatically.","Q. Can you explain the concept of \"halving cycles\" in the context of Bitcoin's price history?","Since the halving is programmed to occur every 210,000 blocks, it creates a distinct time frame between these events that lasts about four years. In these four years, there has historically been a peak price, a trough price, a bull portion of the cycle, and a bear portion of the cycle. The most price appreciation has historically been in the month preceding and following the halving. This is a result of the supply shock that the halving creates. After the new supply\/demand equilibrium is reached, the price peaks and then a drastic sell-off occurs until the BTC price finds its bottom or trough. This is usually 12-18 months after the halving. Once we get to the bottom, the price chops around, then steadily rises until we get close to the halving, and the cycle repeats.","Q. What are some potential strategies for investors to consider before, during, and after a Bitcoin halving event?","The main strategy we recommend to an investor with a long time horizon is just to buy and hold. Crypto volatility can be hard to manage, and it’s easy to get caught on the wrong side of a trade. That tends to lead to very emotional and sub-optimal decision-making. Over a multi-year timeframe, Bitcoin has tended to provide a great return to investors, so trying to improve on an already great return isn’t necessary to make a strategy successful.","- Bryan Courchesne, CEO, DAIM"],"entity":[{"type":"$1,799","content":"MONEY"},{"type":"2%","content":"PERCENT"},{"type":"93.5%","content":"PERCENT"},{"type":"$29 million","content":"MONEY"},{"type":"Austin","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"TX","content":"LOCATION"},{"type":"$0","content":"MONEY"},{"type":"Mick Roche","content":"PERSON"},{"type":"Bryan Courchesne","content":"PERSON"},{"type":"15%","content":"PERCENT"},{"type":"$202 million","content":"MONEY"},{"type":"Zodia Markets","content":"ORGANIZATION"},{"type":"$64,000","content":"MONEY"},{"type":"Thursday","content":"DATE"},{"type":"0.01%","content":"PERCENT"},{"type":"CoinDesk’s Financial Advisor & RIA Day","content":"ORGANIZATION"},{"type":"18","content":"DATE"},{"type":"75%","content":"PERCENT"},{"type":"ETF","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"1%","content":"PERCENT"},{"type":"May 30","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Bitcoin","content":"PERSON"},{"type":"$30 billion","content":"MONEY"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Crypto for Advisors","Financial Advisors","Financial Advisers","Bitcoin Halving","Bitcoin Mining","Mining","mining reward"],"authors":["Sarah Morton","Mick Roche"]}