{"summary":"The Galaxy Ventures-backed project expects its “Rehype” liquidity pools could generate mid-double digit returns, developers said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/19\/stablecoin-project-gyroscope-to-conduct-points-program-launch-high-yield-liquidity-pools\/","publishDate":"2024-03-19T12:01:06","id":15198,"type":null,"title":"Stablecoin Project Gyroscope to Conduct Points Program, Launch High-Yield Liquidity Pools","category":["Finance"],"content":["Stablecoin project Gyroscope is out with a new piece of trading infrastructure that its developers say will improve capital efficiency for crypto users seeking yield.","The new liquidity pool product is called Rehype – short for rehypothecation, the practice of lending out the collateral backing a loan. Doing this can compound risks of a lender default, but also compounds the rewards generated by loans.","Gyroscope's Rehype liquidity pools are long on yield maximization. Lewis Gudgeon, co-founder of the project’s development team, FTL Labs, said depositors will have exposure to at least three sources of yield from lending assets into the pool. According to a press release, the pool's true returns are \"expected to often reach\" around 15%.","The product's existence is a sign of the times in decentralized finance (DeFi). Forget about the \"high yield\" 4% APY accounts being offered by traditional banks. In DeFi, risk-loving traders are demanding higher returns on even their stablecoins, the most boring and least volatile crypto asset around.","Gyroscope's own stablecoin product, called GYD, is being marketed as an \"all weather\" stablecoin that aims to maintain its dollar peg by holding other stablecoins. It plans to store a \"significant amount of its reserve backing” in trading pools where those stablecoins can earn fees, per protocol documents.","Rehype's core focus will be on providing liquidity for people looking to trade stablecoins. It serves as the \"automated market maker\" that keeps buys and sells flowing, taking a cut of every trade. Depositors who lend assets to the pool will get a cut of the fees. Gudgeon said the pool will take assets like USDC and USDT.","\"Behind the scenes they get automatically rehypothecated and converted into particular tokens, depending on the exact pool,” Gudgeon said. That rehypothecation will earn extra yield for depositors, he said.","The final source of yield will be loyalty points from Gyroscope’s new “SPIN program.” Users who participate in the pool will get points based on their activities. Like many points programs, it's the setup for a future distribution of governance tokens.","Points programs have been hot in crypto of late as a way for protocols to gamify their user base ahead of a token airdrop while also maintaining an air of ambiguity about the token’s release. Regardless, they’ve been a hit, and many protocols have juiced their statistics by incentivizing users to do certain points-earning actions, like borrow, lend and trade.","Since launching in early December on the Ethereum mainnet, the stablecoin’s total supply has fallen from highs above $3 million to its current levels, near $1.7 million. Just over 30 people hold more than $100 worth of GYD, according to a Dune Dashboard."],"entity":[{"type":"USDT","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"Dune Dashboard","content":"ORGANIZATION"},{"type":"Gudgeon","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"Lewis Gudgeon","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"$1.7 million","content":"MONEY"},{"type":"December","content":"DATE"}],"hashtag":["Stablecoin","airdrop","Yield Farming"],"authors":["Danny Nelson"]}