{"summary":"The new laws set up \"enhanced\" due diligence and customer checks for crypto firms.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/26\/eu-parliament-adopts-anti-money-laundering-rules-package-also-policing-crypto\/","publishDate":"2024-04-26T10:44:06","id":15194,"type":null,"title":"EU Parliament Adopts Anti-Money Laundering Rules Package, Also Policing Crypto","category":["Policy"],"content":["The European Parliament voted to adopt a new package of laws tightening money laundering and terrorist financing measures across the EU. The laws target large cash payments, crypto firms and football clubs, among others.","In addition to creating a single rulebook for the 27 nations that make up the European Union, the package approved on Thursday sets up an anti-money laundering authority based in Frankfurt to oversee the implementation of the relevant frameworks – particularly those the bloc deems as the \"riskiest entities.\"","\"The new laws include enhanced due diligence measures and checks on customers’ identity, after which so-called obliged entities (e.g. banks, assets and crypto assets managers or real and virtual estate agents) have to report suspicious activities to [Financial Intelligence Units] and other competent authorities,\" a press statement on the vote said.","Crypto policy watchers in the EU raised concerns that the requirements imposed on digital assets may be unfairly strict compared to other financial sectors when the bloc struck a political deal on the package back in January.","The new measures also seek to give people or entities with \"legitimate interest,\" including journalists, media professionals, civil society organizations and other competent authorities, \"immediate, unfiltered, direct and free access to beneficial ownership information held in national registries and interconnected at EU level.\" Beneficial ownership information refers to identifying information about entities or people that own or control companies.","A joint parliamentary committee voted on texts of the package in March, ahead of the plenary vote on Thursday.","To become law, the EU Council, which groups lawmakers from member states, still needs to formally adopt the package.","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Frankfurt","content":"LOCATION"},{"type":"[Financial Intelligence Units","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"European Union","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"EU","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"EU Council","content":"ORGANIZATION"}],"hashtag":["Regulations","EU","European Parliament","AML"],"authors":["Sandali Handagama"]}