{"summary":"Multichain said it has been forced to take this action \"due to lack of alternative sources of information and corresponding operational funds.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/07\/14\/crypto-bridging-protocol-multichain-ceases-operations\/","publishDate":"2023-07-14T09:22:49","id":15190,"type":null,"title":"Recently Exploited Crypto Bridge Shuts, Says China Detained CEO and His Sister","category":["Finance"],"content":["Multichain, one of the largest bridging protocols in the crypto world, said it is ceasing operations following the detention of CEO Zhaojun and his sister by Chinese police.","Multichain said it has been forced to take this action \"due to lack of alternative sources of information and corresponding operational funds,\" in a thread on its Twitter page on Friday.","Zhaojun was \"taken away\" by Chinese police on May 21 with his computers, phones, hardware wallets and mnemonic phrases all confiscated, Multichain said. His sister was taken into custody on Thursday, it said.","The team has had no contact with Zhaojun and has maintained day-to-day operations relying on existing access to servers that had not been revoked and with assistance from Zhaojun's sister, who transferred the remaining user assets in the router pool as a \"preservation action.\" With the sister now out of contact, the \"status of the assets she has preserved is uncertain,\" Multichain said.","The protocol's precarious existence was highlighted last week when it was exploited for $130 million after an attacker drained funds from numerous token bridges.","\"According to Zhaojun's sister, login information from an IP address in Kunming was found on the cloud server platform, along with a series of operations transferring funds from the MPC addresses,\" Multichain said in the Twitter thread.","Multichain's MULTI token is down nearly 12% on the day at the time of writing, after sinking from around $2.28 to $2.01 following the announcement.","UPDATE (July 14, 9:50 UTC): Adds timing of sister's detention, asset transfers, June hack, MULTI token.","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"July 14","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"$130 million","content":"MONEY"},{"type":"Multichain","content":"PERSON"},{"type":"$2.28","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$2.01","content":"MONEY"},{"type":"MPC","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Zhaojun","content":"PERSON"},{"type":"May 21","content":"DATE"},{"type":"Kunming","content":"LOCATION"},{"type":"Zhaojun","content":"ORGANIZATION"}],"hashtag":["MultiChain","Blockchains","China"],"authors":["Jamie Crawley"]}