{"summary":"According to Alchemy’s Q2 Web3 Development Report, while NFT trading volume fell 41%, almost six million smart contracts were deployed across chains including Ethereum and Polygon.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/08\/03\/nft-trading-volume-is-sinking-but-its-not-stopping-developers-from-entering-web3\/","publishDate":"2023-08-03T14:00:00","id":15192,"type":null,"title":"NFT Trading Volume Is Sinking, But It’s Not Stopping Developers From Entering Web3","category":["Web3"],"content":["The past few months have been rough for non-fungible token (NFT) trading. But it appears builders are still bullish on Web3.","According to developer platform Alchemy’s latest Web3 Development Report, while NFT trading volume fell 41% in the second quarter of 2023, 5.9 million smart contracts were deployed across Ethereum Virtual Machine (EVM)-compatible networks including Ethereum, Arbitrum, Optimism and Polygon. This number represents a 302% increase since Q1, and a 1,107% increase since the second quarter of 2022.","In addition, 26.8 million Ethereum software developer kits (SDKs) were installed in Q2, a 7% increase from the previous quarter.","While not all of the new smart contracts deployed or Ethereum SDKs installed will be used to build NFTs, continued development points to a positive direction for Web3’s growth and its steps toward mass adoption. Despite the bear market, Ethereum’s price has increased 12% since last year.","Blake Tandowsky, growth analyst at Alchemy, told CoinDesk that whale NFT trading volumes peaked in Q2 2022, and now, less users are entering the market. Still, the emerging use cases for NFTs such as gaming have kept developers hungry to build on the blockchain.","“We saw pretty strong new users in Q2 2022, but as time went on, the number of new users entering the space for NFT volume basically wasn't able to sustain that level of growth, which is why today we're kind of seeing a lower number than usual,” said Tandowsky. “One thing that kind of stands out is the need for additional use cases for some NFTs … there could be a lot of future NFT use cases that look very different from their original JPEG iteration.”","The report highlighted several standout Web3 use cases last quarter that included shoe retailer Nike’s Our Force 1 collection drop, the growth of decentralized social media platform Lens Protocol and gaming marketplace Google Play’s support for games that have integrated NFTs.","“There's obviously a lot of developers who build on Google, and I think the ability for them to now deploy certain integrations with [decentralized apps] is really just exciting for gaming, for NFTs, for all parts of the blockchain ecosystem,” said Tandowsky. “It reduces the friction or barriers of where you can and cannot deploy dapps.”","Despite efforts to bring Web3 mainstream, NFTs have experienced dramatic ups and downs in terms of trading volume since the beginning of 2023. In March, NFT trading volume reached a high of $2 billion, a number not seen since the Terra death spiral, that some say was a catalyst for the bear market. Yet in mid-May, trading volume was on track to fall below $1 billion – the lowest since January. Since then, popular NFT collections have lost substantial value from their bull market highs, including Azuki and Bored Ape Yacht Club.","Edited by Rosie Perper."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Tandowsky","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"second quarter of 2022","content":"DATE"},{"type":"Google","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"second quarter of 2023","content":"DATE"},{"type":"12%","content":"PERCENT"},{"type":"Blake Tandowsky","content":"PERSON"},{"type":"41%","content":"PERCENT"},{"type":"302%","content":"PERCENT"},{"type":"1,107%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Alchemy","content":"ORGANIZATION"},{"type":"mid-May","content":"DATE"},{"type":"Nike","content":"ORGANIZATION"},{"type":"last quarter","content":"DATE"},{"type":"Rosie Perper","content":"PERSON"},{"type":"$2 billion","content":"MONEY"}],"hashtag":["Web3","NFT","Alchemy","Trading Volume","Ethereum Virtual Machine"],"authors":["Cam Thompson"]}