{"summary":"Polygon was at risk of losing nearly all of its MATIC tokens until it upgraded its network earlier this month.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/128784\/polygon-critical-bug-24-billion-matic-tokens-at-risk-hard-fork","publishDate":"2021-12-29T14:01:22","id":152,"type":null,"title":"&#x27;Critical&#x27; Polygon bug put $24 billion in tokens at risk until recent hard fork","category":["THE BLOCK"],"content":["Ethereum scaling project Polygon was at risk of losing nearly all of its MATIC tokens until it upgraded its network earlier this month.","The problem was <a href=\"https:\/\/blog.polygon.technology\/all-you-need-to-know-about-the-recent-network-upgrade\/\" data-v-f87c67ca=\"\">a \"critical\" vulnerability<\/a> in Polygon's proof-of-stake genesis contract, which could have allowed attackers to steal over 9.2 billion MATIC tokens (currently worth over $24 billion). The total supply of MATIC tokens is 10 billion.","<a href=\"https:\/\/medium.com\/immunefi\/polygon-lack-of-balance-check-bugfix-postmortem-2-2m-bounty-64ec66c24c7d\" data-v-f87c67ca=\"\">The vulnerability<\/a> was reported on the bug bounty platform Immunefi by a whitehat hacker known as Leon Spacewalker. According to details shared Wednesday, the bug essentially could have allowed attackers to arbitrarily mint all of Polygon's more than 9.2 billion MATIC tokens from its <a href=\"https:\/\/polygonscan.com\/address\/0x0000000000000000000000000000000000001010\/tokens\" data-v-f87c67ca=\"\">MRC20 contract<\/a>.","After Spacewalker found the bug, Immunefi informed the Polygon team the same day. The team then confirmed the vulnerability and moved to update the Polygon network, initially with an update for its Mumbai testnet.","According to Polygon, the testnet update was completed on December 4, and the team was preparing for the mainnet upgrade. Yet before the mainnet upgrade was undertaken, a malicious actor exploited the bug and stole 801,601 MATIC tokens (currently worth over $2 million). Polygon has said it will bear the cost of the theft.","After the MATIC tokens were stolen, a second whitehat hacker (who remains anonymous) discovered the vulnerability and submitted a report to Immunefi. Polygon then released an emergency upgrade for its mainnet, with the hard fork taking place on December 5.&nbsp;","Though details of the incident wouldn't be released until December 29, <a href=\"https:\/\/twitter.com\/MihailoBjelic\/status\/1471114922247528458\" data-v-f87c67ca=\"\">chatter on social media<\/a> in mid-December emerged about Polygon's silent, zero-warning hard fork.","At the time, Polygon co-founder Mihailo Bjelic <a href=\"https:\/\/twitter.com\/MihailoBjelic\/status\/1471114922247528458?s=20\" data-v-f87c67ca=\"\">said<\/a> that there was a vulnerability and that the team would release additional details. \"We are now investing much more in security and we're making an effort to improve security practices across all Polygon projects,\" he wrote at the time.&nbsp;","As for why the project waited until now to disclose the bug, Polygon said it follows a \"silent patches\" policy introduced and used by Geth (an Ethereum software client) team, explaining:","\"All in all, the core development team struck the best possible balance between openness and doing what is best for the community, partners and the broader ecosystem in handling this extremely urgent and sensitive issue. But you can be the judge of that.\"","The Polygon team awarded bug bounties worth roughly $3.46 million, with Spacewalker receiving $2.2 million worth of&nbsp;stablecoins, and the anonymous whitehat hacker receiving 500,000 MATIC tokens (currently worth over $1.27 million).","The market for MATIC doesn't appear to have been affected by the bug news, with the token trading at around&nbsp;$2.59 as of press time.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"mid-December","content":"DATE"},{"type":"$1.27 million","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"$2.2 million","content":"MONEY"},{"type":"$2 million","content":"MONEY"},{"type":"$3.46 million","content":"MONEY"},{"type":"$24 billion","content":"MONEY"},{"type":"Immunefi","content":"LOCATION"},{"type":"December 5","content":"DATE"},{"type":"Mihailo Bjelic","content":"PERSON"},{"type":"$2.59","content":"MONEY"},{"type":"December 4","content":"DATE"},{"type":"Mumbai","content":"LOCATION"},{"type":"Polygon","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"December 29","content":"DATE"}],"hashtag":["POLYGON"],"authors":["Yogita Khatri","The Block"]}