{"summary":"BlockFi CEO Zac Prince said it will be the first credit (not debit) card in the cryptocurrency industry.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2020\/12\/01\/blockfi-announces-early-2021-launch-for-bitcoin-rewards-credit-card\/","publishDate":"2020-12-01T14:00:04","id":15200,"type":null,"title":"BlockFi Announces Early 2021 Launch for Bitcoin Rewards Credit Card","category":["Finance"],"content":["","Cryptocurrency lender BlockFi has taken its first step in the payments space.","","","The New York City-based company, known for its lending operation, interest-bearing crypto products and trading desk, announced Tuesday it will launch its long-awaited bitcoin rewards credit card in the first quarter of next year.","","","CEO Zac Prince said the credit card will be the first of its kind in an industry that is already saturated with bitcoin reward debit cards.","","","“A lot of the debit cards that exist in the crypto ecosystem are the kind that are oriented around this idea of spending your crypto, which at least clients at BlockFi are not interested in doing,” Prince told CoinDesk in an interview. “They want to hold their bitcoin and earn a yield on it.” ","","","While BlockFi is working on functionality that will allow users to pay down their BlockFi credit card debt with crypto, Prince said the company will encourage customers to use the card for everyday spending, not for racking up debt. The interest rates on BlockFi’s loans are much better than the annual percentage rates on the credit card, Prince added.","","","Read more: Coinbase to Launch Crypto Debit Card in US for Retail Spending","","","The crypto lender is putting out the new product about a quarter behind schedule because of how many of its partner organizations had to work from home due to the COVID-19 pandemic. ","","","“You have to work with quite a few partners to bring a credit card to market,” Prince told CoinDesk in August of this year. “Some of them haven’t really handled the transition from being fully in-office to being fully remote as smoothly as companies like BlockFi have.” ","","","Visa is acting as the card issuing network, Evolve Bank & Trust provides the Bank Identification Number (BIN) that allows BlockFi to connect to the payments network and Deserve is managing the payments flow technology. ","","","The card spends dollars but earns rewards in bitcoin. The rewards back are 1.5% of fiat purchases, and the bitcoin users receive is deposited into their BlockFi accounts. The annual fee for the card is $200. For the first year, BlockFi is giving users who spend at least $3,000 on the card in the first three months a stipend of $250. ","","","The revenue for BlockFi will be one part interchange fee (which will be split between customer rewards and revenue) and another part annual fee, Prince added.","","","“This will add payments revenue as a category\" on the balance sheet, Prince said. “Payments generally is a revenue type that gets pretty healthy multiples in capital markets.” ","","","Read more: BlockFi Raises $50M From Universities, NBA Star, Others as Crypto Lending Soars","","","Since the credit card is a premium Visa card, BlockFi plans to offer more credit and debit cards in the future that are also tied to customers’ crypto accounts. Prince also said he envisions a future where customers can deposit their paychecks into a BlockFi account, send remittances with BlockFi, and do bill pay and other regular banking activities as well. ","","","“We’re not announcing what we’re going to do in year two yet,” Prince said. “We intend – like we’re doing in year one – to make it as much of a no-brainer decision as we can for folks to hold the card.” ","","","Prince couldn’t give exact credit limit ranges, but expects to see limits vary from $5,000 on the low end to $25,000 on the high end, depending on the creditworthiness of the customer.",""],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Bank Identification Number","content":"ORGANIZATION"},{"type":"$3,000","content":"MONEY"},{"type":"Prince","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"$5,000","content":"MONEY"},{"type":"1.5%","content":"PERCENT"},{"type":"Zac Prince","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"first quarter","content":"DATE"},{"type":"Launch Crypto Debit Card","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Crypto Lending Soars","content":"ORGANIZATION"},{"type":"$25,000","content":"MONEY"},{"type":"$200","content":"MONEY"},{"type":"$50M","content":"MONEY"},{"type":"Evolve Bank & Trust","content":"ORGANIZATION"},{"type":"$250","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["credit cards","BlockFi","Crypto Lending"],"authors":["Nate DiCamillo"]}