{"summary":"Jenn Sanasie said off-sites and conferences can help humanize crypto. This article is part of \"Future of Work Week.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/07\/01\/web3-needs-in-person-gatherings\/","publishDate":"2022-07-01T21:03:06","id":15205,"type":null,"title":"Web3 Needs In-Person Gatherings","category":["Consensus Magazine (layer2)"],"content":["Enough talk about decentralized finance – the decentralization we’re all experiencing is the changing nature of work!","Remember when we used to wake up at an ungodly time, shower, get dressed and sit in traffic for two hours so we could perch at a desk and work among our colleagues? The COVID-19 pandemic fast tracked a trend we were already heading towards – a future where the workforce is distributed – alleviating congested cities, allowing workers to live where rent is cheaper and providing a people with real flexibility.","Jenn Sanasie is a content director at Windranger Labs and co-host of \"The Hash\" on CoinDesk TV. This article is part of \"Future of Work Week.\"","Even now that offices are open and people are vaccinated, 61% of workers are choosing to remain at home. But the future of work isn’t only at home: It’s a hybrid model that sees decentralized organizations centralize for short sprints in Airbnbs and boutique hotels all over the world for creative collaboration, goal setting and team building.","See also: The Crypto CEO Who Doesn't Want the Job","The internet allows us to transcend physical boundaries, and blockchain technology provides a means for community building and accountability, but we should be wary of going too far. Real life experiences shouldn’t be phased out – not even in Web3.","My first experience with this promising, new model of work was as a community contributor to BitDAO, when I joined Windranger Labs in March. Windranger Labs is a core contributor to the BitDAO ecosystem, and is committed to building, co-developing and accelerating autonomous entity infrastructure.","Like other decentralized autonomous organizations (DAO), we've benefited greatly from having a global pool of self-motivated contributors. For instance, I joined the company from the comfort of my home, as did many of my colleagues based in 25 different countries.","We met for the first time last month during an off-site in San Francisco. Up until this moment my colleagues were a sea of voices and avatars online, some of whom worked opposite hours than me – making it difficult to understand their triggers, motivations and culture.","“With everyone remotely working from all corners of the Earth, finding the ideal time for team mates across multiple timezones can be really tricky,” Kalli Yong, head of social media, said. \"Decentralized work\" has a great number of benefits; however, it isn't always as \"efficient as compared to [in real life] collaboration,“ she added.","The mission behind our San Francisco off-site was to bring teams together to align on the company’s vision and foster a greater sense of interpersonal understanding. There were all your usual office amenities and needs: white boards, smart boards, lounge chairs and plenty of snacks.","Surprisingly, my team achieved more work over these eight days than would have probably taken weeks if we weren’t together IRL. That's to say nothing of the quality of bonding that seems to only happen face to face.","The Windranger team met again in New York City last month for NFT.NYC, the largest such industry event. Almost the entire company was in attendance, as BitDAO was a sponsor. As a decentralized organization with no headquarters that is contributing to a DAO, it was surreal to see the BitDAO logo on billboards in Times Square, and draped all over the conference.","We relished these moments of coming together in person, finally all in the same time zone, at dinners, brunches and quick coffee meetings. We even threw a rave.","While being in person was productive and helped establish our workplace culture, it might have had the opposite effect if we were going into an office everyday. Was it just me, or did company off-sites feel weird or forced, rather than celebratory?","See also: It Can't Be 'Decentralization or Bust'","“It was really nice to finally put names to faces, and meeting people in-person provides a clearer understanding of the way they work which is definitely helpful when we work remotely again,\" Yong said. \"Having offsites once in awhile has proven to be productive as the team gets to forge a stronger bond rather than just having to talk to a screen.”","The future of work is not completely decentralized, and authentic engagement is rooted in IRL community models. We’ve been organizing ourselves for millennia and the skills we’ve developed in that time don’t need to be displaced, but rather focused.","Meet the pioneers who work at decentralized autonomous organizations.","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","CoinDesk asked a variety of crypto professionals how they got their foot in the door in the industry.","\n"],"entity":[{"type":"San Francisco","content":"LOCATION"},{"type":"Earth","content":"LOCATION"},{"type":"New York City","content":"LOCATION"},{"type":"Airbnbs","content":"LOCATION"},{"type":"” Kalli Yong","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"IRL","content":"ORGANIZATION"},{"type":"Jenn Sanasie","content":"PERSON"},{"type":"61%","content":"PERCENT"},{"type":"The Crypto","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"Windranger Labs","content":"ORGANIZATION"},{"type":"last month","content":"DATE"},{"type":"Times Square","content":"LOCATION"},{"type":"Yong","content":"PERSON"}],"hashtag":["Opinion","Future of Work Week","Decentralization","DAO","Web 3.0"],"authors":["Jennifer Sanasie"]}