{"summary":"Based on intimate, curated group discussions that took place at Consensus 2023, it covers a wide range of pressing issues for the digital assets industry.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/05\/introducing-coindesks-first-ever-consensus-consensus-report\/","publishDate":"2023-06-05T14:15:15","id":15204,"type":null,"title":"Introducing CoinDesk’s First-Ever ‘Consensus @ Consensus’ Report","category":["Consensus Magazine"],"content":["The cryptocurrency community has a great story to tell, but it urgently needs to tell it.","At least, that is a recurrent theme throughout CoinDesk’s first-ever Consensus @ Consensus report, out today. Based primarily on intimate group discussions that took place at Consensus 2023, it covers a wide range of pressing issues challenging the digital assets industry. These include the newly urgent subject of regulation, the competing demands of privacy and law enforcement, the difficulty of bringing self-custody to the mainstream, the future of crypto media, and more. The discussion groups, which convened largely offstage in Austin, Texas, from April 26-28, 2023, represented a cross-section of interested parties – including developers, investors, government officials, entrepreneurs, and nonprofits.","Amid that variety of topics and diversity of perspectives, the one clear through-line, the refrain that I kept reading over and over as I edited the 11 chapters, was that this global movement has to remember why it exists in the first place – and clearly explain that purpose to the wider world.","This article is excerpted from CoinDesk’s inaugural Consensus @ Consensus Report, the product of intimate, curated group discussions that took place at Consensus 2023. Click here to download the full report.","Following the crypto crash of 2022, governments and the general public are apt to view this technology as a get-rich-quick scheme, a hive of hucksters and fraudsters. This perception is understandable, in part because such unsavory characters always flock to crypto during bull markets, and especially because the last boom-bust cycle drew in institutional and mainstream retail investment as never before, causing more widespread damage when the bubble inevitably burst.","As I’m fond of saying, the casual observer could be forgiven for missing the beauty of a horse when there are so many flies buzzing around its behind.","Despite a relatively upbeat mood among the 15,000 attendees from 97 countries who attended Consensus 2023, the specter of Sam Bankman-Fried’s failed FTX exchange loomed large over the event. Bankman-Fried explicitly said he was in the business to make a fast fortune (albeit because he supposedly wanted to donate his winnings to good causes). Thanks in no small part to his deceptions, along with similarly reckless behavior by less prominent figures during the febrile period from 2021-2022, life savings have been lost, politicians are out for blood, and the U.S. securities and banking regulators have gone from lukewarm to hostile in their stance toward the industry.","See also: 5 Consensus 2023 Takeaways | CoinDesk Chief Content Officer Michael Casey","Overshadowed by all this drama are the developers, creators and entrepreneurs who still believe in crypto’s foundational ideals of openness, transparency (for the powerful), privacy (for the weak) and decentralization. They stick around after the price charts turn red and build for the long term. Whatever the future holds, it belongs to them.","However, the consensus at Consensus, as it were, is that they need to get the word out about how their projects benefit (or will benefit) everyday users, in order to mitigate the inevitable, ongoing tightening of the regulatory screws.","“I think what the industry could benefit from is affirmative efforts at positive narratives,” is a representative quote from a participant in one of the private roundtable discussions….","Click here to download the full Consensus @ Consensus report."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"April 26","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"28, 2023","content":"DATE"},{"type":"Michael Casey","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["Features","Consensus at C23","Consensus 2023"],"authors":["Marc Hochstein"]}