{"summary":"U.S. economic data on Thursday has sent interest rates and the dollar higher.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/14\/bitcoin-sells-off-3-is-macro-risk-returning-to-market\/","publishDate":"2024-03-14T16:11:27","id":15203,"type":null,"title":"Bitcoin Sells Off 3%; Is Macro Risk Returning to Market?","category":["Markets"],"content":["Bitcoin bulls so far this year have had a respite from having to pay attention to things like the economy and Federal Reserve monetary policy thanks to the overwhelming demand for the crypto from the new spot ETFs. For the moment, at least, that appears to be changing.","Thursday morning's Producer Price Index (PPI) for February was yet another data point that perky inflation is proving far stickier than most expected. The government report said PPI was higher by 0.6% last month, doubling the pace in January and also double economist forecasts. The so-called core PPI, which excludes food and energy costs, rose 0.3% in February, a slowdown from 0.5% in January, but ahead of forecasts for 0.2%.","Earlier this week, the Consumer Price Index (CPI) also came in faster than anticipated, with inflation ticking up to 3.2% annually and the core rate rising to 3.8%.","Previously flirting with dipping below the 4% level earlier this month, the 10-year Treasury yield has new risen to 4.30%. Alongside, the U.S. dollar has broken out a downtrend begun in mid-February to rise about 1% over the past week, including a 0.5% rise on Thursday. All things being equal, higher rates and a rising dollar tend to be a negative for risk assets like bitcoin (BTC).","Expectations for far easier monetary policy in 2024 continue to be whittled back. Markets had come into the year anticipating as much as 150 basis points in Fed rate cuts in 2024, with the initial cut to come at next week's Federal Open Market Committee meeting. At this point, no one longer expects that, nor is a cut expected at the May meeting. As for June, the odds of lower rates have fallen to roughly 50%, according to the CME FedWatch Tool.","After about a 70% rise in 2024 to a new record high just shy of $74,000, bitcoin was surely vulnerable to a correction and it could be that the inflation, interest rate and dollar news has given traders an excuse to lighten up. After touching $73,800 earlier Thursday morning, bitcoin slid to as low as $70,650 after the economic data. At press time it was trading at $70,900 down more than 3% over the past 24 hours. The broader CoinDesk 20 Index was lower by just 1.7%, with gains in Solana and Dogecoin helping that gauge's outperformance."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"70%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"3.8%","content":"PERCENT"},{"type":"May","content":"DATE"},{"type":"4%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CME FedWatch Tool","content":"ORGANIZATION"},{"type":"0.5%","content":"PERCENT"},{"type":"3.2%","content":"PERCENT"},{"type":"0.3%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"$70,650","content":"MONEY"},{"type":"3%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"1.7%","content":"PERCENT"},{"type":"Dogecoin","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Federal Open Market Committee","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"0.6%","content":"PERCENT"},{"type":"$74,000","content":"MONEY"},{"type":"$73,800","content":"MONEY"},{"type":"0.2%","content":"PERCENT"},{"type":"morning","content":"TIME"},{"type":"June","content":"DATE"},{"type":"4.30%","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"$70,900","content":"MONEY"},{"type":"Solana","content":"LOCATION"}],"hashtag":["Inflation","Bitcoin","Interest Rates"],"authors":["Stephen Alpher"]}