{"summary":"The token is getting close to $100 billion in market cap","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2021\/09\/02\/cardanos-ada-tops-3-for-first-time-as-smart-contracts-enter-test-mode\/","publishDate":"2021-09-02T18:56:41","id":15206,"type":null,"title":"Cardano’s ADA Tops $3 for First Time as Smart Contracts Enter Test Mode","category":["Markets"],"content":["Cardano’s ADA token surged more than 7% Thursday to an all-time high of over $3, as the project’s lead developer announced that smart contracts functionality had been activated on a test network, bringing the blockchain a step closer to competition with the Ethereum blockchain.","The ADA price rose as high as $3.09 before slipping to around $2.94 at press time.","The latest rally came as lead developer IOHK, headed by Charles Hoskinson, tweeted that the Cardano test network had successfully deployed smart contracts capability and that the focus would now turn to the “Alonzo” upgrade of the main network, which he said is still “on track” to be deployed on Sept. 12.","Cardano is the third-largest cryptocurrency by market cap ($93.7 billion), behind bitcoin ($934 billion) and Ethereum’s ether ($439 billion). The ADA token has soared 1,583% this year, versus 69% for bitcoin and 417% for ether.","Cardano is considered one of the so-called “Ethereum-killers” – fast, programmable blockchains that might eventually unseat Ethereum as the leader in decentralized finance (DeFi) as well as in other use cases like non-fungible tokens, or NFTs. Tokens from a group of Ethereum competitors, which includes the Polkadot, Solana and Terra platforms, saw triple-digit price gains last month as Ethereum looks to resolve issues with congestion and high fees on its network.","Read More: Solana’s SOL Token Nearly Tripled in August as Investors Bet on ‘Ethereum Killers’","Testnet deployments and network upgrades known as “forks” are widely viewed as significant milestones for a cryptocurrency’s development, as nascent blockchain projects slowly mature and add new features.","According to an informational video from IOHK, the recent upgrade will aim to test stability and security and ensure that the foundational code used to write smart contracts is working properly.","The Cardano network is in the third phase of its five-era road map. The current “Goguen” era aims to add smart contract functionality to Cardano, giving developers the ability to build decentralized applications on the blockchain.","In the Cardano ecosystem, Alonzo is one of the sub-phases of the Goguen era, which is further split into the the three Blue, White and Purple phases. Cardano’s smart contract language is called Plutus.","Cardano is eyeing Sunday, Sept. 12, as the switch date to its mainnet, giving developers just under two weeks in the current test environment.","A spokesperson for Cardano did not immediately respond to a request for comment."],"entity":[{"type":"7%","content":"PERCENT"},{"type":"1,583%","content":"PERCENT"},{"type":"Sunday","content":"DATE"},{"type":"$93.7 billion","content":"MONEY"},{"type":"417%","content":"PERCENT"},{"type":"Thursday","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"Cardano","content":"LOCATION"},{"type":"$2.94","content":"MONEY"},{"type":"$3","content":"MONEY"},{"type":"$439 billion","content":"MONEY"},{"type":"$934 billion","content":"MONEY"},{"type":"69%","content":"PERCENT"},{"type":"Sept. 12","content":"DATE"},{"type":"Solana’s SOL Token Nearly Tripled","content":"ORGANIZATION"},{"type":"ADA","content":"ORGANIZATION"},{"type":"Goguen","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"$3.09","content":"MONEY"},{"type":"Charles Hoskinson","content":"PERSON"},{"type":"August","content":"DATE"}],"hashtag":["Markets","Cardano","Ethereum","Staking"],"authors":["Tracy Wang"]}