{"summary":"The Coinbase news follows an announcement of layoffs at fellow exchange Gemini earlier today.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/02\/coinbase-announces-cost-cutting-measures-as-crypto-firms-face-bear-market-woes\/","publishDate":"2022-06-02T20:57:20","id":15201,"type":null,"title":"Coinbase Announces Cost-Cutting Measures as Crypto Firms Face Bear Market","category":["Finance"],"content":["Coinbase (COIN) is the latest crypto firm to announce cutbacks.","In a blog post written by Chief People Officer L.J. Brock, Coinbase said Thursday it \"will extend our hiring pause for both new and backfill roles for the foreseeable future and rescind a number of accepted offers.\"","The cutbacks come \"in response to the current market conditions and ongoing business prioritization efforts,\" he wrote.","The cost-cutting measures will see Coinbase rescind \"a number of accepted offers\" to prospects yet to start, and extend the two-week hiring pause \"for as long as this macro environment requires.\"","The hiring freeze is a continuation of a plan announced last month. The latest announcement comes after fellow exchange Gemini announced Thursday it was laying off 10% of its staff, or roughly 100 people.","Read more: Coinbase Outlines Cost-Cutting Measures, Employee Grants Amid Weak Results and Crypto Rout: Report","Crypto exchanges globally have felt the market crunch. In recent weeks, Latin America's top exchange Bitso fired 80 employees, Argentina's Beunbit nearly halved its staff and Middle Eastern exchange Rain reportedly laid off \"dozens.\"","\"Adapting quickly and acting now will help us to successfully navigate this macro environment and emerge even stronger, enabling further healthy growth and innovation,\" wrote Coinbase's Brock."],"entity":[{"type":"Argentina","content":"LOCATION"},{"type":"Brock","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Middle Eastern","content":"ORGANIZATION"},{"type":"L.J. Brock","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"Latin America","content":"LOCATION"},{"type":"Coinbase","content":"PERSON"},{"type":"10%","content":"PERCENT"}],"hashtag":["Coinbase","Hiring","Bear market"],"authors":["Zack Seward"]}