{"summary":"For an industry built on the principle of decentralization, we had a lot of trust in one 30-year-old. Understanding why is key to a more sustainable future for crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/11\/14\/after-ftx-rebuilding-trust-in-cryptos-founding-mission\/","publishDate":"2022-11-14T19:33:36","id":15213,"type":null,"title":"After FTX: Rebuilding Trust in Crypto’s Founding Mission","category":["Layer 2"],"content":["After one of the most dramatic weeks in crypto history, in which a large and highly regarded trading platform was revealed to be engaging in shady financial management resulting in a multibillion-dollar balance sheet hole and the bankruptcy of more than 130 related companies, we’re left wondering how this could happen in an industry created to obviate the need for trust.","That question is naïve, however – while details are starting to emerge around how much money was moved where and why, the underlying reason is this: We chose to trust.","Noelle Acheson is the former head of research at CoinDesk and Genesis Trading. This article is excerpted from her Crypto Is Macro Now newsletter, which focuses on the overlap between the shifting crypto and macro landscapes. These opinions are hers, and nothing she writes should be taken as investment advice.","The instinctive reaction, then, familiar to all who have had trust broken, will be to vow to never be that vulnerable again. In finance, we do now have the technology to facilitate a relatively trust-free financial relationship with atomic swaps, transfer monitoring and balance verification. But, just as our bruised souls almost always eventually recover from personal disappointment and we again open our hearts to others, we will see that we can’t live without centralized services that require us to believe they are doing what they say.","This is a consequence of internal and external systems that we can’t do much about.","The internal system is our emotional makeup. We humans are wired to rely on others for survival. It’s why our ancestors formed tribes, clans and countries. Modern times have given us the means to feed ourselves and shelter without help, and yet most of us still seek out friendship and a sense of belonging because satisfying emotional needs alone is not yet something we are good at. The parallel in commerce and finance is the energy-saving convenience of having specialists handle as much as possible, creating satisfying connections while freeing up our time for other pursuits.","Read more: CoinDesk's continuing coverage of FTX's collapse","The external system is the regulatory framework many of us live in. When it comes to financial services, our choices are limited to those offered by counterparties that have satisfied certain requirements designed to ensure that we are making informed decisions and that our assets will be recoverable. Hardly anyone reads the small print of the terms and conditions we need to accept before we can transact – it’s a better use of our time to assume that they make sense. We also don’t demand proof that the firm follows sound practices – we assume that it would rather avoid the punishment of non-compliance with the law.","But crypto was created to be different. Perhaps too much so for us to emotionally adapt in such a short time frame.","We didn’t have to trust FTX – there are decentralized alternatives, after all. But we chose to. We could have insisted on more clarity on the balance sheet, done some forensics on token movements earlier and asked why no investors were on the board of directors. But we didn’t.","We fell into the ingrained habit of trusting a centralized provider, for many reasons: the convenience, the potential for return, the sense of belonging and instinctive respect for smarts and eloquence, as well as the uplifting satisfaction of rooting for the scruffy underdog and seeing him (Sam Bankman-Fried) succeed.","This is perhaps the result of drawing inferences from patterns – if a company is big and successful, it must be legit, right? If it has so many offices in so many jurisdictions, if it is supporting the growth of the industry in so many areas, if the founder has so many famous and powerful friends, then surely the verification work has been done, right?","Throw in a hefty dose of ideology, and you get a supportive crowd whose strong desire for the concept to triumph suppressed the normal checks on common sense. And there’s the affective reflex that drew in even non-believers: Who doesn’t love a nerdy outsider who quietly and intelligently explains how he’s going to make the world a better place by reforming finance and giving away most of his money?","I’m not pointing any fingers here, except perhaps at the mirror.","Do we eschew centralized platforms forever because we can’t be trusted to vet them properly? That sounds appealing right now, and the resilience and growth of decentralized applications paint a landscape of empowering potential. But we know that many of us will slip back into the habit of instinctively choosing convenience over safety, convinced that we will be better at spotting danger signs next time. After all, convenience breeds efficiency, which generates economic gain, and as humans, we instinctively gravitate toward comfort and collaboration.","We can do better. We can accept that centralized platforms will form an integral part of our markets, while learning from this debacle and designing tools that make trust less based on blind faith. This is already happening – over the past week, several platforms have announced that they will publish “proof of reserves,” a combination of cryptographic and traditional audit that enables users to independently verify that a platform’s assets match or exceed customer deposits.","In the future, venture-capital investors, some of whom will have a bit of uncomfortable explaining to do over the coming weeks, will become more rigorous in their due diligence, at least until the next hot fad comes along.","Lobby groups and policy teams will work with regulators to draft disclosure rules while fending off hasty limitations and destructive definitions. Institutions will step back from the edge of radical innovation, but are likely to continue to support an emerging structure that looks familiar but can deliver better returns.","And the industry will continue to build a stronger offering that showcases a fundamental tenet of its existence: greater choice for individuals, anywhere. Those who want to use decentralized services should be able to do so. Those who prefer the convenience of a centralized offering deserve reliable services.","Read more: Nic Carter – Let’s Actually Commit to Proofs of Reserve This Time, Okay?","This may read like wishful thinking. But I trust human nature to do what it does best – find a collective solution to the generalized demand for protection while supporting niche solutions for outlier groups. After all, throughout history these non-mainstream idealists have been the innovators who succeed in pushing through reform when their ideas end up delivering better efficiency and empowerment than the existing system.","We will trust again. As we should – it’s part of who we are and a necessary feature of communities that build value. We have to understand the concept better, though. An awareness of why we trust is an essential part of designing systems to deliver what we need while mitigating vulnerabilities fed by our short-sightedness.","The FTX debacle has left pain and anger in its wake. It’s in our hands to make sure nothing like this happens in our industry again, while at the same time understanding how we got here. It’s also up to us to pick ourselves up, support those who are struggling and continue moving forward.","Part of the process will involve accepting that centralization will be a necessary, but carefully crafted, feature of the decentralized system we hope for. Part will be believing that, with the help of technology and much better messaging, we can achieve our goals without changing the nature of the people that make this industry the diverse force that it is."],"entity":[{"type":"Sam Bankman","content":"PERSON"},{"type":"Genesis Trading","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Nic Carter – Let’s Actually Commit to Proofs of Reserve This Time","content":"ORGANIZATION"},{"type":"Noelle Acheson","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"}],"hashtag":["FTX Collapse","Opinion","Crypto","Sam Bankman-Fried"],"authors":["Noelle Acheson"]}