{"summary":"Gensler is set to testify in an oversight hearing Tuesday.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/04\/18\/congressional-republicans-criticize-sec-chair-gary-genslers-crypto-approach-ahead-of-hearing\/","publishDate":"2023-04-18T13:56:13","id":15211,"type":null,"title":"Congressional Republicans Criticize SEC Chair Gary Gensler's Crypto Approach Ahead of Hearing","category":["Policy"],"content":["Republicans on the House Financial Services Committee criticized Securities and Exchange Commission Chair Gary Gensler ahead of a congressional hearing on the agency Tuesday, saying his approach to crypto companies was not \"compatible\" with existing law.","A letter signed by Republicans on the committee argued that national securities exchange (NSE) regulations are a poor fit for digital assets because cryptocurrencies can be used for noninvestment purposes.","Gensler's repeated statements to the industry to \"come in and register\" are a \"willful misrepresentation\" of his agency's framework, according to the letter.","\"Given an NSE can only list securities that have been offered in compliance with the securities laws, the inability to register makes the current NSE framework ill-suited for digital asset trading platforms. Moreover, the lack of clarity provided by the SEC as to what digital assets are considered securities also limits what an NSE can list,\" the letter said.","Gensler is set to testify before the committee at 10 a.m. ET on Tuesday. A subcommittee will hold a more crypto-specific hearing – discussing stablecoins – on Wednesday.","Gensler has repeatedly said he believes his agency has the authority it needs to oversee crypto, and argued that all crypto exchanges should register with the regulator. More recently, enforcement actions against companies Beaxy and Bittrex suggest he believes that exchanges should register as a national securities exchange, broker and clearinghouse.","In prepared remarks published Monday, Gensler reiterated his view that \"most crypto tokens are securities,\" adding that this is why he believes intermediaries – like exchanges – need to register with the regulator.","\"Crypto investors should benefit from compliance with the same laws that [Rep. Sam] Rayburn and [President Franklin Delano] Roosevelt laid out to protect against fraud, manipulation, front-running, wash sales and other misconduct,\" Gensler said. \"As Justice Thurgood Marshall put it so well, 'Congress’s purpose in enacting the securities laws was to regulate investments, in whatever form they are made and by whatever name they are called.'\""],"entity":[{"type":"SEC","content":"ORGANIZATION"},{"type":"House Financial Services Committee criticized Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"10 a.m.","content":"TIME"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"NSE","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Sam] Rayburn","content":"PERSON"},{"type":"Thurgood Marshall","content":"PERSON"},{"type":"Franklin Delano] Roosevelt","content":"PERSON"}],"hashtag":["Regulations","SEC","Gary Gensler","House Financial Services Committee","Congress"],"authors":["Nikhilesh De"]}