{"summary":"A brief guide to expanding deeper into, and beyond, Web3.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/10\/31\/the-nft-market-has-crashed-what-should-artists-do-now\/","publishDate":"2023-10-31T17:01:35","id":15210,"type":null,"title":"The NFT Market Has Crashed. What Should Artists Do Now?","category":["Consensus Magazine"],"content":["In the wake of the NFT market's multi-year downturn, many artists who once thrived are now navigating a challenging and uncertain landscape. The NFT market had experienced exponential growth in recent years before it stumbled, leaving artists to question whether digital artwork is still a viable avenue for success.","However, amidst this uncertainty, there are opportunities for artists not only to endure but to thrive. As new technologies continue to emerge for the distribution of art, it is crucial for artists to focus on methods that enable them to promote and sell their work long-term, regardless of the state of any market.","David DeVore is the founder of Props, an NFT marketplace and minting development platform.","According to a recent survey by Artsy, a staggering 52% of respondents said they collect art to support artists, whereas 38% said they purchase art as an investment. This statistic highlights the enduring strength of artist communities and emphasizes the importance of connecting with individual collectors.","Let's delve into why this approach is essential and explore its advantages, drawing inspiration from successful artist-collector relationships.","Building personal connections with collectors is a powerful strategy, especially in terms of return on investment. When collectors feel a personal connection to an artist, they are not just buying art; they are investing in a creative journey. This emotional bond often leads to long-term support and a loyal collector base.","Successful artists like Gabe Weis, Klara, ThankyouX and Diana Sinclair have demonstrated how fostering relationships with collectors can sustain their careers. These artists have nurtured their communities, engaging with them regularly and creating a sense of belonging that extends beyond the mere exchange of art for money.","There are a few fundamental pillars that can lead to artistic success now and in the long term. Part of the process includes artists maintaining complete ownership of their brands. In the context of crypto this means having their own mint sites, smart contracts and collector experiences.","Brand dilution through hosting on marketplace aggregators both impersonalizes the experience of buying an artwork and forces the artist to be beholden to the whims of third parties.","The term \"community\" has become somewhat overused in the Web3 ecosystem, but for artists, it boils down to a group of people who actively support and engage with their work. These individuals are enthusiastic about the artist's creations and interact with them through various social mediums.","Artists should always think first about providing intrinsic value to their community before looking for extrinsic rewards. This means regularly checking in with collectors and hosting events so they know who is active, and possibly collaborating with other artists to build a bigger network of collectors.","Such communities are invaluable, providing artists with a stable foundation that shields them from the unpredictable fluctuations of any market. The reality of the current Web3 ecosystem is that traditional NFT promotional and marketing techniques no longer work in a bear market, and that means artists have to be more creative and innovative with how they promote their work and engage collectors. This could involve creating alternative and recurring revenue streams using a variety of tools including free claims, paid mints, memberships, incorporation of physical items and IRL experiences.","Each artist needs to make data-driven decisions on what techniques work best for their work and be constantly experimenting. For example, combining Google Analytics on a personally branded website with qualitative surveys on social media channels provides robust insights on collector demographics, onsite behavior and interests that will guide artists in making more informed decisions about strategic approaches to marketing activations, content creation and communication strategies.","At the same time artists should not overlook the enduring strength of traditional distribution methods. These methods, such as art galleries, exhibitions and physical art shows, have stood the test of time and continue to provide reliability in an ever-changing art landscape. Embracing traditional methods allows artists to adapt their work to fit formats beyond the digital, increasing the likelihood their art is accessible to a broader audience.","See also: The Many Layers of the SEC's First NFT Enforcement Action | Opinion","The method to secure these more traditional avenues often comes back to self-promotion from the artists themselves, to reach a point where a gallery or exhibit would want to partner with them.","Addressing the negative reputation associated with NFTs is also crucial. While some NFT investments have been speculative in nature, it's essential to recognize that art retains its intrinsic value beyond its digital form. Art's value lies in the belief in the creator and their unique vision.","Collectors are drawn to artists they believe in, artists who connect with them on a personal level. Artists should look to convey that unique vision by giving background on their work or the specific release they’re promoting, finding adjacent communities, organizing digital and in-real-life events and showing their face as much as possible to help create a real connection with people.","The art world is constantly evolving, and artists must adapt to these changes by embracing a combination of traditional and Web3 strategies."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Klara","content":"PERSON"},{"type":"Diana Sinclair","content":"PERSON"},{"type":"38%","content":"PERCENT"},{"type":"IRL","content":"ORGANIZATION"},{"type":"Gabe Weis","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"David DeVore","content":"PERSON"},{"type":"First NFT Enforcement Action | Opinion","content":"ORGANIZATION"},{"type":"52%","content":"PERCENT"},{"type":"Google Analytics","content":"ORGANIZATION"}],"hashtag":["Opinion","NFTs","Web3","Art","digital artist"],"authors":["David DeVore"]}