{"summary":"Trading volume is down, but all signs point to a break-out around the corner.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/08\/07\/first-mover-asia-bitcoin-teases-30k-while-the-long-wait-for-an-etf-continues\/","publishDate":"2023-08-07T01:52:47","id":15219,"type":null,"title":"First Mover Asia: Bitcoin Teases $30K While the Long Wait for an ETF Continues","category":["Markets"],"content":["Good morning. Here’s what’s happening:","Prices: Bitcoin remains stagnant at $29K, teasing $30K. What will it take to push it past $30K?","Insights: Crypto has new radicals, and DeFi isn't dead.","Bitcoin is a Stablecoin?","As Asia’s markets open after the weekend, bitcoin (BTC) is at $29,012 while ether (ETH) is changing hands at $1,827 – which made for a volatility-free weekend.","“Another week of relative stability for BTC and ETH bodes well for bulls,” Joe DiPasquale, CEO of BitBull Capital said in a note. \"There have been some developments in the space, ranging from the Curve hack to more altcoin mania on Base. The market has, however, not reacted too harshly, and ETH has managed to defend $1800.”","Aside from shenanigans in Decentralized Finance (DeFi), which never fails to deliver, the broader crypto market is expected to be slow until a spot bitcoin exchange-traded fund (ETF) is approved.","The amount of liquid and highly liquid Bitcoin supply is at its lowest since 2018, while illiquid supply reaches all-time highs, and long-term holders are stashing coins away, Blockware Intelligence wrote in a recent newsletter. Meanwhile, there's significant positive momentum in the creation of new addresses, indicating a general increase in on-chain demand, similar to trends observed exiting the bear market in 2019.","In a recent note, K33 Research’s Vetle Lunde, calls July’s trading volume “anemic” but writes that the market is on a precipice of change.","The crypto market experienced an atypical drought with remarkably low trading volumes and BTC volatility near five-year lows, but the low activity could lead to a sudden eruption of volatility, he writes, with potential catalysts including ETF filings, ongoing legal matters, and structural pressures, prompting strategies such as passive long volume exposure and gradual BTC accumulation.","“A deep crypto sleep tends to be followed by a violent wake-up. The market’s volatility pressure is about to climax, and that an eruption is near,\" he said in the note.","The only question is, when?","Crypto and the Real Meaning of 'Radicalism': In the past four to five years, political thought within crypto has significantly widened, with Ethereum's smart contracts attracting economic engineers interested in balanced societal structures, the emergence of theories like \"Radical Markets\" and “regenerative economics,\" and the rise of \"The Blockchain Socialist\" as a platform discussing American economic imperialism and the left-wing perspective on privacy, challenging crypto's largely libertarian mainstream, argues a new book by Joshua Dávila – aka The Blockchain Socialist.","DeFi Definitely Isn't Dead: The summer of 2020's DeFi era, characterized by excesses like yield farming, has evolved with decentralized platforms emerging as leaders and adopting professional expansion strategies, but the sector still struggles with concentrated power and the challenges of programmers acting as financiers, reflecting an ongoing experimental phase with a potential for mistakes.","9:30 a.m. HKT\/SGT August 9 (01:30 Aug 9 UTC): China Inflation Rate YoY","8:30 p.m. HKT\/SGT August 10 (12:30 Aug 9 UTC): U.S. Core Inflation Rate YoY","In case you missed it, here is the most recent episode of \"First Mover\" on CoinDesk TV:","Coinbase Beats Analyst Estimates for Q2; Bitcoin Trades Sideways After July Jobs Report","Coinbase beat analyst estimates for the second quarter, reporting revenues of $708 million and adjusted earnings of a loss of $0.42.","NFT Trading Is Ice Cold But Developers Are Still Hot for Web3: This week, new reports were released that point to a major slowdown in NFT trading. Plus, Etihad Airways will soon let its community of frequent fliers stake NFTs for miles.","Global X Refiles Spot-Bitcoin ETF Application, Naming Coinbase as ‘Surveillance-Sharing’ Partner: The filing comes around the same time the firm requested permission to offer a bitcoin-futures ETF.","America’s Credit Rating Helps Make Case for Bitcoin: Fitch’s downgrade of U.S. debt this week is a warning to American policymakers and r underscores why Bitcoin and other open monetary systems matter, says Michael Casey."],"entity":[{"type":"BitBull Capital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"weekend","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"Blockware Intelligence","content":"ORGANIZATION"},{"type":"Asia","content":"LOCATION"},{"type":"2019","content":"DATE"},{"type":"Vetle Lunde","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$29K","content":"MONEY"},{"type":"$1800","content":"MONEY"},{"type":"Michael Casey","content":"PERSON"},{"type":"second quarter","content":"DATE"},{"type":"August 9","content":"DATE"},{"type":"$1,827","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Joe DiPasquale","content":"PERSON"},{"type":"8:30 p.m.","content":"TIME"},{"type":"$708 million","content":"MONEY"},{"type":"$0.42","content":"MONEY"},{"type":"August 10","content":"DATE"},{"type":"Etihad Airways","content":"ORGANIZATION"},{"type":"$29,012","content":"MONEY"},{"type":"Decentralized Finance","content":"ORGANIZATION"},{"type":"Joshua Dávila","content":"PERSON"},{"type":"9:30 a.m.","content":"TIME"},{"type":"summer of 2020","content":"DATE"},{"type":"China","content":"LOCATION"},{"type":"$30K","content":"MONEY"}],"hashtag":["Bitcoin ETF","DeFi","bitcoin volume","Trading Volume","Asia Pacific"],"authors":["Sam Reynolds"]}