{"summary":"Law professors who've long pushed for a digital dollar worked with Congress to bring the concept to a series of coronavirus relief bills earlier this week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2020\/03\/27\/how-a-flurry-of-digital-dollar-proposals-made-it-to-congress\/","publishDate":"2020-03-27T17:30:30","id":15217,"type":null,"title":"How a Flurry of 'Digital Dollar' Proposals Made It to Congress","category":["Policy"],"content":["","The “digital dollar” took just eight days to get into the U.S. Congress.","","","Advocates for digitizing coronavirus relief payments began working with congressional staffers earlier this month to outline how the Federal Reserve could potentially distribute funds to unbanked individuals quickly as the country’s economic downturn worsened.","","","Morgan Ricks, an associate professor at Vanderbilt Law School, told CoinDesk that a provision detailing the digital dollar in two different bills from the House of Representatives reflected assistance that he, along with Columbia University fellow Lev Menand and University of California Hastings law professor John Crawford, provided. The group has long advocated for a digital dollar, writing a paper in 2018 on the subject and a Bloomberg opinion piece earlier this week.","","","Ricks told CoinDesk in a phone call Wednesday that he had been working with staffers since around March 17. Ricks refused to specify which House staffers he had worked with.","","","“A digital wallet with the Fed would be a ... relatively easy way of [distributing funds],” Ricks said. ","","","Still, while the bills painted the initiative as an urgent one targeted at providing immediate relief to U.S. residents, Ricks said the process might take some time.","","","Read more: US Senate Floats ‘Digital Dollar’ Bill After House Scrubs Term From Coronavirus Relief Plan","","","“The ultimate vision here is that at some point down the road, probably next year, people really would have a direct account with the Fed consisting of digital money and there wouldn't be any other intermediary bank,” Ricks said. “The Fed doesn't have that retail capability right now.”","","","State-level advisers may also be assisting, said Sheila Warren, head of blockchain and distributed ledger technology at the World Economic Forum.","","","That Congress was thinking about digital currencies after last year’s libra hearings is not a surprise, she said. ","","","“The fact that it even got that far means there’s already a lot of behind-the-scenes action happening that’s already working on this,” she said.","","","The language first appeared, and was then promptly stripped from one of two House bills, on Monday – and is likely to be dropped from the other House bill. Then the digital dollar roared back to life with its own dedicated draft bill before the U.S. Senate. That bill was introduced Monday by Sen. Sherrod Brown (D-Ohio), who is also the ranking member on the Senate Committee on Banking, Housing and Urban Affairs. ","","","Vanderbilt’s Ricks said he had not seen the Senate version and was not working with Brown’s office.","","","“At the height of this pandemic we must do more to protect the financial wellbeing of hardworking Americans and consumers,” Brown said in a statement. “They are on the front lines of this crisis and are already feeling the effects of the economic fallout.”","","","A source familiar with the effort said Brown’s office intends to pursue the legislation, currently sitting before the Senate Banking Committee.","","","In a statement, Brown painted the proposal as one aimed at helping unbanked or underbanked individuals access financial services, a goal many crypto projects – including the Facebook-led Libra stablecoin effort – likewise target.","","","“My legislation would allow every American to set up a free bank account so they don’t have to rely on expensive check cashers to access their hard-earned money,” Brown said.","","","These concerns are not unfounded: According to the New York Times, the final relief bill, which both the House and the Senate passed, allows the federal government to send the payments only to eligible American taxpayers with direct-deposit bank addresses on file with the Internal Revenue Service. Eligible recipients who don’t have an address on file or whose address is outdated may have to wait four or more months.","","","Indeed, the bill itself states that funds will be disbursed “electronically to any account which the payee authorized” for tax refunds on or after Jan. 1, 2018.","","","Taxpayers will be notified no more than 15 days after the funds are distributed that they received the payment – via mail.","","","“Such notice shall indicate the method by which such payment was made, the amount of such payment, and a phone number for the appropriate point of contact at the Internal Revenue Service to report any failure to receive such payment,” the bill said.","","","According to the Times, this means roughly 70 million people will actually receive a payment in the coming weeks. The U.S. population is just under 330 million.","","","The digital dollar proposals would prevent banks offering wallets from requiring a minimum balance, as well as provide “reasonable protection against losses caused by fraud or security breaches,” Brown’s bill said.","","","Future progress on the concept could take a while. Senate Majority Leader Mitch McConnell (R-Ky.) has recessed the legislative chamber until April 20, meaning no votes are expected before next month, barring any emergencies.","","","A project of this scale shouldn’t be rushed either, said Warren, who was named Thursday as an adviser to the Digital Dollar Foundation launched by Christopher Giancarlo and Daniel Gorfine, former officials at the Commodities Futures Trading Commission.","","","Warren told CoinDesk she remains skeptical as to the use case for a digital dollar issued by the Fed, but is especially concerned with a potential rush job.","","","“You can’t do it that quickly and be smart about it,” she said, describing an emergency-tinged deployment as “a non-starter.” Paper checks may not be ideal, but “the idea we could suddenly pivot is not realistic.”","","","Read more: Former CFTC Officials Ramp Up Push for Digital Dollar With Accenture Partnership","","","One of Warren’s concerns is that any short-term, privacy-invading tools may remain a permanent fixture.","","","“I don’t think it’s ever temporary, I think it becomes permanent very quickly,” she said.","","","David Treat, a senior managing director at Accenture, told CoinDesk that from a practical viewpoint, there would need to be a massive push to collect the necessary information from individuals to set up a distribution system. ","","","The U.S. has chosen as a society to not make use of national identifiers, meaning individuals would therefore have to register for a bank account should a digital dollar be built. ","","","Accenture is working with the Digital Dollar Foundation to pursue a potential solution for a U.S. central bank digital currency, but Treat noted that this would be more helpful in a future crisis. ","","","“You need to focus on what’s currently available,” he said.","","","Daniel Kuhn contributed reporting.",""],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Warren","content":"PERSON"},{"type":"Digital Dollar With Accenture Partnership","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Senate Committee on Banking, Housing and Urban Affairs","content":"ORGANIZATION"},{"type":"Commodities Futures Trading Commission","content":"ORGANIZATION"},{"type":"Sherrod Brown","content":"PERSON"},{"type":"Daniel Gorfine","content":"PERSON"},{"type":"Jan. 1, 2018","content":"DATE"},{"type":"2018","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"David Treat","content":"PERSON"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"Brown","content":"PERSON"},{"type":"US Senate Floats ‘Digital Dollar’ Bill After House Scrubs Term From Coronavirus Relief Plan","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Senate Banking Committee","content":"ORGANIZATION"},{"type":"Morgan Ricks","content":"PERSON"},{"type":"Vanderbilt Law School","content":"ORGANIZATION"},{"type":"Columbia University fellow Lev Menand and University of California Hastings","content":"ORGANIZATION"},{"type":"John Crawford","content":"PERSON"},{"type":"Accenture","content":"ORGANIZATION"},{"type":"Digital Dollar Foundation","content":"ORGANIZATION"},{"type":"the World Economic Forum","content":"ORGANIZATION"},{"type":"Christopher Giancarlo","content":"PERSON"},{"type":"Sheila Warren","content":"PERSON"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"March 17","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Ohio","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"House","content":"ORGANIZATION"},{"type":"U.S. Congress","content":"ORGANIZATION"},{"type":"Ricks","content":"PERSON"},{"type":"Ky.","content":"LOCATION"},{"type":"Times","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"U.S. Senate","content":"ORGANIZATION"},{"type":"The Fed","content":"ORGANIZATION"},{"type":"Mitch McConnell","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["Digital Dollar","Coronavirus","COVID-19"],"authors":["Nikhilesh De"]}