{"summary":"Saber has raised $7.7 million from Chamath Palihapitiya’s Social Capital, Jump Capital, and others.\nWith fresh capital at hand, Saber wants to scale its team of 3 and support more assets on its platform.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/112608\/solana-stablecoin-exchange-saber-funding-chamath","publishDate":"2021-07-27T08:28:11","id":1522,"type":null,"title":"Solana-based stablecoin exchange Saber raises $7.7M in seed funding","category":["Venture Capital"],"content":["Saber Labs, the development team behind Saber — a Solana-based cross-chain exchange for swapping stablecoins and wrapped tokens — has raised $7.7 million in a seed funding round.","The round was led by Race Capital, with participation from Chamath Palihapitiya's Social Capital, Jump Capital, Multicoin Capital, and the Solana Foundation. Angel investors, including FTX's Tristan Yver, OKcoin's Jason Lau, Curve Finance's Julien Bouteloup, Terraform Labs' Jeff Kuan, and Stacks' Ryan Shea, also participated in the round.","This was an equity funding round, Saber Labs co-founder and CEO Dylan Macalinao told The Block. <span data-preserver-spaces=\"true\" data-v-f87c67ca=\"\">It will help scale Saber's team and support more assets on the platform, he said.<\/span>","Saber Labs is currently a team of three, and Macalinao is looking to hire around seven people by the end of the year, he said. As for platform expansion plans, Macalinao said Saber currently supports assets from the Ethereum, Terra, Solana, and Bitcoin blockchain, and it is looking to support \"every major chain, specifically looking at Polygon and Celo.\"","Launched last month, Saber allows users to swap between stablecoins and wrapped tokens, similar to Ethereum-based Curve exchange. Saber also enables users to deposit assets to provide liquidity and earn yield from transaction fees and liquidity incentives, and thus, also acts as an automated market maker or AMM.","Macalinao said Saber's competitive edge is the number of assets it supports. \"The main competitor to Saber on Solana is <a href=\"https:\/\/www.theblockcrypto.com\/post\/106118\/defi-alliance-solana-mercurial-finance\" data-v-f87c67ca=\"\">Mercurial Finance<\/a>, which only supports four assets compared to Saber's rapidly growing 15+,\" he said. \"Because of this, Saber has been able to attract significantly more liquidity (currently over ~2x more) as it helps bridge communities across the entire blockchain ecosystem.\"","Indeed, Saber has seen significant growth since its launch less than two months ago. Saber is currently the third-largest decentralized application on Solana in terms of total value locked (TVL), according to tracker <a href=\"https:\/\/defillama.com\/chain\/Solana\" data-v-f87c67ca=\"\">DefiLlama<\/a>. Saber's TVL at the time of writing is over $126 million, only behind Raydium and Serum.","Curve, on the other hand, has a TVL of around $8.5 billion, according to <a href=\"https:\/\/defipulse.com\/\" data-v-f87c67ca=\"\">DeFi Pulse<\/a>. Macalinao said the Solana ecosystem is \"so early, we see a clear opportunity to establish Saber as the market leader in stablecoin exchanges, similar to how Curve is so dominant within the Ethereum ecosystem.\"","<a href=\"https:\/\/www.theblockcrypto.com\/post\/107749\/solana-labs-raises-314-million-funding-a16z-polychain-capital\" data-v-f87c67ca=\"\">Solana<\/a> is seen as a competitor to Ethereum and it is faster and cheaper for executing transactions. Macalinao said nodes on Solana need less time to validate transactions, and block times are as low as 400 milliseconds, compared to Ethereum's 15 seconds. As a result, Solana can handle a throughput of more than 50,000 transactions per second (TPS), compared to around 30 TPS on Ethereum, he said."],"hashtag":["SOLANA"]}