{"summary":"Elon Musk's rebranded X.com used to be the white-hot center of the crypto world. What comes next?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/07\/26\/twitter-is-dead-long-live-crypto-twitter\/","publishDate":"2023-07-26T17:32:20","id":15225,"type":null,"title":"Twitter Is Dead. Long Live Crypto Twitter?","category":["Consensus Magazine"],"content":["I spent a few moments this morning exploring my Twitter archive. I’m reflecting on what the social media site has meant for the world of cryptocurrency – and contemplating what the possible end of “Crypto Twitter” means for the future.","It’s time for that reflection because Twitter as we knew it is now officially gone, with the sudden rebrand this week to X.com. That followed months of palpable decline in the site’s vitality, thanks to an extortionate subscription drive meant to replace cratering advertising revenue.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","Now, Elon Musk seems to have lost all interest in the actual social media product, announcing that Twitter would become the core of an ill-defined “everything app.” (Explaining these impulsive moves is beyond my scope here, but there is one compelling thesis I would invite you to contemplate.)","This appears to have been my first tweet about Bitcoin, sent on April 4, 2013.","(For the youths, this was before “retweets” were a hardcoded feature, so you just typed “RT” before copy-pasting someone else’s tweet. I should also say it’s impressive that Twitter’s – sorry, X.com’s – nearly two-decade archive still works as well as it does. We’ll see how long that lasts.)","Scrolling back through these ancient scribblings, I also found a timeline of the evolution of my own thinking about crypto. That was driven by conversations and interactions with people smarter than me, starting with Andreas Antonopoulos.","I connected with Andreas and many other vital thinkers largely via Twitter, and it continues to function as both a better version of LinkedIn and an archival rolodex of practically all the smart people in crypto I’ve ever interacted with. Right at my fingertips, I have a catalog of experts on various topics, whose expertise I’m confident in because I’ve communicated with them for weeks or months before I tap them for help with a story.","My experience is just one small node in a constellation of similarly productive connections made through Twitter, including important debates, but also hiring, strategic alliances and dealmaking. That utility is unlikely to disappear completely, but moves like limiting direct messaging for non-subscribers seem almost certain to reduce it.","The decline of Twitter has had crypto types eyeing alternatives for months. Once enough people head for the exits, we could suddenly find that the real Crypto Twitter is no longer actually on the site formerly known as Twitter.com.","There are about a half-dozen sites attracting refugees from Twitter\/X.com. They all have some appeal, but after months of widespread taste-testing, there are a few clear winners – and some that seemingly aren’t going to make it.","Bitcointalk.org – The most venerable and important discussion board in the cryptocurrency ecosystem has never gone away. Yes, it’s almost exclusively focused on bitcoin (BTC), but it and other old-school forums deserve a revitalization as Twitter drains users. Not only does it feature a historically invaluable archive of the foundational discussions that created today’s crypto world, its solid reputation system helps clarify who’s worth listening to. More generally, the forum format of threaded discussion encourages reasoned and detailed debate rather than engagement-farm shouting.","Nostr – Many bitcoiners seem to be congregating here. Nostr is a true decentralized protocol that uses a familiar (to coiners) public-private keypair system, and a network of relays that doesn’t rely on a central server to distribute content. It has been broadly praised by no less a crypto titan than Jameson Lopp, though it’s not without its shortcomings. This seems like a necessary add for the most serious cypherpunks in crypto.","Bluesky – Bluesky is shaping up as the most attractive Twitter alternative for people who are Smart and Normal. Its user experience is effectively identical to Twitter’s, though with fewer features. It has already attracted a critical mass of the coastal media and policy establishment that first made Twitter great (and who Elon aggressively alienated with his verification changes). This is where I foresee myself spending the most time in a worst-case future (davidzmorris.bsky.social).","Discord – The shift of the crypto world to narrower and less public Discord servers began long before Twitter’s decline, but it seems almost certain to accelerate post-Elon. That tracks what could be a broader shift of internet discussion to more private and exclusive settings, which I see mostly as a net benefit to the formation of strong communities rooted in deep understanding and longer-term relationships.","See also: Blockades and Blockchains: What the Reddit Boycott Has to Do With AI | Opinion","Reddit – Reddit remains an incredible place to talk seriously about almost anything, including crypto. Like Bitcointalk and other forums, its reputation system and format are ideal for nuanced discussion. That said, it’s important to remember that each subreddit has its own mods and agenda, exemplified by the generational feud between r\/Bitcoin and r\/BTC.","Mastodon – “You think you want it, but you actually don’t,” encapsulated as a social media network. Mastodon’s “federated” model embodies some ideas that crypto types should love. But reports from users have generally found the experience clunky, and while it’s interesting, the federated server model seems a bit too isolating, limiting the potential for networking.","Threads – While Mastodon may be too technically wonky for many, Threads seems flawed in the other direction: too accessible, and too limited. Perhaps above all, the requirement of associating a Threads account with an Instagram account makes pseudonymity more difficult, a huge negative for crypto users. By many accounts, the quality of Threads content is also very low, and seems likely to stay that way for structural reasons.","However, Threads does offer one silver lining – it could be a very appealing home for influencers, bots and scams, which rely on a huge pool of susceptible targets. That could mean that they get separated from more robust and grounded crypto discourse, which would be a good thing.","The variety of attractive options for Twitter emigres strongly suggests that there will be no single, easy replacement for Twitter. The features and infrastructure of services like Bluesky and Nostr matter when you’re forced to choose a new social platform. But no feature can compete with the multitude of connections built up over many years, the follows and followers known as your “social graph.”","That may be enough to keep a critical mass of Crypto Twitter active on the new X.com. Elon has certainly managed to degrade the experience and alienate users, but it might remain just slightly better than any of the alternatives, simply because most people are already there, and will stay. I am personally still most active on the former Bird App.","This also drives home a larger point, one that should be no surprise to crypto adherents: this kind of public infrastructure should not be so easily co-opted and dismantled by one very rich guy. If there’s one huge upside to the fall of Twitter, it may be that the general public starts thinking more seriously about data portability and other issues that we’ve been shouting about for a solid decade."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Bird App","content":"ORGANIZATION"},{"type":"Andreas Antonopoulos","content":"PERSON"},{"type":"April 4, 2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Elon Musk","content":"ORGANIZATION"},{"type":"Andreas","content":"PERSON"},{"type":"Jameson Lopp","content":"PERSON"},{"type":"Smart and Normal","content":"ORGANIZATION"},{"type":"X.com","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Twitter.com","content":"LOCATION"},{"type":"fall of Twitter","content":"DATE"}],"hashtag":["Opinion","Twitter","Elon Musk","Social Media","Crypto Twitter"],"authors":["David Z. Morris"]}