{"summary":"The speed of the bank runs against FTX, Celsius, Voyager, BlockFi and Genesis was historic because customers were able to withdraw their funds instantly.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/231022\/ftx-celsius-voyager-blockfi-genesis-collapse-fed-report-charts","publishDate":"2023-05-16T12:05:47","id":1522,"type":null,"title":"FTX collapse: How 4.3 million crypto investors lost $46 billion in 5 months","category":["EXCHANGES"],"content":["The five major crypto firms that collapsed last year — FTX, Celsius, Voyager, BlockFi and Genesis — did so because they offered customers instant withdrawals while their assets were locked inside illiquid, risky investments in an attempt to generate unsustainable yields. And because customers were able to withdraw their funds instantly, often via their phones, the speed of the runs was historic, according to <a href=\"https:\/\/www.chicagofed.org\/publications\/chicago-fed-letter\/2023\/479\" data-v-f87c67ca=\"\">a study by Radhika Patel and Jonathan Rose of the Federal Reserve Bank of Chicago<\/a>.","“It’s not as if customers had lined up in person, as in the classic movie 'It’s a Wonderful Life,'” their report says. Or indeed, as in <a href=\"https:\/\/www.bbc.co.uk\/news\/business-41229513\" data-v-f87c67ca=\"\">the collapse of Northern Rock in the UK in 2008<\/a>, when customers also lined the streets to pull out their cash.","The report depicts the collapses graphically, giving readers a better idea of the scale and speed at which $46.5 billion in value was caught up in bankruptcy proceedings – much of which to never been seen again.&nbsp;","They were being offered interest yields typically of 7.4% to 9%, but sometimes as much as 17% — all unrealistic in a low interest-rate environment.","<span data-v-f87c67ca=\"\">Images from \"A Retrospective on the Crypto Runs of 2022.\" Source: Chicago Fed.&nbsp;<\/span>","Both Celsius and <a href=\"https:\/\/www.theblock.co\/post\/155990\/crypto-broker-voyager-digital-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">Voyager<\/a> were hit by two bank runs. The second runs were smaller but by that time their balance sheets were so fragile they collapsed.","FTX’s $7.8 billion run dwarfed all the others. But in each case, the percentage of outflows was less than 40% of liabilities before the run.","","","This timeline shows FTX on a separate graph because the scale of the withdrawals is so much larger than the others. FTX reported outflows of 37% of customer funds, almost all of which were withdrawn in just two days.","Voyager and Celsius both succumbed to the collapse of stablecoin TerraUSD and the implosion of hedge fund Three Arrows Capital (3AC). They had loaned money to 3AC but not collateralized the loans, the Chicago Fed said.","BlockFi and Genesis were <a href=\"https:\/\/www.theblock.co\/post\/185083\/ftx-files-for-chapter-11-bankruptcy\" data-v-f87c67ca=\"\">done in by FTX<\/a>.","","","The Chicago Fed says large institutional investors were fastest to pull their money from failing exchanges, leaving smaller players holding the bag.&nbsp;","“While the platforms had many retail clients, the runs were spearheaded by customers with large holdings, some of which were sophisticated institutional customers… The owners of large-sized accounts, with over $500,000 in investments, were the fastest to withdraw and withdrew proportionately more of their funding. In fact, during this run, 35% of all withdrawals at Celsius were by owners of accounts with more than $1 million in investments, according to our estimates,” the report says.","","","Disclaimer: The former CEO and majority shareholder of The Block has disclosed a series of loans from former FTX and Alameda founder Sam Bankman-Fried.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"Chicago Fed","content":"ORGANIZATION"},{"type":"Northern Rock","content":"ORGANIZATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"7.4%","content":"PERCENT"},{"type":"Radhika Patel","content":"PERSON"},{"type":"2008","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"$500,000","content":"MONEY"},{"type":"Jonathan Rose","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"Alameda","content":"LOCATION"},{"type":"UK","content":"ORGANIZATION"},{"type":"$1 million","content":"MONEY"},{"type":"$46.5 billion","content":"MONEY"},{"type":"35%","content":"PERCENT"},{"type":"Sam Bankman","content":"PERSON"},{"type":"37%","content":"PERCENT"},{"type":"$7.8 billion","content":"MONEY"},{"type":"Federal Reserve Bank of Chicago","content":"ORGANIZATION"}],"hashtag":["CRYPTO BANKS AND LENDERS","FEDERAL RESERVE","FTX"],"authors":["Jim Edwards","The Block"]}