{"summary":"It’s high time for the crypto industry to start thinking about the next phase of adoption, the end user and the signals it is sending, esteemed artist and designer Aapo Nikkanen writes for Crypto 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/12\/19\/web3-needs-to-develop-an-obsession-with-brand-image\/","publishDate":"2023-12-19T16:46:23","id":15231,"type":null,"title":"Web3 Needs to Develop an Obsession With Brand Image","category":["Consensus Magazine"],"content":["The infrastructure of our everyday lives is about to change permanently.","The combination of Web3, crypto and AI will produce services that can offer much more approachable entry points to the general public than a dog-shaped token ever can. However, this means companies will need to learn a new language to communicate to the massive new segment of users that comes with it.","This post is part of CoinDesk's \"Crypto 2024\" predictions package. Aapo Nikkanen is an artist, creative director, writer and researcher.","Suddenly, nouveau tech will reach beyond the speculators, the bros, the “in-it-for-the-techs,” the lurkers, and the recesses of Crypto Twitter. Instead, the most fought-over customers will be the regular, Average Joes or Janes everywhere.","If you ask me, the crypto industry is largely ill-prepared for the ordinary consumer. They will pick one service, and go on with their days. This is exactly how Sixt became a preeminant car rental service outside the U.S., even when better and cheaper options are available from a less-known competitor. This is the consumer crypto is fighting for. That’s him, that’s her, that’s them.","Ordinary users won’t be bothered to scroll for alternatives. They know Sixt's orange logo and perceive the value embellished in it, even if Google reviews would scream otherwise.","The spearhead of crypto mass adoption will not be a spot bitcoin ETF, or a Crypto.com credit card. It will be a Web3 service that can offer the average boomer a service that they need and understand. But they need to understand why they need it. Only then will we see the gradual unlocking towards the mass use of wallets, crypto payment systems, distributed IDs (DIDs), and the rest of it.","There is a baseline of technological progress over time, yet the survival of any product will be increasingly dependent on how well the communication around it manages to reach different audiences. Competition will have a new front, one that includes design, branding and communication, and very soon microwaving a copypasta of the latest meme coin mcap leader will not cut it.","In my view, the winning strategies will embrace two aspects. First, a project needs to stand out from the masses of similar services. Second, a project needs to produce messages that are understood – and accepted by – both the tech-savvy and virgin users.","See also: Crypto Is a Luxury Good | Opinion (2022)","In other words, you need to have a unique visual identity, and you need to communicate your selling point in plain English, no matter how technologically advanced it is. If a regular, sensible person won’t get it, you’re not doing it right.","Take this as your golden rule: if you can't explain it simply, you don't understand it well enough.","Unfortunately, saying things simply can be hard. It requires being able to recognize the essential parts and mould them in the right shapes and forms. That’s why it’s so hard to write a three-chord hit song. One needs to find the delicate balance between the aesthetics and the message. When done right, simplifying can bridge the gap between the never-seen-before and the everyday, but it calls for a certain type of creativity.","All technological revolutions have also always been cultural revolutions. The tech alone isn’t enough: it’s the means, not the ends. Gutenberg’s printing press didn’t change the world, but it made the change possible. Steve Jobs attributed the success of Macintosh to the fact “that the people working on it were musicians, and poets, and artists, and zoologists, and historians, who also happened to be the best computer scientists in the world.” Nokia hired early on a philosopher to challenge their different teams, and a techno producer to compose ringtones. Oh, and there was that thing called the Renaissance a few centuries back.","New technologies, to get ready for what’s to come, might profit from learning from that place where image reigns above all: the fashion industry. If there’s one area of business that has capitalized on image more than any other in history, it is the luxury market.","While the world of fashion and luxury might feel like the polar opposite of tech (regardless of Richard Heart's affinity for the extraordinarily gaudy), it is probably the most refined marketing machine out of all the consumer industries. There is a lot to learn from it.","In their unsatisfiable thirst for the new, the fashion and luxury industry is always hungry to hire photographers, artists and creative directors to produce images, concepts and experiences to lure in new customers.","In that world, the amount of attention and resources put into image production and branding can reach ridiculous proportions. I should know, I’ve been submerged in it for the good part of the last 10 years. I recently talked shop with a friend of mine who works in one of the high-end fashion houses, and they told me that their company paid a $70,000 per day consultancy fee for a stylist for a photoshoot (for those who don’t know, a stylist is the person who selects the combination of clothes that the models are wearing in the campaign photos).","Although I’m not proposing to try to cut and paste the luxury industry’s practices to tech, this reveals the level of exigence some companies are willing to put into producing just one single image. In the world of fashion and luxury, the competition is savage. These companies are dealing with a racing market that produces endless collections, campaigns and promotional events per year.","Add to this the unusually high price points and fierce competition for a relatively small and fickle clientele, and you have the blueprint for an extremely saturated market. Luxury is hard to break into, and even if you get in, you’ll have to constantly fight to keep that spot.","However, for those who have mastered the game, the returns have been incredible. For example, the Arnault family's [owners of LVMH, the world's largest fashion conglomerate] net worth is estimated to be $238.5 billion as of March 2023. As it turns out, putting $9.5 billion in marketing per year can make normies believe that a handbag made out of plastic-covered cotton is a luxury good.","See also: Crypto Is a Luxury, Gucci Just Hasn't Realized It | Opinion (2021)","I believe that it’s high time for the Web3 companies to start to develop a similar obsession for their brand images. The “in-it-for-tech” narrative simply won’t cut it in the next phase of adoption. If we zoom out, it’s easy to notice how many areas of the market are already saturated, how the clientele is still relatively small, and how the competition is only bound to get more and more fierce.","How many L1s, L2s, cloned DEXes and CEXes, NFT marketplaces, wallets and yield farming play-to-earn meme tokens do you think we’ll need after the bull run? My bet is, not so many.","And the ones that can stand out early on will corner the market. They will become the next Apple’s and Google’s of their market niches. The bubble of first adopters is about to burst, and it might be a good idea to allocate some of that upcoming airdrop to somewhere else."],"entity":[{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Nokia","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"LVMH","content":"ORGANIZATION"},{"type":"Janes","content":"PERSON"},{"type":"Aapo Nikkanen","content":"PERSON"},{"type":"March 2023","content":"DATE"},{"type":"last 10 years","content":"DATE"},{"type":"$238.5 billion","content":"MONEY"},{"type":"Arnault","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"$70,000","content":"MONEY"},{"type":"Apple","content":"ORGANIZATION"},{"type":"Richard Heart","content":"ORGANIZATION"},{"type":"Sixt","content":"ORGANIZATION"},{"type":"the U.S.","content":"LOCATION"},{"type":"$9.5 billion","content":"MONEY"},{"type":"Gucci","content":"ORGANIZATION"}],"hashtag":["Opinion","Art","Luxury","Fashion","Web3","Culture","Crypto 2024","Branding"],"authors":["Aapo Nikkanen"]}