{"summary":"Cathie Wood's investment firm also sold GBTC stock while increasing its holdings of Block.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/12\/21\/ark-invest-coinbase-share-sale-takes-december-total-close-to-200m\/","publishDate":"2023-12-21T12:21:18","id":15234,"type":null,"title":"ARK Invest Coinbase Share Sale Takes December Total Close to $200M","category":["Markets"],"content":["Cathie Wood’s investment firm, ARK Invest, extended its sales of Coinbase (COIN) stock on Wednesday, taking the December total to $196.8 million as the shares rallied almost 30% since end-November.","The ARK Innovation exchange-traded fund (ARKK) sold 132,782 shares, and the ARK Next Generation Internet ETF (ARKW) jettisoned 16,998, a total worth $24 million at Wednesday’s closing price.","The firm often reduces its Coinbase holdings as the shares rise because it has a policy of keeping exposure to individual companies to a maximum of around 10% of its holdings. COIN remains above that level in both ARKK and ARKW.","ARKW also dumped more stock of the Grayscale Bitcoin Trust (GBTC), reducing its holding by 398,383 while loading up another 158,334 shares of Block (SQ), which offers payments in crypto through its Cash App and earlier this month unveiled a new self-custody bitcoin wallet.","While GBTC’s discount to net asset value widened slightly, just 0.33 percentage points, Wednesday to 7.9%, it's still well below the 12.5% it touched earlier this month and holding near the narrowest since August 2021, according to Ycharts data. Bitcoin, meantime, rallied 3.3%, crossing $44,000 for the first time in 10 days yesterday, CoinDesk Indices data show.","Edited by Parikshit Mishra."],"entity":[{"type":"August 2021","content":"DATE"},{"type":"10%","content":"PERCENT"},{"type":"0.33 percentage points","content":"PERCENT"},{"type":"3.3%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"12.5%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"ARK Invest","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"$44,000","content":"MONEY"},{"type":"$196.8 million","content":"MONEY"},{"type":"$24 million","content":"MONEY"},{"type":"7.9%","content":"PERCENT"}],"hashtag":["Cathie Wood","ARK Invest","Coinbase","Block","Grayscale Bitcoin Trust"],"authors":["Sheldon Reback"]}