{"summary":"\"This shows that MAS is listening, and is willing to consider industry feedback, even if they do not always agree,\" said Angela Ang, a senior policy adviser for blockchain intelligence firm TRM Labs and a former MAS regulator.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/23\/singapore-central-bank-rules-to-discourage-crypto-speculation-ease-investment-qualifications\/","publishDate":"2023-11-23T15:07:21","id":15241,"type":null,"title":"Singapore Central Bank Rules to Discourage Crypto Speculation, Ease Investment Qualifications","category":["Policy"],"content":["The Monetary Authority of Singapore (MAS) has released the second, final tranche of its responses to feedback on a consultation paper of proposed regulations for crypto service providers.","The central bank kept the requirement for crypto entities to discourage cryptocurrency speculation by retail customers by not offering financing, margin transactions or any incentives to trade, it said Thursday. The MAS also wants crypto entities to not accept locally issued credit card payments and to determine a customer's risk awareness before allowing access to the services.","Singapore has been chasing a regulatory balance for crypto while trying to lure the industry. The announcement is part two of responses to feedback received on its proposed regulations for digital payment token (DPT) service providers in Singapore. The first instalment, from July, required providers to deposit customer assets under a statutory trust before year-end for safekeeping.","\"MAS has been very consistent about its stance against speculative retail trading, so it is unsurprising that they are largely moving ahead with their proposals,\" said Angela Ang, a senior policy adviser for blockchain intelligence firm TRM Labs and a former MAS regulator. \"That said, they've landed on slightly less restrictive measures in areas such as the inclusion of cryptocurrencies in determining customers' net worth. This shows that MAS is listening, and is willing to consider industry feedback, even if they do not always agree.\"","Among the less restrictive measures, MAS has eased the limits on qualifying as an accredited investor, clarifying that some crypto assets can be counted toward the S$2 million ($1.5 million) needed.","It also appears to have allowed exchanges to come up with their own criteria for listing tokens as long as they disclose conflicts of interest, publish criteria that govern the listing and establish procedures to resolve customer disputes. Hong Kong's approach is more prescriptive, Ang said, allowing only tokens that satisfy the regulator's criteria.","The MAS also has high availability and risk-incidents reporting stipulations. These are in line with current requirements imposed on other systemically important financial institutions, but not payment service providers, making this a special provision for crypto.","The rules will take effect in phases from mid-2024 to provide an \"adequate transitional period\" for their implementation.","The rules are aimed at limiting potential consumer harm, MAS said.","\"While these business conduct and consumer access measures can help meet this objective, they cannot insulate customers from losses associated with the inherently speculative and highly risky nature of cryptocurrency trading,\" said Ho Hern Shin, deputy managing director for financial supervision.","Read More: 'Cryptocurrencies Have Failed the Test of Digital Money,' MAS' Managing Director Says","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Digital Money","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"DPT","content":"ORGANIZATION"},{"type":"TRM Labs","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"Monetary Authority of Singapore (MAS","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"S$2 million ($1.5 million","content":"MONEY"},{"type":"Angela Ang","content":"PERSON"},{"type":"Ho Hern Shin","content":"PERSON"},{"type":"Singapore","content":"LOCATION"},{"type":"MAS","content":"ORGANIZATION"},{"type":"Ang","content":"PERSON"},{"type":"Hong Kong","content":"LOCATION"}],"hashtag":["Regulations","Singapore","MAS","Rules","Crypto","Tokens"],"authors":["Amitoj Singh"]}