{"summary":"The platform lets users start their own networks on Bitcoin and is offering developers millions of dollars as grant rewards.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/15\/bitcoin-layer-2-project-bvm-gains-traction-with-promise-of-juicy-airdrops\/","publishDate":"2024-03-15T08:41:54","id":15242,"type":null,"title":"Bitcoin Layer-2 Project BVM Gains Traction With Promise of 'Juicy' Airdrops","category":["Markets"],"content":["Bitcoin Virtual Machine, a protocol founded late February, is gaining traction among traders betting on the general growth of the Bitcoin ecosystem, driving demand for its BVM tokens.","Data shows that the project’s BVM tokens have added 35% in the past 24 hours, beating a general market decline. The CoinDesk 20 Index fell 5.3% in the same period. The tokens have surged to $3.5 from an intitial of 20 cents on March 8.","The project lets users spin up their own layer-2 networks on the Bitcoin blockchain. Bitcoin and Ethereum are known as layer-1 protocols, and attempts to scale and expand them are layer 2s. While the Ethereum ecosystem has had multiple layer 2 projects aimed at providing faster, cheaper transactions for years, the Bitcoin version really kicked off only in 2023 following the introduction of Ordinals technology.","The value propositions for the token are driven by staking rewards for BVM holders and a cut of fees generated by the service, developer @punk3700 told CoinDesk in a direct message interview on X.","“We have 40%-50% circulating staked by our holders. Working on a few airdrop deals for BVM stakers,” @punk3700 said. “Some of them could be quite juicy.”","On Friday, the team said Naka Chain, a Bitcoin layer-2 build on BVM, will airdrop 10.5 million tokens to BVM token stakers. The airdrop is proportional to a user’s staked holdings and will be locked for three months.","Tokens based on the Bitcoin blockchain first started to emerge as an investment thesis in mid-2023, led by Ordinals technology and BRC-20 tokens.","The BRC-20 standard (BRC stands for Bitcoin Request for Comment) was introduced in April and allowed users to issue transferable tokens directly through the network for the first time. The tokens, called inscriptions, function on the Ordinals Protocol. That protocol allows users to embed data into the Bitcoin blockchain by inscribing references to digital art into small bitcoin-based transactions.","@punk3700 previously told CoinDesk that bitcoin’s usage in decentralized finance (DeFi) applications has so far been limited to tokenized representations of bitcoin on other chains, such as Ethereum or Solana, but that there’s a gap for wealthy bitcoin holders to use their assets on native applications, fueling the investment thesis.","The BRC-20 tokens have a cumulative $3.5 billion market capitalization as of Friday, CoinGecko data shows.","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"$3.5","content":"MONEY"},{"type":"Naka Chain","content":"ORGANIZATION"},{"type":"Bitcoin Virtual Machine","content":"ORGANIZATION"},{"type":"5.3%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"February","content":"DATE"},{"type":"20 cents","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"20","content":"DATE"},{"type":"Bitcoin Request for Comment","content":"ORGANIZATION"},{"type":"40%","content":"PERCENT"},{"type":"BVM","content":"ORGANIZATION"},{"type":"35%","content":"PERCENT"},{"type":"BRC","content":"ORGANIZATION"},{"type":"March 8","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"$3.5 billion","content":"MONEY"}],"hashtag":["Bitcoin","Trading","Airdrops"],"authors":["Shaurya Malwa"]}