{"summary":"Bitcoin ETF manager Grayscale is seeking permission from the SEC to spin out a percentage of GBTC shares to seed the new Bitcoin Mini Trust product, according to a filing on Tuesday.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/03\/12\/grayscale-plans-low-fee-gbtc-spinoff-the-bitcoin-mini-trust\/","publishDate":"2024-03-12T12:30:00","id":15249,"type":null,"title":"Grayscale Plans Low-Fee GBTC Spinoff: the Bitcoin Mini Trust","category":["Finance"],"content":["Grayscale, manager of the $28 billion GBTC spot bitcoin exchange-traded fund (ETF), plans to introduce a low-fee version of the ETF and is seeking permission from the U.S. Securities and Exchange Commission (SEC) to spin out a percentage of GBTC shares to seed the new product, according to a filing on Tuesday.","If the product, the Grayscale Bitcoin Mini Trust, is approved, existing GBTC investors would benefit from lower total blended fees, while not being expected to pay capital-gains tax to automatically transfer into the new fund. Realization of capital gains is one of the reasons GBTC shareholders have been tied to the existing product, with its high fees relative to rival offerings.","The fees, which are not being disclosed at this time, will be competitive with some of the low-cost bitcoin ETFs in the market, a person close to Grayscale told CoinDesk.","Since the approval of a clutch of spot bitcoin ETFs back in January, Grayscale’s giant GBTC, which became an ETF from its legacy position as a closed-end bitcoin fund, has stood out from the pack with its relatively high 1.5% fees. That compares with 0.19% for the Franklin Bitcoin ETF (EZBC) and 0.2% for Bitwise Bitcoin ETF (BITB).","Offering a flagship fund and a mini version is not uncommon in the ETF industry. The difference in the case of Grayscale's BTC proposal is the way the fund is being created by way of a corporate spinoff, so taking a portion of GBTC that would automatically move over to BTC, the person said.","Despite experiencing outflows from GBTC of over $10 billion since approval in January, the main fund has retained its original asset value thanks to a bull-market subsidy from rallying crypto markets. That said, fees are likely going to be a deciding factor for the army of registered investment advisors (RIAs) and broker networks poised to recommend bitcoin ETF products to clients, so offering a cheaper Grayscale alternative makes sense.","The Grayscale Bitcoin Mini Trust aims to trade under the BTC ticker on NYSE Arca.","Edited by Sheldon Reback."],"entity":[{"type":"GBTC","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"Franklin Bitcoin","content":"PERSON"},{"type":"Bitwise Bitcoin ETF","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"$10 billion","content":"MONEY"},{"type":"0.2%","content":"PERCENT"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$28 billion","content":"MONEY"},{"type":"Grayscale Bitcoin Mini Trust","content":"ORGANIZATION"},{"type":"0.19%","content":"PERCENT"},{"type":"NYSE Arca","content":"ORGANIZATION"}],"hashtag":["Grayscale","Bitcoin ETF","exchange-traded funds","US"],"authors":["Ian Allison"]}