{"summary":"Non-fungible token (NTF) marketplaces allow digital collectors to buy, sell and create their own tokens that represent ownership of unique, tangible and intangible items.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2021\/07\/12\/nft-marketplaces-a-beginners-guide\/","publishDate":"2021-08-07T18:52:00","id":15253,"type":null,"title":"NFT Marketplaces: A Beginner’s Guide","category":["Learn"],"content":["Do you keep hearing about people buying digital cats, NBA moments and profile pics of cartoon apes, but have no idea where they’re getting these Non-fungible tokens (NFTs) from? Don’t worry, we’ve got you covered.","NFTs are unique tokens that represent ownership of something inherently distinct and scarce, whether it be a physical or digital item, such as artwork, a soundtrack, a collectible, an in-game item or real estate. Unlike regular cryptocurrencies like bitcoin or fiat money like the U.S dollar, these special types of digital assets cannot be mutually exchanged for one another because each token has a specific value based on its unique traits and attributes.","To get started, you'll have to familiarize yourself with the specialized marketplaces where NFTs are generally listed and traded, which differ from what you may be used to with crypto exchanges.","NFT marketplaces are platforms where NFTs can be stored, displayed, traded and in some cases minted (created). These marketplaces are to NFTs what Amazon or eBay are to goods.","In order to access and use these types of marketplaces, you will want to set up the following:","It’s worth noting that, for the most part, listing and creating NFTs on a marketplace platform incurs a blockchain network fee. The fee varies depending on which blockchain-based system you decide to use. For example, Ethereum boasts the largest ecosystem of NFT dapps (decentralized applications). But it has the most expensive fees.","Ethereum is by far the most popular system for buying, selling and creating unique, digital items. There is, however, a growing list of competitors that have also entered the market, including the following:","Some of these blockchain systems are interoperable. For example, you can buy Ethereum-based non-fungible tokens with Ethereum-based tokens (called ERC-20 tokens, which include USDT, USDC, BNB, DAI, etc).","Signing up to an NFT marketplace can differ slightly from site to site, but the main steps to follow involve creating an account or connecting a supported digital wallet, or doing both. The button for this is typically located in the top right-hand corner of the NFT marketplace homepage. When connecting your wallet, you will be asked to enter your wallet password to complete the process.","NFTs are usually purchased directly for a fixed price or through an auction. In some cases, prospective buyers can submit offers to the owner and attempt to negotiate a better price.","Selling unique digital assets can be a more technically complicated process than buying them, particularly if the user is attempting to sell something they have created themselves (artwork, a soundtrack, a tweet, etc.).","If you want to create an NFT, you may consider starting with Ethereum, because it’s the largest system for these types of assets. You will need to have an Ethereum wallet that supports ERC-721 (Ethereum’s token standard for NFTs), such as MetaMask, Trust Wallet or Coinbase Wallet. Also, you will have to top up your wallet with about $50-$100 worth of ether to cover transaction fees (depending on how congested the network is).","Once you have completed those steps, you will be able to access and use platforms such as OpenSea or Rarible. Most platforms have a “Create” button in the top right corner that will take you to the page where you can begin minting your NFTs.","Read more: Minting Your First NFT: A Beginner’s Guide to Creating NFTs","While there are many types of marketplaces, universal and art-oriented platforms are the most popular ones. There are also niche NFT marketplaces that list specific kinds of non-fungible assets such as in-game items, digital collectible cards and virtual real estate.","Here are some popular universal and digital art-oriented NFT marketplaces currently available:","\n","For niche digital items like virtual world avatars or digital fantasy football cards, while there is an ever-increasing number of platforms emerging in this corner of the market, there are five main platforms where a majority of NFT sales are made:"],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"NBA","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"$50","content":"MONEY"},{"type":"Amazon","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Minting Your First NFT","content":"ORGANIZATION"},{"type":"$100","content":"MONEY"},{"type":"20","content":"DATE"}],"hashtag":["Learn","NFTs","Beginner"],"authors":["Anatol Antonovici"]}