{"summary":"Mayor Eric Adams wants to make New York City the biggest crypto hub in America, but there are a host of obstacles in his way.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/05\/10\/can-you-really-build-a-crypto-empire-in-the-empire-state\/","publishDate":"2022-05-10T17:46:16","id":15254,"type":null,"title":"Can You Really Build a ‘Crypto Empire’ in the Empire State?","category":["Policy"],"content":["Every Monday night in Midtown Manhattan, members of New York City’s cryptocurrency scene meet up and talk shop over cocktails in an upscale food hall. Industry veterans mingle with newbies; business cards are exchanged, and new connections are made.","They’ve all come together for CryptoMondays, a long-running networking event for New York’s crypto enthusiasts. The Meetup group-turned-decentralized autonomous organization (DAO) started in New York in 2018 and has since expanded to 70 cities around the world, but the New York chapter remains the largest and most active.","CryptoMondays has been so successful that Imani Jones, the DAO’s director of events, decided it needed an expansion: In February, she organized a party at the New York Blockchain Center, complete with crypto-accepting vendors, an NFT exhibition and a band. She imagined it would be the “culmination of fashion, art, music and tech.”","“If you want to whet your appetite and find out what crypto is about, it’s perfect,” Jones said of the party, which she hopes will be the first in a monthly series. “It’s a space where you can ask basic questions.”","Jones, a Brooklyn local who got into crypto after deciding to start accepting crypto payments for her small business, is hopeful that New York City Mayor Eric Adams can make good on his plans to make the city the “center of the cryptocurrency industry.”","“I’m enthusiastic about Adams accepting his first three paychecks in bitcoin,” Jones said. “I think it shows he’s serious about making New York one of the hubs of crypto innovation.”","Adams’ promise to get paid in bitcoin (BTC) was one of many attempts to court the city’s crypto industry throughout his run for office, including hobnobbing with crypto elites at a fundraiser thrown by Galaxy Digital’s Mike Novogratz.","But there’s a problem: New York has a laundry list of inherently unattractive qualities that have discouraged many in the crypto industry from setting up shop in the Empire State.","High taxes and a high cost of living put off companies that could theoretically work from anywhere. And, most significantly, a crushing and opaque regulatory regime crowned by the notoriously difficult-to-obtain BitLicense, a special license required to do business as a crypto company in New York.","The worst part? There’s pretty much nothing Adams can do to fix the situation because most of the hurdles are the result of state laws that, as mayor, he has no control over.","All Adams can really do to sweeten the pot is maintain friendly relationships with the industry and hope the perks of being in the Big Apple will do the rest. New York is the largest and wealthiest city in the United States and the financial capital of the world. It’s also an increasingly popular hub for tech companies ranging from small startups to titans like Apple (AAPL) and Google (GOOGL), making it a rich hunting ground for educated employees and deep-pocketed customers.","For a growing number of industry players, those perks make New York’s hoops worth jumping through.","They also explain why, despite seemingly doing everything in its power to scare the crypto industry off, New York has emerged as the implausible capital of crypto in the United States.","The cryptocurrency industry is global but has established a U.S. stronghold in New York – even despite the state’s regulatory challenges. Beyond sitting at the intersection of the technology and finance industries, New York provides a rich and deep pool of both qualified talent and wealthy potential customers.","Major players in the crypto space like NFT marketplace OpenSea, blockchain research firm Chainalysis, Ethereum-based tech company ConsenSys, and exchanges like Gemini have gotten their start in New York and maintained their headquarters in the city.","New York-based crypto startups (of which there are over 80) raised $6.5 billion last year, accounting for nearly half of all investments that poured into American crypto companies in 2021 and approximately 12% of all tech investments in New York City.","In the final quarter of 2021 alone, New York crypto companies including NYDIG and Fireblocks, which provides crypto custody services to institutional investors, raised a collective $3.2 billion – the largest quarter for crypto investments on the books.","Investors like Fred Wilson – the city’s leading venture capitalist who has made numerous bets on crypto – of Union Square Ventures also call NYC home. And, outside of the city, crypto companies like Digital Currency Group (the parent company of CoinDesk) and Celsius have offices in nearby Connecticut and New Jersey, respectively. DCG maintained its headquarters in New York until late 2021.","“New York City has been a pinnacle in the crypto industry,” said Michael Shaulov, CEO of Fireblocks, one of New York’s growing number of crypto “unicorns” (startups with a valuation above $1 billion).","“Being in NYC lends well to not only an unbeatable pool of talent, but the world’s biggest financial institutions. It has been very advantageous for our network of customers,” Shaulov added.","But crypto startups don’t need to be worth $1 billion to take advantage of the city’s benefits. Scrappy startups and would-be entrepreneurs have also found that the chance for success makes New York worth the trouble.","One of those is Jake Heid, who moved to New York from Philadelphia five years ago for college. Heid and his business partner, Ahmet Oz, met in the dormitories of Baruch College and decided to start a crypto company together – an NFT marketplace specifically for memes – inspired by what Heid described as the “hustler culture” of Baruch.","According to Heid, Baruch has been an incubator of sorts for the city’s crypto industry. He said his classmates have gone on to work for investment banks and start their own crypto projects, and many of Heid’s professors – including Lawrence Zicklin, for whom Baruch’s business school is named – have embraced crypto and made it a focal point of business classes.","“Almost all of them, even if they don’t understand it, think blockchain is the future,” Heid said.","Heid hasn’t been put off by the challenges of starting a crypto company in New York.","“I know it’s hard, but I want to make it work. I love New York,” Heid said. “There are a lot of justifiable complaints about regulation and taxes in New York, but I’m willing to pay more to live here. I think it’s worth it.”","Longtime crypto investor and founder of CryptoMondays Lou Kerner sees things differently. After living in New York for years, Kerner moved out of his New York apartment in June 2020 and has been living a lifestyle he described as “nomadic” ever since, though he says he still spends roughly half of his time in the city.","“New York is the financial center of the U.S. and arguably of the world,” Kerner said. “So it's not surprising even given the horrific regulatory framework in New York that it's a thriving ecosystem.”","But, when push comes to shove, Kerner said many would-be founders who may have gotten their start in New York, decide to leave the city to actually start their companies.","“This is the center of everything, of course people want to move here. But as they start focusing more on actually starting a business, they realize it’s a horrific place to be,” Kerner said.","Heid, however, doesn’t see himself becoming one of those leaving New York for Puerto Rico or Miami.","“A lot of companies don’t have loyalty to the city that built them,” Heid said. “That’s kind of disappointing, I think.”","To do business in New York, crypto companies must obtain a BitLicense – a business license for virtual currency activities distributed by the New York Department of Financial Services (DFS), the same regulator that oversees New York’s banks.","The BitLicense is a golden ticket to operate in New York, but getting one is difficult, expensive and rare. Just 22 crypto companies currently hold a BitLicense. Only one new BitLicenses was issued in 2021, and only three have been issued in 2022 so far.","DFS's slow regulatory approval is a byproduct of the careful review process, according to a spokeswoman for the agency.","\"DFS's first-in-the-nation virtual currency regulation is designed to protect consumers; preserve safety and soundness of companies; ensure cybersecurity compliance; and root out financial crimes like money laundering and terrorist financing,\" a DFS spokeswoman told CoinDesk.","\"The Department is committed to keeping New York at the center of technological innovation and forward-looking regulation by hiring more experts to our virtual currency unit; streamline the BitLicense application process without sacrificing regulatory rigor; strengthening our supervision; and increasing our engagement with all stakeholders to ensure appropriate regulation and supervision in this fast evolving space,\" she added.","According to NYC-based attorney Max Dilendorf, whose practice helps wallets, exchanges and decentralized protocols enter U.S. markets, the BitLicense has made New York the most difficult state in the country in which to do business as a crypto company.","Dilendorf told CoinDesk the process of obtaining a BitLicense takes close to three years on average – something he and his clients find frustrating. The prospect of long wait times and mounting legal fees are enough to keep many crypto companies out of New York but, even for companies willing to pay up and be patient, additional requirements can make getting a BitLicense impossible for some.","“They need to have a compliance officer who has 15 years of experience,” Dilendorf said. “When a company runs a [money transmitting] operation in the States, they need to have two compliance officers, with one dedicated to the New York office. And it’s really hard to find people that have this much experience.” (Note: After the publication of this article, a spokeswoman for NYDFS told CoinDesk there is no mandated experience requirement for a compliance officer.)","“The whole thing is – I don’t want to say that it’s a joke, but it’s a joke,” Dilendorf added.","David Yermack, chair of NYU Stern School of Business’ finance department, has been teaching crypto since 2014. After learning about bitcoin in 2011, Yermack has watched the crypto industry ebb and flow in New York for the past decade.","“Some of the earliest [crypto] ventures like Charlie Shrem’s BitInstant were in New York,” Yermack said, referencing an early bitcoin exchange that operated between 2011 and 2014. “But what you then saw was a very counterproductive over-regulation of the industry.”","“The infamous BitLicense was one of the least successful regulatory things I’ve ever seen. It just grossly overreached,” Yermack added. “It’s a crushing piece of regulation that has chased a lot of people out of New York … the burden it places on people in New York is grotesque and completely unnecessary.”","Crypto regulation in New York is the strictest in the U.S., especially compared to more crypto-friendly states like Texas and Wyoming, which have moved quickly to create a regulatory atmosphere that is welcoming to the crypto industry.","Adding to the crypto industry’s hurdles in New York, however, is that DFS isn’t the only regulator in the state that has an opinion on crypto.","The New York State Attorney General’s office (NYAG), helmed by Letitia James, has also turned its eye towards the crypto industry.","Under New York’s strict blue sky laws – which give the attorney general’s office broad powers to investigate and prosecute suspected securities fraud – James’ office has gone after major players in the crypto space, including stablecoin issuer Tether. Last October, the NYAG also ordered two crypto companies to shut down operations in New York.","Andres Munoz, a crypto-focused litigation partner at Romano Law, says the AG’s aggressive stance towards crypto companies is relatively new.","“It used to be that [NYAG] would defer to DFS because they came up with the BitLicense,” Munoz said. “But in the past few years, the attorney general has taken increasingly aggressive steps to regulate many of these cryptocurrency platforms.”","“Essentially, the AG has put these virtual currency businesses on notice that obtaining a BitLicense is not enough,” Munoz said.","The regulatory hurdles faced by crypto companies in New York are the result of state-level activities – which means Eric Adams has little to no authority to change them.","“Municipal government has nothing to do with this,” Yermack said.","Andrew Rasiej, chairman of the New York Tech Alliance and co-chair of Mayor Adams’ tech transition committee, seconded this.","“New York City has zero say over the rules or policies associated with crypto. New York State obviously has a little bit more say, but as far as the city of New York is concerned, there really isn’t much it can do,” Rasiej said.","“It can encourage crypto by inviting firms and investors to recognize New York as a center for crypto development,” Rasiej added. “But as far as infrastructure goes, there’s not much it can do.”","For crypto founders willing to jump through New York’s hoops, however, the intense regulatory requirements offer companies some perks, including access to New York’s wealthy population and a reputation for being compliant with regulators (i.e., safe).","And because the process is difficult, it weeds out some of the competition.","“The companies that have had the resources and decided to go through the trouble of getting [the BitLicense] have benefited because of it,” said Omid Malekan, who teaches blockchain technology at Columbia’s business school.","“They can turn around and tell the market, their customers and other U.S. regulators, ‘Hey, we have the hardest-to-get crypto license in America.’”","Thomas Hook, chief compliance officer for BitStamp USA, which has had a BitLicense since 2019, said the license – and the regulatory compliance it indicates – is a “feather in the cap” for his company.","“New York is a very exacting regulator,” Hook added. “They have detailed requirements, which is helpful. When you know the rules, you're going against, it's easier to comply with them and hold yourself accountable.”","Hook, who started his career in the cybercrimes unit of the New York County District Attorney’s office, said New York regulators have to be strict because New York is the center of the global financial market.","BitStamp’s access to the New York markets has, according to Hook, offered the company access to “a huge hub of talent, customers, and partners.”","Malekan pointed out that NYC-based crypto companies are raising enormous sums from investors, most of which will go towards hiring people.","“There’s a huge labor shortage in crypto. The opportunities are there. The wages are very high, very competitive,” Malekan said. “Eric Adams is smart – the job of any mayor is to create an environment for economic growth with high wage, high quality jobs.”","“There’s going to be a turf war, and we’re going to see more and more cities and states fighting to get a piece of that pie,” Malekan concluded.","Miami has emerged as the biggest competitor – at least domestically – to New York as a hub for the crypto industry.","Miami Mayor Francis Suarez has made attracting crypto companies to Miami a priority for his administration, and he has been successful. Last summer, Blockchain.com announced that it would be moving its U.S. headquarters from New York City to Miami, with promises to add 300 high-paying jobs.","Crypto companies like eToro and FTX US have announced plans to expand their presence in Miami, with the latter even buying the naming rights to the former American Airlines Arena.","In addition to comparatively lax regulation, Suarez has pointed out that it’s simply cheaper to do business in Florida than New York – which he believes is a big draw for some crypto companies.","“There is a cost of living differential, which is about two-to-one right now,” Suarez told NPR last December. “It’s twice as expensive to live in New York as it is in Miami.”","Suarez said the influx of crypto companies and other mainstream financial firms like Citadel Securities into Miami has brought with it $1.2 trillion worth of assets under management (AUM) since 2019 – an enormous boon for any city’s economy, but particularly so for Miami’s, which was 60% service-sector based prior to the COVID-19 pandemic.","And Florida isn’t the only state competing with New York for the crypto crown: Texas, Wyoming, Tennessee and other states – as well as Puerto Rico – have all taken steps towards establishing crypto hubs of their own.","Beyond U.S. borders, countries like Singapore and Malta have emerged as crypto hotspots. In January, Hong Kong-based crypto exchange Xapo announced it would be renouncing its BitLicense to focus on its international products.","But it’s not just crypto companies that New York stands to lose: Crypto investors are also leaving the state in droves to escape New York’s high tax rates.","“If you’re trading crypto assets, you’ve probably outperformed your peers, which means you care more about things like income taxes – I think that’s part of why we’ve seen this migration to places like Miami and Puerto Rico,” Malekan said.","Though New York’s regulatory requirements might be onerous enough to push away some companies, the reality is that the city’s crypto industry is continuing to grow despite them.","“New York is, and has always been, a mainstage player in the crypto industry,” said Jackie Zupsic, head of communications and co-chair of the crypto practice and fintech group at Tusk Strategies.","“It goes without saying that New York is the financial capital of the world,” said Walter Hessert, head of strategy at Paxos, a New York-based crypto firm that provides brokerage and settlement services to financial institutions.","Paxos was the first crypto company to receive regulatory approval from NYDFS. Hessert said that being compliant with regulations is key to Paxos’ mission, and is critical for Paxos’ clients, many of whom are also regulated by NYDFS.","Hessert said that New York’s history of being an exacting regulator has set a “gold standard” for financial regulation, including crypto.","“Regardless of what you think about the BitLicense, what I’m seeing is New York continuing to thrive,” Zupsic said. “Few places rival New York when it comes to talent and capital availability.”","“Now New York will just need to figure out how to keep people there,” Zupsic said.","UPDATE (May 11, 19:22 UTC): Adds commentary from a NYDFS spokeswoman, and updates information about the number of BitLicenses that have currently been awarded."],"entity":[{"type":"AG","content":"ORGANIZATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"Letitia James","content":"PERSON"},{"type":"Paxos","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Tusk Strategies","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"New York State","content":"ORGANIZATION"},{"type":"Department","content":"ORGANIZATION"},{"type":"Mike Novogratz","content":"PERSON"},{"type":"Fred Wilson","content":"PERSON"},{"type":"States","content":"LOCATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"$1.2 trillion","content":"MONEY"},{"type":"2021","content":"DATE"},{"type":"NYAG","content":"ORGANIZATION"},{"type":"Florida","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Walter Hessert","content":"PERSON"},{"type":"19","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Midtown Manhattan","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Ahmet Oz","content":"PERSON"},{"type":"Columbia","content":"ORGANIZATION"},{"type":"Brooklyn","content":"LOCATION"},{"type":"summer","content":"DATE"},{"type":"Jake Heid","content":"PERSON"},{"type":"Jackie Zupsic","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"2014","content":"DATE"},{"type":"Michael Shaulov","content":"PERSON"},{"type":"2011","content":"DATE"},{"type":"New Jersey","content":"LOCATION"},{"type":"Union Square Ventures","content":"ORGANIZATION"},{"type":"12%","content":"PERCENT"},{"type":"American Airlines Arena","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"fintech","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"Tennessee","content":"LOCATION"},{"type":"Baruch","content":"PERSON"},{"type":"Francis Suarez","content":"PERSON"},{"type":"Charlie Shrem","content":"PERSON"},{"type":"Lou Kerner","content":"PERSON"},{"type":"Connecticut","content":"LOCATION"},{"type":"June 2020","content":"DATE"},{"type":"Omid Malekan","content":"PERSON"},{"type":"February","content":"DATE"},{"type":"$6.5 billion","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"America","content":"LOCATION"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"New York Tech Alliance","content":"ORGANIZATION"},{"type":"Kerner","content":"PERSON"},{"type":"Malta","content":"LOCATION"},{"type":"Heid","content":"PERSON"},{"type":"New York County District Attorney","content":"ORGANIZATION"},{"type":"May 11","content":"DATE"},{"type":"New York City","content":"LOCATION"},{"type":"New York Blockchain Center","content":"ORGANIZATION"},{"type":"Jones","content":"PERSON"},{"type":"DCG","content":"ORGANIZATION"},{"type":"Rasiej","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Eric Adams","content":"PERSON"},{"type":"Baruch","content":"LOCATION"},{"type":"BitStamp USA","content":"ORGANIZATION"},{"type":"$3.2 billion","content":"MONEY"},{"type":"Andrew Rasiej","content":"PERSON"},{"type":"NPR","content":"ORGANIZATION"},{"type":"Suarez","content":"PERSON"},{"type":"night","content":"TIME"},{"type":"Adams","content":"PERSON"},{"type":"Texas","content":"LOCATION"},{"type":"Baruch College","content":"ORGANIZATION"},{"type":"Dilendorf","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"David Yermack","content":"PERSON"},{"type":"NYU Stern School of Business’","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"Google","content":"ORGANIZATION"},{"type":"Lawrence Zicklin","content":"PERSON"},{"type":"Max Dilendorf","content":"PERSON"},{"type":"BitLicense","content":"ORGANIZATION"},{"type":"Imani Jones","content":"PERSON"},{"type":"60%","content":"PERCENT"},{"type":"Zupsic","content":"PERSON"},{"type":"Munoz","content":"PERSON"},{"type":"Puerto Rico","content":"LOCATION"},{"type":"Malekan","content":"PERSON"},{"type":"final quarter of 2021","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"NYC","content":"ORGANIZATION"},{"type":"Heid","content":"ORGANIZATION"},{"type":"NYDFS","content":"ORGANIZATION"},{"type":"Philadelphia","content":"LOCATION"},{"type":"DFS","content":"ORGANIZATION"},{"type":"Hessert","content":"PERSON"},{"type":"Wyoming","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Andres Munoz","content":"PERSON"},{"type":"Big Apple","content":"ORGANIZATION"},{"type":"Yermack","content":"PERSON"},{"type":"Citadel Securities","content":"ORGANIZATION"},{"type":"Empire State","content":"ORGANIZATION"},{"type":"October","content":"DATE"}],"hashtag":["New York","Regulation","New York Attorney General","BitLicense","Eric Adams","Policy"],"authors":["Cheyenne Ligon"]}