{"summary":"Leading figures behind layer-2 teams told CoinDesk how Ethereum's upcoming Dencun upgrade will affect their networks – and costs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/06\/ethereum-fees-set-to-drop-for-arbitrum-polygon-starknet-base-but-how-much\/","publishDate":"2024-03-06T14:48:02","id":15258,"type":null,"title":"Ethereum Fees Set to Drop for Arbitrum, Polygon, Starknet, Base. But How Much?","category":["Technology"],"content":["Ethereum developers are gearing up for the blockchain's next big upgrade happening next week, called Dencun.","It's supposed to issue in a new era of lower costs for \"layer-2\" blockchains, including so-called rollup networks that aim to offer faster and cheaper transactions than on the main blockchain. But just how much lower?","Dencun will be the biggest upgrade – technically a \"hard fork\" in blockchain parlance – that the network will undergo in almost a year.","The main component in Dencun is called EIP-4844, or more commonly “proto-danksharding,” which will bring in a new type of transaction class that reduces the costs of publishing data of transactions on rollups, through the introduction of data “blobs.” These blobs are a separate place in a transaction where rollup networks or other protocols could temporarily stash data – sometimes described as a \"side car\" that doesn't take up space in the main car.","As a result of more blobs, the costs for these layer-2 networks to stash data on Ethereum will be significantly cheaper, and the reduction is likely to trickle down to users in the form of lower fees.","But how exactly it will all shake out is still ambiguous, according to many Ethereum experts. We asked leading layer-2 teams, including Polygon, Arbitrum, StarkWare and Coinbase's Base, for their predictions post-Dencun.","Polygon co-founder Jordi Baylina told CoinDesk in an interview at the ETHDenver conference last week in Colorado that “prices should go down mainly because it's a matter of supply and demand. Your supply is bigger, the data availability on Ethereum is going to be bigger, so the price should go lower.\"","“By how much? We don't know, it's difficult to predict,” Baylina said. He mentioned that he welcomes the upgrade as its an important first step in the roadmap that Vitalik Buterin laid out, focusing on activity moving to rollups in order to scale the blockchain.","Brendan Farmer, another co-founder of Polygon, added that there will be different benefits for zero-knowledge (ZK) rollups and optimistic rollups – the two major types. For optimistic rollups, “you have to pay for proving that data exists in the seven-day delay, but for ZK rollups, these costs are very, very low,” Farmer added.","(Polygon's latest tech, it might be inferred, relies on the ZK rollup.)","Steven Goldfeder, the co-founder of Offchain Labs, the developer firm behind the layer-2 network Arbitrum (an optimistic rollup), said that Dencun will \"expose something very, very interesting, which has been sort of the backdrop for a few years and what that is, it helps an L1 fees,” Goldfeder told CoinDesk at ETHDenver.","“We also pay the layer-2 and if you think about it, the reason why is because there are certain operations that use a lot of data on layer 1 and use nothing on layer 2, and there are certain operations they put like basically nothing on layer 1, then they just use a ton of layer 2,” Goldfeder added.","Every ecosystem decides for themselves how they go about pricing and data on a layer 1 vs. a layer 2. “Some of our competitors price layer-2 fees at essentially zero. And that's not sustainable,” Goldfeder said.","“If you're pricing gas at zero, someone could just dos the network by just using this resource for free and just keep doing this free. And I think that's going to come very much to the forefront.”","StarkWare CEO Eli Ben-Sasson said that blobs will significantly reduce, but it depends on the prices of the blobs that fill up. Ben-Sasson told CoinDesk that “90% of the cost that users are paying for transactions are related to the cost of data on the layer 1. So it means that if now this data gets added into blobs, and let's say the price is 10x lower, then 90% of the cost goes down by a factor of 10.”","StarkWare is the primary developer behind the layer-2 network Starknet, and the team has been working behind the scenes to prepare Starknet’s infrastructure for proto-danksharding the minute it goes live. “You would always want to be ready on day one. I’m glad that we managed to do that. It wasn't clear that we could, but we sort of rushed through it.”","In an interview last week with CoinDesk's The Protocol podcast, Jesse Pollak, head of protocols at Coinbase, and creator of the Base layer-2 network, broke it down.","He estimated that the blob space opened up by proto-danksharding will be roughly four times what Ethereum rollups are currently using. At that level of demand, transactions would be \"really cheap,\" since the fee rates are market-based, said Pollak, who oversees development of the U.S. crypto exchange's layer-2 blockchain. With no increase in usage, costs could fall by 90% to 95%.","But he said it's likely that the low costs could lead to higher usage, and \"as demand creeps back up, it's going to find some stable equilibrium,\" and fees might ultimately end up two to five times less than they are now.","A reduction of two times would imply per-transaction costs around 10-15 cents, while a drop of five times would put the figure under 5 cents, he said. Coinbase's own goal is to see \"sub-cent\" transaction costs, he said.","Because of the market mechanism for setting fee rates, it's \"impossible to predict exactly,\" Pollak said.","Read more: Ethereum Developers Target March 13 for Milestone 'Dencun' Upgrade on Mainnet","Bradley Keoun contributed reporting."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"U.S.","content":"LOCATION"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"Coinbase","content":"LOCATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"5 cents","content":"MONEY"},{"type":"Eli Ben","content":"PERSON"},{"type":"Dencun","content":"LOCATION"},{"type":"15 cents","content":"MONEY"},{"type":"2","content":"DATE"},{"type":"Dencun","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"Ben","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"March 13","content":"DATE"},{"type":"Colorado","content":"LOCATION"},{"type":"Baylina","content":"PERSON"},{"type":"95%","content":"PERCENT"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Sasson","content":"PERSON"},{"type":"Brendan Farmer","content":"PERSON"},{"type":"Goldfeder","content":"PERSON"},{"type":"Jordi Baylina","content":"PERSON"},{"type":"last week","content":"DATE"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Pollak","content":"PERSON"}],"hashtag":["Dencun","Arbitrum","Base","Coinbase","starknet","Starkware","Offchain labs","Polygon"],"authors":["Margaux Nijkerk"]}