{"summary":"The crypto lender said it will return value to customers via direct distribution.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/04\/25\/voyager-says-binanceus-sent-letter-terminating-1b-asset-buy-deal\/","publishDate":"2023-04-25T18:10:56","id":15250,"type":null,"title":"Voyager Digital Says Binance.US Sent Letter Terminating $1B Asset Buy Deal","category":["Finance"],"content":["Bankrupt crypto lender Voyager Digital said it received a letter from Binance.US, terminating the asset purchase deal.","\"Today we received a letter from Binance.US terminating the asset purchase agreement,\" Voyager said in a tweet on Tuesday. \"While this development is disappointing, our Chapter 11 plan allows for direct distribution of cash and crypto to customers via the Voyager platform,\" the tweet added.","In a tweet, Binance.US attributed the termination to the \"hostile and uncertain regulatory climate in the United States\" that has \"introduced an unpredictable operating environment impacting the entire American business community.\"","A substantive part of the $1 billion deal was allowed to proceed by the U.S. government in an April 20 filing, despite concerns the fine print of the contract would pardon breaches of tax or securities law.","The deal had been approved by the vast majority of Voyager creditors who voted, and by bankruptcy judge Michael Wiles. A committee representing those creditors in bankruptcy proceedings tweeted that it was \"incredibly disappointed\" with the news and was \"investigating potential claims\" against Binance.US.","Lawyers for the U.S. government, including the Securities and Exchange Commission, had sought to block the deal, arguing that some of the assets involved in the transaction, including potentially Voyager's VGX token, could constitute unregistered securities. VGX fell about 11%, trading around $0.3144 on Tuesday.","Binance.US' offer, originally made in December, allowed it to back out if the deal wasn't consummated within four months. In a recent legal filing, attorneys for Voyager warned that the deal falling apart could cost the estate, and its over 1 million creditors, an extra $100 million.","Faced with Twitter speculation that abandonment of the deal was linked to an upcoming settlement with the Commodity Futures Trading Commission, which has sued parent exchange Binance over selling unregistered crypto derivative products, Chief Executive Officer Changpeng Zhao responded with an emoji of a shrugging figure.","Read more: U.S. Government Allows the Bulk of Voyager-Binance.US Deal to Proceed","UPDATE (UTC 18:49, April 25): Adds Binance.US tweet details.","UPDATE (UTC 19:21, April 25): Adds context from fifth paragraph onwards.","Edited by Aoyon Ashraf."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"11%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"$0.3144","content":"MONEY"},{"type":"Changpeng Zhao","content":"PERSON"},{"type":"April 20","content":"DATE"},{"type":"19:21, April 25","content":"DATE"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"April 25","content":"DATE"},{"type":"Voyager Digital","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"Michael Wiles","content":"PERSON"}],"hashtag":["Voyager","Binance US","Bankruptcy","US","Regulation"],"authors":["Aoyon Ashraf"]}