{"summary":"A crime bill passed last week gives law enforcement agencies more powers to seize and freeze crypto.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/02\/uks-national-crime-fighting-agency-seeks-six-crypto-investigators\/","publishDate":"2023-11-02T11:02:30","id":15251,"type":null,"title":"UK's National Crime-Fighting Agency Seeks Six Crypto Investigators","category":["Policy"],"content":["The U.K.'s National Crime Agency (NCA) is setting up a team for cybercrime and is looking to recruit six specialist crypto investigators.","\"This role will be part of a new project that will form a specialised cryptocurrency and virtual assets team,\" the job posting said. An ideal candidate will need to understand crypto and be able to conduct advanced tracing on blockchains as well as understand crypto investigations.","The U.K. has been beefing up its tools for tackling crypto crime. Parliament last week passed a bill giving law-enforcement agencies more powers to seize and freeze crypto. The new positions follow an initiative last year that saw the National Police Chiefs' Council (NPCC) station crypto tactical advisers in police departments nationwide.","\"The role will support existing and new investigations where specialist cryptocurrency experience is required along with taking a proactive lead in identifying targets for further development,\" the posting said. The job will sit within the National Cyber Crime Unit or digital asset team.","Read more: UK Crime Bill Lets Cops Freeze Crypto Faster, Channels Tainted Assets to Public Funding","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"National Crime Agency (NCA","content":"ORGANIZATION"},{"type":"National Police Chiefs","content":"ORGANIZATION"},{"type":"UK Crime Bill Lets Cops Freeze Crypto Faster","content":"ORGANIZATION"},{"type":"U.K.","content":"LOCATION"}],"hashtag":["Regulations","Crime","UK","Crypto","Policing"],"authors":["Camomile Shumba"]}