{"summary":"India’s tax authority first began seizing assets to address alleged tax evasion late last year and initially identified six exchanges.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/03\/28\/india-identifies-11-crypto-exchanges-accused-of-tax-evasion\/","publishDate":"2022-03-28T16:21:28","id":15262,"type":null,"title":"India Identifies 11 Crypto Exchanges Accused of Tax Evasion","category":["Policy"],"content":["India’s tax authority has seized Rs. 95.86 crore (US$12.6 million) from 11 crypto exchanges on allegations of tax evasion.","The Directorate General of GST Intelligence (DGGI), which oversees tax collection in India, had previously seized around Rs. 84 crore (about $11.0 million) in taxes and a further Rs. 1.1 crore ($145,000) in penalties, CoinDesk reported in January. India’s Minister of State for Finance Pankaj Chaudhary said the figure was closer to 95.86 crore ($12.6 million) in a statement Monday.","Chaudhary was initially asked to detail the tax seizures by a member of India’s Parliament.","In January, DGGI only confirmed seizing funds from six crypto exchanges, including India's largest exchanges: WazirX, CoinDCX, BuyUCoin and Unocoin. On Monday, Chaudhary updated the figure to 11 exchanges.","In January, India’s tax authority had conducted searches on WazirX, CoinSwitch Kuber, CoinDCX, BuyUCoin and Unocoin after what it deemed to be tax evasion of Rs. 40.5 crore ($5.3 million). The tax authority said in a statement the case was part of a special anti-tax evasion drive.","The country is not just cracking down on tax evasion, but has also introduced tough new crypto tax rules. By April, 1 Indian crypto companies will have to pay a capital gains tax of 30% on crypto transactions. In addition to the capital gains tax, Indians buying or selling crypto will have to pay a 1% tax deducted at the source by July 1.","Read more: ‘We Have Entered a Period of Pain,’ Says WazirX CEO of India’s New Tax Laws"],"entity":[{"type":"$12.6 million","content":"MONEY"},{"type":"US$12.6 million","content":"MONEY"},{"type":"Chaudhary","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"$145,000","content":"MONEY"},{"type":"$5.3 million","content":"MONEY"},{"type":"India’s Minister of State for Finance Pankaj Chaudhary","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"$11.0 million","content":"MONEY"},{"type":"Monday","content":"DATE"},{"type":"India","content":"LOCATION"},{"type":"1%","content":"PERCENT"},{"type":"July 1","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Unocoin","content":"ORGANIZATION"},{"type":"Directorate General of GST Intelligence (DGGI","content":"ORGANIZATION"},{"type":"CoinSwitch Kuber","content":"LOCATION"},{"type":"Unocoin","content":"PERSON"}],"hashtag":["India","Crypto","Tax","Tax Evasion"],"authors":["Camomile Shumba"]}