{"summary":"Consensus 2023 visitors discussed DeFi's growth, its need to comply with regulations, and the challenges of balancing crypto-native concepts with traditional finance requirements.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/09\/defiant-by-default-why-regulators-must-understand-not-police-defi\/","publishDate":"2023-06-09T13:23:51","id":15260,"type":null,"title":"Defiant by Default: Why Regulators Must Understand, Not Police, DeFi","category":["Consensus Magazine"],"content":["In many ways, the question of whether decentralized finance (DeFi) should defy regulators is settled.","This corner of the crypto economy uses blockchain technology and smart contracts to remove intermediaries from lending, trading, saving and other financial activities. “Intermediaries” here means not only banks and other financial institutions but also regulators and any gatekeepers.","Yet, for the subsector to continue to grow, attract capital and become a trusted way to conduct business, DeFi will need to comply with various governments’ regulatory requirements, agreed most participants in closed-door roundtable discussions at Consensus 2023.","This article is excerpted from CoinDesk’s inaugural Consensus @ Consensus Report, the product of intimate, curated group discussions that took place at Consensus 2023. Click here to download the full report.","DeFi today is a $47.8 billion industry, spread over a number of application-friendly blockchains including Ethereum, Solana, Cardano and others. Its core group of users is composed of “crypto natives,” though a number of financial institutions have begun piloting closed-circuit versions of open DeFi protocols or running experiments on-chain.","While the sector is still relatively immature, DeFi could be said to be one of the few use cases in crypto that has found product-market fit. Moreover, in a year that saw several centralized crypto lending companies file for bankruptcy protection – many of which once had multi-billion-dollar valuations and counted tens of thousands of users – no major DeFi application failed during the months that saw crypto’s total market capitalization decrease from over $2 trillion to under $1 trillion.","These systems, which execute basic financial operations at any time of day using pre-set rules and publicly auditable code, were and remain able to return funds to users, liquidate underwater loans based on pre-established collateral requirements and generate yield.","See also: Crypto and Regulators Are Speaking the Same Language When It Comes to Transparency | Opinion","It is for this reason that many stakeholders across DeFi think the best course for the industry is not to implement know-your-customer (KYC) and anti-money laundering (AML) procedures standard in traditional finance (aka TradFi), but to work with and educate regulators and institutions on accepting DeFi as it exists.","The task at hand is to demonstrate why those design decisions were made, and what benefits they may bear for users and financial watchmen. Because anyone can publish code to a blockchain and because anyone with sufficient technological knowledge can access that code, some amount of unregulated, unsurveilled and potentially illicit DeFi activity will always be possible. It’s within this context that all regulatory conversations must take place…","Click here to download the full Consensus @ Consensus report.","Complete the form below to access the latest trends, analysis and insights gathered from the intimate group discussions that took place at Consensus 2023.","*Required information","By clicking \"Sign Up\", you agree to receive newsletter from CoinDesk as well as other partner offers and accept our terms of services and privacy policy."],"entity":[{"type":"$2 trillion","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"$1 trillion","content":"MONEY"},{"type":"AML","content":"ORGANIZATION"},{"type":"Solana","content":"PERSON"},{"type":"$47.8 billion","content":"MONEY"}],"hashtag":["Features","Consensus at C23","DeFi","Regulaion","Consensus @ Consensus 2023 Report","Consensus 2023"],"authors":["Daniel Kuhn"]}