{"summary":"The artist made an NFT of the former Alameda Research executive for our Most Influential package.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/12\/04\/michael-kutsche-caroline-ellison-had-her-mind-hijacked\/","publishDate":"2023-12-04T13:45:38","id":15263,"type":null,"title":"Michael Kutsche: Caroline Ellison Had Her Mind 'Hijacked'","category":["Consensus Magazine"],"content":["As part of our special NFT series, we asked the artist Michael Kutsche to make an image of Caroline Ellison, the former Alameda Research executive who took a star turn as a witness for the prosecution in this year's criminal trial of the once-crypto billionaire Sam Bankman-Fried.","Click here to view and bid on the NFT created by Michael Kutsche. The auction will begin on Monday, 12\/4 at 12p.m. ET and ends 24 hours after the first bid is placed. Holders of a Most Influential NFT will receive a Pro Pass ticket to Consensus 2024 in Austin, TX. To learn more about Consensus, click here.","We spoke with Kutsche about his work below.","Tell us about how\/why you became an artist. Why do you choose to create NFTs?","Although I managed to carve myself a successful career as a character designer in film I've always been passionate about fine art and created personal work since I can remember. I've been offered to exhibit my work numerous times even back then, but it took a lot of grit to get to the point where I am as a character designer and at the time I was convinced that I had to make a choice, which might also be related to my German heritage, where the \"jack of all trades\" is a deeply negative connotation. But those oil paintings and piles of drawings I was working on in my spare time all those years were also a necessity, as artists we need this freedom of expression or we get frustrated. I was also convinced that at some point things would align and I would start exhibiting.","But the reality has always been that proper gallery representation was only possible with physical works. If someone would have told me that at some point there will be collectors buying digital art in the form of NFTs I would have laughed. The truth is, while I enjoy the process of working traditionally, I've been a digital artist for more than 20 years, and I'm much more native to the medium. I'm using a crossover of techniques, between digital painting and 3-D animation and performance capture that can only exist in this medium and cannot be experienced otherwise, so the rise of NFTs has been a true blessing.","While the idea of creating physical paintings is not fully off the table, and I think they could actually complement my digital work in an installation, it currently seems more like a step back to me. I'm much more excited about the new ground that can be conquered with art that is at the cutting edge of technology.","2. Talk about your artistic approach to creating an image for this year's Most Influential.","My main concern with creating the piece was that I wanted to make sure it's inspired by Caroline's story but that it stays a piece of art in its own right, that it goes beyond being an editorial illustration. So it is loosely inspired by what I read about her, but when I sat down to write down and sketch ideas I was really going more into this intuitive mode, which I always do when creating art, as opposed to the more problem-solving approach when doing character design. Creating a piece like this involves a lot of trial and error, and I over-paint most of the elements numerous times until they are in a perfect relation and speak to me. I'm very fascinated by how placing familiar objects and figures in new constellations creates new layers of context and meaning. From a formal perspective, I love to work in this exciting realm between abstraction and figuration, and I often juxtapose these seemingly contradictory elements. I also like the idea that the place that I'm depicting and shaping in my work, a kind of \"digital limbo\" actually exists in an alternate reality, and that I'm merely excavating these fragments of memory like an archeologist.","3. What aspects of Caroline Ellison's personality and profile did you want to emphasize, and why?","One particular thing stood out to me, is when Caroline mentioned that SBF \"corrupted her values.\" I found it intriguing that after being involved in the whole situation on such a deep level, in a powerful position as CEO of Alameda Research, and as a seemingly very intelligent person who won numerous math awards, she claimed that SBF somehow hijacked her mind so that she forgot her moral integrity along the way. This one anecdote basically gave me a literal head start, and after I turned her head into a jacuzzi where SBF could feel at home, everything else slowly fell into place.","The title of the piece is an ironic nod to the \"Effective Altruism\" movement which Caroline and SBF were part of, and which most likely will be seen in a different light after what went down with FTX.","4. Who do you think are the most influential NFT artists today?","Artists in the NFT space tend to be influential for a variety of reasons, some of which go beyond the quality of the art itself. Besides that, and from a more personal perspective as an artist, the ones that continuously impress me are Joe Pease, Jake Fried and Per Kristian Stoveland. I'm also enjoying Beeple's everydays and his video sculptures.","5. What was the most disruptive NFT project in history?","My first thought went to \"Goblintown.wtf\" but I'd rather give the trophy to Jack Butcher's \"Opepen\", to end on a more positive note.","6. Describe your style in three words.","That's not an easy task, but a curator named Snejana Krasteva once categorized my work as \"Cybernetic Existentialism\".","7. Given the rise and the fall of the NFT market over the last 18 months, what's your outlook on the future of NFT art?","Since 2021 I've seen my fair share of the cyclical nature of crypto, and I've learned to look at things in a more relaxed manner. Apart from that it is hard for me to imagine a future where digital art isn't becoming increasingly more popular and important. I've seen many digital art exhibitions in cities around the world, and I've witnessed how captivating this digital art revolution is for audiences. The biggest institutions of the art world, such as the MoMA in NY, are already adopting NFTs. The road to mainstream adoption might be long and winding, but I think there's no turning back."],"entity":[{"type":"2021","content":"DATE"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"Caroline","content":"PERSON"},{"type":"Joe Pease","content":"PERSON"},{"type":"Austin","content":"LOCATION"},{"type":"Beeple","content":"PERSON"},{"type":"Jack Butcher","content":"PERSON"},{"type":"Michael Kutsche","content":"PERSON"},{"type":"Most Influential NFT","content":"ORGANIZATION"},{"type":"TX","content":"LOCATION"},{"type":"Kristian Stoveland","content":"PERSON"},{"type":"Kutsche","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"last 18 months","content":"DATE"},{"type":"Snejana Krasteva","content":"PERSON"},{"type":"Jake Fried","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"}],"hashtag":["Opinion","FTX","Alameda Research","Most Influential 2023","no-livewire"],"authors":["CoinDesk Staff"]}