{"summary":"On March 3, 2020, working with IBM, Onchain Custodian, the Singapore-based absolute safe for digital asset custody, released an optimized version of the latter’s SAFE™ platform. As a digital asset custody platform, SAFE™ integrates the tamper-resistant nature of IBM Cloud™ Hyper Protect Crypto Services to deliver optimized security, operational efficiency, and risk management.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/57564\/onchain-custodian-delivers-enhanced-wallet-management-with-the-support-of-ibm","publishDate":"2020-03-03T08:00:10","id":1526,"type":null,"title":"Onchain Custodian Delivers Enhanced Wallet Management with the support of IBM","category":["LAYER 1S"],"content":["<span data-v-f87c67ca=\"\">Across the world and across every industry, increasingly more ecosystems are leveraging blockchain to deliver innovative new business models and disrupt traditional approaches as a new era of mainstream adoption approaches. With companies moving from blockchain experimentation to implementation, <\/span>an award winning fintech and a leading technology platform have come together to deliver optimized digital asset management services.","<span data-v-f87c67ca=\"\">On March 3, 2020, <\/span>working with IBM<b data-v-f87c67ca=\"\">, <\/b><span data-v-f87c67ca=\"\"><a href=\"https:\/\/oncustodian.com\/#banner\" data-v-f87c67ca=\"\">Onchain Custodian<\/a>, the Singapore-based absolute safe for digital asset custody, released an optimized version of the latter’s SAFE™ platform. As a digital asset custody platform, SAFE™ integrates the tamper-resistant nature of IBM Cloud™ Hyper Protect Crypto Services to deliver optimized security, operational efficiency, and risk management. Possessing the industry’s first and only FIPS 140-2 Level 4&nbsp; certified Hardware Security Module (HSM) available in the public cloud, the IBM Cloud™ Hyper Protect Crypto Services ensures that only Onchain Custodian-- responding to an authenticated customer instruction-- can have access to keys. Through its upgraded SAFE™ platform, Onchain Custodian has further bolstered its digital asset management services as well as its position as a leading third-party custodian.&nbsp;<\/span>","Da Hongfei, Onchain Custodian's Chair of the Board, noted that, \"Since our debut, we have been relentlessly growing our customer base and open finance service offering with our curated partners. With our enhanced custody solution now live, Onchain Custodian is ready to expand further. We are looking for strategical investors to accelerate our scaling.\"","<span data-v-f87c67ca=\"\">With mainstream adoption accelerating, independent third-party digital asset custody has become an essential piece of infrastructure that many experts consider critical for the long-term sustainability of digital assets and cryptocurrencies. With its upgrade, Onchain’s SAFE™ platform will allow digital asset exchanges, fund managers, and projects, among others, to outsource partially or fully the safe hosting of their wallets, while securely automating transaction flows based on threshold and other security measures. By offering dedicated Private Key protection for both institutional and retail private investors while also delivering enhanced operational efficiency, <a href=\"https:\/\/oncustodian.com\/#banner\" data-v-f87c67ca=\"\">Onchain Custodian<\/a> empowers customers to focus on growing their core businesses. <\/span>","<span data-v-f87c67ca=\"\">\"Being able to work with IBM and use their technology to create a highly secure platform was a privilege. IBM Cloud™ Hyper Protect Crypto Services is exactly what we were looking for. Onchain Custodian can focus on building the best execution platform and user experience with our technology provider Onchain while IBM provides us with the best HSM on cloud solution in the market to securely host, maintain and operate our SAFE™ key management infrastructure.\" <\/span>","<span data-v-f87c67ca=\"\">- <strong data-v-f87c67ca=\"\">Alexandre Kech, CEO of Onchain Custodian, Speaking on the launch of its version two<\/strong><\/span>","<span data-v-f87c67ca=\"\">\"By taking advantage of IBM Cloud™ Hyper Protect Services, Onchain Custodian can build a highly resilient and secure cloud-based solution that digital asset custody deserves. Supporting custodians like Onchain Custodian is an ideal use case for IBM Cloud™ Hyper Protect Services.”<\/span>","<strong data-v-f87c67ca=\"\">- Rohit Badlaney, Director, IBM Z<\/strong>","<span data-v-f87c67ca=\"\">Backed by renowned investors such as Fosun, DHVC, and Sequoia Capital, <a href=\"https:\/\/oncustodian.com\/#banner\" data-v-f87c67ca=\"\">Onchain Custodian<\/a> is helping build the foundation for blockchain adoption amongst both enterprises and retail investors. Moreover, as a part of the Neo ecosystem, Onchain Custodian will be able to leverage Neo3 in the near future -- a complete infrastructural rehaul aimed at empowering large-scale blockchain solutions -- to deliver unrivaled efficiency, speed, and protection. &nbsp;<\/span>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Onchain Custodian","content":"PERSON"},{"type":"Sequoia Capital","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Da Hongfei","content":"PERSON"},{"type":"Onchain Custodian","content":"ORGANIZATION"},{"type":"Alexandre Kech","content":"PERSON"},{"type":"March 3, 2020","content":"DATE"},{"type":"Rohit Badlaney","content":"PERSON"},{"type":"IBM Cloud™ Hyper Protect Services","content":"ORGANIZATION"},{"type":"Singapore","content":"LOCATION"},{"type":"IBM","content":"ORGANIZATION"},{"type":"Board","content":"ORGANIZATION"},{"type":"IBM Cloud™ Hyper Protect Crypto Services","content":"ORGANIZATION"}],"hashtag":[],"authors":["Sponsored","The Block"]}