{"summary":"The Department of Justice dropped campaign finance charges against the FTX founder that are likely to return. The issue is about paperwork, not politics.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/07\/28\/no-sam-bankman-fried-is-not-being-bailed-out-by-democrats\/","publishDate":"2023-07-28T19:10:43","id":15268,"type":null,"title":"No, Sam Bankman-Fried Is Not Being Bailed Out by Democrats","category":["Consensus Magazine"],"content":["Yesterday, July 27, 2023, we received an object lesson in the dangers of disinformation. News of changes to the criminal charges against disgraced FTX founder Sam Bankman-Fried began spreading like wildfire on social media. But these changes were misrepresented by influential figures – in some cases with the obvious goal of feeding a conspiratorial and partisan narrative.","That narrative, which has been spreading since FTX’s collapse, holds that Sam Bankman-Fried is a puppet for the Biden administration, and that he’s “getting away with it” thanks to friends in high places.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","To be crystal clear, Bankman-Fried is absolutely not going to get away with it. Not only does he still face a laundry list of active charges scheduled to be tried in October, prosecutors will likely continue to pursue the campaign finance charges. Similar procedural issues led to the dropping of another set of charges, including bank fraud, in June, but those charges were quickly revived as part of a separate trial scheduled for March 2024. It is expected prosecutors will request a similar rescheduling of the campaign finance charges in March.","See also: Sam Bankman-Fried Maybe Hasn’t Escaped Campaign Finance Charges","But these easily Googleable facts didn’t stop political influencers including right-wing blogger Ian Miles Cheong and co-founding editor of The Intercept Glen Greenwald from turning a flawed premise into political red meat. Republican residential candidate Vivek Ramaswamy followed swiftly after, castigating the \"corrupt\" Department of Justice (DOJ) for supposedly going easy on a major Democratic donor.","These pundits and others like them leveraged their mischaracterization of events to advance the FTX-Democrat connection. That politicized framing has been building on the political right since soon after FTX’s collapse – and in fairness, there are many signs of deep, systemic corruption in U.S. politics that suggest something well beyond one young man’s unhinged shell game.","But many of the basic assumptions tying Sam Bankman-Fried to the Democratic party are simply wrong – including the idea that he was a partisan Democratic donor at all. And in using false premises to boil that complex reality down to a partisan rivalry, conspiracy theorists are actually helping the corrupt elites they pretend to be attacking.","The most important thing to understand is that the campaign finance charges against Sam Bankman-Fried are unlikely to go away.","As CoinDesk reported, they were dropped from the omnibus trial scheduled for this coming October. But if prosecutors instead attach the campaign finance charges to the March trial, that would likely mean more jeopardy for Bankman-Fried, not less.","Two separate trials would mean two separate juries. The second jury would be able to focus more on the campaign finance and bank fraud charges, leaving most of the complexity of Bankman-Fried’s embezzlement and financial fraud for the A-team.","Given the high likelihood of his conviction in the first trial, and the influence that would almost inevitably have on jurors in the second trial, yesterday’s reshuffling could make it *more* likely that he goes down for the campaign finance stuff, not less. A second, separate trial, moreover, makes it less likely that portions of his sentence could be served concurrently, potentially increasing his total jail time.","But you wouldn’t know any of this if you listened to figures like Ian Miles Cheong. Cheong’s comment on yesterday’s events is a sterling example of the blurry line between deception and incompetence, with his tweet seeming to imply that Bankman-Fried had been cleared of all charges, not just the campaign finance issue.","Replies to the post make clear that his followers believe Bankman-Fried has simply walked away scot-free – and that his Democratic donations were the key to this (nonexistent) get out of jail free card.","This idea that “the Democrats did it” is, ironically, rooted in believing Sam Bankman-Fried’s own lies.","Before his downfall, the master swindler burnished his image in the media by pretending to be driven by a desire to save the world (in fact, he wanted to buy a private island for his friends). One pillar of this carefully-crafted image was his declaration that he would give $1 billion dollars to Democratic politicians in the 2024 election cycle.","This was a lie in (I’ve counted carefully) at least four ways.","First, Sam Bankman-Fried never had a billion dollars to give, or any real chance of getting there. Second, even before his fraud was revealed, he walked back the $1 billion number, which he seems to have made up because it sounded good. Third, Bankman-Fried later admitted that his entire commitment to the (already corrupt and broken) ideology of “Effective Altruism” was itself a strategic lie.","But the lie that really counts here (the fourth one) is that Sam Bankman-Fried was committed to Democratic party politics. In fact, he was donating stolen customer funds to both Republicans and Democrats. His real goal was never to get Joe Biden re-elected, but to curry favor with politicians on both sides in pursuit of favorable regulation.","The entire idea that Bankman-Fried was a \"Democratic megadonor,\" in other words, came about because he wanted to hide his donations to conservatives, and did so illegally. The goal was to maintain his public image as a nice (neo)liberal guy, so he routed those donations through others, including FTX staffers, who falsely claimed to be donors.","See also: The Faulty Moral Universe of Sam Bankman-Fried | Opinion","And here lies the real harm of the partisan and fact-averse interpretation of the FTX scandal as a Democratic Party operation: it obscures the fact that to the rich and powerful, America’s political parties are nothing but strategic playthings.","People like Sam Bankman-Fried and his coterie are dangerous not because of their political commitments, but because of their complete lack of real values beyond pursuing their own benefit. The very fact that Bankman-Fried was consciously working both sides of the aisle shows why it’s so misguided and dangerous to turn his prosecution into a political football.","Edited by Daniel Kuhn."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"$1 billion dollars","content":"MONEY"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"$1 billion","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Ian Miles Cheong","content":"PERSON"},{"type":"America","content":"LOCATION"},{"type":"Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"March 2024","content":"DATE"},{"type":"June","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"billion dollars","content":"MONEY"},{"type":"Joe Biden","content":"PERSON"},{"type":"Biden","content":"PERSON"},{"type":"October","content":"DATE"},{"type":"Fried Maybe Hasn’t Escaped Campaign Finance Charges","content":"ORGANIZATION"},{"type":"Glen Greenwald","content":"PERSON"},{"type":"July 27, 2023","content":"DATE"}],"hashtag":["Opinion","Sam Bankman-Fried","FTX","Politics","Fraud","The Node","Newsletters","top news"],"authors":["David Z. Morris"]}