{"summary":"New York Attorney General Letitia James filed the suit against the ex-head of the failed lending platform, accusing him of misleading investors about the firm’s health.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/01\/05\/former-celsius-ceo-mashinsky-sued-by-new-york-state-for-defrauding-investors\/","publishDate":"2023-01-05T15:36:50","id":15273,"type":null,"title":"Former Celsius CEO Mashinsky Sued by New York State for Defrauding Investors","category":["Policy"],"content":["New York state’s attorney general has sued Alex Mashinsky, the former CEO of Celsius Network, for defrauding hundreds of thousands of investors by making false statements between 2018 and at least June 2022 about the condition of the company to encourage money to keep coming in.","Attorney General Letitia James said the state intends to ban Mashinsky from doing business there, in addition to seeking damages and restitution for harmed investors, according to a Thursday statement.","“As the former CEO of Celsius, Alex Mashinsky promised to lead investors to financial freedom but led them down a path of financial ruin,” James said in the statement.","The lawsuit accuses the ex-CEO of the cryptocurrency lender of making many false claims about the number of Celsius users, its strategies to recruit investors and the nature of what it was investing in, claiming its money went to safe, low-risk investments with reliable businesses. The suit also accused him of incorrectly asserting that Celsius had been safer than a bank, though it operated without the typical regulatory safeguards that go with banking in the U.S.","Mashinsky didn't immediately respond to a request for comment, nor did a lawyer representing Celsius.","Celsius froze customer withdrawals in June, citing \"extreme market conditions,\" before filing for bankruptcy in July during a stretch of 2022 crypto failures that rocked the industry. Mashinsky, who resigned as CEO in September, reportedly withdrew $10 million from Celsius weeks before the company halted withdrawals.","The lender's bankruptcy is being handled in U.S. Bankruptcy Court of the Southern District of New York.","Read More: Celsius 'Earn' Assets Belong to Bankrupt Crypto Lender, Judge Rules","UPDATE (Jan. 5, 2023, 15:57 UTC): Adds more information from the lawsuit.","UPDATE (Jan. 5, 2023, 17:12 UTC): Adds attempts to seek comment from Mashinsky and Celsius."],"entity":[{"type":"June 2022","content":"DATE"},{"type":"Letitia James","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"U.S. Bankruptcy Court of the Southern District of New York","content":"ORGANIZATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Jan. 5, 2023","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"James","content":"PERSON"},{"type":"July","content":"DATE"},{"type":"Alex Mashinsky","content":"PERSON"},{"type":"2018","content":"DATE"},{"type":"New York","content":"LOCATION"},{"type":"June","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Mashinsky","content":"PERSON"},{"type":"$10 million","content":"MONEY"}],"hashtag":["Regulations","New York Attorney General","Lawsuit","Celsius","Fraud"],"authors":["Jesse Hamilton"]}