{"summary":"The Diem Association’s top economist provided new insight into how it’s redesigning its stablecoin project and its plans to monetize it.\nHead economist Christian Catalini explained that the Diem stablecoin is intended to be a stand-in for CBDCs.\nDiem will then be monetized as a payments infrastructure wherein CBDCs can integrate with the protocol.","author":["Aislinn Keely","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/103536\/diems-economist-plan-stablecoin-cbdc","publishDate":"2021-05-02T13:51:55","id":1527,"type":null,"title":"Diem&#x27;s chief economist breaks down its plan for a central bank-centric stablecoin network","category":["Startups"],"content":["The Diem Association is giving some insight into how it's redesigning its stablecoin project and its plans to monetize it.","During a conference appearance last week, head economist Christian Catalini explained that the Diem stablecoin project is a stand-in, intended to be phased out when central banks launch their own digital currencies or CBDCs.","\"Our first white paper was extremely naïve,\" said Catalini.","Indeed, under its original name, Libra, the project faced considerable backlash from regulators both stateside and globally. Many worried about the association's connections to Facebook, which bootstrapped the project, while others were concerned about the original design, which touted a stablecoin pegged to a basket of currencies.","With much of the American conversation surrounding stablecoins relating to the U.S. dollar's status as the world's reserve, some policymakers feared that the success of a private, multi-fiat coin could threaten monetary policy and the dollar's supremacy.","Libra went back to the drawing board, <a href=\"https:\/\/www.theblockcrypto.com\/linked\/86342\/libra-diem-stablecoin-rebrand\" data-v-f87c67ca=\"\">rebranding as Diem<\/a> and overhauling the design of the project.","The original design had a number of gaps, but the values and fundamentals behind the project remain the same, according to Catalini. The Diem Association's main goal is to build a cross-border payments structure with a trusted market established around it. Eventually, the goal appears to be to replace Diem's own stablecoin in the system with CBDCs.","\"Diem really sees collaboration with central banks as the future extension of the network,\" said Catalini. \"It just provides a better reserve design and to some extent were initially retrofitting faster digital payment on the legacy rails as a bridge measure until you have a CBDC.\"","Until those CBDCs are launched, the Diem stablecoin will be the means of payment. No longer a basket-pegged token, it will be a 1:1 fiat-backed stablecoin with \"high-quality liquid assets\" to protect against any significant market activity, like interest rate shocks or default of banks that the coin relies on.","This came from feedback from the <a href=\"https:\/\/www.theblockcrypto.com\/linked\/28405\/france-to-create-g7-taskforce-on-cryptocurrency-stablecoin\" data-v-f87c67ca=\"\">G7's report on stablecoins<\/a>, according to Catalini, which recommended that stablecoins be designed to provide redemptions in the event of market shocks. The G7 was vocally against Diem's original plans, vowing to oppose the then-named Libra until it was <a href=\"https:\/\/www.theblockcrypto.com\/linked\/80612\/g7-statement-libra-regulation\" data-v-f87c67ca=\"\">\"adequately\"<\/a> regulated. Two months after those comments, Libra rebranded and became Diem.","The new plan appears to constitute an attempt to assuage the G7's concerns about stablecoins and extreme market situations. The reserve will now hold assets in an amount at least equal to the face value of each stablecoin unit in circulation, according to Catalini's presentation. Those assets will have short-term maturity, low credit risk and high liquidity. The idea is that the Diem peg won't collapse in the case of a major event like the financial crisis of the late 2000s.","The design of the stablecoin is geared towards utilizing crypto infrastructure to reduce friction in the payments system rather than leverage all the capabilities of crypto.&nbsp;","Still, many have <a href=\"https:\/\/www.theblockcrypto.com\/post\/90391\/boe-bailey-governor-facebook-diem\" data-v-f87c67ca=\"\">wondered<\/a> how Diem's business model will function amid this overhaul.","According to the presentation, the association will continue to be a member-run organization with equal voting rights, with no single member maintaining control. Revenue will be made through \"very small\" transaction fees on basic payments, but in the long run, Catalini said Diem could charge higher fees for added value transactions.&nbsp;","In terms of infrastructure, Diem will rely on local institutions to secure the network.&nbsp;More intermediaries could mean higher transaction fees if each player is taking a cut, but Diem is hoping that at scale, competition among intermediaries to facilitate the payments will tamp down the transaction costs to a figure much lower than legacy structures.&nbsp;","Catalini didn't address the timeline of the project during the presentation. Late last year, Facebook's David Marcus said he hoped Diem would launch in 2021, but Catalini didn't indicate whether a launch would occur in the near future.","The project is still awaiting a license from Switzerland's Financial Market Supervisory Authority (FINMA) as a first step. Catalini said he was unsure of the timing of that approval.&nbsp;"],"hashtag":[]}