{"summary":"The agency said for months it couldn’t approve bitcoin ETFs because of market manipulation. Then, in a delicious irony, it was itself manipulated, showing how even non-news can move markets.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/01\/10\/everyone-wants-the-secs-fake-news-to-be-real\/","publishDate":"2024-01-10T17:40:04","id":15275,"type":null,"title":"Everyone Wants the SEC’s Fake News to Be Real","category":["Consensus Magazine"],"content":["In the many months and years that the Securities and Exchange Commission (SEC) has been mulling whether to approve a spot bitcoin ETF in the U.S., it has frequently cited the risk of market manipulation as a reason to be cautious. So, it was highly ironic yesterday that the SEC was itself the victim of that very threat.","A tweet from the SEC’s X (Twitter) account appeared at roughly 4 p.m. ET to say the agency had approved the first application, only for Chair Gary Gensler to shortly say thereafter that the news was untrue and the X account had been hacked.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","\"The @SECGov twitter account was compromised, and an unauthorized tweet was posted,\" Gensler wrote on his personal account. \"The SEC has not approved the listing and trading of spot bitcoin exchange-traded products.\"","Someone, unknown as yet, had gotten hold of the phone number the SEC uses for its account verification and, according to the “Safety” team at X, the SEC did not have two-factor verification on its X.","Crypto Twitter had a field day, with many high-profile commenters pointing out the double standard.","The price of bitcoin (BTC) briefly rose on the news (above $47,500) only to fall before its level at the time of the fake news (below $45,000). There was a flood of liquidations, as CoinDesk reported. This may indicate how a real announcement – expected today – might play market-wise. An exchange-traded fund announcement may be a “sell-the-news” event and the huge price rises we’ve seen in the last few months could be based on excessive expectations for the leading crypto.","Maybe, the SEC’s gaffe proves its point: nascent, unregulated markets are susceptible to malevolent actors. But surely the joke is mostly on the SEC. You would think that the most important financial regulator in the world would be careful enough to double-lock a social media account with so much influence. Wouldn’t you?","Read more: Did the Fake Bitcoin ETF Announcement Prove an SEC Approval Is a 'Sell-the-News' Event? This isn’t the first time fake ETF announcement news has moved markets. Cointelegraph’s erroneous tweet in October also pushed bitcoin higher. Both episodes show the huge pent-up demand for this announcement to break. Many in crypto see billions of dollars coming into the space once institutions like BlackRock and Fidelity, which have applications pending, get firmly into the space. Many see parallels with the introduction of gold ETFs in the early 2000s, which sent the price of gold skyrocketing, at least in the long term.","We’ll know soon enough what the impact is going to be. My guess is that we’ll see a short pump in the price before things settle down again as normalcy sets in. There’s something about expectation being more exciting than reality, and that seems like the case here.","After all, ETFs are just standard investment products, not manna sent from heaven. Once people realize that, we might see a slow uptick in demand and price action for bitcoin, but not a flood of all-time-high milestones. Gold, if you check, didn’t suddenly become a mainstream investment; it took years. And, it’s likely to be the same with bitcoin. Still, the hype around the ETF announcement shows how many people out there want a positive narrative to move bitcoin higher. That, rather than the actual impact of ETFs, may be the important point here. Whatever the fundamentals, there’s huge demand for positive news in crypto after the falls, crashes and scandals of the last 18 months.","Edited by Daniel Kuhn."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"SEC","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"$47,500","content":"MONEY"},{"type":"4 p.m.","content":"TIME"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Gensler","content":"PERSON"},{"type":"$45,000","content":"MONEY"},{"type":"last 18 months","content":"DATE"},{"type":"October","content":"DATE"},{"type":"2000s","content":"DATE"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"}],"hashtag":["Opinion","Bitcoin ETF","Newsletters","The Node"],"authors":["Ben Schiller"]}