{"summary":"Archegos levered a small basket of equities to the moon before it imploded - and took big stocks down with it. Similarly overlooked risks in crypto could leave traders holding the bag.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/04\/29\/wall-streets-latest-market-manipulation-scandal-should-be-a-wake-up-call-for-crypto\/","publishDate":"2022-04-29T18:42:44","id":15280,"type":null,"title":"Wall Street’s Latest ‘Market Manipulation’ Scandal Should Be a Wake-Up Call for Crypto","category":["Consensus Magazine"],"content":["This week saw the dramatic arrest and criminal charging of Bill Hwang, the former manager of the private hedge fund Archegos Capital Management. You may remember that Archegos blew up last March. Banks that had lent it money for huge, leveraged trades wound up losing $10 billion dollars.","There’s a fascinating discussion to be had about whether what Hwang did was full-blown fraud, but I won’t bother trying to outdo Matt Levine on that front. Instead, I want to focus on the financial mechanics of what Archegos was up to, and why it’s extremely important for cryptocurrency holders or traders to understand.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","The nut of it is simple: Archegos borrowed a lot of money and used it to buy very large amounts of roughly 10 different stocks. That buying itself helped push the stocks up, giving Archegos paper profits that it could use to borrow more money – which it then used to buy the same few stocks, pushing them up further. The leverage play produced incredible results for a time: Hwang reportedly launched Archegos with just $200 million in 2013, but by its peak, the fund’s paper value topped $30 billion, a 1,400% return in eight years.","But it was a tactic with a limited shelf life. Archegos over time accumulated utterly absurd positions in several major stocks. According to the U.S. Securities and Exchange Commission (SEC), Archegos came to own as much as 45% of the outstanding shares in Tencent and over 50% of ViacomCBS (now Paramount Global) shares. One of the pillars of the fraud case against Hwang is that he lied to banks about these levels when borrowing money. And the way things played out shows why banks don’t often or willingly lend into this sort of concentration.","ViacomCBS was the pin that popped the Archegos bubble. The stock ran from about $35 in January of 2021 to nearly $95 by March. I’m speculating, but it seems very plausible that Archegos’ own aggressive buying (read: alleged market manipulation) contributed to the insane runup that motivated the sale of new stock. Either way, nearly tripling your money is good!","Except when it’s not. The runup motivated ViacomCBS execs to issue new shares, which in turn deflated the stock, which dropped 30% in three days. With its high levels of concentration and leverage, that 30% drop in a single stock wound up being enough to earn Archegos the world’s worst margin call. With the paper value of its holdings dropping against its outstanding loan obligations, Archegos was forced to liquidate – ultimately nuking the entire fund.","See also: What Does Liquidation Mean and How to Avoid It?","But – and this is the really, really important part – there still wasn’t enough to pay back its lenders.","Archegos shows what might happen to any number of crypto assets that are leveraged or backed in certain ways. The key term here is exit liquidity, and one takeaway is the danger of backing or holdings concentrated in a few assets which can collapse suddenly in a liquidity crisis. In many cryptocurrency ecosystems, token holders are in much the same position as the banks that lent to Hwang: at risk of being trapped in a token as it burns down around them.","I wrote last week about the potential for an unwind of the terraUSD (UST) stablecoin, which by the most generous interpretation is currently “backed” by a single asset, LUNA. The Luna team is working to diversify that backing to avoid the kind of concentrated risk that nuked Hwang, but their current goal would get them all the way up to three different assets by adding BTC and AVAX. Hwang wound up being too fragile while holding closer to 10 big positions.","Another suggestive parallel here is with the mechanics of crypto valuations in general, particularly when it comes to founder rewards, pre-mines or other large pools of tokens held in relatively static blocks. As many have pointed out, the “market cap” metric touted by many tokens is rendered pretty meaningless by these large allocations, which are essentially not on the market, and often never have been. The same might be argued for the lockups in certain lending and staking protocols.","See also: Lex Sokolin: The Fundamentals of Crypto's $2T Market Cap | Opinion","These big blocks of untraded tokens inflate the total market value of coins in a way quite similar to how Archegos inflated its portfolio. Though pre-mine and staking effects are subtler, both create a misleading perception of the scarcity of or demand for an asset. And both, though for different reasons, can lead to retail investors getting their faces ripped off: If you saw ViacomCBS spiking in March of last year and bought in, you wound up being Bill Hwang’s exit liquidity as he torched it from $97 down to $48 in just seven days. You could probably have a very therapeutic chat with a SafeMoon holder.","And let’s not forget the poor banks (heaven forbid!). Credit Suisse, for instance, shouldered the bulk of Archegos lender losses, eating $4.7 billion. That was in turn enough to knock nearly 18% off Credit Suisse’s stock price in a matter of days after Archegos fell. The bank was already troubled before this incident, and its stock has not recovered in the year since.","Bill Hwang may be a criminal, or he may have simply been playing the Wall Street game according to a set of unwritten but accepted rules – after all, in this day and age, cheating and lying are practically qualifications for working in high finance. Crypto has the distinct advantage of transparency – Hwang couldn’t have caused as much damage if he hadn’t concealed his levels of concentration and leverage. In most cases, similar behavior by a layer 1 or other protocol would be much more visible. The question is whether traders and investors are paying enough attention to what’s right there on the blockchain to avoid a replay of Archegos, in crypto form."],"entity":[{"type":"$97","content":"MONEY"},{"type":"Paramount Global)","content":"ORGANIZATION"},{"type":"$95","content":"MONEY"},{"type":"1,400%","content":"PERCENT"},{"type":"$35","content":"MONEY"},{"type":"January of 2021","content":"DATE"},{"type":"$2T","content":"MONEY"},{"type":"$10 billion dollars","content":"MONEY"},{"type":"Lex Sokolin","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Archegos Capital Management","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"30%","content":"PERCENT"},{"type":"$200 million","content":"MONEY"},{"type":"Bill Hwang","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"Hwang","content":"PERSON"},{"type":"Credit Suisse","content":"ORGANIZATION"},{"type":"$4.7 billion","content":"MONEY"},{"type":"45%","content":"PERCENT"},{"type":"$48","content":"MONEY"},{"type":"Tencent","content":"ORGANIZATION"},{"type":"March of last year","content":"DATE"},{"type":"AVAX","content":"ORGANIZATION"},{"type":"18%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Matt Levine","content":"PERSON"},{"type":"Hwang","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"$30 billion","content":"MONEY"}],"hashtag":["Market Manipulation","Fraud","Stock Market","Equities","SEC","Enforcement","Leverage","Opinion","The Node","Newsletters"],"authors":["David Z. Morris"]}