{"summary":"The upgrade is designed to usher in a new era of cheaper fees for the growing array of layer-2 networks that operate on top of Ethereum.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/12\/ethereum-blockchain-counts-down-to-dencun-upgrade-set-to-reduce-fees\/","publishDate":"2024-03-12T15:11:14","id":15283,"type":null,"title":"Ethereum Blockchain Counts Down to 'Dencun' Upgrade, Set to Reduce Fees","category":["Technology"],"content":["Ethereum developers are preparing for Wednesday's much anticipated Dencun upgrade, set to bring the biggest code change to the blockchain in over a year.","Dencun – a portmanteau for the project names Deneb + Cancun – consists of two upgrades happening simultaneously on Ethereum’s consensus and execution layers","Latest News: Ethereum Finalizes 'Dencun' Upgrade, in Landmark Move to Reduce Data Fees","Technically known as a \"hard fork\" in blockchain terminology, it's expected to initiate around 13:55 UTC (9:55 a.m. ET). The upgrade is designed to usher in a new era of cheaper fees for the growing array of auxiliary networks that operate on top of Ethereum, called layer-2 (L2) \"rollups.\" Those changes will come with the activation of a new Ethereum Improvement Proposal (EIP) called “proto-danksharding,” or EIP-4844, which is designed to improve the chain's ability to handle data from L2 networks.","Elements of the Dencun upgrade have been planned for several years, but developers delayed it from an original target of late 2023 due to some engineering concerns. Since then, developers have tested the package on three separate test networks (testnets), and most of those tests ran smoothly. (The first test on Goerli did not finalize for a few hours, but once a bug was patched, things began running smoothly again.)","Some Ethereum fans are marking the occasion of Dencun's official launch by joining watch parties, with the EthStaker developer community and Nethermind, a leading Ethereum infrastructure team, each hosting livestreams.","“We are making sure all our client and bootnodes are fully updated, and ready for fork,” said Barnabas Busa, a DevOps engineer at the Ethereum Foundation. “Our monitoring infrastructure is scaled up to ensure we don’t miss anything important.”","Dencun will be Ethereum's biggest update since April 2023's Shapella upgrade, which enabled withdrawals of staked ether (ETH).","Dencun includes a number of code changes, but the biggest one comes with “proto-danksharding,” which introduces a new method for storing transaction data onto Ethereum, called \"blobs.\"","Layer-2 networks like Arbitrum, Optimism and Polygon will benefit the most from Dencun. The networks help to scale Ethereum by bundling up transactions from users and then passing them to Ethereum where they're settled in big batches. Over the past year, they've become the primary venues for transacting on top of Ethereum, amassing billions of dollars in deposits and consistently boasting higher transaction volumes than the main Ethereum chain.","After Dencun, L2s will be able to post data to Ethereum within the dedicated blobspace, rather than be forced to pay a higher cost for squeezing the data into conventional transactions. In theory, this could help L2s settle more data, more efficiently – thereby reducing fees for end-users.","Proto-danksharding is Ethereum's first swing at \"sharding,\" which is a set of techniques to break up the blockchain into mini-shards (or mini-chains), to process more transactions for cheap.. A fully-formed version of sharding is still years away, but proto-danksharding could help solve some of Ethereum’s high gas fees in the short term by reducing fees for L2 networks.","Proto-danksharding will also benefit a new class of blockchains that have entered the Ethereum fray called data availability (DA) layers. DA layers like Celestia, EigenDA and Avail help networks store large amounts of data; L2s frequently use them to store transaction data. Proto-danksharding could make the costs of downloading DA data cheaper.","Polygon co-founder Jordi Baylina told CoinDesk in an interview previously that “prices should go down mainly because it's a matter of supply and demand. Your supply is bigger, the data availability on Ethereum is going to be bigger, so the price should go lower.\"","“By how much? We don't know, it's difficult to predict,” Baylina added.","After Dencun, Ethereum developers will start to tackle what will go into the next upgrade, now called Electra + Prague (Petra.) As of right now, developers have not decided what will make it into that package, but a strong contender is an upgrade called “Verkle Trees,” which is a new type of data category that should help nodes store large amounts of data.","“Scalability is the fundamental unlock that enables permissionless collaboration between developers across projects and teams,\" said Karl Floersch, CEO of OP Labs, the primary developer firm behind the Optimism network. \"With EIP-4844 and Dencun, devs across the Ethereum ecosystem can more seamlessly build together.”","The upgrade \"will enable a group of loosely coordinated devs to actually build systems that provide overall experiences that will rival the user experiences we’re used to from top-down, centrally planned platforms,” he said.","Read more: Ethereum Fees Set to Drop for Arbitrum, Polygon, Starknet, Base. But How Much?","Currently, the average transactions per second (TPS) figure over the past seven days across layer-2 networks is 93.18, compared to Ethereum's average of 14.42. These figures generate a scaling factor of 8.37x, according to L2Beat data.","A Fidelity report on the upgrade states that layer-2s account for roughly 10% of the total layer-1 fees. That portion is expected to \"drop significantly\" after the upgrade, the money management firm said.","Data from L2fees shows that the average cost of sending ETH on Arbitrum is $0.24 and it costs $0.67 to swap tokens. Optimism's fees are $0.47 and $0.92 respectively whilst Polygon's are $0.78 and $2.85. These figures are expected to fall following the upgrade.","Representatives of the Starknet Foundation, an organization that supports the Starknet chain, issued a press release Tuesday claiming that its users would \"get the highest savings of any layer 2,\" because a \"higher proportion of Starknet fees go on DA than of any other layer-2 fees.\"","The foundation said planned innovations would bring further savings, and that it planned to charge fees \"at future rates, covering the difference until the improvements are in place.\"","Edited by Sam Kessler and Bradley Keoun."],"entity":[{"type":"April 2023","content":"DATE"},{"type":"billions of dollars","content":"MONEY"},{"type":"Polygon","content":"LOCATION"},{"type":"Base","content":"LOCATION"},{"type":"10%","content":"PERCENT"},{"type":"Reduce Data Fees","content":"ORGANIZATION"},{"type":"$2.85","content":"MONEY"},{"type":"Starknet Foundation","content":"ORGANIZATION"},{"type":"Karl Floersch","content":"PERSON"},{"type":"$0.78","content":"MONEY"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Dencun","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Verkle Trees","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Dencun","content":"PERSON"},{"type":"Sam Kessler","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"Cancun","content":"LOCATION"},{"type":"Electra + Prague (Petra","content":"ORGANIZATION"},{"type":"$0.92","content":"MONEY"},{"type":"Barnabas Busa","content":"PERSON"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"9:55 a.m.","content":"TIME"},{"type":"Proto","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"$0.67","content":"MONEY"},{"type":"Goerli","content":"PERSON"},{"type":"Celestia","content":"LOCATION"},{"type":"$0.24","content":"MONEY"},{"type":"$0.47","content":"MONEY"},{"type":"Jordi Baylina","content":"PERSON"},{"type":"Deneb","content":"ORGANIZATION"},{"type":"Dencun","content":"ORGANIZATION"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Ethereum","Dencun","layer 2","Sharding","Rollups","Ether","gas fees","Transaction Fees"],"authors":["Margaux Nijkerk"]}