{"summary":"Google’s cloud-computing business has stored historical data on Bitcoin since 2018, claiming the service provides faster access than can be obtained directly from the blockchain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/09\/22\/google-cloud-pushes-deeper-into-blockchain-data-adding-11-networks-including-polygon\/","publishDate":"2023-09-22T16:42:52","id":15281,"type":null,"title":"Google Cloud Pushes Deeper Into Blockchain Data, Adding 11 Networks Including Polygon","category":["Technology"],"content":["Google’s cloud-computing business is expanding its push into blockchain, adding 11 networks including Polygon, Optimism and Polkadot to its ‘BigQuery’ program for public datasets.","The business, Google Cloud, first published a post in February 2018 announcing that Bitcoin blockchain data was available for exploration through the program. Since then 10 additional networks have been added, including Ethereum, Litecoin and Dogecoin.","BigQuery is a “serverless and cost-effective enterprise data warehouse,” designed for “practitioners of various coding skills,” according to the program’s website.","A key advantage, according to Google Cloud, is that users might be able to retrieve the historical data from an off-chain provider faster than querying the blockchain directly.","Friday's announcement comes as Google Cloud says it's expanding efforts in blockchain despite the industry still being mired in the \"crypto winter\" market malaise.","“Over the past 18 months we’ve been investing in this space, we’ve continued to hire, we’ve continued to grow not only our business development and our go-to-market teams but also our product and engineering capabilities,” James Tromans, global head of Web3, Google Cloud, told CoinDesk TV in an interview last week. “We’re really beginning to show that we’re not just fly-by-night and not just here when the time is going well.”","Other blockchains added recently to the BigQuery program include Avalanche, Arbitrum, Cronos, Ethereum’s Goerli test network; Fantom Opera; NEAR and Tron, according to a press release on Friday.","Google Cloud said it also will improve the Bitcoin BigQuery dataset by adding support for the Ordinals project, which exploded in popularity earlier this year as a way to generate NFTs on the largest and original blockchain network.","The BigQuery program makes historical blockchain data available for exploration, designed to overcome the underlying network’s limited capability for “short time-scale reporting on specific or aggregated money flows stored in the ledger,” according to Google Cloud.","Expanding the program to include more blockchains also has allowed for “multi-chain meta analyses, as well as integration with conventional financial record processing systems,” the company said.","According to the press release, blockchain foundations, Web3 analytics firms, developers and customers are demanding “a more comprehensive view across the crypto landscape, and to be able to query more chains.”","Data queries might focus on the number of NFTs minted across three specific blockchains, fee comparisons between networks or how many active wallets sit atop chains that are compatible with the widely popular Ethereum Virtual Machine (EVM) programming environment."],"entity":[{"type":"James Tromans","content":"PERSON"},{"type":"Arbitrum","content":"LOCATION"},{"type":"Google Cloud","content":"ORGANIZATION"},{"type":"Fantom Opera","content":"LOCATION"},{"type":"Cronos","content":"LOCATION"},{"type":"Ethereum Virtual Machine (EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Litecoin","content":"PERSON"},{"type":"Friday","content":"DATE"},{"type":"February 2018","content":"DATE"}],"hashtag":["Google","Google Cloud","Avalanche","Arbitrum","Cronos","Ethereum","Fantom","Goerli","Near","Polkadot","Polygon","Tron","Bitcoin","Dogecoin"],"authors":["Bradley Keoun"]}