{"summary":"Cryptopia, a New Zealand based crypto exchange, filed for liquidation after suffering a serious hack and failing to recover the stolen assets\nThe exchange stored its customer data with Arizona-based company PNAP, but after liquidation, did not receive satisfactory assurance that the data would remain secure without payment\nCryptopia filed a “Motion for Recognition and Emergency Motion for Provisional Relief,” which the court granted, calling for the exchange to pay PNAP for two months of services in exchange for a temporary restraining order","author":["Stephen D. Palley","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/25344\/liquidation-of-new-zealand-crypto-exchange-reaches-nyc-bankruptcy-court","publishDate":"2019-05-31T12:19:24","id":1528,"type":null,"title":"Liquidation of Cryptopia Reaches NYC Bankruptcy Court","category":["Legal"],"content":["<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by <a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">Nelson Rosario<\/a> and <a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">Stephen Palley<\/a>. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes.<\/em>","As always, Rosario summaries are “NMR” and Palley summaries are “SDP\".","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1] In re Cryptopia Limited (In Liquidation), Chapter 15 Case №19–11688, “Order Granting Emergency Motion for Preliminary Relief”, May 24, 2019 [SDP]<\/strong><\/em>","Motion: https:\/\/www.scribd.com\/document\/411927392\/Cryptopia-Motion","Order: https:\/\/www.scribd.com\/document\/411927394\/Cryptopia-Order","What is an insolvent New Zealand crypto exchange doing in a federal bankruptcy court in New York City? Combine an international clientele, a U.S.-hosted database, and a foreign liquidation proceeding and you apparently get a Chapter 15 bankruptcy proceeding and a federal bankruptcy judge.","Cryptopia was a New Zealand-based digital asset exchange “through which Cryptopia’s millions of account holders traded hundreds of different types of digital assets.” Earlier this year, “Cryptopia suffered a serious hack; the hackers looted some $16 million worth of digital assets owned by various account holders. To date, none of the stolen assets have been recovered.”","According to motion papers filed by Cryptopia’s lawyers, the company was put into “liquidation” proceedings in New Zealand on May 14. Liquidation is similar to bankruptcy but not exactly the same thing. It provides a way for an insolvent company to wind up its business in an orderly fashion, pay off creditors to the extent possible, and do so under judicial supervision.","Under U.S. bankruptcy code, a foreign company that enters something similar to bankruptcy protection in its own country can move for recognition of that foreign proceeding in the U.S. Why would someone do that, you ask? Bankruptcy provides you with certain protections — litigation and asset recovery are stayed, and the bankruptcy court can take steps to protect the bankrupt company’s property. (I am over-simplifying quite a bit, but this is the gist).","In this case, Cryptopia’s customer data is apparently stored “on servers operated by Phoenix NAP LLC (‘PNAP’), a company based in Arizona. In particular, PNAP hosts an SQL (i.e., Structured Query Language) database that contains information about which account holders own which digital assets and in what quantities. Additionally, the PNAP-hosted database contains the most current list of, and contact details for, all of Cryptopia’s account holders.”","Cryptopia says it asked PNAP for assurance that it would not do anything to compromise Cryptopia data but says that it didn’t receive a satisfactory response, with PNAP responding “we will not do anything to your equipment.”","Because a New Zealand judicial proceeding has no authority to order an Arizona company to do, well, anything, Cryptopia filed a “Motion for Recognition and Emergency Motion for Provisional Relief.” The Court granted the Motion on May 24, ordering $274,408.92 to be paid to PNAP for services for May and June 2019 as security for entry of a temporary restraining order.","For readers interested in the ins and outs of New Zealand liquidation proceedings, the Motion papers filed by Cryptopia’s lawyers are an interesting read (and you can find a link to that above). Also interesting is the fact that (per these papers) most of the account holders at Cryptopia were located outside of New Zealand. In fact, “Based on transactions in November and December 2018, trades involving U.S.-based account holders generated the majority of Cryptopia’s revenues.”","<em data-v-f87c67ca=\"\">The Block is pleased to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given The Block permission to republish their commentary and analysis in full. Part I of this week's analysis, Crypto Caselaw Minute, is above.<\/em>"],"hashtag":[]}