{"summary":"Ashley Rindsberg – a speaker at CoinDesk's Consensus festival – argues that the New York Times has a track-record of dangerous misreporting. Is \"DeMe\" the answer to what skews to the media?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/24\/decentralized-media-web3-news-reporting\/","publishDate":"2023-03-24T16:29:34","id":15286,"type":null,"title":"Decentralized Media Via Web3: A Solution to Bias and Trust Issues in News?","category":["Consensus Magazine"],"content":["Traditional media has problems. Almost no one will dispute this. For over a decade, the publishing industry has struggled to eke out profits, keep pace with new technologies and stick an IV into dying newsrooms. Local news has been gutted. Newspapers are an endangered species.","Ashley Rindsberg agrees that news media has problems, but he points to an unexpected and even shocking culprit: the New York Times. He lobbed a grenade to the nation’s flagship paper with his book, \"The Gray Lady Winked: How the New York Times's Misreporting, Distortions and Fabrications Radically Alter History,\" accusing the paper of decades of bias and wrongdoings.","Ashley Rindsberg is a speaker at CoinDesk's Consensus festival in April.","The Times was “unabashedly pro-Hitler in The Thirties, serving as a sturdy fount of Dr. Goebbels propaganda” and was “unabashedly pro-Stalin in its coverage of the famine in Ukraine,” writes Rindsberg in “The Gray Lady Winked,” who then elaborates on a series of charges. “You've got a single family in control of this newspaper for 120 years,” Rindsberg said to me in a recent interview. “It's a dynasty. Their interests and their incentives are so misaligned from their reader's interests.”","I’ll admit I’m a skeptic; like most journalists I enjoy and regularly read the New York Times. I’ve written for the paper. I’m hardly unbiased. (And to be more explicit, these allegations are not ones I personally endorse.) But whatever you think of Rindsberg’s specific allegations of the paper, there’s common ground in the idea that, generally speaking, there are fundamental problems in publishing that no one has figured out how to crack.","Read more: Dan Kuhn - Decentralized Social Media – Has the Moment Come?","Rindsberg proposes a solution: Decentralized Media, or “DeMe.” What if citizen journalists were empowered and incentivized to fact-check, do more analysis and make sense of raw data and the world? Rindsberg suspects Web3 could fuel this. “The technological solution is definitely primed for blockchain,” says Rindsberg. “To create a chain of custody for facts, claims and sourcing.”","We might not agree on everything, but the two of us had a lively and respectful conversation about his critique of the New York Times, the structural problems with the space, his vision for decentralized media,and why he thinks that traditional publishing is “optimizing not for objectivity and not for ideals, but for results, page views, clicks and subscriptions.”","Interview has been condensed and lightly edited for clarity.","When you dug into your research for the book, what surprised you most?","On a general note, it was how willful and obvious some of this stuff was. I hadn’t expected that. They had a Nazi sympathizer running their Berlin bureau in World War II, and they knew it.","Or the gushing praise of the Berlin Olympics, which was this bonanza of racism and antisemitism, and the New York Times is calling it the greatest sporting event in history. That was really unexpected.","Or partnering and collaborating with the Department of War during World War II; when [the U.S.] dropped the atomic bomb on Japan, [The Times] just carried the line, the propaganda that there was no radiation poisoning.","This is a two-part question. Tackle it however you’d like. Do you view these issues at the New York Times as an example of problems that are rampant throughout all mainstream publications? Or maybe this is less about the Times and more about newspapers in general?","And the related question – can you point to another mainstream newspaper that has a better track record? Maybe if you look hard enough, and over a long enough timeframe, you’ll spot problems everywhere.","I think it’s both, in a way. There are some mechanical errors that you see, like when sourcing doesn’t actually have a source, and you see that everywhere. But the New York Times is just bigger, so in a sense it all gets magnified.","But then there’s the ownership structure. You've got a single family in control of this newspaper for 120 years. It's a dynasty. Their interests and their incentives are so misaligned from their reader's interests and what their own reporters' interests and incentives might be, that the divergence is really stark.","Read more: Marta Belcher: Reframing Privacy for the Digital Age","Sometimes people ask me, \"If the New York Times did all this crazy stuff, how come they were able to retain this number-one spot in news?” My response is that it was because they did these things that they stayed number one. It was because they had a pro-Nazi journalist in Berlin in 1939 that they got unbelievable access to Nazi sources that got them the best scoops. There are many examples like this.","So, who's done it better than the Times? I don't know that there's anyone, in a general sense, who's done better. I know that for the book I would frequently go back to look at the Washington Post reporting on the same issue at the same time, just to compare. And the Post was generally pretty sane and commonsensical on most of these topics.","By the way, I should cop to some bias here, in that I sometimes write for the New York Times and of course I read the New York Times and I generally quite like the New York Times.","Oh, I read the New York Times every day. I’m still a subscriber. And if they were ever to ask me to write for them – I don't think it's gonna happen – but I would say yes.","[Both laugh.]","But I think you have to make a distinction between the New York Times’ ownership, which can make disastrous decisions – and forcing those decisions on the newsrooms – and the New York Times’ reporters and journalists, who are doing good stuff, sometimes great stuff.","Let’s widen the lens. How would you summarize the problems with journalism right now?","I think the media talks a lot lately about what they call the trust crisis. We’re seeing all-time lows in trust in media.","But this puts the onus on the readers or on the audience. It is in fact a reliability crisis. It's that we are seeing media operate in ways that do not earn our trust because they're not acting reliably.","Read more: Senator Cynthia 'Crypto Queen' Lummis: Lack of Laws Pushing Industry Overseas","On a more mechanical level, that means using bad tactics like bad sourcing or selective sourcing or the bias of omission or the bias of commission. They're increasingly doing this to advance an agenda – and that could be financial, it could be political or they are doing it to advance a thesis. With journalists, the temptation is always there, right? You come in with a hunch, you come in with a great idea. But as the standard of objectivity is loosened in the news media, these types of practices are encroaching on neutrality, and disinterestedness, and dispassionateness.","And part of the problem is media concentration. We have basically 90% of the news media in the hands of six companies. That adds fuel to the fire because we are optimizing not for objectivity and not for ideals but for results, page views, clicks, and subscriptions. These conglomerates obviously have an overweening financial objective. They have a fiduciary responsibility to their shareholders. And that means the news organization has to deliver, come what may.","As a solution for all this, you’ve proposed Decentralized Media, or DeMe. First off, how do you pronounce that? “Dee-Mee?”","Yeah, Dee-Mee, I guess so. I’ve never said it out loud before.","We just made history. Love it. Let’s talk about DeMe. How do you envision decentralized media as a path forward?","I think the turning point, or at least a signal flashing at the turning point, was FTX and [Sam Bankman-Fried].","I wrote a piece about this for Tablet Magazine. If you look at the coverage of SBF in the prestige media, it’s just the same four tropes, right? Disheveled, genius, altruist, pioneer. And it was gushing, even from the people who are usually extremely skeptical. That went on for two years.","And of course there was the financial involvement of SBF and FTX. In the news media, they're advertising like crazy. They're doing full-page ads in the New Yorker. They’re giving $5 million to ProPublica.","Was it necessarily this exchange of goods? I wouldn’t go that far, but it's gonna influence you. It's gonna influence reporting. Either way, we get the myth of SBF. It took two years to build it. And it took two days to burst it.","And that was done through pretty much two, maybe three outlets: CoinDesk, Richard Chen on Twitter and possibly a Substack account or two. That's decentralized media. I mean, CoinDesk is closer to centralized media, but it's carrying the themes of decentralization.","Then the information was spreading on social media before it ever hit the news media. I think that's the key point. The story was already broken before it got to the New York Times.","Do you see this as a tipping point for DeMe?","Maybe it’s not a tipping point but it's a real indicator of change. What does decentralized media look like in the future? I think it's a lot about changing how we understand reporting. From narrative editorial to something much closer to data interpretation and visualization, but interpretation by the audience. To say, “Here’s the raw data, and here’s the structured data, you audience members gather together on a topic of interest and generate the visualizations. You draw your own interpretations and conclusions from the raw data and put it out into the world in social media.”","Would it replace traditional media, in your view?","I don’t think it’s going to replace, but it's going to be additive. And we're already seeing it happen in real time. We're seeing people trading charts and graphs on social media about important topics and debating it. So, I think that is the future.","Read more: Decentralized Social Media Project Nostr's Damus Gets Listed on Apple App Store","And then there’s what I’m doing with this company that I’m building, called Alitheum, which is giving people the power to understand the reliability of any piece of news media. To take an article or a paragraph and then understand how much bias it has. That’s also the piece of this puzzle – decentralizing media by giving people the power to decide for themselves.","So then you don't have to say, \"The New York Times is not reliable.” I never have to come to that conclusion. I can say, \"Oh, this article meets my reliability standards but that one doesn't, and I don't need to throw the baby out with the bathwater.\" This boosts my trust level with the New York Times because I verify. That’s something we constantly see in Web3, that trust is one thing but verification is another. Don't just trust, verify.","How does Web3 and blockchain fit into this?","The technological solution is definitely primed for blockchain. To create a chain of custody for facts, claims and sourcing. That’s one of the biggest problems; a New York Times article could link back to its source, but you don't know where the next layer goes and where did that source get it from? And if you go back far enough, did it come from some incredibly dodgy or racist?","So to be able to create that chain of custody, I think that's incredibly important. To be able to validate that people are who they say they are. Or that a journalist has validation that [information] really did come from a certain person. But I think there's also a verification of reliability.","What do you mean by that?","At Alitheum, we’re putting articles into a system where it can say something like, “It used named sources eight times and unnamed sources two times, and it only used a false source once. So we get a rating of 76%, and here’s why.” Or we can look at tonality and how inflammatory or biased the language is.","I'm working with a professor in Zurich who is developing very reliable computational models to measure bias in news. You feed an article into the [artificial intelligence] and it will tell you how much bias is in the article.","I think Web3 will all play another role in this, which is about bringing events on-chain, and turning events into data. That's really what it's about.","Can you give an example?","So, what Citizen does for monitoring crime, right? If there's a crime in your neighborhood, you get a ping. That’s already gone half the distance. Then go a little bit further and say, \"OK, bring that data on-chain. Now it is actually verified.\" You can bring it from multiple sources and multiple nodes the way that Chainlink does. Now we have an event that has been turned into data in a way that is verifiable and also that is decentralized, so it's not coming from a single source.","This is such an interesting model. But what about the fact that so many people – including me in many contexts – are just really, really lazy? And they don’t want to spend the time to crunch numbers or analyze data.","Yeah, I think there's some kind of an in-between. You have the Substack model, where you’ve got people who independently say, “I want to cover stories of the Southeast Denver metro beat, which has disappeared completely from the local news because they can’t afford it.” But if every time you want to report on some small or mid-level crime, it’s going to take you the whole day to do the story.","But if you're able to go source the data from your desk and then turn it into a visualization, then you become something like a Substacker\/influencer. What we need is a way of gathering information for you, as a single individual, to create meaningful content to feed the audience with relevant stories. This is not about you going to interview four policemen and the victim; that’s not possible with any single individual. You can't do that. So this is a way of solving the supply side [of data] of this news media ecosystem, where we have independent individual creators or journalists.","And there’s also a model where those types of people start to clump together. Like the way that Bari Weiss has done with her Substack. Maybe it's not just you focusing on Southeast Denver, maybe it’s you and a small group, and it’s not just Denver crime but also Denver sports and Denver business. But it's all based in data. It's not about you pounding pavement, it's about you pounding data.","What are the incentives for this? How do you incentivize fact-checking, proper sourcing, and doing the often-tedious work of good journalism?","I think in the short and medium term it’s something like the Substack model. In the case of consumer journalism, it’s not that people will pay a huge price but they’ll pay a price because it’s vitally important to their interests.","And there are models that could even support fact checking. If you’re able to verify a fact in a story, then a way to reward that would be through rewarding tokens. I think that's a fantastic way to do it.","Let me ask you a very boomer question. It’s true that data visualization is compelling and important. But isn’t there journalism that requires a certain amount of experience, expertise and even art?","A nuanced and layered profile piece, for example. It’s hard to see how this is done in a decentralized manner or just by using verified on-chain data. Wouldn’t we lose something by not having this? (And once again, I’ll admit some bias here!)","No, no, that's a good question. I mean, when we had online news it didn’t kill off television news. And television news didn’t kill off the radio. It actually kind of created a renaissance for radio or audio-based reporting.","So I think it is not about replacing, it's about adding to and creating a more robust and more complete media ecosystem.","But I think when you look at something that is very prone to error, even if it’s on the “human” side of the spectrum, like in a battle where you’ve got the fog of war, nobody's able to make sense of what's happening. A journalist who’s cowering behind a rock trying to figure it out has zero chance. How do you piece together what actually happened without making a significant error?","What if with the internet-of-things, with sensors, with geolocation you’re able to track troop movements and then pull that data together and assemble it into a picture of what actually happened in that battle? You don’t have the fog of war, you have the clarity of data. I think the internet of things will be such an important part of that. This may enrich some of the more traditional, narrative-based reporting as well.","Predictions for what news will look like in, say, five or 10 years?","In five years, we're going to be seeing a lot more visualized data, a lot more charts and graphs. We had this spike of interest in data journalism with Nate Silver [founder of Five-Thirty-Eight], and it kind of got absorbed into the larger field. I think that's going to rise again in a much more significant way.","And not just for politics. We're seeing that in sports now, where it’s becoming more data-driven. The [general managers] of sports teams are now data scientists. But on the media side and on the reporting side, it’s still “this player sucks or this player is great.” People will want to understand the data as a first resort, not the last resort of analysis.","And in 10 years?","It will be about connecting the offline world to the online world. Such as using sensors. And I think that's probably going to involve Web3 and blockchain in some significant way, so that in an automated fashion we can show that a certain chain of custody is not broken, or that we understand that events have been verified because of the way that they were brought on-chain. And lots of on-chain data will be analyzed as a kind of news. How that will look, exactly, I’m very curious to see.","You and me both. Thanks for your time and see you at Consensus."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"Richard Chen","content":"PERSON"},{"type":"Southeast Denver","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"76%","content":"PERCENT"},{"type":"Marta Belcher","content":"PERSON"},{"type":"Thirty","content":"DATE"},{"type":"Berlin Olympics","content":"LOCATION"},{"type":"Denver","content":"LOCATION"},{"type":"Berlin","content":"LOCATION"},{"type":"Nate Silver","content":"PERSON"},{"type":"Department of War","content":"ORGANIZATION"},{"type":"Dee-Mee","content":"PERSON"},{"type":"CoinDesk's Consensus festival","content":"ORGANIZATION"},{"type":"1939","content":"DATE"},{"type":"Zurich","content":"LOCATION"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Fabrications Radically Alter History","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"Bari Weiss","content":"PERSON"},{"type":"SBF","content":"ORGANIZATION"},{"type":"$5 million","content":"MONEY"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Washington","content":"LOCATION"},{"type":"Dan Kuhn","content":"PERSON"},{"type":"New Yorker","content":"LOCATION"},{"type":"Apple App Store","content":"ORGANIZATION"},{"type":"Cynthia","content":"PERSON"},{"type":"Crypto Queen","content":"PERSON"},{"type":"Dee","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Decentralized Social Media Project Nostr","content":"ORGANIZATION"},{"type":"Japan","content":"LOCATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Tablet Magazine","content":"ORGANIZATION"},{"type":"Times","content":"ORGANIZATION"},{"type":"Goebbels","content":"PERSON"},{"type":"Ashley Rindsberg","content":"PERSON"},{"type":"Rindsberg","content":"PERSON"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Consensus","Media","News","Interview","Opinion","New York Times"],"authors":["Jeff Wilser"]}