{"summary":"This first testnet dress rehearsal sets the stage for Ethereum’s pending transition to proof-of-stake.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2022\/06\/08\/ethereums-ropsten-testnet-merge-imminent\/","publishDate":"2022-06-08T16:00:48","id":15282,"type":null,"title":"Ethereum’s Ropsten Testnet Has Completed Its Merge","category":["Technology"],"content":["The Ethereum blockchain’s first dress rehearsal for its upcoming Merge was successfully completed Wednesday.","The Ropsten test network (testnet) successfully merged its proof-of-work execution layer with the Beacon Chain proof-of-stake consensus chain – a process identical to the one that the main Ethereum network will undergo in just a few months (if all goes well).","The Merge is a long-awaited milestone in Ethereum’s journey toward a new proof-of-stake (PoS) consensus mechanism. Currently, Ethereum depends on proof-of-work (PoW), whereby miners expend energy to discover new blocks and add them to the blockchain, earning newly issued ether (ETH) and a portion of the transaction fees and tips. Once Ethereum shifts from PoW to PoS, validators who have staked the required 32 ETH will take over the role of adding new blocks to the blockchain.","Read more: Everything You Need to Know About Ethereum 2.0","Currently, the Beacon Chain runs in parallel with the current PoW chain. The Beacon Chain is the PoS coordination chain that already has validators creating and validating new blocks in tandem with the PoW execution chain. Once the PoS chain has been adequately tested and secured, the two chains will merge and Ethereum will continue as a PoS blockchain.","The complexity of such a change to Ethereum’s code requires multiple tests on various testnets. Ropsten’s merge is the first test of its kind, and its outcome will help to inform developers’ future steps as they proceed toward the real Merge on mainnet.","Other testnet merges on Goerli and Seoplia are expected to happen in the coming months.","Read more: Merge Testing on Ethereum: What Is It and Why Does It Matter?","The price of ETH has risen by 1.98% over the past 24-hours.","RESOURCES:","Ethereum Merge Takes Place on Kiln Testnet","Ethereum on Track for Testnet Merge in June","Merge Ahead: Ethereum’s Dress Rehearsal (and a Hiccup)","Ethereum Blog: Ropsten TTD Announcement"],"entity":[{"type":"Track for Testnet Merge","content":"ORGANIZATION"},{"type":"Ethereum Merge Takes Place","content":"ORGANIZATION"},{"type":"June","content":"DATE"},{"type":"Seoplia","content":"LOCATION"},{"type":"Wednesday","content":"DATE"},{"type":"Beacon Chain","content":"ORGANIZATION"},{"type":"1.98%","content":"PERCENT"},{"type":"Ethereum","content":"PERSON"},{"type":"Goerli","content":"ORGANIZATION"},{"type":"Ropsten TTD","content":"ORGANIZATION"}],"hashtag":["ETH","Ethereum","Ropsten","The Merge"],"authors":["Christie Harkin"]}