{"summary":"This blockchain-based app's users must purchase a \"virtual sneaker\" NFT to earn crypto rewards. Consumer advisory: They start at around $800.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/05\/11\/stepns-move-to-earn-model-has-crypto-analysts-seeing-value-in-long-run\/","publishDate":"2022-05-11T09:30:00","id":15288,"type":null,"title":"Stepn’s ‘Move-to-Earn’ Model Has Crypto Analysts Seeing Value in the Long Run","category":["Markets"],"content":["Stepn, a \"move-to-earn\" application on the Solana blockchain that allows users to get cryptocurrency rewards from walking or jogging, is getting traction in digital-asset markets.","The fitness app has grown to more than 300,000 daily active users in a few months.","And Stepn's native token, green metaverse token (GMT), is changing hands at around $2.20, roughly 17 times where it started trading at in March, although it has retreated from its all-time high of about $4.11 last month.","“This actually has value in the long run,” said Will McEvoy, senior associate at the independent investment research firm Fundstrat. “Price stability is important because if the price were to fluctuate 50% a week, it would incentivize users to pull out.”","The project is burning up the track so much in real life that there’s a waiting list to join its Telegram group, which has more than 200,000 members already. Users have to be sent an invite to join the app, and the STEPN team has limited the number of activation codes available. Users can get the codes from Telegram groups, Discord chats and other STEPN online communities. Each day the company issues 3,000 joining codes.","An NFT (non-fungible token) sneaker is a virtual sneaker that users purchase on the STEPN marketplace in order to start earning crypto by either walking, jogging or running. The app tracks users' movements similar to how a Fitbit does. The current starting price of a sneaker, which is denominated in SOL, the native token of Solana, is around 12 SOL ($803). The price of the virtual sneakers varies depending on earning levels, the better the quality, the more benefits offered.","Sales volumes for the NFT sneakers have also been growing significantly. According to data from Delphi Digital, sales reached a high of $57 million daily and have dominated most of Solana’s NFT trading volume.","Delphi Digital notes in its report on Stepn that this volume drives significant fees to the app, because it charges a 6% fee (2% trading fee, 4% royalty fee) for every sale on its marketplace.","“The high fees have been earning the team around $2 to $3 million daily at current volumes, with their cumulative fees earned from Feb. 1-April 30 estimated to be $68.2 million,” the report said.","Mohammad Noor, a freelance virtual assistant based in Bangladesh, India, said he heard about Stepn on YouTube and was attracted to the app because he saw it as a good side hustle that could also improve his health.","“Jogging is essential to me and now I earn money to do it,” Noor, 35, said in an interview with CoinDesk. He said he earns around $75 a day from jogging twice a day for 30 minutes each time.","According to the company’s white paper, players can choose to lease or sell their NFT sneakers on the in-app marketplace; users’ earnings are stored in the in-app wallet, which has a built-in swap function.","Noor bought his first pair of sneakers for 10.8 SOL ($70) and said that they are now worth 20 SOL. He thinks Stepn has a bright future because the app is earning money from users in more than just one way – minting shoes, selling shoes and from refilling users' energy.","“It seems that the developers learnt lessons from other play-to-earn projects that failed,” Noor said.","Stepn is similar to so-called play-to-earn (p2e) games where players can earn cryptocurrency rewards from playing video games in the sense that users partake in an activity and earn a passive income from it. According to McEvoy, however, Stepn has a much longer trajectory than p2e games like Axie Infinity.","The app has repurposed the p2e model with a lifestyle and fitness peg that encourages users to exercise. Get off the couch, in other words.","“The runway for Stepn is much longer than the runway of Axie,” McEvoy said. “This is because the total addressable market of people who would use Stepn is bigger than those who would use Axie.","“Over a billion people walk, and half a billion use fitness tracking apps on their smartphones. There you have 500 million people that this makes sense for,” McEvoy said.","The green metaverse token can be used to repair, unlock and level up your sneakers. It can also be minted.","One issue with betting on the GMT tokens, according to Fundstrat’s analysts, is that they can be difficult to value.","Although they have a limited supply of 6 billion tokens, the Stepn developers can change the rules of the game.","“In a sense the Stepn developers play the role of a central bank, pulling demand-side levers that either support asset prices or cool them off, much like the Fed,” McEvoy said. “This makes it difficult to predict how the token will play out.”","Already, the developers have changed the amount of GMT required for in-game upgrades. Increasing the amount of GMT needed to level up users' sneakers boosts demand for the tokens.","GMT gets burnt when spent on level ups within the game, which decreases the overall supply of the token.","“This type of change should have a positive impact on price and needs to be considered when valuing GMT,” McEvoy said.","On April 28, the price of GMT reached its all-time high of $9.08, according to data from CoinMarketCap, and is down 58% since then.","STEPN developers soon pushed an update to the game that substituted green satoshi tokens (GST) for GMT as the token required for minting new NFTs, temporarily.","GST is a utility token that can be used to purchase goods in the app. It has an unlimited supply and can be minted in the game through basic movements.","This decreased demand for GST as a result of the developers' change cooled off the price and increased demand for GMT.","According to McEvoy, these kinds of updates from the development team provide a level of price stability that should contribute to the overall sustainability and longevity of the app.","The downside is that increasing NFT prices means fewer potential users can afford the app. Striking a balance between the price of GST, GMT and the NFTs will be crucial, he said."],"entity":[{"type":"$75","content":"MONEY"},{"type":"$57 million","content":"MONEY"},{"type":"6%","content":"PERCENT"},{"type":"Bangladesh","content":"LOCATION"},{"type":"Feb. 1","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"4%","content":"PERCENT"},{"type":"$68.2 million","content":"MONEY"},{"type":"$2.20","content":"MONEY"},{"type":"GMT","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"$803","content":"MONEY"},{"type":"$2","content":"MONEY"},{"type":"McEvoy","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"April 28","content":"DATE"},{"type":"$9.08","content":"MONEY"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"$4.11","content":"MONEY"},{"type":"Solana’s NFT","content":"ORGANIZATION"},{"type":"McEvoy","content":"PERSON"},{"type":"$3 million","content":"MONEY"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Stepn","content":"PERSON"},{"type":"April 30","content":"DATE"},{"type":"March","content":"DATE"},{"type":"6 billion","content":"MONEY"},{"type":"58%","content":"PERCENT"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"India","content":"LOCATION"},{"type":"Will McEvoy","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"$70","content":"MONEY"}],"hashtag":["NFTs","Solana"],"authors":["Lyllah Ledesma"]}