{"summary":"In response to the wide spread attack, Twitter appears to have disabled the ability to share strings of numbers and letters on its site.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/71876\/twitter-crypto-address-posts","publishDate":"2020-07-16T10:01:44","id":1529,"type":null,"title":"Twitter to restrict content containing Cryptocurrency Addresses","category":["BITCOIN"],"content":["Twitter appears to have disabled the ability to share strings of numbers and letters on its site following a wide-spread attack Wednesday that resulted in the posting of bitcoin giveaway scams from accounts owned by major figures like Joe Biden and Bill Gates, among many others.","The move is likely aimed at preventing would-be fraudsters from sharing cryptocurrency addresses — made up of a random string of letters and numbers — in a bid to solicit cryptocurrency from victims. Wednesday's breach resulted in Twitter users sending more than $100,000 to the same bitcoin address shared by compromised accounts, all of which promised outside rewards for those who sent funds.","At the time of publication, tests conducted by The Block Research show litecoin, XRP, monero, bitcoin and ethereuem addresses are unable to be shared.","","","&nbsp;","Trying to share such an address populates the following message:","“This request looks like it might be automated. To protect our users from spam and other malicious activity, we can’t complete this action right now. Please try again later.”","Indeed, at least one popular account known for sharing address information — WhaleAlerts — has now said that it can't post its messages to Twitter.","ℹ️ Due to anti-hack measures taken by Twitter the Whale Alert bot can no longer post any transfers and we cannot manually add them either. We hope Twitter will resolve the issue soon. Transfers are still being posted to our Telegram channel: <a href=\"https:\/\/t.co\/vVRNZuovHX\" data-v-f87c67ca=\"\">https:\/\/t.co\/vVRNZuovHX<\/a>","<script async=\"async\" src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\" data-v-f87c67ca=\"\"><\/script>","As previously reported, Twitter has blamed a \"coordinated social engineering attack\" on yesterday's platform crisis, pursued by attackers \"who successfully targeted some of our employees with access to internal systems and tools.\"","\"We know they used this access to take control of many highly-visible (including verified) accounts and Tweet on their behalf. We’re looking into what other malicious activity they may have conducted or information they may have accessed and will share more here as we have it,\" the company's support account explained late Wednesday.","The Block has reached out to Twitter about the inability to post crypto addresses and will update this piece if they provide more information.&nbsp;&nbsp;","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"$100,000","content":"MONEY"},{"type":"late Wednesday","content":"DATE"},{"type":"Bill Gates","content":"PERSON"},{"type":"The Block Research","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Wednesday","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"Whale Alert bot","content":"ORGANIZATION"}],"hashtag":["TWITTER"],"authors":["Frank Chaparro","The Block"]}