{"summary":"The DOJ said Tornado Cash was a money transmitting business, among other details.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/04\/27\/doj-disputes-roman-storms-characterization-of-tornado-cash-operations-in-new-filing\/","publishDate":"2024-04-27T03:44:58","id":15297,"type":null,"title":"DOJ Disputes Roman Storm's Characterization of Tornado Cash Operations in New Filing","category":["Policy"],"content":["The U.S. Department of Justice rebuffed Tornado Cash developer Roman Storm's motion to dismiss criminal charges on Friday, saying the defense filing presented disputed facts that a jury should weigh in on, rather than arguments that fit an early-stage motion.","The DOJ charged Storm, alongside fellow developer Roman Semenov, with conspiring to commit money laundering, conspiring to operate an unlicensed money transmitter and conspiring to violate sanctions law by creating and operating Tornado Cash, a crypto mixing service designed to anonymize transactions. North Korea's Lazarus Group and other criminal entities have laundered funds through Tornado Cash, U.S. authorities have alleged.","Storm's attorneys moved to dismiss the indictment at the end of March, arguing that Tornado Cash is not a custodial mixing service – and doesn't fit the definition of a \"financial institution\" – and that Storm was not able to control the service or block Lazarus and similar groups from using it.","Merely developing code for the project isn't the same as operating a money laundering entity, the defense argued.","In Friday's filing, the DOJ disputed how the defense characterized Tornado Cash, saying it was announced in 2019 as a mixer and the overall service includes a website, user interface, a combination of smart contracts and a \"network of 'relayers.'\"","\"The defendant cannot obtain dismissal of the Indictment by simply making factual assertions about his own contested view as to how the Tornado Cash service operated and based on his own self-serving version of his intent or lack thereof when taking certain acts,\" Friday's filing said.","The DOJ also disputed Storm's assertions about how the Tornado Cash interface worked and how much control individual users might have over the deposit and withdrawal process, providing screenshots. The filing also argues that Storm and his co-founders maintained control over the mixer, at least during the time period the DOJ is referring to in its charging document (2019 to August 2022).","The filing makes repeated references to evidence the DOJ expects to introduce during trial, addressing how Storm and other Tornado Cash founders built and developed the system, how people used Tornado Cash and other details.","Storm is set to go on trial this September, while Semenov remains at large.","Read more: Tornado Cash Dev Roman Storm Moves to Dismiss Indictment Over Crypto-Laundering Allegations"],"entity":[{"type":"Lazarus","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"August 2022","content":"DATE"},{"type":"North Korea","content":"LOCATION"},{"type":"Lazarus Group","content":"ORGANIZATION"},{"type":"2019","content":"DATE"},{"type":"U.S. Department of Justice","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"September","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Roman Semenov","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"Semenov","content":"PERSON"}],"hashtag":["Regulations","Roman storm","Tornado Cash","U.S. Department of Justice"],"authors":["Nikhilesh De"]}