{"summary":"The White House published six reports and a framework. Here’s what they said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2022\/09\/22\/heres-whats-in-the-white-houses-crypto-reports\/","publishDate":"2022-09-22T16:05:00","id":15298,"type":null,"title":"Here’s What’s In the White House’s Crypto Reports","category":["Policy"],"content":["The White House published a number of reports filed by federal departments in response to President Joe Biden’s executive order on crypto. I read through the nearly 300 pages so you don’t have to. What follows are the highlights.","You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions.","We’re starting to see some real results from U.S. President Joe Biden’s executive order on crypto, which he signed in March. The White House, Treasury, Commerce and Justice departments published a total of seven documents on Friday in response to the order, looking at everything from crypto’s role in illicit finance to analyzing the different considerations around a central bank digital currency.","The reports came out more or less simultaneously. Reporters were able to join a press call previewing some of the reports, but they were all live by Friday.","At first glance, these reports seem to be interesting but not especially promising in terms of concrete action. They’re largely summaries of past events, analyses of ongoing research or recommendations for future action with no timeline or commitment. However, this does indicate real progress in terms of how the federal government is approaching cryptocurrencies and regulation. The curious emphasis on central bank digital currencies (CBDC) aside, there is a lot that the crypto industry should be paying attention to in the different reports.","There is a lot to unpack in the reports published last week. I’m just going to take them in turn, highlighting whatever sticks out to me in particular.","The White House published what it described as the “first-ever comprehensive framework for responsible development of digital assets.” As others have pointed out, the term “framework” is perhaps a bit generous; it’s full of hedges and “will considers,” rather than any specific concrete actions that we can see the administration take.","That being said, there are a lot of tidbits that, if the White House does follow through, will dramatically reshape how crypto companies operate in the U.S.","The biggest thing to me, and we’ll revisit this in one of the Treasury reports, is the idea that the U.S. would consider a “federal framework to regulate nonbank payment providers.”","Depending on whether or not crypto exchanges are nonbank payment providers, this clause could hint that there may soon be a federal regulatory framework. One long-running hope for the industry is that the U.S. might adopt a framework that would allow crypto companies to seek a federal license allowing them to provide services nationwide, rather than having to seek 49 different state licenses to operate in that state alone.","To its credit, the fact sheet does provide a comprehensive view at the different issues the Biden administration is considering, and does lay out what the different federal agencies are expected to do in future.","The Justice Department has a clear, enforcement-focused view in its report. The first part looks at crypto’s role in illicit finance, noting that “cryptocurrency is also the payment method of choice for ransomware and other digital extortion activities.” Crypto is also used by terrorists, though to a lesser extent than traditional financial tools. There's not a lot that’s new here. It’s mostly just recapping for those who don’t follow Justice’s activities in the crypto space.","Part of the report continues in this vein, analyzing crypto’s use in various criminal activity types and contrasting to fiat use. The Drug Enforcement Agency, U.S. Marshals Service, Department of Homeland Security and U.S. Secret Service have all played roles, according to the report.","The more notable aspect may be the “Digital Asset Coordinators” network (or DAC), a group of 150 federal prosecutors nationwide who will specialize in crypto crimes.","“The report also addresses the Executive Order’s request for recommendations on appropriate regulatory and legislative actions. It proposes actions designed to enhance law enforcement’s ability to gather evidence and initiate prosecutions; strengthen certain laws and penalty provisions that play an important role in digital asset prosecutions; support regulations that would enhance customer-identification efforts and other anti-money-laundering requirements under the Bank Secrecy Act; and ensure that law enforcement and regulatory agencies have adequate resources to conduct the technologically sophisticated investigations inherent in the digital assets space,” an accompanying press release said.","Justice is recommending three proposals: applying a law that prohibits financial institution employees from “tipping off suspects to ongoing investigations” to crypto companies; strengthening laws making it illegal to operate an unlicensed money transmitter; and lengthening the statute of limitations for certain crypto crimes.","The Commerce Department’s report purportedly looked at how the U.S. could remain competitive in the digital asset sector. Broadly, its conclusions call for “effective regulatory approaches,” international and public-private engagement, and more technological research and development.","“To that end, federal departments and agencies should continue to engage internationally to promote development of digital asset policies and CBDC technologies consistent with U.S. values and standards. Where relevant and appropriate, Commerce and other federal departments and agencies may promote U.S. digital asset businesses and their products and solution” the report said.","The document goes on to say that the Commerce Department could support educational initiatives, particularly in “minority-serving institutions.” The report also suggests that “fostering a skilled workforce” would benefit the U.S.","In a statement, Commerce Secretary Gina Raimondo said, “The framework offers a path forward to promote U.S. competitiveness, responsible innovation and leadership in digital assets. I look forward to engaging with government partners, industry, consumer groups, universities and civil society as we implement the framework.”","The U.S. Treasury Department published three reports. One looked at “the future of money” broadly, but a good chunk of the report focused on the idea of a central bank digital currency.","There are various policy design choices to keep in mind, the report said, looking at the role it might play in the payment system, what role intermediaries might play and whether the CBDC should be a wholesale or retail tool. The report does not make any recommendations as to whether any given set of characteristics would be superior to others (the report does recommend that the U.S. government continue researching a possible CBDC in case the creation of one is deemed to be “in the national interest”).","The report also recommended boosting work on real-time payment systems.","The most interesting aspect, to me anyway, is the revisiting of the possible federal framework for nonbank payments providers.","Read more: Digital Dollar Likely Won't Be Part of Retail Banking World, US Lawmaker Says","“Nonbanks are increasingly providing payment services, including issuing money (or money-like) liabilities and processing payments. On the one hand, participation by nonbank payments companies may contribute to higher levels of competition, inclusion, and innovation. On the other, if these firms are not adequately regulated and supervised, there may be risks to consumers, the financial system, and the broader economy,” the report said.","The report does not explicitly say that these nonbank payment providers are crypto exchanges, but it does note that current providers are largely regulated at the state level.","This state-level regulation does not address run or payments risks, the report said.","If such a framework is developed, it could help these nonbank payment providers act as intermediaries for a U.S. CBDC, the report hinted.","The White House science office, which made waves earlier this month by daring to criticize aspects of the crypto mining industry’s energy use, published a report on some of the technical considerations for a digital dollar.","One of the more interesting notes is that the report says a technical design choice “does not presuppose” that a CBDC would use a distributed ledger.","Like the Treasury report, the science office report evaluates different technical possibilities for a CBDC, and how these different technical bases might impact compliance with anti-money laundering laws or interoperability.","It does take a strong stance on data privacy, saying that “sensitive data should be private.”","“The CBDC system should maintain privacy and protect against arbitrary or unlawful surveillance,” the report said. “The CBDC design, deployment and maintenance should adhere to privacy engineering and risk management best practices, including privacy by design and disassociability. Built-in protections and design choices should ensure that privacy is included by default, including ensuring that data collection conforms to reasonable expectations and only data that is strictly necessary for advancing CBDC system policy objectives is collected.”","In a blog post published with the paper, White House officials said the science office and the National Science Foundation are creating a digital assets research and development agenda to study cryptography and other issues which may support a future CBDC.","The Treasury Department’s second report, like Justice’s, looked at some of the criminal activity that involved cryptocurrencies, similarly highlighting ransomware as a major illicit use.","Some ransomware perpetrators are going so far as to ask for privacy coins rather than bitcoin, which is more easily traceable and recoverable, the report said.","Read more: US Treasury Wants Public to Comment on Crypto’s Role in Illicit Finance","The report lists seven “priority actions,” including monitoring possible threats, boosting the global anti-money laundering\/countering the financing of terrorism (AML\/CFTC) laws, updating the Bank Secrecy Act, engaging with the private sector and other recommendations.","The Treasury also analyzed what cryptos might mean for the general American public – “consumers, investors and businesses.”","The current primary use case is to trade, lend or borrow other cryptos, with limited other activities at the present, the report said, though it acknowledged that there may be future activities.","This report’s recommendations were similar in tone to the others: It called for supervisory guidance or rules, “comprehensive oversight” and said the Financial Literacy and Education Commission should work to present clear information about cryptocurrencies to the public, in an effort to tamp down on frauds and scams."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"DAC","content":"ORGANIZATION"},{"type":"U.S. Secret Service","content":"ORGANIZATION"},{"type":"Gina Raimondo","content":"PERSON"},{"type":"State of Crypto","content":"ORGANIZATION"},{"type":"White House","content":"ORGANIZATION"},{"type":"Commerce Department","content":"ORGANIZATION"},{"type":"Treasury Department","content":"ORGANIZATION"},{"type":"Financial Literacy and Education Commission","content":"ORGANIZATION"},{"type":"National Science Foundation","content":"ORGANIZATION"},{"type":"Department of Homeland Security","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Joe Biden","content":"PERSON"},{"type":"US Treasury Wants Public to Comment on Crypto’s Role in Illicit Finance","content":"ORGANIZATION"},{"type":"Commerce","content":"ORGANIZATION"},{"type":"U.S. Treasury Department","content":"ORGANIZATION"},{"type":"Justice Department","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"U.S. Marshals Service","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Commerce and Justice","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Drug Enforcement Agency","content":"ORGANIZATION"}],"hashtag":["State of Crypto","Newsletters","Policy","Regulation","Legislation","White House","U.S. Government","Treasury Department","Commerce Dept.","Department of Justice","Joe Biden","CBDC","Stablecoins"],"authors":["Nikhilesh De"]}