{"summary":"Binance Labs and Polychain Capital led the round with Animoca Brands and dao5 participating.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/02\/21\/polyhedra-network-raises-10m-for-zero-knowledge-infrastructure\/","publishDate":"2023-02-21T14:00:00","id":15296,"type":null,"title":"Polyhedra Network Raises $10M for Zero-Knowledge Infrastructure","category":["Finance"],"content":["Crypto infrastructure provider Polyhedra Network has raised $10 million in a strategic funding round co-led by Binance Labs and blockchain-focused investment firm Polychain Capital.","The funding will be used to develop Web3 infrastructure backed by zero-knowledge (zk) proofs, a cryptographic method where one party can prove that a statement is true to another party without providing other information.","Berkeley, California-based Polyhedra Network was also backed by Animoca Brands and dao5. The new capital will fuel ecosystem growth initiatives, hiring engineers and zk-proof protocol research. The funding comes as crypto winter continues to cool the venture capital landscape, though infrastructure projects remain relatively strong.","The startup is building a full suite of systems focusing on blockchain interoperability, scalability and privacy. Protocols and offerings have included a zkBridge that supports cross-chain asset and data transfers, a decentralized identity solution for zero-knowledge credential verification, and the paraPlonk scalability solution that accelerates zk-rollups, which bundle transactions for better speed and lower fees.","On the near-term road map, Polyhedra Network plans to integrate its bridge and decentralized identity infrastructure with additional blockchain networks, and to launch application programming interfaces (API) and software development kits (SDK) for developers. The company will also continue to develop its paraPlonk solution.","Read more: Zero-Knowledge Cryptography in 2023: The Year Privacy Becomes Practical"],"entity":[{"type":"SDK","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"Polychain Capital","content":"ORGANIZATION"},{"type":"California","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Berkeley","content":"LOCATION"},{"type":"$10 million","content":"MONEY"},{"type":"Polyhedra Network","content":"ORGANIZATION"}],"hashtag":["Venture Capital","Funding Rounds","Binance Labs","Polychain Capital"],"authors":["Brandy Betz"]}