{"summary":"Animoca Brands subsidiary TinyTap raised $8.5 million from investors, including Sequoia China and Polygon.\nThe funding brings TinyTap’s valuation to $100 million, CEO Yogev Shelly told The Block.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/228149\/animoca-tinytap-education","publishDate":"2023-04-25T09:00:33","id":153,"type":null,"title":"TinyTap raises funds at $100 million valuation to decentralize education","category":["Deals"],"content":["TinyTap, the edtech company owned by Animoca Brands, raised $8.5 million in new funding, aiming to \"disrupt education with web3.\"","Investors included Sequoia China, Polygon, Liberty City Ventures, Kingsway Capital and Shima Capital, TinyTap said Tuesday. The funding was realized in a combination of equity via SAFE (simple agreement for future equity) and token via SAFT (simple agreement for future tokens), TinyTap CEO Yogev Shelly told The Block.","\"That said, at the time of the closing of the round, no exact plans for a token were shared with investors,\" Shelly said. \"We merely focused on how we believe a tokenomics model can benefit education and creator economies in general.\"","<a href=\"https:\/\/www.theblock.co\/post\/152443\/animoca-clinches-majority-stake-in-blockchain-based-edutech-platform-tinytap\" data-v-f87c67ca=\"\">TinyTap was acquired by Animoca Brands last June<\/a> for around $39 million for a stake of about 84% in the company, and it is now valued at $100 million with the new funding in place, Shelly said. TinyTap began raising for the round in October and finally closed it in February, with some investors backing out in November due to the collapse of the FTX exchange, Shelly said.","When asked why the company raised funds after getting acquired by <a href=\"https:\/\/www.theblock.co\/post\/199352\/animoca-halves-fundraising-target-for-web3-fund-to-1-billion-bloomberg\" data-v-f87c67ca=\"\">Animoca,<\/a> Shelly said even after the deal, TinyTap still had an incentive to keep growing. \"As a near profitable web2 consumer business, we need enough funding to keep growing,\" he said. \"TinyTap will now develop the web3 side of the business.\"","TinyTap was founded in 2012 in Israel. It offers a library of over 250,000 educational games in 24 languages, made by teachers and publishers. The games are created using TinyTap's code-free authoring platform and can be accessed by users as part of a subscription or individual courses, Shelly said, adding that a portion of revenue is shared back with content creators.","TinyTap said it is among the top 10 grossing kids apps worldwide, with<br data-v-f87c67ca=\"\">\n9.2 million registered users with content created by over 100,000 creators. Its educational content is focused on young learners from pre-K to grade 6, the company added.","TinyTap entered the web3 space last year with the launch of \"<a href=\"https:\/\/www.start.tinytap.com\/publisher-nft\" data-v-f87c67ca=\"\">Publisher NFTs<\/a>.\" These NFTs grant publishers the right to promote and earn from the content they create, Shelly said. \"No need to trust revenue-share calculations from Spotify, YouTube and other content creator platforms,\" he added.","TinyTap has sold two sets of Publisher NFTs, garnering 243 ether (around $352,000 at times of auction). The NFTs were based on Ethereum and sold on OpenSea. But in the future, the company will choose a blockchain that can support a high amount of transactions at a lower cast, according to Shelly, who declined to name the blockchain.","Besides Publisher NFTs, TinyTap has several plans to bring decentralization to the education system. Shelly said there's a plan to introduce a locked token-based scholarship that will only unlock a PublisherNFT when an on-chain event occurs, such as when a course is completed.","The company is also planning to offer custodial wallets for students to store tokens, claim on-chain credentials and access PublisherNFT content.","\"When a group of people is free from serving schools, they can accelerate education, so instead of waiting a decade for AI and web3 to be taught in schools like the time it took coding to get into schools, now we can create education for the future in the present instead of in the future,\" Shelly said.","Last week, TinyTap joined Open Campus, a community-led web3 education protocol that is looking to tokenize educational content to enable teachers and creators to monetize their content. Binance is currently selling Open Campus's EDU token on its Launchpad platform."],"hashtag":["STRATEGIC INVESTMENTS"]}