{"summary":"Competitive price pressures drive markets, whether these traditional investment products are in Canada or the U.S., Reza Akhlaghi writes.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/02\/26\/what-spot-bitcoin-etfs-in-canada-say-about-the-us\/","publishDate":"2024-02-26T22:37:22","id":15306,"type":null,"title":"What Spot Bitcoin ETFs in Canada Say About the U.S.","category":["Consensus Magazine"],"content":["On Jan. 10, the U.S. Securities and Exchange Commission (SEC) ended the years-long wait for spot bitcoin exchange-traded funds (ETFs). The approval, an important phase in the maturation of Bitcoin, opened the door for millions of Americans to invest in the incumbent digital currency, whose value grew by more than 160% in 2023.","Reza Akhlaghi is a digital marketing and Web3 consultant based in Toronto, Canada.","Futures-based crypto ETFs have been available to U.S. investors since October 2021, but unlike spot ETFs, they are not tied directly to the asset and have no requirements for custody. In other words, if spot ETFs are successful, it means there will be a lot more bitcoin buying pressure.","In addition to institutional and retail buyers, there are private bankers, investment advisers, wealth managers and robo-advisers adding to the dynamics of the spot bitcoin ETF. These investment managers now have access to a crypto product that is liquid, safe, and does not require custodianship or reporting. Investors rely on the ETF issuer to accurately track the performance of the underlying asset.","As of last week, at least $7.7 billion has flowed into the 10 live spot bitcoin ETFs in the U.S., a figure that Sylvester Flood, senior product manager for Morningstar, called a “big success.” It isn’t yet clear whether this pace of adoption will continue — and so it might make sense to look at markets where ETFs have traded for years.","See also: Bitcoin (BTC) ETF Volume Data Can be Misleading","In Canada, investors have had access to both spot bitcoin and spot ether ETFs since February 2021, and since then the country’s global market share in spot crypto ETFs has grown to 46%, according to CoinGecko. The country’s six spot bitcoin ETFs account for $2.79 billion in total assets.","Canadian investors have adopted ETFs as a financial vehicle that is safe and delivers the returns of digital assets, despite their well-publicized volatility. Moreover, in Canada, investing in crypto ETFs, versus buying crypto directly, is eligible for use in registered investment accounts, including TFSAs and RRSPs (Canadian 401K).","It remains to be seen exactly how U.S. spot bitcoin ETFs will impact the investment management industry. Some industry observers argue that crypto ETFs in general will bring volatility into 401Ks while others think these investment vehicles will contribute to the stability of crypto markets.","The market has certainly embraced spot bitcoin ETFs. The week of Feb. 5 U.S. spot bitcoin ETFs saw net inflows of $1.1 billion.","For the continued success of this market, it is becoming increasingly clear that investors and advisers need to understand the crypto economy, both from technical and business model perspectives. Indeed, the total crypto market opportunity is only growing: In 2023, for instance, the number of global cryptocurrency users increased 34% to 580 million from 432 million year-over-year.","“Spot bitcoin ETFs improve access to in-demand investment opportunities with educational resources playing a central role in addressing the nuances, risks, and growth opportunities,”Alexandra Levis, founder and CEO of ARRO, a New York-based PR and communication firm that has been serving the ETF markets in the U.S., said.","It’s a point echoed by Sarah Morton, chief strategy officer at Meetami, a Vancouver-based company that educates wealth management advisers about cryptocurrency, who believes that there is a huge need for education in the cryptocurrency and digital asset space.","“There’s bitcoin as well as numerous other coins that have different use cases and applications. So there’s this need to understand how they work and what their growth potentials are,” Morton said. “Canada’s three-year-old spot bitcoin ETF market has driven exposure, awareness and regulatory clarity in the market, and it will be interesting to see if the U.S. market will follow suit.”","See also: Where Coinbase Canada Goes, so Does the World | Opinion","Indeed, Frederick Pye, chairman and CEO of 3iQ, the Canadian digital asset company that played an instrumental role in making spot bitcoin ETFs possible in Canada, said there will always be competitive price pressures on the spot bitcoin ETF markets, whether they are in Canada or the U.S.","“ETFs should never be judged on just fees because experience, trading, and execution have a much greater impact. A look at the total return of U.S. ETFs in the first month of their launch shows no correlation to their fees,” Pye said, adding that there is little connection between total management expense ratio (MERs) and returns.","Adding to the competitive pressures in the U.S. spot bitcoin ETF market are the existence of firms like MicroStrategy, which is using its excess cash to buy at least 190,000 bitcoins, as of Feb. 5, in effect making its publicly-traded stock a bet on BTC and a competitor to ETFs. Pye welcomes this and asserts that there should be many ways and shapes to purchase bitcoin.","A diverse field of bitcoin on-ramps is all the more important ahead of the halving, the upcoming event where the Bitcoin network automatically cuts the amount of bitcoin that enters into circulation via mining in half, which often drives attention to the cryptocurrency. Pye says that this process of cutting the supply has typically been positive, and induces demand.","See also: When Are Bitcoin ETFs Are Right for Investors?","“This underlines the significance of education for advisers,” Pye said. “In Canada five years ago, I’d say 5% of advisers were educated about digital assets and crypto. Today, it is around 40%.”"],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Jan. 10","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Where Coinbase Canada Goes","content":"ORGANIZATION"},{"type":"34%","content":"PERCENT"},{"type":"October 2021","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"New York","content":"LOCATION"},{"type":"Toronto","content":"LOCATION"},{"type":"February 2021","content":"DATE"},{"type":"Vancouver","content":"LOCATION"},{"type":"160%","content":"PERCENT"},{"type":"Morningstar","content":"ORGANIZATION"},{"type":"$2.79 billion","content":"MONEY"},{"type":"Alexandra Levis","content":"PERSON"},{"type":"Feb. 5","content":"DATE"},{"type":"Reza Akhlaghi","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Frederick Pye","content":"PERSON"},{"type":"Sarah Morton","content":"PERSON"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Pye","content":"PERSON"},{"type":"46%","content":"PERCENT"},{"type":"five years ago","content":"DATE"},{"type":"Meetami","content":"LOCATION"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Morton","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"$7.7 billion","content":"MONEY"},{"type":"the first month","content":"DATE"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Canada","ETFs"],"authors":["Reza Akhlaghi"]}