{"summary":"Blockdaemon and StakeWise have launched Harbour as a permissioned liquid staking platform targeted at institutional clients.\nCrypto staking companies continue to develop liquid staking solutions for big-money players.","author":["Osato Avan-Nomayo","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/150303\/blockdaemon-launches-liquid-staking-platform-for-institutional-investors-on-ethereum","publishDate":"2022-06-06T12:00:25","id":1530,"type":null,"title":"Blockdaemon launches liquid staking platform for institutional investors on Ethereum","category":["Institutional Investors"],"content":["Blockchain company Blockdaemon and liquid staking platform StakeWise have announced the launch of Harbour on the Ethereum mainnet on Monday.","Harbour is a permissioned liquid staking protocol that caters to institutional investors that want to stake ether (ETH). Today’s launch follows successful testnet launches in March.","Liquid staking enables investors to earn yield on tokens when they are being staked on a proof-of-stake blockchain network. It provides an additional liquidity avenue for staked tokens that are typically subject to lock-up periods.","Harbour clients will receive Harbour tokens in exchange for their staked ETH on the platform. These institutions can then use the tokens on other permissioned DeFi protocols to earn compounded yield while still maintaining their staked ETH deposits.","Since Harbour deals with institutional clients, the platform says know-your-customer and anti-money laundering compliance protocols are part of its operations.","The Harbour announcement is the latest example of staking firms creating liquid staking products for <a href=\"https:\/\/www.theblockcrypto.com\/news+\/135010\/crypto-staking-firms-are-racing-to-get-liquid-staking-to-institutions\" data-v-f87c67ca=\"\">institutional investors<\/a>. This is amid the <a href=\"https:\/\/www.theblockcrypto.com\/news+\/126250\/crypto-staking-businesses-are-making-an-absolute-fortune\" data-v-f87c67ca=\"\">expansion<\/a> of the overall crypto staking business."],"hashtag":[]}