{"summary":"The organization has become a household name in the crypto industry following the immense success of its BAYC NFT collection.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/whats-the-story-behind-bored-ape-yacht-club-creator-yuga-labs\/","publishDate":"2022-03-23T15:01:55","id":15309,"type":null,"title":"What's the Story Behind Bored Ape Yacht Club Creator Yuga Labs?","category":["Learn"],"content":["Before the explosion of profile picture (PFP) non-fungible tokens (NFTs), creators and developers rarely stuck around to build utilities around their collections or projects.","Instead, they typically cashed in on a particular NFT craze and then immediately set their sights on the next lucrative opportunity. That was until Yuga Labs came along. That's the company behind the $3 billion Bored Ape Yacht Club (BAYC) collection.","Unlike most NFT projects before it, Yuga Labs introduced new and improved strategies for enabling engagement and building a sustainable NFT ecosystem. Part of Yuga Labs' success can be attributed to the company’s decision to build a community-focused blueprint for managing the BAYC brand.","Read more: What Is ApeCoin and Who Is Behind It?","That and many more achievements continue to put Yuga Labs at the forefront of the emerging NFT movement. In this article, we will explore the operations of Yuga Labs and highlight its products.","Yuga Labs is the creator of Bored Ape Yacht Club, a project consisting of 10,000 ape-themed NFTs with different traits and unique characteristics.","Like most PFP-based NFTs, BAYC was inspired by CryptoPunks, the first of many NFT projects looking to create a library of characters with unique traits and rarity levels. While this is a given, Yuga Labs has elevated the entire concept of PFP-based NFTs, such that owners of Bored Apes automatically become a member of an exclusive club, with perks ranging from early access to new offerings to the possibility of receiving the commercial usage right to purchased Bored Apes.","As such, it is easy to see why the prices of Bored Apes NFTs have continued to soar since they launched in April 2021.","At the time of writing, the floor price of BAYC (that is, the lowest price for a Bored Ape NFT) is $304,000, according to Coingecko. This is amazing when you consider the whole idea that birthed Yuga Labs and BAYC stemmed from the perceived tendencies of crypto participants of aping (jumping) into unproven investment opportunities and, in the process, making tons of money.","The entirety of BAYC revolves around the storyline that in the distant future, these rich but bored individuals form an exclusive club and hang out in in a bar. Each ape-themed character in the NFT collection depicts the various personalities and traits you would most likely expect from a futuristic crypto club.","It’s worth mentioning that Yuga Labs is the brainchild of two friends, Gargamel and Gordon Goner, which are both pseudonyms. Interestingly, the pair decided to maintain their anonymity until only recently when a February 2022 Buzzfeed article revealed their identities as Greg Solano and Wylie Aronow.","Both had been involved in the crypto space as \"hodlers\" and traders since 2017. They eventually discovered that the emergence of NFTs created opportunities for them to showcase their creative sides and actively contribute to the crypto movement. To materialize their goals, they enlisted two software engineers, namely Emperor Tomato Ketchup and No Sass, as part of the project’s founding team.","Following the success of BAYC, Yuga Labs went ahead to create a template for evoking sustained euphoria and prestige among its members. In less than a year, the company has issued other NFT collections as part of its plans to reward BAYC holders. The first was the Bored Ape Kennel Club (BAKC), which consists of 10,000 NFTs that are a collection of unique digital dogs bred as companions to the Bored Apes and distributed to all BAYC members for free.","There is also Mutant Ape Yacht Club (MAYC), a collection of mutant, or zombified, variants of Bored Apes. Yuga Labs airdropped mutant serums to holders of the 10,000 BAYC NFTs, which they can use to mint Mutant Apes that either share some semblance with the original form or come with very rare traits.","The rarity and traits of Mutant Apes depend on the tier of serum vial used to mutate the Bored Apes. Tiers M1 and M2 serums will most likely yield Mutant Apes that share some traits with original Bored Ape NFTs. In contrast, the M3 tier creates very unique and rare Mutant Apes that are more likely to fetch a higher price.","On March 11, 2022, Yuga Labs expanded its NFT ecosystem further by acquiring CryptoPunks and Meebits from Larva Labs. It will interest you to note that both collections are two of BAYC’s most prominent competitors in terms of value and following. And so, it is safe to say that this move cements Yuga Labs’ position at the top of the PFP NFT market.","With this deal, Yuga Labs now owns all IP rights, brands and copyright of the CryptoPunks and Meebits collections along with 1,711 Meebits NFTs and 423 CryptoPunks.","As mentioned earlier, Yuga Labs focuses on creating a community-focused business that looks to create more utilities for NFT holders. For the team, the goal is to keep pushing the boundaries of what an NFT ecosystem can become, which is why their products and services are strategically designed to build and preserve the exclusivity of the BAYC community.","Some of the features and services put in place by Yuga Labs are:","According to the project’s bio on Twitter, ApeCoin is a “governance and utility token used to empower a decentralized community building at the forefront of web3.”","Yuga Labs hopes that ApeCoin can become the anchor for the BAYC economy and governance system. The goal is for it to function as a governance and utility token in the BAYC ecosystem. Holders can not only use the token to vote on policy changes but also use it to purchase items both in the digital realm and real world.","And as mentioned earlier, the votes and decisions of the BAYC community will be administered by the board of ApeCoin DAO, which will also act as the committee members of Ape Foundation, another organization that will handle day-to-day operations. More specifically, the board consists of high-profile individuals. They include Reddit co-founder Alexis Ohanian; Amy Wu, head of crypto exchange FTX’s venture arm; Maaria Bajwa of Sound Ventures; Animoca Brands’ Yat Siu; and Dean Steinbeck of Horizen Labs.","Looking at the structure that powers ApeCoin, it is clear that Yuga Labs has strategically removed itself from the operations of ApeCoin DAO for legal reasons. However, this has not stopped the team from allocating or receiving a share of the total supply of ApeCoin.","Interestingly, 160 million APE has been allocated to Yuga Labs, of which 10 million APE will go to charity. Another 80 million APE goes to the founders of BAYC and Yuga Labs. Also, 140 million APE was allocated to “launch contributors,” which will most likely include Yuga Labs' investors and partners.","Read More: What is ApeCoin and Who Is Behind It?"],"entity":[{"type":"Larva Labs","content":"LOCATION"},{"type":"March 11, 2022","content":"DATE"},{"type":"Reddit","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Yuga Labs","content":"ORGANIZATION"},{"type":"April 2021","content":"DATE"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"Alexis Ohanian","content":"PERSON"},{"type":"Maaria Bajwa of Sound Ventures","content":"ORGANIZATION"},{"type":"Bored Ape NFT","content":"ORGANIZATION"},{"type":"ApeCoin","content":"ORGANIZATION"},{"type":"PFP","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Animoca Brands","content":"ORGANIZATION"},{"type":"February 2022","content":"DATE"},{"type":"Sass","content":"PERSON"},{"type":"Gordon Goner","content":"PERSON"},{"type":"Wylie Aronow","content":"PERSON"},{"type":"Bored Ape NFTs","content":"ORGANIZATION"},{"type":"Ape Foundation","content":"ORGANIZATION"},{"type":"Bored Ape Kennel Club","content":"ORGANIZATION"},{"type":"Greg Solano","content":"PERSON"},{"type":"Amy Wu","content":"PERSON"},{"type":"Dean Steinbeck","content":"PERSON"},{"type":"Gargamel","content":"PERSON"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"Yat Siu","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"ApeCoin DAO","content":"ORGANIZATION"},{"type":"PFP NFT","content":"ORGANIZATION"},{"type":"$304,000","content":"MONEY"}],"hashtag":["NFTs","Learn","Beginner"],"authors":["Andrey Sergeenkov"]}