{"summary":"The crypto exchange's announcement last month is a sign of regulatory progress to come, according to one institutional investor.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/02\/coinbase-doesnt-offer-liability-protection-but-thats-no-reason-to-panic\/","publishDate":"2022-06-02T14:19:05","id":15308,"type":null,"title":"Coinbase Doesn’t Offer Liability Protection, but That’s No Reason to Panic","category":["Finance"],"content":["Some investors and financial advisers were taken aback in recent weeks as one of the oldest and most trusted digital asset exchanges and custody providers announced that it might not be as secure as they had once assumed.","On top of announcing a major earnings miss, Coinbase warned its users last month that they don't enjoy protection from liability in the case of bankruptcy, potentially putting nearly $256 billion in investor assets at risk.","“The crypto assets we hold in custody on behalf of our customers could be subject to bankruptcy proceedings,” the company stated in its first-quarter earnings report.","Advisers should understand that for many diehard cryptocurrency investors, the announcement was much ado about nothing. Most dedicated crypto aficionados hold their own assets and put tokens on an exchange like Coinbase only temporarily. But many newcomers to digital assets prefer the relative simplicity of keeping their tokens where they bought them, just as they would stocks and funds bought through an online broker.","Read more: Despite Recent Bumps in the Road, Stablecoins Will Stick Around","Coinbase’s announcement is a reminder that to this point digital custodians aren't the same as the brokerages and banks that serve the traditional financial industry and cannot offer investors the same assurances as the incumbents – yet.","“I think this is in large part a function of the fact that we do not yet have regulatory clarity around the custody of digital assets,” said Marcel Kasumovich, head of research at One River Asset Management, an institutional digital asset manager. “Regulators haven’t taken time to revise their rules yet because this asset class went from nothing to something relevant in a very short period of time.”","A bank account is protected by the Federal Deposit Insurance Corp. for up to $250,000 worth of deposits in checking, savings and money market accounts as well as certain certificates of deposit. A traditional investment account enjoys up to $500,000 worth of coverage from the Securities Investor Protection Corp., which covers stocks, Treasurys, corporate bonds, certificates of deposit, exchange-traded funds, mutual funds and money market funds. There is, thus far, no analog insurance for digital assets.","In fact, according to Kasumovich, it is uncertain what exactly would happen to crypto assets if an exchange or custodian declares bankruptcy.","Read more: Coinbase Has ‘Structural Advantage’ Over Competitors, Cowen Analyst Says","“We don’t know with certainty what happens to custodied assets because we do not yet have definitive guidance,” he said. “Coinbase was doing their duty by disclosing that they do not have protections in place.”","Coinbase has publicly stated that it isn't at risk of declaring bankruptcy. In a scenario where a Coinbase-like company does declare bankruptcy, however, a court will have to figure out which assets go to which creditor.","In some prior bankruptcy cases, assets that were well-defined and attributed to individuals separate from the insolvent entity could at times be shielded from creditors, Kasumovich said.","“If I, as a person, held assets segregated from that business which were known to be mine, especially if they were held somewhere like a cold storage wallet with specific addresses on the blockchain identifying me as the owner of those assets, it would be really odd for that known asset to be reallocated to a creditor funding a different business line,” he said. “In such a case, I would be technically hiring Coinbase or whoever to care for my keys and all of those other things, but when I log in, I would see my account and my place on the chain. They couldn’t easily say that now, because of a bankruptcy in a shared core business, my assets belong to Goldman Sachs or some other creditor.”","While there is little prior case law to depend on, Kasumovich said a court would likely recognize that someone’s crypto holdings, identifiable on the blockchain, are segregated from those of the exchange or custody provider.","“Eventually we’re going to get visibility on how digital assets fit into the Commercial Code and what it means to be a custodial institution both in the context of the Advisers Act, the custody rule and the Federal Reserve,” he said. “All of this stuff is transitional. It adds to the uncertainty, but it’s just a bridge to integrating digital into the financial regulatory mainstream.”","In the meantime, advisers and investors should pay close attention to the specifics of custody, namely who safeguards their assets and where exactly those assets are being held.","Under today’s laws, self-custody may be the safest way to hold digital assets, Kasumovich said, but if investors want to hold their assets on an exchange or with some other type of digital custodian, they should look for services operating in New York state or in a place with similar regulatory standards, because those places provide the best protections in the case of bankruptcy. Investors should also look for custody providers who are independently capitalized.","“Self-custody is mostly a matter of comfort level,” he said. “I think we’ll be getting regulatory [clarity] on what self-custody actually means within the next six months. There’s a lot coming on the regulatory side, not everything will be what people want to see but just having clarity on the rules of engagement will be helpful.”","Read more: Crypto Investing Means Staying Positive Amid Volatility"],"entity":[{"type":"Marcel Kasumovich","content":"PERSON"},{"type":"$250,000","content":"MONEY"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Securities Investor Protection Corp.","content":"ORGANIZATION"},{"type":"Cowen Analyst Says","content":"ORGANIZATION"},{"type":"Road","content":"LOCATION"},{"type":"$500,000","content":"MONEY"},{"type":"New York","content":"LOCATION"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"One River Asset Management","content":"ORGANIZATION"},{"type":"$256 billion","content":"MONEY"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"Crypto Investing Means Staying Positive Amid Volatility","content":"ORGANIZATION"},{"type":"Stablecoins Will Stick Around","content":"ORGANIZATION"},{"type":"Kasumovich","content":"PERSON"}],"hashtag":["Regulation","Custody","Crypto for Advisors","Coinbase","Newsletters"],"authors":["Christopher Robbins"]}