{"summary":"The dApp Protection and Transaction Simulation products can check decentralized applications across 40+ blockchains via WalletConnect, Fireblocks’ browser extension, and MetaMask Institutional.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/24\/crypto-custody-firm-fireblocks-offers-defi-threat-detection-for-institutions\/","publishDate":"2024-04-24T13:00:00","id":15300,"type":null,"title":"Crypto Custody Firm Fireblocks Now Offers DeFi Threat Detection for Institutions","category":["Finance"],"content":["Cryptocurrency custody specialist Fireblocks is helping institutions exploring decentralized finance (DeFi) from interacting with bad actors and falling victim to malicious attacks with new threat detection and smart contract evaluation tools.","Fireblocks’ dApp Protection and Transaction Simulation products, which have been in beta testing since December of last year with Galaxy and Flowdesk, are now available to check decentralized applications across over 40 blockchains via WalletConnect, Fireblocks’ browser extension, and MetaMask Institutional.","There has been a recent surge of interest in DeFi – sometimes described as a playground for hackers – thanks to a steady increase in crypto asset prices. Institutions are increasingly exploring swapping, lending, staking and bridging using popular platforms like Uniswap, Aave, Curve, 1inch and Jupiter.","Some Fireblocks customers have their own dedicated Web3 research team, but most people need to scale their operations and don’t necessarily have the resources to hire cybersecurity experts who also understand DeFi and Web3, said Shahar Madar, VP of security products at Fireblocks.","The solution looks for suspicious smart contracts, phishing websites, and compromised dApps by identifying malicious patterns such as imitative URLs, harmful javascript elements, and suspicious registrars.","“We’ve mapped out the user journey of a DeFi and Web3 trader,” Madar said in an interview. “Usually, it starts when you scan with your phone and connect to a dApp and are asked to start signing transactions. We put mitigations and detection mechanisms throughout this journey. For instance, we scan the transaction, we scan the counterparty, we try to make sense of the contract, and also offer transaction simulation, essentially giving you the bottom line of what you should be expecting.”","Edited by Parikshit Mishra."],"entity":[{"type":"Shahar Madar","content":"PERSON"},{"type":"MetaMask Institutional","content":"ORGANIZATION"},{"type":"Galaxy","content":"ORGANIZATION"},{"type":"Flowdesk","content":"PERSON"},{"type":"Madar","content":"PERSON"},{"type":"December","content":"DATE"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"Jupiter","content":"ORGANIZATION"}],"hashtag":["Fireblocks","DeFi"],"authors":["Ian Allison"]}