{"summary":"The moves will likely lead to increased mining efficiency and greater bitcoin adoption, which in turn should help boost the price of the cryptocurrency.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/01\/19\/intel-block-supporting-mining-a-positive-for-bitcoins-price-analyst\/","publishDate":"2022-01-19T19:09:25","id":15307,"type":null,"title":"Intel, Block Supporting Mining a Positive for Bitcoin’s Price: Analyst","category":["Finance"],"content":["Large tech companies such as Intel and Block (previously Square) delving into making mining more efficient and accessible is likely to help the price of bitcoin by encouraging mass adoption, said an analyst for U.K-based digital asset broker GlobalBlock.","Intel, one of the world’s largest chip makers, said on Jan. 18 it will unveil an “ultra low-voltage bitcoin mining ASIC” which will be a more efficient specialized mining computer, competing with current miners that are in the market. “The fact that a $200+ billion tech firm is providing solutions for Bitcoin mining is more confirmation of big players entering the crypto space,” said GlobalBlock’s analyst Marcus Sotiriou.","The chipmaker said its new miner will reduce power consumption by about 15%, Sotiriou said, adding that such an increase in efficiency will help more institutional investors to enter the sector as ESG (environmental, social and governance) is one of their key investment priorities. If such a scenario plays out, it will likely help support bitcoin’s price.","Read more: How Bitcoin Mining Works","Crypto miner Griid Infrastructure, which is going public via a merger with special purpose acquisition company Adit EdTech Acquisition Corp., has already signed a supply agreement with Intel to potentially buy the chip maker's new ASIC miners, according to a filing.","Meanwhile, payments giant Block said on Jan. 13 that it's going ahead with its plan to build an open-source bitcoin mining system to make “mining more distributed and efficient.” If this feature is integrated with Cash App, it might increase the use of bitcoin to pay for goods and services by its users, furthering bitcoin adoption by the masses, Sotiriou noted.","“If successful, this will dramatically increase bitcoin’s use case as a means of exchange, rather than just a store of value – this would result in significantly more adoption and hence help bitcoin reach price figures of over $100,000,” he said.","Bitcoin is now trading near $42,000 since reaching its all-time high of just under $69,000 in November. The stocks of some miners, which are highly leveraged to the price of the crypto currency they mine, have tumbled more than 50% since their peak."],"entity":[{"type":"Crypto miner Griid Infrastructure","content":"ORGANIZATION"},{"type":"Sotiriou","content":"PERSON"},{"type":"How Bitcoin Mining Works","content":"ORGANIZATION"},{"type":"Intel","content":"ORGANIZATION"},{"type":"Cash App","content":"PERSON"},{"type":"$69,000","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Jan. 13","content":"DATE"},{"type":"November","content":"DATE"},{"type":"Jan. 18","content":"DATE"},{"type":"Marcus Sotiriou","content":"PERSON"},{"type":"$100,000","content":"MONEY"},{"type":"$42,000","content":"MONEY"},{"type":"15%","content":"PERCENT"},{"type":"ESG","content":"LOCATION"},{"type":"Adit EdTech Acquisition Corp.","content":"ORGANIZATION"},{"type":"$200+ billion","content":"MONEY"}],"hashtag":["Intel","Square","Square Crypto","Bitcoin Mining"],"authors":["Aoyon Ashraf"]}