{"summary":"World ID has added integrations with Shopify, Minecraft, and Reddit alongside a slew of developer-focused updates that could expand the OpenAI founder's blockchain-based \"proof-of-personhood\" service to more users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/12\/13\/sam-altmans-retina-scanning-orb-to-become-more-useful-with-world-id-20\/","publishDate":"2023-12-13T14:00:00","id":15302,"type":null,"title":"Sam Altman Is Bringing Worldcoin's Controversial Eye-Scanning Orb to Reddit and Microsoft","category":["Technology"],"content":["Worldcoin, the crypto startup co-founded by OpenAI CEO Sam Altman, announced a major expansion to its eye-scanning identity platform on Wednesday, including integrations with major tech firms and a new multi-level verification system for the World ID \"digital passport.\"","Tiago Sada, the head of product at Tools for Humanity, the company behind Worldcoin, said in an interview that World ID 2.0 marks a \"monumental upgrade\" for the protocol that combines \"ideas that were originally laid on the white paper\" with \"feedback that we've heard from developers.\"","This article is featured in the latest issue of The Protocol, our weekly newsletter exploring the tech behind crypto, one block at a time. Sign up here to get it in your inbox every Wednesday. Also please check out our weekly The Protocol podcast.","Sada said Worldcoin will begin offering on-site onboarding into its proof-of-personhood service in Singapore and Mexico. Additionally, he said the protocol has added integrations with Shopify, Mercado Libre, Reddit, Telegram, and Microsoft's Minecraft among others. The integrations could eventually enable some users to log in to these services using a World ID.","The 2.0 upgrade will help these companies by making it \"easier to distinguish between bots and verified humans online,\" Tools for Humanity said in an emailed statement.","It's impossible to talk about Worldcoin without mentioning the orb – the retina-scanning sphere that one must peer into in exchange for a World ID passport. A basketball-sized chrome globe, the device scans eyeballs to authenticate first-time users. It does this to guarantee that all World ID-holders are verifiably unique, which could prove useful for online services looking to suss out bots from real humans in the increasingly uncanny age of AI.","The eerie intimacy of Worldcoin's chosen authentication method has sparked concerns about user privacy: For a vocal corner of the privacy-obsessed, anti-corporate blockchain industry, the idea of handing one's biometric data to a shiny metallic orb built by a Silicon Valley startup has inevitably rung dystopian.","But Tools for Humanity says Worldcoin doesn't save its eye scans and only uses them for first-time authentication of users. Tools for Humanity also pitches the World ID service as a more privacy-preserving alternative to traditional authentication systems. World ID holders can \"verify to an app or service that they are human without disclosing their identity,\" Tools for Humanity said in its statement.","On Reddit, for example, the moderators of a subreddit can use World ID to \"give people that have been verified as humans specific roles or special permissions,\" said Sada. Or on Shopify, merchants that give out discount codes can use World ID to \"make sure that you only get that discount once,\" he added.","With World ID 2.0, \"new verification levels\" have been added to accommodate users who opt to give different amounts of verification data. In addition to the standard orb-based World ID, a new base-level World ID forgoes the retina scans and allows users to authenticate themselves on their own devices. This lower verification tier can help expand IDs to people without access to an orb authentication site, and it can be used to sign into apps with less stringent proof-of-personhood requirements.","On the opposite end of the verification spectrum will be another new – and stricter – tier called Orb Plus. App-makers can identify users using this option if they want orb-authenticated users to re-verify themselves on-device each time they sign in with a World ID.","Tools for Humanity says \"nearly five million people\" have scanned their eyes in exchange for World IDs since Sam Altman unveiled the orb in 2021. The number \"includes more than 1% of the population of Chile, 1% of the population of Argentina, and more than 2% of the population of Portugal,\" said Sada. Worldcoin's main product today is a crypto wallet app that anyone can use, and which offers special access to verified ID-holders.","Sada says Altman remains actively engaged in major product and strategy decisions at Worldcoin, and he claims he learned of the AI luminary's surprise firing and rehiring from OpenAI on the news like everyone else.","That debacle sparked public speculation around Altman's commitment to AI safety – one of the founding principles upon which OpenAI and Worldcoin were both founded. \"Sam has clearly been at the middle of the spectrum\" between techno-optimism, which seeks to accelerate the development of technology like AI, and effective altruism, which is more concerned with AI's existential risks, remarked Sada. \"If anything, he's more on the safety side.\"","\"Worldcoin was started because the world is changing, and we need the tools to make the most of this new era,\" said Sada.","Correction (Dec. 13, 16:56 UTC): The companies that have integrated World ID are not \"partners,\" as originally written. The subhead has been updated to clarify this distinction further."],"entity":[{"type":"Humanity","content":"ORGANIZATION"},{"type":"Reddit","content":"LOCATION"},{"type":"2%","content":"PERCENT"},{"type":"Portugal","content":"LOCATION"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Tiago Sada","content":"PERSON"},{"type":"Worldcoin","content":"PERSON"},{"type":"2.0 marks","content":"MONEY"},{"type":"Argentina","content":"LOCATION"},{"type":"Altman","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Microsoft","content":"ORGANIZATION"},{"type":"Sam","content":"PERSON"},{"type":"Silicon Valley","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Mercado Libre","content":"PERSON"},{"type":"Sam Altman","content":"PERSON"},{"type":"Dec. 13","content":"DATE"},{"type":"Telegram","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"Chile","content":"LOCATION"},{"type":"Sada","content":"PERSON"},{"type":"1%","content":"PERCENT"},{"type":"Shopify","content":"PERSON"}],"hashtag":["worldcoin","Openai","Sam Altman","Biometrics","Upgrade","Identity Verification"],"authors":["Sam Kessler"]}