{"summary":"A tax accountant with decades of experience may be the world’s first “CMVO” with an office in Decentraland.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/30\/welcome-to-a-day-in-the-life-of-a-chief-metaverse-officer\/","publishDate":"2022-06-30T19:22:04","id":15301,"type":null,"title":"Welcome to a Day in the Life of a 'Chief Metaverse Officer'","category":["Consensus Magazine (layer2)"],"content":["Mentioning the metaverse to most people my age will often elicit a bemused expression and the statement they have no idea what the metaverse is. Mentioning that a former tax partner and current partner emeritus is now possibly the first “chief metaverse officer” in the world … well, need I say more?","An explanation: Prager Metis has always had a significant entertainment clientele and a related business management division. During the recent non-fungible token (NFT) boom, many clients were looking to get into the space. Others were already minting NFTs.","Jerry Eitel is the chief metaverse officer at Prager Metis. This article is part of “The Future of Work Week.”","In discussions about their opportunities, we saw our opportunity to expand our business and our brand into the digital frontier. Although someone might have considered it trendy or a way to seek attention, it was a natural extension for us to open the first Certified Public Accountant (CPA) office in the metaverse.","Even before we purchased virtual land in Decentraland and paid a designer to build our office, there were many new ventures going into the metaverse. Some were extremely successful. Some were extremely well funded. Many were fledgling. Mainly, we saw that many new roles were being created like Discord and community managers. My role is just another new role.","Read more: Young Web3 Believers Unfazed by Battered Crypto Market","Being tech-forward can be a competitive advantage. By getting into the weeds of the metaverse, we were able to talk the talk with NFT startups and investors. We understand the complexity of the blockchain when it comes to accounting and tax, both domestically and internationally.","On the most mundane and annoying level, I am doing some accounting for a startup, Banquet Labs, in which many of our partners are invested. There are multiple wallets, multiple cryptocurrencies and multiple NFTs involved.","I try to keep my finger on the metaverse pulse. Often I traverse various Discord communities (a gamer-focused chat platform I had no idea existed until about a year ago). I also search the internet on the various virtual worlds or go into their platforms to see if there is anything new.","There are scheduled meetings with prospective clients and potential business referral sources. Someone might see my name somewhere and send me an email. We set up a Teams or Zoom meeting and we see if it makes mutual sense for us to go further.","Also, many of our partners refer us business. I am always on these initial meetings and operate like a quarterback passing opportunities off to our tax and audit partners. What works very well for us is for me to discuss what we have done, how we are living in this space and for the tax and audit specialists to also explain their experience in the space.","When meeting specifically with potential metaverse clients, it helps to see how we are fully invested in the digital world and understand the complexities of accounting, auditing and both domestic and international tax in the digital space. We talk the talk about virtual land, MetaMask wallets and making payments in crypto.","Having been in this role for several months now, the most significant thing I’ve learned is that while this role may appear to be highly technical, I am most impactful in my position when I am building connections. In addition to being the point person for those already in the space, I see my role as providing clarity for those looking to enter this virtual landscape and to help them understand the ways in which they can leverage virtual reality to reach a wider audience and break down barriers to accessibility.","I have met with individuals and companies across many industries including digital assets, sports, art, entertainment, music, fashion, hospitality, real estate and insurance either toying with the idea or actively seeking to enter the metaverse.","Read more: ‘I Don't Follow Trends’: Multicoin’s Kyle Samani on How to Make It in Crypto","The task is to help companies expand by working with them to understand and lessen the gap between the metaverse and our real world. We can do this because we already have a significant digital practice and a very strong and experienced team in place working with clients ranging from small NFT start-ups to one of the largest crypto exchanges.","Although the majority of my day is spent meeting with prospective and existing clients, a portion of my responsibility is also going to be focused on working on our grand opening in Decentraland. As our metaverse client roster expands, so too are we.","But beyond retaining new talent, we believe it is critical to first invest in the upskilling of our own. This includes training employees in metaverse operations related to their job function and providing education about Web3 and the evolving markets capabilities.","The challenging part of leading an organization’s metaverse sector is the platform’s relatively new emergence. There are no set guidelines on how to be successful, but we will endeavor to ensure our organization and staff are fully immersed and knowledgeable, because, as in any industry, hands-on experience with the metaverse is invaluable.","The most interesting aspect of my job is the variety of people I meet on a day-to-day basis. I have worked in accounting and real estate for the past 35 years with clients from around the world, but for the most part they tend to operate in similar business-focused industries. The amazing thing about the metaverse is the creative opportunities it provides and, thus, the creative people drawn to the platform.","In the past six months, I have communicated with many entrepreneurs and entertainers and also with their teams. The metaverse is malleable in nature, and it is also my job to show traditional industries and traditionally “non-tech” companies how they too can flourish and benefit from the platform. Most notably, my role as CMVO has provided our firm with the opportunity to work with clients operating in world social causes from the environment to the empowerment of underserved communities.","For example, Banquet Labs worked with The Female Quotient, a women’s workplace equality group that has entered the metaverse to ensure women have the necessary resources to leverage the power of Web3 in business and beyond. They offer spaces for women and minority groups to connect, offering expanded access to professional networking opportunities and educational experiences.","It is my belief that although the crypto and NFT markets are down now, this is an asset class that is ultimately going to prove to be both socially responsible and financially rewarding.","Working as the bridge builder between the real world and the virtual universe has been an incredible eye-opening experience in the ways the metaverse is allowing people access to opportunities and information and resources that were at one time unavailable to them due to the barriers of the real world.","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","Meet the pioneers who work at decentralized autonomous organizations.","It may be a bear market, but there are still plenty of jobs to be had at crypto companies."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"Banquet Labs","content":"ORGANIZATION"},{"type":"CMVO","content":"ORGANIZATION"},{"type":"Kyle Samani","content":"PERSON"},{"type":"Prager Metis","content":"ORGANIZATION"},{"type":"Jerry Eitel","content":"PERSON"},{"type":"The Female Quotient","content":"ORGANIZATION"},{"type":"Decentraland","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"},{"type":"ups","content":"ORGANIZATION"},{"type":"Battered Crypto Market","content":"ORGANIZATION"}],"hashtag":["Future of Work Week","Opinion","Metaverse","Web 3.0"],"authors":["Jerry Eitel"]}