{"summary":"Technologists unveiled a foundation dedicated to rewriting bitcoin's underlying tech, giving the long-controversial idea new wings.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/07\/06\/powx-the-new-effort-to-change-bitcoin-mining-explained\/","publishDate":"2018-07-06T01:30:56","id":15312,"type":null,"title":"PoWx: The New Effort to Change Bitcoin Mining Explained","category":["Markets"],"content":["A long-controversial bid to change bitcoin just got a big boost.","Boasting the support of tenured developers, a non-profit foundation called PoWx launched this week with the goal of putting a more sophisticated wrapper on the idea that proof-of-work (PoW), the way the network comes to agreement on which transactions are valid, could be replaced with a newer, supposedly better, algorithm.","In short, PoWx advocates bitcoin adopt a new technology it calls \"optical\" proof-of-work, which uses a more energy-efficient laser technology as the cornerstone of mining.","The hope is to \"fix\" mining by making it easier for more people to participate in the process, in part, because the barriers to entry have become so prohibitive. (At the beginning in 2009, users just needed a simple laptop to run the code to mine bitcoins. Now, they need to purchase specialized computers costing thousands of dollars and which they don't do anything else.)","Not to mention, the developers behind PoWx are the latest to point to one mining firm, Bitmain, and its influence on the network as a major issue. Though exact numbers are cloudy, estimates say the company is manufacturing between 50 and 80 percent of bitcoin's mining hardware.","Against this backdrop, the idea of swapping bitcoin's mining algorithm has been around for some time, mostly flaring up in times of perceived crisis. It's been seen almost as a last resort to be deployed only in the case miners do something really bad, such as colluding to attack the network.","But PoWx founder Michael Dubrovsky sees the change as an inevitability.","He calls mining centralization bitcoin's \"Seldon Crisis,\" a specific type of earth-shattering issue found in the famous sci-fi series \"Foundation\" and which denotes a point of no return.","Dubrovsky told CoinDesk:","To this end, he argues changing this underlying technology will help to \"ensure the mining ecosystem is healthy enough and scalable enough to support crypto's growth over the next decade.\"","More broadly, developers have long worried about bitcoin's level of \"centralization,\" or the measure of how much control single stakeholders have over the technology. (Decentralization is seen as a key differentiator, one that makes bitcoin more unprecedented in the history of money.)","To that end, they've argued that if this problem goes unaddressed, mining centralization might lead bitcoin to turn into something resembling the financial system it's supposed to replace.","So, to attempt to put this problem to rest, developers have put forth a variety of potential technical fixes.","Dubrovsky grew interested in changing proof-of-work as a solution, deciding to work on the idea about a year ago as he became convinced optical PoW was the best solution.","According to the PoWx team, this new algorithm, if implemented, would usher in two huge improvements to bitcoin. One, the barrier to entry for startups producing the chips will be lower, thus increasing decentralization of the network. Two, it reduces power consumption (estimates suggest bitcoin now makes up 0.15 percent of the world's electricity costs).","One hurdle though is PoWx has yet to secure fundraising.","But their goals are nonetheless ambitious, vowing in the short-term to develop open-source hardware putting optical PoW into practice and to release a test network demonstrating their open-source design by Q1 of 2019.","Although they're putting plenty of thought into this idea, swapping bitcoin's proof-of-work isn't at all an easy task.","It's a pretty drastic change, one that would require every user to update their software if it was coded into a formal proposal. If a larger number of users were to disagree on the proposal (if and when introduced), bitcoin could even split into two different cryptocurrencies, similar how bitcoin cash broke off due to disagreement about the project's technical direction.","Still, it's perhaps too early to say what users want - though the general idea has prompted outpourings of controversy, including lawsuit threats, in the past. And as bitcoin is a decentralized system, the opinion of users can make all the difference.","But Dubrovsky argues there's no choice - the community needs to make the change.","\"I think it will be difficult, but what we are proposing is not just an improvement,\" he told CoinDesk. \"Something like this is a necessity if cryptocurrency is going to be truly decentralized and used to securely store and move trillions of dollars of value.\"","As such, one of PoWx's main goals is to work with the bitcoin community to make the switch.","So far, the effort has won the support of Bitcoin Core contributor Luke Dashjr and pseudonymous bitcoin.org maintainer Cobra, two influential figures in the space who are also both known for espousing controversial points of view. (Most bitcoin developers have yet to make a public statement about their views.)","Finally, there's always the question of whether mining will just centralize again, even after PoW is changed. However, Dubrovsky argues it's unlikely.","\"It is not clear that OPoW could ever lead to the same level of centralization we see today,\" he said.","Still, he's trying his best to look at the problem realistically, agreeing it's unclear how PoWx will work yet. And, even if it does, he admits bitcoin could still have future problems.","He concluded:","Bitcoin miners via Shutterstock "],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"80 percent","content":"PERCENT"},{"type":"Dubrovsky","content":"PERSON"},{"type":"Bitmain","content":"LOCATION"},{"type":"Michael Dubrovsky","content":"PERSON"},{"type":"0.15 percent","content":"PERCENT"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"Luke Dashjr","content":"PERSON"},{"type":"2019","content":"DATE"},{"type":"2009","content":"DATE"}],"hashtag":["Bitcoin Mining","Security","Proof-of-Work","Bitcoin","Decentralization","Features","other-public-protocols","Technology News"],"authors":["Alyssa Hertig"]}