{"summary":"The token will be \"100% backed by U.S. dollar deposits, short-term U.S. government Treasuries and other cash equivalents,\" according to the company.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/04\/ripple-developer-behind-xrp-ledger-enters-stablecoin-fray-vs-tether-usdc\/","publishDate":"2024-04-04T13:00:00","id":15313,"type":null,"title":"Ripple, Developer Behind XRP Ledger, Enters Stablecoin Fray vs. Tether, USDC","category":["Technology"],"content":["Ripple, the enterprise-focused blockchain service and creator of the XRP Ledger, is introducing its own stablecoin pegged to the price of the U.S. dollar.","\"The stablecoin market is over $150 billion today and is forecasted to exceed $2.8 trillion by 2028,\" Ripple said in a statement shared with CoinDesk. \"There’s clear demand for stablecoins that deliver trust, stability and utility.\"","The company said the token, which it plans to release \"later this year,\" will be \"100% backed by U.S. dollar deposits, short-term U.S. government Treasuries and other cash equivalents.\" The stablecoin will be deployed onto Ripple's institution-focused XRP Ledger along with the Ethereum blockchain to start out, and it will be based on Ethereum's ERC-20 token standard.","Ripple's announcement comes as stablecoins have proven one of the most popular types of digital assets among crypto traders, free (in theory) from the price volatility witnessed in larger cryptocurrencies like bitcoin (BTC) and Ethereum's ether (ETH).","Read more: What is a Stablecoin?","\"What we think is going to be our differentiator is going to be the fact that the assets are going to be in dollars, Treasuries – rock solid,\" Ripple CTO David Schwartz told CoinDesk in an interview. \"We're not trying to juice the last couple of decimal points out of this. We're looking to conquer the market and be in it for the long term.\"","As for why Ripple – still battling an enforcement case brought by the U.S. Securities and Exchange Commission – has decided to jump into the stablecoin game, Schwartz said that the decision, in part, came down to simple \"dollars and cents.\"","\"Part of it is just opportunistic. It's a growing market,\" he said. \"You could be a bank that pays no interest. That seems like a pretty good business opportunity.\"","Schwartz said the new stablecoin could also help breathe some life into the XRP Ledger's decentralized finance ecosystem, which has a decentralized exchange but relatively low usage relative to other chains.","According to Schwartz, transparency – historically a key point of scrutiny for stablecoin issuers – will be a key focus for Ripple as it rolls out its new token.","\"We're gonna have public audits on a monthly basis, hopefully by a top-tier accounting firm and will disclose more on that later,\" said Schwartz. \"We're aiming for complete transparency. You know, we'll do whatever we need to do to address those issues.\"","Beyond the promise of transparency, Schwartz emphasized that the potential growth of the stablecoin market – currently dominated by Tether's USDT token and Circle's USDC – serves as a disincentive for Ripple or any other stablecoin provider to act dishonestly. Coinbase, the publicly traded U.S. crypto exchange, is an investor in Circle.","\"In the early days of Tether, people were expecting it to blow up any day, and they felt like it was really sketchy,\" said Schwartz. But now, \"if you're Tether, it wouldn't make sense for you to run off with people's money,\" said Schwartz. \"Even if that was your plan, you'd wait to do it\" because \"the market is only growing.\"","In Ripple's case, \"we're not trying to squeeze a couple of extra pennies out – we don't need to,\" said Schwartz. \"Our balance sheet is rock solid.\"","The Ripple CTO said his token will be aimed primarily at enterprise customers and banking institutions, organizations for whom \"those kinds of practical arguments aren't really prescient because they have to justify their decisions\" to \"stockholders and to regulators and so on.\"","To satisfy the needs of this market segment, Ripple says it is using U.S. banks to hold its reserves and is taking what it terms a \"compliance-first mindset.\"","USDC is currently the market leader among compliance-oriented stablecoin consumers, but Schwartz said he doesn't see it as \"a winner takes all\" environment.","\"If we were a solid number three and the market grows 12x, that's not a failure scenario,\" said Schwartz. \"Obviously we would like to do better than that, but that's not a failure case, that's still pretty gosh darn good.\"","Edited by Bradley Keoun."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"2028","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Ripple CTO","content":"ORGANIZATION"},{"type":"20","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission –","content":"ORGANIZATION"},{"type":"$150 billion","content":"MONEY"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"100%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Circle","content":"ORGANIZATION"},{"type":"Schwartz","content":"PERSON"},{"type":"David Schwartz","content":"PERSON"},{"type":"\"dollars and cents","content":"MONEY"},{"type":"$2.8 trillion","content":"MONEY"}],"hashtag":["Ripple","Stablecoin","XRP","David Schwartz"],"authors":["Sam Kessler"]}