{"summary":"Crypto is thriving in the Asia-Pacific region -- where uses, users and builders abound, Gitcoin's Azeem Khan argues.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/11\/16\/there-is-a-world-of-web3-outside-the-us-and-europe\/","publishDate":"2023-11-16T16:22:28","id":15317,"type":null,"title":"There Is a World of Web3 Outside the U.S. and Europe","category":["Consensus Magazine"],"content":["Upon returning from Token2049 in Singapore, my perceptions have been profoundly reshaped. What truly astounded me was the depth and dynamism of the Asia-Pacific (APAC) region in the Web3 realm.","While the United States and Europe often dominate the global crypto conversation, I'd always sensed that APAC held more than met the eye. Still, experiencing its intricacies firsthand blew me away.","Far from a monolithic entity, APAC has emerged as a kaleidoscope of unique cultures, each with its distinct contribution to the evolving Web3 narrative, often challenging and complementing Western perspectives. As the digital landscape continues to unfold, a deepened appreciation of these diverse cultures is essential to foster genuine global collaborations.","The crypto industry is an events industry these days. While on the events circuit I started to see the same people at each conference almost everywhere I go. No offense to any of those people, but it just wasn’t making sense. I started to ask myself what was the value in going to places where there was no new business to be won?","If all we’re doing is spending time talking to the same people we know from North American and Western Europe at each of these places, giving emphasis only to them when it comes to attending events, then are we actually going to get anything done?","Attending an event in a new part of the world is a quick way to approach a new frontier making strides in Web3 — and a way to accomplish new things personally. At the end of the day, this is what we in crypto should all be doing: stepping outside our comfort zones and encountering firsthand all the ways crypto is and can be used.","See also: Gemini to Expand in APAC to Capture 'Next Wave' of Crypto","There were certainly speed bumps to attending the event in Singapore. Many of my counterparts weren't planning on going. This dismissal sometimes, not always, seemed xenophobic — it definitely felt like there’s a part of our industry that looks at what’s happening in the East as if it’s subpar. This didn't make sense to me before I attended Token2049, and it definitely doesn't after.","Speaking as a typical Westerner, it's easy to write off the distinct cultures that comprise the Asia–Pacific (APAC) region. Talking to people from there showed me just how important it is to be on the ground, getting a chance to meet real people and actually learn from different perspectives.","Reflecting on distinct countries, several differences stand out. Singapore and Hong Kong are aiming to become global business hubs, attracting significant capital. Many venture funds have opened headquarters in those cities, drawn by frequent and transparent regulatory updates. Japan is grappling with nuances of IP ownership. In Korea, centralized exchanges like Upbit often outperform giants like Binance (in part driven by Korea's crypto enthusiasm and restrictions on gambling). Vietnam, while lacking substantial capital, boasts a community of enthusiasts and developers. Meanwhile, Thailand doesn't have a prominent developer or enthusiast presence, but conglomerates are keenly eyeing the Web3 sector.","While these are broad generalizations in a sense, what I found was that each of these regions and countries deserve dedicated focus and attention. Each boasts builders, capital and users all waiting to dive first into Web3.","In Singapore, I’d would have never guessed we were in the middle of a bear market. No one was talking about what the prices were for any tokens, and were instead just excitedly talking about the new projects they’re either working on or investing in. And that’s the kind of spirit we’re going to need to carry us into whenever the next bull market might be.","What Singapore taught me more than anything else was to keep following my intuition of going where the excitement is. The reality is Web3 isn’t being built in North America and Western Europe only. It’s a global movement and we’ve got to be willing to immerse ourselves in its entirety if we’re to actually win. And to do that we need to properly embrace the multidimensional powerhouse that is the APAC region.","See also: Crypto Hubs 2023: Where to Live Freely and Work Smart","There are people innovating in ways we’re not even paying attention to that are working on the exact things to help us bring this technology to the mainstream. My impression is that this space is not about isolation and superiority but instead about interconnectedness.","The future of Web3 is as diverse as the world itself. True progress in this space is not about keeping to familiar terrains or resting on past laurels. It's about bridging gaps, understanding nuances and fostering global collaborations. Returning from Singapore, I carry not just memories but a renewed commitment: to seek out innovation, to continuously learn and to champion the essence of Web3. Its universality.","Whether in North America, Europe or any corner of the APAC, the heart of crypto beats in its collective ambition, its shared dreams and its boundless potential.","So, if you’re looking for me I’ll probably be somewhere in an Asian country near you.","\n"],"entity":[{"type":"Western Europe","content":"LOCATION"},{"type":"Vietnam","content":"LOCATION"},{"type":"North America","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"Korea","content":"LOCATION"},{"type":"APAC","content":"ORGANIZATION"},{"type":"end of the day","content":"TIME"},{"type":"Asia","content":"LOCATION"},{"type":"Japan","content":"LOCATION"},{"type":"Europe","content":"LOCATION"},{"type":"Singapore","content":"LOCATION"},{"type":"East","content":"LOCATION"},{"type":"Thailand","content":"LOCATION"},{"type":"Work Smart","content":"LOCATION"},{"type":"Hong Kong","content":"LOCATION"},{"type":"United States","content":"LOCATION"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Opinion","Apac","Asia","Singapore","Travel","Web3"],"authors":["Azeem Khan"]}