{"summary":"Trust Wallet is a secure place where you can store a wide variety of cryptocurrencies and NFTs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/trust-wallet-101-how-to-get-started\/","publishDate":"2022-07-14T21:09:34","id":15315,"type":null,"title":"Trust Wallet 101: How to Get Started","category":["Learn"],"content":["Trust Wallet is a free, non-custodial mobile wallet for storing cryptocurrency and non-fungible tokens (NFT). It is categorized as a hot wallet because it is directly connected to the internet. The app is only available on iOS and Android devices and is relatively simple to set up and use.","Trust Wallet was acquired by Binance in 2018 to be its official decentralized wallet. It has the ability to store over 4.5 million digital assets and supports over 65 blockchains. Being a popular wallet among traders and investors, it has been downloaded over 30 million times to date.","Though Binance’s Trust Wallet is compatible with various blockchains, Trust Wallet distinguishes itself from other popular wallets due to its interoperability with virtually all platforms based on Binance Smart Chain (BEP-20) such as PancakeSwap.","Read more: Your First Crypto Wallet","Once you download the app, there are a few simple steps to get started.","1. Select “Create a new wallet” and press “Continue” to accept the terms. Get a pencil and paper ready because the warning Trust Wallet gives you is real: If you lose your recovery words (sometimes also known as a seed phrase or recovery phrase) you may lose access to your wallet and the crypto within it forever.","2. A new screen will appear, prompting you to write down your recovery phrase. It is important you manually write it down and keep it in a safe, private place. Keeping the words in digital form is less secure and not recommended.","3. The recovery phase for Trust Wallet consists of 12 words. These words will be used in case you lose access to your wallet – and they are the only way to regain access to the wallet. So we’ll say it again: Keep them in a safe, private place.","Read More: Why Your Seed Phrase Is So Important","4. To verify that you backed up your recovery phrases, Trust Wallet will prompt you to write them in sequential order as you’ve received them.","5. You will get a screen stating, “Your wallet was successfully created.”","1. Now that you have your wallet, you’ll want to get some crypto into it. Start on the home screen by pressing the button labeled “Receive.”","2. You will now be brought to a screen where you need to select which cryptocurrency you want to receive. For our example, we’ll use BNB Smart Chain.","3. You can press “Buy” to enter a payment gateway to purchase BNB with your credit card.","4. Upon pressing the “Buy” button you can input the amount you want to buy in U.S. dollars, as the screenshot below shows (in the blue box), and choose the payment gateway such as MoonPay (shown in the red box).","1. If you opted not to buy tokens yet, you can also transfer tokens to your wallet. The process is similar to buying tokens. So, go to the home screen and press the button labeled “Receive.”","2. Then, you will be brought to a menu screen of cryptos where you select which cryptocurrency you want to receive. For our example, we’ll use BNB Smart Chain again.","3. Finally, press the middle button, “Receive,” to transfer your tokens to that address, as in the screenshot below.","Once you create your wallet account, you will notice a variety of buttons with different functionalities at your disposal such as having access to dapps to perform various transactions, as shown in the screenshot below.","These functionalities make Trust Wallet a Swiss Army knife type of solution for decentralized finance (DeFi). The one thing you can’t do within Trust Wallet is to exchange your crypto assets into fiat currency the way you can on exchanges such as Binance or Coinbase.","Trust Wallet is beginner-friendly but also has options that will satisfy more advanced users with functionality for DeFi and NFTs.","Having the option to store a wide array of cryptocurrencies within Trust Wallet makes it an appealing choice for those who want an all-in-one solution for managing their portfolio in the palm of their hands."],"entity":[{"type":"NFT","content":"ORGANIZATION"},{"type":"BNB","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Binance’s Trust Wallet","content":"ORGANIZATION"},{"type":"Trust Wallet","content":"ORGANIZATION"},{"type":"First Crypto Wallet","content":"ORGANIZATION"},{"type":"BNB Smart Chain","content":"ORGANIZATION"},{"type":"Swiss Army","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"20","content":"DATE"}],"hashtag":["Learn","Cryptocurrency","Beginner","Wallets","Binance Chain"],"authors":["Mike Antolin"]}