{"summary":"Traditional finance giants are excited about the idea of putting ownership of assets like precious metals, art, homes and more on the blockchain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/rwa-tokenization-what-does-it-mean-to-tokenize-real-world-assets\/","publishDate":"2023-07-25T21:06:46","id":15328,"type":null,"title":"RWA Tokenization: What Does It Mean to Tokenize Real-World Assets?","category":["Learn"],"content":["Imagine you want to buy an Andy Warhol artwork. Most of us can’t afford to fork over record-breaking sums like $195 million for a Marilyn painting or even $850,000 for a mere print of Queen Elizabeth. Many people want to buy art either for pleasure or as an investment but are priced out. But what if you could buy “shares” of an artwork like you can buy fractions of a publicly traded company? That’s the idea behind tokenization of real-world assets.","The Warhol use case is real: a company called Freeport offered fractionalized shares of Andy Warhol paintings, creating 1,000 tokens that represent shares of the work that anyone can buy. As of writing, for just under $200, I could own 1\/1000th of Warhol’s Rebel Without a Cause.","This tokenization of real-world assets (RWAs) isn’t just happening in art, but in bonds, cars, gold, houses and more. It’s a concept that’s gaining momentum and interest from traditional finance players.","In this piece, we’ll break down how real-world asset tokenization works and the advantages it offers to investors.","See Also: Tokenize Everything: Institutions Bet That Crypto’s Future Lies in the Real World","The core idea of real-world asset tokenization is basically to create a virtual investment vehicle on the blockchain linked to tangible things like real estate, precious metals, art and collectibles. So instead of the deed to a house being a physical piece of paper, the ownership is put on-chain. This could be traded between two parties directly, or fractionalized and offered to many people to buy.","The advantages of keeping the ownership of the real-world items on chain are many:","To take it back to the Warhol painting, if 1,000 people own shares of a single artwork, people can speculate and trade around those shares at any time, without any need to coordinate with the other owners. Instead of having a single seller have to work with a gallery, appraiser, lawyer and bank, each of whom will charge a fee or commission to sell to a single buyer, the seller and buyer can trade directly with each other and pay only minimal gas fees to instantly transfer the asset.","It’s not only high-value items like vintage cars, real estate and gold that are getting tokenized, but also U.S. Treasuries, currency and stocks.","Bob Ras, co-founder of the exchange and digital-asset ecosystem Sologenic, told CoinDesk that tokenized real-world assets for things such as stocks can account for fractional ownerships more efficiently and generate faster settlement times, noting that transactions on the blockchain don’t have the up-to-72-hour settlement time that traditional markets take. This speed and efficiency helps smaller investors with fewer funds be able to participate in investments that otherwise would be out of reach for them.","In the case of fiat currency, stablecoins are the most obvious form of real-world asset tokenization. Tokens such as Tether or USDC are tokenized dollars. Each token represents one actual dollar that the company has in reserve, and allows for faster and direct settlements between parties.","Read More: If DeFi Wants to Grow, It Has to Embrace Real-World Assets","Traditional finance firms are excited by the idea of tokenizing assets they already trade, such as gold, stocks and commodities. Investment fund giant Franklin Templeton launched the Franklin OnChain U.S. Government Money Fund in 2021 on Stellar and expanded to Polygon in 2023. The fund is the first U.S. registered mutual fund to use a public blockchain to process transactions and record share ownership.","The Bank of America recently called RWA tokenization a “key driver of digital-asset adoption.” According to their report, the tokenized gold market has captured over $1 billion in investment. There’s also a growing demand for tokenized U.S. Treasury bonds, with the combined market capitalization of tokenized money market funds nearing $500 million, according to data compiled by CoinDesk.","Right now, the future looks bright for tokenization with global business advisory firm Boston Consulting Group forecasting that the market for tokenized assets could mushroom to $16 trillion by 2030.","See Also: For Financial Advisors, Real-World Assets Could Be a Safe(r) Path to Crypto","Update (July 26, 15:36 UTC): Corrects date of Franklin Templeton's fund launch to 2021.","Edited by Jeanhee Kim."],"entity":[{"type":"$850,000","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"$16 trillion","content":"MONEY"},{"type":"July 26","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"Bank of America","content":"ORGANIZATION"},{"type":"Bob Ras","content":"PERSON"},{"type":"Queen Elizabeth","content":"ORGANIZATION"},{"type":"Franklin OnChain","content":"PERSON"},{"type":"Boston Consulting Group","content":"ORGANIZATION"},{"type":"2030","content":"DATE"},{"type":"$200","content":"MONEY"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Crypto","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Jeanhee Kim","content":"ORGANIZATION"},{"type":"Andy Warhol","content":"PERSON"},{"type":"UTC","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Warhol’s Rebel Without","content":"ORGANIZATION"},{"type":"$195 million","content":"MONEY"},{"type":"$500 million","content":"MONEY"},{"type":"Freeport","content":"ORGANIZATION"}],"hashtag":["Learn","Investing","Beginner","Tokenization","Real World Assets","Tokenized Assets","Explainers","Trading Week 2023"],"authors":["Toby Bochan"]}