{"summary":"The two crypto exchange giants signed a non-binding letter of intent, Binance CEO Changpeng \"CZ\" Zhao confirmed on Twitter.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/11\/08\/ftx-reaches-deal-with-binance-amid-liquidity-scare-sam-bankman-fried-says\/","publishDate":"2022-11-08T16:10:58","id":15321,"type":null,"title":"FTX Agrees to Sell Itself to Rival Binance Amid Liquidity Scare at Crypto Exchange","category":["Finance"],"content":["Binance agreed to buy rival cryptocurrency exchange FTX, a stunning outcome that followed days of speculation – spurred by a CoinDesk article on Nov. 2 – that FTX and corporate sibling Alameda Research faced a liquidity crisis.","The deal – which, like so much else during almost a week of drama, was revealed in tweets – unites two powerhouses of crypto trading. Early this year, FTX was valued at $32 billion, and Binance is the biggest crypto exchange by volume. Financial terms of the transaction were not disclosed, though FTX's U.S. division – a separate entity known as FTX US – is not included in the deal.","\"Things have come full circle, and FTX.com’s first, and last, investors are the same: we have come to an agreement on a strategic transaction with Binance for FTX.com (pending DD etc.),\" FTX CEO Sam Bankman-Fried tweeted Tuesday, referring to due diligence.","Binance CEO Changpeng \"CZ\" Zhao also took to Twitter to confirm the deal, saying the two exchanges signed a non-binding letter of intent. Bankman-Fried and Zhao both said that a full due diligence process would be underway in the next couple of days.","The deal comes in the wake of a CoinDesk scoop last week that triggered concern that the balance sheet of FTX's corporate sibling, Alameda Research, was too heavily reliant on illiquid tokens including FTX's own FTT. Both FTX and Alameda were founded and are largely owned by Bankman-Fried.","Read More: The Story of Sam Bankman-Fried’s Backroom Deal With Binance’s CZ","Some observers interpreted the story as meaning Alameda's finances – and therefore maybe FTX's – were not as solid as it had been thought.","Then Binance's CEO amped up the pressure on Sunday by saying he planned to sell his holdings of FTX's FTT token, since the CoinDesk story had shown that much of Alameda's balance sheet was made up of FTT. \"Liquidating our FTT is just post-exit risk management, learning from LUNA,\" he tweeted. \"We gave support before, but we won't pretend to make love after divorce. We are not against anyone. But we won't support people who lobby against other industry players behind their backs. Onwards.\"","Read More: FTX, Binance Deal Draws Antitrust Concern","CZ's decision pushed down FTT's price. Alameda's CEO, Caroline Ellison, then tweeted on Sunday the company would buy all of Binance's FTT tokens for $22 each in order minimize the impact on prices.","The situation worsened early Tuesday as FTX customers struggled to withdraw money from FTX. Dozens of customers complained in FTX’s Telegram group and on Twitter about difficulties they experienced. Roadblocks to pulling money out presaged several other crypto company failures in 2022.","Following the deal, FTX's FTT token initially rallied but that did not last long; after beginning the day just shy of $20, it was recently around $5.","Read more: Sam Bankman-Fried No Longer a Billionaire After $14.6B Overnight Wipe-out","UPDATE (Nov. 8, 16:40 UTC): Added additional information throughout.","UPDATE (Nov. 8, 16:59 UTC): Added additional information throughout.","UPDATE (Nov. 8, 17:25 UTC): Updated with info about FTX US and Binance.US in second paragraph.","UPDATE (Nov. 8, 21:12 UTC): Add's FTX's $32 billion valuation in second paragraph.","UPDATE (Nov. 9, 04:21 UTC): Updates FTT's price in final paragraph."],"entity":[{"type":"$32 billion","content":"MONEY"},{"type":"Sunday","content":"DATE"},{"type":"$20","content":"MONEY"},{"type":"Binance Deal Draws Antitrust Concern","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"FTT","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"$14.6","content":"MONEY"},{"type":"Caroline Ellison","content":"PERSON"},{"type":"$22","content":"MONEY"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Nov. 9","content":"DATE"},{"type":"Nov. 8","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$5","content":"MONEY"},{"type":"Alameda","content":"LOCATION"},{"type":"Tuesday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Nov. 2","content":"DATE"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["FTX","Binance","Mergers"],"authors":["Tracy Wang","Nick Baker"]}