{"summary":"The regulator invited applicants with a \"genuine interest in developing a stablecoin issuance business\" to join the sandbox.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/12\/hong-kongs-central-bank-starts-regulatory-sandbox-for-stablecoin-issuers\/","publishDate":"2024-03-12T09:59:45","id":15323,"type":null,"title":"Hong Kong's Central Bank Starts Regulatory Sandbox for Stablecoin Issuers","category":["Policy"],"content":["The Hong Kong Monetary Authority (HKMA) started a regulatory sandbox to give potential stablecoin issuers an environment for developing and testing certain operations without penalties.","The sandbox provides regulatory leeway and aligns with Hong Kong's plan to regulate fiat-backed stablecoins, which are cryptocurrencies pegged to the value of sovereign currencies like the U.S. or Hong Kong dollar, the regulator said on Tuesday.","\"Applicants should have genuine interest in developing a stablecoin issuance business in Hong Kong with a reasonable business plan, and their proposed operations under the sandbox arrangement will be conducted within a limited scope and in a risk-controllable manner,\" the HKMA notice said.","In December, the jurisdiction's regulators started seeking public views on its regulatory proposals for stablecoins – including requiring issuers to be licensed in order to operate in Hong Kong.","\"The HKMA wishes to leverage the sandbox arrangement to communicate supervisory expectations to parties interested in issuing fiat-referenced stablecoins in Hong Kong, as well as to obtain feedback from participants on the proposed regulatory requirements,\" the notice said.","Edited by Sheldon Reback.","\n"],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Hong Kong Monetary Authority (HKMA","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Hong Kong","content":"LOCATION"},{"type":"December","content":"DATE"},{"type":"HKMA","content":"ORGANIZATION"}],"hashtag":["Regulations","Stablecoin","HKMA","Hong Kong"],"authors":["Sandali Handagama"]}