{"summary":"The release is the product of a16z's first foray into deep tech research.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/04\/09\/venture-firm-a16z-releases-jolt-a-zero-knowledge-virtual-machine\/","publishDate":"2024-04-09T16:00:00","id":15325,"type":null,"title":"Venture Firm A16z Releases Jolt, a 'Zero-Knowledge Virtual Machine'","category":["Technology"],"content":["Silicon Valley venture giant Andreessen Horowitz (a16z) made news last year when it announced that it was wading into deep tech research – switching off its investor cap to become a part-time computer science researcher and builder. On Tuesday, the firm unveiled some of the first fruits of that foray with the release of an open-source code implementation for \"Jolt,\" its zero-knowledge virtual machine (zkVM).","In addition to positioning a16z as a bona fide research and development firm, the new code could help blockchains – and some of a16z's own portfolio companies – scale their operations.","Virtual machines, colloquially known as VMs, are software-based computer environments that serve as the foundation for blockchains and other programs. The \"zero-knowledge\" (ZK) bit of Jolt refers to a form of cryptographic trickery that powers a16z's VM under the hood – allowing the virtual computer to process and verify data while adhering to special constraints around privacy and security.","Jolt currently supports RISC-V instruction set architecture (ISA) – an open-source standard for designing computer processors – and applications written in the Rust programming language. Programmers can run an application through Jolt to \"verify its execution,\" explained Eddy Lazzarin, CTO at a16z crypto. The program will \"output a 'proof' that proves that the result of that program indeed came from the correct running of that program.\" A16z's big claim with Jolt is that it's \"10x\" faster than RISC Zero, its nearest competitor.","ZK cryptography has applications outside of blockchain, but ZK research has boomed in parallel with the industry's rise. So-called \"ZK proofs\" – the mathematical proofs outputted by ZK programs – have become the dominant method for helping blockchains reduce fees, increase speeds, and preserve transaction privacy.","Read more: What Are Zero-Knowledge Proofs?","The tech powers many of the so-called zkEVMs – zkVMs specific to Ethereum's runtime environment, known as Ethereum Virtual Machine, or EVM – that have emerged in recent years to make that blockchain quicker and more secure. (A16z is an investor in Matter Labs, one of the leading zkEVM makers).","ZK proofs “scale blockchains by kind of doing the hard work off-chain, and only having the blockchain verify the proofs,” Justin Thaler, an a16z researcher and associate professor at Georgetown University who co-authored the Lasso and Jolt research, explained in an interview last year. With ZK proofs, “you can get a guarantee that this work was done correctly, but not have all the blockchain nodes in the world doing all the work.”","While Jolt has not been fine-tuned for Ethereum or any other blockchain, a16z insists its tech can be layered into zkEVMs and other blockchain-based ZK applications. \"Fine-tuning specific circuits makes them very brittle. It's very hard and opaque to do that properly,\" said Lazzarin. \"Our techniques are not just simpler, but faster.\"","A16z first embarked on its deep tech journey in August of last year when it announced a pair of projects: Jolt, the one that's launching today, and Lasso, a special method for powering ZK systems that undergirds some of Jolt's programming.","Read more: Andreessen Horowitz Wades Into Crypto Tech Research with ZK Projects ‘Jolt’ and ‘Lasso’","According to Lazzarin, a16z embarked on its deep-tech research journey in part as a way to improve its cache as an investor: \"I mean, why take money from someone who is just money when you can take money from someone who is right there with you at the cutting edge, doing the hardest possible things in crypto?\"","But that's not the only way Lazzarin thinks a16z's research initiatives can help advance the firm's bottom line. The code for Jolt has been open-sourced, meaning anyone can theoretically use or repurpose it without paying a16z. \"Because we're long-term investors, we don't trade day-to-day, week-to-week, or even month-to-month,\" said Lazzarin. \"We benefit most if the space advances fastest over the next five to 10 years, and so our incentive is purely to advance everyone through public goods that we will never monetize.\"","Edited by Bradley Keoun."],"entity":[{"type":"Justin Thaler","content":"PERSON"},{"type":"Ethereum Virtual Machine","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Matter Labs","content":"ORGANIZATION"},{"type":"Lazzarin","content":"LOCATION"},{"type":"VMs","content":"ORGANIZATION"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Lazzarin","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Georgetown University","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"Eddy Lazzarin","content":"PERSON"},{"type":"Andreessen Horowitz Wades Into Crypto Tech Research","content":"ORGANIZATION"},{"type":"CTO","content":"ORGANIZATION"},{"type":"August","content":"DATE"}],"hashtag":["A16z","A16z crypto","Zero knowledge","Zero-Knowledge Proofs","Rollups","Zkevm"],"authors":["Sam Kessler"]}