{"summary":"The rise of solutions like the lightning network suggests crypto can have its cake and eat it too. Transactional scaling may just be the icing.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2018\/05\/30\/layer-2-blockchain-tech-is-an-even-bigger-deal-than-you-think\/","publishDate":"2018-05-30T12:00:40","id":15336,"type":null,"title":"'Layer 2' Blockchain Tech Is an Even Bigger Deal Than You Think","category":["Markets"],"content":["Michael J. Casey is chairman of CoinDesk's advisory board and a senior advisor of blockchain research at MIT's Digital Currency Initiative.","The following article originally appeared in CoinDesk Weekly, a custom-curated newsletter delivered every Sunday exclusively to our subscribers.","","","Welcome to the \"Layer 2\" era.","We are now entering an exciting new phase of blockchain development in which the lightning network and other programming solutions that operate \"on top\" of existing blockchains promise big strides in scalability, interoperability and functionality.","There is still much work to be done. The early tech is buggy, and new security and trust solutions must be figured out when much of the computing activity in individual transactions or smart contracts is taken \"off chain.\"","But in mitigating the heavy, multi-party computation that blockchains carry while ensuring that transaction histories are at some point anchored by \"on-chain\" consensus algorithms, there's something of a best-of-both-worlds promise in these ideas.","As Neha Narula, director of the MIT Media Lab's Digital Currency Initiative (where I work) describes it, the defining feature of Layer 2 is that \"computation is moved off-chain, either to enable privacy or to save computing resources.\"","Rather than having the script of a particular program executed by every computer in the blockchain network, it \"is implemented simply by the two or more computers involved in the transaction.\"","And yet, she said, \"you get similar security protections as with on-chain transactions because the blockchain acts as the anchor of trust.\"","Where this all goes is anyone's guess. That's what makes open-source, extensible platforms exciting: they provide the building blocks upon which unimaginable new applications can be developed.","We're not entirely driving blind, however. The development of the World Wide Web in the 1990s offers a useful source of contrast and comparison, when a similar, second layer solution transformed the Internet from being a clunky network of mostly academic users into a ubiquitous global phenomenon.","Similarly to then, I believe, we can expect an avalanche of innovation and development.","Stepping back, the 1989 implementation of Tim Berners-Lee's Hypertext Transfer Protocol (HTTP) on top of the base-layer Transmission Control and Internet protocols (TCP\/IP) paved the way for Marc Andreessen's Mosaic Netscape browser in 1994.","That then gave rise to a host of web-based applications, which ultimately fostered all the online services that now form part of everyday life.","In some respects, the sequencing will be different for the blockchain industry. We may already have had our version of the late-nineties dot.com bubble, for example, with last year's ICO mania coming before the enabling Layer 2 technologies were in place.","Still, a good amount of the billions raised in those token offerings will likely find its way into Layer 2 development, hopefully accelerating their march toward wider adoption.","Also, whereas HTTP was universally adopted as an almost immediate standard, there's a great deal of competition in Layer 2 blockchain solutions.","Lightning's payment channels were originally designed for bitcoin transactions, but it supports interoperability and has certain smart contract capability.","That could put it up against alternative \"state channel\" Layer 2 solutions for ethereum (Plasma, Raiden) as well as with projects aiming to enable cross-chain transactions (Polkadot, Cosmos, Interledger).","And, as seen at the L2 Summit hosted recently by MIT DCI and Fidelity Labs, there are many other lightweight off-chain ways to expand transactional capacity.","For example, developers at the startup Abra and elsewhere are using established, decentralized blockchains such as bitcoin and ethereum to settle futures contracts that are denominated in different currencies or tokens.","Already more than 2,000 nodes are on the Lightning Network, managing more than 7,000 channels. It's a long way from being a ubiquitous global network, but that growing community provides a great foundation for experimentation.","Now that a unique form of privacy-protecting smart contracts has been developed by Tadge Dryja, a co-author of the original Lightning white paper and now also at the DCI, there's an even greater potential for development.","Layer 2 projects developed around ethereum are also generating interest. At the Event Horizon conference on blockchain energy in Berlin last month, much buzz was generated by presentations on the capacity of Polkadot and Slock.It's Incubed client to enable off-chain, device-to-device transactions.","Meanwhile, with Ripple joining the Hyperledger consortium, corporate engineers will have opportunities to develop enterprise uses for the startup's Interledger protocol.","In this environment, we will see a competitive dance pit the interests of established corporates against Layer 2 startups such as Lightning Labs, Blockstream, Ripple and Parity, as well as potentially hundreds of independent coders around the world.","Ultimately, standards will arise, creating winners, with consortia like the World Wide Web Consortium, better known as W3C, emerging to shepherd that process.","And what of the economic fallout from all this? If the nineties are a lesson, we can expect that, eventually, many legacy industries could be disrupted.","Lightning's payment channels point to the kind of low-fee, fast-paced payments that bitcoin early on promised but failed to deliver. That would, in theory, take business away from banks, credit card companies and money transmitters.","Still, there's no guarantee regular Joes will get over their apprehension toward cryptocurrencies – not without as-yet-unavailable solutions for price volatility, for example.","There are also questions about how regulators will deal with a system that could make transactions very hard for them to track. Finally, it's still not clear that these off-chain solutions will achieve the kind of scale necessary without the emergence of powerful corporate interests.","Will such participants impose unwieldy costs on the system or simply provide much-needed liquidity? It's too early to say.","Another question is who will be the winners and losers in the crypto community. Might Layer 2 solutions deny miners the fees they need to continue securing the underlying blockchain? That was the topic of a recent Twitter exchange between Ryan Selkis and Jameson Lopp.","Here, the lessons from Wall Street in the late 1990s might also be instructive. Some investment banks worried about the hit to revenue as web-based e-trading slashed brokerage fees. In reality, online technology expanded the pie for stock market trading, benefiting incumbent players even as their per-trade margins shrank. It was an example of what's known as the Jevons Paradox.","History doesn't always repeat, of course. Miners may indeed be hurt by activity going off chain. But it shouldn't be our job to worry about them per se.","The goal here, as clearly defined in the Segwit debate that ultimately resulted in lightning's implementation on the bitcoin main-net, is for optimal decentralization and maximum security.","True innovation, by definition, is disruptive. So buckle up.","Wood layers image via Shutterstock"],"entity":[{"type":"Transmission Control","content":"ORGANIZATION"},{"type":"Marc Andreessen","content":"PERSON"},{"type":"1989","content":"DATE"},{"type":"Michael J. Casey","content":"PERSON"},{"type":"Fidelity Labs","content":"ORGANIZATION"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"1990s","content":"DATE"},{"type":"Berlin","content":"LOCATION"},{"type":"DCI","content":"ORGANIZATION"},{"type":"the Event Horizon","content":"ORGANIZATION"},{"type":"CoinDesk Weekly","content":"ORGANIZATION"},{"type":"Lightning Network","content":"ORGANIZATION"},{"type":"Jameson Lopp","content":"PERSON"},{"type":"Cosmos","content":"LOCATION"},{"type":"last month","content":"DATE"},{"type":"Ryan Selkis","content":"PERSON"},{"type":"Sunday","content":"DATE"},{"type":"1994","content":"DATE"},{"type":"Lee","content":"PERSON"},{"type":"MIT DCI","content":"ORGANIZATION"},{"type":"Blockstream","content":"LOCATION"},{"type":"World Wide Web Consortium","content":"ORGANIZATION"},{"type":"Netscape","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"W3C","content":"ORGANIZATION"},{"type":"Digital Currency Initiative","content":"ORGANIZATION"},{"type":"MIT","content":"ORGANIZATION"},{"type":"Tadge Dryja","content":"PERSON"},{"type":"MIT Media Lab's Digital Currency Initiative","content":"ORGANIZATION"},{"type":"Tim Berners","content":"PERSON"},{"type":"Neha Narula","content":"PERSON"},{"type":"TCP","content":"ORGANIZATION"},{"type":"Lightning Labs","content":"ORGANIZATION"},{"type":"Jevons Paradox","content":"ORGANIZATION"}],"hashtag":["Abra","Lightning Network","Raiden","Plasma","Token Economy","Features","Technology News"],"authors":["Michael J. Casey"]}