{"summary":"Shipments for bulk pre-orders of Bitmain&#x27;s flagship bitcoin ASIC miners are already lined up to Q3 2021 even as Bitmain boosts rig prices by as much as 20%","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/88151\/bitcoin-mining-hardware-bidding-war","publishDate":"2020-12-17T10:46:24","id":1533,"type":null,"title":"The bidding war for bitcoin mining hardware is heating up","category":["BITCOIN"],"content":["As bitcoin's price breaks new record highs above $20,000, the bidding war for top-of-the-line ASIC mining equipment is heating up again.&nbsp;","Shipments for bulk preorders of Bitmain's flagship bitcoin ASIC miners are already lined up to early Q3 of next year even as the manufacturer has raised rig prices by at least 20% since early December.","The Beijing-based manufacturer recently <a href=\"https:\/\/shop.bitmain.com\/\" data-v-f87c67ca=\"\">updated its quotes<\/a> for the newest batch of miners that are available for preorders with a shipment that won't start until at least June 2021. That suggests the current line of delivery queue has been extended by another two months.","For the June batch, Bitmain raised preorder prices by 20% compared to the April batches.","Preorders for Bitmain's AntMiner S19 Pro and S19 are now priced at $3,095 and $2,276, respectively. Archived quotes from Bitmain seen by The Block for the April\/May batches just a week ago were at $2,581 and $1,897, respectively.","The rig index <a href=\"https:\/\/hashrateindex.com\/machines\/sha256-rig-index\" data-v-f87c67ca=\"\">tracked<\/a> by crypto mining pool Luxor shows a similar trend. Prices for the most efficient and powerful mining models have gone up by 25% from $28 per terahashes per second of computing power (TH\/s) in mid-November to now $35 per TH\/s.","Shenzhen-based MicroBT, the main rival of Bitmain, told The Block that it has not yet released the preorders for the next batch of its flagship WhatsMiners. But it's expected that the prices will be adjusted to match up with bitcoin's recent price rally.","As <a href=\"https:\/\/www.theblockcrypto.com\/post\/84781\/bulk-preorders-bitcoin-miners-spring-2021\" data-v-f87c67ca=\"\">reported<\/a> last month, preorders for the two biggest manufacturers' mining equipment had already sold out until April 2021, following bitcoin's price surge since November.","What's also notable is that some of those buyers who placed preorders in September and October for Bitmain's January 2021 batch are posting quotes to resell the batch that's about to ship at a steep 75% to 90% price premium.&nbsp;","Quotes reviewed by The Block from several bitcoin miner resellers in China show that the ask prices for AntMiner S19 Pro with a January shipment — albeit in small quantities – are around $4,200 per unit. Similarly, the offers for S19, a less advanced model than S19 Pro, are between $3,250 and $3,500.","For context, archived information from Bitmain shows that the preorder prices for the January batch for S19 Pro and S19 three months ago were at $2,387 and $1,770, respectively.&nbsp;","<em data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Price list from a Chinese miner reseller as of December 15<\/span><\/em>","As The Block reported last month, institutionalized capital — especially from funds in the West — are among the main drivers of bitcoin equipment purchases in recent months.","Indeed, U.S.-based bitcoin mine operator Core Scientific said Thursday that \"it has executed agreements with Bitmain\" to facilitate the purchase, on behalf of its hosting clients, for more than 58,000 additional AntMiner S19 and S19 Pro products. The delivery cycle will run through September 2021.&nbsp;","Core Scientific didn't disclose details such as the prices or buyers behind the purchase. But the execution of agreements suggests the two parties could have price lock-in deals that would lower the cost below the market average.","Even assuming Core Scientific's average cost is at $2,000, which is lower than that of S19 Pro when it was rolled out in April, the latest purchase would be worth at least nine figures in U.S. dollar terms.","The new purchase also adds to the 17,000 units of S19 and S19 Pro that Core Scientific bought from Bitmain in June that were said be delivered by October.","All told, 75,000-plus units — when fully delivered and plugged in — would amount to over 7,000 petahahes per second of computing power among Core Scientific's hosting customers.","“Since our last purchase agreement with Bitmain in June, Core Scientific has witnessed surging demand from new and existing customers in addition to a significant uptick in institutional interest for digital asset mining in North America,\" Core Scientific's president and CEO Kevin Turner said in a press statement.","Core Scientific said in July that it is expanding the mining capacities hosted for the U.S. investment firm Horizon Kinetics, which has $5.3 billion in assets under management as of June this year.","The farm operator recently inked a deal with Foundry, the mining subsidiary of Digital Currency Group, to obtain up to $23 million in loans to finance its mining operations and meet client demand.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"The Block","content":"ORGANIZATION"},{"type":"Shenzhen","content":"LOCATION"},{"type":"April 2021","content":"DATE"},{"type":"January 2021","content":"DATE"},{"type":"September 2021","content":"DATE"},{"type":"Bitmain","content":"LOCATION"},{"type":"July","content":"DATE"},{"type":"Foundry","content":"ORGANIZATION"},{"type":"$2,000","content":"MONEY"},{"type":"mid-November","content":"DATE"},{"type":"April","content":"DATE"},{"type":"Luxor","content":"LOCATION"},{"type":"$5.3 billion","content":"MONEY"},{"type":"Bitmain","content":"ORGANIZATION"},{"type":"Beijing","content":"LOCATION"},{"type":"North America","content":"LOCATION"},{"type":"Thursday","content":"DATE"},{"type":"Kevin Turner","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"January","content":"DATE"},{"type":"June this year","content":"DATE"},{"type":"December","content":"DATE"},{"type":"$2,276","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"$1,897","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"$35","content":"MONEY"},{"type":"May","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"$1,770","content":"MONEY"},{"type":"Core Scientific","content":"ORGANIZATION"},{"type":"$3,500","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"$2,387","content":"MONEY"},{"type":"25%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$23 million","content":"MONEY"},{"type":"$2,581","content":"MONEY"},{"type":"December 15","content":"DATE"},{"type":"Horizon Kinetics","content":"ORGANIZATION"},{"type":"June 2021","content":"DATE"},{"type":"$3,095","content":"MONEY"},{"type":"$3,250","content":"MONEY"},{"type":"$28","content":"MONEY"},{"type":"75%","content":"PERCENT"},{"type":"Digital Currency Group","content":"ORGANIZATION"},{"type":"$4,200","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"China","content":"LOCATION"}],"hashtag":["BITCOIN"],"authors":["Wolfie Zhao","The Block"]}