{"summary":"The recent chaos around the centralized exchange FTX has sparked questions about the pros and cons of keeping your coins on centralized versus decentralized exchanges. We break it down.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/centralized-exchange-cex-vs-decentralized-exchange-dex-whats-the-difference\/","publishDate":"2022-11-15T16:12:18","id":15339,"type":null,"title":"Centralized Exchange (CEX) vs. Decentralized Exchange (DEX): What’s the Difference?","category":["Learn"],"content":["If you are considering buying or selling crypto, your first port of call will probably be an exchange. Most commonly, the first point of entry to trading cryptocurrency is a centralized exchange (CEX), a digital marketplace where crypto trading takes place. You have probably heard of a few: Binance, Kraken, Coinbase and so on. In Nov. 2022, a CoinDesk scoop led to a stunning turn of events that led to formerly popular exchange FTX collapsing and filing for bankruptcy.","This has led a lot of crypto investors to look for alternatives to centralized exchanges. The obvious alternative are a newer type of exchange that is decentralized such as Uniswap and Pancakeswap. These decentralized exchanges radically rethink how exchanges can work.","See Also: What Is an Exchange Token?","Decentralized exchanges (DEXs) have been emerging over the last five years to challenge incumbent CEXs. In brief, DEXs aim to offer lower transaction fees, let users directly hold their own assets and avoid some regulatory burdens. On the other hand, they face the cost of compensating their liquidity providers for a special kind of risk called “impermanent loss.”","CEXs offer advantages too. Most centralized exchanges use a business model similar to traditional institutions like the New York Stock Exchange, which is a structure traditional investors understand and may feel more comfortable with. Their interfaces and apps tend to be more beginner and user-friendly and generally offer more liquidity and stronger regulatory assurances, which can be especially important for institutional clients. But it also means the central company running the exchange has a lot of power and responsibility for the financial stability and health of the exchange.","See Also: How to Get Your Wealth Off an Exchange","If the recent drama around FTX has you considering moving to a DEX, here's what you need to know.","DEXs aim to complete transactions more quickly and cheaply than their centralized counterparts. They do this by cutting out the intermediary entities that take a cut of transaction fees on CEXs. The 2018 whitepaper of the world’s largest DEX, Uniswap, proclaims \"zero rent extraction.\" It aims to protect its users from the additional costs entailed in generating profit for the intermediaries that run CEXs. Bancor, which launched in 2017 and describes itself as the first DEX, advocates for the decentralized approach like this:","“Liquidity on traditional asset exchanges has historically been provided by a small handful of professional trading firms with permissioned access and specialized tools. This concentrates liquidity in the hands of a few actors who can withdraw their assets during periods of volatility and restrict trading of an asset when users need it the most.”","In late 2021, the leading DEX Uniswap was charging a 0.05% transaction fee on the $100,000 trade sampled by global accountancy KPMG. CEXs Binance, Coinbase and Kraken were charging 0.1%, 0.2% and 0.2%, respectively.","DEXs use “automated market maker” protocols to determine the prices of assets without a centralized body orchestrating trades. A common approach is the “constant product” mechanism, which determines prices offered as a function of the ratio of the DEX’s total reserves of each of the assets involved. This has the advantage of tending to keep reserves in relative balance: If any asset became scarce, it would become extremely expensive.","Nevertheless, DEXs still tend to offer roughly the same prices for assets as CEXs. This is because attentive traders or bots can quickly profit from any discrepancy in prices through arbitrage. If a certain pool contained very little ETH, it would have to let traders sell ETH into the pool at a higher price than the wider market indicated. Traders could easily profit by buying it in the wider market and selling it into the pool. As they did so, the volume in the pool would rise, reducing its offered price until it matched the wider market.","Read More: Understanding the Technology Behind Decentralized Exchanges","As neat as this system is, it does introduce a risk for the liquidity providers behind the pool. The risk is called impermanent loss. Liquidity providers are entitled to withdraw the portion of the value of the pool they contributed, not the exact number of tokens they put in. It could not promise all providers their exact tokens, because the ratio of different tokens held in the pool changes as trades occur. But as the ratio adjusts to reflect current wider market prices, the pool is going to progressively contain more of whatever token is losing value, and vice versa.","This means that a liquidity provider will tend to end up withdrawing more of the token that lost value and less of the one that gained value, compared with their starting assets. Therefore, they will end up poorer than if they had just held onto their assets privately. In practice, DEXs generally compensate liquidity providers through transaction fees. But that means charging higher fees than they would otherwise need.","Another part of the trade-off between DEXs and CEXs comes down to whether users would rather hold their own crypto directly or entrust it to the exchange. CEXs typically require that users place assets in their custody before trading.","Holding your assets yourself keeps to the ideal of self-reliance that permeates the crypto sector. You have full and exclusive control over them. But on the other hand, without due care, private keys can get lost or destroyed, rendering the associated assets irretrievable. Welshman James Howells mistakenly threw away a hard drive in 2013 and lost access to 7,500 bitcoins that would be worth well over $100 million as of Nov. 2022. He has repeatedly and unsuccessfully appealed to the local council to let him excavate its landfill site.","The growing popularity of DEXs may in part reflect their success in dodging some regulatory hurdles. The company that builds a DEX avoids acting as a financial intermediary or counterparty and does not have to meet know-your-customer (KYC) or anti-money laundering (AML) standards because it operates autonomously. ShapeShift used to be a CEX until its CEO said the company lost 95% of its users as a result of KYC measures it was forced to implement in 2018. In 2021, Shapeshift decidedly pivoted and became a DEX to shrug off this problem.","DEXs may struggle more than CEXs when working with larger investors. At this time, they cannot yet compete with the largest CEXs in size so they cannot offer as much liquidity. When they meet with insufficient liquidity, large orders can face unplanned additional costs called “slippage.” Furthermore, institutional investors face AML and other regulatory hurdles of their own and may struggle to deal with exchanges that do not submit to similar requirements.","Sergej Kunz, the co-founder of liquidity aggregator DEX 1inch Network, noted last year that banks and hedge funds had been slow to engage with decentralized finance (DeFi) because of their own regulatory hurdles. Although it is a DEX, his company now plans to launch a compliant product called 1inch Pro, specifically to cater to these clients.","New aggregator protocols like 1inch have emerged specifically to help larger investors avoid liquidity problems when using DEXs. 1inch raised $12 million in 2020 in a funding round led by Pantera Capital.","The rise of aggregators actually means that users can access liquidity from DEXs and CEXs at the same time. The protocol DiversiFi, which is itself a DEX, aggregates liquidity from both kinds of exchanges in order to help its users conclude larger trades more efficiently. This helps investors to avoid the costs that come with an exchange’s liquidity proving too small for their order.","When it comes to deciding which type of exchange to use, it boils down to two things: If you are you primarily interested in ease of use and are uncomfortable with being in total control of your own wallet then a CEX is probably the best option for you. If lower fees and more control over your own funds are most important to you, then a DEX is the way to go. Whichever way you go, make sure you know how to get your crypto off an exchange and into cold storage to keep your wealth safe in the long term.","See Also: Why Decentralized Exchanges Are Important in the Crypto Economy"],"entity":[{"type":"James Howells","content":"PERSON"},{"type":"2017","content":"DATE"},{"type":"$12 million","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"Crypto Economy","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"Coinbase","content":"PERSON"},{"type":"New York Stock Exchange","content":"ORGANIZATION"},{"type":"2018","content":"DATE"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"0.1%","content":"PERCENT"},{"type":"Shapeshift","content":"PERSON"},{"type":"Pantera Capital","content":"ORGANIZATION"},{"type":"last five years","content":"DATE"},{"type":"KPMG","content":"ORGANIZATION"},{"type":"AML","content":"ORGANIZATION"},{"type":"0.05%","content":"PERCENT"},{"type":"Sergej Kunz","content":"PERSON"},{"type":"2021","content":"DATE"},{"type":"Nov. 2022","content":"DATE"},{"type":"Uniswap","content":"ORGANIZATION"},{"type":"0.2%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Uniswap","content":"LOCATION"},{"type":"95%","content":"PERCENT"},{"type":"DEX","content":"ORGANIZATION"},{"type":"$100,000","content":"MONEY"},{"type":"2020","content":"DATE"}],"hashtag":["industry","Beginner","Learn"],"authors":["Benedict George","Toby Bochan"]}