{"summary":"Sky Mavis, the creator of NFT game Axie Infinity, has raised $152 million in Series B funding.\nThe round was led by Andreessen Horowitz (a16z), with participation from Accel and Paradigm.","author":["Yogita Khatri","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/119521\/axie-infinity-nft-series-b-funding-a16z","publishDate":"2021-10-05T07:37:46","id":1534,"type":null,"title":"Axie Infinity creator nets $152 million in Series B funding led by a16z","category":["Venture Capital"],"content":["Sky Mavis, the creator of blockchain-enabled, play-to-earn game Axie Infinity, announced on Tuesday a $152 million Series B round led by Andreessen Horowitz (a16z).","The announcement comes a day after The Information <a href=\"https:\/\/www.theinformation.com\/articles\/andreessen-horowitz-values-developer-of-nft-game-axie-infinity-at-3-billion\" data-v-f87c67ca=\"\">reported<\/a> that Sky Mavis is raising around $150 million in Series B funding at a valuation near $3 billion. Accel and Paradigm also participated in the round, said Sky Mavis.","With fresh capital at hand, Sky Mavis plans to expand its team, scale infrastructure, and build its own distribution platform to support game developers to create blockchain-enabled games.","The platform, dubbed The Mavis Hub, will seek to cut out middlemen and distribute games built on its proprietary Ronin blockchain.","\"We are on a mission to create economic freedom for gamers and are making this happen by turning players into owners of in-game assets unlike the traditional model where publishers, distribution platforms and game developers retain control and benefit the most,\" said Sky Mavis CEO Trung Nguyen.","As a play-to-earn game, Axie Infinity uses non-fungible tokens (NFTs) to reward players. By participating in the game, players breed, battle, and trade NFTs called \"Axies.\" Axie Infinity has grown to become the largest NFT gaming ecosystem, with more than 1.8 million daily active users logging into the platform in August. The game's total volume to date stands at over $2 billion, according to tracker <a href=\"https:\/\/cryptoslam.io\/axie-infinity\/sales\/summary\" data-v-f87c67ca=\"\">CryptoSlam<\/a>.","\"The game's growth is a phenomenal testament to how deeply this model is resonating with people around the world,\" said Arianna Simpson, general partner at a16z. \"The Axie team has triggered an earthquake in gaming and the industry is now forever changed.\"","The massive growth probably explains Sky Mavis's significant Series B round after a small $7.5 million funding round in May of this year. As part of its expansion plans, Sky Mavis is also launching a <a href=\"https:\/\/www.theblockcrypto.com\/linked\/119283\/axie-infinity-is-launching-a-decentralized-exchange\" data-v-f87c67ca=\"\">decentralized exchange<\/a> for trading Axies, as The Block reported recently."],"hashtag":["SERIES B"]}