{"summary":"The federal government’s recent actions against crypto are – rightly or wrongly – widely perceived as a coordinated attempt to maim digital assets. This risks sending a vital industry overseas without actually protecting investors.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/03\/30\/coindesk-editorial-it-sure-looks-like-the-us-is-trying-to-kill-crypto\/","publishDate":"2023-03-30T14:46:40","id":15348,"type":null,"title":"Editorial: It Sure Looks Like the U.S. Is Trying to Kill Crypto","category":["Consensus Magazine"],"content":["When walking my dogs, I often run into a septuagenarian named “Harry” (not his real name), a former New York City detective who each morning feeds a colony of stray cats at a nearby golf course. We’ve bonded over animals, but that’s where the touchy-feely part of Harry starts and ends. His worldview includes belief in several QAnon conspiracy theories, and that another American Civil War is around the corner. He’s been waiting for the “signal.”","Sometimes I engage with Harry, other times I just listen. Sometimes we talk about cryptocurrency while he says “hello” to the pups. A couple of days ago, I told him it’s been a rough stretch for the sector, with a banking crisis and government pressure ramping up fast.","Kevin Reynolds is CoinDesk's editor-in-chief.","He responded quickly: “Did you really think that central banks and governments would allow a competitor to fiat money to exist?”","That stopped me cold. Here he was spouting a conspiracy theory that I’d been finding it increasingly hard to argue against.","Over the course of just a few weeks, it has become increasingly easy to believe – rightly or wrongly – that in its understandable desire to Do Something in the wake of the collapse of cryptocurrency exchange FTX, the regulatory and administrative state of the United States of America is trying to kneecap (if not out-and-out neuter) all of crypto as a technological project within its borders.","As conspiracies go, this one doesn’t need much suspension of disbelief. Even well-placed observers, including former regulators, have characterized this as a coordinated attack. Heck, the current administration’s animus against cryptocurrency is clear in official statements, and then there’s all the actions. After ignoring industry pleas for guidance and regulation for years, the U.S. government seems to be going after all parts of crypto with a vengeance.","The assault has included a series of enforcement actions by the Securities and Exchange Commission (SEC) against regulated U.S. crypto entities including Kraken and Coinbase, while just this week the Commodity Futures Trading Commission (CFTC) sued Binance. The Biden administration last week also released its “Economic Report of the President,” which made the case that cryptocurrency is not a useful technology while focusing on a series of crypto-inspired criminal frauds that unfolded in recent years.","My reasons for disbelieving that there is coordinated ill-intent are twofold, one rooted in idealism and the other cynicism. First, this is the U.S., the land of opportunity and freedom. A deliberate attack against the economic freedom that crypto represents would run against this country’s values. Second, this is the U.S., the land of crumbling infrastructure. Our leadership can’t even muster the coordination necessary to repair the country’s bridges and railways. It is too depressing to imagine they might be more aligned on destroying the financial infrastructure of the future than maintaining the physical infrastructure of the present. Supporting the lack-of-coordination side of the argument is how the CFTC, in its suit against Binance, claims the cryptocurrency ether is a commodity while the SEC and the New York Attorney General both argue it’s a security.","But whether this is a coordinated effort against crypto or not may be irrelevant. Some people are convinced it’s real, and not just my friend Harry. The idea is rampant now: The U.S. has it in for crypto. So some firms are looking at moving overseas, while others are worried they will lose or be unable to obtain bank accounts. And it’s not just industry folk who believe this. Bankers, for instance, are declining invitations to speak at crypto gatherings, fearful of painting targets on their institutions’ backs.","Without a significant change of course by the Biden administration, the view that the U.S. is anti-crypto will soon become too entrenched to uproot. The fact that most of the U.S. government’s actions have been punitive rather than constructive is a huge factor.","Regulators and the White House need to make it clear that crypto has a future on U.S. shores, and there’s no better way to do that than by giving the digital-asset industry the clarity it has been begging for. Blueprints for a more appropriate framework have been laid out in proposed legislation such as the Lummis-Gillibrand Responsible Financial Innovation Act in the Senate. We, along with much of the crypto world, would welcome such clarity, but regulators and many other lawmakers have seemed reluctant to provide it.","CoinDesk almost never adopts a formal position on issues. As noted in the past, we typically leave the task of presenting the organization’s common perspective to the breadth and balance of the newsroom’s reporting, rather than taking an official point of view on any given topic. That we are doing so here reflects our view that, in this case, our position should be made clear. The editorial leadership believes the threats facing crypto due to recent U.S. actions – regardless of whether they’re deliberate – are existential enough to merit taking a stand on behalf of a technology and industry that are a potential good and a force for economic empowerment.","We do not believe these attacks will succeed in their stated goal of protecting Americans from fraud and scams. Early reactions suggest it is highly likely to push technological innovation outside of U.S. borders. This would, among other impacts, make entirely fraudulent activities indistinguishable from legitimate efforts at innovation for all but the most savvy insiders.","We are alarmed by signs the crackdown exceeds the authority of regulators under current law and violates the spirit of freedom and innovation that underpin the U.S. and the cryptocurrency world.","It looks like regulators are attempting to block cryptocurrency firms from accessing conventional banking services. Former Congressman Barney Frank, architect of stricter banking regulations following the 2008 financial crisis, has alleged that Signature Bank, where he was a board member, was forced into liquidation by the New York Department of Financial Services (NYDFS) because “regulators wanted to send a very strong anti-crypto message.” NYDFS has denied that allegation.","But the claim seems to be supported by banking authorities’ recent moves. On March 16 Reuters reported the Federal Deposit Insurance Corp. (FDIC) was requiring potential buyers of Signature Bank to pass over the bank’s crypto clients, essentially denying them further banking services. The FDIC denied this – yet when the sale went through, crypto customers were indeed excluded from the acquisition.","Some have dubbed this sub-rosa effort “Operation Choke Point 2.0” – an apparent sequel to an Obama-era campaign to de-bank legal but politically undesirable businesses including gun manufacturers and payday lenders. These measures appear to circumvent not only due process but to repeat violations for which previous administrations have already been firmly disciplined by both legislators and the legal system.","Strikingly, the current head of the FDIC, Martin Greunberg, was an architect of the original Operation Choke Point.","That effort was ultimately met with a wave of lawsuits and hearings that, by and large, concluded the government had abused its power. In part to help settle various lawsuits, the FDIC promised internal reforms to prevent regulatory overreach against legal businesses, including putting an end to unwritten suggestions to banks about their choice of customers. The sincerity of that promise now seems questionable.","CoinDesk is working to uncover the real story behind recent incidents and discover whether there really is a coordinated effort to starve the crypto industry. But the appearance of the abuse of government power is enough to justify raising an alarm, even before the full picture is clear.","This appearance of an unstated anti-crypto agenda must be distinguished from recent legal actions against specific swindlers who have victimized the crypto world. We know very well that crypto, like many frontier technologies before it, is extremely appealing to fraudsters. We applaud the prosecution and likely imprisonment of alleged criminals including Do Kwon and Sam Bankman-Fried. We actively work to stop fraud: CoinDesk’s award-winning journalists were substantially responsible for uncovering massive alleged fraud at FTX, and we warned investors away from both the crypto lender Celsius Network and Kwon’s Terra before they collapsed.","But denying the developers of cryptocurrency tools and the creators of cryptocurrency services the ability to manage their dollar funds in U.S. banks is not an anti-fraud measure. It is a daisy-cutter bomb likely to cause indiscriminate carnage. Failing to establish a clear framework for the regulated issuance of digital assets, similarly, ultimately makes frauds harder for consumers and law enforcement to stop, because it eliminates any route to legitimacy for even the most high-minded digital asset-based projects.","This apparent effort to strangle crypto is also having significant knock-on effects. As mentioned earlier, bank officials are markedly less willing to speak on the record about crypto or to take part in public panels on the subject believing that they will somehow fall afoul of regulators. And forget about trying to get a central banker to speak on the record. As a result, the debate over the future of the industry risks becoming a pro-crypto echo chamber, rather than a crucible from which real truths, and real innovations, can emerge.","There is also the risk of crypto becoming politicized. The digital-asset community has often shunned party politics, preferring to uphold larger principles of freedom and personal autonomy. In fact, constructive, bipartisan crypto legislative proposals have largely been the norm – most notably the comprehensive bill sponsored by Senators Cynthia Lummis (R-Wyo.) and Kirsten Gillibrand (D-N.Y.). But now the perception that the administration is anti-crypto is threatening to destroy that open collaboration. How someone feels about crypto could soon depend on political affiliation. No one wins if that happens.","Cryptocurrency does have real-world uses and benefits, including serving as a financial alternative for those facing repression and violence around the world. In just one example, cryptocurrency allowed $100 million in aid to quickly reach Ukraine in the wake of Russia’s invasion – faster than aid was able to move through more formal government channels.","More broadly, crypto has become a nexus of advocacy for tools that resist the dangerous concentration of digital power in the hands of companies whose hoards of data make surveillance and censorship their primary stock in trade. The worrying rise of surveillance capitalism is a topic of clear concern for many of the legislators whose authority bank regulators currently appear to be usurping.","While speculation drives much of the market activity in digital assets (much like the market for technology stocks), their prices are also driven by real demand from current users. Billions of dollars in value move around the world over the Bitcoin network every day.","Bitcoin and many other cryptocurrencies would survive even a sweeping, indiscriminate regulatory crackdown functionally unscathed. That’s their entire point: These systems were conceived with the goal of empowering individuals to control their own fates in the digital era, separately from government and corporate structures.","In this respect, cryptocurrency tests principles of government restraint foundational to the American ethos. The religious, free speech and other rights enshrined in the U.S. Constitution are blueprints for the spread of liberty around the world. They have helped increase human flourishing, happiness and wealth for millions.","These protections seem normal to many Americans now, but they were once considered dangerous and destabilizing forces by established powers. To this day, even on American soil, authoritarians persistently return to old habits, seeking the illusion of safety through censorship and restriction.","Given that reality, it will clearly be the project of many years to make financial autonomy as much of a taken-for-granted protection in democratic societies as freedom of speech and religion are today. If I’m wrong and authorities do intend to restrain that progress, they should declare that goal openly and pursue it through transparent democratic channels.I hope my conspiracy-theory-believing friend is incorrect and the Biden administration is not out to kill crypto. Assuming that’s the case, the White House needs to clearly demonstrate its positive intent. For instance, it should support a bipartisan effort to legislatively mandate that the SEC establish clear guidelines on securities laws as they pertain to digital assets. Given the rampant cynicism that has erupted in response to the government’s heavy-handed actions toward crypto, nothing short of that will make the industry believe it doesn’t need to flee the U.S. in search of safety.","Go ahead, prove Harry wrong.","Edited by Ben Schiller and Nick Baker."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Ben Schiller","content":"PERSON"},{"type":"$100 million","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Gillibrand Responsible Financial Innovation","content":"ORGANIZATION"},{"type":"Celsius Network","content":"ORGANIZATION"},{"type":"Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Obama","content":"PERSON"},{"type":"White House","content":"ORGANIZATION"},{"type":"United States of America","content":"LOCATION"},{"type":"Lummis","content":"LOCATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Barney Frank","content":"PERSON"},{"type":"Kirsten Gillibrand","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Russia","content":"LOCATION"},{"type":"Martin Greunberg","content":"PERSON"},{"type":"Cynthia Lummis","content":"PERSON"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"N.Y.","content":"LOCATION"},{"type":"New York Department of Financial Services","content":"ORGANIZATION"},{"type":"The U.S.","content":"LOCATION"},{"type":"Operation Choke Point","content":"ORGANIZATION"},{"type":"Wyo.","content":"LOCATION"},{"type":"March 16","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Signature Bank","content":"ORGANIZATION"},{"type":"FDIC","content":"ORGANIZATION"},{"type":"Harry","content":"PERSON"},{"type":"Reuters","content":"ORGANIZATION"},{"type":"CFTC","content":"ORGANIZATION"},{"type":"Federal Deposit Insurance Corp.","content":"ORGANIZATION"},{"type":"Kevin Reynolds","content":"PERSON"},{"type":"Biden","content":"PERSON"},{"type":"the U.S.","content":"LOCATION"},{"type":"Senate","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Opinion","US","Regulation"],"authors":["Kevin Reynolds"]}