{"summary":"The move comes after fellow spot bitcoin ETF issuer Bitwise drew applause from industry experts for making its wallet address public in January.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/28\/ark-and-21shares-to-disclose-spot-bitcoin-etf-reserves-via-chainlink-integration\/","publishDate":"2024-02-28T14:00:00","id":15346,"type":null,"title":"Ark and 21Shares to Disclose Spot Bitcoin ETF Reserves Via Chainlink Integration","category":["Finance"],"content":["Asset managers Ark Invest and 21Shares have taken a step towards more transparency for their ARK 21Shares Bitcoin ETF (ARKB) by integrating Chainlink’s Proof of Reserve platform to verify holdings data, the companies announced Wednesday.","“This collaboration allows us to offer an unmatched level of insight and safety for our investors' holdings for ARKB,“ Ophelia Snyder, co-founder and president at 21Shares said.","The move comes after fellow spot bitcoin ETF issuer Bitwise in January disclosed its digital wallet address showing the holdings for its Bitwise Bitcoin ETF (BITB). The transparency providing effort was widely applauded by industry experts. Ark\/21Shares will now be the second issuer to bring holdings data onchain.","ARKB has been among the more successful of the 10 spot bitcoin ETFs launched on Jan. 11. As of the end of the day Monday, the fund had accumulated 33,274 bitcoin and assets under management above $1.8 billion, which is the third highest among the issuers. Only Fidelity’s Wise Origin Bitcoin Fund (FBTC) and BlackRock’s iShares Bitcoin Trust (IBIT) have attracted more capital.","Edited by Stephen Alpher."],"entity":[{"type":"$1.8 billion","content":"MONEY"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Bitwise Bitcoin ETF","content":"ORGANIZATION"},{"type":"Bitwise","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Chainlink’s Proof of Reserve","content":"ORGANIZATION"},{"type":"Ophelia Snyder","content":"PERSON"},{"type":"Jan. 11","content":"DATE"}],"hashtag":["Bitcoin ETF","ARK Invest","21Shares","Avalanche","Chainlink"],"authors":["Helene Braun"]}