{"summary":"A campaign donor told The New York Times that Santos and two others appeared to be trying a crypto-centric version of the classic Nigerian scam on him.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/07\/27\/disgraced-congressman-george-santos-involved-crypto-in-nigerian-prince-like-scheme-nyt\/","publishDate":"2023-07-27T21:07:25","id":15341,"type":null,"title":"Disgraced U.S. Congressman George Santos Involved Crypto in Nigerian Prince-Like Scheme: NYT","category":["Policy"],"content":["George Santos, a first-term member of the House of Representatives, is under indictment for thirteen felonies, including allegedly embezzling contributions from supporters, fraudulently collecting unemployment checks and lying in disclosures to the House. But one of his more bizarre schemes, which involved cryptocurrency, seemed to be inspired by the classic Nigerian prince email scheme, according to a New York Times report.","According to a campaign donor who spoke to the Times, Santos and two other men approached him claiming there was a wealthy Polish citizen who wanted to buy cryptocurrency but couldn’t because his assets were frozen. The trio didn’t say why the assets were frozen, nor provide the name of the Polish investor, but wanted the donor to create a limited liability company to help them gain access to the funds.","The donor told the Times he was struck by how much their pitch sounded like the classic Nigerian prince email scam in which a wealthy foreigner asks someone for help gaining access to frozen assets. He asked for more information, and Santos and associates asked the donor to sign a non-disclosure agreement. The donor then asked for changes to the agreement, and the talks ended there.","The scheme involved Santos, former Republican state assemblyman Michael LiPetri and Bryant Park Associates, a company run by Republican donor Dominick Sartorio, according to the report. LiPetri told The Times that he was aware of Santos’ efforts but wasn't involved “in detail” and said no deal ultimately happened.","A request for comment for this story sent to Santos' lawyer was not immediately returned.","Thirty-five year old Santos, who represents New York’s 3rd congressional district, was arrested and charged with thirteen felonies in March and pleaded not guilty.","The intersection of crypto and politics has recently moved beyond regulatory discussions into more detailed – and sometimes unusual – territory. U.S. Democratic Presidential candidate Robert F. Kennedy Jr. appeared in a Twitter Spaces on Wednesday where he finally confirmed owning bitcoin and called the cryptocurrency a “currency of freedom.” He has also said if elected, he would move to back the U.S. dollar with bitcoin and exempt bitcoin from taxes."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Michael LiPetri","content":"PERSON"},{"type":"Robert F. Kennedy Jr.","content":"PERSON"},{"type":"Dominick Sartorio","content":"PERSON"},{"type":"House","content":"ORGANIZATION"},{"type":"House of Representatives","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Times","content":"ORGANIZATION"},{"type":"Wednesday","content":"DATE"},{"type":"Bryant Park Associates","content":"ORGANIZATION"},{"type":"George Santos","content":"PERSON"}],"hashtag":["George santos","U.S. House of Representatives","Scams"],"authors":["Brandy Betz"]}