{"summary":"Vijay Chetty has joined the web3 rollup provider Eclipse as Chief Business Officer.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238747\/former-uniswap-and-dydx-head-joins-rollup-provider-eclipse","publishDate":"2023-07-11T09:00:24","id":1535,"type":null,"title":"Former Uniswap and dYdX head joins rollup provider Eclipse","category":["COMPANIES"],"content":["Vijay Chetty has joined the web3 rollup provider <a href=\"https:\/\/www.theblock.co\/post\/223991\/injective-and-eclipse-partner-to-bring-solana-virtual-machine-to-cosmos-ecosystem\" data-v-f87c67ca=\"\">Eclipse<\/a> as Chief Business Officer.","Chetty is the former Head of Business Development for the teams behind Uniswap and dYdX, both decentralized exchanges. In his new role at Eclipse, Chetty will scale Eclipse and help accelerate rollup adoption more broadly in the crypto industry.","Within his first month at Eclipse, Chetty told The Block that he plans to launch self-service support for one-click deployments of Eclipse roll-ups. By six months, he intends to add support for other more blockchain virtual machines in addition to decentralizing the Eclipse sequencer. Finally, within one year at the firm, Chetty wants to fully open-source Eclipse while launching and scaling an ecosystem fund.","\"We're beyond excited to welcome Vijay to the Eclipse team,\" Eclipse CEO Neel Somani said in a statement. \"Given Vijay's proven track record launching and scaling dYdX and Uniswap, he navigated the exact challenges that Eclipse solves. This marks the expansion of Eclipse's DeFi offering in addition to the suite of growing use cases powered by our cross-ecosystem infrastructure.\"","<a href=\"https:\/\/www.eclipse.builders\/\" data-v-f87c67ca=\"\">Eclipse<\/a> provides scalable, customizable blockchains called \"rollups\" that can be tooled for a project's specific needs, such as DeFi or gaming. Rollups are built on-top of a Layer 1 blockchain such as Ethereum to process transactions more quickly.","<em data-v-f87c67ca=\"\">This article has been updated with Chetty's plans at Eclipse.<\/em>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Eclipse","content":"ORGANIZATION"},{"type":"Neel Somani","content":"PERSON"},{"type":"Chetty","content":"ORGANIZATION"},{"type":"Vijay Chetty","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"Chetty","content":"PERSON"},{"type":"ups","content":"ORGANIZATION"},{"type":"Head of Business Development","content":"ORGANIZATION"}],"hashtag":["HIRING"],"authors":["MK Manoylov","The Block"]}