{"summary":"The approval of the spot bitcoin ETFs constituted a landmark event for the $1.7 trillion digital asset industry. With institutional investors on board, demand for bitcoin will grow significantly.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/02\/15\/crypto-for-advisors-impact-of-the-spot-bitcoin-etfs-for-portfolios\/","publishDate":"2024-02-15T16:45:00","id":15351,"type":null,"title":"Crypto for Advisors: Impact of the Spot Bitcoin ETFs for Portfolios","category":["Finance"],"content":["We’ve passed the one-month mark since the spot bitcoin ETF approvals in the US, and now we have real-world data to review. In less than a month, the spot ETFs are boasting $10 billion of AUM, with inflows reaching one billion in one day alone. For context, the spot ETFs must acquire and hold the underlying asset, bitcoin, of which there will only be 21 million.","As the market watches the interest in these ETFs, the conversation naturally includes portfolio construction - how much bitcoin should I have in my portfolio? Gregory Mall from AMINA Bank looks at different methodologies for including crypto in a portfolio.","Marcin Kaźmierczak from RedStone Oracles discusses staking and earn products in the Ask an Expert section. Several firms have now submitted spot Ether applications to the SEC. Will they gain approval next?","Happy reading.","– S.M.","You’re reading Crypto for Advisors, CoinDesk’s weekly newsletter that unpacks digital assets for financial advisors. Subscribe here to get it every Thursday.","In a widely publicized decision, the S.E.C. authorized 11 funds to begin trading on Jan. 11. With the approval of the first spot bitcoin ETFs in the U.S., investors worldwide are closely monitoring the potential implications on the broader asset class over the short and the medium to long-term.","Buy the rumour – sell the fact?","Bitcoin led a significant rally in cryptocurrencies over the course of 2023 with a 160% price gain. After a scandal-ridden year of 2022 which saw the demise of 3AC, Celsius, FTX, the ink was not dry on the obituaries as bitcoin staged an impressive comeback. A big driver of the price resurgence was the anticipation of an SEC approval for the first spot bitcoin ETFs in the U.S.. When BlackRock filed for a bitcoin ETF on June 15, 2023, bitcoin jumped by approximately 22% within one week. When it became clear that the S.E.C. would not appeal the ruling of the Court of Appeals on Oct. 23, bitcoin once again surged by 15% within two days. While other factors such as the decrease in U.S. yields in Q4 and a recognition of macro tailwinds contributed to the year-end rally, the main catalyst was indeed the spot ETF. The fixation of the asset class around this binary event was always going to come with some risks. A subsequent lack of narrative would – according to the naysayers - lead to a classic buy-the-rumor-sell-the-fact situation. An entire asset class clinging on to a binary event was the proof that crypto still had a long way to go to become mainstream.","While bitcoin has traded on an upbeat note since the approval, the massive retracement that many technical analysts had predicted has not materialized. Flows into the new funds have been encouraging with overall inflows of 9.7 billion recorded Feb. 12.","Implications for the growth of the asset class in the medium term","The approval of the spot bitcoin ETFs constituted a landmark event for the $1.7 trillion digital asset industry. With institutional investors on board, demand for bitcoin will grow significantly. For example, analysts at Galaxy Digital, attest to an inflow of $14.4 billion into the spot ETF in the year of its launch, followed by $27 billion in the second year and $39 billion in the third year. The inflows would come primarily through the channels of the asset management sector, which currently does not have access to secure bitcoin exposure on a large scale. The investments in the billions would also significantly change the value of the cryptocurrency.","Such institutional inflows are likely to further cement cryptocurrencies' status as an asset class. Liquidity could become more stable overall and the price of bitcoin less susceptible to extreme price fluctuations. Furthermore, there are positive secondary effects such as the approval of spot ETFs on additional cryptocurrencies, inflows from VC-money into the asset class and increased acceptance of cryptocurrencies as a payment alternative. The approval of a spot Ether ETF is the next event to watch. Deadline is May 23.","How to Gain Exposure in a Balanced Multi Asset Portfolio","Adding a small crypto allocation to a multi-asset portfolio can enhance returns without affecting the risk profile of the portfolio. Graph 1 shows the increase in efficient frontier by allocating a small proportion of a balanced portfolio to bitcoin.","Graph 1- Efficient Frontier Balanced Portfolio (with and without bitcoin allocation)","Balanced Portfolio consisting of 50% MSCI World AC, 40% Bloomberg Barclay Global Aggregate Index, 10% Bloomberg Commodity Index. Source: AMINA Bank. Start Date: 01.01.2016, end date: 29.12.2023.","While most institutional investors agree that cryptocurrencies have a role to play in their portfolio, the question that divides the profession is what is the most efficient way to gain exposure to the asset class? Bitcoin? A basket of coins? Which coins should one include into a basket? What is the weighting methodology? How often should one rebalance? From universe selection to regulatory compliance to market structure and liquidity, many factors can shape the outcome of investments in this sector.","A strict adherence to market cap weighting may lead to an over-concentrated portfolio (mostly in BTC and ETH) and limit the exposure to altcoins, potentially affecting portfolio diversification. An alternative approach addresses the issues highlighted above by implementing a smart-beta allocation based on risk parity plus market cap aimed at increasing the exposure to alt-coins in a systematic and controlled manner. Other “factor” weighted methodologies may show similarly promising results for long-term buy-and-hold investments.","When allocating to cryptocurrencies, it is worthwhile going beyond the simple question of position sizing but thinking of diversification, coin selection, rebalancing frequency and weighting methodology.","- Gregory Mall, head of investment solutions, AMINA Bank","Q: What are crypto earn products and how to classify them?","A:","Crypto earn products have gained immense popularity over the years. They operate similarly to automated fund managers, you deposit cryptocurrencies like USDC or ETH and the platform handles the optimal yield strategy. The two categories are centralized and decentralized solutions. In the first bucket, we have exchanges like Binance and custodial providers like Nexo. The second bucket includes DeFi applications like Instadapp or Sommelier.","\nCentralized solutions typically implement simple staking or trading strategies, whereas the latter group apply mechanisms like lending, liquid staking, and liquidity provision underneath. Investors tend to leverage Earn products due to their ease of use, simple tutorials and automated fund management. Centralized options are popular due to straightforward compliance and simpler user experience, whereas decentralized alternatives often outpace CeFi in terms of innovation, flexibility, transparency and rewards. The inherent advantage of the market is its 24\/7 availability, users can deposit and withdraw their assets whenever they want.","Q: What framework should I follow when choosing an earn product for my assets?","A.","Centralized earn products do not differ much from each other. The major decision lies in picking the platform and trusting it will not collapse. Thankfully, operations on these products are the same as on regular Internet platforms. The non-custodial decentralized space requires spending gas on each interaction and many times requires more steps for similar outcomes.","On the flip side, the DeFi scene is spicier with a variety of application types catering to users' investment preferences and risk tolerances. Following the rules of nature, the higher the potential returns, the higher the risks. The major categories with some leaders are Services (Instadapp, DeFi Saver), Yield (Pendle, Convex), Yield Aggregators (Yearn, Sommelier), Indexes (Enzyme, Origin) and Leveraged Farming (DeltaPrime, Gearbox). A framework for picking the platform should include an assessment of the following:","Q: What to expect in the yield sector this year and beyond?","A:","With the acceptance of the spot bitcoin ETF and Ether ETF approaching, many expect an upward market trend. Unfortunately, such an environment fosters scams and projects promising pie in the sky. Investors should be especially cautious in the rally, not to fall for platforms resembling the mechanics of Celsius, Voyager or FTX. One dynamic that firmly establishes its presence in the sector is the standardized ETH staking yield. Users can perform solo staking, join staking pools or be exposed to liquid staking. The constantly growing popularity of the last group led to the emergence of platforms like Lido, RocketPool, Swell, Stader, StakeWise and many more. CESR, a standardized ETH staking rate by Coindesk Indices, has a chance to capture the normalized staking yield well when implemented into an earn product. In the DeFi space, earn products enabling liquid restaking like EtherFi and exposure to Eigenlayer rewards like Renzo and KelpDAO have been playing the first fiddle for the past weeks and that trend will explode only further in the first half of 2024.","— Marcin Kaźmierczak, co-founder & COO, RedStone Oracles","BlackRock’s newly launched spot bitcoin ETF has become one of the top five exchange-traded funds in 2024.","Statista forecasts that the global digital asset market revenue will be over 80 billion in 2024.","Microstrategy calls itself “a bitcoin development company”, and now holds close to 190K bitcoins.","Edited by Bradley Keoun."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"June 15, 2023","content":"DATE"},{"type":"SEC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Coindesk Indices","content":"ORGANIZATION"},{"type":"S.M.","content":"LOCATION"},{"type":"22%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Jan. 11","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"ridden year of 2022","content":"DATE"},{"type":"Stader","content":"PERSON"},{"type":"Gregory Mall","content":"PERSON"},{"type":"the Court of Appeals","content":"ORGANIZATION"},{"type":"160%","content":"PERCENT"},{"type":"Oct. 23","content":"DATE"},{"type":"15%","content":"PERCENT"},{"type":"$14.4 billion","content":"MONEY"},{"type":"S.E.C.","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"},{"type":"May 23","content":"DATE"},{"type":"AMINA Bank","content":"ORGANIZATION"},{"type":"RedStone Oracles","content":"ORGANIZATION"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"$39 billion","content":"MONEY"},{"type":"the first half of 2024","content":"DATE"},{"type":"$10 billion","content":"MONEY"},{"type":"Feb. 12","content":"DATE"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Swell","content":"ORGANIZATION"},{"type":"Pendle","content":"PERSON"},{"type":"Lido","content":"LOCATION"},{"type":"$1.7 trillion","content":"MONEY"},{"type":"US","content":"LOCATION"},{"type":"80 billion","content":"MONEY"},{"type":"Microstrategy","content":"ORGANIZATION"},{"type":"$27 billion","content":"MONEY"},{"type":"Marcin Kaźmierczak","content":"PERSON"}],"hashtag":["Opinion","Crypto for Advisors","Newsletter","Financial Advisors","Financial Advisers","Spot bitcoin etf","Spot bitcoin exchange traded fund","Bitcoin Price","Portfolio management"],"authors":["Sarah Morton","Gregory Mall"]}