{"summary":"Tether said Monday it froze $225 million of its USDT stablecoin in light of DOJ investigations.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/21\/tether-worth-9m-tied-to-pig-butchering-scams-is-seized-by-us-doj\/","publishDate":"2023-11-21T15:15:25","id":15363,"type":null,"title":"Tether Worth $9M Tied to 'Pig Butchering' Scams Is Seized by U.S. DOJ","category":["Policy"],"content":["The U.S. Department of Justice (DOJ) said it seized $9 million worth of the tether (USDT) stablecoin linked to an organization that exploited victims through a \"pig butchering\" scam.","The seizure comes after agents and analysts from the U.S. Secret Service traced victim deposits that were laundered through several cryptocurrencies, a technique the DOJ described as \"chain hopping\" in its release Tuesday.","Tether froze $225 million worth of its stablecoin on Monday following a collaborative investigation between the DOJ, crypto exchange OKX and Tether itself. Pig butchering is a scam that involves luring victims in with traditional romance scams. The victims are often requested to send cryptocurrencies overseas.","\"This seizure should also serve as a reminder to cybercriminals that, although the current landscape of the cryptocurrency ecosystem may seem like an ideal way to launder ill-gotten gains, law enforcement will continue to develop the expertise needed to follow the money and seize it back for victims,” the DOJ said.","Read more: Tether Freezes $225M Linked to Human Trafficking Syndicate Amid DOJ Investigation","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"$9 million","content":"MONEY"},{"type":"U.S. Department of Justice (DOJ","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"$225 million","content":"MONEY"},{"type":"U.S. Secret Service","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"Tether Freezes $225M Linked to Human Trafficking Syndicate Amid DOJ","content":"ORGANIZATION"}],"hashtag":["Tether","DOJ","Crime","Scams","US","seized crypto"],"authors":["Oliver Knight"]}