{"summary":"The latest update on the labor market came less than two days after the Fed's Jerome Powell poured cold water on market hopes of a rate cut in March.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/02\/us-added-353k-jobs-in-january-blowing-past-estimates\/","publishDate":"2024-02-02T13:38:11","id":15368,"type":null,"title":"U.S. Added 353K Jobs in January, Blowing Past Estimates","category":["Markets"],"content":["Labor market strength continued in a big way in January, with the U.S. adding 353,000 jobs versus economist forecasts for 180,000 and against December's 333,000 (revised from an originally reported 216,000), according to the government's nonfarm payrolls report released Friday morning. The unemployment rate held steady at 3.7% versus expectations for a rise to 3.8%.","The price of bitcoin (BTC) fell about 0.5% in the minutes following the report, now trading at $42,800.","This morning's read on the labor market is of particular interest in that it comes less than two days since the Federal Reserve's January monetary policy meeting. The results of that meeting and Chairman Jerome Powell's post-meeting press conference made clear the U.S. central bankers were in no hurry to cut rates even though markets had already nearly fully anticipated such a move at the Fed's next meeting in March.","Checking other data from the report finds average hourly earnings up a large 0.6% in January. That's double expectations for 0.3% and above December's 0.4%. On a year-over-year basis, average hourly earnings were higher by 4.5% versus 4.1% expected and 4.4% previously. If there was any softness to the report, it was average weekly hours, which slipped to 34.1 versus 34.3 expected and 34.3 previously.","The news has sent traditional markets lower, with Nasdaq futures now higher by 0.5% against a gain of more than 1% prior to the report. S&P futures are now up by just 0.2% versus nearly 1% earlier. The 10-year Treasury yield has shot higher by 10 basis points to 3.98% and gold has dropped by 0.6% to $2,059 per ounce.","\n","\n"],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"4.5%","content":"PERCENT"},{"type":"3.8%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"4.1%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"0.3%","content":"PERCENT"},{"type":"Friday","content":"DATE"},{"type":"$42,800","content":"MONEY"},{"type":"3.7%","content":"PERCENT"},{"type":"4.4%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"0.6%","content":"PERCENT"},{"type":"3.98%","content":"PERCENT"},{"type":"0.4%","content":"PERCENT"},{"type":"December","content":"DATE"},{"type":"0.2%","content":"PERCENT"},{"type":"March","content":"DATE"},{"type":"$2,059","content":"MONEY"},{"type":"Jerome Powell","content":"PERSON"},{"type":"morning","content":"TIME"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Employment","Bitcoin","Interest Rates"],"authors":["Stephen Alpher"]}