{"summary":"While it seems positive for crypto, the PYUSD stablecoin will benefit PayPal's own coffers most of all.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/08\/09\/paypals-real-stablecoin-strategy-it-wants-to-earn-interest-on-your-deposits\/","publishDate":"2023-08-09T16:33:10","id":15364,"type":null,"title":"PayPal’s Real Stablecoin Strategy: It Wants to Earn Interest on Your Deposits","category":["Consensus Magazine"],"content":["The news this week that PayPal (PYPL) will issue a U.S. dollar stablecoin on the Ethereum network has understandably lit up the crypto world, even setting off a minor rally in other tokens. Optimists see it as a watershed moment of validation for blockchain and smart contracts from a very serious fintech player.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","\n","But there’s reason to suspect that technology per se wasn’t the most persuasive factor for the $64 billion payments giant. Instead, the more immediate motive may be quite simple:","PayPal wants to collect the interest on your dollars.","See, PYUSD, like other reputable dollar stablecoins, will be “backed” by a collection of dollar bank deposits and highly liquid dollar equivalents held in a trust managed by Paxos Trust. Short-dated U.S. Treasuries, which are likely to make up the bulk of PYUSD’s backing, are now offering a whopping 5% yield. PayPal gets to keep that yield.","That puts a different spin on comments this week from Jose Fernandez da Ponte, head of PayPal’s crypto efforts. Da Ponte told CNBC Crypto that “we think of PYUSD as an extension of the PayPal balance … making it available outside of the PayPal ecosystem.”","See also: PayPal's New Stablecoin and the '2 Wolves' Inside Crypto | Opinion","A PayPal balance is the money a customer leaves on the platform — or now with PYUSD, money they leave with PayPal in exchange for PYUSD. Users, for the record, should absolutely not do this at scale, partly because your money is at risk of seizure (and can be seized in stablecoin form). More importantly, you shouldn’t leave a PayPal balance because PayPal doesn't pay any interest. That's why your money became PayPal’s revenue opportunity as soon as underlying interest rates started going up.","PayPal doesn’t make the numbers entirely clear. In its quarterly reports, the company reports interest revenue on customer deposits to Wall Street as part of a larger category it calls “Revenues from other Value Added Services.” That includes “interest earned on certain assets underlying customer balances,” but also a plethora of other revenue sources, including “referral fees, subscription fees, gateway fees and other services.” So that category is not a clear index of how much “float” PayPal is getting from its users.","What we do know is that “value added” revenue is going up much, much faster than transaction fee revenue: It rose 37% between the second quarter of 2022 and the same period in 2023, while transaction revenue rose a measly 4.5%. It seems very likely that rising interest on customer deposits was a major driver of that divergence.","These changing conditions would make a stablecoin vastly more appealing for PayPal, for two straightforward reasons. First, as Da Ponte implied, the extended services enabled by a stablecoin may encourage users to hold a larger amount of money in the form of PYUSD, and to hold it longer. In theory, that could happen if there are simply more ways to use PYUSD than a conventional PayPal balance — for instance, for crypto trading on decentralized-finance platforms. Those larger overall collateral balances would produce more interest for PayPal on the back end.","(PYUSD will initially be available to U.S. users who have purchased crypto on PayPal before, but given the global nature of blockchain will likely be available worldwide in time.)","But far more to the point, a stablecoin could be spent without the underlying balance *ever* having to leave PayPal’s coffers. A rent payment from a PayPal deposit currently has to be turned into real dollars to be sent to a landlord’s bank account, for instance. But the same landlord (or eBay seller, or what have you) might eventually be more willing to accept payment in PYUSD, and then use those tokens in turn to pay contractors or other service providers.","See also: PayPal’s Regulated Stablecoin Is ‘Watershed Moment’ in Crypto","This would mean a smaller proportion of PYUSD users would “cash out” to actual dollars at any given point, leaving PayPal a higher proportion of Treasury or other interest as revenue. Its status as a publicly tracked blockchain token might even feed this dynamic, if enough users found that transparency more trustworthy than a simple number displayed on a web portal. Assuming we’re entering a period where interest rates will be higher for longer than over the preceding decade, this could accelerate the shift of PayPal’s revenue mix toward deposit interest earnings.","Although the stablecoin field is somewhat crowded, if PYUSD catches on, it could be at least as important to PayPal’s corporate strategy as it is to the crypto sector.","Edited by Daniel Kuhn."],"entity":[{"type":"U.S.","content":"LOCATION"},{"type":"CNBC Crypto","content":"ORGANIZATION"},{"type":"4.5%","content":"PERCENT"},{"type":"PYUSD","content":"LOCATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"Paxos Trust","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"second quarter of 2022","content":"DATE"},{"type":"Value Added Services","content":"ORGANIZATION"},{"type":"$64 billion","content":"MONEY"},{"type":"Da Ponte","content":"ORGANIZATION"},{"type":"37%","content":"PERCENT"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Jose Fernandez da Ponte","content":"PERSON"},{"type":"Crypto","content":"LOCATION"}],"hashtag":["Opinion","PayPal","Interest Rates","Stablecoin","Pyusd","The Node","Newsletters"],"authors":["David Z. Morris"]}