{"summary":"The world’s largest crypto exchange by volume said new guidance related to stablecoins and investor limits prompted the exit.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/05\/12\/binance-announces-exit-from-canada-citing-regulatory-tensions\/","publishDate":"2023-05-12T19:47:28","id":15360,"type":null,"title":"Binance Announces Exit from Canada, Citing Regulatory Tensions","category":["Finance"],"content":["Crypto exchange Binance has announced that it would cease operations in Canada, citing the challenging regulatory environment.","“We had high hopes for the rest of the Canadian blockchain industry,” the company said in a Friday tweet. “Unfortunately, new guidance related to stablecoins and investor limits provided to crypto exchanges makes the Canada market no longer tenable for Binance at this time.”","In February, the Canadian Securities Administrators (CSA) revealed new guidance that prohibited crypto asset trading platforms within the country from allowing customers to buy or deposit stablecoins without the CSA’s prior approval. Obtaining approval would require the crypto trading platform to pass the CSA’s various due diligence checks.","In its Friday tweet, Binance added that it did not agree with the new regulations but still hopes to work with Canadian regulators to further develop a regulatory framework around cryptocurrencies.","Over the past year, Binance has received increased scrutiny from North American regulators, and appears to be ramping down operations in the region. Earlier this year, Binance said it was considering severing ties with its U.S. business partners.","Binance co-founder and CEO Changpeng Zhao (“CZ”) is a Canadian citizen, with the company describing its exit from the country as holding “sentimental value.”","CoinDesk in late March reported Binance as likely to exit Canada even as rival Coinbase was engaged in talks to try to continue operations in that country.","Edited by Stephen Alpher."],"entity":[{"type":"Canada","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"Stephen Alpher","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"CSA","content":"ORGANIZATION"},{"type":"February","content":"DATE"},{"type":"Friday","content":"DATE"},{"type":"Canadian Securities Administrators (CSA","content":"ORGANIZATION"},{"type":"Binance","content":"PERSON"}],"hashtag":["Binance"],"authors":["Tracy Wang"]}