{"summary":"NFT trading volume declined 29% and the number of sales dropped 23% from June, while Yuga Labs collections’ dominance slipped.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/08\/03\/july-was-a-terrible-no-good-very-bad-month-for-nfts-dappradar-report-shows\/","publishDate":"2023-08-03T15:00:00","id":15366,"type":null,"title":"July Was a Terrible, No Good, Very Bad Month For NFTs, DappRadar Report Shows","category":["Web3"],"content":["July may have been the hottest month on Earth on record, but the NFT market froze under the ongoing crypto winter, experiencing some of the lowest sales numbers of the year, according to a new report from DappRadar.","The top-line stats are bleak: NFT trading volume declined 29% and the number of sales dropped 23% from the month before, while the floor prices of top-tier collections like Bored Ape Yacht Club and Azuki sunk to two-year lows. Only Gods Unchained and CryptoPunks saw tiny increases in floor prices, but each grew less than 1%.","Comparing these numbers to those at the beginning of 2023 puts things into an even worse perspective: In January 2023, there were 7.36 million sales of NFTs, while July netted 3.7 million sales – a 49% drop. Similarly, January saw $1.1 billion in trading volume while July had just $600 million, marking the third straight month trading volume has stayed below a billion dollars.","Still, there were some positive notes amidst the glum data. The Polygon network saw a surge in activity with 772,424 traders, dominating the sales count with 27% of all trades in July. Polygon gas fees are much lower than on the Ethereum blockchain and the network has been chosen by brands like Starbucks, Reddit, Nike and others to power their Web3 digital collectible efforts. Reddit dropped their popular Gen 4 avatars in late July which may have contributed to the recent surge in sales.","Polygon, along with Solana and Cardano, have previously shown gains against Ethereum but Ethereum still remains the top blockchain by trading volume, according to data from CryptoSlam. Meanwhile, the luster may be fading from Bitcoin Ordinals NFTs which saw just $33 million in trading volume in July, a decrease of 65% from the previous month.","The DappRadar report also noted that the shifts in trading volume and network activity may be partially attributed to “the emerging popularity of 'low barrier entry' NFTs. These assets, smaller in individual value, cater to a wider audience,” and “a broader shift in the NFT market towards platforms that offer more affordable and accessible NFT options.”","One “intriguing turn of events” the report discovered was that although Yuga Labs’ Bored Ape Yacht Club NFT collection retained its crown as the most traded collection in July, only Mutant Ape Yacht Club and CryptoPunks made it into July’s top ten collections by trading volume, a “stark contrast to a few months ago, when Yuga Labs [NFTs] claimed over 50% of every ranking.”","Azuki also had three collections in the top 10 but hasn’t recovered from the fallout from their Elementals mint in June, which caused prices to fall 44% after the Elementals art was critiqued for being “basically identical” to the original Azuki NFTs. The Elementals collection itself actually saw a 55% increase in sales, but the report stresses “an essential caveat is that a significant portion of these sales came from traders.”","See Also: Azuki ‘Elementals’ Mint Mishap Highlights the Fragile State of the NFT Market","Other top 10 collections tell a sunnier story, with Pudgy Penguins netting $19.5 million in trading volume after its successful launch of real-life toys, and DeGods racking up $29.1 million in trading volume, possibly motivated in anticipation of the release of their Gen 3 collection on August 9.","Read More: NFT Trading Volume is Sinking, But It’s Not Stopping Developers From Entering Web3","Edited by Rosie Perper."],"entity":[{"type":"Reddit","content":"LOCATION"},{"type":"Bored Ape Yacht Club","content":"ORGANIZATION"},{"type":"January 2023","content":"DATE"},{"type":"July","content":"DATE"},{"type":"$600 million","content":"MONEY"},{"type":"44%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"29%","content":"PERCENT"},{"type":"Yuga Labs’ Bored Ape Yacht Club NFT","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"27%","content":"PERCENT"},{"type":"$19.5 million","content":"MONEY"},{"type":"Nike","content":"ORGANIZATION"},{"type":"billion dollars","content":"MONEY"},{"type":"August 9","content":"DATE"},{"type":"Azuki ‘Elementals’ Mint Mishap Highlights the Fragile State","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Cardano","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"65%","content":"PERCENT"},{"type":"Mutant Ape Yacht Club","content":"ORGANIZATION"},{"type":"23%","content":"PERCENT"},{"type":"55%","content":"PERCENT"},{"type":"$29.1 million","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"DappRadar","content":"ORGANIZATION"},{"type":"1%","content":"PERCENT"},{"type":"$1.1 billion","content":"MONEY"},{"type":"Starbucks","content":"ORGANIZATION"},{"type":"Pudgy Penguins","content":"ORGANIZATION"},{"type":"Rosie Perper","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Ethereum","content":"LOCATION"},{"type":"$33 million","content":"MONEY"}],"hashtag":["NFTs","DappRadar","Yuga Labs","azuki","Trading Volume","Web3"],"authors":["Toby Bochan"]}