{"summary":"Institutions launching bitcoin ETFs this year have buoyed the bitcoin price to record levels. Does that mean the impact of the halving — the four-year slashing of the bitcoin reward — could be relatively muted?","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/18\/this-bitcoin-halving-is-different-but-is-it-priced-in\/","publishDate":"2024-04-18T20:38:52","id":15372,"type":null,"title":"This Bitcoin Halving Is Different. But Is It 'Priced In'?","category":["Consensus Magazine"],"content":["This year’s halving — the quadrennial slashing of the amount of new bitcoin (BTC) entering into circulation — may be the most important since the first one around 12 years ago. And yet, despite intense interest in the event, its price impact may be more muted this year than previous halvings. Recently launched protocols, like Ordinals, and an increasingly robust mining sector, mean the effect could be relatively soft.","This article is part of CoinDesk’s “Future of Bitcoin” package.","The Bitcoin halving, expected to take place late Friday night or early Saturday (April 20), comes with heightened expectations. In each previous case so far, the halving preceded massive sector-wide rallies. There is an ongoing debate whether the halving is “priced in,” or whether the reduced amount of bitcoin entering into circulation (this time dropping from around 900 BTC per day to 450 BTC) will create a kind of supply shock that will drive prices up (assuming demand for bitcoin remains constant or increases).","There are two economic theories that explain this debate. On one side are those who believe the halving is priced in believe the efficient market theory. They say because the event is known in advance, and everyone shares the same information, it is impossible that bitcoin is currently undervalued. On the other side are those who point to the historic four-year boom and bust cycle in crypto and\/or the aforementioned supply-and-demand constraints.","See also: What Bitcoiners Are Saying About the Upcoming Bitcoin Halving","Whatever theory you believe, it’s worth noting that this Bitcoin halving is already markedly different. For one, it’s the first time in Bitcoin history that bitcoin’s price has increased before the event. That’s largely because of the launch of nearly a dozen spot bitcoin exchange-traded funds in the U.S., which have been vacuuming up bitcoin at unprecedented rates. BlackRock’s bitcoin fund, for instance, has the fifth-fastest inflows of any ETF so far this year.","“There’s more work to do, but the industry has made significant progress in making bitcoin more accessible and easier to use since 2020,” Miles Suter, Bitcoin product lead at Cash App, told CoinDesk in an email. “While the recent rally has been led by institutional investors, with past halvings we’ve seen a positive sentiment shift in the market that attracts new retail traders; I think the cycle will repeat itself.”","The institutionalization of bitcoin has another element over and above changing the kinds of buyers of bitcoin (or the way they enter the market): It also serves to legitimize the sector. In previous years, the biggest-name buyers of bitcoin were Michael Saylor’s relatively unknown software company MicroStrategy, known bitcoin fan Jack Dorsey’s Block and Elon Musk’s Tesla, which partially walked back its commitment due to environmental concerns.","ETFs changed that forever. This isn’t to suggest that Wall Street doesn’t have its detractors, but it is significant that firms like BlackRock, Fidelity, Franklin Templeton, VanEck and WisdomTree were all clamoring to be first to market in offering a traditional onramp into this nascent digital economy. Bitcoin, once thought to be the Wild West, is becoming normalized — and no one is quite sure what is on the other side.","See also: Bitcoin ETFs Are Driving a Spot Multiplier Effect","“The people, institutions and governments that matter in the big picture are only *just beginning* to wake up to Bitcoin,” Lane Rettig, founder of SpaceMesh and former Ethereum developer, said. “Yes, this process takes a painfully long time, longer than we expect or would like - it's like a dragon slowly awakening, and right now it's just begun to stir.”","It was a point echoed by Nelson Rosario of Rosario Tech Law, who views the halving as just the latest thing to drive attention to Bitcoin. “I think the questions I've seen around this halving somewhat miss the point. The fact is Bitcoin is at all-time high levels. It is a semi-regular news story in the financial press, and yet mass adoption still feels years away,” he said.","Indeed, analysts at both JPMorgan and Goldman Sachs this week published reports dampening the idea that the halving will bring in new buyers. A rallying market leading into the halving may be a way to generate buzz, but it may have also “pulled forward” a portion of “the typical post-halving rally,” JPMorgan analysts Reginald Smith and Charles Pearce wrote.","More importantly, macroeconomic conditions in 2024 are completely different than during the preceding decade of low interest rates and low inflation. Goldman's Fixed Income, Currencies and Commodities as well as Equities teams wrote that the higher interest rates today may make high risk investments like crypto less attractive.","It’s a point bolstered by BTC’s performance this week following news the Federal Reserve is reversing course from lowering interest rates, which would have brought liquidity into the economy. Price predictions from market analysts vary wildly, with some saying bitcoin could fall to as low as $40,000 post halving or rally above $150,000 by the end of the year.","See also: Bitcoin Rebounds as $150K Target for 2024 Comes in View","Pseudonymous trader Poordart gave a “primitive calculation” adding to the idea that bitcoin could fall following the halving. “Assuming miners sell all mined bitcoin eventually, reducing the average daily number of bitcoin mined from 900 to 450 ($54 million to $27 million at current prices) should have some effect — $189m inflow per week less required just to keep price stable,” he told CoinDesk.","Bitcoin’s 50% price gains this year seem to support the idea that people are willing to take risks — though that doesn’t mean traders shouldn’t proceed with caution. To some extent, the stakes of this halving are even more unclear than ever due to these institutionalization and macroeconomic trends, with some concerned that the halving distracts from the ultimate mission of Bitcoin.","\"It is an odd thing to have to treat very, very human-made events as if they are acts of nature or God,” Nathan Schneider, professor of media studies at the University of Colorado Boulder and author of “Governable Spaces: Democratic Design for Online Life.” “I long for the day when network-native economies are designed to serve human flourishing, not arbitrary parameters in code.\"","Others, like Sarah Meyohas, creator of Bitchcoin and recent Satoshi Nakamoto inscription and hologram series, sees the halving as a symbol of Bitcoin’s resilience. “As we approach Bitcoin's halving, I am moved by the notion that a few people can shape the future of an entire generation through ideas alone.”","A mix of factors — including halving the block reward, higher costs, cautious investors and an increasingly crowded mining sector — could be a harsh reality for bitcoin miners after the halving ramps up competition to find the next block.","Historically, the halving has been a boon for the price of bitcoin, helping miners reap a fat profit margin. However, this time, it's different as publicly-traded and private bitcoin miners will have to work harder not just to mine the next block but also to convince investors and the markets to have faith in their ability to make money.","Heading into this halving, miners are greeted with a cautious tone from investors. For instance, stocks from mining firms Marathon Digital, Hut 8 and Riot Platforms are down roughly 33%, 35% and 46%, respectively, this year. The risk associated with bitcoin mining is seen as greater than alternative mainstream ways to get exposure to crypto, including spot bitcoin ETFs, equities like Coinbase (COIN) and the broad based CoinDesk 20 index, which are less volatile.","Read more: Bitcoin Soared to an All-Time High. So Why Aren't Miners Blasting Off, Too?","To be able to survive and thrive after this halving, miners will need to be efficient, cash flow generating and have proper treasury management in place, CryptoQuant CEO Ki Young Ju wrote. He predicts that even if bitcoin remains at the $60,000 price level the current crop of mining machines would become unprofitable to run for many firms — leading to a wave of bankruptcies.","Unless they are able to quickly deploy the latest generation of more efficient machines, Ju said that bitcoin’s price will need to rise to around $80,000 for miners to remain profitable using Bitmain's S19 XP mining machines, the most commonly utilized miners by U.S. companies.","Miners have already started to replace their older-generation machines with newer ASICs. However, having the latest technology may not be enough to appease investors. Miners must prove they can make money by deploying capital efficiently, cutting costs, finding cheaper sources of power and generating positive cash flow for shareholders.","For profitable firms, the post-halving landscape may become a season for mergers and acquisitions. Firms like Galaxy Digital, with its Helios mining farm, the largest liquid-cooled mine in the Northeast, are already buying up less efficient machines as the cheap cost of electricity in West Texas makes it profitable to run outdated chips.","It’s not all doom and gloom. Increasingly, transaction fees are becoming a significant contributor to miners. Historically, miners earned lion's shares of profit from the block rewards. However, with the increasing ways to use the Bitcoin blockchain — most notably through the Ordinals protocol — miners are taking in more through increased fees.","Another option, which some miners have already started to include in their business plan, is to diversify into other sources of revenue, such as repurposing existing data centers to host computing resources for artificial intelligence or cloud computing.","Read more: Bitcoin Halving Is a ‘Show Me the Money’ Moment for Miners","While others see the drop in revenues as potentially existential for miners, some experts think that the effects will be relatively muted compared to prior years. Some, like Colin Harper, researcher and writer for Luxor Technology’s Hashrate Index, thinks that this could be the first year that there is no dip in Bitcoin's hashrate, or the amount of energy contributed to network security, because prices have remained so high.","\"Mining margins won't be as good after the halving as they are now, obviously, but they won't be horrendous,\" Colin Harper, researcher and writer for Luxor Technology’s Hashrate Index, told CoinDesk. \"And if the new Runes fungible token protocol makes a significant impact on transaction fees, then margins will be healthy enough to keep miners with higher costs online for longer than not.\"","As mentioned, NFT-like inscriptions, made possible by the launch of the Ordinals protocol, have changed the game for Bitcoin. Not only has it shifted the economic landscape for miners, but it's also renewed developer excitement in the first cryptocurrency, which in recent years was losing out to chains like Ethereum and Solana.","This halving will also see the launch of the Runes protocol, created by Ordinals creator Casey Rodarmor. The system, which will allow tokens to be created, minted and transferred on Bitcoin, is set to launch immediately following the halving with the goal of introducing greater utility to Bitcoin — a mission which started with Rodarmor's prior creation, Ordinals.","Rodarmor has described Runes as creating a venue for meme coins on Bitcoin, only with greater simplicity and efficiency than is currently provided by the BRC-20 token standard. Already, several Runes projects are being planned to coincide with the launch of the new protocol.","Although, in prior years, halvings did not lead to an economic attack on Bitcoin (like a 51% attack), there are some concerns that lower profitability could lead to enough miners turning off that it becomes theoretically possible. For instance, Bitcoin's hash rate declined 15% after the 2020 halving, 5% after 2016's halving, and 13% after 2012, therefore making Bitcoin less secure.","“The halving is one of the dumbest parts of how Bitcoin was designed. If you're going to reduce subsidy over time, the right way to do it is gradually, rather than shocking the system every four years,” legendary Bitcoin Core developer Peter Todd told CoinDesk. “Fortunately fees are getting higher, so the risk of havings is reducing. Hopefully this one goes alright.”","See also: How the Bitcoin Halving Could Affect Network Security","Rodarmor, and others, see Runes as important to the post-halving Bitcoin ecosystem in that it could bring out additional demand for block space — thereby bolstering the mining economy. Higher fees for validating transactions could however help to offset lower block reward revenue and keep the hash rate higher.","\"I wouldn't advocate changing the halving schedule, but if I was going to design Bitcoin from scratch, I probably would not have picked such a fast decay,\" Rodarmor told CoinDesk. \"But you don't go to war with the army you want, you go to war with the army you have. And this is the Bitcoin we have.\"","Ordinals was contentious among some corners of the Bitcoin community for causing network congestion and soaring user fees, something Runes would also probably face if it proves successful.","\"I don't think that the best and highest use case for Bitcoin is Runes; I think that is bitcoin itself as a neutral, value delivery network,\" Rodarmor said. \"However, I do think that it is good to create sources of demand for Bitcoin transactions, because ultimately that helps the security of the network.\"","If all goes well, it may not matter whether bitcoin is priced in.","Edited by Benjamin Schiller.","\n"],"entity":[{"type":"West Texas","content":"LOCATION"},{"type":"Galaxy Digital","content":"ORGANIZATION"},{"type":"University of Colorado Boulder","content":"ORGANIZATION"},{"type":"Peter Todd","content":"PERSON"},{"type":"Rodarmor","content":"PERSON"},{"type":"Reginald Smith","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Colin Harper","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"$54 million","content":"MONEY"},{"type":"35%","content":"PERCENT"},{"type":"15%","content":"PERCENT"},{"type":"Goldman's Fixed Income","content":"ORGANIZATION"},{"type":"Friday","content":"DATE"},{"type":"Franklin Templeton","content":"PERSON"},{"type":"Saturday","content":"DATE"},{"type":"$60,000","content":"MONEY"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"Bitcoin Rebounds","content":"LOCATION"},{"type":"Northeast","content":"ORGANIZATION"},{"type":"2024","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Rosario Tech Law","content":"PERSON"},{"type":"33%","content":"PERCENT"},{"type":"Ju","content":"PERSON"},{"type":"night","content":"TIME"},{"type":"Jack Dorsey","content":"PERSON"},{"type":"Time High","content":"ORGANIZATION"},{"type":"VanEck","content":"PERSON"},{"type":"46%","content":"PERCENT"},{"type":"Nathan Schneider","content":"PERSON"},{"type":"2020","content":"DATE"},{"type":"Solana","content":"PERSON"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"$27 million","content":"MONEY"},{"type":"2016","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"Charles Pearce","content":"PERSON"},{"type":"$150,000","content":"MONEY"},{"type":"2012","content":"DATE"},{"type":"WisdomTree","content":"ORGANIZATION"},{"type":"the first one around 12 years ago","content":"DATE"},{"type":"$80,000","content":"MONEY"},{"type":"Money’ Moment for Miners","content":"ORGANIZATION"},{"type":"Bitmain","content":"PERSON"},{"type":"20","content":"DATE"},{"type":"April 20","content":"DATE"},{"type":"CryptoQuant CEO Ki Young Ju","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"Luxor Technology’s Hashrate Index","content":"ORGANIZATION"},{"type":"Sarah Meyohas","content":"PERSON"},{"type":"Lane Rettig","content":"PERSON"},{"type":"Bitcoin","content":"ORGANIZATION"},{"type":"Rodarmor","content":"ORGANIZATION"},{"type":"Michael Saylor","content":"PERSON"},{"type":"Miles Suter","content":"PERSON"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"Casey Rodarmor","content":"PERSON"},{"type":"5%","content":"PERCENT"},{"type":"Nelson Rosario","content":"PERSON"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Elon Musk’s Tesla","content":"ORGANIZATION"},{"type":"51%","content":"PERCENT"},{"type":"Bitcoin Halving Could Affect Network Security","content":"ORGANIZATION"},{"type":"$150K","content":"MONEY"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"$189m","content":"MONEY"},{"type":"BRC","content":"ORGANIZATION"},{"type":"$40,000","content":"MONEY"},{"type":"Marathon Digital","content":"ORGANIZATION"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","Bitcoin","Bitcoin Halving","Prices","Institutional Bitcoin","Bitcoin ETF","Mining","Runes","Ordinals"],"authors":["Daniel Kuhn","Aoyon Ashraf","Jamie Crawley"]}