{"summary":"Ethereum is the world’s second-largest crypto project by market capitalization and was the first to introduce smart contract functionality to the industry.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-ethereum\/","publishDate":"2022-09-22T16:43:06","id":15370,"type":null,"title":"What Is Ethereum?","category":["Learn"],"content":["Ethereum is a blockchain-based software platform that supports the world’s second-largest cryptocurrency by market capitalization after Bitcoin. Like other cryptocurrencies, Ethereum can be used for sending and receiving value globally and without a third party watching or stepping in unexpectedly.","Value exchange is the main use case of the Ethereum blockchain today, often via the blockchain’s native token, ether. But many of the developers are working on the cryptocurrency because of its long-term potential and the ambitious vision of its developers to use Ethereum to give users more control of their finances and online data. The ambitious idea – which sometimes leads to Ethereum being referred to as “world computer” – has been met with its share of critics who say it probably won’t work. But if this experiment rolls out as planned, it would spawn apps very different from Facebook and Google, which users knowingly or unknowingly trust with their data.","Ethereum enthusiasts aim to hand control back to users with the help of a blockchain, a technology that decentralizes data so that thousands of people around the world are handed a copy. Developers can use Ethereum to build leaderless applications, which means that a user’s data cannot be tampered with by the service’s creators.","Ethereum was first proposed in 2013 by developer Vitalik Buterin, who was 19 at the time, and was one of the pioneers of the idea of expanding the technology behind Bitcoin, blockchain, to more use cases than transactions.","While Bitcoin was created with the goal of disrupting online banking and day-to-day transactions, Ethereum’s creators aim to use the same technology to replace internet third parties – those that store data, transfer mortgages and keep track of complex financial instruments. These apps aid people in innumerable ways, such as paving a way to share vacation photos with friends on social media. But they have been accused of abusing this control by censoring data or accidentally spilling sensitive user data in hacks, to name a couple of examples.","The platform officially launched in 2015, turning the idea of Ethereum into a real, functioning network.","Before you can understand Ethereum, it helps to first understand intermediaries.","This means that our personal data, financial information, and so forth are all largely stored on other people’s computers – in clouds and servers owned by companies like Facebook, Google or PayPal. Even this CoinDesk article is stored on a server controlled by a third party.","This structure can be problematic, according to decentralization advocates. It means less direct control for users, and it also opens up opportunities for censorship, where the intermediary can step in and prevent a user from any action, whether buy a certain stock or post a certain message on social media, or block them altogether.","The idea of Ethereum is to change how apps on the internet work today, awarding users more control by replacing intermediaries with smart contracts that execute rules automatically.","Many, including inventors of the internet, believe the internet was always meant to be decentralized, and a splintered movement has sprung up around using new tools to help achieve this goal. Ethereum is one of the technologies to join this movement.","Ethereum draws inspiration from Bitcoin. They are both cryptocurrencies. Ethereum uses the same technology behind Bitcoin, a blockchain, which uses a shared, decentralized public ledger to decentralize the network so it’s not under the control of just one entity.","But while Bitcoin is used primarily as a store of value, the idea behind Ethereum is to decentralize other kinds of applications and services, from social media networks to more complex financial agreements.","Many advocates see Ethereum as a “world computer” that could decentralize the internet.","With Ethereum, centralized servers are replaced by thousands of so-called “nodes” run by volunteers all over the world thus forming a “world computer.” The hope is that one day, anyone in the world will be able to use it.","Scrolling through a typical app store you’ll see a variety of colorful squares representing everything from banking to fitness to messaging apps. The long-term vision of the Ethereum community is to make apps that look just like these, but that work differently under the hood.","In short, the goal is for Ethereum apps to return control of the data in these types of services to its owner.","The apps built on Ethereum that offer this functionality are known as decentralized apps. Users need ether, Ethereum’s native token, to use them.","A huge upgrade to the Ethereum known as \"the Merge\" was officially completed on Sept. 15, 2022, moving the blockchain from proof-of-work to proof-of-stake for its consensus mechanism. The project took years to accomplish and reduced Ethereum's energy consumption by over 99%.","This isn't the end of the journey however. Ethereum's relatively high fees and slow speeds, are the next challenges for the blockchain to address. Neither of these issues were addressed by the update and remain a blocker to expanded adoption.","Read More: The Ethereum Merge Is Done, Opening a New Era for the Second-Biggest Blockchain"],"entity":[{"type":"2015","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Sept. 15, 2022","content":"DATE"},{"type":"2013","content":"DATE"},{"type":"today","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Google","content":"ORGANIZATION"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"99%","content":"PERCENT"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Ethereum","Beginner","Learn"],"authors":["Alyssa Hertig"]}