{"summary":"A key element of the upgrade is to enable a new place for storing data on Ethereum – referred to as \"proto-danksharding,\" which gives room for a dedicated space on the blockchain that is separate from regular transactions, and comes at a lower cost.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2024\/03\/13\/ethereum-activates-dencun-upgrade-in-landmark-move-to-reduce-data-fees\/","publishDate":"2024-03-13T13:58:13","id":15376,"type":null,"title":"Ethereum Finalizes 'Dencun' Upgrade, in Landmark Move to Reduce Data Fees","category":["Technology"],"content":["Ethereum, the second-biggest blockchain after Bitcoin, activated its much-anticipated \"Dencun\" upgrade, a move to spur growth on so-called layer-2 networks like Arbitrum and Polygon, by reducing their data fees.","The Dencun upgrade, technically a hard fork in blockchain terminology, was triggered at Ethereum epoch 269,568 at 13:55 UTC (9:55 a.m. ET), and finalized at 14:10 UTC.","The price of ether (ETH), the native cryptocurrency of the Ethereum blockchain, was little changed in the wake of the upgrade. Over the past 24 hours, the ETH price was down 0.5% to $3,968. The cryptocurrency had rallied about 50% over the past month, in sync with the 49% rise over the same time period in the benchmark CoinDesk 20 Index of the largest digital assets.","Read More: Arbitrum's ARB, Polygon's MATIC Lead Gains as Ethereum's Dencun Upgrade Goes Live","A key element of the upgrade is to enable a new place for storing data on the blockchain – referred to as \"blobs,\" with a dedicated space that is separate from regular transactions, and at a lower cost.","The upgrade, considered to be Ethereum's biggest in almost a year, has been viewed as a crucial moment in the blockchain's history, ushering in a new era for tackling Ethereum’s notoriously high transaction fees, and could touch off a race among the biggest layer-2 networks to take advantage of the changes in scaling the blockchain.","In the official watch party hosted by EthStaker and the Ethereum Foundation, Terence Tsao, core developer of Offchain Labs, noted that some of the bigger rollups are holding off on submitting data blobs to Ethereum until the network is more stable. The X account for the Arbitrum Foundation noted that it would start to make use of blobs in the next 24 hours.","The layer-2 network Starknet confirmed the it had started submitting data blobs.","At least one casualty was reported, though: The layer-2 network Blast said in a post on X that it had \"stopped producing blocks due to issues related to Ethereum's Dencun upgrade.\" A little while later, Blast tweeted that the \"issue has been resolved,\" and that a full analysis would be shared \"shortly.\"","Central to the upgrade is the implementation of “proto-danksharding” – a new transaction category that will store data on Ethereum, through the introduction of the data blobs.","The primary benefit of this upgrade will not be for Ethereum users themselves, but mainly layer 2 networks like Arbitrum, Optimism, and Polygon, who help scale Ethereum by bundling up transactions from users and then passing them back to the main blockchain, where they're settled in big batches.","This type of technology is known as a rollup, and rollup networks have skyrocketed in the Ethereum ecosystem over the past few years. Users have deposited billions of dollars in these types of chains, and recently have seen higher transaction volumes compared to the base chain.","Once Dencun is implemented, these layer-2s will be able to post data to Ethereum, rather than in the clunky transactional data fields where they are currently posting. The new setup is supposed to make settling data for rollups more efficient and cheaper, which should then trickle down to end-users by reducing their fees too.","Dencun is the first step for the blockchain in its quest to implement \"sharding,\" which is a technological feature that will break up the blockchain into mini-shards (or mini-chains), to process more transactions for cheap. The full implementation of sharding is still years away, so Dencun’s implementation of proto-danksharding is an interim solution for Ethereum’s high gas fees.","Proto-danksharding is also supposed to benefit a new class of blockchains that have entered the Ethereum ecosystem known as data availability (DA) layers. DA layers like Celestia, EigenDA and Avail help networks store large amounts of data for rollups","DA’s are separate blockchains that handle the task of proving that the data of these transactions exists, and is available if needed. As rollups produce a lot of data – and consume a lot of the data space on Ethereum – the need for DA solutions has become even more crucial. Proto-danksharding therefore could make the costs of downloading DA data cheaper.","As layer-2 fees are set to drop dramatically among Ethereum’s rollups, there is speculation that this could set up a fee war between many of these auxiliary networks, which will be competing for the same users by offering cheaper transaction fees.","How that all will exactly play out is still ambiguous, as the full effect of proto-danksharding can be properly measured once it is implemented.","In a recent interview with CoinDesk, Jesse Pollak, creator of Base, the U.S. crypto exchange Coinbase’s layer-2 network, said that without an increase in usage, costs could fall down to 90% to 95%.","Every ecosystem will end up deciding how they go about pricing these transaction fees, said Steven Goldfeder, the co-founder of Offchain Labs, the primary developer behind the Arbitrum Network, the largest Ethereum layer-2, based on the crucial metric of total value locked, or TVL – akin to deposits.","“Some of our competitors price layer-2 fees at essentially zero,\" Goldfeder said. \"That's not sustainable.”","Other layer-2 experts say Dencun will call for more collaboration between rollup projects.","“Scalability is the fundamental unlock that enables permissionless collaboration between developers across projects and teams,” said Karl Floersch to CoinDesk, CEO of OP Labs, the developer firm behind the Optimism blockchain. “With EIP-4844 and Dencun, developers across the Ethereum ecosystem can more seamlessly build together. The upgrade will enable a group of loosely coordinated developers to actually build systems that provide overall experiences that will rival the user experiences we’re used to from top-down, centrally planned platforms.”","While proto-danksharding is the focus of the Dencun upgrade, there are eight other Ethereum Improvement Proposals (EIPs) that have made it into the Dencun package that will mostly affect developers:","Read more: Ethereum Blockchain Counts Down to 'Dencun' Upgrade, Set to Reduce Fees","UPDATE (14:28): Updates to state that Dencun upgrade is finalized and adds that some major rollup teams may be waiting to start sending blobs."],"entity":[{"type":"90%","content":"PERCENT"},{"type":"billions of dollars","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Steven Goldfeder","content":"PERSON"},{"type":"0.5%","content":"PERCENT"},{"type":"$3,968","content":"MONEY"},{"type":"50%","content":"PERCENT"},{"type":"Arbitrum Network","content":"ORGANIZATION"},{"type":"Terence Tsao","content":"PERSON"},{"type":"Karl Floersch","content":"PERSON"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"49%","content":"PERCENT"},{"type":"2","content":"DATE"},{"type":"Dencun","content":"PERSON"},{"type":"4844","content":"DATE"},{"type":"UTC","content":"ORGANIZATION"},{"type":"9:55 a.m.","content":"TIME"},{"type":"Proto","content":"PERSON"},{"type":"Ethereum Foundation","content":"ORGANIZATION"},{"type":"95%","content":"PERCENT"},{"type":"Celestia","content":"LOCATION"},{"type":"Arbitrum Foundation","content":"ORGANIZATION"},{"type":"EthStaker","content":"ORGANIZATION"},{"type":"Goldfeder","content":"PERSON"},{"type":"Jesse Pollak","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"OP Labs","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Dencun","layer 2","Ethereum","gas fees","rollup","Rollups","Zero-Knowledge Proofs","Ether","Arbitrum","Optimism","data availability","Celestia","Avail"],"authors":["Margaux Nijkerk"]}