{"summary":"A decentralized autonomous organization, or DAO, is an organization that’s governed by code instead of leaders.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/what-is-a-dao\/","publishDate":"2017-03-30T15:44:10","id":15382,"type":null,"title":"What Is a DAO?","category":["Learn"],"content":["A decentralized autonomous organization, or DAO, is a blockchain-based form of organization or company that is often governed by a native crypto token. Anyone who purchases and holds these tokens gains the ability to vote on important matters directly related to the DAO. They typically use smart contracts in place of traditional corporate structures to coordinate the efforts and resources of many towards common aims. These are self-executing computer programs that carry out a particular function when certain conditions are met.","Ethereum is the second-largest cryptocurrency by market capitalization and is the largest platform for using the technology behind cryptocurrency – blockchain – for uses beyond money. The thought is that if bitcoin can do away with middlemen in online payments, can the same or comparable technology do the same for middlemen in companies? What if entire organizations could exist without a central leader or CEO running the show?","Many consider DAOs to be one of the loftiest ideas stemming from Ethereum, and many argue the real-world realization of the idea will likely not lead to wise decision-making.","But others think the idea of an organization with decentralized control holds promise and are experimenting to bring it to life. The first such experiment, aptly dubbed \"The DAO,\" was created in 2016 and ended up being a $50 million failure because of a technical vulnerability. However, organizations like Aragon, Colony, MakerDAO and others are picking up where The DAO left off.","Imagine this: a driverless car cruises around in a ridesharing role, essentially an autonomous Uber. Due to its initial programming, the car knows exactly what to do, given the variables it needs to deal with. It finds passengers, transports them, and accepts payments for its transportation services.","After dropping someone off, the car uses its profits for a trip to an electric charging station, using ether – Ethereum's native token used for paying to use decentralized apps – to pay for the electricity.","This car is just one in a fleet of vehicles owned by a DAO. As the cars earn ether, the money goes back to the shareholders that have invested in the entity.","That’s one “thought experiment” brought to you by former bitcoin contributor Mike Hearn in which he describes how cryptocurrency and blockchains could help power leaderless organizations in the future. What Hearn described is one fanciful use case for a DAO, an idea that began to get traction in the crypto community not long after bitcoin was released in 2009.","One inherent advantage of DAOs, advocates argue, is that they enable the building of fairer organizations than the human-run kind.","Most companies today have leaders who sometimes make unilateral decisions that affect the entire company. A DAO would make this kind of decision-making impossible; stakeholders (i.e. investors in the company) have more direct control over how the company should operate.","In short, DAOs aim to hard-code certain rules to drive the company or organization from the get-go.","DAOs are based on Ethereum smart contracts, which can be programmed to carry out certain tasks only when certain conditions are met. These smart contracts can be programmed to automatically execute typical company tasks, such as disbursing funds only after a certain percentage of investors agree to fund a project.","Many see DAOs as a way to more rigorously guarantee democracy. Stakeholders can vote on adding new rules, changing the rules or ousting a member, to name a few examples. And the DAO simply won't be able to change unless the required threshold of people vote for the change.","Some proposed characteristics of a DAO include:","Yes. The best-known attempt at creating such an organization was aptly called “The DAO.”","Launched in 2016, The DAO failed in a matter of months, but it’s still the preeminent example of what people have in mind when they talk about the technology.","The plan was for investors in The DAO to receive tokens proportional to how much ether they invested in the project. With those tokens they could vote for which projects to fund. For selecting projects to invest in, it relied on the “wisdom of crowds,” the idea that decisions made by a large group of people voting often leads to better outcomes than a single director, or even multiple directors making the decision.","If the projects that were invested in profited, the profits would be distributed back to the investors.","It’s easy to see why “unstoppable code” can pose a security problem.","That was the problem with The DAO. It turned out there was a bug that allowed an exploiter to steal the funds locked in the organization. Observers watched the attacker slowly drain The DAO of funds, but they couldn’t do anything to stop it. Technically, the hacker was following the rules as they were deployed.","Ethereum’s lead coders reversed the transaction history to return funds to their owners – a controversial decision that led to a rift in the community. The best way to handle a similar situation in the future is still up to debate.","As shown with The DAO, unstoppable code can pose a problem. It’s difficult to change the rules of the DAO once it’s deployed to the Ethereum blockchain. The same framework that prevents a person or entity from altering the organization without consensus from the community can also cause problems, the main one being that any gaps in the framework aren’t easily closed. That can lead to potential theft, money loss or other disastrous consequences."],"entity":[{"type":"2016","content":"DATE"},{"type":"Colony","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Aragon","content":"PERSON"},{"type":"Mike Hearn","content":"PERSON"},{"type":"Hearn","content":"PERSON"},{"type":"2009","content":"DATE"},{"type":"Ethereum","content":"LOCATION"},{"type":"$50 million","content":"MONEY"}],"hashtag":["Intermediate","Ethereum","Learn"],"authors":["Alyssa Hertig"]}