{"summary":"An investigation by crypto sleuth ZachXBT alleges that a YouTuber known as “Blue” was involved in phishing scams using NFT drainer tech Monkey and other similar services to steal over $1.5 million.","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/238647\/crypto-drainer-scam","publishDate":"2023-07-10T10:22:11","id":1538,"type":null,"title":"Crypto sleuth alleges YouTuber &#x27;Blue&#x27; implicated in $1.5 million scam","category":["Security"],"content":["<span data-v-f87c67ca=\"\">Crypto sleuth ZachXBT unveiled an investigation into a YouTuber known as Blue or Jack, revealing alleged involvement in multiple crypto scams used to steal more than $1.5 million.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Initially gaining popularity through gaming and trolling videos, Blue amassed a considerable following of over 122,000 subscribers on YouTube before diving into the world of crypto scams in 2021, Zach <\/span><a href=\"https:\/\/twitter.com\/zachxbt\/status\/1678384917657296898?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">alleged<\/span><\/a><span data-v-f87c67ca=\"\"> on Twitter.<\/span>","<span data-v-f87c67ca=\"\">A leaked post from Blue's Snapchat linked him to the Ethereum ENS address cool-breeze.eth that purchased the Bored Ape Yacht Club 8668 NFT in October 2022, according to Zach. Looking into the funding of this address, the crypto sleuth said he uncovered inflows of over 85 ETH, approximately one-third of the stolen funds, directly linked to addresses associated with Monkey Drainer phishing scams.<\/span>","<span data-v-f87c67ca=\"\">Monkey Drainer, a well-known crypto drainer, reportedly has a theft history totaling up to <\/span><a href=\"https:\/\/fortune.com\/crypto\/2023\/03\/01\/crypto-scammer-monkey-created-multimillion-dollar-empire-copycats-disappeared\/#:~:text=Monkey%20is%20the%20epitome%20of,the%20script%20to%20target%20NFTs.\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">$24 million<\/span><\/a><span data-v-f87c67ca=\"\">. In February this year, Monkey decided to <\/span><a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">call it a day<\/span><\/a><span data-v-f87c67ca=\"\">. In a farewell message, its developer said that “all young cyber criminals should not lose themselves in the pursuit of easy money.” They told their clientele to use a rival drainer known as Venom.<\/span>","<span data-v-f87c67ca=\"\">On Discord, Blue frequently boasted about his successful scams and the BAYC NFT purchase, according to Zach, showing screenshots from internal Discord servers indicating Blue was also instructing other individuals in his scamming methods.<\/span>","<span data-v-f87c67ca=\"\">After an alleged falling-out with Monkey over one particular phishing scam resulted in him being robbed of his BAYC, Blue continued scamming under new ENS addresses using other drainer services, Zach said, with luxurious purchases from watches to cars and <\/span><a href=\"https:\/\/www.theblock.co\/post\/235022\/phishing-frenzy-school-kids-are-stealing-millions-of-dollars-of-nfts-to-buy-roblox-skins\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Roblox items<\/span><\/a><span data-v-f87c67ca=\"\"> funded by the stolen assets.<\/span>","<span data-v-f87c67ca=\"\">Blue's primary method was through spamming on Twitter with verified accounts, Zach added, providing an example of user @g13m falling victim to such a phishing scam in July, losing approximately $213,000 worth of ETH and USDT to a fake Doodles NFT site. Blue allegedly pocketed 49 ETH and $74,000 in USDT after paying the drainer fee.<\/span>","<span data-v-f87c67ca=\"\">Another theft involved <\/span><span data-v-f87c67ca=\"\">@ystrickler<\/span><span data-v-f87c67ca=\"\">, Zach said, who had Milady and Squiggle NFTs phished, worth around 12 ETH. Blue received 10.3 ETH after the drainer fee to the ENS address purplelobster.eth, according to Zach.<\/span>","<span data-v-f87c67ca=\"\">“It’s disgusting to see these phishing scammers show zero remorse and spend the funds on tasteless items,” Zach <\/span><a href=\"https:\/\/twitter.com\/zachxbt\/status\/1678385015099465729?s=20\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">said<\/span><\/a><span data-v-f87c67ca=\"\">. “Additional information of Blue (Jack) has been shared with multiple of his victims to eventually help bring legal action.”<\/span>"],"hashtag":["BAYC","DOODLES","HACKS","MILADY"]}