{"summary":"PayPal has announced partnerships with three major payment processors in the bitcoin space: BitPay, Coinbase and GoCoin.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2014\/09\/23\/paypal-announces-first-partnerships-in-bitcoin-space\/","publishDate":"2014-09-23T17:19:19","id":15392,"type":null,"title":"PayPal Announces First Partnerships in Bitcoin Space","category":["Markets"],"content":["PayPal has announced partnerships with three major payment processors in the bitcoin space – BitPay, Coinbase and GoCoin.","Though the online e-commerce pioneer stopped short of integrating bitcoin into its digital wallet or payment processing services directly, the move marks PayPal's first formal offering to the bitcoin community.","Ellison lauded BitPay, Coinbase and GoCoin for their commitment to ensuring consumer protections on their platforms, while suggesting that the offering will appeal to a number of its key customer groups, writing:","Notably, the announcement follows the decision of PayPal subsidiary Braintree to partner with Coinbase earlier this month.","PayPal is available in 193 markets and 26 currencies. With 143 million active registered accounts and $6.6bn in revenue at the end of 2013, the e-commerce giant brings the potential for new users and new business to the bitcoin economy.","Ellison went on to suggest that PayPal is committed to embracing innovation, and that this has lead to its early support of bitcoin. Further, he suggested the company will be monitoring its first formal bitcoin trial to assess how it moves forward with the payment method, writing:","PayPal cited its commitment to allowing businesses freedom of choice and promoting safer buying experiences as key reasons for its decision.","BitPay, Coinbase and GoCoin will pay a referral fee to PayPal for new business they gain through the platform, meaning their existing pricing structures will be unaffected by the move.","Ellison framed the decision as the latest way PayPal is seeking to support the bitcoin ecosystem, pointing to its past efforts to help companies in the bitcoin mining space accept PayPal for their products.","However, Ellison suggested that PayPal is conscious of the controversies that have dominated this segment of the bitcoin industry, and that its support will continue for merchants that meet certain criteria, writing:","In recent months, a number of bitcoin mining companies, including early and current market leaders such as Butterfly Labs and CoinTerra have faced lawsuits from customers for failing to deliver equipment on advertised timelines.","In his statements, Ellison also suggested that PayPal has been monitoring conversation surrounding how bitcoin will be regulated, clarifying that PayPal will only seek to work with bitcoin companies that offer certain consumer protections.","Reitterating that PayPal needs to follow local laws and regulations in every market it serves, Eillson wrote:","PayPal also stated that while other cryptocurrencies have been available for some time \"only bitcoin has achieved significant scale\" in the payments space to date.","Images via PayPal"],"entity":[{"type":"Ellison","content":"PERSON"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"Braintree","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Coinbase","content":"PERSON"},{"type":"GoCoin","content":"ORGANIZATION"},{"type":"$6.6","content":"MONEY"}],"hashtag":["PayPal","Coinbase","E-commerce","Bitpay","Exchanges","startups","Merchants","News","Companies"],"authors":["Pete Rizzo"]}