{"summary":"The alleged fraud at FTX is a symptom of problems within crypto, something the industry must reckon with especially as an easy scapegoat goes on trial.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/10\/03\/crypto-is-on-trial-alongside-sam-bankman-fried\/","publishDate":"2023-10-03T21:29:13","id":15398,"type":null,"title":"Could Sam Bankman-Fried's Saga Happen Without Crypto?","category":["Consensus Magazine"],"content":["Today is the beginning of Sam Bankman-Fried’s trial, and can already count as one of the most pivotal days in crypto history. Even if nothing majorly important is happening on the stand, yet. The reason why this trial of just one man matters for an industry is simple enough: SBF, as he was sometimes chummily called, has been elevated into a symbol for everything wrong with crypto. And there’s a lot to regret.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","But it’s a mistake to say that Bankman-Fried is crypto in a nutshell, a representation of its inevitable dangers and excesses or Exhibit A of where this mostly unregulated industry will always end. That is, more or less, what New York Times crypto reporter David Yaffe-Bellany suggested in a recently co-published article: Crypto is on trial, as SBF faces a reckoning.","Per the NYT:","“It’s a fraud that was enabled and supercharged by crypto, and by crypto’s unique aspects,” said Lee Reiners, a crypto expert who teaches at Duke Law School. “It wouldn’t have been possible in any other context.”","This is an odd idea in a story that was largely just a summary of SBF’s journey through the legal system so far, but one that is probably widespread. Thankfully it’s easily dispelled by perhaps the person who groks the situation at FTX better than anyone, CEO and restructuring legend John J. Ray, who called SBF’s alleged theft of $8 billion “old-fashioned embezzlement.”","Crypto lends a patina of novelty to the situation, a sense that this is a crime only possible in the modern day, but the situation is fairly simple. SBF is accused of taking money that belonged to his customers and spending it on luxury real estate, gifts for mom and dad and vegan cheese. And his defenses are equally as classic: my girlfriend caused my financial problems, my lawyers are liars and “woops.”","But still, the idea that crypto is uniquely capable of causing a crime of this magnitude, is worth considering. Crypto is on the stand next to SBF, for better or worse, and played a pivotal role in his rise and fall — but is Sam Bankman-Fried a fair representative for a movement (of sorts) that spans industries, interests and the globe and has as many potential “use cases” as the dollars in your pocket?","Well, it’s true enough that SBF is as good a figurehead as any for “the unrestrained hubris and shady deal-making” that permeates the industry. But a centralized exchange that primarily grew by buying political clout is not exactly the vision Satoshi Nakamoto set out for Bitcoin. Is this a case of “no true Scotsman,” where “true crypto” has never been tried, or “affiliate marketing,” a parasitism of branding where bad products are sold through association to something better?","Unfortunately the reasoning behind Reiners’ bold claim that SBF couldn’t happen without crypto was cut out if it was ever given. Speaking on his behalf (I’ll try my best), it’s more than fair to say semi-pseudonymous, global money-printing machines that anyone can turn on enable misuse. In fact, crypto is abused for the same reason it’s used, these are undiscerning tools that have no need to know who is using them or why.","And that is the principle innovation behind crypto: digital money that has similar guarantees over privacy, ownership and fungibility as cash. Hence Bitcoin’s original tagline: digital cash. (People deeper down the crypto rabbit hole might add benefits like: empowering people to transfer and hold wealth like never before, defanging the Westphalian nationstate’s monopoly over money and the thing that will prevent poverty, war and social strife…if only it were widely adopted.)","So in a certain sense the question is: Could an SBF-sized empire operate through cash or the traditional financial system? I think the existence of the Sinaloa drug cartel would prove this to be the case, though it’s worth noting that some cartel members are apparently using Ethereum for money transfers.","See also: How Big Is Crypto Crime, Really?","And on the other end: does crypto, in particular, foster crime on the internet? As ransomware expert and reformed blackhat Marcus Hutchins once told me: ransomware existed before crypto, and it’ll exist even if every Bitcoin node is powered down. Take that as you will, but it seems likely if there are crimes to commit, money to finance it will be found.","Plus, has anyone ever given thought to the idea that internet crimes are growing because the internet itself is? This doesn’t explain away illegal securities offerings or rug pulls, but may explain why crypto is being used for crime in the first place, given that immutable, public ledgers are generally a thing criminals would avoid.","None of this is to downplay crypto’s role in Bankman-Fried’s story, only to complexify the idea that it was the only means to get to this end. Afterall, it’d be dishonest to claim crypto is a “revolutionary technology,” but disclaim the idea that it can have negative effects.","Other “unique aspects” of crypto Reiners might consider are social, like the norm in place where insiders take a cut of the projects they launch — also primed for exploitation (as opposed to Bitcoin’s “fair launch,” organized by Satoshi Nakamoto). Bankman-Fried, for instance, basically controlled the distribution of the exchange token FTT, which he used to underwrite loans and leverage his hedge fund Alameda Research to the hilt.","Likewise, crypto culture does not only enable crime, but fosters it. Thefts are expected, hitting the high and low, and hacks are a cost of doing business. It’s understood that bad actors are an appropriate price to pay to achieve financial privacy and personal sovereignty. Often people embrace the feeling of outlawness, the idea that this corner of their life will not be mediated by anyone along with the attendant responsibilities.","Bankman-Fried banked on all of this when building his empire, as well as perhaps the most foundational “meme” (used in the classic Dawkinian sense) in crypto: anything can have value if enough people say it does. Call this force FOMO, speculation or “number go up” “technology,” but it’s the principle reason why crypto prices move up (when they do) and why something like a CryptoDickButt NFT can have a price at all.","This collective dream machine is why there are so many crypto figureheads, like SBF, at one point, who do the job of articulating the crowd’s desires, demands and, yes, delusions — hopefully making it palatable enough to get the next greater fool involved — while also reassuring people that they’re betting alongside the smart money set. (Look at him, on stage with Bill Clinton: he has my interests in mind.)","All of this may sound like a fairly negative reading of crypto and its surrounding community (and in an article meant as a defense, no less). But, again, arguably, none of this is exclusive to crypto. The technological innovations in blockchain are like the technological innovations anywhere, and require human input to be put to good or bad ends.","This may be a tautology, but it’s a lesson humankind reckons with over and over and over again as it develops new tools. Plastics poison rivers and preserve food. Cracking the atom powers homes and leveled cities. To the extent that crypto is different, it’s that it has definitely caused societal harm but hasn’t yet found widespread use.","See also: The DeFi Financial Crime Arms Race","Sam Bankman-Fried’s alleged crime was old fashioned, and his purported motives were as ancient as Human Nature. Crypto was the conduit for his greed, but not the cause. He was someone who grew up hearing, literally, that actions have no consequences. And so, the container for his reckless ambition could have been anything: AI, quant trading, etc., so long as it was a high-growth industry to make and donate as much money as possible.","There were real economic costs to the collapse of Bankman-Fried’s empire, the total market capitalization of crypto has bled out about $1.9 billion since the day FTX declared bankruptcy. FTX’s convoluted corporate web and SBF’s industry-spanning relationships have meant the exchange was far from the only firm to go bust. Regulatory headway in the U.S. has stalled, in large part due to SBF’s obscene attempts to buy favor.","Yet, as fitting an example as Bankman-Fried is for the rot inside crypto, he’s a poor scapegoat for the industry’s failings. Crypto is on trial alongside Bankman-Fried, but the true crime would be if its truest believers missed this opportunity to judge itself. Lest another Sam Bankman-Fried will rise and fall again.","UPDATE (OCT 3, 2023): Changes headline and subhead."],"entity":[{"type":"Bellany","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"New York Times","content":"ORGANIZATION"},{"type":"Bill Clinton","content":"PERSON"},{"type":"The DeFi Financial Crime Arms Race","content":"ORGANIZATION"},{"type":"OCT 3, 2023","content":"DATE"},{"type":"Sinaloa","content":"LOCATION"},{"type":"John J. Ray","content":"PERSON"},{"type":"humankind","content":"LOCATION"},{"type":"David Yaffe","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Marcus Hutchins","content":"PERSON"},{"type":"Satoshi Nakamoto","content":"PERSON"},{"type":"Duke Law School","content":"ORGANIZATION"},{"type":"Reiners","content":"PERSON"},{"type":"Lee Reiners","content":"PERSON"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"$1.9 billion","content":"MONEY"},{"type":"CryptoDickButt NFT","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"SBF","content":"ORGANIZATION"},{"type":"$8 billion","content":"MONEY"},{"type":"Human Nature","content":"ORGANIZATION"}],"hashtag":["Opinion","FTX","Sam Bankman-Fried","Crime","The Node","Newsletters"],"authors":["Daniel Kuhn"]}