{"summary":"The SEC wants to know if the applications for ETFs that hold Ethereum's ether (ETH) are supported by the same arguments that led to the approval of spot bitcoin ETFs.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/06\/sec-pushes-back-decision-on-blackrock-fidelitys-ether-etf-applications\/","publishDate":"2024-03-06T00:50:49","id":15391,"type":null,"title":"SEC Pushes Back Decision on BlackRock, Fidelity's Ether ETF Applications","category":["Policy"],"content":["The U.S. Securities and Exchange Commission (SEC) on Monday delayed making any decision on ether (ETH) exchange-traded fund applications from BlackRock and Fidelity on Monday, launching comment periods for both applications in the process.","The SEC asked public commenters to explain if they agree with Fidelity, BlackRock, Cboe and Nasdaq that the arguments made in favor of the recently approved spot bitcoin ETFs similarly support ETFs that would hold Ethereum's ether. The regulator also wants feedback on whether spot ether ETFs might be susceptible to manipulation and whether spot and futures ether exchange-traded products are similar.","Continuing delays in the next few weeks are to be expected, with May 23 being the date to watch for, said James Seyffart, an analyst with Bloomberg Intelligence. The SEC should have made a final decision on the applications by then. But there are other signs that might indicate how the SEC is viewing these applications over the next month or so.","If applicants start filing updates to their documentation that suggest they're incorporating feedback directly from the regulator – similarly to the back-and-forth in the weeks before bitcoin ETFs were approved in January – it would be a sign for more optimism, he said.","Issuers have already filed some updates over the past few weeks, but many of these seem to reflect lessons learned from the bitcoin ETF application process, rather than responding to specific guidance or feedback from the SEC.","\"We've seen a couple updates over the last 30 days. Some of the different issuers have done some things, but what that was, as far as I'm concerned ... a lot of the updates thus far have been them bringing these Ethereum filings up to date with the things they learned in the bitcoin ETF process. There's nothing that's been updated that is specific to ETH,\" he said. \"We haven't seen anything that's relevant specifically to an update that indicates to us for sure that the SEC is talking to any of these guys about a theory, but they are notoriously close-lipped and not supposed to talk to anyone.\"","Edited by Nick Baker."],"entity":[{"type":"James Seyffart","content":"PERSON"},{"type":"BlackRock","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Fidelity","content":"ORGANIZATION"},{"type":"Nick Baker","content":"PERSON"},{"type":"Bloomberg Intelligence","content":"ORGANIZATION"},{"type":"Monday","content":"DATE"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Cboe","content":"ORGANIZATION"},{"type":"last 30 days","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"},{"type":"May 23","content":"DATE"}],"hashtag":["Regulations","SEC","Ether ETFs","BlackRock","Fidelity","Bitcoin ETF"],"authors":["Nikhilesh De"]}