{"summary":"Bankman-Fried will be sentenced later this month.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/03\/19\/ftx-users-describe-emotional-toll-from-bankruptcy-in-letters-to-judge-ahead-of-sam-bankman-frieds-sentencing\/","publishDate":"2024-03-19T05:20:14","id":15396,"type":null,"title":"FTX Users Describe 'Emotional Toll' From Bankruptcy in Letters to Judge Ahead of Sam Bankman-Fried's Sentencing","category":["Policy"],"content":["FTX’s creditors say the exchange’s 2022 collapse “robbed [them] of [their] financial security,” exacted an “emotional toll,” and “created a sense of insecurity and mistrust toward the financial system,” they said in a series of victim statements filed in founder Sam Bankman-Fried’s criminal case.","The Department of Justice filed dozens of victim impact statements from FTX creditors Monday before Bankman-Fried’s sentencing next week. These victims hail from around the world, and the letters describe their FTX holdings and the effect FTX’s bankruptcy had on their lives.","“I find myself in a financially precarious situation,” one letter said. “As a restitution claimant, my income has been nonexistent for over a year, and my circumstances are exacerbated by my current unemployment status and ongoing disability recognition process.”","Read all of CoinDesk's coverage on the Sam Bankman-Fried trial here.","Several other respondents said they were unemployed due to health issues and depended on the funds they stored in FTX.","Some of the respondents said they trusted FTX based on Bankman-Fried’s comments about the exchange or because of the perception that U.S.-based crypto exchanges were regulated and otherwise safe (while FTX.US was based in the U.S., the main FTX global entity was headquartered in The Bahamas).","Some of the comments took issue with the idea that they were being made whole from the FTX bankruptcy, noting that they were receiving 100% of the value of their assets from November 2022 and not the value those assets would have at present crypto prices. Bitcoin’s (BTC) price hovered around $16,500 shortly after FTX filed for bankruptcy. As of press time, it was trading around $65,000.","Some victims’ names and email addresses were redacted in the publicly available versions of the documents. Corporate victim statements were not redacted, and a DOJ letter accompanying the letters said,","Some of these victim impact statements also appear to follow a form letter format, with recipients substituting their account values at the time of bankruptcy, the value as of when the letters were filed and the loss amounts. Many of the letters, both the templated versions and others, emphasized the loss of value from waiting for their funds.","“I respectfully urge the court to consider the full scope of the impact that Sam Bankman-Fried’s actions and the collapse of FTX have had on my family and me,” another letter said. “Justice, in this case, should not only involve penalizing the wrongdoer but also ensuring that the victims are genuinely compensated for their losses.”","The victim impact statements come just after the DOJ filed its sentencing memorandum arguing Bankman-Fried should spend 40 to 50 years in prison for his conviction on seven different fraud and conspiracy charges last November. The recommendation from prosecutors is less than the 100 years proposed in a Presentence Investigation Report by a probation officer.","His defense team filed its sentencing memo last month, urging District Judge Lewis Kaplan to impose a lighter sentence of no more than 6.5 years.","The defense filed multiple character reference letters from Bankman-Fried’s parents and brother, fellow adherents of the Effective Altruism philosophy, former FTX employees and several others.","Bankman-Fried’s sentencing is scheduled for 9:30 a.m. ET on March 28.","Edited by Parikshit Mishra."],"entity":[{"type":"$65,000","content":"MONEY"},{"type":"Department of Justice","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"2022","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"March 28","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"The Bahamas","content":"LOCATION"},{"type":"November","content":"DATE"},{"type":"100%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Justice","content":"ORGANIZATION"},{"type":"DOJ","content":"ORGANIZATION"},{"type":"November 2022","content":"DATE"},{"type":"$16,500","content":"MONEY"},{"type":"9:30 a.m.","content":"TIME"},{"type":"Lewis Kaplan","content":"PERSON"}],"hashtag":["Regulations","FTX","SBF Trial","Sam Bankman-Fried"],"authors":["Nikhilesh De"]}