{"summary":"Binance said no to an investment in Genesis as the crypto lender seeks to raise a $1 billion emergency loan, according to the Wall Street Journal.\n\nBinance turned down the deal, citing a potential conflict of interest with Genesis’ business model.","author":["Jeremy Nation","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/188956\/binance-will-not-invest-in-crypto-lender-genesis-wsj","publishDate":"2022-11-21T20:41:35","id":1540,"type":null,"title":"Binance will not invest in crypto lender Genesis: WSJ","category":["Bankruptcy"],"content":["<span data-v-f87c67ca=\"\">After crypto lending firm Genesis<a href=\"https:\/\/www.theblock.co\/post\/187545\/genesis-global-capital-suspends-redemptions-with-impact-spreading-to-gemini\" data-v-f87c67ca=\"\"> suspended client redemptions<\/a> and indicated it would seek a $1 billion emergency cash loan, major potential backer Binance said no to the investment, the Wall Street Journal first reported.<\/span>","<span data-v-f87c67ca=\"\">Binance turned down the opportunity to invest in the lending firm owned by the Digital Currency Group over a potential conflict of interest with the Genesis' business model, a source familiar with the matter told the Wall Street Journal.<\/span>","<span data-v-f87c67ca=\"\">Genesis also sought an investment from Apollo Global Management, the newspaper reported.<\/span>","<span data-v-f87c67ca=\"\">The struggles with Genesis began after a run on withdrawals at the firm’s affiliated exchange, Gemini, occurred in the wake of the collapse of crypto exchange FTX, according to a <a href=\"https:\/\/www.theblock.co\/post\/188891\/genesis-warns-of-possible-bankruptcy-without-funding-bloomberg\" data-v-f87c67ca=\"\">report<\/a> citing a confidential document.<\/span>","<span data-v-f87c67ca=\"\">Genesis is still weighing all its options and appears to be in no rush to file for bankruptcy, despite Binance declining to invest.<\/span>","<span data-v-f87c67ca=\"\">&nbsp;<\/span><span data-v-f87c67ca=\"\">“We have no plans to file bankruptcy imminently. Our goal is to resolve the current situation consensually without the need for any bankruptcy filing. Genesis continues to have constructive conversations with creditors,” a Genesis spokesperson told The Block earlier in an email.<\/span>"],"hashtag":[]}