{"summary":"Bitfinex Derivatives announced the launch of perpetual futures tied to Volmex's proprietary bitcoin and ether implied volatility indices.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/03\/bitfinex-derivatives-users-can-now-place-bets-on-bitcoin-and-ether-implied-volatility\/","publishDate":"2024-04-03T09:00:00","id":15404,"type":null,"title":"Bitfinex Derivatives Users Can Now Place Bets on Bitcoin and Ether Implied Volatility","category":["Markets"],"content":["Cryptocurrency exchange Bitfinex announced the launch of perpetual futures tied to bitcoin (BTC) and ether (ETH) volatility indices, allowing traders to place bets on expected price turbulence in the leading cryptocurrencies.","The new futures are based on the decentralized derivatives platform Volmex’s bitcoin implied volatility index (BVIV) and ether implied volatility index (EVIV).","Both indices are derived from real-time bitcoin and ether call and put options and indicate the expected price turbulence over 30 days. Per Volmex, the two indices are analogous to Wall Street’s fear gauge, the VIX index, which is derived from the options market tied to the S&P 500 index.","Starting April 3, Bitfinex users can trade bitcoin and ether volatility futures under the ticker symbols BVIVF0:USTFO and EVIVFO:USDTFO, according to the press release shared with CoinDesk. These contracts are denominated, margined, and settled in tether (USDT), the world’s largest dollar-pegged stablecoin.","Perpetuals are futures contracts with no expiry and a funding rate mechanism that helps keep prices for perpetuals in sync with the underlying asset\/index.","The availability of volatility futures means Bitfinex users can bet on how fast the anticipated bullish or bearish price move in bitcoin and ether will happen. Being long volatility means betting the asset’s price might move violently in either direction.","The volatility futures will help traders navigate binary events like crucial U.S. economic data releases, Fed rate decisions, and crypto-specific events that have the potential to inject volatility into the market and open doors to retail investors who lack the resources or expertise to set up complex options strategies like straddles and strangles to profit from changes in implied volatility.","Bitfinex’s new offering comes a year after dominant crypto options exchange Deribit listed standard futures contracts tied to its proprietary bitcoin volatility index, DVOL.","Edited by Parikshit Mishra."],"entity":[{"type":"S&P","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"April 3","content":"DATE"},{"type":"Fed","content":"ORGANIZATION"},{"type":"BTC","content":"ORGANIZATION"},{"type":"VIX","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Parikshit Mishra","content":"ORGANIZATION"}],"hashtag":["Bitcoin","Ether","Markets","Volatility","perpetual contracts"],"authors":["Omkar Godbole"]}