{"summary":"Bare-knuckled bitcoin litigation, agents (but not the James Bond kind), and why too much of a good thing isn’t sometimes. This week’s CCM covers each of","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/7709\/canadian-blockchain-consultant-allegedly-receives-80000-for-services-and-provides-nothing","publishDate":"2019-01-17T19:05:20","id":1540,"type":null,"title":"Canadian &#x27;blockchain consultant&#x27; allegedly receives $80,000 for services, provides nothing","category":["LEGAL"],"content":["Bare-knuckled bitcoin litigation, agents (but not the James Bond kind), and why too much of a good thing isn’t sometimes. This week’s CCM covers each of these as we look at two new crypto lawsuits, and one new opinion. [As always, Rosario summaries are “NMR” and Palley summaries are “SDP”]","<em data-v-f87c67ca=\"\">Disclaimer: These summaries are provided for educational purposes only by Nelson Rosario [twitter:<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>] and Stephen Palley [twitter:<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>]. They are not legal advice. These are our opinions only, aren’t authorized by any past, present or future client or employer. Also we might change our minds. We contain multitudes. (Picture credit: <a href=\"https:\/\/pixabay.com\/en\/car-car-wreck-oldtimer-vehicle-1904648\/\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">https:\/\/pixabay.com\/en\/car-car-wreck-oldtimer-vehicle-1904648\/<\/a>; CC0 Creative Commons)<\/em>","<em data-v-f87c67ca=\"\"><strong data-v-f87c67ca=\"\">[related id=1]StoAmigo International, LLC v. Vanbex Group, Inc. et al., 2:19-cv-00224, C.D. Ca. January 10, 2019 [NMR]<\/strong><\/em>","This is not your typical ICO related lawsuit. No, in this suit the plaintiff is actually an established company that already had users, and revenue, and was a real live company! They just happened to want to get in on the blockchain train with a new product\/service line. That’s when they met the team at the Vanbex Group, and well, here we are.","Before getting into the particulars of this case it is worth briefly discussing a concept in law known as agency. Essentially, all businesses empower their employees to act on behalf of the business whether that’s signing contracts, setting up deals, representing the company to the press, etc. This delegation of power makes sense, because CEOs and other executives can’t do everything. So, within reason, the company is then responsible for the actions of the agent if the agent is acting within their authority whether it is expressly given or implied. Okay, great.","In this case, Vanbex Group held itself out as a sort of one-stop shop to bring your token sale dreams to life. They would help with white papers, facilitate introductions to investors in the US and elsewhere, find you legal counsel, talk to regulators, make sure you hit your hard cap, and all that jazz. To let everyone know they were legit, they often touted the success of their own token raise of $30 million via the Etherparty ICO.","StoAmigo alleges that based on these representations they decided that they wanted to contract with the Vanbex Group to help them launch an ICO to fund the building of a blockchain network they conceived of called the AXEL blockchain. Incidentally, they filed at least two blockchain patent applications on the AXEL blockchain technology. This is the first crypto lawsuit I know of that even mentions patents, but I digress.","One of Vanbex’s employees, Richard Flagor who was the executive vice president of sales at Vanbex (and who incidentally was terminated by Vanbex at one point without them telling StoAmigo), was the main point of contact for StoAmigo. Over a period of over two months of negotiations Flagor promised that Vanbex would handle almost everything necessary for a token sale. All StoAmigo had to do to lock down Vanbex was pay $80,000 for two months of work, and an option to pay an additional $40,000 per month after that. So, they signed a service agreement. They being the StoAmigo team and Vanbex CEO Kevin Hobbs. This was April 9, 2018.","StoAmigo allegedly paid the $80,000, and then over the next two months StoAmigo alleges that Vanbex delivered… nothing. Zip. Zilch. Bupkis. One allegation is that on April 12, 2018, the Vanbex team promised two tickets to the Coin Center dinner in NYC, and private meetings with investors at the Consensus conference. When the StoAmigo team arrived in NYC for Blockchain Week allegedly nothing that was promised transpired.","Arguably the worst allegation relates to a teleconference call on July 12, 2018, between the StoAmigo team and the Vanbex leadership including Hobbs the CEO. Allegedly, during the call Hobbs claimed that Vanbex was under no obligation to meet the terms of the services agreement, that StoAmigo had been lied to by Flagor, and apparently when StoAmigo asked for a full refund they were denied. I mean...","Generally, you can’t really keep people’s money for services that they thought they were paying for that were never really delivered. Given how one-sided this situation looks I’m curious to see what Vanbex has to say, because as of right now this is a little nutty.","The Block<em data-v-f87c67ca=\"\"> is delighted to bring you expert cryptocurrency legal analysis courtesy of Stephen Palley&nbsp;(<a href=\"https:\/\/twitter.com\/stephendpalley\" data-v-f87c67ca=\"\">@stephendpalley<\/a>) and Nelson M. Rosario&nbsp;(<a href=\"https:\/\/twitter.com\/NelsonMRosario\" target=\"_blank\" rel=\"noopener noreferrer\" data-v-f87c67ca=\"\">@nelsonmrosario<\/a>). They summarize three cryptocurrency-related cases on a weekly basis and have given <\/em>The Block<em data-v-f87c67ca=\"\"> permission to republish their commentary and analysis in full. Part I of this week's analysis,&nbsp;Crypto Caselaw Minute, is above.<\/em><i data-v-f87c67ca=\"\"><\/i>","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"Vanbex","content":"ORGANIZATION"},{"type":"StoAmigo International","content":"ORGANIZATION"},{"type":"Etherparty ICO","content":"ORGANIZATION"},{"type":"$80,000","content":"MONEY"},{"type":"CCM","content":"ORGANIZATION"},{"type":"Nelson Rosario [","content":"PERSON"},{"type":"SDP","content":"ORGANIZATION"},{"type":"Kevin Hobbs","content":"PERSON"},{"type":"Vanbex","content":"PERSON"},{"type":"January 10, 2019","content":"DATE"},{"type":"July 12, 2018","content":"DATE"},{"type":"Stephen Palley","content":"PERSON"},{"type":"LLC v. Vanbex Group, Inc.","content":"ORGANIZATION"},{"type":"NYC","content":"ORGANIZATION"},{"type":"Rosario","content":"PERSON"},{"type":"CC0 Creative Commons)","content":"ORGANIZATION"},{"type":"April 9, 2018","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"Crypto Caselaw Minute","content":"ORGANIZATION"},{"type":"Nelson M. Rosario&nbsp;(","content":"PERSON"},{"type":"$30 million","content":"MONEY"},{"type":"April 12, 2018","content":"DATE"},{"type":"US","content":"LOCATION"},{"type":"Vanbex Group","content":"ORGANIZATION"},{"type":"Richard Flagor","content":"PERSON"},{"type":"Palley","content":"PERSON"},{"type":"C.D.","content":"LOCATION"},{"type":"$40,000","content":"MONEY"},{"type":"Hobbs","content":"PERSON"}],"hashtag":[],"authors":["Contributor Network","The Block"]}