{"summary":"However, WLD prices may run into headwinds as a token unlock worth $165 million is set to begin today, occurring until Feb.26, data from Token Unlocks show.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/19\/worldcoins-rocketing-wld-token-could-benefit-creditors-of-three-arrows-capital-ftx\/","publishDate":"2024-02-19T11:44:15","id":15405,"type":null,"title":"Worldcoin’s Rocketing WLD Token Could Benefit Creditors of Three Arrows Capital, FTX","category":["Markets"],"content":["An over 200% surge in Worldcoin’s WLD tokens in the past week is seemingly benefiting a key group of investors – creditors of the bankrupt fund Three Arrows Capital (3AC), 3AC founder Su Zhu said on X on Monday.","However, WLD prices may run into headwinds as a token unlock worth $165 million is set to begin this week, ending on Feb.26, data from Token Unlocks show.","“I won’t be benefiting from WLD outperformance, but I'm glad 3AC creditors have one of the largest positions in WLD in the world,” Zhu said. “Got hated on a lot for this worldcoin investment in 2021.”","Worldcoin is a controversial project that wants to scan everyone’s eyes in exchange for a digital ID and tokens. Every person receives depends on how early in the project’s roll-out they got involved and is distributed over two years, with 10% available immediately in a wallet app generated by the Orb.","3AC participated in a $25 million round for Worldcoin’s developer Tools For Humanity, which valued the firm at a $1 billion valuation, data from funding tracker Dealroom shows. The firm’s exact WLD holdings are unknown, and its founders owe creditors over $1.5 billion from investment losses, as per court filings.","Another creditor group that could likely benefit is the FTX estate. In its Series A in October 2021, Worldcoin also received investment from Sam Bankman-Fried (SBF), the founder and CEO of crypto exchange FTX, which has since gone bankrupt with Bankman-Fried facing allegations of fraud.","Data tracked by SpotOnChain shows wallets linked to Bankman-Fried’s company received over $185 million worth of WLD tokens in August 2023. The same Worldcoin address also sent tokens worth between $35 million to $170 million to several other addresses in the same month, blockchain transactional history shows.","WLD’s rise has apparently come after AI developer OpenAI’s launch of a text-to-video generator, Sora, last week. Worldcoin’s parent company and OpenAI share the same founder, Sam Altman, and crypto traders are likely considering WLD a bet on the latter’s successes.","The token’s nearly 50% jump in the past 24 hours has propelled prices to all-time highs of over $7 as of Monday, giving Worldcoin a full diluted valuation of a mammoth $75 billion.","At launch and for 15 years, a total of 10 billion WLD will be released to the market. Tokens allotted to investors and the development team were locked for a year.","Edited by Parikshit Mishra."],"entity":[{"type":"August 2023","content":"DATE"},{"type":"$1 billion","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Worldcoin","content":"LOCATION"},{"type":"Su Zhu","content":"ORGANIZATION"},{"type":"Feb.26","content":"DATE"},{"type":"October 2021","content":"DATE"},{"type":"Monday","content":"DATE"},{"type":"Sam Bankman","content":"PERSON"},{"type":"$7","content":"MONEY"},{"type":"$25 million","content":"MONEY"},{"type":"crypto exchange FTX","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"$35 million","content":"MONEY"},{"type":"$185 million","content":"MONEY"},{"type":"Parikshit Mishra","content":"ORGANIZATION"},{"type":"$1.5 billion","content":"MONEY"},{"type":"$170 million","content":"MONEY"},{"type":"Sam Altman","content":"PERSON"},{"type":"200%","content":"PERCENT"},{"type":"FTX","content":"ORGANIZATION"},{"type":"$165 million","content":"MONEY"},{"type":"Sora","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"SpotOnChain","content":"ORGANIZATION"},{"type":"$75 billion","content":"MONEY"}],"hashtag":["worldcoin","Trading","Markets","Three Arrows Capital","FTX"],"authors":["Shaurya Malwa"]}