{"summary":"Senator Liz Warren has revved up her anti-crypto army by going after the revolving door between blockchain and Washington D.C. I stand with her, and you should too, against these enemies of the state: crypto users.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/12\/20\/if-youre-in-crypto-youre-a-criminal\/","publishDate":"2023-12-20T19:19:12","id":15407,"type":null,"title":"If You're in Crypto, You're a Criminal","category":["Consensus Magazine"],"content":["If you work in crypto, you are going to hell. I stand with Senator Elizabeth Warren (D-Mass.), as part of her anti-crypto army, in condemning this villainous industry chock full of crooks, bastards and fools waiting to be separated from their money. The grift and crime rampant throughout crypto is comical and villainous. It is comically villainous.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","Together with the likes of newsletter writer Matt Stoller, we of the anti-crypto army are banding together to strengthen regulatory attention on crypto. No way should there be a means for consenting peers to transact directly without a bank or other financial institution to act as an intermediary.","See also: Matt Stoller: Cryptocurrencies: A Necessary Scam?","We must keep people and the public safe. If cash were created today, I’d oppose it for the same reasons as crypto. Cash and crypto both fall afoul of the Bank Secrecy Act (BSA). The BSA is a much needed and highly effective regulation. Without it, U.S. financial activity would falter.","In no way is the BSA simply a means for banks to absolve themselves of the responsibility of proactively preventing fraud or making good when it happens, by allowing them to file wanton Suspicious Activity Reports to regulators who definitely have the means of assessing the risks. And in no way does the BSA violate the civil liberties enshrined in the U.S. Constitution — that is simply not a conversation worth having.","Indeed, because no crypto exchange performs standard know-your-customer (KYC) checks or works with on-chain analytics companies to monitor for illicit activity or terrorist financing, the entire blockchain sector is simply a big black box presumably filled with fraud. I know this because Senator Warren wrote a letter to Congress saying so.","Nevermind that companies like Chainalysis or Elliptic routinely find that the vast majority of crypto use is legitimate or at least not explicitly illicit. I mean, what else would publicly verifiable and immutable ledgers be used for?","Indeed, Senator Warren also sent out a number of letters to crypto lobbyists including Coin Center, the Blockchain Association and crypto exchange Coinbase, which has recently reinvested in its own Washington D.C. pressure campaign, calling out the revolving door that exists between crypto and the Capitol. Shameful activity.","Banks and other stolid financial institutions would never hire former politicians or those with political connections to advance their interests. It would be unseemly — as unseemly, say, as a legislator who actively trades stocks.","Warren, mind you, is the Senator who got the Consumer Financial Protection Bureau through political gridlock, so she knows a few things about financial safety.","See also: Elizabeth Warren's Crypto Bill Is Likely Unconstitutional and Also Unlikely to Pass | Opinion","Because of all of this and more, I must join the ranks of the anti-crypto army and combat the adoption of crypto. Even if you want to grant that crypto has been used to fund dissident political actors and freedom fighters alongside terrorists, the contributions blockchain developers have made to cryptography and self-custody solutions or the political flowering that can follow when people begin to take ideas of sovereignty and community seriously, crypto cannot be worth it.","And what exactly are the costs of crypto? Meme coins, ransomware and grift. The internet is a place of learning, which flattens access to knowledge, not a place for fun and games and gambling. Further, in no way would the continued rapid growth of the internet explain at all the concomitant rise in online crime — only crypto explains the rise of hackers and scammers in U.S. society.","So, as my fellow anti-crypto soldier Matt Stoller has said, if you are in crypto or into blockchain at all today, you are likely an enemy of the state. I will die on this hill."],"entity":[{"type":"Blockchain Association","content":"ORGANIZATION"},{"type":"Mass.","content":"LOCATION"},{"type":"Warren","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"the Consumer Financial Protection Bureau","content":"ORGANIZATION"},{"type":"Washington D.C.","content":"LOCATION"},{"type":"Bank Secrecy Act (BSA","content":"ORGANIZATION"},{"type":"BSA","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Coin Center","content":"ORGANIZATION"},{"type":"Elizabeth Warren (","content":"PERSON"},{"type":"Capitol","content":"LOCATION"},{"type":"Matt Stoller","content":"PERSON"},{"type":"Elizabeth Warren","content":"PERSON"},{"type":"Senator Warren","content":"ORGANIZATION"}],"hashtag":["Opinion","The Node","Newsletters","Elizabeth Warren","Matt stoller","Crime"],"authors":["Daniel Kuhn"]}