{"summary":"Safe is planning to release a token, but the timeline isn't set.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/07\/26\/investors-waiting-for-safe-token-can-buy-gnosis-tokens-for-now\/","publishDate":"2022-07-26T19:50:59","id":15418,"type":null,"title":"Investors Waiting for Safe Token Can Buy Gnosis Tokens for Now","category":["Markets"],"content":["A blockchain project called Safe has grown over the past year to become one of the biggest institutional-grade wallets for managing digital assets on the Ethereum blockchain with $38 billion stored. Although the platform is planning to launch its own token called SAFE, executives aren't sure on the timeline for the launch.","Crypto analysts, however, say that investors can start betting on Safe’s success though a back door of sorts by buying the GNO token, which is linked to Safe’s parent company, Gnosis.","“If SAFE does well, GNO holders do well,” Matt Hepler, vice president of portfolio management at Arca, a crypto asset management firm, wrote to CoinDesk in an email. “It also allows Gnosis to increase focus on their digital-asset infrastructure business. It's a win-win.” He said Arca doesn't hold the GNO tokens.","GNO’s price has climbed over 30% since earlier this month when Safe raised $100 million in a strategic funding round from more than 50 investors, including 1kx, Coinbase Ventures, Tiger Global Management and Digital Currency Group. (DCG is CoinDesk's parent company.)","Safe has amassed more than 80,000 “safes” – or Ethereum-based smart contract wallets designed to give users “complete self-custody” of funds. Combined, those safes have processed more than 600,000 transactions since launching in 2017. The platform uses account abstraction, which allows users to customize how transactions are approved, alongside smart contracts and multi-signature wallets, to provide additional security.","The Gnosis Safe project was initially developed as an internal tool, and is being rebranded as simply Safe following a community vote to spin off from Gnosis, according to a blog post. The Gnosis community passed a measure in April to determine how SAFE tokens would be allocated.","\"Gnosis Safe has organically become critical infrastructure for Web3 as a means to securely manage digital assets,\" the post reads.","So in that sense, its ambitions might be greater than the original scope of Gnosis, whose main purpose is to serve as a test blockchain for the Ethereum network. Users can stake GNO tokens on the Gnosis Beacon Chain and earn rewards for validating transactions. The chain has more than 100,000 validators.","“Lots of things have been done on the Ethereum clients that cannot really shine on Ethereum yet because Ethereum is very conservative in terms of introducing any kind of change,” Gnosis co-founder and Chief Technology Officer Stefan George said in an interview. “Because Gnosis Chain is less valuable than Ethereum, we can be less conservative and push what is possible on an EVM network.” EVM stands for Ethereum virtual machine, which is the software platform that developers use to create decentralized applications on Ethereum.","George had told CoinDesk that the SAFE token was likely to launch in September or October. Later, he circled back to clarify that there was still too much uncertainty to name a concrete date.","Once SAFE goes live, 5% of the tokens will be airdropped to Safe and GNO users, and over four years, 15% of tokens will be vested in GnosisDAO, which guides the development, support and governance decisions of the Gnosis ecosystem. Holders of the GNO tokens can participate in the governance of GnosisDAO by signaling their approval or disapproval of improvement proposals.","Arca's Hepler said he believes that Safe’s expansion can unlock further growth potential for Gnosis and generate opportunities for investors.","“When businesses are spun out, they usually create a lot of value because they can operate more efficiently, they can raise capital, and it also attracts new investors,” Hepler said. “I might want to invest in Gnosis Safe or CowSwap, but not Gnosis collective.”"],"entity":[{"type":"DCG","content":"ORGANIZATION"},{"type":"GNO","content":"ORGANIZATION"},{"type":"2017","content":"DATE"},{"type":"Gnosis","content":"PERSON"},{"type":"Gnosis Beacon Chain","content":"LOCATION"},{"type":"$100 million","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"Stefan George","content":"PERSON"},{"type":"Arca","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"30%","content":"PERCENT"},{"type":"Hepler","content":"PERSON"},{"type":"$38 billion","content":"MONEY"},{"type":"Matt Hepler","content":"PERSON"},{"type":"September","content":"DATE"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Tiger Global Management and Digital Currency Group","content":"ORGANIZATION"},{"type":"15%","content":"PERCENT"},{"type":"Gnosis Safe","content":"ORGANIZATION"},{"type":"April","content":"DATE"},{"type":"October","content":"DATE"},{"type":"EVM","content":"ORGANIZATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Crypto","News","Altcoins","Gnosis","Wallet"],"authors":["Jimmy He"]}