{"summary":"The $620 million Ronin exploit isn't the half of it; play-to-earn ain't free.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/04\/04\/the-bigger-problem-with-axie-infinity\/","publishDate":"2022-04-04T18:14:55","id":15416,"type":null,"title":"The Bigger Problem With Axie Infinity","category":["Consensus Magazine"],"content":["On March 23, $620 million was stolen from the blockchain network associated with Axie Infinity, a crypto-backed video game.","The vulnerability has to do with the structure of the game itself, which revolves around real money – non-fungible tokens (NFT) – rather than your standard in-game currency. It’s what’s known as a “play-to-earn” model: Playing the game can actually make you money, if you play your cards right.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","Rather than operating directly on the tried and true Ethereum network, Axie Infinity uses a custom-built sidechain called Ronin – essentially an Ethereum spin-off meant to reduce congestion on the main chain. In order to interact with applications built on Ronin, you’ll need to port your crypto over to the network using a specialized program called a “bridge.”","This was the site of last month’s exploit. Blockchain networks are notoriously difficult to mess with, in and of themselves – it’s when you’re moving money between networks that cracks start to form. An attacker managed to steal around $610 million from Poly Network last year by going after the bridge. And just two months ago, the decentralized finance (DeFi) platform Wormhole had its bridge hacked to the tune of $325 million.","In the case of Axie\/Ronin, the company behind the network didn’t even notice the hack for about a week. Or if it did, it decided to take its time in formally announcing it: A blog post revealing the losses went up on March 29, six full days after the attacker made off with the funds.","“This is when we show what we're made of,” tweeted Axie co-founder Jeff Zirlin at the time. “Chaos is a ladder.” (The apparent ”Game of Thrones” reference was not explained.)","This sort of dug-in flippancy has more or less been the mentality of the Axie Infinity team. The Ronin bridge remains down, which means Axie players can’t actually withdraw their crypto from the network, but top brass has apparently decided the show must go on. Sky Mavis, the company responsible for Axie Infinity, has said it plans to reimburse players for their lost funds. It also delayed the game’s next big upgrade, titled “Axie Infinity: Origin,” by a week.","But as Axie looks to retain its status as the single largest play-to-earn ecosystem on any blockchain, security issues may be the least of its worries.","Back in December, Zirlin described Axie Infinity’s play-to-earn mechanics as a kind of liberation for the world of online gaming.","“All we’ve done is we’ve added a system of property rights into games,” he told me, referencing the idea that players can actually “own” Axie NFTs on the blockchain. “So, in some ways, we’ve freed people. We’ve given them something that they should have had all along.”","Read More: A Future Where Every Inch of Culture Is Monetized","In practice, though, Axie is a lesson in the dangers of play-to-earn.","While the game can make you money, it can also create debts. Playing the game requires a starting roster of three Axie NFTs, which can only be acquired on the secondary market. Players who can’t afford those initial NFTs (typically costing a couple hundred dollars) turn to Axie “scholarship” programs, wherein wealthy benefactors front the buy-in in exchange for a cut of the profits.","Call it a gray market system – it’s not officially sanctioned by Sky Mavis, but in countries like Venezuela and the Philippines, it has become a common mode of interacting with the game. Some popular lenders take as much as two-thirds of the total profits, per the data aggregator CoinGecko.","It’s part of why, according to a report from the research firm Naavik, the majority of Filipino Axie players are still making below the country’s average minimum wage. Stephen Diehl, a prominent crypto critic, likened it to “digital serfdom,” though I think that may be slightly misstating it. It’s more like an especially predatory employment contract – a full-time job with extremely poor returns.","“The scholar grinds daily, you split the profits,” one scholarship manager told Motherboard. “Everybody wins!\"","This sort of attitude makes the “serfdom” analog easy to grok. Sky Mavis was valued at $3 billion this past fall, and is backed by the venture capital giant Andreessen Horowitz. As with any other crypto unicorn, there’s money to be made through speculation. Affiliated tokens AXS and SLP (smooth love potion) can be traded on decentralized exchanges outside of the game and have generated massive market capitalizations.","Meanwhile, the platform’s business model – which has already been criticized for its resemblance to a Ponzi scheme – relies heavily on this army of low-wage workers. They create value at the lowest level of the system (the game itself), most of which then flows out of their hands. It reflects an explicit power hierarchy: Those who start with the most money will always end up making the most money.","Read More: The First NFT Monopoly","A socialist might say that’s how many jobs already work. The difference is in the rhetoric: Zirlin claims to have “freed” his players when he has essentially recreated an existing, exploitative system on the blockchain.","This was the promise of Uber, too – the idea that anyone could be a driver, with an increased degree of flexibility. You didn’t need a medallion from the Taxi and Limousine Commission and you could effectively set your own hours. Drivers understood they were employees, but Uber didn’t see it that way; it used a massive ad campaign to persuade California voters to vote “yes” on a proposition that would exclude in-state gig workers from certain labor laws, and had no trouble getting its way.","As Axie Infinity scrambles to recover from the Ronin bridge hack, it’s putting its other fundamental issues on the back burner. There’s nothing inherently liberatory about the blockchain."],"entity":[{"type":"two months ago","content":"DATE"},{"type":"$3 billion","content":"MONEY"},{"type":"Axie\/Ronin","content":"ORGANIZATION"},{"type":"March 29","content":"DATE"},{"type":"Naavik","content":"PERSON"},{"type":"March 23","content":"DATE"},{"type":"$325 million","content":"MONEY"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Zirlin","content":"PERSON"},{"type":"Axie","content":"ORGANIZATION"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"last month","content":"DATE"},{"type":"Jeff Zirlin","content":"PERSON"},{"type":"SLP","content":"ORGANIZATION"},{"type":"Venezuela","content":"LOCATION"},{"type":"Axie Infinity","content":"ORGANIZATION"},{"type":"$610 million","content":"MONEY"},{"type":"First NFT","content":"ORGANIZATION"},{"type":"December","content":"DATE"},{"type":"Limousine Commission","content":"ORGANIZATION"},{"type":"the Philippines","content":"LOCATION"},{"type":"last year","content":"DATE"},{"type":"California","content":"LOCATION"},{"type":"Infinity","content":"ORGANIZATION"},{"type":"Stephen Diehl","content":"PERSON"},{"type":"$620 million","content":"MONEY"},{"type":"Motherboard","content":"ORGANIZATION"},{"type":"Poly Network","content":"LOCATION"},{"type":"Mavis","content":"PERSON"}],"hashtag":["Axie Infinity","NFTs","Opinion","The Node","Newsletters"],"authors":["Will Gottsegen"]}