{"summary":"The opposition party leads the polls in what's likely to be an election year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/01\/31\/labour-wants-uk-to-be-a-securities-tokenization-hub-and-advance-digital-pound-work\/","publishDate":"2024-01-31T15:41:05","id":15415,"type":null,"title":"Labour Wants UK to Be a Securities Tokenization Hub and Advance Digital Pound Work","category":["Policy"],"content":["The U.K.'s opposition Labour party said it will work to make the country a hub for securities tokenization, promote a digital pound and \"unashamedly champion\" the financial services industry if it comes to power after an election that's expected to take place this year.","A 28-page document titled \"Financing Growth\" outlines Labour's plan for the financial sector, which includes making the U.K. a sustainable finance hub, scaling regional finance centers and embracing fintech innovation.","A general election must be held within the next 12 months, and Prime Minister Rishi Sunak has said it could take place in the second half of this year. The Conservative government has ushered in a plethora of policies concerning the digital-asset sector. Several bills, including a markets bill that made crypto a regulated activity, were put through in 2023, while work on a digital pound and tokenization also started. Labour, however, leads in current polls on voting intentions.","\"Tokenization, which U.K. Finance defines as 'the digital representation of financial assets using distributed ledger technology,' presents a significant new opportunity for the U.K.,\" Labour said in the document, introduced by Rachel Reeves, the shadow chancellor, and Tulip Siddiq, shadow economic secretary to the Treasury. U.K. Finance is a lobby group representing the banking and finance industry.","Investment bank Citi Group estimated that tokenized assets could be worth close to $4 trillion globally by 2030 in research published last year. That means tokenization could increase liquidity and provide access to new asset classes, the report said.","\"A future Labour government will therefore look to make the U.K. a global leader in tokenization by advancing work to clarify the law around tokenization, and working with regulators to establish a proportionate, outcomes-based regulatory regime to oversee the technology,\" the plan said.","The party added it will look to further develop the digital-asset regulatory sandboxes and explore hosting a test issue of tokenized U.K. government bonds. It will work with other financial centers to \"establish interoperable standards and enable trade of tokenized assets across borders.\"","The digital pound also received the party's support. The Bank of England has been working on a central bank digital currency (CBDC), which has now entered a design phase after the end of a consultation period. The consultation garnered 50,000 responses, with privacy emerging as a key concern.","\"Labour recognises the growing case for a state-backed digital pound to protect the integrity and sovereignty of the Bank of England, and the U.K.’s financial and monetary system,\" the party said. \"Labour fully supports the Bank of England’s work in this area, and wants to ensure that issues such as threats to privacy, financial inclusion and stability are effectively mitigated in the design of a central bank digital currency.\"","The party's plans for tokenization and the digital pound have been welcomed by lobby group CryptoUK, a spokesperson said in a statement.","Read more: UK's Digital Pound Approach Should Help Manage Privacy Concerns, Experts Say","Edited by Sheldon Reback."],"entity":[{"type":"Sheldon Reback","content":"PERSON"},{"type":"next 12 months","content":"DATE"},{"type":"second half of this year","content":"DATE"},{"type":"Tulip Siddiq","content":"PERSON"},{"type":"Bank of England","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"U.K.","content":"LOCATION"},{"type":"$4 trillion","content":"MONEY"},{"type":"\" Labour","content":"ORGANIZATION"},{"type":"Treasury","content":"ORGANIZATION"},{"type":"Citi Group","content":"ORGANIZATION"},{"type":"U.K. Finance","content":"ORGANIZATION"},{"type":"Rishi Sunak","content":"PERSON"},{"type":"2030","content":"DATE"},{"type":"Digital Pound Approach Should Help Manage Privacy Concerns","content":"ORGANIZATION"},{"type":"Rachel Reeves","content":"PERSON"}],"hashtag":["Regulations","UK","CBDCs","Politics"],"authors":["Camomile Shumba"]}