{"summary":"Tax expert Daniel Winters explores the bigger picture behind the IRS summons for Coinbase data.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2016\/12\/03\/what-the-irs-summons-will-mean-for-coinbase-users\/","publishDate":"2016-12-03T16:54:06","id":15427,"type":null,"title":"What the IRS Summons Will Mean for Coinbase Users","category":["Markets"],"content":["Daniel Winters, MS Taxation, is the owner of Global Tax Accountants and a specialist in bitcoin and cryptocurrency taxation. ","In this op-ed, Winters explores the ramifications of the recent court order approving a summons by the IRS for user records held by bitcoin exchange Coinbase.","I’m a bitcoin and cryptocurrency accountant, and I don’t have good news: The IRS hammer is coming down.","Although the IRS issued guidance in March 2014 concerning income from bitcoin and \"virtual currencies\" (the IRS term), there has been no enforcement mechanism to ensure that bitcoin income is actually reported to the IRS.","Having failed to create an enforcement mechanism, the IRS is taking a brute-force approach. The John Doe summons authorized on 30th November demands that Coinbase provide complete transaction records for all users between 1st January, 2013 and 31th December 2015.","If the IRS succeeds in forcing Coinbase to turn over their records, this would be a massive invasion of privacy and guilt by association. Not all bitcoiners are tax cheats – I have a Coinbase account myself, and report every satoshi.","The situation is reminiscent of the John Doe summons which the IRS issued in 2009 during the UBS Bank offshore banking scandal.","UBS had set up Swiss bank accounts to hide hundreds of millions of dollars belonging to US citizens. Swiss banking secrecy cracked, UBS sent a list of names to the IRS, and individuals were prosecuted.","UBS paid a fine of $780m and some Americans with UBS bank accounts paid fines in the millions and went to prison.","Following this scandal, Congress passed the Foreign Account Tax Compliance Act (FATCA). This forces all non-US financial institutions to report directly to the IRS the income and other information for accounts held by US citizens.","The IRS has a huge database to gather the information from thousands of banks around the globe.","A court document from 18th November, 2016 had detailed testimony in support of issuing the summons.","Here’s the skinny:","Most types of income are reported directly to the IRS. Stock sales are reported on form 1099-B, and wages are reported on form W-2. If you forget to include a 1099 on your taxes, the IRS will send you a letter demanding that you pay tax on the unreported income.","However, bitcoin is a decentralized, peer-to-peer network that allows us to exchange value between addresses on the bitcoin network. The Internal Revenue Service does not receive a data feed from transactions on the bitcoin network.","Therefore, the IRS can receive information in three ways:","For many bitcoin users in the US, Coinbase is their on-ramp. Although Coinbase users can generate reports listing their bitcoin transactions, and run a report for any capital gains or losses, to my knowledge Coinbase does not file 1099 forms with the IRS to report gains or losses from bitcoin transactions.","Because Coinbase is a payment processor, converting bitcoin to USD, they do issue Form 1099-K for merchants which have more than $20,000 of gross sales and more than 200 transactions in a given year. Form 1099-K is also used by other payment processors such as Amazon or Paypal.","So, Coinbase is filing 1099-K forms for merchants with transactions above the threshold, but is not filing 1099s for the transactions of individual users.","This brings us back to the honor system, and the IRS has decided that the honor system isn’t good enough for bitcoin.","Coinbase plans to fight the John Doe summons. If forced to comply, Coinbase will provide data on user transactions for 2013 to 2015.","If the lawyers cut a deal and Coinbase ends up providing information only for users with transactions above a certain threshold, the IRS will not reveal the threshold. Obviously, the IRS wants to scare people into voluntarily reporting all their bitcoin income.","Sorry, I warned you this wasn’t good news.","If you had a Coinbase account during 2013, 2014 and 2015 and accurately reported your bitcoin income, you have nothing to worry about.","If you did not report the income from your Coinbase transactions during that period, well, you may have a serious problem.","Assuming Coinbase provides transaction histories, then the IRS could use that information to audit your taxes and confirm you reported your bitcoin transactions.","You may not be informed if your records are sent to the IRS, and may find out only when you receive a nasty letter from the IRS demanding payment of the tax due on the bitcoin income.","To avoid this situation, you may want to consider filing amended tax returns to report any bitcoin income which was not previously reported. You should contact your tax advisor if you want to discuss your individual circumstances.","In conclusion, maybe we should also look at the IRS subpoena from another perspective.","Hayek predicted the emergence of private currencies that would compete against the traditional fiat currencies issued by sovereign governments.","Today we have bitcoin, founded on the proposition that we can all be our own bank, and be responsible for storing our own wealth in the form of Bitcoins.","It’s easy to fling bitcoins around the world, but not easy to track our transactions for tax purposes. Unfortunately, dealing with taxes is part of the financial responsibility for being our own bank.","Some people will undoubtedly say the IRS is threatened by bitcoin, that government wants to control cryptocurrency because it could bring down the fractional reserve banking system.","I don’t know, but one thing is for sure: There’s nothing certain in life but death and taxes!","Disclaimer: I am not an attorney. I have a Master’s of Taxation and own an accounting firm specializing in bitcoin and virtual currencies. I have written a course for CPAs about Bitcoin and Taxes and have a good understanding of how the IRS treats bitcoin transactions.","Nonetheless, this post is NOT legal advice, nor does it constitute advice regarding your personal tax situation. Under IRS Circular 230, I am not responsible for any positions you take on your tax return, unless I have prepared and signed that tax return. For detailed analysis of your tax situation, please consult your tax advisor.","Portions of this article were originally published in a post on Medium, which can be found here. ","Image via Shutterstock"],"entity":[{"type":"2014","content":"DATE"},{"type":"2015","content":"DATE"},{"type":"MS Taxation","content":"ORGANIZATION"},{"type":"John Doe","content":"ORGANIZATION"},{"type":"Amazon","content":"LOCATION"},{"type":"2013","content":"DATE"},{"type":"the IRS","content":"ORGANIZATION"},{"type":"$20,000","content":"MONEY"},{"type":"December 2015","content":"DATE"},{"type":"Shutterstock","content":"ORGANIZATION"},{"type":"UBS","content":"ORGANIZATION"},{"type":"USD","content":"ORGANIZATION"},{"type":"Hayek","content":"PERSON"},{"type":"November","content":"DATE"},{"type":"March 2014","content":"DATE"},{"type":"2","content":"DATE"},{"type":"Winters","content":"ORGANIZATION"},{"type":"$780m","content":"MONEY"},{"type":"Daniel Winters","content":"PERSON"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"January, 2013","content":"DATE"},{"type":"1099","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"John Doe","content":"PERSON"},{"type":"Paypal","content":"ORGANIZATION"},{"type":"2009","content":"DATE"},{"type":"18th November, 2016","content":"DATE"},{"type":"IRS","content":"ORGANIZATION"},{"type":"hundreds of millions of dollars","content":"MONEY"},{"type":"Coinbase","content":"ORGANIZATION"},{"type":"US","content":"LOCATION"},{"type":"UBS Bank","content":"ORGANIZATION"}],"hashtag":["Coinbase","IRS","Regulation","taxes","Features"],"authors":["Daniel Winters"]}