{"summary":"The disconnect between financial advisors and their clients around crypto has become increasingly apparent, given that 37% of advisors personally invested in crypto compared to up to 83% of their clients that may have, according to one 2023 survey.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2023\/03\/02\/advisors-learn-crypto-or-your-clients-will\/","publishDate":"2023-03-02T17:00:00","id":15429,"type":null,"title":"Advisors: Learn Crypto, or Your Clients Will","category":["Finance"],"content":["The rise of cryptocurrencies over the past decade has been nothing short of remarkable, with bitcoin alone surpassing a market capitalization of over $1 trillion in 2021. Yet, despite this surge in popularity, many financial advisors remain hesitant or even dismissive towards cryptocurrencies. This has created a growing disconnect between advisors and their clients who have invested in these digital assets.","The reasons for this disconnect are numerous. Some advisors are skeptical of cryptocurrencies, viewing them as a speculative bubble or simply failing to understand their underlying technology. Others may be deterred by the lack of clear regulations or guidance from regulatory bodies. Whatever the reason, the result is the same: advisors are often ill-equipped to advise their clients who own crypto assets.","You're reading Crypto for Advisors, a weekly look at digital assets and the future of finance for financial advisors. Subscribe here to receive the mailing every Thursday.","This disconnect can be especially problematic for clients who have invested heavily in cryptocurrencies without the guidance of a financial advisor. While some may have had tremendous success, others may be exposing themselves to unnecessary risks or missed opportunities. As such, it is crucial for advisors to become more informed and engaged with the world of cryptocurrencies to better serve their clients and help them make informed investment decisions.","The disconnect between financial advisors and their clients regarding cryptocurrencies has become increasingly apparent in recent years. The Bitwise\/VettaFi 2023 Benchmark Survey of Financial Advisor Attitudes Toward Crypto Assets underscores this trend, revealing that only 37% of advisors admit to having personally invested in crypto, down 10% from 2022. In contrast, the same survey revealed that financial advisors say that upwards of 83% of clients either have crypto or the advisor isn’t aware if they do.","Furthermore, a recent survey by Coinbase of over 2,000 Americans in February 2023 found that 76% of Americans believe that cryptocurrency and blockchain are the future, while 20% of all Americans currently own crypto. Additionally, 67% of Americans think that the current financial system needs major changes or a complete overhaul. These statistics demonstrate the growing popularity and acceptance of cryptocurrencies among the general public.","Read more: What Fat Tails and Revolutionary Ages Mean for Digital Assets","Despite these trends, the Bitwise\/VettaFi survey also showed that 76% of financial advisors in 2023 stated that they would definitely not or probably not invest their clients in crypto. This highlights the need for financial advisors to become more informed and engaged with these assets to better serve their clients and help them make informed investment decisions. As cryptocurrencies continue to gain mainstream acceptance and become more integrated into the financial landscape, advisors who remain disconnected from these assets may find themselves at a disadvantage. It is crucial for financial advisors to take these surveys seriously and adapt to the changing landscape of the financial industry.","As a financial advisor, I met with a client in late 2016-2017 for our normal annual review. At that time, I wasn't paying much attention to cryptocurrencies. However, during this meeting, my close client surprised me with news about his situation. It turned out that in 2015, he had become interested in Bitcoin and began investing in it without mentioning it to me.","Over the next few years, he had snowballed a $500 investment into a bitcoin mining facility netting himself an asset of around $500,000 in equipment and coins. As his advisor, I was caught off guard when he asked me what he should do with it and had no idea how to handle the situation. I realized then that if my client was exposed to potential estate, tax, security, liability and business issues, I had no idea how to help because I didn’t understand the technology that had just created this situation.","Read more: Introducing Our First Newsletter Course: Learn Crypto Investing","It was a wakeup call for me to take this emerging asset class more seriously and educate myself to better serve my clients. How could I be an advisor if I didn’t understand how to help? Being an advisor isn’t about understanding only the things you agree with, but understanding how to help any of your clients through a multitude of situations. This experience taught me the importance of staying informed and educated about emerging investment opportunities.","There are a few ways that financial advisors can work to close the disconnect between them and their clients when it comes to cryptocurrencies and other emerging investment opportunities.","First, it is crucial for advisors to stay informed and educated about cryptocurrencies and their potential benefits and risks. This can involve attending seminars and webinars, reading up on the latest news and developments in the industry, and engaging with other professionals who are knowledgeable about cryptocurrencies.","Second, advisors can proactively reach out to their clients and have open and honest conversations about their interest in these technologies. By understanding their clients' interests and preferences, advisors can better tailor their recommendations and provide guidance on the best way to invest in cryptocurrencies.","Third, advisors can work to integrate cryptocurrencies into their overall investment strategies, in a way that is appropriate for each individual client. This can involve recommending specific cryptocurrencies or investment vehicles, as well as offering guidance on how to manage and store cryptocurrency assets securely.","Finally, advisors can partner with experts in the field of cryptocurrency and blockchain technology, such as attorneys, accountants and other financial professionals, to provide comprehensive and well-informed advice to their clients. This can help ensure that clients have access to the full range of expertise and resources necessary to make informed investment decisions.","By taking these steps and closing the disconnect between themselves and their clients on cryptocurrencies and other emerging investment opportunities, financial advisors can position themselves as trusted and knowledgeable partners in their clients' financial journeys."],"entity":[{"type":"2015","content":"DATE"},{"type":"2016","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Thursday","content":"DATE"},{"type":"2023","content":"DATE"},{"type":"$500","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"76%","content":"PERCENT"},{"type":"20%","content":"PERCENT"},{"type":"67%","content":"PERCENT"},{"type":"February 2023","content":"DATE"},{"type":"First Newsletter Course: Learn Crypto Investing","content":"ORGANIZATION"},{"type":"83%","content":"PERCENT"},{"type":"Digital Assets","content":"ORGANIZATION"},{"type":"$500,000","content":"MONEY"},{"type":"Bitwise\/VettaFi 2023 Benchmark Survey of Financial Advisor Attitudes Toward Crypto Assets","content":"ORGANIZATION"},{"type":"37%","content":"PERCENT"},{"type":"$1 trillion","content":"MONEY"},{"type":"Bitwise\/VettaFi","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Crypto for Advisors","Newsletters","Opinion","Financial Advisers","Financial Advisors","Bitcoin Price","Bitwise","Bitwise Asset Management","Crypto Mining","crypto investing","DACS"],"authors":["DJ Windle"]}