{"summary":"The country hopes to align local requirements with those proposed by international banking regulators.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/21\/canadian-regulator-seeks-feedback-on-disclosure-rules-for-bank-crypto-exposures\/","publishDate":"2023-11-21T09:19:34","id":15424,"type":null,"title":"Canadian Regulator Seeks Feedback on Disclosure Rules for Bank Crypto Exposures","category":["Policy"],"content":["Canada's Office of the Superintendent of Financial Institutions (OSFI) is seeking feedback on disclosure requirements for local banks and insurers exposed to crypto, according to a Monday notice.","The consultation complements another on the same subject underway by international standard-setter, the Basel Committee on Banking Supervision (BCBS).","\"We are running our consultation in parallel. We intend to combine your feedback with developments coming out of the BCBS. This will help us articulate public disclosure expectations appropriate for banks and insurers in Canada,\" the OSFI said.","The Canadian regulator wants to know which technical aspects of the BCBS requirements should be adjusted to fit a local context and key considerations for ensuring \"proportionality of disclosures.\"","The BCBS has said banks must disclose any exposure to crypto and has proposed the highest possible risk weight of 1250% for volatile assets like bitcoin.","The public can submit comments on the requirements to OSFI until Jan. 31, 2024.","Edited by Oliver Knight."],"entity":[{"type":"Jan. 31, 2024","content":"DATE"},{"type":"Canada","content":"LOCATION"},{"type":"1250%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Canada's Office of the Superintendent of Financial Institutions","content":"ORGANIZATION"},{"type":"Oliver Knight","content":"PERSON"},{"type":"Basel Committee on Banking Supervision (BCBS","content":"ORGANIZATION"},{"type":"OSFI","content":"ORGANIZATION"}],"hashtag":["Regulations","Canada","banking","Crypto","Basel Committee"],"authors":["Sandali Handagama"]}