{"summary":"Solana is one of the newest competitors to enter the decentralized application sector, boasting lightning-fast speed and highly competitive transaction fees.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/solana\/","publishDate":"2021-09-03T16:41:43","id":15433,"type":null,"title":"Solana","category":["Learn"],"content":["Solana is a blockchain-based smart contracts platform designed to facilitate the creation of decentralized applications (dapps). The project was founded by Anatoly Yakovenko in 2017, while its native blockchain and crypto token, SOL, officially went live three years later in March 2020.","The project aims to compete against existing dapp platforms such as Ethereum and touts that its blockchain can process a maximum of 65,000 transactions per second (tps) with average fees of $0.00025. In contrast, Ethereum can handle around 30 tps (prior to the completion of its 2.0 upgrade) with an average transaction fee of $4.50.","In terms of decentralized applications running on its network, Solana has recorded significant growth since its launch, with more than 332 decentralized applications now live. Ethereum, however, still leads in this area with 2,841.","One thing that sets Solana apart from other dapp-platform competitors is its unique approach to the transaction validation process. Notably, Yakovenko incorporated a system for timestamping transactions such that validators (computers that verify transactions on the blockchain) all have a uniform view of the order in which new activities are being executed on the blockchain.","In other words, this system is essentially a type of consensus mechanism because network participants are tasked with analyzing the validity of transactions and must agree on a single history of events – this is why the whole concept is called the proof-of-history (PoH) consensus.","According to Yakovenko, he borrowed the concept that birthed Solana’s timestamping system from the design of Google’s and Intel’s centralized databases and remodeled the system so that it would fit into a decentralized architecture.","In addition to this mechanism, Solana also implements a proof-of-stake (PoS) consensus protocol.","Note that blockchains are not governed by a single entity. Instead, users must play their part to secure and maintain the network. This is especially necessary when validating transactions. Naturally, a blockchain requires users to collectively ensure that all transactions executed on the network are valid. In essence, users have to take up the role of validators.","However, blockchain protocols don’t just pick users indiscriminately whether they are capable or not. Instead, all blockchains expect interested users to prove their readiness to become validators by meeting certain requirements. For example, the Bitcoin blockchain expects users to invest in mining equipment and continuously perform hashing computations.","As for blockchains such as Cardano, Polkadot and Solana, users show their intent to become network validators by staking – or locking away – crypto assets.","The protocol governing this consensus mechanism then randomly picks a staker and grants that person the right to propose and add a new set of confirmed transactions to the blockchain. The protocol that governs the entirety of this process is called the PoS consensus mechanism.","By combining PoH and PoS consensus protocols, Solana has achieved unprecedented transaction speed without implementing layer 2 products such as side chains. This means the Solana ecosystem relies on just a single chain, unlike other blockchain ecosystems that opt for sharing transaction loads over multiple interoperable blockchains. This is known as “sharding,” and is a feature expected to roll out in Ethereum during its 2.0 upgrade. Polkadot and Zilliqa are other examples of dapp platforms that also leverage sharding to improve their transaction processing capabilities (also known as transaction throughput).","Solana’s single blockchains infrastructure boasts an incredibly fast block time, with a new block created every 400 milliseconds. In comparison, here is a list of block times for other leading decentralized application platforms:","The Tower BFT protocol reinforces the PoH consensus mechanism such that validators access a single global source of time. With this, the network can leverage a synchronized clock and efficiently eliminate the need to compute and store the timestamps of past transactions on the blockchain. In contrast, other blockchains allow validators to select unconfirmed transactions at random – regardless of the order in which they were executed – and load them sequentially on the blockchain.","Due to this approach, they have to compute the timestamps as part of the requirements for adding new transactions to the blockchain. For Solana, the availability of PoH and Tower consensus eliminates the need for validators to process timestamps, thereby creating more room to focus on other aspects of the transaction validation process.","Solana uses a system called Gulf Stream to eliminate the need for a mempool. Think of a mempool as a waiting area for unconfirmed transactions. This is where validators select transactions and subsequently add them to the blockchain. As for Solana, transactions are forwarded to validators even before the status of newly added blocks of transactions is finalized. With this, the Solana blockchain ensures that it does not have a waiting list of unconfirmed transactions.","Solana amplifies the computing capacity of its blockchain by allowing smart contracts to run in parallel. This technology, dubbed “Sealevel,” expands the scalability of Solana so that multiple smart contracts can run concurrently without adversely affecting the speed of the blockchain.","Solana’s wormhole feature introduces a trustless bridging channel between Solana, Ethereum, Binance Smart Chain and Terra’s blockchains. That allows users to seamlessly transfer tokens (fungible and non-fungible) created in these ecosystems between one another, as well as allow non-native dapps to share things like oracle data and liquidity.","Like Ethereum, Solana supports smart contracts – these are self-executing computer programs that perform certain functions when predefined conditions are met. Therefore, developers can launch and operate their blockchain applications on Solana.","And as we have witnessed in the Ethereum ecosystem, high-transaction throughput is always one of the core requirements, especially when blockchain applications are involved. This is why the Ethereum ecosystem is undergoing a major upgrade. As such, the Solana development team has always looked for ways to optimize its blockchain’s output.","Solana looks to host a thriving decentralized finance (DeFi) market and actively contribute to the booming NFT sector. One of the first large NFT collections to launch from Solana’s blockchain, called Degenerate Ape Academy, sold out in eight minutes with total trading volumes breaking $69 million.","As mentioned earlier, SOL is the native digital asset of the Solana blockchain and is currently ranked among the top 10 cryptocurrencies by market capitalization. At the time of writing, the crypto asset has a total supply of 503,273,124 SOL and a $42 billion market cap.","SOL works like a utility token for settling transaction fees, similar to Ethereum’s gas and is also the base currency for Solana’s staking economy. In essence, you would have to stake SOL to become a validator or earn staking rewards on Solana. However, note that SOL is not the only digital asset accessible in the Solana ecosystem. Like Ethereum, Solana is a multi-asset blockchain where individual blockchain applications operating on the network can independently issue tokens."],"entity":[{"type":"$0.00025","content":"MONEY"},{"type":"2017","content":"DATE"},{"type":"Yakovenko","content":"ORGANIZATION"},{"type":"Google","content":"ORGANIZATION"},{"type":"$42 billion","content":"MONEY"},{"type":"Intel","content":"ORGANIZATION"},{"type":"Zilliqa","content":"PERSON"},{"type":"Gulf Stream","content":"ORGANIZATION"},{"type":"$4.50","content":"MONEY"},{"type":"March 2020","content":"DATE"},{"type":"$69 million","content":"MONEY"},{"type":"three years later","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Cardano","content":"ORGANIZATION"},{"type":"Binance Smart Chain","content":"ORGANIZATION"},{"type":"Solana","content":"ORGANIZATION"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Degenerate Ape Academy","content":"ORGANIZATION"},{"type":"Anatoly Yakovenko","content":"PERSON"},{"type":"Solana","content":"PERSON"},{"type":"Solana","content":"LOCATION"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Cryptocurrency","Beginner"],"authors":["Andrey Sergeenkov"]}