{"summary":"Crypto derivatives show bullish positioning but are not over-extended by historical norms. That’s good news for the whole crypto market.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2023\/12\/13\/why-2023-is-like-2020-and-bitcoin-is-set-to-head-towards-50k\/","publishDate":"2023-12-13T17:34:24","id":15436,"type":null,"title":"Why 2023 Is Like 2020 and Bitcoin Is Set to Head Towards $50k","category":["Markets"],"content":["Bitcoin has recently achieved new highs in 2023, but there's a question lingering: Is the market over-extended, and have we reached the pinnacle of enthusiasm? We can gain insight into these inquiries by examining the positioning of the crypto options market.","The most apt comparison to Q4 2023 is the rally we saw in Q4 2020. In fact, by superimposing BTC returns for both years, we can discern a strikingly similar narrative unfolding.","(BTC spot performance 2020 [green] and 2023 [orange])","At present, the implied volatility of options (which represents an investor's bet on BTC's future realized volatility) is hovering near its 2023 peak, primarily driven by the buying of call options. This could indicate the market is already factoring in the explosive upside potential we're all hoping for.","Nevertheless, when we look back at the implied volatility of BTC over the past four years, it remains relatively subdued, implying that BTC hasn't yet demonstrated the explosive rally it is historically capable of. When BTC surged in Q4 2020, the accompanying option volatility peaked at around 150%, whereas today it stands at approximately 50%.","(BTC implied volatility for “at-the-money” options)","We can also draw a comparison between the historical futures basis today and that of January 1, 2020. Back then, the futures basis on Deribit was 20% annualized, equivalent to 17 times the 10-year risk-free rate. Today, the futures basis is around 10% or 2.4 times the equivalent risk-free rate. These substantial disparities between now and 2020 don't necessarily forecast higher spot prices, but they do suggest that potential buying power is still largely on the sidelines.","Finally, it's crucial to note that the implied volatility option traders are willing to pay is closely tied to the actual volatility that BTC is experiencing (realized volatility), which has hit new lows in 2023. This connection is often referred to as the Variance Risk Premium (VRP), and it has been widening since mid-October. Recently option traders have consistently been willing to pay a significant premium over realized volatility in BTC, anticipating the possibility of explosive movements.","(BTC “at-the-money” implied volatility Term Structure)","We’re currently witnessing an especially pronounced implied volatility “kink” higher for the January option expiration month. This reflects the anticipation that the Securities and Exchange Commission will approve\/deny spot Bitcoin ETFs, causing markets to move.","The forward volatility (the actual implied volatility differential priced between the Dec. 29 expiration and the January contract) currently resides around 57%, a 12-point premium of about 30-day realized volatility of 45%.","This situation either suggests that option buyers are making incorrect and overpriced bets, or that substantial volatility in BTC will not only continue, but grow larger.","Edited by Benjamin Schiller."],"entity":[{"type":"Q4 2020","content":"DATE"},{"type":"Benjamin Schiller","content":"PERSON"},{"type":"2023","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"10%","content":"PERCENT"},{"type":"January","content":"DATE"},{"type":"Dec. 29","content":"DATE"},{"type":"20%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"50%","content":"PERCENT"},{"type":"Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"mid-October","content":"DATE"},{"type":"150%","content":"PERCENT"},{"type":"January 1, 2020","content":"DATE"},{"type":"57%","content":"PERCENT"},{"type":"2020","content":"DATE"}],"hashtag":["Opinion","Crypto Long & Short","Bitcoin Price","Crypto Derivatives","Volatility","Options"],"authors":["Greg Magadini"]}