{"summary":"The Ethereum network has transitioned to proof-of-stake. Ethereum staking is a way ETH investors can earn a reward by locking up their coins.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/learn\/how-does-ethereum-staking-work\/","publishDate":"2022-09-22T15:08:02","id":15432,"type":null,"title":"How Does Ethereum Staking Work?","category":["Learn"],"content":["Put simply, Ethereum staking is the process of locking up an amount of ETH – the native cryptocurrency of the Ethereum blockchain – for a specified period of time in order to contribute to the security of the blockchain and earn network rewards.","People who do this are known as “validators” or “stakers,” and are tasked with processing transactions, storing information and adding blocks to the Ethereum blockchain. As a reward for their active involvement in the network, validators can receive rewards and interest on their staked coins, denominated in ether.","As part of plans to enable a faster and environmentally friendly transaction validation process, Ethereum protocol developers executed a switch from a consensus model known as proof-of-work (PoW) to proof-of-stake (PoS) broadly known as \"the Merge\".","Proof-of-stake is a consensus mechanism that requires users to stake an amount of cryptocurrency to become validators. Validators tie up some of their ether, giving them a personal stake in keeping the network running securely, to participate in the process. They receive rewards in ether when they attest to a new block, which means they agree it is accurate, or they \"win\" a block, meaning they are randomly selected to create the next block.","Oftentimes, a validator in a PoS system will increase the chances of earning rewards on the network by staking more coins. Depending on the PoS system, users may also be able to delegate their stake to another user who can perform the responsibilities of being a validator on their behalf.","One of the main reasons for the consensus switch is to dramatically reduce the energy requirements for validating transactions and issuing new ETH. According to Vitalik Buterin, the change lowered the world’s energy consumption by 0.2%, and reduced Ethereum’s energy use by 99.988%.","One reason for that is the minimum hardware requirements to run a PoS validator node are significantly cheaper and easier to access for the average user than the advanced computer hardware needed to be a crypto miner. Ethereum staking, unlike mining, can be done on everyday computers or laptops, and so it removes the need for electricity-guzzling mining equipment. Because it's more accessible, it also means there's a strong possibility the new system will attract more node operators. That, in turn, will help boost the new network's decentralization.","PoS on Ethereum is also intended to lay the groundwork for “sharding” – a partitioning technique that allows multiple parallel chains to share data and transaction load efficiently. These shard chains, when combined with a secondary scaling product known as \"rollups,\" could allow Ethereum to process upward of 100,000 transactions per second. That's a huge leap compared with the 10-15 transactions per second it processed under proof-of-work.","Rollups involve batching dozens of transactions together off the main chain, creating a cryptographic proof for them (evidence of their validity) and then submitting that to the main chain.","Read more: What Is Sharding?","Unlike the PoW-based blockchain, the PoS-powered blockchain bundles 32 blocks of transactions during each round of validation, lasting 6.4 minutes on average. These bundles of blocks are what’s known as “epochs.” An epoch is considered finalized – that is, the transactions contained are irreversible – when the blockchain adds two more epochs after it.","During the validating process (also known as the “attesting process\"), stakers are randomly grouped into “committees” of 128 and assigned to a particular shard block.","Each committee has a set time for proposing a new block and validating the transactions inside of it, called a “slot.” There are 32 slots in each epoch, meaning 32 sets of committees are required to complete the validation process in each epoch.","Once a committee is assigned to a block, one random member of the group is granted the exclusive right to propose a new block of transactions while the remaining 127 members vote on the proposal and attest to the transactions.","Once a majority of the committee has attested the new block, it’s added to the blockchain and a “cross-link” is created to confirm its insertion. Only then does the Ethereum staker who was chosen to propose the new block receive their reward.","Note that block proposers and attesters have varying reward models. The block proposer receives a fraction of the base reward, known as \"B,\" while the attester receives the remaining fraction of B, which is adjusted based on how long it takes for the block proposer to submit the attestation. The attester has to submit it as fast as possible to earn the entirety of the remaining B reward. For each slot that passes without the attester including the attestation to the block, the reward reduces.","A base reward is the fundamental primary determiner of the issuance rate of Ethereum post-merge. The more validators are connected to Ethereum, the lower the base reward per validator. That is because the base reward is inversely proportional to the square root of the total balance of all Ethereum validators.","Those interested in staking on the Ethereum network will need to have at least 32 ETH they are willing to lock up and will have to set up a staking node by running an Ethereum client. Ethereum clients are just software that enables nodes to interact with the Ethereum network.","Compatible software clients for staking nodes include:","As a minimum requirement, you’ll need to use a computer with enough memory space to download the Ethereum blockchain.","Validators are also expected to keep their nodes connected to the blockchain 24\/7. Therefore, a quality internet connection is a core criterion. After you install your validator software on your computer, the next step is to lock away a minimum of 32 ETH to the appropriate Ethereum staking contract address.","There's a lot of very specific requirements that you should review through this checklist before you begin. Check through the list and then visit the launchpad to get started.","\n","The reward distributed to stakers depends on the total number of ETH staked and the number of validators on the network. When the pool of staked ETH dips, the annual interest rate increases.","For example, when there were only around 500,000 ETH staked, the annual percentage rate of interest (APR) was a little over 20%. By August, 2021, there were more than 6,800,000 ETH locked on the blockchain, meaning the APR had dropped to about 6.0%.","As soon as the pool of stakers is large enough to promote a decentralized ecosystem, the interest rate drops.","Understanding that not all interested stakers can afford 32 ETH to participate in the network – which at present costs over $40,000 – some platforms have begun to provide staking products that allow investors to combine their financial resources to meet the minimum requirements for becoming a validator. That is also an ideal option for individuals who don’t want to undertake the technical requirements that come with staking. In essence, users need only to deposit and lock their capital on a third-party platform and start earning returns. It’s staking without the hassle.","\n","A comprehensive guide answering the most common questions about the Ethereum Merge.","Ethereum is the world’s second-largest crypto project by market capitalization and was the first to introduce smart contract functionality to the industry.","A gas fee is something all users must pay in order to perform any function on the Ethereum blockchain."],"entity":[{"type":"99.988%","content":"PERCENT"},{"type":"Ethereum","content":"ORGANIZATION"},{"type":"Ethereum Merge","content":"ORGANIZATION"},{"type":"APR","content":"ORGANIZATION"},{"type":"20%","content":"PERCENT"},{"type":"15","content":"DATE"},{"type":"6.0%","content":"PERCENT"},{"type":"Vitalik Buterin","content":"PERSON"},{"type":"0.2%","content":"PERCENT"},{"type":"August, 2021","content":"DATE"},{"type":"$40,000","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Intermediate","Ethereum","Learn"],"authors":["Andrey Sergeenkov","Toby Bochan"]}