{"summary":"The proceeds will be used to fulfill client balances across all accounts.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/06\/21\/blockfi-receives-250m-credit-facility-from-ftx\/","publishDate":"2022-06-21T12:26:47","id":15445,"type":null,"title":"BlockFi Receives $250M Credit Facility From FTX","category":["Finance"],"content":["Crypto lending platform BlockFi announced that it has secured a $250 million revolving credit facility from FTX, BlockFi CEO Zac Prince said in a tweet on Tuesday, and the company subsequently announced in a press release.","Prince said the move “bolsters our balance sheet and platform strength.” He added that \"the proceeds of the credit facility are intended to be contractually subordinate to all client balances across all account types (BIA, BPY & loan collateral) and will be used as needed.\"","This is not the first time FTX CEO Sam Bankman-Fried has stepped in to bail out a major crypto company impacted by the recent market downturn. Last week, crypto broker Voyager Digital (VOYG) secured a revolving line of credit with Bankman-Fried-founded quant trading shop Alameda Research.","Though it is now in the position of backstopping a broader market crash, FTX is reportedly one of the firms that liquidated Celsius – the troubled decentralized crypto lending platform that was forced to halt all user withdraws last week. Celsius, one of BlockFi’s competitors, reportedly ran out of funds to repay depositors due to a series of risky decentralized finance bets.","In the press release, BlockFi said the credit facility is contingent on the execution of \"definitive documents,\" which the two companies expect to be completed in \"the coming days.\"","The agreement comes during a downturn for crypto markets and the fall of stablecoin UST and the aforementioned Celsius.","Last week, Prince tweeted that BlockFi had also been forced to liquidate a large client that “failed to meet its obligations on an overcollateralized loan.” The statement – which didn’t name a specific client – came amid speculation surrounding the solvency of Three Arrows Capital, a major crypto investment firm. Just a few days earlier, BlockFi announced it was cutting about 20% of its workforce, or roughly 170 jobs.","Read more: BlockFi Valuation Sinks to $1B in Latest Funding Round: Report","UPDATE (June 21, 12:53 UTC): Added context and background throughout.","UPDATE (June 21, 13:05 UTC): Added information about BlockFi job cuts.","\n"],"entity":[{"type":"$250 million","content":"MONEY"},{"type":"20%","content":"PERCENT"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Zac Prince","content":"PERSON"},{"type":"FTX","content":"ORGANIZATION"},{"type":"BlockFi","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"$1B","content":"MONEY"},{"type":"Sam Bankman","content":"PERSON"},{"type":"Bankman","content":"PERSON"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"June 21","content":"DATE"},{"type":"BIA","content":"ORGANIZATION"}],"hashtag":["BlockFi","FTX","Credit"],"authors":["Parikshit Mishra","Sam Kessler"]}