{"summary":"Projects are running wild with false advertising, promoting black boxes in a world where transparency should be paramount. The issue isn't with rewarding users in itself, but how these \"loyalty programs\" obfuscate opportunity costs, Solend founder Rooter says.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/03\/26\/the-good-the-bad-and-the-ugly-of-airdrop-points\/","publishDate":"2024-03-26T21:42:42","id":15442,"type":null,"title":"The Good, the Bad and the Ugly of Airdrop 'Points'","category":["Consensus Magazine"],"content":["Who doesn't want free money?","Points, the quasi-loyalty programs meant to incentive use of blockchain applications by offering scrip that might in time be redeemed for something valuable, tap into something primal in our reptilian brains: our hardcoded desire for gambling.","0xRooter is the founder of Solend and Suilend protocols.","The dopaminergic system helped our ancestors take risks that brought us to today. Without high-risk-high-reward actions, we wouldn't be in this golden era of technology (which we use to flip meme coins at 1,000 TPS).","Stories of Regular Joes earning life-changing money prompt an internal monologue of \"what if?\" When \"everyone is getting hilariously rich and you're not,\" we FOMO.","Airdrops have been rewarding for many. But projects have caught onto the growth-hacking potential and recent trend of \"points,\" and the process is already being abused. Developers know what they're doing, we know what they're doing, they know we know what they're doing. Points today are predatory, lazy and are really just gambling.","See also: As Crypto 'Points' Farming Grows, So Does Risk of Vague Promises","To understand points, it's important to understand how they came to be.","Liquidity mining was pioneered by Compound, a move which kicked off the “DeFi Summer” of 2020. Lending and borrowing on Compound was incentivized via COMP tokens. Soon, a dozen projects offered similar incentives with their own twist. One of them, Sushiswap, incentivized liquidity provisioning (LP) positions with its own token, SUSHI, to “vampire attack” Uniswap, which hadn’t yet launched its own governance token. This pressured Uniswap to launch UNI, which it did with a retroactive airdrop for early users. (Some joked it was the \"stimulus for Ethereum\" since it was bigger than a COVID stimulus check.)","The widespread reach of the UNI airdrop was a huge catalyst for decentralized finance, attracting hordes of new users. This same process of airdropping tokens has been copied by numerous different protocols on numerous different chains since — with varying degrees of differentiation.","Then came Blur in 2022, the pioneer of points. Users could earn points by trading non-fungible tokens (NFTs) on its marketplace. By keeping earning criteria opaque, farming could be resisted in favor of real usage. With the incredible success of Blur, it wasn't long before every project had a points program.","A common misconception is that points in DeFi are an evolution of loyalty points that airlines, hotels and cafés offer. Just because DeFi projects and cafés both call them \"points\" doesn't mean they're the same thing. They have major differences in history and usage, making them separate taxonomies. One is a low-stakes loyalty program, the other intentionally preys on hype to pump metrics and farm fees.","The current points meta is predatory. There's no known reward, no timeframe and changes can be made arbitrarily. Rewards could be valueless or never be distributed (what some call “forever points” because they’re never redeemed for valuable tokens). Goalposts can continuously be moved back. All at the expense of users who pay real fees and opportunity cost.","Projects are running wild with false advertising, promoting black boxes in a world where transparency should be paramount. And they're pushing things beyond what the pioneers did. Blur launched their token within five months, but there are projects now that have been milking their users for over a year now.","The issue with points is not points themselves, but how they're being used to prey on users. However, it's possible to design a points program that is beneficial to both the project and users.","The main changes that need to be made are disclosing rewards upfront, communicating a timeframe and committing.","See also: Solana's Biggest DeFi Lender Almost Got Rekt","Solend, the project I founded, did this with \"Points Season 1,\" where a minimum rewards pool (which could only be increased) was disclosed and a timeframe was communicated. The rewards pool started with 100,000 SLND tokens and was later increased to include 100,000 PYTH (the governance token for Pyth Network) and 10 Tensorians (the NFT collection launched by Tensor, the leading NFT marketplace on Solana).","The path forward for points requires a commitment to transparency and fairness. By being upfront, projects can deliver the dream of transparent, decentralized finance rather than building the systems we took issue with in the first place. By prioritizing ethics, we can transform points from a speculative gamble into a useful tool for engagement, retention and rewards. As it should be.","Edited by Daniel Kuhn."],"entity":[{"type":"Compound","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Daniel Kuhn","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Pyth Network)","content":"ORGANIZATION"},{"type":"UNI","content":"ORGANIZATION"},{"type":"Crypto 'Points","content":"ORGANIZATION"},{"type":"Tensor","content":"ORGANIZATION"},{"type":"Sushiswap","content":"LOCATION"},{"type":"Summer” of 2020","content":"DATE"},{"type":"\"Points Season 1","content":"ORGANIZATION"},{"type":"Solana's Biggest DeFi Lender Almost Got Rekt","content":"ORGANIZATION"}],"hashtag":["Opinion","Solana","Rewards","Rewards Points","Airdrops"],"authors":["0x rooter"]}