{"summary":"The payments giant’s name change to Block caps off a transformational year.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2021\/12\/02\/jack-dorsey-takes-square-deep-down-the-bitcoin-rabbit-hole\/","publishDate":"2021-12-02T22:36:53","id":15440,"type":null,"title":"Jack Dorsey Takes Square Deep Down the Bitcoin Rabbit Hole","category":["Finance"],"content":["As we wrap up a year jam-packed with high-profile adoptions of crypto by big players, yesterday may have given us the concluding exclamation mark. Days after Jack Dorsey announced that he was stepping down as Twitter CEO, the other company Dorsey runs announced that it was changing its corporate name from “Square” to “Block.” For those who have been paying attention to Dorsey’s trajectory, the signal here could not be clearer.","This article, part of CoinDesk’s Future of Money Week, is excerpted from The Node newsletter, CoinDesk’s daily roundup of blockchain and crypto news. You can subscribe to get the full newsletter here.","Dorsey has spent the last five-odd years fascinated with cryptocurrency and blockchains, primarily Bitcoin. He has heavily promoted and supported the development of the Bitcoin Lightning Network, and supported Bitcoin developers directly through a unit called Square Crypto (which will now be renamed, rather awesomely, Spiral). He added Bitcoin functionality to Square’s Cash App. At Twitter, he recently rolled out Lightning-based tipping, and before stepping down promised NFT (non-fungible token) avatar integration.","Now he’s going to turn Square into an entire cryptocurrency and blockchain company. There’s little other serious way to evaluate the name change to “Block,” as in the transaction batches processed on blockchains. (Already taken: “The Block,” a cryptocurrency research and news outlet; Blockchain.com, a wallet and block explorer; Blockworks; BlockFi; Block.One. I could go on.)","The potential here is huge. Square has a huge user base, between its small business checkout systems and consumer app. Its revenue from those two businesses has grown massively in recent years (though that growth has slowed recently), providing a firm financial and customer foundation. Dorsey will be able to look for real opportunities to improve those existing customer experiences with crypto. And his demonstrated commitment to public, open-access blockchains means those integrations will likely lift the whole sector.","Strangely, though, Square\/Block seems to be downplaying the obvious “crypto” elements of the rebranding. The accompanying press release does list “blockchain” as a source of inspiration for the name, but includes it alongside pablum like “building blocks, neighborhood blocks and their local businesses, communities coming together at block parties full of music”","That’s a huge contrast to the other major name change of the past month, which saw Facebook becoming “Meta.” Facebook went full-court press on announcing that pivot, and it got a lot of press coverage.","The difference is that Facebook was at least in part trying to change the conversation away from the regulatory and legal problems that have been bedeviling it. Another factor is that, frankly, the pivot from social media advertising to a virtual reality “metaverse” makes no sense financially, so Zuckerberg and company knew they had to wow the credulous rubes in the mainstream press with barbecue sauce jokes.","Square, by contrast, is a successful company that does not regularly facilitate crimes against humanity. There’s no reason to think the name change is a PR play. In fact, Square’s hesitation to talk about the name change in terms of “crypto” makes it clear it sees risk in the opposite direction: Square investors at this point know that they’re holding a growth company with an established model and might very well get squirrely if it seemed like Dorsey was about to turn it into his personal blockchain playpen.","This morning’s market seems to reflect that ambivalence: As the new world gestates in the flesh of the old, Block is trading flat."],"entity":[{"type":"Spiral)","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Bitcoin Lightning Network","content":"ORGANIZATION"},{"type":"Zuckerberg","content":"PERSON"},{"type":"CoinDesk’s Future of Money Week","content":"ORGANIZATION"},{"type":"Dorsey","content":"PERSON"},{"type":"Square Crypto (","content":"ORGANIZATION"},{"type":"Lightning","content":"ORGANIZATION"},{"type":"Blockworks","content":"LOCATION"},{"type":"Square\/Block","content":"ORGANIZATION"},{"type":"Bitcoin functionality to Square’s Cash App","content":"ORGANIZATION"},{"type":"Jack Dorsey","content":"PERSON"}],"hashtag":["Jack Dorsey","Square","Square Crypto","Blockchain Adoption","Bitcoin","Lightning","Lightning Network","The Node"],"authors":["David Z. Morris"]}