{"summary":"The 2024 U.S. presidential candidate would fire most of the SEC, direct the government to back off crypto software developers and ease a path for digital assets as commodities.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/11\/16\/ramaswamy-shares-crypto-plan-making-him-the-only-gop-candidate-who-has-one\/","publishDate":"2023-11-16T14:00:00","id":15449,"type":null,"title":"Ramaswamy Shares Crypto Plan, Making Him the Only GOP Candidate Who Has One","category":["Policy"],"content":["Republican presidential candidate Vivek Ramaswamy has a message for most of the employees at the U.S. Securities and Exchange Commission (SEC) if he's elected to the White House: You're fired. And everybody still left at their desks would need to back off the crypto industry, according to the candidate's new policy strategy for U.S. digital assets.","Most cryptocurrencies are commodities that are none of the SEC's business, according to Ramaswamy's crypto plan shared with CoinDesk on Thursday and set for public release at the North American Blockchain Summit in Texas. The pharmaceutical entrepreneur remains among the top four GOP candidates, maintaining 5% support in a dwindling field dominated by former President Donald Trump, according to polling data.","One issue that separates him from other candidates is his enthusiastic support of crypto as a financial innovation. He argues that the sector needs to have several freedoms protected: the right to code as a First Amendment freedom that should shield software developers from criminal or enforcement vulnerability, the right to maintain self-hosted digital wallets outside the reach of regulators and the right to know how each new virtual asset will be treated by the government.","\"A big part of what we're missing today is clarity from our regulators,\" Ramaswamy said in an interview with CoinDesk TV. \"What we're going to have is rescinding any of those regulations that are allowing the regulatory state to go after perfectly legal behavior, but by claiming that somehow it shouldn't exist because they don't like it. All of that can end on my watch.\"","In his first day in office, he wants to fire 50% of the federal workforce, including the SEC, he said. That's more than a million workers, and he favors eventually cutting even deeper.","\"A big part of the problem is the proliferation of the size of that bureaucracy that I can shut down and rein in as the U.S. president, without having to run through Congress,\" he said.","Reducing the federal workforce has been a popular political aim that elected officials have historically found difficult to accomplish in practice, and the employment numbers have remained relatively flat, roughly the same now as they have been since the 1970s. Just on a technical level, Ramaswamy's idea would have to run a gauntlet of labor and government-employment laws and may not be entirely possible.","If he succeeds, his stripped-down regulators would be directed to enforce only crypto policies explicitly provided by Congress. And when they're evaluating whether certain assets should fall into the SEC's securities bucket or the jurisdiction of the U.S. Commodity Futures Trading Commission (CFTC) that oversees commodities trading, he favors a process in which new assets have an initial safe harbor before being \"programmatically classified into securities or commodities.\"","He tends to think most assets will fall \"on the side of commodities.\" He said the current approach from regulators is flawed, and criticized the unwillingness of SEC Chair Gary Gensler to say how he thinks ether (ETH) should be classified.","\"If the head of the SEC or the commissioners of the SEC cannot instantly answer whether or not some widely used cryptocurrency or coin counts as a security or a commodity, that means the rules that we have right now are a failure,\" he said.","To some degree, that question may soon be answered by the courts before the 2024 election. In the SEC's fights against such crypto companies as Ripple and Coinbase, federal judges are already beginning to assess whether the regulator has been right in how it decides – under the so-called Howey test – which tokens and products are securities.","A Ramaswamy administration wouldn't pursue software developers just for writing code, he said, citing the Tornado Cash case, and his White House would leave people's unhosted wallets alone, arguing they're vital tools of independence in the digital age.","He granted that he wouldn't be able to count on getting Congress to enact his agenda, so his plan focuses on what the executive branch can accomplish.","Presidential candidates routinely lean into rhetoric about their hypothetical first day in office, but major changes to regulatory agencies often depend on getting new leaders in. That's a political process – dependent on Senate confirmations – that has sometimes extended well into a president's first term in the White House. And even years later, some agencies – like the Biden administration's Office of the Comptroller of the Currency – may still be stuck with acting chiefs who haven't been stamped with Senate approval.","In one of Ramaswamy's policy positions, he said he'd \"order the Federal Reserve to grant stablecoin issuers the same access to Fed facilities that incumbent banks enjoy.\" Even if Ramaswamy were able to get a new chairman and other governors onto the Fed board in Washington, the central bank is an independent entity that historically hasn't looked kindly on presidential intervention. A president can't order the Fed to do anything, though the White House has other ways to apply pressure to the institution.","Whether Ramaswamy's goals are realistic or not, if he or another Republican is chosen to replace Biden next year, the next White House resident doesn't arrive until January of 2025.","Meanwhile, the SEC and the Internal Revenue Service have major digital assets rule proposals poised for adoption that will dramatically overhaul how the sector does business in the U.S., and the federal courts are on the verge of hugely consequential decisions. So the U.S. crypto industry of 2025 may look far different than it does at the end of 2023.","Read More: Vote if You Want, but Remember 'Cypherpunks Write Code'","Edited by Nikhilesh De."],"entity":[{"type":"Ramaswamy","content":"PERSON"},{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"January of 2025","content":"DATE"},{"type":"GOP","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"North American Blockchain Summit","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"CoinDesk TV","content":"ORGANIZATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"50%","content":"PERCENT"},{"type":"White House","content":"ORGANIZATION"},{"type":"Nikhilesh De","content":"ORGANIZATION"},{"type":"1970s","content":"DATE"},{"type":"Gary Gensler","content":"PERSON"},{"type":"2025","content":"DATE"},{"type":"Vivek Ramaswamy","content":"PERSON"},{"type":"Internal Revenue Service","content":"ORGANIZATION"},{"type":"Thursday","content":"DATE"},{"type":"5%","content":"PERCENT"},{"type":"Washington","content":"LOCATION"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"Congress","content":"ORGANIZATION"},{"type":"U.S. Commodity Futures Trading Commission (CFTC","content":"ORGANIZATION"},{"type":"Texas","content":"LOCATION"},{"type":"U.S. Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"Donald Trump","content":"PERSON"},{"type":"Howey","content":"PERSON"},{"type":"Ramaswamy","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"Senate","content":"ORGANIZATION"}],"hashtag":["Regulations","Politics","Presidential election","Vivek ramaswamy","Election 2024","top news","Exclusive"],"authors":["Jesse Hamilton"]}