{"summary":"In a live question session, Kris Marszalek said the company’s balance sheet is strong.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2022\/11\/14\/cryptocom-ceo-dismisses-speculation-of-financial-trouble-says-ftx-exposure-is-minimal\/","publishDate":"2022-11-14T09:06:42","id":15447,"type":null,"title":"Crypto.com CEO Dismisses Speculation of Financial Trouble, Says FTX Exposure Is Minimal","category":["Finance"],"content":["Expect a tough crypto winter, but Crypto.com isn’t going anywhere, CEO Kris Marszalek said during a live interview hosted on its YouTube channel.","Over the past week, Crypto.com’s CRO token has dropped almost 45% on concerns the Singapore-based exchange will be the next to face a liquidity crisis. The exchange’s daily volume has collapsed from last year's highs of around $4 billion to about $284 million this past October, according to data from Nomics, and withdrawals are on their way back up as users and investors remove their funds from the platform.","In the interview, Marszalek reiterated that the exchange has a strong balance sheet and said its exposure to FTX was limited to $10 million, down from a possible $1 billion in business the two exchanges had together earlier.","“We recovered $990 million from FTX,” Marszalek said, pointing out that fund flows between exchanges are a necessary part of the business.","He also said that 20% of Crypto.com's reserves are in Shibu Inu coin because that's what the customers trade, and everything in its reserves is backed 1-to-1 versus customer crypto deposits.","An audit of Crypto.com is underway, but it will take some time. Audit firms “don’t work at crypto speed,” he said, emphasizing that Crypto.com and the industry both need full transparency to move forward.","Withdrawals are working as expected, he reiterated. The only stoppage has been related to GALA, SRM, and Ray.","“SRM is closely tied to FTX,” he said.","Marszalek said that CRO, Crypto.com’s token, has never been used as loan collateral, unlike the relationship between FTX and Alameda and FTX's token, FTT.","“We’re never going to raise funds,” he added, stating that the business is cash flow positive.","One of Crypto.com’s more controversial moves has been stadium sponsorship, with eye-watering price tags. There are questions about how effective the whole thing is as a sales funnel. Marszalek says it is a worthwhile investment, reminding people that the contracts are paid yearly.","“We pay a small amount every year, which amounts to around 10% of our revenue. This is not crazy compared to other companies,” he said. “Growth to 70 million users is not possible without some investment into brand awareness.”","Part of the market’s mistrust of Crypto.com might stem from the exchange’s recent $400 million mishap, where it accidentally sent ether to an account at an exchange called Gate.io. That was the second time the company had mistakenly transferred an amount in the millions. In August, it was revealed the exchange had sent $10.5 million to a woman in Melbourne, and took seven months to notice.","Marszalek explained that all addresses for transfers of these scales are whitelisted and approved. The destination address was Crypto.com’s corporate account at Gate.io, and the funds were returned after Gate.io raised the corporate account’s daily transfer limit.","“The funds were at no risk of being lost,” Marszalek said. “The system would not allow us to send money somewhere it can’t be recovered.”","While some on crypto Twitter have speculated that this was part of a scheme to bolster Gate.io’s holdings before its proof of reserves were published, Marszalek said this was not the case.","As for Crypto.com’s critics Marszalek says he’s looking forward to proving them wrong with actions and words.","“Their allegations have no substance,” he said."],"entity":[{"type":"FTT","content":"ORGANIZATION"},{"type":"SRM","content":"ORGANIZATION"},{"type":"$4 billion","content":"MONEY"},{"type":"$1 billion","content":"MONEY"},{"type":"10%","content":"PERCENT"},{"type":"$284 million","content":"MONEY"},{"type":"Marszalek","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"45%","content":"PERCENT"},{"type":"Ray","content":"PERSON"},{"type":"$990 million","content":"MONEY"},{"type":"FTX","content":"ORGANIZATION"},{"type":"winter","content":"DATE"},{"type":"Singapore","content":"LOCATION"},{"type":"Shibu Inu","content":"LOCATION"},{"type":"Kris Marszalek","content":"PERSON"},{"type":"Melbourne","content":"LOCATION"},{"type":"$400 million","content":"MONEY"},{"type":"CRO","content":"ORGANIZATION"},{"type":"$10.5 million","content":"MONEY"},{"type":"October","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"August","content":"DATE"}],"hashtag":["Crypto.com","Kris Marszalek","FTX","Cronos"],"authors":["Sam Reynolds"]}