{"summary":"Eigenlayer has a 66% chance of sending users free tokens by June 30, the odds on Polymarket signal. Plus: Kalshi lands a big Wall Street account.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/04\/08\/which-crypto-projects-will-airdrop-next-prediction-markets-are-placing-bets\/","publishDate":"2024-04-08T13:32:42","id":15444,"type":null,"title":"Which Crypto Projects Will Airdrop Next? Prediction Markets Are Placing Bets","category":["Markets"],"content":["Crypto market participants are betting big money on which billion-dollar protocol will next give them token airdrops — a practice that often nets users thousands of dollars worth of new assets.","The “Airdrops by June 30?” market on Polymarket has garnered $400,000 worth of bets so far. While that might sound small, it's a substantial figure for the crypto prediction platform, excluding its U.S. presidential election market (which has attracted more than $105 million, dwarfing past records for the entire sector).","In the running are 23 different networks, platforms and layer 2s, each one active for at least two months with meaningful user activity.","Four of those – Solana NFT marketplace Tensor, real estate exchange platform Parcl, derivatives platform Drift, and restaking platform Swell – have already confirmed an airdrop, netting gains of as much as 80% to speculators who were laying bets since February.","Eyes are now on hyped platforms such as layer 2s Blast and Base, restaking tool Eigenlayer, multichain network LayerZero and social finance application Friend.Tech.","Nearly $100,000 has been bet on whether LayerZero will drop a token by the end of April. \"Yes\" shares are trading at two cents, meaning the market thinks there is only a 2% chance it will happen. Each share pays out $1 if the prediction turns out to be correct.","Read more; Crypto Speculators Betting on ‘No Airdrop’ for Arbitrum Lose 95%","LayerZero, which connects 50 blockchains using its network, has previously confirmed airdrop plans sometime in the first half of 2024, but there have been few details since.","Blast and Friend.Tech have amassed just over $30,000 in wagers–likely on expectations of their points programs, which reward an on-screen numerical value to users based on platform activity, with loose promises they'll eventually be rewarded with tokens.","Eigenlayer has captured the biggest mindshare, however. Over $56,000 is betting on whether the platform will release a token before June 30 on the general airdrop market, with a 66% probability. A separate market that ends on April 30 has attracted even more money—$63,000—but with just a 17% chance of an airdrop.","Don’t want to bet on when? Bet on how much: A significantly smaller market is betting on the expected valuation of Eigenlayer after its token is released, with scenarios ranging from no token launch to a $40 billion market cap.","Layer 2s are secondary networks or infrastructure built atop a main blockchain, such as Ethereum, to help with scalability and speed. Restaking is one of the hottest crypto sectors birthed in the bear market; it is essentially a way to put one’s ether holdings to work in various protocols in addition to the main Ethereum blockchains.","Value locked on platforms such as EigenLayer has grown to over $13 billion in just nine months, data shows, mainly buoyed by a slightly higher interest on deposits than conventional ETH staking (over 5%, compared to 3.3% on Lido) plus the allure of a future token drop.","Flashback to 2021: ‘Wen Token?’ Polymarket’s New Airdrop Futures Market Has Answers","It's easy to see why airdrops are a popular topic for prediction markets. They represent free money, after all. And if investors have an inkling of which protocols are likely to do airdrops for participants in a certain timeframe, and which ones aren't, it can inform their decisions about where to put money to work.","While the sun hasn’t managed to fry eggs on the sidewalks (yet), there’s a prediction market that’s betting on last month being the hottest March in recorded history.","A $212,000 bet will resolve on May 1 if the data for the Global Land-Ocean Temperature Index for March 2024 shows an increase of 1.37°C or greater when it is released. Speculators have placed odds of a 72% chance as of Monday, modeling data using land and sea surface areas.","Wall Street powerhouse Susquehanna International Group is launching a trading desk focused on \"events contracts,” hoping to attract Wall Street investors interested in betting on things other than traditional financial assets.","The firm will use the U.S.-regulated platform Kalshi to place and settle bets, as per Bloomberg. Most of the bets on Kalshi are aimed at retail traders and have limits of $25,000, but the firm recently got the green light to allow bigger investors to bet up to $7 million.","Kalshi is currently engaged in a legal battle with the Commodity Futures Trading Commission over whether to allow people to bet on U.S. elections.","Edited by Marc Hochstein."],"entity":[{"type":"Crypto Speculators Betting","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"80%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"$400,000","content":"MONEY"},{"type":"$63,000","content":"MONEY"},{"type":"66%","content":"PERCENT"},{"type":"$1","content":"MONEY"},{"type":"72%","content":"PERCENT"},{"type":"Marc Hochstein","content":"PERSON"},{"type":"17%","content":"PERCENT"},{"type":"Monday","content":"DATE"},{"type":"Tensor","content":"ORGANIZATION"},{"type":"Street powerhouse Susquehanna International Group","content":"ORGANIZATION"},{"type":"$25,000","content":"MONEY"},{"type":"April","content":"DATE"},{"type":"May 1","content":"DATE"},{"type":"June 30","content":"DATE"},{"type":"$212,000","content":"MONEY"},{"type":"$30,000","content":"MONEY"},{"type":"5%","content":"PERCENT"},{"type":"Solana NFT","content":"ORGANIZATION"},{"type":"$40 billion","content":"MONEY"},{"type":"EigenLayer","content":"ORGANIZATION"},{"type":"3.3%","content":"PERCENT"},{"type":"$7 million","content":"MONEY"},{"type":"February","content":"DATE"},{"type":"the first half of 2024","content":"DATE"},{"type":"$56,000","content":"MONEY"},{"type":"$105 million","content":"MONEY"},{"type":"95%","content":"PERCENT"},{"type":"April 30","content":"DATE"},{"type":"Bloomberg","content":"ORGANIZATION"},{"type":"March","content":"DATE"},{"type":"$100,000","content":"MONEY"},{"type":"March 2024","content":"DATE"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"two cents","content":"MONEY"},{"type":"$13 billion","content":"MONEY"},{"type":"Ethereum","content":"LOCATION"}],"hashtag":["Analysis","Prediction Markets","Airdrops","Polymarket"],"authors":["Shaurya Malwa"]}