{"summary":"One of the closely watched indicators of retail interest is booming.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/19\/google-searches-for-bitcoin-halving-get-higher-than-420\/","publishDate":"2024-04-19T17:13:15","id":15446,"type":null,"title":"Google Searches for 'Bitcoin Halving' Get Higher Than 4\/20","category":["Consensus Magazine"],"content":["Google searches for the term “Bitcoin halving” have hit an all-time high, surpassing the previous record set during the last halving in May 2020. According to Google Trends data, which uses a 100 point scale to determine the relative popularity of keyphrases, there is more interest than ever in the Bitcoin network halving.","This article is part of CoinDesk’s “Future of Bitcoin” package.","Interest in the term has steadily ramped up since the start of 2024, alongside search interest in the phrase “Bitcoin” (which is still below its 2017 peak in terms of search interest). The surge in interest this month is notable considering bitcoin’s (BTC) recent rally has stalled out, including turbulence this week, which saw it drop from a high around $70,000 last Friday to $63,000 today.","See also: This Bitcoin Halving Is Different. But Is It 'Priced In'?","Less than 60 blocks away, the fourth Bitcoin halving will see the number of bitcoin paid out as a block reward to miners cut in half from the current 6.25 BTC to 3.125 BTC. This particular halving is notable for a number of reasons, including the resurging interest in Bitcoin as a developer ecosystem, the onshoring of the U.S. mining industry following China’s ban and the relatively recent launch of spot bitcoin ETFs that helped ignite a (now ebbing) market rally.","“This is the first halving in which major U.S. asset managers are educating on Bitcoin, and there’s no better Bitcoin education than learning about the halving. It’s a narrative event first – a quadrennial market moment – and a supply event second, though I think both aspects will be impactful,” Galaxy Digital head of research Alex Thorn told CoinDesk via email.","Though it's not just fund managers having fun. As Decrypt initially reported, search frequency for “Bitcoin halving” surpassed the cannabis culture meme number “420” for the first time in its history. This is especially notable because the halving was initially scheduled to coincide with the April 20 holiday known for its cannabis-oriented celebrations, though is now likely to occur Friday evening.","See also: What Bitcoiners Are Saying About the Upcoming Bitcoin Halving","Edited by Bradley Keoun."],"entity":[{"type":"May 2020","content":"DATE"},{"type":"2017","content":"DATE"},{"type":"U.S.","content":"LOCATION"},{"type":"2024","content":"DATE"},{"type":"BTC","content":"ORGANIZATION"},{"type":"$63,000","content":"MONEY"},{"type":"evening","content":"TIME"},{"type":"April 20","content":"DATE"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Alex Thorn","content":"PERSON"},{"type":"$70,000","content":"MONEY"},{"type":"Friday","content":"DATE"},{"type":"” Galaxy Digital","content":"ORGANIZATION"},{"type":"China","content":"LOCATION"},{"type":"Google Trends","content":"ORGANIZATION"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Opinion","The Node","Newsletters","Bitcoin","Halvings","Google Trends"],"authors":["Daniel Kuhn"]}