{"summary":"Coinbase, Gemini and other crypto exchanges are laying off employees. Things could get worse from here – but there’s reason to hope for a soft landing.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/03\/are-exchange-layoffs-the-first-sign-of-crypto-winter-or-is-it-already-over\/","publishDate":"2022-06-03T17:43:08","id":15441,"type":null,"title":"Are Exchange Layoffs the First Sign of Crypto Winter, or Is It Already Over?","category":["Consensus Magazine"],"content":["On Thursday, June 2, came a truly shocking announcement from Coinbase (COIN). Not only would the publicly traded crypto exchange extend a hiring freeze first implemented two weeks ago, it will also rescind existing offers to new hires, according to a statement.","This is perhaps the most dramatic in a series of layoff decisions by crypto exchanges, which come as both equity and token markets continue to deflate amid the U.S. Federal Reserve’s attempts to fight inflation by hiking interest rates.","This article is excerpted from The Node, CoinDesk's daily roundup of the most pivotal stories in blockchain and crypto news. You can subscribe to get the full newsletter here.","But are these cuts just part of a broader cyclical downturn that’s also hitting other speculative “growth” companies, like Tesla (TSLA)? Or is it something narrower and crypto specific?","In short, are these layoffs just the start of something much more dire? Are we on the brink of another crypto winter?","Coinbase’s decision to pull existing job offers is straightforwardly heinous. Imagine Coinbase offered you a job a week ago. You immediately put in your two weeks’ notice at the box factory where you’ve been grinding to feed your family while spending nights and weekends immersed in crypto. On Thursday you woke up excited to start a new gig in the exciting world of digital assets.","Then you got a god-damned form email titled “Update to your Coinbase offer” and the update was “whoops, nevermind.” Seriously, Coinbase, get your act together. This is shameful behavior.","Public reaction has been predictable scorn. Above all, this is yet another index of Coinbase’s general incompetence when it comes to handling its employees. This is the same company, remember, that accidentally acqui-hired a bunch of murderous fascist spies and triggered a wave of resignations by issuing a hamfisted workplace gag order (the exchange did offer separation packages to employees who left).","See also: Lex Sokolin: How Coinbase Is Worth $100B | Opinion","But these latest un-hirings (?) don’t just affirm what seems to be Coinbase’s longstanding disregard for its workers. They reveal a dramatic tactical fumble: Throwing the emergency brake on spending this hard suggests nobody at Coinbase saw problems on the horizon even as the crypto market steadily cooled for more than six months. Did nobody grasp the significance of the Fed rate-hike cycle? Rescinding job offers is a flop-sweat panic move born of a failure to plan for clear changes in market conditions. The Fed literally announces forward guidance ahead of time!","Yet, while Coinbase once again manages to excel in its public bumbling, it is not alone in facing headwinds. As the crypto economy slows, exchanges have been among the first to reveal cutbacks, in part because more of them are public or regulated firms. Robinhood (HOOD), which offers equity and crypto trading and saw hypergrowth during the coronavirus pandemic, has reversed course to cut 9% of staff. Mexican exchange Bitso and Middle Eastern exchange Rain Financial have also made cuts.","The layoff announcement from the Winklevoss twins’ Gemini exchange may be the most provocatively framed. In announcing it is cutting 10% of staff, Gemini predicted the entire industry was “entering a period of stasis,” and explicitly warned of a coming “crypto winter.”","But if crypto winter is coming, we haven’t seen it yet. These exchange layoffs are kid’s stuff – rookie numbers. The term “crypto winter” was popularized during the 2019 market collapse and industry retraction, when total crypto market cap collapsed to $100 billion in December 2018 from nearly $830 billion at the start of the year. The resulting layoffs were many times worse in percentage terms than the current round, so far. And I know firsthand, because I lost my crypto job then along with darn near everyone else.","We’re dealing with anecdotal numbers, but the differences are striking. In 2019, the token swap service ShapeShift laid off 30% of its workers in one swoop. Also in early 2019, many crypto over the counter (OTC) desks – which are less exposed to market swings than retail-focused exchanges – shed staff or shut down. Ethereum incubator Consensys’s downsizing was particularly emblematic: It cut 13% of staff in December 2018, then spun out several incubated “spokes” in what amounted to even broader cuts. It fired another 14% of its remaining employees in February of 2020.","Note the timeline here: These layoffs across the industry largely came a full year after token markets started slumping. It’s been about eight months since bitcoin (BTC) hit its all-time high in November 2021 and the start of the current market retrace. Certainly we haven’t entered a crypto winter in earnest. It may still be waiting in the wings.","So if it can get that much worse, will it?","First, to briefly describe what triggers a “crypto winter”: the combined decline of new customer revenue from outside the industry, the decline of venture capital (VC) investments and the decline of retail speculation.","As in previous cycles, the “retail speculation” part of the equation was the first to go, in no small part thanks to the catastrophic unwinding of the Terra network. (It should be noted that Coinbase Ventures helped back Terraform Labs, so to a measurable extent Coinbase’s current panicky firings are fallout from its own decision to shephard obvious bad actors into the industry.)","The macroeconomic environment is also obviously key to retail behavior. There is definite good news here, with new jobs data showing unemployment in the U.S., the most important retail crypto market, remains at a very low (though nominal) 3.6%.","A bigger headwind is interest rates, which will draw money away from speculative investments as they rise, which the Fed has said will continue. But in a must-read post published June 1, BitMEX founder Arthur Hayes made a compelling argument that the Fed could halt its rate-hike campaign early if pain in asset markets gets too great. That’s quite bad as macro policy, of course, but it’s the reality we live in.","Hayes also argued, based on historical trends, that bitcoin dropping briefly below $26,000 may have been the market bottom. That optimistic take on price levels is by no means the consensus, though, and depends on the Fed changing course on interest rates.","Other analysts point to different areas of bitcoin’s price cycle for their predictions. If the previous BTC top is a bottom for the next cycle, then BTC would bottom out at about $20,000, or another 30% drawdown from current levels. More pessimistically, markets could follow 2018’s 85% drawdown from highs, which would leave BTC below $12,000 per token.","See also: Bitcoin Is Down, but You Don't Have to Be | Opinion","On the other hand, there are factors in play that weren’t in 2018. Most importantly, there is a lot of venture capital money ready to support viable ideas. Andreessen Horowitz’s new $4.5 billion venture fund alone is going to keep a lot of devs employed. There are also now large segments of the crypto economy that generate real revenue from outside the industry, from mass-market NFT (non-fungible token) brands like NBA Top Shot to the law-enforcement analytics provided by firms like Chainalysis.","Though painful for some, crypto winters are often necessary and ultimately good. A tougher environment leads to more scrutiny by regulators and industry participants alike and, I hope, helps concentrate capital in more immediately viable and revenue-generating projects. This also leads to major reshuffling of talent from less-viable to more-viable projects. For instance, we’re seeing developers formerly working on Terra being courted by other projects, which amounts to a transfer of labor value from a worse-than-useless dead end to things that might not be. This dynamic also encompasses exchanges like Coinbase, which critics claim lacks a long-term viable business model given its over-reliance on inflated fees.","See also: How Crypto Payments Shift Revenue to Creators, Not Platforms | Opinion","Nobody has a crystal ball. But taken as a whole the situation looks bad but not bleak, and nothing like a 2018 repeat. Crypto isn’t disappearing or “over,” and a little brushfire to clear out dimwits and operators like Do Kwon is a net positive. Most likely, crypto is going to track the broader economy, with a quiet year or two followed by a resumption of growth and adoption.","That said, it’s a good time to be extremely cautious. Hold on to cash, plan ahead – and feel free to remind me of this prediction when we’re all working at McDonald’s in nine months."],"entity":[{"type":"June 2","content":"DATE"},{"type":"June 1","content":"DATE"},{"type":"Middle Eastern exchange Rain Financial","content":"ORGANIZATION"},{"type":"$100B","content":"MONEY"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"Hayes","content":"PERSON"},{"type":"Lex Sokolin","content":"PERSON"},{"type":"3.6%","content":"PERCENT"},{"type":"Coinbase","content":"PERSON"},{"type":"10%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"December 2018","content":"DATE"},{"type":"$20,000","content":"MONEY"},{"type":"earnest","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"February of 2020","content":"DATE"},{"type":"30%","content":"PERCENT"},{"type":"NFT","content":"ORGANIZATION"},{"type":"13%","content":"PERCENT"},{"type":"early 2019","content":"DATE"},{"type":"Andreessen Horowitz","content":"PERSON"},{"type":"November 2021","content":"DATE"},{"type":"$12,000","content":"MONEY"},{"type":"9%","content":"PERCENT"},{"type":"NBA","content":"ORGANIZATION"},{"type":"Gemini","content":"PERSON"},{"type":"Thursday","content":"DATE"},{"type":"$830 billion","content":"MONEY"},{"type":"Arthur Hayes","content":"PERSON"},{"type":"$26,000","content":"MONEY"},{"type":"85%","content":"PERCENT"},{"type":"$4.5 billion","content":"MONEY"},{"type":"U.S. Federal Reserve","content":"ORGANIZATION"},{"type":"14%","content":"PERCENT"},{"type":"How Crypto Payments Shift Revenue","content":"ORGANIZATION"},{"type":"$100 billion","content":"MONEY"},{"type":"Coinbase Ventures","content":"ORGANIZATION"},{"type":"Winklevoss","content":"LOCATION"},{"type":"McDonald’s","content":"ORGANIZATION"}],"hashtag":["Coinbase","Opinion","The Node","Newsletters","Prices","Crypto Winter","Federal Reserve","Layoffs"],"authors":["David Z. Morris"]}