{"summary":"The California Democrat wants to know what the Silicon Valley tech giant has planned for digital assets, raising the question whether the battered firm is taking another look at blockchain.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/01\/23\/why-does-maxine-waters-care-about-metas-crypto-patents\/","publishDate":"2024-01-23T20:44:57","id":15459,"type":null,"title":"Why Does Maxine Waters Care About Meta’s Crypto Trademarks?","category":["Consensus Magazine"],"content":["In early 2022, Arun Sundararajan wrote a Harvard Business Review case study about how established brands could utilize non-fungible tokens, aka NFTs, right before the crypto market tanked. In the piece, the Harold Price Professor of Entrepreneurship at New York University’s Stern School of Business tried to make sense of the then-crypto craze, mentioning that tech firms like Twitter and Facebook (now X and Meta, respectively) were allowing more user customization through NFT avatars.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","“Designed right, NFTs could build on the expansion of conspicuous consumption seeded by social media, allowing us to showcase our non-digital lives in our digital spaces more expansively and more authentically,” Sundararajan wrote, arguing that NFTs were “going mainstream in 2022.”","Little did Sundararajan know that in just a few short weeks, the bottom would fall out under the entire crypto market, and NFTs would plummet. Meta would soon discontinue NFT functionality on its Instagram and Facebook apps, to refocus on “areas where we can make impact at scale” during its “year of efficiency,” after the company's pivot towards the metaverse hit a wall.","This was not the first time Facebook’s crypto plans were foiled. In fact, there could be a whole HBR edition about the pitfalls of established corporations experimenting with crypto based on Facebook’s failed blockchain efforts. Its Libra stablecoin plan, hatched in 2019, envisioned a radical alternative global currency before it was ravished by regulators. Then the company pulled the plug on Diem, a significantly scaled-down stablecoin effort, after putting a significant amount of resources into developing a new blockchain, wallet and programming language.","If there is any company likely to remain arms length from blockchain, even as the market appears to rebound, it’s probably Meta. This isn’t to say Meta, which is as opportunistic as any corporation, will always steer clear. But it’s hard to imagine it advancing crypto adoption much these days. Especially considering Mark Zuckerberg recently announced he’s directing the largest social media’s vast resources towards the development of artificial general intelligence (AGI).","See also: Diem: A Dream Deferred? | Opinion","All of this is why it’s odd to hear that Meta is being questioned by Congress about its crypto activities. In a letter to Meta CEO Mark Zuckerberg and COO Javier Olivan, Rep. Maxine Waters (D-Calif.) expressed concerns over a couple of blockchain-related trademarks the company filed. Stranger still, the trademark applications are from 2022. So why did Waters, who led resistance to Libra\/Diem in 2019, send the letter now?","Waters, a ranking member of the powerful Democratic House Financial Services Committee, believes the live trademarks represent Meta’s “continued intention” of expanding its role in the digital assets market. This would belie statements Meta representatives made during a committee meeting last October, that “there is no ongoing digital assets work” at the company.","According to Waters, Meta will soon have to respond to the U.S. Patents and Trademark Office — which sent the company five Notice of Allowance (NOA) documents indicating Meta’s five blockchain trademarks meet registration requirements — answering whether it intends to use the trademarks. The company has until Feb. 15 to respond to the first of five NOAs it received, and so the timing of Water’s questions seem fair. She essentially wants to know in advance how Meta will answer.","And yet, the letter also has a broader scope — asking if Meta has any designs on crypto at all. Waters asked specifically about whether Meta has future stablecoin plans or partnerships, is “planning to launch a payments platform” and whether “Meta’s technology is enabling cryptocurrency creation, mining, storage, transmission or settlement.” It’s as if any amount of crypto-related R&D at Meta is a matter of national interest.","The broad inquiry might be justified given the broad nature of Meta’s applications, which include ideas for digital asset wallets and hardware, chain validation tech, “blockchain as a service” advertising and even seemingly a dating app with “a specific branch tailored for investors.”","See also: Reflecting on Facebook's Hilarious, Well-Deserved Crypto Failure | Opinion","But having a trademark or patent approved doesn’t mean a company will actually put it to work. There are plenty of applications that are filed as a defensive maneuver or even just to create the illusion of progress. In an industry like crypto, which was born out of the larger open-source community, the projects that put an emphasis on intellectual property are often the least exciting.","Waters, being one of the first legislators to speak out against Libra, and knowing the power regulators can wield, must recognize that these trademarks aren’t really an indication of activity. If she was concerned about Meta getting involved in crypto again, it would be far more telling if the company had filed any applications after 2022. But a cursory glance shows it hasn’t.","There is a Straussian reading of Waters’ letter that isn’t asking questions of Meta’s crypto activity, but making a statement to Meta and beyond. Big tech may not be fully on board with crypto again, amid a rising market cycle. But even if it were, it’s being watched.","CORRECTION (JAN. 23, 2024): Clarifies that Meta must respond regarding trademark applications, not patents. Also corrects name of Democratic House Financial Services Committee."],"entity":[{"type":"Democratic House Financial Services Committee","content":"ORGANIZATION"},{"type":"2022","content":"DATE"},{"type":"Maxine","content":"PERSON"},{"type":"Meta","content":"ORGANIZATION"},{"type":"Congress","content":"ORGANIZATION"},{"type":"Feb. 15","content":"DATE"},{"type":"2019","content":"DATE"},{"type":"Notice of Allowance (NOA","content":"ORGANIZATION"},{"type":"Mark Zuckerberg","content":"PERSON"},{"type":"Harvard Business Review","content":"ORGANIZATION"},{"type":"NFT","content":"ORGANIZATION"},{"type":"Arun Sundararajan","content":"PERSON"},{"type":"New York University’s Stern School of Business","content":"ORGANIZATION"},{"type":"U.S. Patents and Trademark Office","content":"ORGANIZATION"},{"type":"Harold Price Professor of Entrepreneurship","content":"ORGANIZATION"},{"type":"Calif.","content":"LOCATION"},{"type":"Javier Olivan","content":"PERSON"},{"type":"Libra\/Diem","content":"ORGANIZATION"},{"type":"October","content":"DATE"},{"type":"JAN. 23, 2024","content":"DATE"}],"hashtag":["Opinion","The Node","Newsletters","Facebook","Meta","Maxine Waters","Patents"],"authors":["Daniel Kuhn"]}