{"summary":"The figure is nearly 40% less than that of 2022, however it is only provisional, Chainalysis stressed.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2024\/01\/18\/crypto-crime-amounted-to-over-24b-in-2023-chainalysis\/","publishDate":"2024-01-18T14:00:00","id":15453,"type":null,"title":"Crypto Crime Amounted to Over $24B in 2023: Chainalysis","category":["Policy"],"content":["Over $24 billion worth of cryptocurrency was received by illicit addresses in 2023 accounting for 0.34% of all transaction volume, blockchain intelligence firm Chainalysis has estimated in its annual crypto crime trends report.","The figure is nearly 40% less than that of 2022, however it is only provisional. The $24.2 billion total is likely to increase as more addresses are identified as illicit over time. The total for 2022 now stands at $39.6 billion, however only $20.6 billion worth had been identified at the time of Chainalysis' report last year.","Another caveat to the research is the prevalence of transactions with sanctioned entities, which accounted for a combined $14.9 billion (61.5%) of volume in 2023. Some of this $14.9 billion includes transactions from normal crypto users who happen to live in sanctioned jurisdictions. After all, not all of the Russia-based crypto exchange Garantex, which was sanctioned by the relevant bodies in both the U.S. and U.K. are using crypto for money laundering and ransomware.","Chainalysis' report, therefore, points toward a nuanced and evolving landscape of crypto being used as a medium for illicit activity, highlighting the moving target with which regulatory and law enforcement bodies are dealing.","Stablecoins accounted for the majority of illicit transaction volume in 2023 as they did the year before. Prior to 2022, bitcoin was the preferred crypto among criminals, accounting for a majority of transaction volume every year from 2018-2021. This however shifted to stablecoins in 2022, accounting for around two thirds of volume. This was then repeated in 2023.","Crypto scams and hacks both saw significant decreases last year, down 29.2% and 54.3% respectively, according to Chainalysis' research. On the other hand, ransomware and dark net activity increased.","Read More: KPMG Canada Teams Up With Chainalysis to Fight Crypto Frauds and Exploits","Edited by Stephen Alpher.","\n","\n"],"entity":[{"type":"Stephen Alpher","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"61.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"0.34%","content":"PERCENT"},{"type":"U.K.","content":"LOCATION"},{"type":"$24 billion","content":"MONEY"},{"type":"$24.2 billion","content":"MONEY"},{"type":"2018","content":"DATE"},{"type":"40%","content":"PERCENT"},{"type":"$39.6 billion","content":"MONEY"},{"type":"54.3%","content":"PERCENT"},{"type":"KPMG Canada Teams Up With Chainalysis to Fight Crypto Frauds","content":"ORGANIZATION"},{"type":"$20.6 billion","content":"MONEY"},{"type":"29.2%","content":"PERCENT"},{"type":"Russia","content":"LOCATION"},{"type":"$14.9 billion","content":"MONEY"}],"hashtag":["Chainalysis","crypto crime","Crime"],"authors":["Jamie Crawley"]}