{"summary":"After Circle’s SEC filing marking the first step towards a public listing, CoinDesk examined the other firms that might try to go public amid a rebound in crypto markets. High on the list of possibles: Kraken and Ripple.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/01\/12\/what-other-crypto-firms-could-go-public-this-year\/","publishDate":"2024-01-12T20:30:26","id":15454,"type":null,"title":"What Other Crypto Firms Could Go Public This Year","category":["Consensus Magazine"],"content":["Circle, the U.S.-based stablecoin issuer, is taking another swing at going public, according to a confidential document filed with the Securities and Exchange Commission (SEC). This will be the major crypto firm’s second attempt at a public listing, after its initial plan to merge with a special purpose acquisition company, or SPAC, fell through in 2021.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","With cryptocurrencies rebounding amid a strengthening economy, this year looks set for a potential rebound in investment funding and potential initial public offerings in the blockchain sector. Despite existing for 15 years, there are remarkably few publicly-traded companies in the crypto sector.","In December, Goldman Sachs predicted stronger IPO activity in the back half of 2024, particularly if the Federal Reserve cuts interest rates, which would lower the cost of deal-making and stimulate the economy.","There are many potential obstacles here, including the U.S. presidential election, Congressional infighting, war and inflation, but “when financial markets are strong, public offerings tend to be robust,” as Goldman says, and it’s becoming increasingly clear that crypto markets are strengthening.","Moreover, with the launch of a spot bitcoin exchange-traded fund (ETF) yesterday, crypto is moving into a more mature phase. Many companies have raised a significant amount of capital, and the oldest firm’s venture capital backers — who typically work on 10-year time horizons — are likely looking for a return.","See also: European Crypto Startups Raised Record $5.7B in VC Funding in 2022","Further, due to lingering economic uncertainty, if crypto markets stay elevated in the short term, it may represent a window of opportunity to go public before a downturn. Coinbase, which had a direct listing in early 2021, may be representative here, as one of the few firms to go public during the previous bull market.","There are over a dozen “unicorns,” or private companies with valuations above $1 billion, in crypto, which are the most likely candidates to IPO. Some may prefer to remain private, which affords a greater level of corporate control and invites less scrutiny. But in general, if a firm raises outside capital, the two most likely “exits” for investors are either a public listing or bankruptcy.","CoinDesk analyzed many of these companies to determine which could announce plans to go public this year. This is a representational, rather than complete, list intended to give a sense of the factors at play. These deals will likely be concentrated in the exchange, custody and stablecoin sectors, all of which have vast potential for growth amid a crypto rebound.","In November, Kraken CEO Dave Ripley said the firm was strongly considering going public. It previously took initial steps by initiating a review by the SEC, which after a year didn’t declare Kraken an “effective” candidate. Since then, however, The Block reported Kraken has filled its C-suite with seasoned executives experienced in public offerings, including Chief Compliance Officer C.J. Rinaldi and Chief Financial Officer Carrie Dolan.","Kraken was last valued at just under $11 billion, and also boasts one of the strongest legal\/compliance units in the industry, headed up by lawyer Marco Santori.","Working against Kraken is a lawsuit brought last year by the SEC, the agency that will have to approve its public listing. It’s worth noting several other exchanges and brokerages, including Israel-based eToro and CoinDesk’s parent company Bullish, explored going public but were blocked by the SEC. Bitpanda, in the E.U., and Bitso, in Mexico, should also be watched, if expanding the conversation beyond U.S. markets.","In the crypto custody sector, competitors Anchorage and BitGo are also likely exploring public listings. Both firms, considered leaders in the field, have expanded out beyond their core crypto custody businesses, including other security services as well as the buzzy-area of tokenization.","“Anchorage Digital serves a global roster of institutions with safe and secure digital asset infrastructure. Our client base includes asset managers, registered investment advisors, crypto protocols, venture capital firms, and more,” a spokesperson told CoinDesk in an email, sidestepping the question about going public.","BitGo was founded in 2013, and was valued at $1.75 billion during a 2023 Series C raise – a low enough valuation where a SPAC merger might be possible. Meanwhile, Anchorage, which is also a federally-chartered bank, was last valued at $3 billion.","See also: BitGo Buys Crypto Wealth Management Platform HeightZero","The third-largest stablecoin issuer, Paxos, may also be a contender to go public. Paxos is the go-to issuer for third parties looking to create branded stablecoins. For instance, it is the issuer of PayPal’s recently launched PYUSD token and the since discontinued BUSD coin for Binance. Stablecoins have emerged as one of the clearest uses for blockchain.","There are plenty of other companies to name and emerging sectors in the space. There are several large and long-established blockchain hardware firms, including Ledger and Trezor, payments technology firms like Ripple and BitPay, as well as financial service providers like Bitwise that could be considering a public stock offering.","The key things to look for, beyond strong corporate governance, is market-fit and the potential for growth. Chainalysis, with its host of government contracts, may also be in a strong position to go public this year. It’s worth noting that of the existing publicly traded companies in crypto, the majority are involved in crypto mining, in part because this is an industry where cash flows are most easy to predict, despite the volatility of bitcoin’s price.","As a final thought, I think it’s possible if resurrected FTX will try to go public — if only because who else would fund it?","“All depends on how Circle's IPO goes to be honest. If it goes well, there are a lot of other companies that would probably explore it,” Delphi Digital CEO Anil Lulla said."],"entity":[{"type":"Anchorage Digital","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"$3 billion","content":"MONEY"},{"type":"European Crypto Startups Raised Record","content":"ORGANIZATION"},{"type":"$1 billion","content":"MONEY"},{"type":"The Block","content":"ORGANIZATION"},{"type":"E.U.","content":"ORGANIZATION"},{"type":"Anchorage","content":"LOCATION"},{"type":"SEC","content":"ORGANIZATION"},{"type":"C.J. Rinaldi","content":"PERSON"},{"type":"2013","content":"DATE"},{"type":"PayPal","content":"ORGANIZATION"},{"type":"Kraken","content":"ORGANIZATION"},{"type":"$5.7","content":"MONEY"},{"type":"November","content":"DATE"},{"type":"SPAC","content":"ORGANIZATION"},{"type":"Anil Lulla","content":"PERSON"},{"type":"Israel","content":"LOCATION"},{"type":"the Federal Reserve","content":"ORGANIZATION"},{"type":"Marco Santori","content":"PERSON"},{"type":"Delphi Digital","content":"ORGANIZATION"},{"type":"Securities and Exchange Commission (SEC","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"Dave Ripley","content":"PERSON"},{"type":"2024","content":"DATE"},{"type":"Mexico","content":"LOCATION"},{"type":"$11 billion","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"FTX","content":"ORGANIZATION"},{"type":"Crypto Wealth Management Platform HeightZero","content":"ORGANIZATION"},{"type":"Goldman Sachs","content":"ORGANIZATION"},{"type":"Goldman","content":"ORGANIZATION"},{"type":"$1.75 billion","content":"MONEY"},{"type":"Carrie Dolan","content":"PERSON"},{"type":"Binance","content":"ORGANIZATION"}],"hashtag":["Opinion","The Node","Newsletters","IPOs","Direct Listing","SPAC","SEC"],"authors":["Daniel Kuhn"]}