{"summary":"An interest rate cut isn't likely on the table, but risk assets are doing just fine","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/02\/14\/risk-assets-like-bitcoin-are-defying-low-fed-rate-cut-expectations-analyst\/","publishDate":"2024-02-14T04:25:56","id":15460,"type":null,"title":"Risk Assets Like Bitcoin Are Defying Low Fed Rate Cut Expectations: Analyst","category":["Markets"],"content":["Risk assets like bitcoin (BTC) are doing just fine, an analyst with Truflation said after the cryptocurrency suffered moderate losses Tuesday following the hotter-than-expected U.S. inflation report, which dented hopes for a Fed rate cut.","The U.S. consumer price index report for January showed prices went up for health and utilities, driven by the tight labor market, while food, alcoholic beverages, apparel, and household durables became cheaper due to consumers returning to normal purchasing behaviors after the holidays, Truflation wrote in a recent report.","Bitcoin fell from $50,000 to around $48,800 after the U.S. consumer price index figure saw traders push out the timing of the first rate cut to July. The dip, however, was shortlived, with prices leveling off at around $49,500 as the Asian business day began, according to CoinDesk Indicies data. The CoinDesk 20 Index, which gauges the performance of top digital assets, has declined 0.73% in the past 24 hours.","\"While we saw a small pullback in bitcoin on the back of the news, in general, risk assets seem to be acting as if a March rate cut was still on the table, even though the vast majority of market participants don’t expect this,\" Oliver Rust, head of product at independent economic data provider Truflation said in an email interview.","A Polymarket contract gives a 59% chance that bitcoin will hit an all-time high in 2024, while another gives a 66% chance that BTC will hit an all-time high before ETH.","\"Until we see a softening in the economic data, rate cuts are likely to be off the table till May or June,\" Rust continued. \"But perhaps markets have simply accepted the fact that higher-for-longer interest rates are here to stay and have learned to live with this new reality now.\"","Edited by Omkar Godbole."],"entity":[{"type":"Truflation","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"0.73%","content":"PERCENT"},{"type":"Fed","content":"ORGANIZATION"},{"type":"$49,500","content":"MONEY"},{"type":"2024","content":"DATE"},{"type":"Omkar Godbole","content":"PERSON"},{"type":"BTC","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"$50,000","content":"MONEY"},{"type":"July","content":"DATE"},{"type":"66%","content":"PERCENT"},{"type":"May or June","content":"DATE"},{"type":"Truflation","content":"PERSON"},{"type":"March","content":"DATE"},{"type":"Tuesday","content":"DATE"},{"type":"CoinDesk Indicies","content":"ORGANIZATION"},{"type":"Oliver Rust","content":"PERSON"},{"type":"59%","content":"PERCENT"},{"type":"$48,800","content":"MONEY"}],"hashtag":["btc","Bitcoin","ETH","Ether","Interest Rates"],"authors":["Sam Reynolds"]}