{"summary":"Immutable and Polygon Labs will identify investment opportunities while King River will manage the investment process and deploy the capital across game studios and web3 infrastructure firms.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2024\/03\/19\/immutable-king-river-capital-polygon-labs-set-up-100m-web3-gaming-fund\/","publishDate":"2024-03-19T22:00:00","id":15469,"type":null,"title":"Immutable, King River Capital, Polygon Labs Set Up $100M Web3 Gaming Fund","category":["Web3"],"content":["Web3 gaming developer platform Immutable and venture capital company King River Capital have teamed up to form a $100 million \"Inevitable Games Fund\" (IGF) with assistance from Polygon Labs.","The IGF will target high-growth opportunities for professional and sophisticated investors in Web3 gaming, according to an emailed announcement on Tuesday.","Immutable and Polygon Labs will identify investment opportunities, while King River will manage the investment process and deploy the capital across game studios and Web3 infrastructure firms.","The fund is hoping to capture the opportunity in the Web3 gaming industry. \"Since 2018 the sector has attracted approximately $19 billion in investments. In 2023, blockchain gaming related rounds reached $1.7B.  A significant part of that has flowed to the 270+ blockchain games in development on Immutable,\" the press release said, citing industry research.","Web3 gaming refers to video games hosted on blockchains and may enable players to own their in-game assets in the form of non-fungible tokens (NFTs) or other digital property.","The firms have unveiled the fund almost exactly a year after Immutable and Polygon Labs announced they were forming a partnership to accelerate the development of Web3 gaming.","Read More: Web3 Gaming Company Saltwater Raises $5.5M Seed Funding","Edited by Aoyon Ashraf.","\n","\n","\n"],"entity":[{"type":"IGF","content":"ORGANIZATION"},{"type":"$1.7","content":"MONEY"},{"type":"$100 million","content":"MONEY"},{"type":"2023","content":"DATE"},{"type":"B","content":"ORGANIZATION"},{"type":"King River","content":"LOCATION"},{"type":"2018","content":"DATE"},{"type":"$5.5","content":"MONEY"},{"type":"King River Capital","content":"ORGANIZATION"},{"type":"Aoyon Ashraf","content":"ORGANIZATION"},{"type":"Tuesday","content":"DATE"},{"type":"Polygon Labs","content":"ORGANIZATION"},{"type":"$19 billion","content":"MONEY"}],"hashtag":["Web3 gaming","Gaming","Immutable X","Polygon labs"],"authors":["Jamie Crawley"]}