{"summary":"Five new editors were added to help speed up the process of approving and merging Bitcoin Improvement Proposals.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/23\/will-bitcoins-new-bip-editors-streamline-development\/","publishDate":"2024-04-23T17:34:56","id":15463,"type":null,"title":"Will Bitcoin’s New BIP Editors Streamline Development?","category":["Consensus Magazine"],"content":["Bitcoin’s open-source development is an often heralded strength, a show of the network’s resiliency and difficulty to capture. But take a closer look, and anything as complex as developing, updating and patching up a blockchain in real time often has its challenges.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","One of the main issues for the past couple of years has been the bottleneck in editing BIPs, or Bitcoin Improvement Proposals, the standard for proposing nonbinding software updates that will somehow change the Bitcoin protocol.","That is set to change going forward, after the dispersed, global Bitcoin development community decided to nominate five new BIP editors. The move marks the first time in Bitcoin history where there was more than one person on the job — a role that for the past decade was filled by controversial Bitcoin OG Luke Dashjr alone.","Bitcoin Core developer Ava Chow led the nomination process to name the five new editors: Bitcoin dev and Custodia Bank co-founded Bryan Bishop (a.k.a. Kanzure), co-hosts of the bitdevs.org mailing list Murch and Ruben Somsen, Lightning Labs CTO Olaoluwa Osuntokun (a.k.a. Roasbeef) and Bitcoin Core contributor Jonatack. The months-long search effort was finalized on Monday, after Jonatack made modifications to the BIP GitHub.","“The problem was that Luke was the only BIP editor, which means that he's the only person who could merge anything into the BIP repository,” Chow told CoinDesk in an interview. “This ranges from almost no effort to a lot of effort, and it just ended up being that Luke didn't have time for this.”","“I think what he does is what he believes to be the best for Bitcoin and what he thinks is most decentralized and best for the whole currency,” Chow added, praising Dashjr’s many contributions over the years. In addition to making regular contributions to Bitcoin Core, Dashjr also serves as chief technology officer of Ocean Mining.","BIP editing is a largely unseen aspect of the development process, which includes anything from “trivial things” like fixing typos in proposals to evaluating whether it should be a BIP, assigning it a number and offering detailed feedback, Chow explained. The end of that process would be to merge the BIP into the GitHub repository.","“One of the big frustrations is that Luke would comment, like, hey, you need to fix this thing, and the author will fix it in like a few hours. But then we wouldn’t see Luke again on that PR [pull request] for another month or two. Which is really frustrating because like, well, I did exactly what you wanted me to do,” Chow, who has at least four open BIPs, explained.","Introduced by early Bitcoin developer Amir Taaki in the first BIP proposal (BIP 0001) in August 2011, the process of submitting improvement proposals has become more formalized over the years — but somehow less streamlined. Bitcoin Core almost never submits BIPs, which tend to focus on things like improving consensus, wallets, key management or in Chow’s case novel transaction types.","“The line between what is and isn't a BIP is kind of fuzzy,” Chow said, mentioning proposals like Ordinals, Colored Coins and Taproot Assets, all of which introduce new ways of using Bitcoin, but perhaps do not formally change the protocol. “There's a line in BIP 002 that says something along the lines of BIPs must support Bitcoin — that's super vague, right?”","See also: What Are BIPs and Why Do They Matter?","In essence, what meets the criteria of being a BIP is a matter for editors to decide, a process that Chow thinks will be made more efficient by adding more voices from more diverse backgrounds. While most of the conversations will likely continue to happen out of the public eye, the greater amount of debate may help better define the criteria for successful proposals.","\"The BIPs repository records concrete ideas for reference. A comprehensive, specific description is indispensable for advancing the distributed conversation about a proposal. I hope that more people volunteering time to sight contributions to the BIPs repository will facilitate more efficient discussions about ideas,\" Murch, one of the new editors, told CoinDesk in an email.","The nomination process, which kicked off in January after a recommendation by AJ Towns, and by Bitcoin’s standards could be said to have gone rather smoothly. For a while, it was unclear exactly how many new editors to add.","“I thought it could have gone faster,” Chow said. “If you look at the thread, it kind of went silent for a few weeks — that was frustrating.”","At least in the world of blockchain — where “move fast, break things” and “test in production” are common mantras — Bitcoin development could be seen as comparatively slow. For instance, the last major protocol-wide upgrade, Taproot, went live three years ago, after years of R&D.","To some extent, this has all changed since the introduction of Casey Rodamor’s Ordinals protocol last year, which ignited a new meme-loving trading culture on a chain that has for years tried to resist the more “degenerate” aspects of the wider crypto market. And so, there is a case to be made that the new BIP editors couldn’t have come at a better time.","Though some used the moment of yesterday’s nomination as an opportunity to troll, tweeting that OP_CAT — a novel way to introduce smart contracts on Bitcoin to build more complicated apps — was assigned a BIP number 420. References to cannabis culture aside, the joke does help elucidate the tensions and human conflicts inherent in essentially gatekeeping what proposals count.","Dashjr, for instance, is a known opponent of OP_CAT and Ordinals, and some saw him as unfairly standing in the way of approving their respective proposals.","See also: The Blocksize Wars Revisited: How Bitcoin's Civil War Still Impacts Bitcoin","“As far as I am aware OP_CAT has not been assigned a BIP number,” BastionZero CTO Ethan Heilman, one of the proposal's co-authors, told CoinDesk in an email. “We could be assigned a BIP number at any point so this information may be out of date. The only source of truth on this question is the BIP PR here.”","“I'm glad to see the Bitcoin community getting more editors. It is a good sign for Bitcoin development. Being a BIP editor is a thankless job and I appreciate the work that BIP editors put in to help the community. I am grateful to everyone that volunteered for this role,” Heilman added.","Indeed, it’s possible that more editors means more BIPs get approved and merged — after all, the end game is efficiency. But it’s possible that Bitcoin, filled as it is with strong personalities who hold strong opinions, may always be more interested in debate than speed.","Chow for one said that although she has a more “relaxed view” of what should be considered a BIP, she doesn’t think Ordinals (which she called “kinda dumb”) meet the criteria — though she wouldn’t oppose it out of hand.","“It's just documentation,” Chow said. “Who cares?”","Edited by Bradley Keoun."],"entity":[{"type":"BIP","content":"ORGANIZATION"},{"type":"Chow","content":"PERSON"},{"type":"three years ago","content":"DATE"},{"type":"Custodia Bank","content":"ORGANIZATION"},{"type":"Chow","content":"LOCATION"},{"type":"AJ Towns","content":"ORGANIZATION"},{"type":"Bitcoin OG Luke Dashjr","content":"PERSON"},{"type":"Heilman","content":"PERSON"},{"type":"Lightning Labs CTO","content":"ORGANIZATION"},{"type":"Ocean Mining","content":"ORGANIZATION"},{"type":"Casey Rodamor","content":"PERSON"},{"type":"Monday","content":"DATE"},{"type":"” Chow","content":"PERSON"},{"type":"Murch","content":"PERSON"},{"type":"Bryan Bishop","content":"PERSON"},{"type":"Amir Taaki","content":"PERSON"},{"type":"\" Murch","content":"PERSON"},{"type":"August 2011","content":"DATE"},{"type":"Ethan Heilman","content":"PERSON"},{"type":"Colored Coins","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"Bradley Keoun","content":"PERSON"},{"type":"Ruben Somsen","content":"PERSON"},{"type":"Luke","content":"PERSON"},{"type":"Jonatack","content":"PERSON"},{"type":"Dashjr","content":"PERSON"},{"type":"BIP GitHub","content":"ORGANIZATION"},{"type":"Ava Chow","content":"PERSON"},{"type":"Bitcoin","content":"PERSON"},{"type":"Bitcoin","content":"LOCATION"}],"hashtag":["Analysis","Bitcoin","Bitcoin Core","bitcoin developers","BIPS","Luke dashjr"],"authors":["Daniel Kuhn"]}