{"summary":"Suggested fines the securities watchdog suggested for Terraform Labs and Ripple are out-of-line with what it has collected from crypto firms in the past.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2024\/04\/24\/do-kwons-huge-fine-shows-the-sec-is-ratcheting-up-penalties-against-crypto-firms\/","publishDate":"2024-04-24T20:24:33","id":15461,"type":null,"title":"Do Kwon's Huge Fine Shows the SEC Is Ratcheting Up Penalties Against Crypto Firms","category":["Consensus Magazine"],"content":["The U.S. Securities and Exchange Commission is looking to impose its steepest fine yet on a cryptocurrency project, a $5.3 billion penalty for Do Kwon and Terraform Labs, the man and company behind the fatally flawed algorithmic stablecoin that jumpstarted a multi-billion-dollar, industry-wide contagion event when it imploded two years ago.","This is an excerpt from The Node newsletter, a daily roundup of the most pivotal crypto news on CoinDesk and beyond. You can subscribe to get the full newsletter here.","\n","Following a protracted investigation and relatively short two-week trial in New York earlier this month, Kwon and Terraform were found liable for fraud – hiding obvious dangers lurking in the trading scheme that would allegedly keep its UST stablecoin solvent and the unsustainable 20% yields offered by Terraform's Anchor lending platform. Kwon, who was arrested in Montenegro carrying a false passport last year, did not attend the trial. He is currently awaiting extradition either to the U.S. or his native South Korea.","The monetary penalty is not a done deal; a court will decide the final punishment. But what the SEC said it's seeking, according to an April 19 court filing, is to send “an unequivocal message.\"","To experts, the gigantic size of the fine is a sign the SEC isn't playing around anymore, as it follows its proposed $1.8 billion penality for Ripple. (And it comes on the heels of the $4.3 billion fine imposed on Binance by a bundle of U.S. regulators, though the SEC was conspicuously absent from that settlement, and prosecutors this week asking for Binance ex-CEO Changpeng Zhao to spend three years in prison.)","“The recent high-profile cases against Terra\/Do Kwon and Ripple, with penalties reaching hundreds of millions or even billions of dollars, do signal a change in the SEC's strategy,” University of Pennsylvania assistant law professor Andrea Tosato told CoinDesk in an interview. \"Overall, I would say that it appears the SEC is trying to send the message that … the reward is just not worth the risk.”","While SEC Chair Gary Gensler has been more or less anti-crypto since taking office in 2021, the financial carnage caused by the collapse of Terra, Three Arrows Capital and FTX in 2022 made it a matter of national priority to try to get the industry in order. The Biden administration, for instance, sent out a memo noting that regulating crypto would be a “whole of government” affair.","And so Binance, Ripple and now Kwon and Terraform are feeling the weight of that.","While Terraform lawyers have argued that the U.S. lacked jurisdiction, they are now arguing to cap the fine at $3.5 million. Kwon’s defense council suggested a maximum fine of only $1 million. For its part, Ripple proposed a civil penalty of no more than $10 million, arguing the SEC’s suggested fine was excessive because it was more than 20 times what it had ever collected from a crypto settlement so far.","That’s true, to an extent. The SEC was able to collect over $1.2 billion from Telegram – but almost all of that amount was meant to be returned to investors while the popular messaging company only had to pay a $18.5 million civil penalty. That was in line with Block.one’s $24 million civil penalty in 2019. (CoinDesk is owned by Bullish, which is in turn majority owned by Block.one) In 2022, the year the SEC grossed the most from enforcement actions with $6.4 billion in fines, the average civil penalty was slightly above $9 million.","See also: 'Down Infinite': A Ham-Fisted Attempt to Rehabilitate Do Kwon's Image","So what accounts for the SEC’s seemingly aggressive turn? Rutgers Law School professor Yuliya Guseva suggested it’s likely a confluence of factors including the fact that as crypto projects grow in size, so does the potential for disgorgement. But there’s also the legal strategy of “terrorem,” which, as the latinate word suggests, is meant to cast fear over the industry to incentivize compliance.","“This latter approach indicates that the SEC may be strategic in its choices as it attempts to bring the crypto industry within the ambit of securities law,” Guseva told CoinDesk in an interview.","Disgorgement isn’t actually mentioned anywhere in securities laws, according to Tosato, but has been standard operating procedure since the 1970s as a way to return funds to investors and deter future violations. Civil penalties on the other hand are supposed to follow a rulebook, which includes the degree of unlawfulness, the actual (or potential) harm caused to investors and the extent to which defendants complied with regulators.","However, in practice, this process \"does involve a degree of discretion which the SEC exercises within established legal frameworks,” Tosato added. While ratcheting up the amount firms are fined is definitely meant to send a message to others, Tosato said he doesn’t think the SEC is “especially out of line compared to what it has done in other industries” when it comes to clear-cut cases of fraud and securities violations – of which there are many.","“In my mind, what is different is that the applicability of the regulatory framework in the crypto space is far more uncertain than it is in many industries,” Tosato said. “Recent case law continues to leave many unresolved questions.”","See also: Your Crypto Project Needs a Sheriff, Not a Bounty Hunter | Opinion","Edited by Nick Baker."],"entity":[{"type":"South Korea","content":"LOCATION"},{"type":"U.S.","content":"LOCATION"},{"type":"billions of dollars","content":"MONEY"},{"type":"SEC","content":"ORGANIZATION"},{"type":"Kwon","content":"PERSON"},{"type":"20%","content":"PERCENT"},{"type":"$3.5 million","content":"MONEY"},{"type":"” University of Pennsylvania","content":"ORGANIZATION"},{"type":"$18.5 million","content":"MONEY"},{"type":"2019","content":"DATE"},{"type":"1970s","content":"DATE"},{"type":"Nick Baker","content":"PERSON"},{"type":"New York","content":"LOCATION"},{"type":"Binance ex-CEO Changpeng Zhao","content":"ORGANIZATION"},{"type":"$1.8 billion","content":"MONEY"},{"type":"Gary Gensler","content":"PERSON"},{"type":"Terraform","content":"ORGANIZATION"},{"type":"Montenegro","content":"LOCATION"},{"type":"$24 million","content":"MONEY"},{"type":"U.S. Securities and Exchange Commission","content":"ORGANIZATION"},{"type":"$5.3 billion","content":"MONEY"},{"type":"$10 million","content":"MONEY"},{"type":"Yuliya Guseva","content":"PERSON"},{"type":"Crypto Project Needs","content":"ORGANIZATION"},{"type":"2021","content":"DATE"},{"type":"2022","content":"DATE"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"FTX","content":"ORGANIZATION"},{"type":"April 19","content":"DATE"},{"type":"last year","content":"DATE"},{"type":"$9 million","content":"MONEY"},{"type":"$1 million","content":"MONEY"},{"type":"$6.4 billion","content":"MONEY"},{"type":"Tosato","content":"PERSON"},{"type":"Rutgers Law School","content":"ORGANIZATION"},{"type":"$4.3 billion","content":"MONEY"},{"type":"Andrea Tosato","content":"PERSON"},{"type":"Terra","content":"ORGANIZATION"},{"type":"Terra\/Do Kwon","content":"ORGANIZATION"},{"type":"UST","content":"ORGANIZATION"},{"type":"Biden","content":"PERSON"},{"type":"$1.2 billion","content":"MONEY"}],"hashtag":["Opinion","Do Kwon","terraform labs","Ripple","Binance","Changpeng Zhao","The Node","Newsletters","Regulation","SEC","Enforcement","Settlements"],"authors":["Daniel Kuhn"]}