{"summary":"Simple ether and ERC-20 wallet transfers are being included in blocks for a fraction of the cost seen during December and January.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/02\/15\/why-are-fees-on-ethereum-dropping\/","publishDate":"2022-02-15T21:49:06","id":15465,"type":null,"title":"Why Are Fees on Ethereum Dropping?","category":["Markets"],"content":["The recent market downturn has taken a toll on crypto markets, with ether (ETH) off its November high by 36% at the time of writing. Perhaps more notable, however, has been the impact on network activity, such as transaction fees, decentralized finance (DeFi) trading volume and borrow rates across lenders.","Simple ether and ERC-20 wallet transfers are being included in blocks for a fraction of the cost seen during December and January. While this is a more computationally intensive form of transaction compared with wallet transfers, here is a user swapping one asset to another, paying just 0.0064 ETH ($20.04) for the transaction fee. A similar transaction during March of last year cost a different user 0.04 ETH ($125.18), over six times as much as the Feb. 15 transaction.","The comparison is, of course, not apples to apples, with contracts becoming more gas efficient over time and different levels of activity throughout the day, but studying it can demonstrate how far transaction costs have dropped.","Since EIP 1559 was activated in early August 2021, every block now has a set base fee that must be paid in ether in order to be included in a block. To prevent volatility in these base fees, they can only be adjusted by 12.5% up or down after each block, depending on whether the previous block was above or below the gas target set by Ethereum core developers.","The base fee paid on every transaction is sent to a burn address, a mechanism that allows the native asset, ether, to practically behave like gas in a car. More importantly, the burn counteracts the inflation caused through block rewards and helps support the longevity of both the Ethereum network and its native asset.","By reducing fee volatility, the network has shielded itself from transaction fees being sent through the roof in a short period of time by non-fungible token (NFT) mints or token launches. However, the same is true in reverse and it may take weeks at a time for transaction fees to fall significantly in longer periods of low activity.","The charts below highlight this muted volatility, but also show falling gas prices month over month and daily transactions trending downward since November of last year. The larger effect on the network is lower fee burning and increasing ether inflation, which has only been seen to this extent two other times since the implementation of EIP 1559.","\n","Falling transaction fees are great for user experience, but maybe a not-so-great signal for the network as a whole. Network activity will always be correlated to crypto asset prices, but an overly strong relationship between the two could signal that the majority of Ethereum applications are focused on asset speculation rather than on real world adoption, through decentralized products like insurance, gaming, payments and more."],"entity":[{"type":"November of last year","content":"DATE"},{"type":"August 2021","content":"DATE"},{"type":"January","content":"DATE"},{"type":"Feb. 15","content":"DATE"},{"type":"20","content":"DATE"},{"type":"December","content":"DATE"},{"type":"March of last year","content":"DATE"},{"type":"12.5%","content":"PERCENT"},{"type":"November","content":"DATE"},{"type":"1559","content":"DATE"},{"type":"NFT","content":"ORGANIZATION"},{"type":"36%","content":"PERCENT"},{"type":"$20.04","content":"MONEY"},{"type":"$125.18","content":"MONEY"}],"hashtag":["Ethereum","Gas","Fees","Scaling"],"authors":["Edward Oosterbaan"]}