{"summary":"Teaming up with fundraising platform JustGiving, Teddy DAO will hold a daily auction of teddy bear NFTs, allowing the buyer to donate proceeds to a charity of their choosing.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/web3\/2023\/06\/20\/web3-charity-teddy-dao-is-raising-money-through-daily-nft-auctions\/","publishDate":"2023-06-20T16:05:27","id":15467,"type":null,"title":"Web3 Charity Teddy DAO is Raising Money Through Daily NFT Auctions","category":["Web3"],"content":["Web3 software company Lucky Friday is introducing Teddy DAO, a perpetual non-fungible token (NFT) collection that donates its sale proceeds to charity.","Teaming up with global fundraising organization JustGiving, Teddy DAO aims to utilize crypto as a funding mechanism to promote social impact worldwide.","Starting June 23, Teddy DAO will hold daily auctions for one of its teddy bear NFTs, created by digital artist Yumi and minted on cross-chain smart contract platform Moonbeam. Auction winners can then donate the proceeds to one of 400 charities supported by JustGiving, where the crypto is then converted to fiat and donated through the platform.","Teddy DAO eventually plans to leverage 450,000 charities supported by JustGiving as part of its mission to help solve real-world problems through cryptocurrency donations.","David Chapman, founder of Teddy DAO, told CoinDesk that the project was inspired by an NFT sale he conducted last year, where he sold a one-of-one collectible and raised $15,000 for humanitarian aid organization UNICEF. He noted that this event not only highlighted the demand for NFT-backed charity donations but also indicated that the method could be used to onboard people new to Web3.","“Whereas NFTs have largely been for-profit and the few instances of charitable giving have been a one-time donation, we thought it best to showcase a new use for NFTs by creating digital collectibles that will be minted once per day, thereby guaranteeing a constant stream of revenue for charities within JustGiving's network of partners,” said Chapman.","Teddy DAO, a decentralized autonomous organization (DAO) registered as a 501(c)(3) organization, aims to build out its community to collectively contribute to social good.","“Over time, we would love to see it develop to where donors are selecting the Teddy DAO as a charity to donate to and build a treasury that can be voted on by the holders of the NFTs as to what social good initiatives to deploy to, whether that is to build wells in a place of need or a school etc.,” said Chapman.","Despite an ongoing bear market that has largely chilled NFT sales, crypto-based charity donations have caught on as a way to leverage blockchain-based currencies and NFTs for social impact.","Earlier this month, Ethereum-founder Vitalk Buterin donated $10 million in funds from the sale of memecoin Shiba Inu to an India-based covid relief organization. And in May, crypto funding platform Endaoment teamed up with non-profit Global Giving to expand its roster of organizations that accept crypto donations."],"entity":[{"type":"Yumi","content":"PERSON"},{"type":"Teddy DAO","content":"ORGANIZATION"},{"type":"May","content":"DATE"},{"type":"$15,000","content":"MONEY"},{"type":"David Chapman","content":"PERSON"},{"type":"NFT","content":"ORGANIZATION"},{"type":"UNICEF","content":"ORGANIZATION"},{"type":"Chapman","content":"PERSON"},{"type":"India","content":"LOCATION"},{"type":"Ethereum","content":"PERSON"},{"type":"Shiba Inu","content":"LOCATION"},{"type":"Friday","content":"DATE"},{"type":"$10 million","content":"MONEY"},{"type":"June 23","content":"DATE"}],"hashtag":["Web3","NFT","Donations","Charity","Polkadot"],"authors":["Cam Thompson"]}