{"summary":"“There's a lot of value in talent that doesn't want to be held down by one organization,” says a member of the core team and DAO of Orca Protocol. This interview is part of CoinDesk's Future of Work Week.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/layer2\/2022\/06\/27\/chase-chapman-on-daos-and-professional-polyamory\/","publishDate":"2022-06-27T14:56:31","id":15466,"type":null,"title":"Chase Chapman on DAOs and Professional Polyamory","category":["Consensus Magazine (layer2)"],"content":["“People always talk about DAOs enabling polyamorous work,” says Chase Chapman, a member of the core team and DAO of Orca Protocol, which offers a method DAOs can use to create and manage working units – appropriately termed “pods” – through on-chain governance.","Chapman’s work extends well beyond her pod, enabling her to practice professional polyamory with multiple organizations and skillsets. “That isn't taboo or problematic,” she explains. “It just means that you have a much more fluid way of thinking about what it means to do different types of work and engage across several different organizations.”","This interview is part of CoinDesk's Future of Work Week","Polyamorous work via DAOs is not an idea Chapman coined – she recalls seeing it in a tweet by @rafathebuilder. But it makes sense in the modern world, where more and more people are turning to non-monogamous relationships in their personal lives, acknowledging that it can take more than one person to meet another’s full set of needs. Why not take this attitude from the bedroom to the workplace?","“We used to think that our jobs were these things that should give us fulfillment professionally and completely,” Chapman says. “That’s very much the monogamy model.” For members of Gen Z like Chapman, that model’s grown outdated, particularly in the flexible world of online work and within the fluid organizational structure of decentralized autonomous organizations (DAOs) in Web3.","Chapman’s embraced this polyamorous style of professionalism throughout her still nascent career in the blockchain industry. Having graduated from the University of Michigan in 2021, she got involved with multiple governance projects straight out the undergraduate gate, joining DAOs including Index, Forefront, and RabbitHole. While still in college, she co-founded a developer tooling company, Decentology, and currently hosts the podcast “On the Other Side.” She also does some advising work and occasionally invests in other Web3 companies.","“There's a lot of value in talent that doesn't want to be held down by one organization,” she says, describing some friends in Web3 who feel that committing to one company “limits what they can do in the space.” DAOs and the modern way of work let Chapman and her colleagues explore and “play around” in ways that wouldn’t be possible if they were tied to a traditional company.","Of course, all that job juggling can be stressful. When she was a member of four different DAOs post-college, it got to be a bit much. But the experience taught her some important lessons about how to communicate her capabilities – with herself and others. “When you have a lot of income streams like that, you have to be even more clear with yourself and with whoever you're working with about the exact things you're providing,” she says.","Read More: What You Need to Know and Do to Get a Job in Crypto","These days, Chapman has narrowed her workload a bit, spending the bulk of her time on Orca. That doesn’t mean she’s gone monogamous. She still puts out regular podcast episodes, posts prolifically on Twitter, invests, and advises. Even within Orca Protocol, her roles are varied. Chapman is both a member of the core team of Sonar Labs, the centralized company behind Orca, and of Orca’s DAO. With the core team, she primarily focuses on communications, producing educational materials about the company’s main product, used mainly by other DAOs. She also “supports information flow” between Sonar Labs and the DAO.","“I would identify myself as more part of the core team than the DAO,” Chapman explains. She belongs to an entity called the “source pod” that’s made up of both core team and DAO members, through which she helps “steward” the DAO’s activities – like resource allocation planning for the third quarter of 2022.","Straddling a company and its surrounding community makes for a lot of meetings and modes of communication. Chapman uses Discord, Trello boards, and group calls to organize with both entities. The core team does three standup meetings per week, leaving two days for them to focus on content. She checks in with the DAO-centered community about once a day.","These online interactions are crucial for any decentralized company and, obviously, DAO. While the Orca team is largely U.S.-based, Chapman says, she’s not exactly sure where all the DAO members live – “a lot don’t share where they’re based.”","However, some are in New York City, where Chapman relocated to from Michigan in January to sit closer to the center of the U.S.’s crypto universe (she couldn’t quite see herself in Miami). She attends monthly dinners with the other DAO members who live near her, and has also attended some retreats for the DAO in other locations. “I think more DAOs should be doing retreats in general,” she says, stressing the importance of sharing physical space with colleagues who operate primarily in virtual arenas.","“I actually think office space is going to be relatively popular for DAO contributors,” Chapman adds, “especially because, when you think about what it means to have inner DAO connections and loose ties to a bunch of different people…office spaces happen to be a really good way to create those bonds.”","Some DAOs have already gone IRL. In New York, for example, Chapman points out how EmpireDAO rented “a bunch of offices where the Supreme building is…and I know a few other projects that are also thinking a lot about IRL.”","In the meantime, Chapman and her colleagues get to know each other through more creative means. “We’re doing this thing where once a week, two random people from our community are picked to just chat with each other,” she says. This helps the team get closer, even though some members remain anonymous. “If you create space for vulnerability, that often doesn't require knowing everything about where someone lives, if they're married, and all these things. Instead, people feel like they can share how they're feeling – if they're feeling stuck, or if something’s been bothering them lately. You can form pretty strong bonds.”","Read more: 'We're Freaking DAOing It': The People Who Think DAOs Are the Future of Work","Though Chapman’s committed to DAOs and what they can accomplish, she sees some flaws with their operations. “We often hold ‘decentralization’ as this gold standard. I think the problem is that when we think about decentralization, what comes to mind are protocols like Bitcoin or Ethereum,” she says. “The way decentralization looks at a protocol level, it's probably not feasible for human beings.” For Chapman, a human approach to decentralization means honoring people’s specialties – not creating a flat structure where everyone’s work and ideas are weighted equally, but delegating appropriately based on skillsets.","After all, Chapman’s driving question in Web3 has always been, “How do we make this stuff human?” For DAOs, one of those ways would be to rethink governance tokens as compensation for DAO members, which she believes fosters inequity. “Either people have to dump them in order to earn income,” she says, or those who have enough money to hold onto their governance tokens end up with all the decision-making power. Fiat wealth still translates to power, and that’s a problem in an ecosystem meant to move beyond fiat.","To right this imbalance, Chapman thinks many DAOs will embrace compensation via stablecoins going forward. She also foresees the types of working groups that have come up in DAOs becoming floating entities, forming small squads (or, you know, pods) that function well as a team and can move from one DAO to another to flexibly provide support as they desire.","Ultimately, Chapman plans to stick with DAO work to help keep Web3 human. “There is a level of humility among people that work in DAOs who are building that type of culture correctly, which is that anyone can come up with a great idea and anyone can execute on it,” she says. “I really, really value that and probably wouldn't want to go back.”","It may be a bear market, but there are still plenty of jobs to be had at crypto companies.","Crypto can make it faster and cheaper to pay workers. This article is part of the Future of Work series.","By adopting a more open, fluid model, traditional firms would find it easier to attract talent and end up with a more passionate, engaged workforce."],"entity":[{"type":"New York City","content":"LOCATION"},{"type":"Chase Chapman","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"2021","content":"DATE"},{"type":"third quarter of 2022","content":"DATE"},{"type":"IRL","content":"ORGANIZATION"},{"type":"Michigan","content":"LOCATION"},{"type":"Miami","content":"LOCATION"},{"type":"University of Michigan","content":"ORGANIZATION"},{"type":"January","content":"DATE"},{"type":"Sonar Labs","content":"ORGANIZATION"},{"type":"New York","content":"LOCATION"},{"type":"Chapman","content":"PERSON"},{"type":"DAO of Orca Protocol","content":"ORGANIZATION"},{"type":"Orca’s DAO","content":"ORGANIZATION"},{"type":"DAO","content":"ORGANIZATION"},{"type":"Forefront","content":"ORGANIZATION"},{"type":"RabbitHole","content":"ORGANIZATION"},{"type":"Crypto","content":"LOCATION"},{"type":"Bitcoin","content":"PERSON"}],"hashtag":["Future of Work Week","Interview","DAO"],"authors":["Jessica Klein"]}