{"summary":"Polygon Labs plans to unify new L2 zero-knowledge chains with new staking and interoperability layers as part of Polygon 2.0.\nThe design for Polygon 2.0 will utilize a shared zero-knowledge infrastructure to power all networks within the future ecosystem.","author":["Vishal Chawla","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/237088\/polygon-2-0-to-leverage-matic-re-staking-and-new-interoperability-layer","publishDate":"2023-06-29T12:00:38","id":1546,"type":null,"title":"Polygon 2.0 to leverage new Matic staking and interoperability layers","category":["Crypto Ecosystems"],"content":["Polygon Labs said it plans to unify its zero-knowledge chains using new staking and interoperability layers in a move toward transitioning the project into a Layer 2 ecosystem.","The design for Polygon 2.0 is intended to utilize a shared zero-knowledge infrastructure to power all networks within the ecosystem, pending approval by its governance body. This development comes on the heels of a recent community proposal to upgrade Polygon’s proof-of-stake network to a Layer 2 <a href=\"https:\/\/www.theblock.co\/post\/235698\/polygon-labs-proposes-to-upgrade-flagship-sidechain-to-zkevm-validium-layer-2\" data-v-f87c67ca=\"\">zkEVM Validium<\/a>, which would operate alongside the existing Polygon zkEVM, another Layer 2 chain that the team <a href=\"https:\/\/www.theblock.co\/post\/222950\/polygon-labs-unveils-zkevm-layer-2-scaling-solution\" data-v-f87c67ca=\"\">launched<\/a> in March 2023.","The transition to Polygon 2.0 is slated to occur in the first quarter of next year, with progress being made throughout this year.","“Polygon 2.0 aims to create an ecosystem where we can continuously add block space and unify them with a shared bridge and an interoperability layer,” Polygon co-founder Brendan Farmer said in an interview with The Block. “Unified liquidity is everything for Polygon in the coming year.”","The proposed Polygon 2.0 network will incorporate an Ethereum Virtual Machine client and a shared ZK proving implementation, referred to by the team as an “interoperability layer” or a “common bridge.” The interoperability layer will be powered by an in-house developed cryptographic algorithm, Plonky3, and the end result will be a single, high-performance proving system that will underpin the entire network.","Farmer explained that the common bridge will link all Polygon chains and settle ZK-based security proofs back on Ethereum to secure all the Polygon chains at once. The mechanism simplifies the process of converting or securely transferring native Ethereum assets from one chain to another.","“The common bridge will be a single contract that checks the validity of cross-chain transactions, manages state updates, and verifies proofs for every chain in the Polygon ecosystem,” Farmer said.","Another significant proposal for Polygon 2.0 is the implementation of a decentralized staking layer that allows for the “re-staking” of Polygon's native Matic tokens across different networks. The concept is similar to the <a href=\"https:\/\/www.theblock.co\/post\/222901\/eigenlayer-series-a\" data-v-f87c67ca=\"\">Eigen Layer<\/a> on Ethereum, and in practical terms, it means that network participants can repurpose their stake, which secures one network, to ensure the security of other Polygon chains.","While the security of Polygon 2.0 is ultimately guaranteed by zero-knowledge proofs and the Ethereum mainnet, Farmer said that the ecosystem needs a mechanism to ensure that the operation of these chains is censorship-resistant. He further explained that the sequencing and ordering of transactions and blocks on various L2 networks will often be performed by validators that stake Matic tokens through a dedicated staking layer.","“When it comes to operating those chains in a decentralized manner, staking is a crucial component because it allows us to use existing Matic validators as sequencers at no additional capital cost,” Farmer added."],"hashtag":["POLYGON"]}