{"summary":"Some Consensus 2023 participants argue that the economic benefits of CBDCs are not worth the threats to privacy in an excerpt from CoinDesk’s first-ever Consensus @ Consensus Report.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/06\/05\/privacy-concerns-dominate-cbdc-discussion-at-consensus-2023\/","publishDate":"2023-06-05T14:16:11","id":15478,"type":null,"title":"Privacy Concerns Dominate CBDC Discussion at Consensus 2023","category":["Consensus Magazine"],"content":["The dangers of government abuse threaten to outweigh the potential economic benefits of central bank digital currencies (CBDCs), according to the consensus of stakeholders considering the matter at Consensus 2023.","Governments can’t be trusted to build public digital money without using it to conduct surveillance on their citizens, many participants said in roundtable discussions held during the April conference. This cautious sentiment was echoed by the broader Consensus audience.","Among 169 attendees who answered an electronic survey during the three-day April conference, only 9% answered that it was unequivocally possible to design and build a surveillance-free government-backed digital currency. The largest proportion, 39%, agreed that doing so was technically possible but worried governments wouldn’t allow digital currencies to operate with a guarantee of privacy.","This article is excerpted from CoinDesk’s inaugural Consensus @ Consensus Report, the product of intimate, curated group discussions that took place at Consensus 2023. Click here to download the full report.","The crypto sector is “generally negative and worried when it comes to CBDCs, especially around privacy,” said Arry Yu, co-chair of the U.S. Blockchain Coalition, one of the participants in the roundtable discussions who chose to speak on the record. (The session, which drew 135 participants, was conducted under the Chatham House rule.)","Some participants in the discussion at Consensus argued that embracing a digital dollar is vital for the U.S. to maintain the dollar’s dominant role as the global reserve currency. Many suggested the nation will be forced to catch up to competitors that are already far ahead.","“The world will have CBDCs and stablecoins whether we like it or not, and whether the U.S. chooses to lead or follow,” said J. Christopher Giancarlo, the former chairman of the Commodity Futures Trading Commission, during a keynote address at Consensus.","“Digital currencies that effectively protect financial privacy in lawful transactions will be the world’s most desired,” said Giancarlo, now executive chairman of the Digital Dollar Project, a group encouraging research and discussion of a virtual greenback.","Read More: The U.S. Should Lead the Digital Future of Money","Privacy was at the center of the discussion at Consensus, and participants hit on several suggestions for dodging a future dystopia.","Discussants at Consensus proposed that CBDCs use open source code, inspectable by anyone, and a transparent minting process that would discourage stealth inflation measures.","The group argued that sovereign digital money should strive to share the same privacy benefits as cash. One popular idea was that users maintain control of data that’s collected about their financial activity, while the discussion also touched on the possibility that smaller, lower-risk CBDC transactions could be granted the highest level of privacy….","Click here to download the full Consensus @ Consensus report."],"entity":[{"type":"9%","content":"PERCENT"},{"type":"Digital Dollar Project","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Digital Future of Money","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Arry Yu","content":"PERSON"},{"type":"Chatham House","content":"ORGANIZATION"},{"type":"Giancarlo","content":"PERSON"},{"type":"39%","content":"PERCENT"},{"type":"J. Christopher Giancarlo","content":"PERSON"},{"type":"Commodity Futures Trading Commission","content":"ORGANIZATION"},{"type":"U.S. Blockchain Coalition","content":"ORGANIZATION"},{"type":"April","content":"DATE"}],"hashtag":["Features","Consensus at C23","Privacy","Regulation","CBDC","Consensus 2023"],"authors":["Jesse Hamilton"]}