{"summary":"The growing prevalence of staking could help establish benchmark interest rates for blockchain-based money markets, Zhuling Chen said.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/tech\/2023\/04\/12\/rockx-ceo-shanghai-upgrade-will-be-a-game-changer-for-eth-token-holders\/","publishDate":"2023-04-12T18:38:59","id":15470,"type":null,"title":"Ethereum Shanghai Upgrade Will Be a ‘Game Changer’ for ETH Token Holders, RockX CEO Says","category":["Technology"],"content":["The Ethereum Shanghai hard fork will change the landscape for ether (ETH) token holders, said Zhuling Chen, CEO of blockchain services company RockX.","The growing prevalence of staking, where participants pledge ether to participate in running the blockchain in return for yield, could help establish benchmark interest rates for blockchain-based money markets.","Read more: Ethereum’s Shanghai Upgrade Is Complete, Starting New Era of Staking Withdrawals","“We do think this is actually a game changer,” Chen told CoinDesk TV’s “First Mover” on Wednesday about the network’s Shanghai (or Shapella) upgrade. “If you think about it, this is the first time that Ethereum has a long-term, market-risk-free yield curve that can actually go for a long run.”","The upgrade, which is slated to take place on April 12 at 6:27 p.m. ET (22:27 UTC), will mark the network’s completing the transition to a proof-of-stake (PoS) consensus system. With the upgrade, token holders will be able to withdraw the ether they’ve staked. The upgrade is also intended to make it easier to participate in the network‘s validation process while increasing security, lower fees and create more room for the network to handle more transactions.","While concerns linger that Ethereum’s upgrade will cause a substantial withdrawal of ETH, Chen said that institutional investors see the event as more of a “trust vote” in the future of the blockchain.","He said RockX plans to “encourage some customers to withdraw” some ether out of the 240,000 ETH the company has staked, to show that RockX trusts the network’s upgrade.","From a technical perspective, Chen said the upgrade is a rather “boring and peaceful event.” However, he said use cases for decentralized applications, or dapps, may soon become evident.","“From the dapps or application layer, we’re expecting a lot of innovative financial products, and also, different types of new products,” he said.","Read more: Ethereum’s Shanghai Upgrade: Here’s Our Guide to Watch Parties, Blockchain Tools","Edited by Ben Schiller and Bradley Keoun."],"entity":[{"type":"Chen","content":"PERSON"},{"type":"6:27 p.m.","content":"TIME"},{"type":"Ben Schiller","content":"PERSON"},{"type":"Wednesday","content":"DATE"},{"type":"Ethereum","content":"PERSON"},{"type":"Blockchain Tools","content":"ORGANIZATION"},{"type":"UTC","content":"ORGANIZATION"},{"type":"Zhuling Chen","content":"PERSON"},{"type":"April 12","content":"DATE"},{"type":"Shanghai","content":"LOCATION"},{"type":"Bradley Keoun","content":"PERSON"}],"hashtag":["Ethereum","Shanghai upgrade","Shapella","CoinDesk TV","ETH"],"authors":["Fran Velasquez"]}