{"summary":"Standardized staking rates will play a crucial role in creating new financial products, Christopher Perkins writes for \"Staking Week.\"","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/consensus-magazine\/2023\/09\/26\/how-staking-rates-can-drive-the-crypto-economy-forward\/","publishDate":"2023-09-26T19:13:46","id":15471,"type":null,"title":"How Staking Rates Can Drive the Crypto Economy Forward","category":["Consensus Magazine"],"content":["While the world eagerly awaits the approval of a spot bitcoin exchange-traded fund (ETF) in the U.S. there is another crypto innovation that promises to unleash a fervor of economic activity, enabling an even greater wave of mainstream adoption and convergence across the global financial system.","This article is part of CoinDesk's \"Staking Week.\" Christopher Perkins is a managing partner and president of CoinFund.","\n","This is the arrival of crypto-native staking rates, made possible by proof-of-stake (PoS) blockchains like Ethereum that will deliver the identical utility of traditional interest rates – closing a vital gap in its evolution and development for the crypto economy.","In traditional finance, interest rates underpin the largest markets in the world and serve as a fundamental pillar of economic activity. Staking rates can do the same for the crypto industry by delivering a new class of standardized benchmarks, powering next generation financial products, improving risk management and unlocking new functionality for institutions and consumers alike.","Staking rates are to crypto what interest rates are to traditional financial markets.","Interest rates drive modern economies. In traditional finance, interest rate decisions are highly centralized, controlled and reserved for the very upper echelons of government. Eight times a year, the Federal Open Market Committee (FOMC) meets to determine monetary policy and sets interest rates in the United States. Each decision by its 12 members has far-reaching effects on the global economy, impacting monetary policy, unemployment rates and consumer behavior.","Interest rates serve as important financial benchmarks for borrowing and lending and are used in valuations and asset pricing. They determine the cost of capital for businesses. Interest rates also power trillions of dollars of financial products, and the interest rate swap market alone underpins $500 trillion in notional exposure, making it the largest derivative asset class in the world.","Until recently, the crypto industry was completely devoid of anything close to fiat interest rates, leaving a major gap, slowing its evolution and leaving it relatively inaccessible to a large swath of market participants.","However, with Ethereum’s transition to proof-of-stake following \"The Merge,\" a standardized staking rate for the protocol — similar to a traditional “risk free” rate — was born. Standardized staking rates, like CoinFund's CESR composite ether (ETH) staking rate, measure the returns paid to eligible validators by observing the average, annualized protocol awards and transaction fees they receive. (Disclosure: CESR is based on CoinFund’s staking rate methodology and is calculated, published, and licensed by CoinDesk Indices.)","This decentralized and truly global version of traditional interest rates can deliver identical utility to market participants, helping measure performance, hedge risk and create new financial products. And it can be offered without the opacity and centralized control of central bank decision-making.","In traditional finance, borrowing, lending and derivative products are often priced relative to a standard benchmark that provides a basis for comparison and evaluation. This gives market participants a degree of transparency and certainty as they pay or receive a rate that is priced above or below a known reference rate, calculated by a third party, rather than be subject to something potentially arbitrary and bespoke. As a result, service providers can compete relative to a common reference. Applied to the crypto industry, staking providers that pay yields relative to an industry benchmark promises to attract a new class of clients that require the transparency of a standardized rate.","In addition to financial benchmarks, standardized staking rates can serve as reference rates in derivative contracts including listed futures, swaps and options. Derivatives enable risk management (i.e. hedging) and speculation by transferring risk in an economic system.","In traditional markets, interest rate swaps allow users to swap fixed and floating liabilities, making fixed rate products possible. Demand for fixed rate financial products is nearly unquenchable: interest rate swaps are the largest derivative markets in the world. Staking rate swaps (fixed versus floating) can provide the same utility to the crypto industry with the adoption of standardized staking rates. By entering into staking rate swaps, staking service providers could offer fixed yields that would be attractive to a new class of institutional and retail clients.","Meanwhile, other industry participants may be attracted to the real yield of floating side while others may seek to hedge spikes in transaction fees when gas prices balloon and the floating rate spikes.","Derivative markets become liquid when they deliver real utility to hedgers while also attracting speculators to take risk. All of the elements of deep, liquid derivatives markets are abundantly present in the crypto economy with the introduction of standardized staking rates. Cleared staking rate swaps and listed futures have the added benefit of mitigating counterparty risk – a challenge across the crypto industry – by delivering segregation and central clearing, while DeFi derivatives and perpetual swaps can also play a role in hedging and speculating going forward. Basis swaps can serve as a new on-ramp for investors who have a view of the relative trajectory of traditional interest rate yields versus those of staking rates.","Standardized staking rates will play a crucial role in new financial products. While a spot ether ETF would be welcomed in U.S. markets, investors will demand a total-return ether ETF powered by standardized staking rates. A new class of structured products can help investors benefit from the real yield offered by staked ether, which, as a sometimes non-inflationary asset, competes nicely with many of its traditional peers.","See also: Ether Turns Inflationary as Network Usage Slows","With nearly infinite use cases, standardized staking rates will give rise to a new staking economy. Like traditional interest rates, they promise to unlock a new era of innovation across the crypto ecosystem as a new staking economy is born. As a forward curve emerges, staking rates can also be used to inform valuations as a discount rate, calculate Sharpe ratios and do everything that its fiat interest rate peers can do without the need for central control. The time has come for standardized staking rates."],"entity":[{"type":"trillions of dollars","content":"MONEY"},{"type":"CoinFund","content":"ORGANIZATION"},{"type":"Federal Open Market Committee (FOMC","content":"ORGANIZATION"},{"type":"fiat","content":"ORGANIZATION"},{"type":"U.S.","content":"LOCATION"},{"type":"Sharpe","content":"PERSON"},{"type":"$500 trillion","content":"MONEY"},{"type":"Ether Turns Inflationary as Network Usage Slows","content":"ORGANIZATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"United States","content":"LOCATION"},{"type":"CoinDesk Indices","content":"ORGANIZATION"},{"type":"Christopher Perkins","content":"PERSON"}],"hashtag":["Opinion","Staking week 2023"],"authors":["Christopher Perkins"]}