{"summary":"One critic says the bill alters the fundamental nature of an automated computer program.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/policy\/2023\/03\/14\/eu-parliament-passes-bill-requiring-smart-contracts-to-include-kill-switch\/","publishDate":"2023-03-14T12:30:51","id":15474,"type":null,"title":"EU Parliament Passes Bill Requiring Smart Contracts to Include Kill Switch","category":["Policy"],"content":["The European Parliament on Tuesday voted in favor of new data controls that could require that smart contracts include details of a kill switch to reset activity.","A 2022 European Union bill known as the Data Act included provisions intended to give people more control over information from smart devices, but has generated concerns in the Web3 community.","On Tuesday, 500 EU lawmakers voted in favor of the bill, 23 against, with 110 not voting.","“The new rules will empower consumers and companies by giving them a say on what can be done with the data generated by the connected products,” lead lawmaker Pilar del Castillo Vera said during the debate on the bill.","Provisions included in del Castillo Vera's redraft of the bill would mean that smart contracts must have to have access controls and protect trade secrets. They would also need to have functions to stop or reset – something that experts worry could undermine their purpose.","Not all agree with the bill.","“Article 30, as currently drafted, goes a step too far in addressing the issues raised by immutability,” Thibault Schrepel, an associate professor at VU Amsterdam University, tweeted ahead of the vote. “It endangers smart contracts to an extent that no one can predict.”","Schrepel, a specialist in blockchain legal issues, believes that the legal text is unclear about who in practice would have to hit the kill switch on a smart contract and that it interferes with the fundamental principle that the automated programs can’t be altered by anyone.","The vote empowers del Castillo Vera and other lawmakers to negotiate with governments in the EU member countries to hammer out a final version of the law.","Read more: Lawmakers Overwhelmingly Back EU's MiCA Crypto Law in Committee Vote"],"entity":[{"type":"Thibault Schrepel","content":"PERSON"},{"type":"Tuesday","content":"DATE"},{"type":"Pilar del Castillo Vera","content":"PERSON"},{"type":"2022","content":"DATE"},{"type":"Castillo Vera","content":"PERSON"},{"type":"EU","content":"ORGANIZATION"},{"type":"Schrepel","content":"PERSON"},{"type":"European Union","content":"ORGANIZATION"},{"type":"VU Amsterdam University","content":"ORGANIZATION"},{"type":"MiCA Crypto Law in Committee Vote","content":"ORGANIZATION"}],"hashtag":["Regulations","European Parliament","smart contracts","EU"],"authors":["Jack Schickler"]}