{"summary":"The so-called wealth effect from unrealized crypto-market gains, which is estimated to be stronger than stocks, could boost consumer spending and inject demand-pull inflation into the U.S. economy.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2024\/03\/05\/bitcoins-price-rally-may-add-to-inflation-heres-why\/","publishDate":"2024-03-05T11:31:41","id":15487,"type":null,"title":"Bitcoin's Price Rally May Add to Inflation. Here's Why","category":["Markets"],"content":["Bitcoin's (BTC) bull run could add to inflation in the U.S. economy, making it harder for the Federal Reserve to cut interest rates this year.","The leading cryptocurrency by market value has gained over 50% in 2024 already, extending last year's 155% surge to trade within striking distance of record highs near $69,000. Ether (ETH) has also surged, and the CoinDesk 20 Index, a broader market gauge, has jumped 57% this year. The total crypto market capitalization has added 53% to $2.64 trillion.","The crypto market, which began as a niche segment for technology-savvy investors, has evolved into a mature asset class over the past three years, thanks to a decision by software developer MicroStrategy and other corporations to add bitcoin to their balance sheets as well as the successful launch of U.S.-listed futures and spot-based bitcoin exchange-traded funds.","A 2023 paper by Harvard Business School's Marco Di Maggio and his team of economists estimated that the marginal propensity to consume – the amount spent on consumption for each additional dollar earned – out of unrealized crypto market gains is double that of stocks. That means a sharp rally in crypto prices, like the current one, can lead to a wealth effect that injects inflation into the economy by creating extra demand.","\"The rise in bitcoin and ETH and alts is inflationary as it creates more money-like assets and a strong wealth effect for young people with a high marginal propensity to spend,\" Brent Donelly, president of Spectra Markets, said on X.","The wealth effect is a behavioral economics concept that says that individuals, households and businesses spend more when the value of their financial assets rises. That increased spending is financed, essentially, by wealth created out of thin air – asset price gains. However, it adds to demand-side forces in the economy, putting upward pressure on prices.","The Fed and other central banks exploited the wealth effect to help handle the financial crash of 2008 and Covid hit of 2020, using unlimited bond purchases and zero-interest-rate policies to target the \"asset prices and the wealth effect channel,\" the study said. That helped shore up consumption and lift domestic inflation rates toward the 2% target.","According to the Harvard study, crypto investors are everyday investors seeking to diversify their portfolios, leading to a wealth effect that is more pronounced in the housing sector.","\"Crypto wealth causes house price appreciation—counties with higher crypto wealth see higher growth in home values following high crypto returns,\" the study said.","Over the years, the stock market has become more concentrated in the hands of the wealthy, which limits the wealth effect of an equities rally to luxury goods. In contrast, the market for alternative cryptocurrencies is dominated by retail investors. As such, sharp rallies in altcoins could affect the general price level in the economy.","That said, the crypto market isn't the only asset class on the move. The U.S. stock market has also jumped with both the broad-based S&P 500 and tech-heavy Nasdaq Composite indexes hitting record highs in recent days.","\"Both are creating a simultaneous inflationary wealth effect for two wildly different demographics that believe in two wildly different narratives,\" Spectra Markets' Donelly said on X, explaining the inflationary impact of the crypto-market rally.","\n","In December, the Fed said it would make three quarter-point interest-rate cuts by the end of 2024, bringing the benchmark borrowing cost down to 4.6%.","However, spillover effects from the crypto and stock market rallies might force the central bank to walk back on its estimates and hold rates higher for longer.","The central bank raised rates by 525 basis points between March 2022 and July 2023 to tame growth in the consumer price index, which had risen as high as 9.1% in mid-2022. As of January, the inflation rate on an annual basis stood at 3.1%.","Edited by Sheldon Reback."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"Sheldon Reback","content":"PERSON"},{"type":"Brent Donelly","content":"PERSON"},{"type":"U.S.","content":"LOCATION"},{"type":"Spectra Markets","content":"ORGANIZATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"Donelly","content":"PERSON"},{"type":"50%","content":"PERCENT"},{"type":"three quarter","content":"DATE"},{"type":"$2.64 trillion","content":"MONEY"},{"type":"57%","content":"PERCENT"},{"type":"Harvard Business School","content":"ORGANIZATION"},{"type":"Harvard","content":"ORGANIZATION"},{"type":"9.1%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"4.6%","content":"PERCENT"},{"type":"Marco Di Maggio","content":"PERSON"},{"type":"January","content":"DATE"},{"type":"53%","content":"PERCENT"},{"type":"3.1%","content":"PERCENT"},{"type":"$69,000","content":"MONEY"},{"type":"December","content":"DATE"},{"type":"2008","content":"DATE"},{"type":"March 2022","content":"DATE"},{"type":"155%","content":"PERCENT"},{"type":"S&P","content":"ORGANIZATION"},{"type":"Nasdaq Composite","content":"ORGANIZATION"},{"type":"2020","content":"DATE"},{"type":"MicroStrategy","content":"ORGANIZATION"},{"type":"July 2023","content":"DATE"}],"hashtag":["Analysis","Bitcoin","Markets","Inflation","US","Federal Reserve","Economy"],"authors":["Omkar Godbole"]}