{"summary":"Bitcoin is reapproaching all-time highs in Argentina following pro-bitcoin libertarian Javier Milei’s victory in the country’s presidential election last night.\nArgentina’s new president-elect previously spoke positively about bitcoin, calling it “the return of money to its original creator — the private sector.”","author":["James Hunt","The Block"],"webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/263747\/bitcoin-nears-all-time-high-argentina-javier-milei-wins-presidential-election","publishDate":"2023-11-20T06:26:42","id":1548,"type":null,"title":"Bitcoin nears all-time high in Argentina after Milei wins presidential election","category":["Markets"],"content":["The price of bitcoin in Argentina is reapproaching all-time highs after pro-bitcoin libertarian Javier Milei’s victory in the country’s presidential election last night.","<span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">Bitcoin <\/span><span class=\"articleTooltip\" data-v-baf5685a=\"\" data-v-f87c67ca=\"\"><a href=\"\/price\/248348\/bitcoin-btc-usd\" class=\"articleTooltip__link\" data-v-baf5685a=\"\"><img src=\"https:\/\/www.tbstat.com\/wp\/uploads\/2023\/10\/bitcoin.png\" alt=\"\" title=\"\" class=\"articleTooltip__tokenImage\" data-v-baf5685a=\"\"> <span class=\"articleTooltip__tokenText\" data-v-baf5685a=\"\">BTC<\/span> <span class=\"articleTooltip__tokenText articleTooltip__tokenText_price articleTooltip__tokenText_positive\" data-v-baf5685a=\"\">\n      +0.36%\n    <\/span><\/a> <!----><\/span><\/span> jumped 2% from around 13 million to 13.2 million Argentine pesos following the announcement before consolidating. It is currently trading at 13.17 million Argentine pesos, according to CoinGecko <\/span><a href=\"https:\/\/www.coingecko.com\/en\/coins\/bitcoin\" data-v-f87c67ca=\"\">data<\/a>.","The price rise did not quite take bitcoin to new all-time highs in the country — 13.37 million Argentine pesos. That figure was set on Thursday, Nov. 16, coinciding with Milei becoming the strongly favored candidate on the decentralized prediction platform Polymarket.","It also did not rise as significantly as when <a href=\"https:\/\/www.theblock.co\/post\/247834\/bitcoin-adoption-el-salvador-argentina-ark-invest\" data-v-f87c67ca=\"\">Milei won the country’s summer primaries<\/a> on Aug. 13, soaring more than 20% to 10.2 million Argentine pesos within 24 hours.","Bitcoin is also up 1.5% over the last 24 hours in U.S. dollar terms, currently trading at $37,215, according to The Block’s <a href=\"https:\/\/www.theblock.co\/price?range=1D\" data-v-f87c67ca=\"\">price data<\/a>.","When asked about the potential for bitcoin as a monetary alternative in an <a href=\"https:\/\/www.youtube.com\/watch?v=8H2ixCTphNM\" data-v-f87c67ca=\"\">interview<\/a> with the Argentine newspaper <em data-v-f87c67ca=\"\">Clarín<\/em> last year, “The first thing we have to understand is that the central bank is a scam. It is a mechanism by which politicians cheat good people with an inflationary tax,” Milei said.","“What bitcoin is representing is the return of money to its original creator — the private sector,” he continued. “Bitcoin has an algorithm that one day it will reach a certain amount and there is no more and it can compete with other currencies, but the problem is that governments will not give up the legal tender. Bitcoin is the natural reaction against central bank scammers and to make the money private again.”","However, despite some drawing parallels with El Salvador President Nayib Bukele, who oversaw his country giving <a href=\"https:\/\/www.theblock.co\/post\/107699\/el-salvador-becomes-the-first-country-ever-to-make-bitcoin-legal-tender\" data-v-f87c67ca=\"\">bitcoin legal tender<\/a> status in 2021, Milei does not seem to favor bitcoin as legal tender either. Instead, the president-elect campaigned on eliminating Argentina’s central bank and dollarizing a devastated economy that has witnessed multiple debt defaults and <a href=\"https:\/\/tradingeconomics.com\/argentina\/inflation-cpi\" data-v-f87c67ca=\"\">inflation soaring<\/a> to nearly 150%.","With 99% of votes counted, Milei won 55.7% of support compared to 44.3% for Argentina’s current economy minister, Sergio Massa, <a href=\"https:\/\/www.bloomberg.com\/news\/live-blog\/2023-11-19\/argentina-presidential-runoff-election\" data-v-f87c67ca=\"\">according<\/a> to Bloomberg.","“Today is the beginning of the end of Argentina’s decadence,” Milei said in his victory speech, local media <a href=\"https:\/\/www.batimes.com.ar\/news\/argentina\/president-elect-javier-milei-vows-to-end-argentine-decadence-in-victory-speech.phtml\" data-v-f87c67ca=\"\">reported<\/a>. “We’ll start doing things that history has shown works, and within 35 years, we’ll return to being a world power.”","Several prominent bitcoiners <a href=\"https:\/\/x.com\/lopp\/status\/1726379101290656087?s=20\" data-v-f87c67ca=\"\">congratulated<\/a> Milei on X. “It’s time to try something different. Change is coming, and with it volatility. Let’s see if he stays true to his word and abolishes the central bank,” BitMEX co-founder Arthur Hayes <a href=\"https:\/\/x.com\/CryptoHayes\/status\/1726379535082696764?s=20\" data-v-f87c67ca=\"\">said<\/a>. “Bitcoin is hope for Argentina. Congratulations Javier Milei,” MicroStrategy founder Michael Saylor <a href=\"https:\/\/x.com\/saylor\/status\/1726407355103899977?s=20\" data-v-f87c67ca=\"\">added<\/a>.","Jubilant scenes among Milei’s supporters followed his victory announcement, with some appearing to <a href=\"https:\/\/x.com\/LukeMikic21\/status\/1726387863917375520?s=20\" data-v-f87c67ca=\"\">rip up<\/a> Argentine peso bills to use as confetti in their celebrations. However, others <a href=\"https:\/\/www.theguardian.com\/world\/2023\/nov\/19\/argentina-presidential-election-javier-milei-sergio-massa#:~:text=That%20view%20was%20echoed%20on,unstable%20than%20Bolsonaro%20and%20Trump.\" data-v-f87c67ca=\"\">warned<\/a> that Milei’s presidency could lead to economic “devastation” and “social chaos.”","Milei will assume office on Dec. 10."],"hashtag":["BITCOIN"]}