{"summary":"Stubbornly high inflation has shattered Wall Street expectations for a long series of rate cuts in 2024.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/business\/2024\/04\/10\/us-cpi-comes-in-faster-than-hoped-rising-04-in-march\/","publishDate":"2024-04-10T12:36:28","id":15482,"type":null,"title":"U.S. CPI Comes in Faster Than Hoped, Rising 0.4% in March, 3.5% Y\/Y","category":["Finance"],"content":["Inflation data once again has disappointed, with the Consumer Price Index (CPI) for March rising more than anticipated and casting doubt on hopes for a Fed rate cut at some point this summer.","The CPI for March rose 0.4% versus expectations for 0.3% and February's 0.4%. On a year-over-year basis, CPI was up 3.5% versus 3.4% expected and 3.2% in February.","The core CPI, which excludes food and energy costs, rose 0.4% in March versus 0.3% anticipated and 0.4% the previous month. Year-over-year core CPI was up 3.8% versus 3.7% expected and 3.8% in February.","The price of bitcoin (BTC) fell more than 1% to $68,200 in the minutes following the report.","Traditional markets aren't taking the numbers well either, with S&P 500 and Nasdaq 100 futures both tumbling about 1.5%. The 10-year U.S. Treasury yield has shot higher by 13 basis points to 4.50% and the dollar index has rinse a sizable 0.5%. Gold, which has been carving out new record highs on nearly a daily basis of late, is down 0.5% to $2,352 per ounce.","In addition to the spot ETFs and the halving, easier U.S. monetary policy was expected to be one of the bullish catalysts for bitcoin in 2024. Markets came into the year having priced in about 5 or 6 Federal Reserve rate cuts in 2024, but inflation – which fell steadily through much of 2022 and 2023 – hasn't cooperated. It's actually risen a bit through the first quarter and remains well above the U.S. central bank's 2% target.","A series of Fed members have made clear they're not inclined to begin easing monetary policy until seeing a sustained path, i.e., more than just one monthly report, of inflation trending downward. Traders, meanwhile, have quickly whittled away their expectations of rate cuts, and prior to this morning's report had priced in just two or three for the full year, according to the CME FedWatch Tool, with the first move coming in June or July. Following the new inflation data, the tool now shows September as the most likely time for an initial rate cut."],"entity":[{"type":"Federal Reserve","content":"ORGANIZATION"},{"type":"this morning","content":"TIME"},{"type":"U.S.","content":"LOCATION"},{"type":"Fed","content":"ORGANIZATION"},{"type":"U.S. Treasury","content":"ORGANIZATION"},{"type":"3.8%","content":"PERCENT"},{"type":"2%","content":"PERCENT"},{"type":"BTC","content":"ORGANIZATION"},{"type":"CME FedWatch Tool","content":"ORGANIZATION"},{"type":"3.4%","content":"PERCENT"},{"type":"0.5%","content":"PERCENT"},{"type":"3.2%","content":"PERCENT"},{"type":"July","content":"DATE"},{"type":"0.3%","content":"PERCENT"},{"type":"September","content":"DATE"},{"type":"$68,200","content":"MONEY"},{"type":"3.7%","content":"PERCENT"},{"type":"2022","content":"DATE"},{"type":"3.5%","content":"PERCENT"},{"type":"2023","content":"DATE"},{"type":"2024","content":"DATE"},{"type":"1.5%","content":"PERCENT"},{"type":"February","content":"DATE"},{"type":"0.4%","content":"PERCENT"},{"type":"4.50%","content":"PERCENT"},{"type":"first quarter","content":"DATE"},{"type":"March","content":"DATE"},{"type":"S&P","content":"ORGANIZATION"},{"type":"$2,352","content":"MONEY"},{"type":"June","content":"DATE"},{"type":"1%","content":"PERCENT"},{"type":"summer","content":"DATE"},{"type":"Nasdaq","content":"ORGANIZATION"}],"hashtag":["Inflation","CPI","Bitcoin","Interest Rates"],"authors":["Stephen Alpher"]}