{"summary":"MYX, founded only earlier this year, has also drawn backing from Consensys, Hack VC, OKX Ventures and Redpoint Ventures.","webName":"theblock.co","link":"https:\/\/www.theblock.co\/post\/262545\/crypto-derivatives-protocol-myx-raises-5-million-in-seed-led-by-sequoia-china","publishDate":"2023-11-28T07:35:03","id":1548,"type":null,"title":"Crypto derivatives protocol MYX raises $5 million in seed round led by HongShan","category":["DEALS"],"content":["<span data-v-f87c67ca=\"\">MYX, an Asia-based crypto derivatives protocol, raised $5 million in a seed round at a valuation of $50 million.<\/span>","<span data-v-f87c67ca=\"\">The funding round was led by HongShan (formerly known as Sequoia China), with participation from investors including Consensys, Hack VC, OKX Ventures, Redpoint Ventures, Hashkey Capital, Foresight Ventures, GSR Markets, Leland Ventures, Cypher Capital, Bing Ventures and Lecca Ventures, according to an announcement today.&nbsp;<\/span>","<span data-v-f87c67ca=\"\">Founded earlier this year by Mark Zhang, a former head of futures products at crypto exchange Huobi, MYX is decentralized derivative exchange that employs a s0-called&nbsp;peer-to-pool-to-peer model, and which “uses intelligent rates and exposure hedging mechanisms to ensure protocol stability and provide sustainable high returns,” it said in a July <\/span><a href=\"https:\/\/myxfinance.medium.com\/introducing-myx-revolutionary-derivatives-protocol-6dfd57ce5212\" data-v-f87c67ca=\"\"><span data-v-f87c67ca=\"\">blog post<\/span><\/a><span data-v-f87c67ca=\"\">.<\/span>","<span data-v-f87c67ca=\"\">Zhang, who serves as CEO of MYX, said in an interview with The Block that a major challenge faced by the industry is growing awareness and acceptance of decentralized derivative trading by users. “One significant reason for this is that existing products do not meet the trading needs of these users,” he said, adding that, with the newly raised capital, the team plans to work on user education while developing its trading tools.&nbsp;<\/span>","MYX said in a statement that its matching pool mechanism engine \"disrupts the traditional model\" as liquidity providers are exclusively exposed to net open interests under the engine. Such an approach \"empowers LPs to focus on adeptly managing and mitigating risks, rather than being tied to specific long or short positions or relying on traders' losses for gains.\"","Disclaimer: The Block is an independent media outlet that delivers news, research, and data. As of November 2023, Foresight Ventures is a majority investor of The Block. Foresight Ventures invests in <a href=\"https:\/\/www.foresightventures.com\/portfolio\" data-v-f87c67ca=\"\">other companies<\/a> in the crypto space. Crypto exchange Bitget is an anchor LP for Foresight Ventures. The Block continues to operate independently to deliver objective, impactful, and timely information about the crypto industry. Here are our current <a href=\"https:\/\/www.theblock.co\/financial-disclosures\" data-v-f87c67ca=\"\">financial disclosures<\/a>.","© 2023 The Block. All Rights Reserved. This article is provided for informational purposes only. It is not offered or intended to be used as legal, tax, investment, financial, or other advice."],"entity":[{"type":"November 2023","content":"DATE"},{"type":"GSR","content":"ORGANIZATION"},{"type":"Mark Zhang","content":"PERSON"},{"type":"Sequoia China","content":"LOCATION"},{"type":"The Block","content":"ORGANIZATION"},{"type":"2023","content":"DATE"},{"type":"Hashkey Capital","content":"ORGANIZATION"},{"type":"Leland Ventures","content":"PERSON"},{"type":"Lecca Ventures","content":"ORGANIZATION"},{"type":"Foresight Ventures","content":"ORGANIZATION"},{"type":"July","content":"DATE"},{"type":"Asia","content":"LOCATION"},{"type":"OKX Ventures","content":"ORGANIZATION"},{"type":"Bing Ventures","content":"ORGANIZATION"},{"type":"Redpoint Ventures","content":"ORGANIZATION"},{"type":"Cypher Capital","content":"ORGANIZATION"},{"type":"Huobi","content":"PERSON"},{"type":"$5 million","content":"MONEY"},{"type":"$50 million","content":"MONEY"}],"hashtag":["DERIVATIVES","DEXS","SEED &AMP; PRE-SEED"],"authors":["Timmy Shen","The Block"]}