{"summary":"Russians are leaving their country and taking money with them, but crypto hasn't felt the impact – so far.","webName":"coindesk.com","link":"https:\/\/www.coindesk.com\/markets\/2022\/04\/11\/ukraine-crisis-is-not-propelling-crypto-market-activity-blockchain-data-shows\/","publishDate":"2022-04-11T08:59:29","id":15488,"type":null,"title":"Ukraine Crisis Is Not Propelling Crypto Market Activity, Blockchain Data Shows","category":["Markets"],"content":["The political and humanitarian crisis in Europe provoked by the Russian invasion of Ukraine created a massive tide of emigration from both countries. For many migrants and refugees, crypto has become the only tangible way to take their savings with them. However, that hasn't brought any notable boost to the crypto market, research shows.","Blockchain Analytics firm Crystal Blockchain monitored the hot wallets of the major cryptocurrency exchanges working with the Russian ruble and Ukrainian hryvnia, inluding peer-to-peer marketplaces like LocalBitcoins and Paxful, and found no significant fluctuations related to the war and migration.","It's important to remember that major global exchanges that used to support ruble trading pairs introduced their own sanctions against Russian users soon after the war started. For example, Binance stopped accepting payments via Russian bank cards, CEX.io suspended deposits and withdrawals for users from Russia and Belarus (Russia's ally in the war), CoinZoom paused registration of new accounts from Russia.","In early March, Alameda Research noticed that \"Russian and Ukrainian trade volumes [were] soaring.\" Crystal notes, however, that there hasn't been a notable spike of on-chain activity, and over the past six months there has been a steady decline in transaction activity across a range of cryptocurrency exchanges, with fund flows falling even more after the onset of war in Ukraine, Crystal told CoinDesk.","Chainalysis also noticed earlier that daily ruble trade volume soared immediately after the Russian invasion in Ukraine, \"growing over 900% to over $70 million between February 19 and 24, the highest it’s been since May 2021,\" but since then the activity has only been declining, with periodic spikes, the firm wrote in a blog post.","Chainlaysis also registered a notable activity spike for \"Russian whales,\" or crypto wallets with large balances that the firm attributed to Russian users. Those wallets sent over $62 million worth of cryptocurrency to other addresses during March, mostly associated with over-the-counter (OTC) desks and exchanges, Chainalysis wrote. However, it's hard to tell what this could mean and if the spending was somehow related to sanctions evasion, the firm added.","The Russian invasion of Ukraine created a crisis both outside and inside Russia's borders. While Ukrainians are leaving their destroyed homes for Poland and other European countries, Russians are hitting the road to escape persecution for their anti-war stance, as Russia introduced draconian censorship, criminalizing any public speech about the war that deviates from the official position.","According to some estimates, as many as 200,000 Russians could have left their homes over the past month, including independent journalists, political activists, artists, IT professionals and others, who disagree with the war and aggressive anti-Ukrainian propaganda in Russia. Many of them ended up in Georgia, Armenia, Turkey and other countries that do not require visas to entry.","But there they got hit by a different kind of persecution: Visa (V) and Mastercard (MA) suspended their operations in Russia, rendering debit cards of Russian banks useless abroad; payment companies like Western Union, Wise, Remitly and MoneyGram followed suit.","At the same time, Russia banned its citizens from taking more than $10,000 worth of foreign currency in cash with them as they cross the border. In addition to that, Russia banned foreign currency trading for six months on March 9.","This combination of financial censorship domestically and abroad underscores crypto as an important financial tool for the new wave of Russian emigrants, making it one of the few remaining ways to take their savings with them abroad and send money back home. Crypto will most likely get more popular among the Russian diaspora, but it will remain just one of the \"informal value transfer systems\" it will be using in the near future, Crystal said.","\n","\n"],"entity":[{"type":"Armenia","content":"LOCATION"},{"type":"Crystal Blockchain","content":"ORGANIZATION"},{"type":"May 2021","content":"DATE"},{"type":"Turkey","content":"LOCATION"},{"type":"Mastercard","content":"ORGANIZATION"},{"type":"MoneyGram","content":"ORGANIZATION"},{"type":"$62 million","content":"MONEY"},{"type":"Western Union","content":"ORGANIZATION"},{"type":"Georgia","content":"LOCATION"},{"type":"CoinDesk","content":"ORGANIZATION"},{"type":"900%","content":"PERCENT"},{"type":"$70 million","content":"MONEY"},{"type":"February 19","content":"DATE"},{"type":"Europe","content":"LOCATION"},{"type":"March","content":"DATE"},{"type":"$10,000","content":"MONEY"},{"type":"Belarus","content":"LOCATION"},{"type":"Russia","content":"LOCATION"},{"type":"Poland","content":"LOCATION"},{"type":"March 9","content":"DATE"},{"type":"Crystal","content":"ORGANIZATION"},{"type":"Alameda Research","content":"ORGANIZATION"},{"type":"Ukraine","content":"LOCATION"}],"hashtag":["Ukraine","Russia","war","Crypto"],"authors":["Anna Baydakova"]}